{
    "directions": [
        "Put oven rack in middle position and preheat oven to 400°F.",
        "If using whole coconut, pierce 2 softest eyes of coconut with a small screwdriver or a metal skewer, then drain and discard liquid. Bake whole coconut 15 minutes. Break shell with a hammer and remove flesh, levering it out carefully with screwdriver or point of a strong knife. Finely shred enough coconut to measure 1 cup using the 1/8-inch-wide holes of a box grater.",
        "Finely grind mustard seeds with a pinch of salt in grinder. Finely chop whole chile (without slit) and mash in mortar with pestle along with ground mustard seeds and a pinch of salt until chile is finely ground. Add 1 tablespoon water. Mix to a paste. (Alternatively, very finely chop chile, then stir with mustard seeds and water to form a paste.)",
        "Toss shrimp with turmeric and salt.",
        "Heat oil in wok over moderately high heat until hot but not smoking. Sauté shrimp, stirring, until it just turns pink, 2 to 3 minutes. Add grated coconut, mustard paste, remaining 6 chiles, and remaining 2 tablespoons water. Sauté, stirring, until water is absorbed and shrimp are well coated, about 2 minutes more."
    ],
    "ingredients": [
        "1 small coconut or 1 cup thawed frozen grated coconut",
        "2 tablespoons brown mustard seeds",
        "7 small fresh Thai chiles (2 to 3 inches; preferably green), 6 slit lengthwise on one side(not all the way through)",
        "3 tablespoons water",
        "1 lb large shrimp in shell (21 to 25 per pound), peeled, leaving tail and first segment of shell intact, and deveined",
        "1 teaspoon ground turmeric",
        "1 teaspoon salt",
        "3 tablespoons vegetable oil",
        "Special equipment: an electric coffee/spice grinder; a mortar and pestle (optional); a wok"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Mustard",
        "Shellfish",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Coconut",
        "Seafood",
        "Shrimp",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sauteed Shrimp with Coconut and Mustard",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-shrimp-with-coconut-and-mustard-232978"
}
