{
    "directions": [
        "Preheat oven to 325°F. Lay endives, cut sides down, in large shallow pan or braising dish with lid. Sprinkle with salt, pour in stock, and arrange orange pieces around pan. Cover and braise until tender, about 25 minutes. (Endive can be prepared 1 day ahead. Cool to room temperature and discard oranges, then refrigerate, covered, in braising liquid. To reheat, add 1/2 cup fresh chicken stock and simmer, covered, over moderate heat until warm, 5 to 10 minutes.)",
        "Preheat oven to 325°F. Coat ramekins or aluminum foil muffin cups with vegetable oil spray or brush with vegetable oil. In large pot combine celery root and cold salted water to cover. Bring to boil over high heat, then lower heat and simmer, uncovered, until tender, about 25 minutes.",
        "While celery root is simmering, in small saucepan over moderate heat, warm cream until barely simmering (do not allow to boil), about 2 minutes.",
        "Force celery root through food mill. Transfer 1 1/2 cups celery root to blender, reserving any leftovers. Add hot cream and process on medium until creamy and smooth, about 1 minute. Add salt and process just until combined, about 10 seconds.",
        "In large bowl, lightly whisk egg yolks. Slowly add celery root purée, whisking constantly to avoid curdling. Strain mixture through fine-mesh sieve, then ladle into ramekins.",
        "Transfer ramekins to large roasting pan and add enough hot water to come halfway up sides of ramekins. Cover entire pan with foil, and using toothpick, poke small holes 3 inches apart all over surface of foil to allow steam to escape. Bake until flans are set, 20 to 25 minutes, then transfer ramekins to rack. (Flans can be prepared up to 2 days ahead. Refrigerate in ramekins, tightly wrapped, then reheat in large roasting pan filled with hot water in 325°F oven until warm, about 5 minutes.)",
        "In small saucepan, combine garlic cloves and cold water to cover by 2 inches. Bring to a boil, then drain, add fresh cold water, and bring to boil again. Drain, add wine, and bring to a boil, then lower heat and simmer until liquid is reduced by 1/2, 2 to 3 minutes. Add chicken stock and bring to boil, then lower heat and simmer until liquid is reduced by 1/2, about 5 minutes. Transfer to blender, add butter and salt, and blend on medium until smooth, about 1 minute. Pour through fine-mesh strainer into small saucepan, cover, and keep warm over very low heat, until ready to use. Whisk before serving.",
        "Heat cast-iron or stainless-steel pan over high heat until almost smoking, then add 1 tablespoon canola oil. Sprinkle 4 fillets on both sides with salt and transfer, skinned-sides-up (there will be a rosy-colored stripe running up the center of the fish where the backbone was) to pan. Add 1 tablespoon butter and sear, without moving, until undersides are golden brown, about 2 minutes. Turn fillet over, lower heat to moderately high, and continue cooking until just opaque, less than 1 minute. Transfer to paper towel–lined plate to drain, wipe pan clean, and cook remaining fish in same manner.",
        "Transfer 2 endive halves to center of each plate. Run small, thin knife or offset spatula around inside edges of ramekins to loosen flans, then turn 1 out onto side of each plate. Spoon garlic nage over endive and top with turbot. Grate 1 teaspoon truffle over each fillet and serve immediately."
    ],
    "ingredients": [
        "8 heads Belgian endive, halved lengthwise",
        "4 1/2 teaspoons kosher salt",
        "1/2 cup chicken stock or low-sodium chicken broth",
        "1 orange, cut into 8 pieces",
        "Nonstick vegetable oil spray or 2 tablespoons vegetable oil",
        "1 large or 2 small celery roots (2 pounds total), peeled and diced",
        "1 cup heavy cream",
        "3/4 teaspoon kosher salt",
        "4 large egg yolks",
        "6 cloves garlic, peeled",
        "1/2 cup white wine such as Chardonnay",
        "1 cup chicken stock or low-sodium chicken broth",
        "6 tablespoons unsalted butter",
        "1/4 teaspoon kosher salt",
        "2 tablespoons canola oil",
        "8 (5-ounce) turbot fillets,* skinned",
        "1 teaspoon kosher salt",
        "2 tablespoons unsalted butter",
        "1 small frozen black truffle,* defrosted",
        "*Chef Neal Fraser uses Chilean or European Turbot. If neither is available, gray sole or lemon sole can be substituted.",
        "**Available at some supermarkets and specialty shops or at earthy.com.",
        "8 (2-ounce) ramekins or aluminum foil muffin cups"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Fish",
        "Garlic",
        "Mushroom",
        "Braise",
        "Valentine's Day",
        "Dinner",
        "Bass",
        "Celery",
        "Fall",
        "Anniversary",
        "Endive",
        "Boil",
        "Ramekin",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sauteed Turbot with Braised Endive, Celery Root Flan, Black Truffles, and Garlic Nage",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-turbot-with-braised-endive-celery-root-flan-black-truffles-and-garlic-nage-350390"
}
