{
    "directions": [
        "Heat miso in a large skillet over medium, stirring constantly, until it starts to caramelize and brown (it will be very dark), about 3 minutes. Add mirin and vinegar, scraping up any browned bits. Reduce heat to low and, stirring constantly, add butter one piece at a time; stir until emulsified. Transfer miso butter to a small bowl and set aside.",
        "Wipe out skillet. Heat oil over medium and cook garlic, smashing with a spoon, until golden brown and broken into bits, about 4 minutes. Using a slotted spoon, transfer garlic to a small bowl; season with salt.",
        "Working in batches, add collard greens to same skillet, tossing and letting them wilt slightly before adding more; season with salt and pepper. Cook, tossing occasionally, until all greens are wilted, bright green, and crisp-tender, about 5 minutes. Add half of reserved miso butter and toss to coat.",
        "Transfer collard greens to a large serving bowl and drizzle with remaining miso butter. Top with reserved garlic and squeeze lemon over."
    ],
    "ingredients": [
        "2 tablespoons white miso",
        "2 tablespoons mirin (sweet Japanese rice wine)",
        "2 tablespoons unseasoned rice vinegar",
        "1/4 cup (1/2 stick) unsalted butter, cut into pieces",
        "3 tablespoons vegetable oil",
        "4 garlic cloves, crushed",
        "Kosher salt",
        "2 large bunches collard greens, ribs and stems removed, leaves torn into large pieces (about 8 cups)",
        "Freshly ground black pepper",
        "1 lemon, quartered"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Sauté",
        "Thanksgiving",
        "Winter",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Sautéed Collard Greens with Caramelized Miso Butter",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-collard-greens-with-caramelized-miso-butter-51255100"
}
