{
    "directions": [
        "Rinse and drain scallops; pat dry with paper towels. Sprinkle with fleur de sel and pepper. Heat 2 tablespoons oil in large skillet over medium-high heat. Add scallops; sauté until browned outside and just opaque in center, about 2 minutes per side. Transfer scallops to plate; cover. Add 1 tablespoon oil to same skillet; add white parts of green onions and sauté until almost tender, about 1 minute. Add tomatoes and green parts of onions and sauté until tomatoes begin to burst and release juices, about 5 minutes. Stir in 3 tablespoons parsley, lemon juice, and paprika. Return scallops and any accumulated juices to skillet and stir just until heated through, about 1 minute. Season with salt and pepper. Transfer scallop mixture to platter. Drizzle with 1 tablespoon oil and sprinkle with 1 tablespoon chopped fresh parsley."
    ],
    "ingredients": [
        "1 1/2 pounds large sea scallops, side muscles removed",
        "Fleur de sel or coarse kosher salt",
        "4 tablespoons extra-virgin olive oil, divided",
        "4 large green onions, chopped, white and green parts separated",
        "1 12-ounce container cherry tomatoes or grape tomatoes",
        "4 tablespoons coarsely chopped fresh Italian parsley, divided",
        "3 tablespoons fresh lemon juice",
        "1/2 teaspoon mild Spanish paprika (pimentn dulce)* or Hungarian sweet paprika",
        "*Available at specialty foods stores and online from tienda.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Herb",
        "Onion",
        "Shellfish",
        "Tomato",
        "Sauté",
        "Dinner",
        "Seafood",
        "Scallop",
        "Summer",
        "Healthy",
        "Parsley",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sauted Scallops with Cherry Tomatoes, Green Onions, and Parsley",
    "url": "http://www.epicurious.com/recipes/food/views/sauted-scallops-with-cherry-tomatoes-green-onions-and-parsley-235592"
}
