{
    "directions": [
        "In a large saucepan over moderate heat, combine the purple cauliflower, cream, and butter and slowly bring to a simmer. Continue to simmer until the cauliflower is soft. Transfer the cauliflower to a food processor or blender, reserving the cooking liquid, and process, adding the cooking liquid as necessary, until completely smooth. Discard any leftover cooking liquid. With the food processor or blender on low, slowly drizzle in the oil, blending until smooth. Season with salt and keep warm.",
        "In a large saucepan over moderate heat, combine the yellow cauliflower, cream, and butter and slowly bring to a simmer. Continue to simmer until the cauliflower is soft. Transfer the cauliflower to a food processor or blender, reserving the cooking liquid, and process, adding the cooking liquid as necessary, until completely smooth. Discard any leftover cooking liquid. With the food processor or blender on low, slowly drizzle in the oil, blending until smooth. Season with salt and keep warm.",
        "In a medium saucepan, bring the chicken stock to a boil. Remove from the heat then add the couscous, stir, cover, and let sit for 5 minutes. Using a fork, fluff the couscous then fold in the apple and sesame seeds. Cover and keep warm.",
        "In a small bowl, stir together the salt and curry powder.",
        "In a large skillet over moderately high heat, warm the oil until hot but not smoking. Sear the scallops, flipping once, until deep golden brown on both sides and just cooked through, about 2 minutes per side. Cut each scallop in half horizontally and season with the curry salt.",
        "Divide the purple and yellow cauliflower purées among 4 plates. Arrange a scoop of couscous on 1 side of each plate. Arrange 6 scallops halves on the other side of each plate. Garnish with the lime wedges and wakame seaweed, if desired."
    ],
    "ingredients": [
        "1 head purple cauliflower, cut into 1-inch pieces",
        "1 cup heavy cream",
        "1 tablespoon unsalted butter",
        "1 cup olive oil",
        "Fine sea salt",
        "1 head yellow cauliflower, cut into 1-inch pieces",
        "1 cup heavy cream",
        "1 tablespoon unsalted butter",
        "1 cup olive oil",
        "Fine sea salt",
        "2 cups chicken stock or low-sodium chicken broth",
        "1 cup couscous",
        "1 green apple, peeled, cored, and diced",
        "1 tablespoon black sesame seeds, toasted",
        "1/2 cup fine sea salt",
        "1/4 cup Madras curry powder",
        "1 tablespoon olive oil",
        "12 sea scallops (about 1 pound)",
        "3 limes, cut into wedges",
        "1/2 cup purchased wakame seaweed (optional)",
        "Food processor or blender"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Dinner",
        "Apple",
        "Seafood",
        "Scallop",
        "Cauliflower",
        "Couscous",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sautéed Sea Scallops with Apple-Sesame Couscous and Purple and Yellow Cauliflower Purées",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-sea-scallops-with-apple-sesame-couscous-and-purple-and-yellow-cauliflower-purees-51192820"
}
