{
    "directions": [
        "If tenders are attached to undersides of breast halves, remove white tendons from tenders with a small sharp knife. Working with 1 at a time, butterfly breast halves: Lay each breast half, skinned side up, lengthwise on a cutting board. Holding a sharp knife parallel to work surface and beginning on a long side, cut breast almost in half horizontally (not all the way through), then open it like a book.",
        "Cover opened breast halves with a piece of plastic wrap and gently pound each to an even 1/2-inch thickness with a meat pounder or rolling pin. Remove plastic wrap and cover each opened breast half with 1 slice of ham and 1 slice of cheese, tucking in any protruding ends. Brush edge of chicken with some egg, reserving remainder, then fold each breast in half to enclose ham and cheese.",
        "Pat chicken dry and sprinkle with salt and pepper.",
        "Heat 2 tablespoons butter in a 12-inch heavy skillet over moderately high heat until foam subsides. While butter is heating, quickly brush more egg onto seam of each breast again, then dredge breasts in flour, shaking off excess. Sauté chicken, turning over once, until golden and cooked through, about 8 minutes total. Transfer to a plate and keep warm, loosely covered with foil.",
        "Add remaining tablespoon butter to skillet, then sauté mushrooms and shallot, stirring, 1 minute. Add wine and deglaze skillet by boiling, stirring and scraping up brown bits, until wine is reduced by about half, 1 to 2 minutes. Add tomatoes and cook, stirring occasionally, until they begin to soften, 3 to 4 minutes. Add cream and simmer, stirring occasionally, until reduced by about half, about 6 minutes. Stir in any chicken juices accumulated on plate and season sauce with salt and pepper.",
        "Serve chicken topped with sauce."
    ],
    "ingredients": [
        "4 (6- to 8-ounce) skinless boneless chicken breast halves",
        "4 thin slices cooked ham (1/4 pound)",
        "4 thin slices Swiss cheese (3 ounces)",
        "1 large egg, lightly beaten",
        "1 teaspoon salt",
        "1/4 teaspoon black pepper",
        "3 tablespoons unsalted butter",
        "1/3 cup all-purpose flour",
        "1 pound small mushrooms, trimmed and quartered",
        "1 teaspoon finely chopped shallot",
        "1/3 cup dry white wine",
        "1 pound tomatoes, peeled, seeded, and diced",
        "1 cup heavy cream",
        "Garnish: finely chopped fresh flat-leaf parsley",
        "Accompaniments: watercress; cooked rice topped with truffle slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Mushroom",
        "Tomato",
        "Sauté",
        "Dinner",
        "Ham",
        "White Wine",
        "Fall",
        "Swiss Cheese",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sauteed Chicken Breasts Stuffed with Cheese and Ham",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-chicken-breasts-stuffed-with-cheese-and-ham-107197"
}
