{
    "directions": [
        "Wash jars, lids, and screw bands in hot soapy water, then rinse well. Dry screw bands. Put empty jars on a rack in a boiling-water canner or an 8- to 10-quart deep pot and add enough water to cover by 2 inches. Bring to a boil, covered, then boil 10 minutes. Remove canner from heat, leaving jars in water. Heat lids in water to cover by 2 inches in a small saucepan until thermometer registers 180°F (do not let boil). Remove from heat. Keep jars and lids submerged in hot water, covered, until ready to use.",
        "Pour 1/2 cup boiling-hot water over sage and turmeric in a cup and let steep, covered, 15 minutes. Pour sage water through a fine-mesh sieve into a bowl, pressing on solids, then add enough extra water to bring total to 1/2 cup.",
        "Carefully remove jars with tongs, then drain jars upside down on a clean kitchen towel.",
        "Bring sage water, Sauternes, sugar, salt, and bay leaf to a boil in a 2- to 2 1/2-quart heavy saucepan. Whisk in pectin until dissolved and bring to a boil. Boil 1 minute, then remove from heat. Invert jars. Immediately divide jelly among jars, leaving 1/4 inch of space at top. Wipe off rims of filled jars with a clean damp kitchen towel, then top with lids and firmly screw on screw bands.",
        "Put sealed jars on rack in canner or deep pot and add enough water to cover by 2 inches. Bring to a boil, covered, then boil 10 minutes. Transfer jars with tongs to a towel-lined surface to cool. Jars will seal; if you hear a ping, that means that the vacuum formed above the cooling jelly has made the lid concave. Remember that you may or may not be around to hear the ping. The important thing is for the jars to eventually have concave lids. Jelly will thicken as it cools.",
        "After jars have cooled 12 to 24 hours, press center of each lid to check that it's concave, then remove screw band and try to lift off lid with your fingertips. If you can't, the lid has a good seal. Replace screw band. Put any jars that haven't sealed properly in the refrigerator and use them first."
    ],
    "ingredients": [
        "1/2 cup boiling-hot water",
        "2 tablespoons chopped fresh sage",
        "Pinch of turmeric (for yellow color; optional)",
        "1 1/2 cups Sauternes (from a 375-ml bottle)",
        "3 1/2 cups sugar",
        "1/8 teaspoon salt",
        "1 Turkish or 1/2 California bay leaf",
        "1/2 cup liquid fruit pectin",
        "Special equipment: 4 (1/2-pint) canning jars with lids and screw bands; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Sauce",
        "Wine",
        "Chill",
        "Sage",
        "Boil",
        "Gourmet"
    ],
    "title": "Sauternes and Sage Jelly",
    "url": "http://www.epicurious.com/recipes/food/views/sauternes-and-sage-jelly-233575"
}
