{
    "directions": [
        "Place tamarind square in small bowl. Cover with boiling water and let stand until pulp softens, breaking apart occasionally with fork, about 45 minutes. Using slotted spoon, transfer tamarind pulp with seeds to strainer set over medium bowl. Press pulp through sieve, leaving seeds behind. Measure 2 teaspoons pulp for sauce (discard remaining pulp).",
        "Cook squash in medium saucepan of boiling salted water until tender, about 8 minutes. Drain squash. Return to same saucepan and mash to smooth puree.",
        "Cook guajillo chiles in medium saucepan of boiling water until tender, about 15 minutes. Drain, cool, stem, and seed chiles. Place chiles in blender. Add 1/2 cup water, lemongrass, shallot, ginger, garlic, and lime peel. Puree until chile paste is smooth. Transfer paste to medium saucepan. Whisk in coconut milk, fish sauce, brown sugar, and 2 teaspoons tamarind pulp. Add kabocha squash puree and bring to simmer, whisking often. Simmer until sauce is slightly thickened and flavors blend, whisking occasionally, about 4 minutes. Season sauce to taste with salt. (Can be made 3 days ahead. Cover and chill.)",
        "Bring medium pot of water to boil; salt generously. Add snow peas and cook just until crisp-tender, about 15 seconds. Using large slotted spoon, transfer peas to colander. Rinse with cold water and drain well. Repeat cooking, rinsing, and draining with each remaining vegetable in separate batches in same pot of boiling salted water until vegetables are just crisp-tender, about 1 minute for asparagus, about 3 minutes for eggplant and zucchini, and about 1 minute for bok choy leaves. Pat snow peas dry; cut on diagonal into thin strips. (Vegetables can be made 2 hours ahead. Let stand at room temperature.)",
        "Heat oil in heavy large pot over high heat. Add vegetables and toss until heated through, about 4 minutes. Season vegetables with salt and pepper.",
        "Bring sauce to simmer. Spoon 1/3 cup in center of each of 6 plates. Mound 1/16 of vegetables on each plate and serve.",
        "*Tamarind is a legume with large brown seedpods. The pulp is used in Indian, Thai, Caribbean, and Latin American cooking. The pulp is sold in block form and is available at Indian markets.",
        "**Guajillo chiles are maroon-colored, fairly hot dried chiles up to 6 inches long and 1 1/2 inches wide. Available at Latin American markets and some supermarkets.",
        "**Guajillo chiles are maroon-colored, fairly hot dried chiles up to 6 inches long and 1 1/2 inches wide. Available at Latin American markets and some supermarkets. ***Found at Asian markets and in the Asian foods section of many supermarkets."
    ],
    "ingredients": [
        "1 2-inch square tamarind with seeds* (from 7-ounce block)",
        "1 cup peeled cubed kabocha squash",
        "4 dried guajillo chiles**",
        "1/2 cup water",
        "1/4 cup finely chopped lemongrass (bottom 1 1/2 inches of about 4 peeled stalks)",
        "1 tablespoon minced shallot",
        "2 teaspoons finely chopped peeled fresh ginger",
        "2 garlic cloves, minced",
        "1 teaspoon (packed) grated lime peel",
        "1 cup canned unsweetened coconut milk",
        "2 tablespoons Thai fish sauce (nam pla)***",
        "1 tablespoon golden brown sugar",
        "36 snow peas, strings removed",
        "12 3-inch-long asparagus tops",
        "5 Thai or Japanese eggplants, halved lengthwise, then cut crosswise on diagonal into 1/2-inch-thick pieces",
        "3 medium zucchini, trimmed, halved lengthwise, then cut crosswise on diagonal into 1/2-inch-thick pieces",
        "4 heads of baby bok choy, leaves separated from base",
        "1/4 cup vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Pepper",
        "Appetizer",
        "Sauté",
        "Asparagus",
        "Eggplant",
        "Pea",
        "Squash",
        "Zucchini",
        "Fall",
        "Bok Choy",
        "Lemongrass",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sauteed Vegetables with Chile-Tamarind Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-vegetables-with-chile-tamarind-sauce-108537"
}
