{
    "directions": [
        "In a heavy saucepan, cook the butter and the flour over moderately low heat, whisking, for 3 minutes, whisk in the stock, and bring the mixture to a boil. Add the mushrooms, the garlic, and the bouquet garni and simmer the mixture, skimming the froth, for 25 minutes. Strain the mixture through a sieve into another heavy saucepan, stir in the ham, the sage, and the cream, and simmer the sauce until it is reduced to 3 cups. Add the pepper and salt to taste and keep the sauce warm, covered.",
        "Preheat the oven to 200ºF. In a large skillet, heat 2 tablespoons of the oil and 1 tablespoon of the butter over moderately hight heat until the foam subsides. White the fat is heating, pat 4 of the chicken breast halves dry, season one side of each breast with the pepper and salt to taste and, in the fat, brown the 4 breasts, seasoned sides down, for 1 minute. Reduce the heat to moderately low and cook the chicken for 3 minutes more on each side, or until it is cooked through. Transfer the cooked chicken to a baking pan and keep it warm in the oven. Wipe the skillet clean with paper towels and cook the remaining chicken breasts, patted dry and seasoned, in the remaining oil and butter in 2 batches in the same manner. Serve the chicken with the sauce and grits."
    ],
    "ingredients": [
        "1/2 stick (1/4 cup) unsalted butter",
        "1/4 cup all-purpose flour",
        "3 cups chicken stock or broth",
        "1/4 cup finely chopped mushrooms",
        "3 garlic cloves, or to taste",
        "A bouquet garni made by tying 3 parsley sprigs, 2 thyme sprigs, and 1/2 bay leaf in a cheesecloth bag.",
        "9 ounces country ham, cut into julienne trips (about 2 cups)",
        "2 tablespoons julienne strips of fresh sage",
        "6 tablespoons heavy cream",
        "White pepper to taste",
        "6 tablespoons peanut oil",
        "3 tablespoons unsalted butter",
        "6 (1-pound) whole chicken breasts, boned, skinned, and halved",
        "White pepper to taste",
        "Cheddar grits, to serve"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Gourmet",
        "Chicken",
        "Ham",
        "Sage",
        "Dinner",
        "Milk/Cream"
    ],
    "title": "Sautéed Chicken Breasts With Country Ham and Sage Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-chicken-breasts-with-country-ham-and-sage-sauce"
}
