{
    "directions": [
        "In a small bowl, pour the wine over the prunes and let soak for at least 1 hour or up to overnight.",
        "Trim the silver skin off the tenderloins. Cut the tenderloins into rounds about 3/4 inch thick. Season the rounds on both sides with salt and pepper.",
        "In a sauté pan just large enough to hold the rounds, heat the olive oil over high heat. When it smokes, add the pork rounds and brown, turning once, for about 3 minutes on each side, or until they feel firm to the touch. If they start to get too brown, turn down the heat. Transfer the pork rounds to a warmed platter and set aside in a warm spot. Pour the fat out of the pan.",
        "Drain the prunes, reserving the wine and prunes separately. Measure out 1/2 cup of the wine. Return the pan to high heat and add the 1/2 cup wine and the prunes. Deglaze the pan, scraping up any brown bits on the bottom of the pan with a wooden spoon, then stir in the meat glaze, if using. Boil until the wine is reduced by about half; if you have added the glaze, the sauce will develop a lightly syrupy consistency. Add the cream and boil until reduced to a light sauce consistency. Season with salt and pepper.",
        "Arrange the pork rounds on warmed plates and spoon the sauce and prunes over the top."
    ],
    "ingredients": [
        "1 cup dry or semisweet white wine",
        "1/2 pound pitted prunes",
        "2 pork tenderloins, about 1 pound each",
        "Salt",
        "Pepper",
        "3 tablespoons olive oil",
        "2 tablespoons meat glaze (see below)",
        "1/2 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Pork",
        "Sauté",
        "Dinner",
        "Prune",
        "Pork Tenderloin",
        "White Wine",
        "Fall",
        "Winter",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sautéed Pork Tenderloin with Prunes",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-pork-tenderloin-with-prunes-51119050"
}
