{
    "directions": [
        "In a large nonstick fry pan over medium-high heat, warm 1 Tbs. of the olive oil. Add the chard and season lightly with salt and pepper. Sauté until just softened, about 3 minutes. Transfer to a bowl and cover to keep warm.",
        "Season the scallops lightly with salt and pepper and dredge in flour to coat. In the same pan over medium-high heat, warm 1 Tbs. of the olive oil. Add the scallops and cook, turning once, until springy to the touch and no longer translucent in the center, about 3 minutes per side. Using tongs, transfer the scallops to a plate.",
        "Add the remaining 1 Tbs. olive oil to the pan and then add the shallot. Sauté until it begins to soften, about 1 minute. Add the wine and boil until almost evaporated, stirring to scrape up any browned bits, about 2 minutes. Add the broth, lemon juice, mustard and the 1/2 tsp. tarragon and boil until slightly thickened, about 2 minutes. Remove from the heat, add the butter and stir until melted. Season the sauce with salt and pepper.",
        "Spoon the rice into the center of 2 warmed plates and top with the chard. Arrange the scallops on top of the chard and spoon the sauce over all. Garnish with minced tarragon and the pecans and serve immediately. Serves 2.",
        "Quick Tips:",
        "If you have other hearty spring greens or even broccoli rabe on hand, they can be substituted for the chard. Also, fresh thyme would work as well as tarragon. This recipe can be easily doubled to serve more.",
        "Adapted from Williams-Sonoma",
        "Weeknight Fresh & Fast,",
        "by Kristine Kidd (Williams-Sonoma, 2011)."
    ],
    "ingredients": [
        "3 Tbs. olive oil",
        "1 small bunch, red or white chard, stems removed, leaves chopped",
        "Coarse kosher salt and freshly ground pepper, to taste",
        "3/4 lb. sea scallops",
        "All-purpose flour for dredging",
        "1 small shallot, minced",
        "1/4 cup dry white wine",
        "1/2 cup low-sodium chicken broth",
        "1 Tbs. fresh lemon juice",
        "1/2 tsp. Dijon mustard",
        "1/2 tsp. minced fresh tarragon, plus more for garnish",
        "1 Tbs. unsalted butter (optional)",
        "Cooked brown jasmine or basmati rice",
        "2 Tbs. toasted and chopped pecans (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Sautéed Scallops and Swiss Chard",
    "url": "http://www.williams-sonoma.com/recipe/sauteed-scallops-and-swiss-chard.html"
}
