{
    "directions": [
        "Fill an 8-quart pot three fourths full with salted water and bring to a boil. Plunge 2 lobsters headfirst into water and boil, covered, 3 minutes. Transfer with tongs to a colander to cool. Repeat with remaining 2 lobsters in same manner.",
        "When lobster is cool enough to handle, remove meat from shells, catching juices in a separate bowl. Add shells to bowl with juices. Cut meat into 1-inch pieces and chill lobster, covered.",
        "Stir together wine and saffron and let mixture steep 10 minutes. Bring wine mixture, 14 cups water, and lobster shells with juices to a boil in 8-quart pot. Boil until liquid is reduced to about 8 cups, about 1 hour. Line a sieve with cheesecloth and set over a bowl. Pour stock through sieve, then discard solids.",
        "While stock reduces, heat 2 tablespoons oil in a heavy skillet over low heat until hot, then cook onion with bay leaf until onion is very soft and browned, about 45 minutes. Add tomatoes and garlic and cook, stirring frequently, until sofregit is very thick, about 15 minutes. Discard bay leaf.",
        "Preheat oven to 400°F.",
        "Heat 1 tablespoon oil in a cassola or an ovenproof 12-inch heavy skillet over moderately low heat until hot but not smoking, then cook pasta in 4 batches, stirring, until golden brown. Transfer pasta to a bowl as browned and add an additional tablespoon oil for each batch.",
        "When all of pasta is browned, return to pan and stir in sofregit and 4 cups stock (if using a cassola, use 4Bõps stock; your need more liquid because of the dish's straight sides). Reserve remaining stock for another use. Bring pasta mixture to a simmer, then continue to simmer, covered, 4 minutes. Stir in reserved lobster and season with salt and pepper. Transfer pan, uncovered, to middle of oven and bake 10 minutes, or until liquid is absorbed and top of pasta is crisp. Stir in parsley."
    ],
    "ingredients": [
        "4 (1- to 1 1/4-pound) live lobsters",
        "1/2 cup dry white wine",
        "1/4 teaspoon crumbled saffron",
        "6 tablespoons olive oil",
        "1 large onion, sliced",
        "1 bay leaf",
        "1 1/2 pound vine-ripened tomatoes, peeled, seeded, and coarsely chopped",
        "2 garlic cloves, chopped",
        "1 pound angel's hair pasta nests or fideos (fideus in Catalan) coils, broken in half, or capellini, broken into 2-inch lengths",
        "2 tablespoons chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pasta",
        "Shellfish",
        "Tomato",
        "Sauté",
        "Lobster",
        "Saffron",
        "White Wine",
        "Spring",
        "Simmer",
        "Boil",
        "Gourmet"
    ],
    "title": "Sauteed Pasta with Lobster",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-pasta-with-lobster-103190"
}
