{
    "directions": [
        "Cut peel and white pith from orange with a sharp knife, then cut sections free from membranes. Squeeze 1 to 2 tablespoons juice from membranes before discarding and reserve. Cut sections into 1/4-inch dice and reserve separately.",
        "Quarter fennel bulb lengthwise and cut out and discard core. Cut quarters lengthwise into 3/4-inch-thick slices.",
        "Heat 1 1/2 tablespoons oil in a heavy skillet over moderately high heat until hot but not smoking, then sauté fennel with fennel seed and salt and pepper to taste, stirring, until edges are browned and fennel is wilted, about 10 minutes. Cook fennel over moderately low heat, covered, stirring occasionally, until tender, about 8 minutes more. Stir in reserved orange juice.",
        "While fennel cooks, pat fish dry and season with salt and pepper. Heat remaining tablespoon oil in a 9- to 10-inch nonstick skillet over moderately high heat until just starting to smoke, then sauté fish, skin sides down, until skins are golden, about 3 minutes. Turn fish over and sauté until just cooked through, about 3 minutes more.",
        "Sprinkle fish with lemon juice and serve, skin sides up, on top of fennel and orange dice."
    ],
    "ingredients": [
        "1 navel orange",
        "1 large fennel bulb (sometimes called anise), fronds reserved for garnish and stalks discarded",
        "2 1/2 tablespoons olive oil",
        "1/2 teaspoon finely chopped fennel seed",
        "2 (6-oz) red snapper fillets, with skin",
        "1 teaspoon fresh lemon juice, or to taste",
        "Garnish: chopped fennel fronds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Fruit",
        "Vegetable",
        "Sauté",
        "Dinner",
        "Orange",
        "Seafood",
        "Snapper",
        "Fennel",
        "Summer",
        "Winter",
        "Gourmet",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sauteed Red Snapper Fillets with Fennel and Orange",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-red-snapper-fillets-with-fennel-and-orange-104638"
}
