{
    "directions": [
        "Fill large bowl with cold water. Cut lemon in half; squeeze juice into water in bowl, then add lemon halves. Cut off stem and top quarter from 1 artichoke. Bend back dark green outer leaves and snap off at artichoke base until only pale green and yellow leaves remain. Cut artichoke lengthwise in half. Using point of knife, remove any purple-tipped leaves from center of artichoke. Place artichoke halves in lemon water. Repeat with remaining artichokes.",
        "Drain artichokes well. Heat 3 tablespoons oil in heavy large pot over medium heat. Add artichokes, sprinkle with salt and pepper and sauté 3 minutes. Add garlic and herbes de Provence and sauté until artichokes begin to brown slightly, about 6 minutes. Add broth and wine and bring to boil. Reduce heat; cover and simmer until artichokes are tender and most liquid is absorbed, about 10 minutes. Uncover and simmer until all liquid is absorbed, about 3 minutes. Transfer artichokes to platter; cover and keep warm.",
        "Heat remaining 3 tablespoons oil in same pot over medium-high heat. Add mushrooms and sauté until tender and golden brown, about 8 minutes; season to taste with salt and pepper. Transfer mushrooms and Oven-dried Tomatoes to platter with artichokes. Spoon Green-Olive Dressing over. Garnish with lemon slices and serve.",
        "*A dried herb mixture sold at specialty foods stores and in the spice section of some supermarkets. A mix of dried thyme, basil, savory, and fennel seeds can be substituted."
    ],
    "ingredients": [
        "1 lemon",
        "2 pounds baby artichokes (about 18)",
        "6 tablespoons olive oil",
        "4 garlic cloves, thinly sliced",
        "1 teaspoon dried herbes de Provence*",
        "1/2 cup canned vegetable broth",
        "1/3 cup dry white wine",
        "8 ounces fresh crimini mushrooms, quartered",
        "Oven-dried Tomatoes",
        "Green-Olive Dressing",
        "Lemon slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Olive",
        "Tomato",
        "Vegetable",
        "Side",
        "Sauté",
        "Vegetarian",
        "Lemon",
        "Artichoke",
        "White Wine",
        "Spring",
        "Healthy",
        "Vegan",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sauteed Baby Artichokes with Oven-Dried Tomatoes and Green-Olive Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-baby-artichokes-with-oven-dried-tomatoes-and-green-olive-dressing-104799"
}
