{
    "directions": [
        "Blend mint leaves, pistachios, olive oil, and garlic in processor until coarse puree forms. Season with coarse salt. DO AHEAD Can be made 1 day ahead. Cover and chill. Bring pesto to room temperature and stir before using.",
        "Combine olive oil, mint, and thyme in small bowl. Spread herb mixture all over both sides of fish fillets. Cover and refrigerate fish at least 3 hours and up to 5 hours.",
        "Stir all seeds in small dry skillet over medium heat until fragrant, about 2 minutes. Transfer seeds to spice mill or mortar and grind coarsely.",
        "Heat 1 tablespoon oil in heavy large skillet over medium-high heat. Add carrots, crushed red pepper, and ground seeds; sauté until carrots begin to brown in spots, about 5 minutes. Add broth and lemon juice and bring to boil. Reduce heat to medium-low, cover, and simmer until carrots are tender, about 6 minutes. Season to taste with salt and pepper. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature.",
        "Sprinkle fish with salt and pepper. Heat 1 tablespoon oil in each of 2 large nonstick skillets over medium-high heat. Add fish and cook until browned on both sides and just opaque in center, about 5 minutes total.",
        "Rewarm carrots just until heated through. Divide carrots and any juices among 4 plates. Top each serving with 1 fish fillet. Spoon pesto over and serve."
    ],
    "ingredients": [
        "1/4 cup (packed) fresh mint leaves",
        "1/4 cup lightly toasted shelled unsalted natural pistachios",
        "1/4 cup extra-virgin olive oil",
        "1 garlic clove, peeled",
        "Coarse kosher salt",
        "1 tablespoon extra-virgin olive oil",
        "2 tablespoons chopped fresh mint",
        "1 tablespoon chopped fresh thyme",
        "4 (6- to 8-ounce) striped bass fillets (with or without skin)",
        "1/2 teaspoon coriander seeds",
        "1/2 teaspoon cumin seeds",
        "1/2 teaspoon fennel seeds",
        "3 tablespoons extra-virgin olive oil, divided",
        "12 ounces medium carrots, peeled, thinly sliced into rounds",
        "1/8 teaspoon dried crushed red pepper",
        "1 cup low-salt chicken broth",
        "3 tablespoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fish",
        "Nut",
        "Vegetable",
        "Freeze/Chill",
        "Marinate",
        "Sauté",
        "Mint",
        "Bass",
        "Carrot",
        "Spring"
    ],
    "title": "Sauteed Striped Bass with Mint Pesto and Spiced Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-striped-bass-with-mint-pesto-and-spiced-carrots-237901"
}
