{
    "directions": [
        "1. Combine the cider, cinnamon and 1/4 tsp salt in a cup. Set aside.",
        "2. Pat the pork chops dry and sprinkle all over with salt and pepper.",
        "3. Heat a 12-in/30.5-cm skillet over medium-high heat and add the olive oil. When the oil shimmers, add the seasoned pork chops to the pan and cook until lightly browned on the first side, about 3 minutes. Turn and cook until browned on the second side, about 2 minutes longer. Transfer the pork chops to a plate. (They will not be cooked through at this point.)",
        "4. Add the sweet potato, apple, shallot, cider mixture, and a grind or two of pepper to the hot pan. Bring it all to a simmer, cover, and reduce the heat to medium-low or low—the pan should bubble, but not too aggressively. Cook the potato mixture until a fork easily pierces the partially cooked potato but there is still some resistance, about 10 minutes.",
        "5. Return the pork chops to the pan (along with any juices accumulated on the plate) and nestle them into the potatoes and apples. Cover and cook until the meat is cooked through and the potatoes are tender, about 8 minutes longer. Taste and adjust the seasoning.",
        "6. Transfer the pork chops, potatoes, and apples to two warmed plates. There should be some liquid remaining in the pan to serve as a base for the sauce. (If the potatoes have absorbed all of the liquid, add 2 to 3 tbsp cider to the pan and heat it briefly over medium heat.) Stir the mustard into the pan juices with a fork. Taste the sauce and add more pepper if it needs it.",
        "7. Spoon the sauce over the meat and vegetables, sprinkle the parsley over the top, and serve hot."
    ],
    "ingredients": [
        "1/2 cup/120 ml apple cider or juice, plus more if needed",
        "1/4 tsp ground cinnamon",
        "Salt",
        "2 boneless, center-cut loin pork chops, about 3/4 in/2 cm thick",
        "Freshly ground black pepper",
        "2 tbsp olive oil",
        "1 medium sweet potato, about 1/2 lb/225 g, peeled and very thinly sliced",
        "1 Braeburn, Gala, or other sweet-tart apple, cored and thinly sliced",
        "1 shallot, minced",
        "1 tsp Dijon mustard, smooth or whole-grain (see \"it's that easy\")",
        "2 tsp minced fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Mustard",
        "Pork",
        "Vegetable",
        "Sauté",
        "Valentine's Day",
        "Dinner",
        "Condiment",
        "Apple",
        "Meat",
        "Pork Chop",
        "Root Vegetable",
        "Sweet Potato/Yam",
        "Fall",
        "Winter",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sautéed Pork Chops with Sweet Potato, Apples and Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-pork-chops-with-sweet-potato-apples-and-mustard-sauce-51171620"
}
