{
    "directions": [
        "On a lightly oiled baking sheet spread warm polenta about 3/4 thick and cool to room temperature. Polenta may be made 2 days ahead and chilled, covered.",
        "In a large non-stick skillet heat 1 tablespoon oil over moderately high heat until hot but not smoking and brown sausage. Add water and cook sausage, covered, turning occasionally, until cooked through, about 10 minutes. Remove lid and cook mixture until any remaining water is evaporated. Transfer sausage with tongs to a bowl and reserve fat remaining in skillet. Cool sausage slightly and slice diagonally.",
        "Cut polenta into 1 1/2-inch diamond shapes or squares. In skillet sauté polenta in 2 batches in reserved fat over moderately high heat, turning occasionally, adding additional oil to skillet if necessary, until golden on both sides. Transfer polenta as cooked with a slotted spoon to bowl with sausage and cover.",
        "In skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and sauté broccoli rabe with salt to taste, stirring, until just wilted. Add garlic paste and sauté, stirring, 1 minute. Stir in remaining ingredients and simmer, stirring, until tomato paste is incorporated and sauce is slightly thickened. Add sausage and polenta and cook until heated through.",
        "Serve polenta sprinkled with Parmesan.",
        "In a heavy saucepan bring water and salt to a boil and gradually whisk in cornmeal in a thin stream. Cook polenta over moderately low heat (it should be barely boiling), stirring constantly, until very thick and pulls away from side of pan, about 40 minutes for cornmeal and about 15 minutes for instant polenta. Remove pan from heat and cover to keep warm. Stir polenta just before using. Polenta will keep warm, covered, about 20 minutes. Makes about 3 cups.",
        "Note: In the traditional method of cooking polenta, forty minutes of constant stirring is required to achieve a lumpless texture and fragrant flavor. However, Italian-food expert Marcella Hazan has developed a method that involves very little stirring during this time. We believe it produces a very good polenta, one nearly as flavorful and smooth as the traditional procedure. To make satisfactory polenta in a real hurry, an imported instant polenta (precooked cornmeal) is available. This cooks in a mere fifteen minutes."
    ],
    "ingredients": [
        "4 cups water",
        "1 teaspoon salt",
        "1 cup cornmeal or instant polenta",
        "2 tablespoons olive oil plus additional if necessary",
        "1 pound sweet Italian sausage links",
        "1/4 cup water",
        "1 bunch broccoli rabe (about 1 pound), chopped coarse and tough stems discarded",
        "1 garlic clove, chopped and mashed to a paste with 1/2 teaspoon salt",
        "1 cup chicken broth",
        "a 28- to 32-ounce can whole tomatoes, drained, seeded, and chopped",
        "1/4 cup dried currants",
        "2 tablespoons tomato paste",
        "Accompaniment: freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Pork",
        "Tomato",
        "High Fiber",
        "Fall",
        "Gourmet"
    ],
    "title": "Sauteed Polenta with Sweet Italian Sausage and Broccoli Rabe",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-polenta-with-sweet-italian-sausage-and-broccoli-rabe-13077"
}
