{
    "directions": [
        "If you bought unsliced beef, put it in the freezer for 20 minutes to make slicing easier, then use a sharp knife to slice the beef as thinly as possible. With your hands or a fork, and working with the grain, tear and shred the beef into bite-size “rags.” Place the beef in a bowl, add 4 Tbs. of the olive oil, and season with salt and pepper. Toss well and let stand at room temperature for about 15 minutes. Meanwhile, make a bed of the arugula on a platter or individual plates.",
        "In a fry pan over medium heat, warm the remaining 2 Tbs. olive oil. Add the mushrooms, increase the heat to medium-high and sauté until their liquid has evaporated, about 10 minutes. Transfer to a bowl.",
        "Pour off about half of the olive oil from the bowl holding the beef, and place the oil in the same pan over medium-high heat. When the oil is hot, add the meat and the oil remaining in the bowl, and season with salt and pepper. Cook, stirring constantly, just until the meat is browned, about 4 minutes. Add the wine and butter, and cook until the liquid in the pan reduces by about half and thickens slightly, 3 to 4 minutes. (The flour-dusted butter will slightly thicken the pan juices into a sauce.)",
        "Return the mushrooms to the pan, reduce the heat to medium, and heat the beef and mushrooms for about 1 minute. Remove from the heat and stir in the vinegar.",
        "Spoon the beef and mushrooms and their juices over the arugula. Serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma Foods of the World Series,",
        "Rome,",
        "by Maureen B. Fant (Oxmoor House, 2005)."
    ],
    "ingredients": [
        "1 lb. boneless lean beef, preferably sliced very thin, with the grain, by the butcher",
        "6 Tbs. extra-virgin olive oil",
        "Salt and freshly ground pepper, to taste",
        "About 2 cups arugula, tough stems removed",
        "6 to 7 oz. fresh button, cremini, porcini or chanterelle mushrooms, or a combination, brushed clean, trimmed and cut into small wedges",
        "1/2 cup dry white wine",
        "1 Tbs. unsalted butter rolled in all-purpose flour",
        "2 tsp. balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Sautéed Strips of Beef with Arugula (Straccetti di Manzo con Rughetta)",
    "url": "http://www.williams-sonoma.com/recipe/sauteed-strips-beef-arugula.html"
}
