{
    "directions": [
        "Season the fish with the lemon zest, thyme, and parsley. Cover, and refrigerate at least 4 hours or overnight.",
        "Remove the fish from the refrigerator 15 minutes before cooking, to bring it to room temperature.",
        "Heat a large sauté pan over high heat for 2 minutes. (Depending on the size of your pan, you may need to cook the fish in batches or in two pans.) Season the fish on both sides with salt and pepper. Swirl the regular extra-virgin olive oil into the pan and wait 1 minute. Carefully lay the fish in the pan, and cook 3 to 4 minutes, until it's lightly browned. Turn the fish over, lower the heat to medium-low, and cook a few more minutes, until it's almost cooked through. Be careful not to overcook the fish. When it's done, the fish will begin to flake and separate a little, and the center will still be slightly translucent. Remember, the halibut will continue to cook for a bit once you take it out of the pan.",
        "Scatter half of the arugula over a large platter. Arrange the beets on top, and drizzle with half the horseradish cream. Tuck the rest of the arugula among the beets, so you can see the beets peeking through. Nestle the fish in the salad, and spoon a little horseradish cream over each piece. Drizzle the whole dish with the super-good olive oil and a big squeeze of lemon."
    ],
    "ingredients": [
        "6 halibut fillets, 5 to 6 ounces each",
        "1 lemon, zested",
        "1 tablespoon thyme leaves",
        "2 tablespoons coarsely chopped flat-leaf parsley",
        "2 tablespoons extra-virgin olive oil",
        "4 ounces arugula, cleaned",
        "Roasted beets with Horseradish Crème Fraîche",
        "2 tablespoons super-good extra-virgin olive oil, for drizzling",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fish",
        "Roast",
        "Sauté",
        "Dinner",
        "Horseradish",
        "Halibut",
        "Arugula",
        "Beet",
        "Sour Cream",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sautéed Halibut with Arugula, Roasted Beets, and Horseradish Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-halibut-with-arugula-roasted-beets-and-horseradish-creme-fraiche-358351"
}
