{
    "directions": [
        "Put oven rack in upper third of oven and preheat oven to 500°F.",
        "Toss cauliflower, bell peppers, and garlic with olive oil, 1 teaspoon thyme, 1 teaspoon salt, and 1/2 teaspoon pepper in a large bowl. Spread in a large shallow baking pan (at least 15 by 10 inches) and roast, turning over once or twice, until vegetables are tender and slightly charred, 25 to 30 minutes.",
        "While vegetables roast, heat a dry 10-inch heavy skillet (not nonstick; preferably cast-iron) over moderately high heat until hot, about 3 minutes. Meanwhile, stir together remaining teaspoon thyme, teaspoon pepper, and 1/2 teaspoon salt in a small bowl. Pat steak dry and rub both sides with thyme mixture.",
        "Add vegetable oil to hot skillet, then add steak and sauté, turning over once, 5 to 7 minutes total for medium-rare. Transfer to a cutting board and let stand, loosely covered with foil, 5 minutes.",
        "Reserve roasted garlic cloves and 1 cup roasted bell peppers. Toss arugula with remaining roasted vegetables in pan to wilt, then transfer to a platter.",
        "Blend reserved garlic and bell peppers with broth, vinegar, and salt and pepper to taste in a blender until smooth. Transfer sauce to a small bowl or sauceboat.",
        "Holding a knife at a 45-degree angle, cut steak across the grain into thin slices and arrange on platter with vegetables. Pour any juices accumulated on cutting board over meat and serve sauce on the side."
    ],
    "ingredients": [
        "1 large head cauliflower (2 1/2 lb), cut into 1 1/2-inch-wide florets (8 cups)",
        "2 lb red bell peppers (about 5), cut into 1-inch squares",
        "4 large garlic cloves, peeled",
        "1 1/2 tablespoons extra-virgin olive oil",
        "2 teaspoons chopped fresh thyme",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons coarsely ground black pepper",
        "1 (1-lb) piece flank steak, halved lengthwise (along the grain)",
        "1/2 tablespoon vegetable oil",
        "3 oz baby arugula",
        "1/2 cup fat-free reduced-sodium chicken broth",
        "2 teaspoons red-wine vinegar, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauté",
        "Low Fat",
        "Low/No Sugar",
        "Steak",
        "Cauliflower",
        "Arugula",
        "Bell Pepper",
        "Healthy",
        "Gourmet"
    ],
    "title": "Sauteed Flank Steak with Arugula and Roasted Cauliflower and Red Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-flank-steak-with-arugula-and-roasted-cauliflower-and-red-peppers-231654"
}
