{
    "directions": [
        "Cook beans in large saucepan of boiling salted water until just tender, about 5 minutes. Using slotted spoon or strainer, transfer beans to colander; reserve cooking water. Rinse beans with cold water. If using fava beans, peel off outer skins and discard. Add corn kernels to reserved cooking water and cook until just tender, about 1 minute. Drain. Return beans and corn to same saucepan. Mix in tomato, Italian parsley and extra-virgin olive oil. Season to taste with salt and pepper. (Can be prepared 2 hours ahead. Let stand covered at room temperature. Rewarm over low heat before serving.)",
        "Place 4 cups corn kernels in processor. Puree until liquid is released from corn, about 3 minutes (mixture will still be coarse). Transfer pureed corn to strainer set over large measuring cup. Press on solids in strainer to extract at least 3/4 cup juice; discard solids. Transfer corn juice to medium saucepan. Stir over medium heat just until juice begins to thicken, about 45 seconds (do not boil or juice may curdle). Add remaining 3 cups corn kernels and whipping cream to saucepan and stir just until corn is heated through, about 2 minutes. Season to taste with salt and pepper. Remove creamed corn from heat; cover to keep warm.",
        "Pour enough vegetable oil into heavy large skillet to reach depth of 1/4 inch. Heat over high heat. Sprinkle cod fillets with salt and pepper. Add fillets to skillet and cook until golden brown and center of each fillet is just opaque, about 4 minutes per side. Divide creamed corn equally among 4 plates. Top each serving with sautéed cod fillet. Spoon succotash atop each fillet and serve."
    ],
    "ingredients": [
        "1 1/2 pounds fava beans, shelled, or 1 1/2 cups frozen lima beans, thawed",
        "2 large ears corn, kernels cut from cob (about 2 cups)",
        "1 large tomato, seeded, diced",
        "2 tablespoons chopped fresh Italian parsley",
        "1 tablespoon extra-virgin olive oil",
        "7 large ears corn, kernels cut from cob (about 7 cups)",
        "3 tablespoons whipping cream",
        "Vegetable oil (for frying)",
        "4 6- to 8-ounce pieces cod fillets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Dairy",
        "Fish",
        "Vegetable",
        "Sauté",
        "Dinner",
        "Seafood",
        "Cod",
        "Corn",
        "Legume",
        "Lima Bean",
        "Summer",
        "Party",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sauteed Cod with Creamed Corn and Summer Succotash",
    "url": "http://www.epicurious.com/recipes/food/views/sauteed-cod-with-creamed-corn-and-summer-succotash-103887"
}
