{
    "directions": [
        "Pulse flour, rosemary, salt, and pepper together in a food processor until evenly mixed; add cold butter and pulse until mixture resembles coarse crumbs. Drizzle cold water into mixture and pulse until dough comes together. Transfer dough to a bowl and refrigerate, 1 hour to 2 days.",
        "Place sweet potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 50 minutes. Drain and run cold water over sweet potatoes; carefully remove peels.",
        "Stir milk and olive oil together in a bowl.",
        "Beat sweet potato and softened butter together in a bowl using an electric mixer until smooth. Stir milk-olive oil mixture, eggs, Parmesan cheese, and garlic into sweet potato mixture until smooth; season with salt and pepper.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Roll dough on a floured surface using a rolling pin. Roll dough around rolling pin and press in a pie dish, trimming edges. Pour sweet potato filling into crust.",
        "Bake in the preheated oven until a knife inserted in the middle of the filling comes out clean, 55 to 60 minutes. Cool pie about 5 minutes before serving."
    ],
    "ingredients": [
        "Rosemary Crust:",
        "1 3/4 cups all-purpose flour",
        "1 teaspoon roughly chopped fresh rosemary",
        "salt and ground black pepper to taste",
        "10 tablespoons cold butter, cut into cubes",
        "1/3 cup ice water",
        "Sweet Potato-Parmesan Filling:",
        "2 pounds sweet potatoes",
        "1/2 cup milk",
        "1/2 teaspoon olive oil, or to taste",
        "1/2 cup butter, softened",
        "2 eggs",
        "1/4 cup grated Parmesan cheese",
        "2 cloves garlic, minced",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Savory Sweet Potato Pie",
    "url": "http://allrecipes.com/recipe/237134/savory-sweet-potato-pie/"
}
