{
    "directions": [
        "Blend together flour, butter, and salt in a bowl with your fingertips or a pastry blender (or pulse in a food processor) just until mixture resembles coarse meal with some roughly pea-size butter lumps. Drizzle 5 tablespoons ice water evenly over mixture and gently stir with a fork (or pulse) until incorporated. Squeeze a small handful of dough: If dough doesn't hold together, add more ice water, 1/2 tablespoon at a time, stirring until incorporated. Do not overwork dough, or pastry will be tough.",
        "Turn out dough onto a work surface and divide into 4 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather all of dough together, with a pastry scraper if you have one, and form into 2 (5-inch) squares. Chill, wrapped in plastic wrap, until firm, at least 1 hour.",
        "Arrange flan rings on 2 parchment-paper-lined baking sheets. Roll out 1 portion of dough on a lightly floured surface with a lightly floured rolling pin into a 16- by 10-inch rectangle. Cut into 6 rough squares. Gently fit each square into a ring (do not stretch dough). Trim excess dough flush with rim. Lightly prick each shell several times with a fork and chill until firm, about 30 minutes. Repeat with remaining dough and rings.",
        "Preheat oven to 375°F with racks in upper and lower thirds.",
        "Line shells with foil (not heavy-duty) and fill with pie weights. Bake until sides are set, about 20 minutes. Carefully remove weights and foil and bake shells until golden-brown all over, 5 to 8 minutes. Cool completely on baking sheets on racks, then remove flan rings.",
        "Reduce oven temperature to 350°F.",
        "Cook haricots verts in salted boiling water until crisp-tender, about 3 minutes. Drain and divide among 4 tart shells along with tomatoes, then top with a round of cheese.",
        "Cook shallot in 1/2 tablespoon oil in a small skillet over medium heat until softened, about 1 minute. Transfer to a small bowl. Heat remaining tablespoon oil in skillet over medium heat, then cook bread, stirring, until golden. Toss croutons with shallot and divide among 4 tart shells. Toss crab with tarragon, zest, and cayenne and add to same shells.",
        "Cook scallions in oil in cleaned small skillet over medium heat until softened, about 1 minute. Stir in peas and warm through, then divide mixture among remaining 4 tart shells. Add pancetta to skillet and cook, turning once, until just crisp. Reserve pancetta.",
        "Whisk together custard ingredients with 3/4 teaspoon salt and 1/2 teaspoon pepper. Divide among shells. Sprinkle chives over goat cheese tarts and top pea tarts with pancetta.",
        "Bake tarts on baking sheets until custard is just set, about 20 minutes. Cool slightly."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "2 sticks cold unsalted butter, cut into 1/2-inch pieces",
        "1/2 teaspoon salt",
        "5 to 8 tablespoons ice water",
        "8 haricots verts, trimmed and cut into 1 1/2-inch pieces",
        "8 grape or cherry tomatoes, halved",
        "4 (1/4-inch-thick) rounds soft mild goat cheese (from a small log)",
        "2 teaspoons finely chopped chives",
        "2 tablespoons finely chopped shallot",
        "1 1/2 tablespoons extra-virgin olive oil, divided",
        "1/2 cup (1/2-inch) bread cubes",
        "1/2 cup jumbo lump crabmeat (2 oz), picked over",
        "1 1/2 teaspoons finely chopped tarragon",
        "1/4 teaspoon grated lemon zest",
        "2 pinches cayenne",
        "2 scallions, thinly sliced",
        "1/2 tablespoon extra-virgin olive oil",
        "1/4 cup thawed frozen baby peas",
        "4 thin slices pancetta",
        "3/4 cup whole milk",
        "3/4 cup heavy cream",
        "3 whole large eggs",
        "1 large egg yolk",
        "Equipment: 12 (4-inch) flan rings; pie weights or dried beans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Tomato",
        "Brunch",
        "Bake",
        "Lunch",
        "Goat Cheese",
        "Ham",
        "Crab",
        "Summer",
        "Tarragon",
        "Butter",
        "Green Onion/Scallion",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Savory Summer Tarts",
    "url": "http://www.epicurious.com/recipes/food/views/savory-summer-tarts-354190"
}
