{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups with butter. Line a baking sheet with aluminum foil.",
        "Place sweet potato and bacon on the prepared baking sheet.",
        "Bake in the preheated oven for 20 minutes; flip sweet potato and bacon. Bake until sweet potato is tender and bacon is crisp, about 20 more minutes. Let bacon cool on paper towels.",
        "Heat oil in a skillet over medium heat; cook and stir onion until soft and translucent, about 10 minutes.",
        "Whisk flour, baking powder, baking soda, curry powder, and salt together in a large bowl. Stir in Cheddar cheese until coated.",
        "Peel sweet potato and transfer to a bowl; roughly mash. Measure out 1 cup of mashed sweet potato. Chop bacon and stir into onion.",
        "Whisk eggs vigorously in a separate bowl. Add milk, sour cream, and butter; whisk until smooth. Fold in 1 cup sweet potato, bacon, and onions. Gently stir the sweet potato mixture into the flour mixture, using a rubber spatula, until just combined. Pour batter into the prepared muffin tin.",
        "Bake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, about 18 minutes. Cool muffins in the pan for 5 minutes before removing to a wire rack to cool completely."
    ],
    "ingredients": [
        "1 large sweet potato",
        "4 slices bacon",
        "2 teaspoons vegetable oil",
        "1/2 small onion, chopped",
        "2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon mild curry powder",
        "1/2 teaspoon salt",
        "1 cup shredded sharp Cheddar cheese",
        "2 eggs",
        "1 cup milk",
        "1/2 cup sour cream",
        "1/2 cup unsalted butter, melted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Savory Sweet Potato Muffins with Bacon",
    "url": "http://allrecipes.com/recipe/230036/savory-sweet-potato-muffins-with-baco/"
}
