{
    "directions": [
        "Rinse the porcini well to remove any dirt or grit. In a small saucepan over medium-high heat, bring the wine to a simmer. Remove from the heat and add the porcini. Let stand for 15 minutes, then drain the porcini over a bowl, reserving the liquid, and finely chop.",
        "In a large, heavy pot over medium-high heat, warm the olive oil. Add the shallots and garlic and sauté until the shallots are wilted, 3 to 5 minutes. Add the cremini, thyme, the 1/4 tsp. salt and the 1/4 tsp. pepper. Cook until the cremini release their liquid and begin to brown, 4 to 5 minutes. Add the reserved mushroom soaking liquid and bring to a boil, stirring to scrape up the browned bits from the pan bottom.",
        "Add the broth, barley, tomato paste, water and the chopped porcini to the pot. Cover and simmer until the barley is tender to the bite, 45 to 50 minutes. Remove from the heat and let cool slightly.",
        "Puree about 1 cup of the soup in a blender. Return the soup to the pot, heat until just hot and stir in the lemon juice. Season with salt and pepper. Ladle the soup into warmed bowls and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Soup of the Day",
        ", by Kate McMillan (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "1/2 oz. dried porcini mushrooms",
        "1/2 cup dry white wine",
        "1 Tbs. olive oil",
        "1/2 cup chopped shallots",
        "2 garlic cloves, minced",
        "8 oz. cremini mushrooms, chopped",
        "1 tsp. minced fresh thyme or 1/2 tsp. dried",
        "1/4 tsp. salt, plus more, to taste",
        "1/4 tsp. freshly ground pepper, plus more, to taste",
        "3 cups chicken broth",
        "3/4 cup pearl barley",
        "1 Tbs. tomato paste",
        "3 cups water",
        "2 tsp. fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Savory Barley Soup with Wild Mushrooms and Thyme",
    "url": "http://www.williams-sonoma.com/recipe/savory-barley-soup-with-wild-mushrooms-and-thyme.html"
}
