{
    "directions": [
        "Rub the ras el hanout onto the entire surface of the quail including beneath the wings and legs. Use all the seasoning. Allow to rest at room temperature for 30 minutes.",
        "Preheat oven to 375 degrees F (190 degrees C). Remove the middle rack(s) and place the lower rack on its lowest position.",
        "Place a diffuser over stove burner so base of tagine is not in direct contact with it. Place the tagine base on the diffuser and heat over medium heat; add the oil. When oil is hot, add the carrots and leeks. Saute until leeks are tender, about 5 minutes. Separate the leeks into single rounds using a wooden spoon. Push the vegetables to the sides of the tagine and add the quail and garlic. Cook the quail on all sides until nicely browned, about 10 minutes. You may need to add a bit of oil occasionally, depending on the bird's fat content. Remove tagine from heat.",
        "Arrange apricots, potatoes, and tomatoes around the edges, leaving the quail uncovered. Sprinkle all ingredients with the loomi aswad.",
        "Cover the tagine place in preheated oven. Roast until the internal temperature of the quail has reached 150 degrees F, 35 to 40 minutes.",
        "Uncover the tagine and, if desired, brown quail under the broiler 2 to 3 minutes.",
        "Sprinkle with fresh coriander before serving. Serve with ice cold milk."
    ],
    "ingredients": [
        "1 whole quail",
        "2 tablespoons ras el hanout",
        "2 tablespoons olive oil, or more as needed",
        "3 ounces carrots, cut into 1-inch rounds",
        "1 ounce leeks, cut into 1/2-inch rounds",
        "1 clove garlic, peeled and crushed",
        "10 dried apricots",
        "8 ounces potatoes, cut into 1-inch slices",
        "5 cherry tomatoes",
        "1 teaspoon loomi aswad (dried black lime seasoning)",
        "2 tablespoons chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Savory Quail Tagine",
    "url": "http://allrecipes.com/recipe/254204/savory-quail-tagine/"
}
