{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Brush the bottom of a springform pan with 1 tablespoon olive oil.",
        "Cook and stir bread crumbs and 1 tablespoon olive oil together in a skillet over medium heat until breadcrumbs are light golden, 1 to 2 minutes. Stir 1 tablespoon Parmigiano-Reggiano cheese into breadcrumbs; cook and stir until golden brown and toasted, about 1 minute more. Spread breadcrumbs out into the bottom of the prepared springform pan.",
        "Beat eggs in a bowl with a whisk until pale yellow, thick, and frothy. Add basil, parsley, salt, black pepper, cayenne pepper, and nutmeg; stir to combine.",
        "Whisk ricotta cheese and 1 ounce Parmigiano-Reggiano cheese into egg mixture. Drop cheese mixture by spoonfuls into the prepared springform pan and spread it evenly over breadcrumbs. Gently tap the pan against a work surface to settle the cheese layer. Sprinkle 2 tablespoons Parmigiano-Reggiano cheese and drizzle 1 tablespoon olive oil over the top.",
        "Bake in the preheated oven until set, 20 to 25 minutes. Run a paring knife around the side to release tart from springform pan. Cool in the pan until cool enough to handle; remove springform pan ring.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with a wire rack.",
        "Place tart on prepared baking sheet and bake in the preheated broiler until golden brown, 2 to 3 minutes."
    ],
    "ingredients": [
        "1 tablespoon olive oil, or as needed",
        "1/2 cup panko bread crumbs",
        "1 tablespoon olive oil, or as needed",
        "1 tablespoon finely grated Parmigiano-Reggiano cheese",
        "2 large eggs",
        "1/4 cup chopped fresh basil",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 pinch cayenne pepper, or to taste",
        "1 pinch ground nutmeg",
        "1 1/2 cups ricotta cheese",
        "1 ounce finely grated Parmigiano-Reggiano cheese",
        "2 tablespoons finely grated Parmigiano-Reggiano cheese, or to taste",
        "1 tablespoon olive oil, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Savory Ricotta Tart",
    "url": "http://allrecipes.com/recipe/238131/savory-ricotta-tart/"
}
