{
    "directions": [
        "Heat oil in a large, deep skillet. Add mushrooms, shallots, and garlic and cook over medium-high, stirring frequently, until just beginning to brown, about 15 minutes. Tie bay leaves, rosemary, thyme, and tarragon together in a bundle with kitchen string and add to skillet. Add wine, Marsala, and 1/4 cup plus 2 Tbsp. water and cook, stirring occasionally, until liquid is evaporated, about 30 minutes. Remove herb bundle and stir panko, Parmesan, salt, and pepper into the mushroom mixture. Transfer mixture to a food processor and purée until smooth. Let cool to room temperature.",
        "On a lightly floured surface, roll puff pastry to a 9\"x15\" rectangle. Place on a parchment-lined rimmed baking sheet and freeze until firm, about 5 minutes. Spread mushroom purée evenly on puff pastry. Starting from one of the long sides, tightly roll pastry until you reach the middle. Repeat on other side. Gently stretch the log to 18\" and freeze until firm, about 1 hour.",
        "Preheat oven to 400°F and arrange racks in lower and upper thirds of oven. Line a second rimmed baking sheet with parchment. Cut the log in half crosswise, and cut each segment into 1/4\" slices using a large sharp knife. Arrange slices on baking sheets at least 1\" apart; brush with oil and sprinkle with flaky salt. Bake, rotating sheets top to bottom and back to front halfway through, until palmiers are golden and crisp, about 30 minutes. Let cool completely on baking sheets.",
        "Pastry logs can be made up to 1 week ahead; store wrapped in plastic in the freezer. Palmiers can be baked up to 1 week ahead; store in an airtight container at room temperature, and re-crisp in a 325°F oven for 8–10 minutes before serving."
    ],
    "ingredients": [
        "1/4 cup olive oil, plus more for brushing",
        "1 pound cremini mushrooms, trimmed and thinly sliced (5 cups)",
        "3 large shallots, thinly sliced",
        "6 large garlic cloves, chopped",
        "2 bay leaves",
        "1 sprig rosemary",
        "2 sprigs thyme",
        "3 sprigs tarragon",
        "2/3 cup dry white wine",
        "1/4 cup Marsala wine",
        "6 tablespoons unsalted butter",
        "1/2 cup panko (Japanese breadcrumbs) or plain coarse breadcrumbs",
        "1/2 cup grated Parmesan (2 ounces)",
        "2 teaspoons kosher salt",
        "1 1/2 teaspoons freshly ground black pepper",
        "All-purpose flour, for rolling",
        "12 ounces all-butter puff pastry, frozen and thawed",
        "Flaky sea salt, for sprinkling",
        "Two large rimmed baking sheets; parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Mushroom",
        "Parmesan",
        "Shallot",
        "Garlic",
        "Wine",
        "Tarragon",
        "Thyme",
        "Party",
        "Phyllo/Puff Pastry Dough",
        "Christmas",
        "New Year's Eve",
        "Oscars",
        "Christmas Eve",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Kosher"
    ],
    "title": "Savory Mushroom and Parmesan Palmiers",
    "url": "http://www.epicurious.com/recipes/food/views/savory-mushroom-and-parmesan-palmiers"
}
