{
    "directions": [
        "Roll out pie crust on a lightly floured surface to a 12\" round. Transfer to tart pan and press onto bottom and up sides. Bake crust according to package instructions. Let cool in pan on a wire rack.",
        "Preheat oven to 425°F. Line a baking sheet with foil. Cut off top 1 1/2\" of asparagus tips; reserve. Slice stalks into 1/4\" rounds. Cut white bulbs from spring onions; trim and quarter (halve if using scallions). Slice pale-green parts into 1/4\" pieces. Toss asparagus tips and spring onion bulbs in a small bowl with 2 tablespoons oil; season with salt and pepper. Place in a single layer on prepared sheet; roast, turning once, until onions begin to brown and asparagus is bright green and tender, 12-15 minutes. Transfer to a small bowl. Reduce oven temperature to 375°F.",
        "Meanwhile, heat remaining 1 tablespoon oil and butter in a medium skillet over medium heat. Add sliced asparagus and pale-green parts of spring onions; season with salt and pepper. Cook, stirring often, until onions are soft and asparagus is bright green and tender, 6-8 minutes. Let cool slightly in pan. Spread evenly over bottom of tart crust.",
        "Whisk cheese and next 5 ingredients in a medium bowl. Season with salt and pepper. Whisk in eggs. Pour over vegetables. Scatter asparagus tips and spring onion bulbs over.",
        "Bake tart until edges of crust are golden brown and filling is set, 20-22 minutes. Let cool in pan for 20 minutes or up to 4 hours.",
        "Remove sides of pan. Serve tart warm or at room temperature."
    ],
    "ingredients": [
        "1 store-bought pie crust",
        "All-purpose flour (for surface)",
        "2 bunches asparagus (about 1 1/4 pounds total), trimmed, peeled if thick",
        "5 spring onions or 12 scallions",
        "3 tablespoons olive oil, divided",
        "Kosher salt and freshly ground black pepper",
        "1 tablespoons unsalted butter",
        "8 ounces soft fresh goat cheese",
        "1/4 cup crème fraîche",
        "1/4 cup heavy cream",
        "1 tablespoon minced flat-leaf parsley",
        "1 tablespoon minced fresh chives",
        "2 teaspoons minced fresh tarragon",
        "3 large eggs",
        "Special equipment: A 10\" tart pan with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Dairy",
        "Herb",
        "Breakfast",
        "Brunch",
        "Side",
        "Bake",
        "Easter",
        "Mother's Day",
        "Lunch",
        "Goat Cheese",
        "Asparagus",
        "Spring",
        "Tarragon",
        "Chive",
        "Parsley",
        "Green Onion/Scallion",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Savory Spring Vegetable and Goat Cheese Tart",
    "url": "http://www.epicurious.com/recipes/food/views/savory-spring-vegetable-and-goat-cheese-tart-395442"
}
