{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Mix ground beef, sausage, bread crumbs, 1/3 cup evaporated milk, onion, and 1 teaspoon chili powder together in a bowl; shape into small meatballs.",
        "Cook and stir meatballs, 10 to 15 at a time, in a skillet over medium heat until slightly browned, 2 to 4 minutes. Return all meatballs to skillet, cover, and cook over low heat until meatballs are cooked through, about 10 minutes. Transfer meatballs to a 2 1/2-quart casserole dish. Pour excess grease out of skillet, reserving the browned bits of food in the skillet.",
        "Combine cream of mushroom soup, cream of celery soup, 1 cup evaporated milk, and water in the skillet with browned bits of food; cook and stir until sauce is steaming but not boiling, about 5 minutes. Pour sauce over meatballs.",
        "Combine flour, baking powder, and 1/2 teaspoon chili powder in a bowl; cut in shortening until mixture is crumbly. Beat 1/3 cup evaporated milk and egg together in a separate bowl; mix into flour mixture until a sticky dough forms. Knead dough about 10 times. Roll dough into a 10x12-inch rectangle on a floured work surface. Sprinkle Cheddar cheese over dough. Starting on the long end, roll dough around cheese forming a roll; cut into 8 to 10 slices. Turn slices on their side and flatten slightly with your hand; arrange on top of sauce.",
        "Bake in the preheated oven until sauce is bubbling and biscuits are lightly browned, 20 to 25 minutes."
    ],
    "ingredients": [
        "Meatballs:",
        "1 pound ground beef",
        "1/4 pound sausage",
        "1/2 cup plain bread crumbs",
        "1/3 cup evaporated milk",
        "2 tablespoons minced onion",
        "1 teaspoon chili powder",
        "Sauce:",
        "1 (10.75 ounce) can cream of mushroom soup",
        "1 (10.75 ounce) can cream of celery soup",
        "1 cup evaporated milk",
        "1/2 cup water",
        "Chili Cheese Biscuits:",
        "1 1/2 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1/2 teaspoon chili powder",
        "1/3 cup shortening",
        "1/3 cup evaporated milk",
        "1 egg",
        "1 cup grated Cheddar cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Savory Meatball Casserole",
    "url": "http://allrecipes.com/recipe/241718/savory-meatball-casserole/"
}
