{
    "directions": [
        "Bring large pot of salted water to boil. Fill large bowl with ice cubes and water; set aside. Add cabbage leaves to boiling water; cook 2 minutes. Using slotted skimmer or large slotted spoon, transfer leaves to bowl of ice water to cool. Drain. Gently pat dry.",
        "Place 4 tablespoons butter in small bowl. Chop 2 tablespoons capers and mix into bowl with butter, then stir in parsley. Season caper butter to taste with coarse salt and freshly ground black pepper.",
        "Place 1 cabbage leaf, vein side up, on work surface. Using small sharp knife, trim off some of thickest part of large center vein so that leaf will lie flat. Turn leaf over, vein side down. Place 1 fish fillet on bottom third of cabbage leaf. Sprinkle fish with coarse salt and pepper. Spread 1 tablespoon caper butter over fish. Fold bottom, then sides of leaf over fish. Fold tip of leaf over, enclosing fish completely. Place fish packet, seam side down, on rimmed baking sheet. Repeat with remaining cabbage leaves, fish, coarse salt, pepper, and caper butter. DO AHEAD: Can be made 8 hours ahead. Cover and chill.",
        "Preheat oven to 350°F. Sprinkle fish packets with coarse salt and pepper. Melt 1 tablespoon butter in large nonstick skillet over medium-high heat. Add fish packets to skillet and cook until cabbage is light golden, about 2 minutes per side. Return fish packets, seam side down, to same baking sheet. Bake until fish is just opaque in center and firm to touch, about 7 minutes.",
        "Transfer fish packets to platter; cover with foil to keep warm. Place baking sheet over 2 burners on medium heat; add remaining 3 tablespoons butter and 2 tablespoons capers to baking sheet and cook until butter is golden brown, stirring constantly, 1 to 2 minutes. Add 2 teaspoons water to butter mixture and swirl to blend. Season sauce to taste with coarse salt and pepper. Spoon sauce over fish and serve."
    ],
    "ingredients": [
        "Ice cubes",
        "6 large savoy cabbage leaves",
        "8 tablespoons (1 stick) unsalted butter, room temperature, divided",
        "1/4 cup drained capers, divided",
        "2 tablespoons chopped fresh Italian parsley",
        "Coarse kosher salt",
        "6 4-ounce halibut fillets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Halibut",
        "Winter",
        "Cabbage",
        "Capers",
        "Butter",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Savoy Cabbage Rolls with Halibut, Browned Butter, and Capers",
    "url": "http://www.epicurious.com/recipes/food/views/savoy-cabbage-rolls-with-halibut-browned-butter-and-capers-364110"
}
