{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Butter the insides of 2 (10-ounce) ramekins and place on a baking sheet.",
        "Place bread cubes into a large bowl, set aside.",
        "Heat vegetable oil in a large skillet over medium heat; cook and stir bacon in hot oil until browned and almost crisp, 5 to 6 minutes. Remove excess oil from skillet and discard.",
        "Stir in onion and cook for about 2 minutes. Stir in red pepper and cook for an additional minute.",
        "Stir in chicken broth and heavy cream; cook until mixture begins to simmer, about 1 to 2 minutes.",
        "Pour cream mixture over bread cubes and mix thoroughly until all liquid is absorbed.",
        "Stir in 1 egg, lemon juice, tarragon, and lemon zest.",
        "Mix in crabmeat, salt, black pepper, and cayenne pepper.",
        "Spoon Mixture into prepared ramekins and bake in a preheated oven until tops are golden brown, about 20 minutes.",
        "Remove ramekins from oven and top each bread pudding with a poached egg. Spoon hollandaise sauce over each egg. Garnish with cayenne pepper."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "3 cups dry bread cubes",
        "1 teaspoon vegetable oil",
        "1 strip bacon, chopped",
        "1/4 cup minced onion",
        "1/4 cup minced red bell pepper",
        "1/3 cup chicken broth, or more as needed",
        "1/3 cup heavy cream",
        "1 large egg",
        "1/2 lemon, juiced",
        "1 tablespoon chopped fresh tarragon",
        "1 teaspoon fresh lemon zest",
        "4 ounces fresh lump crabmeat",
        "salt and fresh ground pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "1/2 tablespoon distilled white vinegar",
        "2 eggs",
        "1/4 cup hollandaise sauce",
        "1 pinch cayenne pepper, for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Savory Bacon and Crab Bread Pudding Eggs Benedict",
    "url": "http://allrecipes.com/recipe/221128/savory-bacon-and-crab-bread-pudding-e/"
}
