{
    "directions": [
        "In a bowl whisk together egg, milk, butter, and parsley until combined well. Add flour, salt and pepper and whisk until smooth.",
        "Heat a 6-to-8 inch crepe pan over moderately high heat until hot. Brush pan with oil and heat until hot but not smoking. Remove pan from heat. Stir batter and half fill a 1/4-cup measure with it. Pour batter into pan, tilting and rotating pan quickly to cover bottom with a thin layer of batter, and return any excess to bowl. Return pan to heat and loosen edge of crêpe with a spatula. Cook crêpe until underside is lightly browned. Turn crêpe and lightly brown other side. Transfer crêpe to a plate. Make more crêpes with remaining batter, brushing pan lightly with oil as necessary. (Crêpes may be made 1 day in ahead and chilled, stacked and wrapped well in plastic wrap.)",
        "In a large heavy skillet cook bacon over moderately high heat until crisp and transfer to paper towels to drain. Pour off all but 1 tablespoon fat from skillet and chop bacon. To fat remaining in skillet add mushrooms and 1 tablespoon butter and sauté over moderately high heat, stirring, until liquid mushrooms give off is evaporated, about 5 minutes. Remove skillet from heat.",
        "Preheat oven to 200°F..",
        "In a heavy saucepan melt remaining 2 tablespoons butter over moderately high heat and whisk in flour. Cook roux, whisking, 3 minutes. Add milk gradually, whisking constantly, and cook. stirring, occasionally, 5 minutes or until thickened and smooth. Add mushrooms, cream, parsley, bacon, salt and pepper to taste and simmer 10 minutes, or until very thick. Cool filling slightly.",
        "Spread each crêpe with about 1/4 cup filling and fold in quarters, transferring crêpes as filled to an ovenproof platter. Heat crêpes in oven until heated through."
    ],
    "ingredients": [
        "1 large egg",
        "1 cup milk",
        "1 tablespoon unsalted butter, melted and cooled",
        "1 teaspoon finely chopped fresh parsley leaves",
        "1/2 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "vegetable oil for brushing pan",
        "6 slices bacon",
        "1/2 pound mushrooms, sliced thin",
        "3 tablespoons unsalted butter",
        "1/4 cup all-purpose flour",
        "1 cup milk",
        "1/2 cup heavy cream",
        "1 tablespoon chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Appetizer",
        "Sauté",
        "Bacon",
        "Parsley",
        "Simmer",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Savory Crepes with Mushroom and Bacon Filling",
    "url": "http://www.epicurious.com/recipes/food/views/savory-crepes-with-mushroom-and-bacon-filling-14331"
}
