{
    "directions": [
        "Fill an 8-quart kettle three fourths full with salted water and bring to a boil. Plunge lobster headfirst into boiling water and simmer, covered, 8 minutes. Immediately transfer lobster with tongs to a large bowl and cool.",
        "When lobster is cool enough to handle, remove meat in the following manner, reserving shells and body: Break off claws at body of lobster. Crack claws and remove meat. Twist tail off lobster body and with kitchen shears cut thin hard membrane on underside of tail to remove meat. Chop tail and claw meat and chill, covered, for bread pudding. Discard head sac from lobster body. With a sharp knife or kitchen shears chop or cut lobster body and reserved shells into pieces and chill, covered, for sauce.",
        "Preheat oven to 300°F.",
        "Cut enough of brioches into 1/4-inch dice to measure 2 packed cups and spread in one layer in a shallow baking pan. Bake brioche in middle of oven until dry but not golden, about 12 minutes. Finely chop white part of leek. Trim cremini stems flush with caps and discard shiitake stems. Cut cremini and shiitake caps into 1/4-inch dice.",
        "In a 9-inch heavy skillet cook leek in oil, covered, over moderately low heat, stirring occasionally, until tender, about 5 minutes. Add mushrooms and sauté over moderately high heat, stirring, until tender and any liquid mushrooms give off is evaporated. Remove skillet from heat and add brandy. Carefully ignite brandy and cook over moderately high heat, shaking skillet, until flames die out. Continue to cook mixture, stirring, until any remaining liquid is evaporated and season with salt and pepper. Transfer mixture to a bowl and stir in lobster meat.",
        "In a large bowl whisk together yolks, egg, cream, cayenne, and salt to taste and gently stir in brioche croutons and lobster mixture. Chill bread pudding, covered, until brioche is soaked with custard, 2 to 3 hours. Bread pudding may be made up to this point 1 day ahead and chilled, covered.",
        "Finely chop carrot, celery, and white part of leek separately. In a 3- to 4-quart heavy saucepan cook leek in oil over moderate heat, stirring, until softened. Add carrot and celery and cook, stirring, until celery is slightly softened. Add lobster shells and body and sauté over moderately high heat, stirring occasionally, 2 minutes. Stir in tarragon. Remove pan from heat and add brandy. Carefully ignite brandy and boil mixture, shaking pan, until flames die out and brandy is evaporated. Add wine and water and simmer mixture, uncovered, l hour.",
        "With a knife halve vanilla bean lengthwise. Pour lobster stock through a fine sieve into a large bowl, pressing hard on solids, and transfer liquid to cleaned pan. Boil stock until reduced to about 1/2 cup. Stir in tomato purée and bring to a boil. Stir in vanilla bean and cream and simmer sauce until reduced to about 1 cup. Season sauce with salt and pour through a fine sieve into a small saucepan. Chill sauce, covered, while baking puddings. Sauce may be made up to this point 1 day ahead and chilled, covered.",
        "Preheat oven to 300°F. and butter four 1-cup ramekins (4 by 2 inches).",
        "Divide bread pudding among ramekins and arrange in a roasting pan. Add enough hot water to roasting pan to reach one third up sides of ramekins and tent roasting pan with foil. Bake puddings in middle of oven 45 minutes. Carefully remove foil and bake puddings until a knife inserted in centers comes out clean, 15 to 25 minutes more. Remove ramekins from roasting pan and let puddings stand 5 minutes. Reheat sauce over moderate heat until hot and add chives.",
        "Run a thin knife around edge of each pudding and invert a plate over each ramekin. Invert puddings onto plates and turn right side up.",
        "Serve puddings with sauce."
    ],
    "ingredients": [
        "a 1 1/2-pound live lobster",
        "2 individual brioches (each about 3 inches in diameter)",
        "1 medium leek",
        "1/4 pound fresh cremini mushrooms",
        "1/4 pound fresh shiitake mushrooms",
        "1 tablespoon olive oil",
        "1/4 cup brandy",
        "4 large egg yolks",
        "1 large egg",
        "2 cups heavy cream",
        "1/4 teaspoon cayenne",
        "1 small carrot",
        "1 small celery rib",
        "1 small leek",
        "1 tablespoon olive oil",
        "reserved lobster shells and body from bread pudding",
        "1 1/2 tablespoons coarsely chopped fresh tarragon sprigs",
        "1/4 cup brandy",
        "1/4 cup dry white wine",
        "3 cups water",
        "a 2-inch piece vanilla bean",
        "2 teaspoons canned tomato purée",
        "1 cup heavy cream",
        "1 tablespoon finely chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Tomato",
        "Side",
        "Bake",
        "Lobster",
        "Vanilla",
        "Brandy",
        "Winter",
        "Chive"
    ],
    "title": "Savory Lobster Bread Puddings with Vanilla Chive Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/savory-lobster-bread-puddings-with-vanilla-chive-sauce-15620"
}
