{
    "directions": [
        "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon grease into a small glass container and chill until set, at least 1 hour. Cut bacon strips into 1/4-inch slices.",
        "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.",
        "Combine flour and 1 tablespoon plus 1 teaspoon baking powder in a large bowl. Measure out 6 tablespoons plus 2 teaspoons chilled bacon grease into the bowl. Knead grease into the flour mixture with one hand, turning bowl with the other, until dough is crumbly.",
        "Make a well in the center of the dough and slowly pour in 10 tablespoons plus 2 teaspoons milk. Mix with one hand until milk is incorporated and dough feels wet to the touch. Form dough into a thick disc. Cut into 16 equal-sized pieces with a knife.",
        "Roll dough into individual balls and place them on the baking sheet. Flatten them into circles about 2 1/2 inches in diameter. Place a tablespoon of bacon slices in the center of 8 circles. Top with remaining circles of dough. Seal so that the top circle meets the bottom using your fingertips.",
        "Whisk egg yolk with maple syrup in a bowl; brush over sides and top of each scone. Let scones rest, about 15 minutes.",
        "Bake in the preheated oven until golden brown, 12 to 15 minutes.",
        "Place a clean towel on a plate, transfer scones to the towel and fold towel over to keep warm."
    ],
    "ingredients": [
        "1/2 pound bacon",
        "1 3/4 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon baking powder",
        "10 tablespoons whole milk",
        "2 teaspoons whole milk",
        "1 egg yolk",
        "1/8 teaspoon maple syrup"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Savory Bacon Scones",
    "url": "http://allrecipes.com/recipe/245902/savory-bacon-scones/"
}
