{
    "directions": [
        "Preheat oven to 375°F. Butter 13x9x2-inch glass baking dish. Cut bottom crust and short ends off bread and discard. Cut remaining bread with crust into 1-inch cubes (about 10 cups loosely packed). Place cubes in very large bowl. Add oil, thyme, and garlic; toss to coat. Spread cubes out on large rimmed baking sheet. Sprinkle with salt and pepper. Bake until golden and slightly crunchy, stirring occasionally, about 20 minutes. Return toasted bread cubes to same very large bowl.",
        "Melt butter in large skillet over medium-high heat. Add mushrooms, onion, celery, and bell pepper. sauté until soft and juices have evaporated, about 15 minutes. Add sautéed vegetables and parsley to bread cubes.",
        "Whisk heavy cream, eggs, salt, and ground pepper in large bowl. Mix custard into bread and vegetables. Transfer stuffing to prepared dish. Sprinkle cheese over. DO AHEAD Can be prepared 1 day ahead. Cover and refrigerate.",
        "Preheat oven to 350°F. Bake stuffing uncovered until set and top is golden, about 1 hour. Let stand 15 minutes."
    ],
    "ingredients": [
        "1 (1-pound) loaf crusty country-style white bread",
        "1/4 cup olive oil",
        "4 teaspoons chopped fresh thyme",
        "1 large garlic clove, minced",
        "6 tablespoons (3/4 stick) butter",
        "1 pound assorted fresh mushrooms (such as crimini, button, portobello, and stemmed shiitake), thinly sliced",
        "1 1/2 cups finely chopped onion",
        "1 1/2 cups thinly sliced celery",
        "1 cup finely chopped green bell pepper",
        "1/3 cup chopped fresh parsley",
        "3 1/2 cups heavy whipping cream",
        "8 large eggs",
        "2 teaspoons salt",
        "1 teaspoon freshly ground black pepper",
        "1/3 cup finely grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Mushroom",
        "Vegetable",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Savory Bread Pudding with Mushrooms and Parmesan Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/savory-bread-pudding-with-mushrooms-and-parmesan-cheese-236494"
}
