{
    "directions": [
        "Cook half of onion with half of saffron in 1 tablespoon oil in a 3-quart heavy saucepan over moderate heat, stirring occasionally, until onion begins to soften, 6 to 8 minutes. Stir in couscous, then add water and 1/2 teaspoon salt and simmer, covered, until liquid is absorbed and couscous is al dente, 10 to 12 minutes. Remove from heat and let stand, covered, 10 minutes.",
        "While couscous stands, cook bell pepper and remaining onion in 2 teaspoons oil with 1/4 teaspoon salt, 1/8 teaspoon pepper, and remaining saffron in a 1 1/2- to 2-quart heavy saucepan over moderate heat, stirring occasionally, until vegetables are softened, 10 to 12 minutes.",
        "Pat scallops dry and season with 1/4 teaspoon salt and 1/4 teaspoon pepper. Heat 2 teaspoons oil in a 12-inch heavy nonstick skillet over moderately high heat until hot but not smoking, then sauté 8 scallops, turning over once, until golden brown and just cooked through, 3 to 4 minutes total. Transfer to a plate and keep warm, loosely covered with foil. Wipe out skillet and heat remaining 2 teaspoons oil, then sauté remaining 8 scallops, transferring to plate.",
        "Heat a dry deep 12-inch heavy skillet over moderately high heat until hot, then cook mussels, covered, shaking skillet occasionally, until mussels just open wide, 3 to 5 minutes. (Discard any mussels that remain unopened after 5 minutes.) Transfer mussels to a bowl with a slotted spoon, then add clams to skillet and cook, covered, shaking skillet occasionally, until clams just open wide, 6 to 10 minutes. (Discard any clams that remain unopened after 10 minutes.) Add shrimp to clams along with chorizo, mussels, cooked vegetables, and remaining 1/4 teaspoon salt and 1/8 teaspoon pepper and cook, stirring, until shrimp is just cooked through, about 1 minute. Stir in couscous, scallops, and peas until heated through."
    ],
    "ingredients": [
        "1 large onion, chopped",
        "1/4 teaspoon crumbled saffron threads",
        "3 tablespoons vegetable oil",
        "2 cups pearl (Israeli) couscous (10 oz)",
        "2 3/4 cups water",
        "1 1/4 teaspoons salt",
        "1 red bell pepper, cut into 1/4-inch dice",
        "1/2 teaspoon black pepper",
        "16 sea scallops (1 1/4 lb total), tough muscle removed from side of each if necessary",
        "12 mussels (preferably cultivated; 2/3 lb), scrubbed and beards removed",
        "8 small hard-shelled clams (about 2 inches in diameter), scrubbed well",
        "2 oz medium shrimp in shell (31 to 35 per lb), peeled and deveined",
        "2 oz Spanish chorizo (cured spiced pork sausage), quartered lengthwise, then cut crosswise into 1/4-inch pieces",
        "1/2 cup frozen peas, thawed",
        "Garnish: fresh parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Shellfish",
        "Sauté",
        "Sausage",
        "Clam",
        "Mussel",
        "Scallop",
        "Shrimp",
        "Saffron",
        "Bell Pepper",
        "Couscous",
        "Gourmet"
    ],
    "title": "Scallop Paella",
    "url": "http://www.epicurious.com/recipes/food/views/scallop-paella-231186"
}
