{
    "directions": [
        "Bring 4 cups water to a boil in a 2-quart heavy saucepan, then add rice and 1/2 teaspoon salt. Reduce heat and cook, covered, over low heat until rice is tender and grains are split open, 1 to 1 1/4 hours (not all liquid will be absorbed). Drain well in a colander and cool to warm.",
        "Blend together milk, eggs, 3 tablespoons butter, flour, pepper, remaining teaspoon salt, and 1 cup cooked wild rice in a blender until smooth, about 1 minute. Transfer to a large bowl and stir in scallions and 1 1/2 cups cooked wild rice (reserve remainder for another use). Let batter stand, covered, at room temperature 1 hour.",
        "Roast bell peppers on racks of gas burners over high heat, turning with tongs, until skins are blackened, 10 to 12 minutes. (Or broil peppers on a broiler pan about 5 inches from heat, turning occasionally, about 15 minutes.) Transfer to a large bowl and cover tightly with plastic wrap, then let stand 20 minutes.",
        "When cool enough to handle, peel peppers, discarding stems and seeds, and coarsely chop.",
        "Purée peppers with water, oil, vinegar, and salt in cleaned blender until smooth. Season with pepper and pour into a small heavy saucepan.",
        "Soak porcini in boiling-hot water in a small bowl until softened, about 20 minutes. Lift porcini out, squeezing liquid back into bowl, then rinse porcini (to remove any grit) and finely chop. Pour soaking liquid through a sieve lined with a dampened paper towel into another small bowl.",
        "Heat oil and 1 tablespoon butter in a 12- to 13-inch nonstick skillet over moderately high heat until foam subsides, then sauté porcini and cremini mushrooms, tossing with 2 wooden spatulas or spoons, until wilted and any liquid mushrooms give off is evaporated, 3 to 5 minutes. Add garlic, rosemary, thyme, salt, and remaining tablespoon butter and sauté, stirring, 1 minute. Add porcini soaking liquid and boil until most of liquid is evaporated and mushrooms are tender, 3 to 5 minutes. Season with salt and pepper.",
        "Line a plate with 1 square of wax paper. Heat crêpe pan over moderate heat until hot, then brush lightly with some melted butter. Spoon about 3 tablespoons batter into pan, tilting and rotating to coat bottom. (If batter sets before skillet is coated, reduce heat slightly for next crêpe.) Cook until underside is lightly browned, about 1 minute, then loosen crêpe with a heatproof plastic spatula and flip over with your fingers. Cook crêpe until other side is lightly browned, about 1 minute, and transfer to wax-paper-lined plate. Top crêpe with another square of wax paper. Make more crêpes with remaining batter, brushing pan lightly with butter as needed. (You will have extra crêpes.)",
        "Preheat oven to 400°F.",
        "Brush some melted butter on bottom of a large shallow baking pan (1 inch deep). Spread 1/4 cup filling over half of 1 crêpe, then fold other half over filling to form a half-moon. Fold half-moon in thirds, overlapping outer sections (see photo, opposite), and transfer to baking pan. Repeat procedure with 11 more crêpes, arranging in 1 layer in baking pan.",
        "Brush crêpes generously with remaining melted butter and bake in upper third of oven until outsides are crisp and filling is heated through, about 15 minutes.",
        "While crêpes are baking, heat sauce over low heat until hot, about 5 minutes.",
        "Put 2 crêpes on each of 6 plates and serve with sauce."
    ],
    "ingredients": [
        "4 cups water",
        "1 cup wild rice (5 oz)",
        "1 1/2 teaspoons salt",
        "1 3/4 cups whole milk",
        "4 large eggs",
        "1 stick (1/2 cup) unsalted butter, melted and cooled slightly",
        "1 cup all-purpose flour",
        "1/4 teaspoon black pepper",
        "3/4 cup thinly sliced scallions",
        "3 red bell peppers (18 oz)",
        "1/2 cup water",
        "2 tablespoons olive oil",
        "1 1/2 teaspoons balsamic vinegar",
        "3/4 teaspoon salt",
        "1 1/2 oz dried porcini mushrooms",
        "3/4 cup boiling-hot water",
        "2 tablespoons olive oil",
        "2 tablespoons unsalted butter",
        "1 1/2 lb fresh cremini mushrooms, trimmed and thinly sliced",
        "3 large garlic cloves, minced",
        "3/4 teaspoon minced fresh rosemary",
        "3/4 teaspoon minced fresh thyme",
        "3/4 teaspoon salt",
        "Garnish: thinly sliced scallions",
        "Special equipment: 16 (5-inch) squares of wax paper; a well-seasoned 6- to 7-inch crêpe pan or nonstick skillet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Pepper",
        "Rice",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Vegetarian",
        "Fall",
        "Gourmet"
    ],
    "title": "Scallion Wild Rice Crepes with Mushroom Filling and Red Pepper Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/scallion-wild-rice-crepes-with-mushroom-filling-and-red-pepper-sauce-107348"
}
