{
    "directions": [
        "Preheat oven to 350°F.",
        "Toast bread crumbs on a baking sheet in middle of oven until pale golden, 6 to 8 minutes, then toss with cheese.",
        "Simmer wine, water, onion, bay leaf, salt, and pepper in a 2 1/2- to 3-quart heavy saucepan, uncovered, 5 minutes, then add scallops and simmer, uncovered, stirring occasionally, until just cooked through, 2 to 3 minutes. Transfer scallops to a platter with a slotted spoon to cool, returning any onions to pan, then boil cooking liquid until reduced to about 1 cup, 8 to 10 minutes. Pour cooking liquid through a sieve into a bowl.",
        "Cook mushrooms in 2 tablespoons butter in a 10- to 12-inch heavy skillet over moderate heat, stirring occasionally, until most of liquid mushrooms give off is evaporated, about 5 minutes. Season with salt and pepper.",
        "Whisk together cream and yolk in a heatproof bowl. Melt 2 tablespoons butter in cleaned 2 1/2- to 3-quart saucepan over moderately low heat, then add flour and cook roux, whisking, 2 minutes. Remove pan from heat and add reduced cooking liquid in a stream, whisking constantly. Return pan to heat and simmer, whisking, 1 minute. Pour sauce in a slow stream into cream mixture, whisking constantly, then pour sauce back into pan and simmer, whisking, 1 minute. Remove from heat and season with salt and pepper.",
        "Preheat broiler.",
        "Stir scallops and mushrooms into sauce, then divide among scallop shells or ramekins and sprinkle with bread crumb mixture. If using shells, spread kosher salt evenly in a large shallow baking pan, then nestle shells in salt. Dot scallops with remaining 2 tablespoons butter, then broil about 4 inches from heat until golden, about 2 minutes.",
        "Sprinkle with parsley.",
        "Available at Bridge Kitchenware (800-274-3435)"
    ],
    "ingredients": [
        "1/4 cup coarse fresh bread crumbs from a baguette",
        "1/4 cup finely grated Parmigiano-Reggiano (1/2 ounce)",
        "1 1/4 cups dry white wine",
        "1 cup water",
        "1/2 small onion, sliced",
        "1/2 Turkish or 1/4 California bay leaf",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 lb sea scallops, tough muscle removed from side of each if necessary and scallops cut into 3/4-inch pieces",
        "1/2 lb small mushrooms, halved lengthwise, then thinly sliced lengthwise",
        "3/4 stick (6 tablespoons) unsalted butter",
        "1/2 cup heavy cream",
        "1 large egg yolk",
        "1 tablespoon all-purpose flour",
        "8 cups kosher salt to stabilize scallop shells (if using)",
        "1 1/2 tablespoons minced fresh flat-leaf parsley",
        "Special equipment: 16 (2 1/2-inch) scallop shells* or 8 (2-oz) ramekins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Shellfish",
        "Appetizer",
        "Bake",
        "Broil",
        "Quick & Easy",
        "Scallop",
        "White Wine",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Scallops with Mushrooms in White-Wine Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/scallops-with-mushrooms-in-white-wine-sauce-107582"
}
