{
    "directions": [
        "Trim tops of okra, being careful not to cut into pods.",
        "Cut an X in bottom of each tomato and immerse tomatoes in a 2-quart saucepan of boiling water for 10 seconds. Transfer tomatoes with a slotted spoon (save boiling water) to a bowl of ice and cold water to cool, then peel. Add 1 tablespoon salt to boiling water, then add okra and cook, uncovered, until just tender, about 5 minutes. Drain okra in a colander, then plunge into same ice water to stop cooking. Drain okra and pat dry with paper towels.",
        "Quarter tomatoes lengthwise and seed, then cut each quarter lengthwise into 1/2-inch-wide strips.",
        "Purée onion, garlic, ginger, jalapeño (to taste), and 1/4 cup chicken broth in a blender.",
        "Pat scallops dry and sprinkle with pepper and remaining 1/2 teaspoon salt. Brush a 12-inch nonstick skillet with 1/2 teaspoon oil and heat over moderately high heat until just beginning to smoke. Brown scallops in 2 batches, turning once, about 4 minutes total. Transfer scallops as browned with tongs to a plate and keep warm, covered with foil. (Scallops will not be cooked through.)",
        "Add remaining 1 1/2 teaspoons oil to skillet and reduce heat to moderate. Add purée carefully (it may splatter), then add curry powder. Boil, stirring constantly, 2 minutes. Add coconut milk and remaining 3/4 cup broth and bring to a simmer. Add tomato strips and simmer, stirring frequently, until tomatoes are softened, 3 to 4 minutes. Season sauce with salt and pepper.",
        "Stir in scallops and okra and simmer until scallops are just cooked through, about 3 minutes. Divide scallops, vegetables, and sauce among 4 plates and sprinkle with cilantro."
    ],
    "ingredients": [
        "1/2 pound small fresh okra",
        "1 pound plum tomatoes",
        "1 tablespoon plus 1/2 teaspoon salt",
        "1 small onion, chopped",
        "1 large garlic clove, chopped",
        "1 (1-inch) piece peeled fresh ginger, chopped",
        "2 to 3 teaspoons minced fresh jalapeño chile (including seeds)",
        "1 cup low-sodium fat-free chicken broth",
        "1 1/4 pound sea scallops, tough muscle removed from side of each if necessary",
        "1/4 teaspoon black pepper",
        "2 teaspoons vegetable oil",
        "1 1/2 teaspoons curry powder (preferably Madras)",
        "2/3 cup well-stirred canned reduced-fat coconut milk",
        "1/4 cup loosely packed fresh cilantro leaves",
        "Accompaniment: spiced basmati rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Tomato",
        "Coconut",
        "Scallop",
        "Curry",
        "Healthy",
        "Okra",
        "Jalapeño",
        "Simmer",
        "Gourmet"
    ],
    "title": "Scallops, Okra, and Tomatoes in Coconut Curry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/scallops-okra-and-tomatoes-in-coconut-curry-sauce-107017"
}
