{
    "directions": [
        "Char bell peppers over gas flame or in broiler until blackened on all sides. Enclose in paper bag; let stand 10 minutes. Peel and seed bell peppers. Cut all bell peppers into matchstick-size strips. Set aside.",
        "Arrange tomatoes on baking sheet. Broil until tomatoes begin to brown and blister, about 5 minutes.",
        "Heat oil in heavy large skillet over high heat. Add scallops and cook 2 minutes. Remove from heat. Turn scallops over. Add lime juice to skillet, then tequila. Simmer until scallops are cooked through and liquid is reduced by half, about 2 minutes. Using slotted spoon, transfer scallops to plate. Stir roasted peppers, tomatoes, cilantro and basil into cooking liquid. Add butter 1 piece at a time, whisking just until melted. Return scallops to skillet. Season to taste with salt and pepper.",
        "Spoon scallop mixture onto plates. Sprinkle with diced avocado and mango. Garnish with cilantro sprigs."
    ],
    "ingredients": [
        "1 red bell pepper",
        "1 yellow bell pepper",
        "1 green bell pepper",
        "12 cherry tomatoes",
        "1 tablespoon olive oil",
        "1 1/2 pounds sea scallops",
        "1/4 cup fresh lime juice",
        "1/4 cup gold tequila",
        "1/3 cup chopped fresh cilantro",
        "1/3 cup chopped fresh basil",
        "3 tablespoons chilled unsalted butter, cut into pieces",
        "1 cup diced peeled pitted avocado",
        "1 cup diced peeled pitted mango",
        "Fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tequila",
        "Tomato",
        "Sauté",
        "Mango",
        "Basil",
        "Scallop",
        "Avocado",
        "Bell Pepper",
        "Summer",
        "Cilantro"
    ],
    "title": "Scallops with Bell Peppers, Tomatoes, Avocado and Mango",
    "url": "http://www.epicurious.com/recipes/food/views/scallops-with-bell-peppers-tomatoes-avocado-and-mango-5443"
}
