{
    "directions": [
        "Put oven rack in lower third of oven and preheat oven to 350°F. Generously butter a 13- by 9-inch glass baking dish (3-quart capacity).",
        "Stir together salt and pepper in a small bowl. Cut off necks of squash, reserving bottoms for another use (you will have about 3 pounds necks). Peel squash and very thinly slice crosswise with slicer.",
        "Layer one third of squash slices, overlapping, in baking dish and sprinkle with some of salt and pepper mixture. Sprinkle with half of cheese, then layer half of remaining squash slices on top and sprinkle with some of salt and pepper mixture. Top with remaining cheese and remaining squash slices, then sprinkle with remaining salt and pepper.",
        "Bring cream and thyme sprigs to a simmer in a small saucepan over moderate heat. Discard thyme and pour cream evenly over squash. Put a sheet of parchment paper on surface of squash and poke a few holes in parchment with a knife. Bake squash until tender, about 45 minutes.",
        "Discard parchment and let squash stand 10 minutes before serving. If desired, cut rounds from squash with cookie cutter and transfer to plates with a spatula.",
        "*Available at Asian markets, cookware shops, and Uwajimaya (800-889-1928)."
    ],
    "ingredients": [
        "1 teaspoon salt",
        "Rounded 1/4 teaspoon black pepper",
        "5 1/2 to 6 pound butternut squash",
        "5 ounces Oka cheese or mild Cheddar, rind discarded and cheese coarsely grated on large holes of a box grater (1 1/3 cups)",
        "1 1/2 cups heavy cream",
        "3 fresh thyme sprigs",
        "Special equipment: a Japanese Benriner or other adjustable-blade slicer*; parchment paper; a 2 1/2-inch round cookie cutter (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Vegetable",
        "Side",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Cheddar",
        "Butternut Squash",
        "Fall",
        "Winter",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Scalloped Butternut Squash",
    "url": "http://www.epicurious.com/recipes/food/views/scalloped-butternut-squash-108890"
}
