{
    "directions": [
        "Preheat oven to 375°F. Lightly oil 13 x 9 x 2-inch glass baking dish. Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Add onions and sauté until golden, about 15 minutes. Add mushrooms and fennel seeds and sauté until mushrooms are brown, about 10 minutes. Stir in garlic, then flour.",
        "Gradually stir milk and cream into mushroom mixture. Simmer over medium heat until sauce thickens slightly, stirring often, about 5 minutes. Add half of goat cheese, 1/3 cup Parmesan, salt and pepper. Stir until goat cheese melts, about 1 minute. Remove from heat.",
        "Mix potatoes, sliced fennel and mushroom mixture in large bowl. Transfer to prepared baking dish. Cover dish with foil. Bake until potatoes are almost tender, about 1 hour. Sprinkle with remaining goat cheese and 2 tablespoons Parmesan, then paprika. Bake uncovered until vegetables are very tender, about 30 minutes longer. Remove from oven; let stand 15 minutes. Top with reserved chopped fennel fronds."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter",
        "3 cups thinly sliced onions (about 2)",
        "1 pound mushrooms, sliced",
        "1 teaspoon fennel seeds, chopped",
        "1 tablespoon minced garlic",
        "2 tablespoons all purpose flour",
        "3 cups whole milk",
        "1 cup whipping cream",
        "10 ounces soft fresh goat cheese (such as Montrachet), crumbled",
        "1/3 cup plus 2 tablespoons freshly grated Parmesan cheese",
        "1 3/4 teaspoons salt",
        "1/2 teaspoon ground black pepper",
        "2 pounds Yukon Gold potatoes, unpeeled, very thinly sliced",
        "4 cups very thinly sliced cored fennel bulbs (about 2 pounds), fronds chopped and reserved",
        "Paprika"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Potato",
        "Side",
        "Bake",
        "Vegetarian",
        "Goat Cheese",
        "Fennel",
        "Fall",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Scalloped Potatoes with Fennel, Mushrooms and Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/scalloped-potatoes-with-fennel-mushrooms-and-goat-cheese-15583"
}
