{
    "directions": [
        "Heat olive oil in a 2- to 3-quart heavy saucepan over medium-low heat until it shimmers, then cook onion, covered, over low heat, stirring occasionally, until wilted, about 10 minutes. Stir in 1/2 teaspoon salt and 1/4 teaspoon pepper and cook, covered, stirring occasionally, until very tender but not colored, about 20 minutes more. (If onion begins to color, add 1 to 2 tablespoons of water as necessary during cooking.)",
        "Purée onion in a blender until smooth (use caution when blending hot foods). Transfer to a bowl; keep warm, covered.",
        "Cut 1/2 inch from top and bottom of grapefruit with a sharp knife, exposing fruit at both ends. Cut peel and pith from sides, then cut segments free from membranes. Cut segments into 1/3-inch dice and reserve.",
        "Boil Prosecco and shallot in a small heavy saucepan until liquid is reduced to 1 to 2 tablespoons, about 5 minutes. Reduce heat to medium-low, then whisk in 6 tablespoons butter, 1 tablespoon at a time, whisking constantly, adding each piece before previous one has completely melted, and lifting pan from heat occasionally to cool. Remove from heat; keep warm, covered.",
        "Heat a dry 12-inch heavy skillet over medium-high heat until very hot, at least 2 minutes.",
        "Meanwhile, pat scallops dry and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper.",
        "Add vegetable oil to hot skillet, swirling to coat, then sear scallops without crowding, undisturbed, until undersides are well browned, about 3 minutes. Add remaining 2 tablespoons butter to skillet, swirling skillet (so butter helps release scallops), then turn scallops over and cook until just cooked through, about 1 minute more.",
        "Spoon 2 tablespoons onion purée onto each of 4 plates, then top with scallops, browned sides up, and diced grapefruit. Drizzle with Prosecco butter."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "1 sweet onion (3/4 pound) such as Vidalia, OsoSweet, or Walla Walla, halved lengthwise and thinly sliced",
        "1 pink grapefruit",
        "3/4 cup Prosecco",
        "2 tablespoons minced shallot",
        "1 stick cold unsalted butter, cut into tablespoons, divided",
        "12 large sea scallops (about 1 1/2 pounds total), tough ligament from side discarded",
        "1 teaspoon vegetable oil",
        "Garnish: chervil sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fruit",
        "Onion",
        "Sauté",
        "Grapefruit",
        "Seafood",
        "Scallop",
        "Sparkling Wine",
        "Gourmet"
    ],
    "title": "Scallops with Onion Purée, Pink Grapefruit, and Prosecco Brut",
    "url": "http://www.epicurious.com/recipes/food/views/scallops-with-onion-puree-pink-grapefruit-and-prosecco-brut-241525"
}
