{
    "directions": [
        "In a skillet cook the onion in the oil over moderately low heat, stirring, until it is softened, add the gingerroot, and cook the mixture, stirring, for 1 minute. Add the tomatoes with the juice and simmer the sauce, stirring occasionally, for 5 to 8 minutes, or until it is thickened slightly. Season the sauce with salt and pepper and keep it warm.",
        "Discard the tough bit of muscle clinging to the side of each scallop if necessary and in a food processor purée the scallops with the salt. With the motor running add the cream in a stream and blend the mixture until it is just smooth. In a large deep skillet bring 1 1/2 inches of salted water to a simmer. Scoop out and form oval mounds of the mousse with 2 soup spoons dipped in cold water, dropping each mound as it is formed into the simmering water, and poach the quenelles at a bare simmer, turning them occasionally, for 6 minutes, or until they are springy to the touch. Transfer the quenelles with a slotted spoon to paper towels, let them drain briefly, and divide them between 2 heated plates.",
        "Spoon the sauce over and around the quenelles and garnish the quenelles with the parsley."
    ],
    "ingredients": [
        "1/4 cup minced onion",
        "1 tablespoon vegetable oil",
        "3/4 teaspoon grated peeled fresh gingerroot",
        "a 14- to 16-ounce can tomatoes, drained, reserving the juice, and chopped fine",
        "3/4 pound sea scallops, rinsed and patted dry",
        "1/2 teaspoon salt",
        "1/2 cup chilled heavy cream",
        "1 tablespoon minced fresh parsley leaves for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Tomato",
        "Poach",
        "Scallop",
        "Fall",
        "Gourmet"
    ],
    "title": "Scallop Quenelles with Gingered Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/scallop-quenelles-with-gingered-tomato-sauce-10679"
}
