{
    "directions": [
        "Rinse rice in strainer under cold running water until water runs clear; drain well. Transfer rice to heavy medium saucepan. Add 2 cups clam juice, 1 tablespoon soy sauce, 1 tablespoon sake, ginger, sugar, and salt; bring to boil. Reduce heat to medium-low, cover, and simmer 10 minutes. Remove from heat; let stand, covered, until all liquid is absorbed and rice is tender, about 10 minutes.",
        "Place green tea leaves in medium teapot. Pour 2 cups boiling water over; cover and let steep while preparing scallops.",
        "Bring remaining 1/2 cup clam juice, 2 tablespoons soy sauce, and 2 tablespoons sake to boil in small skillet. Add scallops; cover and reduce heat to medium-low. Cook 30 seconds. Turn scallops over; cover and cook 30 seconds. Using slotted spoon, transfer scallops to plate; reserve cooking liquid in skillet. Slice each scallop in half horizontally to create 2 rounds.",
        "Divide rice among 4 shallow soup bowls. Spoon reserved scallop cooking liquid around rice. Arrange scallops, cut side up, atop rice. Sprinkle salmon roe, sesame seeds, and green onion over. Strain hot tea over scallops. Serve, passing wasabi alongside.",
        "*Available in tubes at Japanese markets and in the Asian foods section of some supermarkets."
    ],
    "ingredients": [
        "1 1/2 cups short-grain rice (such as sushi rice)",
        "2 1/2 cups bottled clam juice, divided",
        "3 tablespoons soy sauce, divided",
        "3 tablespoons sake, divided",
        "2 teaspoons minced peeled fresh ginger",
        "1 teaspoon sugar",
        "1/2 teaspoon coarse kosher salt",
        "2 tablespoons loose green tea leaves or tea leaves from about 6 tea bags",
        "2 cups boiling water",
        "8 ounces sea scallops (about 12), side muscles removed",
        "1 4-ounce jar salmon roe (caviar)",
        "2 teaspoons white sesame seeds, toasted",
        "1 green onion, thinly sliced",
        "Wasabi paste*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tea",
        "Ginger",
        "Rice",
        "Shellfish",
        "Quick & Easy",
        "Wasabi",
        "Scallop",
        "Sake",
        "Winter",
        "Healthy",
        "Soy Sauce",
        "Simmer"
    ],
    "title": "Scallop Tea Rice",
    "url": "http://www.epicurious.com/recipes/food/views/scallop-tea-rice-109068"
}
