{
    "directions": [
        "Wash leeks well in a bowl of cold water, then lift out and drain well. Cook half of leeks in butter in a 3-quart heavy saucepan over low heat, covered, stirring occasionally, until very soft, about 10 minutes.",
        "While leeks are cooking, peel potato and cut into 1/3-inch dice. Add wine, thyme sprig, and white pepper to leeks and boil until most of liquid is evaporated, about 1 minute. Add 1/3 cup potato (reserve remaining diced potato in a bowl of cold water), 1/2 cup scallops, and clam juice, then simmer, uncovered, until potato is tender, about 15 minutes.",
        "Drain remaining potatoes in a colander and cook with carrot, celery, and remaining leeks in a 1-quart saucepan of  until just tender, about 5 minutes, then drain.",
        "Cook bacon in a skillet over moderate heat, stirring occasionally, until crisp, about 3 minutes, and transfer to paper towels to drain.",
        "Remove and discard thyme sprig and purée soup in 2 batches in a blender until very smooth (use caution when blending hot liquids), then transfer to a bowl. Return soup to cleaned saucepan, then add vegetable mixture, remaining scallops, milk, and salt and cook over moderate heat (do not let boil), stirring, until scallops are just cooked through, about 2 minutes. Serve sprinkled with bacon."
    ],
    "ingredients": [
        "2 large leeks (white and pale green parts only), finely chopped (1 1/2 cups)",
        "1 tablespoon unsalted butter",
        "1 large russet (baking) potato (3/4 pound)",
        "2 tablespoons dry white wine",
        "1 (6-inch) fresh thyme sprig",
        "1/4 teaspoon white pepper",
        "3/4 pound sea scallops, tough muscle removed from side of each if necessary and scallops cut into 1/3-inch dice",
        "3 1/2 cups bottled clam juice (28 ounces)",
        "1 medium carrot, cut into 1/3-inch dice (1/2 cup)",
        "1 large celery rib, cut into 1/3-inch dice (1/2 cup)",
        "1 ounce sliced bacon (about 2 slices), chopped",
        "1/2 cup whole milk",
        "1/4 teaspoon salt, or to taste",
        "Accompaniment: herbed oyster crackers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Blender",
        "Potato",
        "Shellfish",
        "Low Fat",
        "Lunch",
        "Bacon",
        "Scallop",
        "Simmer",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Scallop Chowder",
    "url": "http://www.epicurious.com/recipes/food/views/scallop-chowder-108106"
}
