{
    "directions": [
        "Preheat oven to 350°F. Coat a 13x9x2\" or other 3-quart baking dish with 1 tablespoon butter; set aside.",
        "Heat remaining 1 tablespoon butter and oil in a large deep skillet over medium heat. Add fennel; season with salt and pepper and cook, stirring occasionally, until fennel is evenly coated with fat and begins to sizzle, about 2 minutes. Add wine and 1 bay leaf. Cover, reduce heat to medium-low, and cook, stirring occasionally, until fennel is tender, about 20 minutes.",
        "Uncover, increase heat to medium-high, and cook, stirring often, until liquid has evaporated and fennel is golden brown and caramelized, about 10 minutes. Add 1-2 tablespoons water to deglaze pan, scraping up any browned bits from bottom of pan for added flavor. Discard bay leaf. Set fennel aside.",
        "Bring remaining bay leaf, potatoes, cream, milk, and garlic to a simmer in a large wide pot (watch carefully; do not let mixture boil over). Season with salt and pepper and cover with lid slightly ajar; simmer gently until potatoes are just tender and liquid has thickened, about 10 minutes. Discard bay leaf and garlic.",
        "Using a slotted spoon, transfer 1/3 of potatoes to prepared dish, spreading in an even layer. Season with salt and pepper and sprinkle with 1/3 cup Comté. Cover with half of fennel. Repeat process, finishing with remaining 1/3 cup Comté. Pour cream mixture over. Cover gratin tightly with foil and bake for 35 minutes. Remove foil and bake gratin until top is bubbling and golden, about 30 minutes longer. DO AHEAD: Gratin can be made 1 day ahead. Let cool; cover and chill. Rewarm, covered, in a 350°F oven for 20 minutes, then uncover and cook until bubbling around edges and warmed through in the center, about 20 minutes longer."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter, room temperature, divided",
        "1 tablespoon extra-virgin olive oil",
        "2 fennel bulbs (about 1 1/2 pounds), trimmed, quartered, cored, thinly sliced (about 6 cups)",
        "Kosher salt, freshly ground pepper",
        "1/2 cup dry white wine or dry vermouth",
        "2 bay leaves",
        "2 1/2 pounds waxy potatoes (such as Yukon Gold), peeled, sliced 1/8\" thick",
        "1 1/2 cups heavy cream",
        "1 1/2 cups whole milk",
        "1 garlic clove, halved",
        "1 cup shredded Comté or Gruyère"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Potato",
        "Side",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Casserole/Gratin",
        "Fennel",
        "Fall",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Scalloped Potatoes with Caramelized Fennel",
    "url": "http://www.epicurious.com/recipes/food/views/scalloped-potatoes-with-caramelized-fennel-51123050"
}
