{
    "directions": [
        "Combine onion, juices, jalapeño, and salt in a bowl.",
        "Poach scallops in 4 quarts of simmering salted water, stirring occasionally, until just cooked through (scallops should be opaque with centers slightly pink), about 1 minute. Drain scallops and gently toss with marinade. Marinate scallops, covered and chilled, 3 hours.",
        "Boil pasta in a large pot of boiling salted water until just cooked through, 1 to 2 minutes. Reserve 1 cup cooking water, then drain pasta in a colander. Rinse briefly under cold running water to stop cooking (don’t cool pasta completely) and drain well. Toss pasta with extra-virgin olive oil.",
        "Heat 1/4 inch olive or vegetable oil in a 10-inch nonstick skillet over moderate heat until hot but not smoking. Form cakes by dropping a few strands of loosely squiggled pasta into a 1-tablespoon measure to fill it and inverting tablespoon into oil, flattening cake slightly if necessary. (If strands in bowl become too sticky to handle, stir in a little reserved pasta water, 1 teaspoon at a time. You need some starch from pasta to hold cake together, but you don’t want strands to become wet.) Cook cakes, 4 at a time, until crisp, 45 seconds to 1 minute per side, and drain on paper towels. Season cakes with salt.",
        "Soak onion in cold water to cover 20 minutes, then drain and rinse well. Stir together onion, cilantro, tomatillos, tomato, jalapeño, and salt and chill, covered, until ready to use.",
        "Lift scallops out of marinade and put 1 on top of each pasta cake. Top with salsa and serve immediately."
    ],
    "ingredients": [
        "1/2 cup thinly sliced white onion",
        "1 cup fresh orange juice",
        "1 cup fresh lime juice",
        "1 fresh jalapeño chile, sliced, including seeds",
        "2 tablespoons kosher salt",
        "24 medium sea scallops (1 1/4 pound), tough muscles removed from sides if necessary and scallops halved horizontally",
        "6 ounce black (squid ink) angel’s hair pasta",
        "1 teaspoon extra-virgin olive oil",
        "About 1 cup olive or vegetable oil",
        "1/2 cup minced white onion",
        "1/2 cup chopped fresh cilantro",
        "1/2 cup finely chopped fresh tomatillos",
        "1/2 cup finely chopped tomato",
        "1 tablespoon minced fresh jalapeño chile, including seeds",
        "1 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Pasta",
        "Marinate",
        "Cocktail Party",
        "Lime",
        "Orange",
        "Scallop",
        "Healthy",
        "Tomatillo",
        "Jalapeño",
        "Cilantro",
        "Entertaining",
        "Gourmet"
    ],
    "title": "Scallop Ceviche on Black Pasta Cakes with Cilantro Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/scallop-ceviche-on-black-pasta-cakes-with-cilantro-salsa-104384"
}
