{
    "directions": [
        "Heat 1 tablespoon oil in heavy small skillet over medium heat. Add capers; sauté until crisp, about 1 minute. Using slotted spoon, transfer to paper towels to drain.",
        "Boil wine and next 4 ingredients in small saucepan over medium heat until liquid is reduced to 3 tablespoons, about 15 minutes. Add cream; boil until liquid is reduced by half, about 2 minutes. (Capers and sauce can be made 2 hours ahead. Let stand at room temperature.)",
        "Melt 2 tablespoons butter in heavy large skillet over medium heat. Add leeks and 3/4 cup water. Simmer until leeks are tender and almost all water evaporates, about 4 minutes. Mix in chives. Season with salt and pepper. Transfer leek mixture to platter. Tent with foil.",
        "Sprinkle scallops with salt and pepper. Melt 2 tablespoons butter and 1 tablespoon oil in another heavy large skillet over medium heat. Add scallops; sauté until cooked, about 2 minutes per side. Arrange atop leeks. Tent with foil.",
        "Reheat sauce over medium heat. Gradually add 6 tablespoons butter; whisk until smooth, about 1 minute (do not boil). Strain sauce into small bowl. Stir in capers and tarragon. Season with salt and pepper. Spoon over scallops."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 tablespoon drained capers, patted dry",
        "2 1/2 cups dry white wine",
        "7 whole peppercorns",
        "3 shallots, thinly sliced",
        "2 fresh thyme sprigs",
        "1 bay leaf",
        "1/4 cup whipping cream",
        "10 tablespoons (1 1/4 sticks) butter, cut into pieces",
        "5 leeks, chopped (white and pale green parts only; about 4 cups)",
        "3/4 cup water",
        "1/3 cup (packed) chopped fresh chives",
        "1 pound sea scallops",
        "1 tablespoon chopped fresh tarragon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Shellfish",
        "Sauté",
        "Scallop",
        "Leek",
        "White Wine",
        "Tarragon",
        "Chive",
        "Capers"
    ],
    "title": "Scallops with \"Melted\" Leeks and Tarragon-Caper Butter",
    "url": "http://www.epicurious.com/recipes/food/views/scallops-with-melted-leeks-and-tarragon-caper-butter-107058"
}
