{
    "directions": [
        "Heat vegetable oil in a small skillet over medium-high heat. Add 1 tablespoon chopped ginger and cook, stirring, until fragrant, about 1 minute. Transfer ginger to a small bowl; mix in soy sauce, lemon juice, sesame oil, and sugar. Set sauce aside.",
        "Line a large steamer basket with scallion whites, cilantro stems, and sliced ginger. Set scallion greens and cilantro leaves aside.",
        "Using a small knife, score skin side of fish at 1\" intervals; season with salt and place in steamer, skin side up. Set steamer in a large pot filled with 1\" of simmering water and cover; steam fish until cooked through, 6–8 minutes.",
        "Heat vegetable oil in a large skillet over medium-high heat. Add garlic and cook, stirring, until softened, about 1 minute. Add kale, 1/2 teaspoon salt, and 1/4 cup water. Cover and cook, tossing occasionally, until leaves are tender and bright green, about 2 minutes. Mix in kimchi, if using, and sesame oil; season with salt and pepper.",
        "Spoon sauce over fish, top with reserved scallion greens and cilantro leaves, and serve with sesame kale."
    ],
    "ingredients": [
        "1 teaspoon vegetable oil",
        "1 tablespoon finely chopped peeled ginger, plus four 1/2\"-thick slices",
        "1 tablespoon reduced-sodium soy sauce",
        "2 teaspoons fresh lemon juice",
        "1/2 teaspoon toasted sesame oil",
        "Pinch of sugar",
        "2 scallions, white and green parts separated, thinly sliced",
        "6 sprigs cilantro, leaves and stems separated",
        "2 5-ounce skin-on firm white fish fillets (such as branzino)",
        "Kosher salt",
        "1 tablespoon vegetable oil",
        "1 garlic clove, thinly sliced",
        "1 bunch Tuscan kale, center ribs and stems removed, cut into 1\" strips",
        "1/2 teaspoon kosher salt plus more",
        "1/2 cup kimchi, chopped (optional)",
        "1 teaspoon toasted sesame oil",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Sauté",
        "Steam",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Kale",
        "Healthy",
        "Green Onion/Scallion",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Scallion Fish with Sesame Kale",
    "url": "http://www.epicurious.com/recipes/food/views/scallion-fish-with-sesame-kale-51198470"
}
