{
    "directions": [
        "Preheat oven to 400°F. and lightly butter two 3-quart gratin dishes (about 15 by 10 by 2 inches).",
        "Mince garlic and in a large bowl whisk together with 4 cups cream, broth, flour, salt, nutmeg, and pepper.",
        "Trim fennel stalks flush with bulbs, reserving stalks for another use, and cut bulbs crosswise into 1/4-inch-thick slices. Divide fennel into 4 equal portions. Peel potatoes and with a mandoline or other manual slicer cut crosswise into 1/8-inch-thick slices. Divide potatoes into 6 equal portions. In 1 gratin dish arrange 1 portion potatoes, spreading evenly, and top with 1 portion fennel slices. Top fennel with a second portion potatoes, spreading evenly. Season layer with salt and pepper and top with a second portion fennel. Pour half of cream mixture over fennel and top with a third portion potatoes, overlapping them. Press down on potatoes to temporarily submerge them in cream mixture.",
        "Repeat layering in second gratin dish.",
        "Melt butter. Brush scalloped vegetables with all of butter and bake in upper and lower thirds of oven 30 minutes. Remove gratin dishes from oven and pour 1/2 cup remaining cream evenly over each top potato layer. Season scalloped vegetables with salt and pepper and bake, switching positions of dishes in oven, 30 minutes more, or until tops are golden and potatoes are tender. Scalloped vegetables may be baked 1 day ahead and cooled completely before being chilled, covered. Bring scalloped vegetables to room temperature before reheating, covered."
    ],
    "ingredients": [
        "5 garlic cloves",
        "5 cups heavy cream",
        "3 cups chicken broth",
        "3 tablespoons all-purpose flour",
        "1 tablespoon salt",
        "1/4 teaspoon freshly grated nutmeg",
        "1/4 teaspoon freshly ground black pepper",
        "3 pounds fennel bulbs (sometimes called anise; about 3 large )",
        "4 pounds yellow-fleshed potatoes such as Yukon Gold",
        "1 stick (1/2 cup) unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Garlic",
        "Potato",
        "Vegetable",
        "Side",
        "Bake",
        "Christmas",
        "Winter",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Scalloped Fennel and Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/scalloped-fennel-and-potatoes-14550"
}
