{
    "directions": [
        "Divide the dough into 2 pieces, one twice the size of the other, and chill the smaller piece, wrapped in wax paper. Roll out the large piece of dough 1/8 inch thick on a floured surface, fit it into a 10-inch pie plate (preferably ovenproof glass), and trim the edge. Chill the shell. Roll out the smaller piece of dough 1/8 inch thick on the floured surface and with a 1-inch decorative cutter cut out about 90 shapes. Moisten the edge of the shell and press the shapes onto it, 1 at a time, overlapping them slightly, until the edge is covered. Line the shell with foil, fill the foil with the rice, being careful not to disturb the decorative edge, and bake the shell in the lower third of a preheated 425°F. oven for 10 minutes. Remove the rice and foil carefully and bake the shell for 8 minutes more, or until it is pale golden. let the shell cool in the plate on a rack.",
        "In a food processor fitted with a 1/8-inch slicing disk or with a hand-held slicing device slice the potatoes thin. In a kettle bring 3 quarts water to a boil, in it boil the potatoes for 5 minutes, or until they are just tender, and drain them in a colander. Plunge the potatoes into a bowl of cold water to stop the cooking and drain them very well.",
        "Arrange one fifth of the potato slices, overlapping them, in the shell with one fifth of the Cheddar and chives and salt and pepper to taste. Make 4 more layers in the same manner with the remaining potatoes, Cheddar, and chives and salt and pepper to taste.",
        "In a bowl whisk together the eggs, the milk, the sour cream, and salt and pepper to taste, pour the mixture slowly over the potatoes, letting it seep between the layers, and bake the pie on a baking sheet in the middle of a preheated 375°F. oven for 40 minutes, or until the custard is pale golden and the potatoes are tender. Transfer the pie to a rack and let it cool for 10 minutes. The pie may be made 1 day in advance, kept covered and chilled, and reheated in a 375°F. oven for 15 minutes. Serve the pie warm or at room temperature.",
        "In a large bowl blend the flour, the butter, the vegetable shortening, and the salt until the mixture resembles meal. Add 3 tablespoons ice water, toss the mixture until the water is incorporated, and form the dough into a ball. Knead the dough lightly with the heel of the hand against a smooth surface for a few seconds to distribute the fat evenly and re-form it into a ball. Dust the dough with flour and chill it, wrapped in wax paper, for 1 hour."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits",
        "2 tablespoons cold vegetable shortening",
        "1/4 teaspoon salt",
        "raw rice for weighting the shell",
        "1 1/4 pounds small red potatoes",
        "1 1/2 cups grated sharp Cheddar (about 6 ounces)",
        "1/4 cup chopped fresh chives",
        "3 large eggs",
        "3/4 cup milk",
        "1 cup sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Potato",
        "Appetizer",
        "Side",
        "Bake",
        "Vegetarian",
        "Cheddar",
        "Chill",
        "Chive",
        "Gourmet",
        "Sugar Conscious"
    ],
    "title": "Scalloped Potato, Cheddar, and Chive Pie",
    "url": "http://www.epicurious.com/recipes/food/views/scalloped-potato-cheddar-and-chive-pie-11085"
}
