{
    "directions": [
        "Peel the shrimp and save the shells for shrimp oil or shrimp broth or discard them. Pick up a shrimp and make a shallow slit down the middle of the length of the back to expose the black intestine. Slit all the shrimp and lift out the black intestine with the point of your paring knife, or flush it out under cold running water. If using defrosted cleaned shrimp, skip this step. Either way, dry the shrimp well with paper towels and set them aside.",
        "Clean the sea scallops by peeling and discarding the little strip of muscle that is attached to one side. (If your scallops are somewhat old the muscle strip may not be there.) Place the scallops in a colander and wash them well under cold running water — keep an eye open for specks of dark sand. Drain the scallops well and roll them in paper towels to dry them thoroughly. If the scallops are very large, cut them into 1/2\" to 3/4\" pieces (it's the thickness that determines the cooking time, not how wide they are). If you're using bay scallops, don't remove the tiny strip of muscle, it's tender. Either way, set the scallops aside while you're preparing the sauce.",
        "Put the bacon fat or vegetable oil into a skillet or stew-type pot that's wide and deep enough to hold all the seafood in about 2 layers with about 2 cups of sauce. Place the skillet over medium-high heat and add the onion, peppers, and celery. Cook the vegetables, adjusting the heat if necessary and stirring frequently, until they have become slightly wilted and a little brown, about 5 minutes. When the vegetables are ready, turn the heat to low and stir in the garlic, thyme, oregano, bay leaf and cayenne, cooking for about 30 seconds. Add the flour and continue to stir for about 1 minute more to cook away its raw taste. Add the tomatoes and their juice, and simmer the sauce, covered, over very low heat, about 10 minutes, or until the vegetables are almost tender and it's very thick. Stir the sauce once or twice during this period. Season it generously with salt, pepper, and Tabasco, and set it aside. The sauce can be made 3 or 4 days in advance and refrigerated, but be sure to heat it through before continuing with the recipe.",
        "In a separate bowl, mix the scallops and shrimp together and season them well with salt and pepper. (If you're using bay scallops that are smaller than 1/2\" in width, don't mix them with the shrimp at this point — see Note.) Remove about one half of the sauce to a bowl, spreading the remaining sauce evenly over the bottom of the skillet or pot. Distribute the seafood evenly over the sauce in the skillet and spread the reserved sauce over the top of the seafood — it won't completely cover. Place the skillet over medium-high heat and, without stirring, heat the mixture until you see 3 or 4 bubbles at the surface. Reduce the heat to very low, tightly cover the skillet, and gently simmer the mixture until the shrimp are white throughout and the scallops are slightly translucent in the center, 8 to 12 minutes, cutting one of each to check, if you're unsure. (If you prefer, you can bake the Creole in a preheated 325°F oven once the bubbles have come to the surface.)",
        "The Creole will be much thinner now from the shellfish juices. Taste it for seasoning and adjust it with salt, a generous amount of pepper, and additional Tabasco, if you like.",
        "Ladle the Creole into warm soup plates or bowls, discarding the bay leaf. Sprinkle each serving with chopped parsley and serve right away.",
        "<a name=\"note\">Note:</a> If you've reserved bay scallops, add them approximately halfway through the cooking (depending on their size), pressing them into the simmering mixture as best as possible. Cover the skillet again and finish cooking."
    ],
    "ingredients": [
        "1 pound large shrimp in the shell, or approximately 3/4 pound frozen, cleaned shrimp, defrosted (about 30 pieces)",
        "1 1/4 pounds sea or bay scallops",
        "3 tablespoons bacon fat or vegetable oil",
        "1/2 cup small diced or chopped onion",
        "1/2 cup small diced or chopped green bell pepper",
        "1/2 cup small diced or chopped red bell pepper",
        "1/3 cup small diced or chopped celery",
        "2 garlic cloves, finely chopped",
        "3/4 teaspoon dried thyme leaves",
        "1/4 teaspoon dried oregano leaves",
        "1 bay leaf",
        "1/4 teaspoon cayenne",
        "2 teaspoons flour",
        "1 cup crushed or chopped drained canned plum tomatoes, plus 1/4 cup of their juice",
        "Salt and freshly ground black or white pepper to taste",
        "Tabasco sauce to taste",
        "1 tablespoon chopped fresh (flat-leaf or curly) parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Scallop",
        "Shrimp",
        "Bell Pepper"
    ],
    "title": "Scallop and Shrimp Creole",
    "url": "http://www.epicurious.com/recipes/food/views/scallop-and-shrimp-creole-14831"
}
