{
    "directions": [
        "Trim asparagus, then cut stems into 1/4-inch-thick diagonal slices, leaving tips whole.",
        "Heat 1 tablespoon oil in a 12-inch heavy nonstick skillet over moderately high heat until hot but not smoking, then sauté asparagus, stirring occasionally, until just tender, 5 to 6 minutes. Transfer with a slotted spoon to a plate, reserving skillet off heat (do not clean).",
        "Pat scallops dry and sprinkle with pepper and 1/2 teaspoon salt. Add 1 tablespoon oil to skillet and heat over moderately high heat until hot but not smoking, then sauté half of scallops, turning over once, until browned and just cooked through, 4 to 6 minutes total. Transfer scallops with tongs to another plate as cooked.",
        "Wipe out skillet with paper towels, then add remaining tablespoon oil and heat until hot but not smoking. Sauté remaining scallops, turning over once, until browned and cooked through, 4 to 6 minutes total, transferring to plate. (Do not wipe out skillet after second batch.)",
        "Carefully add wine and vinegar to skillet (mixture may spatter) and boil, scraping up brown bits, until liquid is reduced to about 2 tablespoons, about 1 minute. Add any scallop juices accumulated on plate and bring to a simmer.",
        "Reduce heat to low and whisk in butter, 1 tablespoon at a time, until incorporated.",
        "Add asparagus and remaining 1/4 teaspoon salt and cook until heated through, about 1 minute.",
        "Serve scallops topped with asparagus and sauce."
    ],
    "ingredients": [
        "1 lb medium asparagus",
        "3 tablespoons olive oil",
        "2 lb large sea scallops, tough ligament removed from side of each if attached",
        "1/2 teaspoon black pepper",
        "3/4 teaspoon salt",
        "1/3 cup dry white wine",
        "2 teaspoons white-wine vinegar",
        "1/2 stick (1/4 cup) unsalted butter, cut into tablespoon pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Vegetable",
        "Sauté",
        "Quick & Easy",
        "Spring",
        "Summer",
        "Gourmet"
    ],
    "title": "Scallops with Asparagus",
    "url": "http://www.epicurious.com/recipes/food/views/scallops-with-asparagus-238094"
}
