{
    "directions": [
        "Grind first 4 ingredients and 1/2 teaspoon salt to a fine powder in spice mill. Transfer to a small saucepan over medium-low heat; add oil. Cook until oil begins to simmer, 2-3 minutes. Scrape into a small bowl; stir in garlic and lemon zest. Let cool for 5 minutes, then stir in 1 tablespoon lemon juice. Season with salt, pepper, and more juice, if desired. DO AHEAD: Can be made 1 week ahead. Cover; chill. Rewarm before using.",
        "Heat grapeseed oil in a large heavy skillet over high heat until oil begins to smoke. Season scallops with salt and pepper. Sear until well browned, about 3 minutes. Turn; cook until just barely opaque in center, about 30 seconds longer.",
        "Meanwhile, place herbs in a medium bowl and drizzle olive oil and lemon juice over; season salad to taste with salt and pepper. Divide scallops between 2 plates; spoon 1 tablespoon spice oil over each plate (reserve remaining oil for another use). Garnish with salad."
    ],
    "ingredients": [
        "1 teaspoon cumin seeds",
        "1 teaspoon paprika",
        "1/4 teaspoon crushed red pepper flakes",
        "6 black peppercorns plus freshly ground for seasoning",
        "1/2 teaspoon kosher salt plus more",
        "1/4 cup olive oil",
        "2 garlic cloves, minced",
        "1 teaspoon finely grated lemon zest",
        "1 tablespoon (or more) fresh lemon juice",
        "1 1/2 tablespoons grapeseed or vegetable oil",
        "8 large or 12 medium sea scallops, side muscle removed",
        "Kosher salt and freshly ground black pepper",
        "2 cups mixed cilantro and flat-leaf parsley with tender stems",
        "Olive oil (for drizzling)",
        "1 tablespoon fresh lemon juice",
        "Special equipment: A spice mill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Sauté",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Seafood",
        "Scallop",
        "Healthy",
        "Low Cholesterol",
        "Cilantro",
        "Parsley",
        "Cumin",
        "Paprika",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Scallops with Spice Oil",
    "url": "http://www.epicurious.com/recipes/food/views/scallops-with-spice-oil-395435"
}
