{
    "directions": [
        "In a small heatproof bowl, pour enough boiling water over tomatoes to cover and let stand 20 to 30 minutes, or until soft. Drain tomatoes, discarding liquid, and slice thin.",
        "While tomatoes are soaking, remove tough muscle from side of each scallop if necessary and halve scallops if large. In a 6-quart kettle bring 5 quarts salted water to a boil for pasta.",
        "In a large heavy skillet heat oil over moderately high heat until hot but not smoking and sauté scallops until pale golden on edges and cooked through, about 2 minutes on each side. Transfer scallops to a heatproof dish and keep warm, covered.",
        "Add shallots to oil remaining in skillet and cook, covered, over moderate heat, stirring occasionally, until softened. Add wine and boil, uncovered, stirring to scrape up browned bits, until reduced to about 3 tablespoons. Add pine nuts, tomatoes, and cream and bring just to a boil. Stir in Parmesan and pesto and remove skillet from heat. Stir in scallops.",
        "Cook pasta in boiling water until al dente and drain in a colander. Return pasta to kettle and add scallop mixture, tossing gently to combine."
    ],
    "ingredients": [
        "3 ounces dried tomatoes (about 1 cup), not packed in oil",
        "1 pound sea scallops",
        "1 pound penne or bow-tie pasta",
        "1 tablespoon olive oil",
        "1 1/2 tablespoons minced shallots",
        "1 cup dry white wine",
        "1/2 cup pine nuts, toasted until golden",
        "2 cups heavy cream",
        "1/4 cup freshly grated Parmesan",
        "1/2 cup prepared basil pesto"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Pasta",
        "Tomato",
        "Sauté",
        "Parmesan",
        "Basil",
        "Pine Nut",
        "White Wine",
        "Boil",
        "Gourmet"
    ],
    "title": "Scallops Verde",
    "url": "http://www.epicurious.com/recipes/food/views/scallops-verde-14307"
}
