{
    "directions": [
        "In a large saucepan combine the carrot, the peas, the cauliflower, the potato, drained, and the green beans with 2 cups salted cold water and boil the mixture for 7 minutes, or until the vegetables are tender. Add the spinach and cook the mixture, stirring, for 1 minute. In a small bowl whisk together the half-and-half and the yolk, stir in 1 cup of the vegetable mixture, a little at a time, and stir the yolk mixture gradually back into the pan. Cook the mixture, stirring, for 1 minute, or until a thermometer registers 160°F. (but do not let it boil). Add the shrimp and simmer the mixture for 1 minute, or until the shrimp are pink and just firm. Add the salt, the chopped dill, pepper to taste, and the Sherry, divide the soup between 2 large soup bowls, and garnish each serving with a dill sprig."
    ],
    "ingredients": [
        "1 carrot, sliced thin",
        "1/3 cup shelled fresh peas or frozen peas, thawed",
        "1 cup 1/2-inch cauliflower flowerets",
        "1 small boiling potato, peeled, cut into 1/4-inch dice, and reserved in a bowl of water",
        "1/4 pound green beans, trimmed and cut into 1/2-inch pieces",
        "2 ounces fresh spinach, coarse stems discarded and the leaves washed well, spun dry, and chopped fine (about 1 cup)",
        "1/2 cup half-and-half",
        "1 large egg yolk",
        "1/4 pound small shrimp, shelled, deveined if desired",
        "1 teaspoon salt",
        "1 tablespoon finely chopped fresh dill plus 2 dill sprigs for garnish",
        "1 teaspoon dry Sherry if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Potato",
        "Quick & Easy",
        "Shrimp",
        "Cauliflower",
        "Green Bean",
        "Dill",
        "Simmer",
        "Boil",
        "Gourmet"
    ],
    "title": "Scandinavian Vegetable Soup with Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/scandinavian-vegetable-soup-with-shrimp-10560"
}
