{
    "directions": [
        "Line baking sheets with waxed paper or parchment paper, and sprinkle with flour.",
        "Heat the milk just to the boiling point in a saucepan. Stir together the flour, baking powder, and sugar in a bowl until well combined, then mix in the butter and gradually pour in the hot milk, mixing between each addition, until the mixture forms a stiff dough.",
        "Turn the dough out onto an oiled work surface, and knead until the dough is cool and smooth, about 5 minutes. Cut the dough into 4 equal-sized pieces, then cut those pieces into 4 pieces, making 16 pieces. Divide each of the 16 pieces in half to make 32 equal-sized pieces of dough. Cover the pieces with a cloth, and let the dough rest for about 20 minutes.",
        "Working on a floured surface, roll each piece of dough out into a thin circle about 8 inches in diameter. Place the circles onto the prepared baking sheets, cover with a cloth, and allow to rest for 30 minutes.",
        "Fold each circle in half, then in half again. With a sharp knife or small cookie cutters, snip and cut shapes out of the folded dough the way you make a paper snowflake. Carefully open the circle back up, revealing the pattern. Stack the cut snowflakes between sheets of waxed paper on a flat surface.",
        "Heat oil in a deep skillet to 375 degrees F (190 degrees C). The oil should be about 2 inches deep.",
        "Carefully lay a snowflake into the hot oil, keeping it flat. Allow it to fry until golden brown and crisp, about 1 minute per side. Gently flip the snowflakes over with a tongs to prevent breakage. Drain the fried snowflakes on paper towels, and sprinkle with confectioners' sugar."
    ],
    "ingredients": [
        "2 cups milk",
        "4 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 tablespoon white sugar",
        "1 tablespoon butter, softened",
        "3 cups vegetable oil for frying",
        "1 cup confectioners' sugar, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Scandinavian Snowflake Cookies",
    "url": "http://allrecipes.com/recipe/212859/scandinavian-snowflake-cookies/"
}
