{
    "directions": [
        "Preheat oven to 350°F. Lightly butter 9-inch-diameter cake pan with 2-inch-high sides. Line bottom of pan with parchment paper. Mix first 5 ingredients in medium bowl. Dissolve baking soda in 1/4 cup water.",
        "Using electric mixer, beat shortening and sugar in large bowl until blended. Beat in egg. Gradually beat in molasses. Mix in dry ingredients alternately with buttermilk. Beat in baking soda mixture. Transfer batter to prepared pan. Bake until tester inserted into center comes out clean, about 40 minutes. Transfer pan to rack and cool cake 10 minutes. Cut around pan sides to loosen cake. Turn cake out onto rack; peel off paper. Cool completely.",
        "Combine all ingredients in heavy medium saucepan. Cook over medium-low heat until thick and reduced to 1 cup, stirring occasionally, about 20 minutes. Transfer filling to small bowl and cool completely. Discard cinnamon stick. (Cake and filling can be prepared 1 day ahead. Cover cake and let stand at room temperature. Cover filling with plastic wrap and refrigerate.)",
        "Beat chilled cream, sugar, 2 tablespoons molasses and brandy in large bowl until stiff peaks form. Spoon 3/4 cup frosting into pastry bag fitted with medium star tip.",
        "Cut cake into 3 equal layers. Using bottom of tart pan as aid, transfer 1 cake layer to platter, cut side up. Spread 1/2 cup applesauce filling over. Spread 1 cup frosting over. Repeat layering with 1 cake layer, 1/2 cup filling and 1 cup frosting. Top with remaining cake layer, cut side down. Spread some of remaining frosting thinly over top and sides of cake. Press almonds onto sides of cake. Drizzle remaining 1 tablespoon molasses over top of cake. Pipe remaining frosting around top edge of cake. Cover and refrigerate at least 1 hour or up to 6 hours."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground mace",
        "1/2 teaspoon ground cardamom",
        "1/4 teaspoon salt",
        "1/2 teaspoon baking soda",
        "1/4 cup water",
        "1/2 cup solid vegetable shortening, room temperature",
        "1 cup sugar",
        "1 large egg",
        "1/2 cup mild-flavored (light) molasses",
        "1/2 cup buttermilk",
        "1 1/4 cups applesauce",
        "1/4 cup (packed) golden brown sugar",
        "1/4 cup ( 1/2 stick) unsalted butter",
        "1 cinnamon stick",
        "3 cups chilled whipping cream",
        "1/4 cup (packed) golden brown sugar",
        "3 tablespoons mild-flavored (light) molasses",
        "2 tablespoons brandy",
        "1 1/2 cups sliced almonds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Apple",
        "Almond",
        "Spice",
        "Brandy",
        "Molasses"
    ],
    "title": "Scandinavian Spiced Christmas Cake with Applesauce Filling",
    "url": "http://www.epicurious.com/recipes/food/views/scandinavian-spiced-christmas-cake-with-applesauce-filling-3007"
}
