{
    "directions": [
        "Grind the parsley, sage, rosemary, and thyme into a fine powder. I use a coffee grinder for this.",
        "In a mixing bowl, crumble the tofu and mix well with the spice mixture so that the herbs are well infused with the tofu. Let sit for the flavors to meld.",
        "In a microwave-safe bowl, mix together the TVP granules and the broth, cover tightly with plastic wrap, and microwave for 5 to 6 minutes. Alternatively, bring the broth to a boil, pour over the TVP, cover, and let sit for 10 minutes.",
        "When cool enough to handle, add the TVP to the tofu mixture, then add the minced garlic, flaxseed mixture, sunflower seeds, pumpkin seeds, and salt and pepper to taste. Mix with your hands until all the ingredients are very well incorporated. The mixture will be nice and smooth, and should form lovely burgers. Shape into 6 patties. Refrigerate until ready to cook, although refrigeration isn't necessary if you plan on cooking them right away.",
        "I recommend baking these rather than frying. It just seems that this burger is too healthy to fry. Preheat the oven to 350°F (180°C, or gas mark 4) and line a baking sheet with parchment or a silicone baking mat. Bake, covered with a foil tent, for 15 minutes per side."
    ],
    "ingredients": [
        "1 tablespoon (2 g) dried parsley",
        "1 tablespoon (2 g) dried sage",
        "1 tablespoon (2 g) dried rosemary",
        "1 tablespoon (2 g) dried thyme",
        "12 ounces (340 g) extra-firm tofu, drained and pressed",
        "1 cup (96 g) TVP granules",
        "1 cup (235 ml) vegetable broth",
        "2 tablespoons (30 g) minced garlic",
        "2 1/2 tablespoons (19 g) ground flaxseed mixed with",
        "3 tablespoons (45 ml) water",
        "1/4 cup (32 g) hulled sunflower seeds",
        "1/4 cup (32 g) hulled pumpkin seeds",
        "Salt and pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Microwave",
        "Bake",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Dinner",
        "Lunch",
        "Rosemary",
        "Tofu",
        "Fall",
        "Winter",
        "Vegan",
        "Sage",
        "Thyme",
        "Parsley",
        "Coffee Grinder",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Scarborough Fair Tofu Burger",
    "url": "http://www.epicurious.com/recipes/food/views/scarborough-fair-tofu-burger-366471"
}
