{
    "directions": [
        "Grease a large bowl. Lightly grease three 5 x 9-inch loaf pans.",
        "Pour the warm water into a large mixing bowl, and stir in the yeast until dissolved. Allow to rest until the mixture becomes creamy, about 15 minutes. Stir in 2 tablespoons of white sugar and 3 cups of flour until evenly blended.",
        "Pour the prune juice into a pan, and stir in the condensed mincemeat. Bring the mixture to a boil over medium heat, stirring occasionally, and cook 1 minute at a rolling boil. Remove from the heat, and stir in the prunes, butter, raisins, walnuts, brown sugar, and salt. Combine the prune mixture with the yeast mixture in the mixing bowl. Gradually stir in the flour, 1 cup at a time, until well blended to make a moist dough. Turn out onto a floured board, and knead in any remaining flour to make 9 cups. Gather dough into a ball and place into greased bowl. Cover with a cloth, and place in a warm place until doubled in size, about 1 1/2 hours.",
        "Punch down dough, knead lightly on a floured board, and return to the bowl. Allow to rise again, about 1 hour.",
        "Turn dough out onto a floured board. Punch down and shape into 3 loaves. Place each loaf into a prepared loaf pan. Lightly grease tops of each loaf with1 teaspoon butter. Cover with a clean cloth, and allow to rise until doubled in size, about 1 hour.",
        "Preheat oven to 300 degrees F (150 degrees C).",
        "Bake in preheated oven for 1 hour. Lower heat to 250 degrees F (120 degrees C), and bake 1/2 hour more. Remove from pans, and cool on racks."
    ],
    "ingredients": [
        "1 cup warm water (110 degrees F/45 degrees C)",
        "2 (.25 ounce) envelopes active dry yeast",
        "2 tablespoons white sugar",
        "3 cups all-purpose flour",
        "1 1/2 cups prune juice",
        "1 (9 ounce) package condensed mincemeat",
        "2 cups prunes, pitted and chopped",
        "1/2 cup butter, softened",
        "1 cup black raisins",
        "1 cup walnuts, chopped",
        "1 cup brown sugar, packed",
        "2 teaspoons salt",
        "7 cups all-purpose flour",
        "3 teaspoons butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Schnitzbrot (German Christmas Bread)",
    "url": "http://allrecipes.com/recipe/155762/schnitzbrot-german-christmas-bread/"
}
