{
    "directions": [
        "Preheat the oven to 400 degrees F. Place the short ribs on a sheet pan, sprinkle with salt and pepper, and roast for 15 minutes. Remove from the oven. Reduce the oven temperature to 300 degrees F.",
        "Meanwhile, heat the olive oil in a large Dutch oven and add the onion, celery, carrots, fennel, and leek and cook over medium-low heat for 20 minutes, stirring occasionally. Add the garlic and cook for another 2 minutes. Pour the wine over the vegetables, bring to a boil, and cook over high heat until the liquid is reduced by half, about 10 minutes. Add 1 tablespoon salt and 1 teaspoon pepper. Tie the rosemary and thyme together with kitchen twine and add to the pot.",
        "Place the roasted ribs on top of the vegetables in the Dutch oven and add the beef stock and brown sugar. Bring to a simmer over high heat. Cover the Dutch oven and bake for 2 hours or until the meat is very tender.",
        "Carefully remove the short ribs from the pot and set aside. Discard the herbs and skim the excess fat. Cook the vegetables and sauce over medium heat for 20 minutes, until reduced. Put the ribs back into the pot and heat through. Serve with the vegetables and sauce."
    ],
    "ingredients": [
        "6 beef short ribs, trimmed of fat",
        "Kosher salt and freshly ground black pepper",
        "1/4 cup good olive oil",
        "1 1/2 cups chopped onion (2 onions)",
        "4 cups large-diced celery (6 large stalks)",
        "2 carrots, peeled and large-diced",
        "1 small fennel, fronds, stems, and core removed, large-diced",
        "1 leek, cleaned and large-diced, white part only",
        "3 garlic cloves, finely chopped",
        "1 (750-ml) bottle burgundy or other dry red wine",
        "Fresh rosemary sprigs",
        "Fresh thyme sprigs",
        "6 cups beef stock",
        "1 tablespoon brown sugar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Short Ribs",
        "Ribs Recipes",
        "Beef",
        "Meat",
        "Vegetable"
    ],
    "title": "Scott's Short Ribs",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/scotts-short-ribs-recipe"
}
