{
    "directions": [
        "Preheat oven to 300 degree F (150 degrees C).",
        "Cut each full rack of ribs in half, so that you have 4 half racks.  Sprinkle salt and pepper (more pepper than salt), and 1 tablespoon chile pepper over meat. Wrap each half rack in aluminum foil. Bake for 2 1/2 hours.",
        "Meanwhile, heat oil in a medium saucepan over medium heat. Cook and stir the onions in oil for 5 minutes. Stir in water, tomato paste, vinegar, brown sugar, honey,  and Worcestershire sauce. Season with 2 teaspoons salt, 1/4 teaspoon black pepper,  liquid smoke, whiskey, garlic powder, paprika, onion powder, dark molasses, and 1/2 tablespoon ground chile pepper. Bring mixture to a boil, then reduce heat. Simmer for 1 1/4 hours, uncovered, or until sauce thickens. Remove from heat, and set sauce aside.",
        "Preheat an outdoor grill for high heat.",
        "Remove the ribs from the oven, and let stand 10 minutes. Remove the racks from the foil, and place on the grill. Grill the ribs for 3 to 4 minutes on each side. Brush sauce on the ribs while they're grilling,  just before you serve them (adding it too early will burn it)."
    ],
    "ingredients": [
        "2 (2 pound) slabs baby back pork ribs",
        "coarsely ground black pepper",
        "1 tablespoon ground red chile pepper",
        "2 1/4 tablespoons vegetable oil",
        "1/2 cup minced onion",
        "1 1/2 cups water",
        "1/2 cup tomato paste",
        "1/2 cup white vinegar",
        "1/2 cup brown sugar",
        "2 1/2 tablespoons honey",
        "2 tablespoons Worcestershire sauce",
        "2 teaspoons salt",
        "1/4 teaspoon coarsely ground black pepper",
        "1 1/4 teaspoons liquid smoke flavoring",
        "2 teaspoons whiskey",
        "2 teaspoons garlic powder",
        "1/4 teaspoon paprika",
        "1/2 teaspoon onion powder",
        "1 tablespoon dark molasses",
        "1/2 tablespoon ground red chile pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Scott Hibb's Amazing Whisky Grilled Baby Back Ribs",
    "url": "http://allrecipes.com/recipe/35753/scott-hibbs-amazing-whisky-grilled-b/"
}
