{
    "directions": [
        "In a large bowl with an electric mixer beat the eggs, the sugar, and the vanilla until the mixture is thick and pale. Sift the flour and the baking powder over the egg mixture and fold them in gently but thoroughly. Line the bottom of a baking pan, 13 by 9 by 2 inches, with parchment paper, spread the batter in the pan, and bake the cake in a preheated 400°F. oven for 8 minutes, or until it is puffed and golden. Invert the cake onto a lightly sugared kitchen towel. In a small saucepan melt the jam over low heat, stir in the kirsch, and spread the surface of the cake with the jam mixture. Starting with a long side and using the towel as guide, roll the cake up jelly-roll fashion and sprinkle it with the Sherry. Wrap the sponge roll firmly in the towel, let it cool, and cut it into 3/4-inch slices.",
        "In a bowl set over a saucepan of simmering water beat the yolks and the sugar with the electric mixer until the mixture is thick and pale. Remove the bowl from the pan and stir in gradually the milk, the cream, and the vanilla. Cook the custard in the bowl set over the pan of simmering water over moderately low heat, stirring, until it registers 170°F. on a candy thermometer. Transfer the custard to a metal bowl and whisk in the crème fraîche and the Sherry. Set the bowl in a larger bowl of ice and cold water, whisk the custard until it is cool, and chill it, its surface covered with plastic wrap, until it is cold.",
        "In the bottom of a 2 1/2-quart straight-sided glass bowl scatter half the amaretti crumbs, top them with half the sponge roll slices, and top the sponge roll slices with the remaining amaretti crumbs. Sprinkle the Sherry over the remaining sponge roll slices, line the side of the bowl with the slices, and pour in the custard, spreading it to let it seep down around the side and bottom. Chill the trifle for at least 2 hours and up to 24 hours. Just before serving, in a bowl with the electric mixer beat the cream until it is stiff, transfer it to a pastry bag fitted with a decorative tip, and pipe rosettes around the edge and in the center of the trifle.",
        "Sprinkle the pistachios over the trifle and garnish the rosettes with the citron and small drops of the jam."
    ],
    "ingredients": [
        "3 large eggs",
        "1/2 cup sugar",
        "1/2 teaspoon vanilla",
        "3/4 cup all-purpose flour",
        "1/2 teaspoon double-acting baking powder",
        "1/3 cup seedless raspberry jam",
        "1 tablespoon kirsch",
        "1/4 cup medium-dry Sherry",
        "7 large egg yolks",
        "1 cup sugar",
        "2 cups milk, scalded and cooled",
        "1/2 cup heavy cream, scalded and cooled slightly",
        "1 teaspoon vanilla",
        "1/2 cup crème fraîche (available at specialty foods shops and some supermarkets)",
        "1/4 cup medium-dry Sherry",
        "1 1/2 cups Amaretti (Italian almond macaroons, available at specialty foods shops and some supermarkets) or stale macaroons, crushed coarse",
        "1/4 cup medium-dry Sherry",
        "1 cup well-chilled heavy cream",
        "2 tablespoons chopped shelled natural pistachio nuts",
        "candied citron or angelica, cut into small triangles, if desired",
        "seedless raspberry jam if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Raspberry",
        "Sherry",
        "Winter",
        "Gourmet"
    ],
    "title": "Scottish Trifle",
    "url": "http://www.epicurious.com/recipes/food/views/scottish-trifle-11039"
}
