{
    "directions": [
        "In a medium saucepan over moderate heat, bring the quince, sugar, vinegar, and 1 1/2 cups of water to a boil. Add the vanilla (or scrape in vanilla seeds), lemon juice, and zest then lower the heat, cover, and simmer until the jam is thickened and reduced by half, about 25 minutes. Let the jam cool for 1 hour.",
        "In a medium saucepan over moderate heat, warm the vegetable oil. Sprinkle the salmon with salt and pepper, add to the pan, and cook, flipping once, until just cooked through, about 3 minutes per side. Transfer the salmon to an oven-safe pan and cover. Do not clean the saucepan.",
        "Place the pan you used for the salmon over low heat and melt the butter. Add the shallots and sauté, stirring often, until translucent, about 5 minutes. Add the sugar and vinegar and cook until the sugar is dissolved, about 1 minute. Let cool, then transfer to a blender. Add the honey and truffle oil and purée until combined.",
        "In a medium saucepan over low heat, combine all the ingredients and cook, stirring often, until the risotto starts to stick to itself and becomes creamy, about 2 minutes.",
        "Preheat the broiler. Brush the salmon with the shallot-truffle honey glaze and place under the broiler until warmed through, about 1 minute.",
        "Divide the risotto among 4 plates. Cut the salmon into four servings and arrange on top of the risotto. Drizzle each piece of fish with 1 tablespoon quince jam and serve immediately."
    ],
    "ingredients": [
        "1 quince, grated",
        "3/4 cup sugar",
        "2 tablespoons Champagne vinegar",
        "1 teaspoon pure vanilla extract or 1/2 vanilla bean, split lengthwise",
        "Finely grated zest and juice of 1 lemon",
        "2 tablespoons unsalted butter",
        "5 shallots, minced",
        "3 tablespoons packed light brown sugar",
        "2 tablespoons Champagne vinegar",
        "4 tablespoons honey",
        "1 teaspoon truffle oil",
        "2 tablespoons vegetable oil",
        "Fine sea salt to taste",
        "Freshly ground black pepper to taste",
        "10 ounces Scottish salmon, skin removed",
        "1 cup arborio rice, cooked al dente ahead of time",
        "2 ounces fresh lump crabmeat, picked over",
        "1/4 Granny Smith apple, diced",
        "1/4 cup vegetable or chicken stock or low-sodium chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Super Bowl",
        "Dinner",
        "Apple",
        "Quince",
        "Salmon",
        "Crab",
        "Honey",
        "Party",
        "Shallot",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Scottish Salmon with Shallot-Truffle Honey Glaze, Lump Crab and Green Apple Risotto, and Quince Jam",
    "url": "http://www.epicurious.com/recipes/food/views/scottish-salmon-with-shallot-truffle-honey-glaze-lump-crab-and-green-apple-risotto-and-quince-jam-363590"
}
