{
    "directions": [
        "Grease a ring mold with 1 tablespoon creamy salad dressing. Zest 1 orange and then peel both oranges.",
        "Place oranges, orange zest, cranberries, and apples together in the bowl of a food processor; pulse until coarsely chopped. Strain fruit pieces, reserving juice in a quart-size measuring cup. Add enough boiling water to measure 3 cups liquid.",
        "Dissolve unflavored gelatin in cold water in a large bowl. Pour water-juice mixture over unflavored gelatin. Add raspberry gelatin and 2 cups sugar; stir to dissolve completely. Stir in fruit mixture, grapes, and pecans. Pour gelatin mixture into prepared ring mold; chill 8 hours to overnight.",
        "Mix whipped topping, cream cheese, 3 tablespoons creamy salad dressing, and 2 teaspoons sugar together in a bowl until dressing is smooth.",
        "Dip chilled mold in a few inches of hot water to loosen gelatin from mold. Turn out onto a serving platter, garnish with parsley, and serve with dressing."
    ],
    "ingredients": [
        "Cranberry Salad:",
        "1 tablespoon creamy salad dressing (such as Miracle Whip®), or as needed",
        "2 oranges",
        "1 (12 ounce) bag fresh cranberries",
        "2 apples, unpeeled and cored",
        "2 1/2 cups boiling water, or as needed",
        "1 (.25 ounce) package unflavored gelatin (such as Knox ®)",
        "1/2 cup cold water",
        "1 (6 ounce) package raspberry-flavored gelatin mix (such as Jell-O®)",
        "2 cups white sugar",
        "2 cups halved seedless grapes",
        "2 cups chopped pecans",
        "Dressing:",
        "1 1/2 cups frozen whipped topping (such as Cool Whip®), thawed",
        "1 (8 ounce) package cream cheese, softened",
        "3 tablespoons creamy salad dressing (such as Miracle Whip®)",
        "2 teaspoons white sugar",
        "1 sprig fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Scott's Holiday Cranberry Salad",
    "url": "http://allrecipes.com/recipe/245830/scotts-holiday-cranberry-salad/"
}
