{
    "directions": [
        "Preheat oven to 400°F. Place bread in medium bowl. Drizzle oil over, tossing to coat. Scatter bread pieces on small rimmed baking sheet. Sprinkle lightly with sea salt. Bake until bread is golden brown, stirring often, 10 to 12 minutes. Cool on sheet. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Rewarm 3 minutes in 350°F oven before using.",
        "Cook fava beans in medium saucepan of boiling salted water until tender, about 14 minutes. Drain. Whisk eggs, crème fraîche, and 1/2 teaspoon sea salt in large bowl to blend.",
        "Melt butter in heavy large skillet over low heat. Add leeks. Sauté until tender but not brown, about 10 minutes. Sprinkle lightly with sea salt. Mix in fava beans. Increase heat to medium-high. Add egg mixture. Stir with heatproof spatula until eggs are almost set but still creamy, 3 to 4 minutes. Season with pepper.",
        "Transfer egg mixture to platter. Sprinkle with crispy breadcrumbs. Grate Parmesan cheese over and serve."
    ],
    "ingredients": [
        "1 1/2 cups coarsely torn French bread",
        "3 tablespoons olive oil",
        "Fine sea salt",
        "1 cup peeled fresh fava beans or frozen (double-peeled)",
        "12 large eggs (preferably organic)",
        "1/2 cup crème fraîche or sour cream",
        "1/2 teaspoon fine sea salt",
        "2 tablespoons (1/4 stick) butter",
        "2 cups chopped leeks (white and pale green parts only; from 2 large)",
        "Wedge of Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Egg",
        "Brunch",
        "Sauté",
        "Vegetarian",
        "Low Cal",
        "Parmesan",
        "Leek",
        "Spring",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Scrambled Eggs with Leeks, Fava Beans, Crispy Breadcrumbs, and Parmesan",
    "url": "http://www.epicurious.com/recipes/food/views/scrambled-eggs-with-leeks-fava-beans-crispy-breadcrumbs-and-parmesan-358234"
}
