{
    "directions": [
        "In a 10-inch heavy skillet heat 1/2 inch oil over moderate heat until hot but not smoking and fry tortillas, 1 at a time, turning with tongs, until pale golden and crisp, about 1 1/2 minutes. Transfer tortillas as fried with tongs to paper towels to drain and cool completely. Tortillas may be fried 1 week ahead and kept in an airtight container at room temperature.",
        "Preheat oven to 350°F.",
        "In a shallow baking pan arrange bacon in one layer and cook in middle of oven, turning occasionally, until crisp. Transfer bacon to paper towels to drain and crumble. Bacon may be made 1 1/4 hours ahead and kept warm on baking sheet in turned-off oven.",
        "Peel potatoes and cut into 1/2-inch cubes. In a 12-inch non-stick skillet heat water and 2 tablespoons butter over moderate heat until butter is melted. Add potatoes and cook, covered, over moderately low heat 6 minutes. Remove lid and cook potatoes over moderately high heat, stirring occasionally, until golden and tender. Potatoes may be made 1 hour ahead and kept warm on baking sheet in turned-off oven.",
        "In a bowl whisk together eggs, scallions, and salt and pepper to taste. In skillet heat remaining 2 tablespoons butter over moderate heat until melted. Add eggs and cook, stirring and breaking up into bite-size pieces, until just cooked through. Eggs may be made 45 minutes ahead and kept covered.",
        "Spoon potatoes, bacon, and eggs onto tortillas and serve with accompaniments."
    ],
    "ingredients": [
        "vegetable oil for frying tortillas",
        "twelve 8-inch corn tortillas",
        "12 slices bacon (about 1 pound)",
        "4 russet (baking) potatoes",
        "1/4 cup water",
        "1/2 stick (1/4 cup) unsalted butter",
        "12 large eggs",
        "1 bunch scallions, sliced thin",
        "red and green tomato salsa",
        "corn and avocado relish",
        "sour cream",
        "chopped fresh coriander sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Potato",
        "Breakfast",
        "Brunch",
        "Bake",
        "Fry",
        "Kid-Friendly",
        "Bacon",
        "Fall",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Scrambled Egg, Potato, and Bacon Tostadas",
    "url": "http://www.epicurious.com/recipes/food/views/scrambled-egg-potato-and-bacon-tostadas-13142"
}
