{
    "directions": [
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Reserve 1 cup of the linguine cooking water, and drain pasta well in a colander set in the sink.",
        "Melt 2 tablespoons of butter and 1 1/2 tablespoon of olive oil together in a large skillet over medium heat, and cook and stir the red and yellow bell pepper and garlic until the peppers have softened, about 10 minutes. Stir in the shrimp, and cook and stir until the shrimp are opaque and pink, about 5 minutes. Remove the shrimp to a bowl and set aside, leaving the peppers and garlic in the skillet.",
        "Stir the wine, lemon juice, and clam juice into the skillet, and bring to a boil over medium heat. Mix in 2 more tablespoons of butter and 1 1/2 tablespoons of olive oil, and return the shrimp to the skillet. Stir in reserved pasta cooking water, cream, red pepper flakes, parsley, and sea salt. Add the cooked linguine, and toss lightly with the shrimp and sauce in the skillet. Simmer the mixture over medium-low heat for 5 minutes to let the pasta absorb some of the sauce, and serve hot."
    ],
    "ingredients": [
        "1 (16 ounce) package linguine pasta",
        "2 tablespoons butter",
        "1 1/2 tablespoons olive oil",
        "1/2 cup chopped red bell pepper",
        "1/2 cup chopped yellow bell pepper",
        "6 cloves garlic, sliced",
        "48 large shrimp - peeled, deveined, and tails removed",
        "1/2 cup dry white wine (such as Chardonnay)",
        "1 teaspoon lemon juice",
        "1/4 cup clam juice",
        "2 tablespoons butter",
        "1 1/2 tablespoons olive oil",
        "2 tablespoons heavy cream",
        "1 1/2 teaspoons crushed red pepper flakes, or to taste",
        "3 tablespoons chopped fresh parsley",
        "1 teaspoon sea salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Scrumptious Shrimp Scampi Linguine",
    "url": "http://allrecipes.com/recipe/214600/scrumptious-shrimp-scampi-linguine/"
}
