{
    "directions": [
        "Stir together cilantro, garlic, and zest in a small bowl.",
        "Simmer shallot and ginger in lime juice and wine in a small heavy saucepan until liquid is reduced to about 2 tablespoons.",
        "Whisk in butter 1 tablespoon at a time, adding each new piece before previous one has completely melted and occasionally lifting pan from heat to cool mixture. (Sauce must not get too hot or it will separate.) Pour sauce through a fine sieve into a bowl (discard solids), then return to cleaned pan. Season with salt and white pepper and keep warm while cooking scallops.",
        "Pat scallops dry and season with salt and pepper. Heat oil in a 12-inch nonstick skillet over moderately high heat until hot but not smoking, then sauté scallops, turning once, until golden and just cooked through, 4 to 5 minutes total.",
        "Sprinkle scallops with gremolata and serve with sauce."
    ],
    "ingredients": [
        "1 1/2 tablespoons finely chopped fresh cilantro",
        "1 small garlic clove, minced",
        "Finely grated zest of 1 small lime (3/4 teaspoon)",
        "2 tablespoons minced shallot",
        "1 tablespoon finely grated peeled fresh ginger",
        "3 tablespoons fresh lime juice",
        "1/4 cup dry white wine",
        "1 stick (1/2 cup) cold unsalted butter, cut into tablespoon pieces",
        "White pepper",
        "24 sea scallops (1 1/2pounds), tough muscle removed from side of each if necessary",
        "1 tablespoon olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Appetizer",
        "Sauté",
        "Quick & Easy",
        "Scallop",
        "White Wine",
        "Spring",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sea Scallops with Cilantro Gremolata and Ginger Lime Beurre Blanc",
    "url": "http://www.epicurious.com/recipes/food/views/sea-scallops-with-cilantro-gremolata-and-ginger-lime-beurre-blanc-106359"
}
