{
    "directions": [
        "Cook onion in 3 tablespoons oil with bay leaf in a 6- to 8-quart heavy pot over moderate heat, stirring occasionally, until beginning to soften, about 3 minutes. Add garlic and cook, stirring occasionally, 1 minute. Add cabbage and increase heat to moderately high, then sauté, stirring occasionally, until cabbage starts to wilt, about 5 minutes. Add stock (with meat from ham hocks) and simmer, partially covered, stirring occasionally, until cabbage is tender, about 30 minutes.",
        "Stir in kale, 1/2 teaspoon salt, and 1/4 teaspoon pepper and simmer, partially covered, stirring occasionally, until kale is tender, about 15 minutes.",
        "Preheat oven to 200°F.",
        "Pat scallops dry and sprinkle both sides with remaining 1/2 teaspoon salt and 1/4 teaspoon pepper (total). Heat remaining 2 tablespoons oil in a 12-inch heavy nonstick skillet over moderately high heat until hot but not smoking, then sauté scallops (without crowding), in 2 batches if necessary, turning over once, until golden and just cooked through, about 5 minutes total per batch. Transfer scallops to a shallow baking dish and keep warm in oven.",
        "Add wine to skillet and deglaze by boiling, stirring and scraping up any brown bits from bottom of skillet, until liquid is reduced to about 2/3 cup. Stir in 1 teaspoon lemon juice, then add sauce to cabbage mixture. Season with salt, pepper, and additional lemon juice if desired. Pour any scallop juices accumulated in baking dish into cabbage mixture, then serve mixture spooned over grits and topped with scallops."
    ],
    "ingredients": [
        "1 large onion, chopped (2 cups)",
        "5 tablespoons extra-virgin olive oil",
        "1 Turkish or 1/2 California bay leaf",
        "1 tablespoon finely chopped garlic (2 cloves)",
        "1 large head Savoy cabbage (2 to 2 1/2 pounds), quartered, cored, and coarsely chopped (12 cups loosely packed)",
        "Ham stock including meat",
        "1 1/4 pounds tender green kale (1 large bunch), stems and center ribs cut out and discarded and leaves coarsely chopped (12 cups loosely packed)",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "30 large sea scallops (2 to 2 1/2 pounds total), tough muscle removed from side of each if necessary",
        "1 cup dry white wine",
        "1 teaspoon fresh lemon juice, or to taste",
        "Accompaniment: creamy stone-ground grits"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Shellfish",
        "Braise",
        "Sauté",
        "Ham",
        "Scallop",
        "Kale",
        "White Wine",
        "Cabbage",
        "Gourmet"
    ],
    "title": "Sea Scallops with Ham-Braised Cabbage and Kale",
    "url": "http://www.epicurious.com/recipes/food/views/sea-scallops-with-ham-braised-cabbage-and-kale-230758"
}
