{
    "directions": [
        "Place peas in a medium pot; cover with 6 cups water; let soak for 3 hours or overnight.",
        "Bring water with peas to a boil (do not drain); boil for 15 minutes. Reduce heat to medium; gently simmer, adding water by 1/2-cupfuls as needed to keep peas covered, until peas are tender but still hold their shape, 20-25 minutes. Remove from heat and stir in 1 teaspoon salt. Season to taste with more salt, if desired. DO AHEAD: Can be made 1 day ahead. Cover and chill. Rewarm before continuing, adding more water by 1/4-cupfuls if too thick.",
        "Place garlic on a cutting board. Sprinkle with salt and chop, occasionally smearing with the back of a knife, until a coarse paste forms. Tie thyme and bay leaf with kitchen twine to form a bundle for bouquet garni.",
        "Heat 1/4 cup oil in a medium pot over medium heat; add garlic paste, bouquet garni, celery, onion, and bell pepper; cook until vegetables are tender, about 15 minutes. Add peas with their cooking liquid; bring to a simmer. Cook until flavors meld and sauce is thickened, 10-15 minutes. Remove from heat; stir in butter. Set aside.",
        "Toast coriander seeds in a small dry skillet over medium heat, shaking pan often, until fragrant and slightly darker in color, 2-3 minutes. Let cool. Coarsely grind in a spice mill, or place in a resealable plastic bag and crush with a rolling pin or the bottom of a heavy skillet. Combine celery leaves, parsley, chives, lemon zest, and crushed coriander seeds in a small bowl; drizzle with oil and toss to coat. Season to taste with salt and cracked pepper. Divide peas among plates or transfer to a serving bowl; garnish with salad."
    ],
    "ingredients": [
        "2 cups dried Sea Island red peas or black-eyed peas",
        "1 teaspoon kosher salt plus more",
        "2 garlic cloves",
        "6 sprigs thyme",
        "1 fresh bay leaf",
        "1/4 cup extra-virgin olive oil plus more for drizzling",
        "1/2 cup finely chopped celery plus",
        "1/2 cup celery leaves from inner stalks",
        "1/2 cup finely chopped onion",
        "1/2 cup finely chopped red bell pepper",
        "1 tablespoon unsalted butter",
        "1 teaspoon coriander seeds",
        "1/2 cup flat-leaf parsley leaves",
        "2 tablespoons thinly sliced chives",
        "2 teaspoons finely grated lemon zest",
        "Freshly cracked black peppercorns"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Side",
        "Vegetarian",
        "Low Cal",
        "Celery",
        "Healthy",
        "Low Cholesterol",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sea Island Red Peas with Celery Leaf Salad",
    "url": "http://www.epicurious.com/recipes/food/views/sea-island-red-peas-with-celery-leaf-salad-388667"
}
