{
    "directions": [
        "Melt butter with 1 tablespoon olive oil in heavy large skillet over medium heat. Add leeks and chicken broth to skillet. Cover and simmer until leeks are tender, about 20 minutes. Uncover skillet and simmer until mixture thickens, about 5 minutes. Season with salt and pepper.",
        "Place toasted baguette slices, rosemary, garlic, 1/2 teaspoon salt, 1/4 teaspoon pepper and 1 tablespoon olive oil in processor. Using on/off turns, process until moist crumbs form.",
        "Place fish on baking sheet. Sprinkle fish with salt and pepper. Spread 1/4 cup mustard atop fish, dividing equally. Sprinkle 2 tablespoons breadcrumbs over each fillet, pressing gently to adhere. (Leeks and fish can be prepared 6 hours ahead. Cover separately and refrigerate.)",
        "Whisk vinegar and 1 teaspoon mustard in small bowl. Gradually whisk in 1/4 cup olive oil. Season with salt and pepper. Set vinaigrette aside.",
        "Preheat oven to 400°F. Cook potatoes in large pot of boiling salted water until potatoes are tender, about 30 minutes. Drain well.",
        "Meanwhile, bake fish until opaque in center, about 20 minutes. Rewarm leek mixture in skillet over medium heat.",
        "Slice each potato crosswise into 5 rounds. Arrange potato slices in circle on plates. Spread 1/6 of leek mixture over potatoes on each plate. Drizzle with vinaigrette. Place fish atop leek mixture."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter",
        "2 tablespoons plus 1/4 cup olive oil",
        "8 cups thinly sliced leeks (white and pale green parts only)",
        "1 cup canned low-salt chicken broth",
        "1/4 French-bread baguette (about 2 ounces), sliced, lightly toasted",
        "2 teaspoons chopped fresh rosemary or 1 teaspoon dried",
        "2 large garlic cloves",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "6 6-ounce sea bass fillets",
        "1/4 cup plus 1 teaspoon Dijon mustard",
        "2 tablespoons balsamic vinegar",
        "6 medium-size red-skinned potatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Bake",
        "Bass",
        "Leek"
    ],
    "title": "Sea Bass with Leeks, Potatoes and Balsamic Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/sea-bass-with-leeks-potatoes-and-balsamic-vinaigrette-4399"
}
