{
    "directions": [
        "Put oven rack in middle position and preheat oven to 400°F. Line a large baking sheet with foil, then drizzle with 1 tablespoon oil.",
        "Pat fish dry and sprinkle both sides with salt and pepper. Arrange fillets, skin sides down, in 1 layer in center of foil on baking sheet and slide 2 lemon slices under each fillet. Arrange 2 thyme sprigs on top of each fillet.",
        "Heat remaining 2 tablespoons oil in a 10-inch heavy skillet over moderately high heat until hot but not smoking, then sauté garlic, stirring occasionally, until pale golden, about 30 seconds. Add tomatoes and a pinch of salt and sauté, stirring occasionally, until tomatoes are softened, about 1 minute. Stir in capers.",
        "Spoon hot tomato mixture over fish, then cover with another sheet of foil, tenting it slightly over fish, and crimp edges together tightly to seal.",
        "Bake until fish is just cooked through, 12 to 15 minutes (depending on thickness of fish); check by removing from oven and carefully lifting up a corner of top sheet of foil, pulling up sides of bottom sheet to keep liquid from running out. If fish is not cooked through, reseal foil and continue to bake, checking every 3 minutes.",
        "Transfer fillets with lemon slices to plates using a spatula (be careful not to tear foil underneath) and spoon tomatoes and juices over top. Serve immediately, discarding thyme before eating."
    ],
    "ingredients": [
        "3 tablespoons extra-virgin olive oil",
        "4 (6-ounce) fillets black sea bass or striped bass (1/2 to 1 1/4 inches thick) with skin",
        "3/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "8 thin lemon slices (less than 3/4 inch thick; from 1 large lemon)",
        "8 sprigs fresh thyme",
        "2 garlic cloves, very thinly sliced",
        "12 cherry or grape tomatoes, halved",
        "1 1/2 tablespoons drained bottled capers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Garlic",
        "Herb",
        "Tomato",
        "Bake",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Bass",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sea Bass in Papillote",
    "url": "http://www.epicurious.com/recipes/food/views/sea-bass-in-papillote-236934"
}
