{
    "directions": [
        "Whisk yolks, 4 tablespoons orange juice, and saffron in medium metal bowl. Set bowl over saucepan of barely simmering water (do not let bowl touch water). Whisk until thickened and thermometer registers 160°F, about 4 minutes. Transfer to processor. Add orange peel and garlic. With machine running, gradually add oil in thin stream until incorporated, stopping to scrape down sides of bowl. Transfer to medium bowl. Whisk in lemon juice and 2 tablespoons orange juice. Thin with water by teaspoonfuls, if desired. Season with salt and pepper. Do ahead Can be made 1 day ahead. Cover; chill.",
        "Thread 3 scallops on 1 skewer alternately with 2 bay leaves. Place on rimmed baking sheet. Repeat with remaining scallops, skewers, and bay leaves. Do ahead Can be prepared 2 hours ahead. Cover and chill. Sprinkle scallops with salt and pepper.",
        "Heat griddle or 2 heavy large skillets ssor grill pans over high heat; brush with oil. Cook scallops until brown and just opaque in center, about 2 minutes per side. Place 1 brochette on each of 8 plates. Drizzle scallops with aioli. Garnish with orange sections and chives."
    ],
    "ingredients": [
        "2 large egg yolks",
        "6 tablespoons fresh orange juice, divided",
        "1/8 teaspoon saffron threads",
        "1 tablespoon finely grated orange peel",
        "1 small garlic clove",
        "1 cup olive oil",
        "1 teaspoon fresh lemon juice",
        "Water (optional)",
        "24 medium sea scallops",
        "8 8-inch metal or bamboo skewers",
        "16 fresh bay leaves",
        "Olive oil",
        "2 oranges, peeled, sectioned",
        "1/4 cup chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Citrus",
        "Fruit",
        "Shellfish",
        "Christmas",
        "Cocktail Party",
        "Orange",
        "Seafood",
        "Scallop",
        "Saffron",
        "Grill/Barbecue"
    ],
    "title": "Sea Scallop Brochettes with Orange-Saffron Aïoli",
    "url": "http://www.epicurious.com/recipes/food/views/sea-scallop-brochettes-with-orange-saffron-aioli-236769"
}
