{
    "directions": [
        "Dissolve yeast in 1/4 cup warm water in a bowl; add sugar, stir, and let sit until foamy, about 10 minutes.",
        "Mix 3 1/2 cups flour with rosemary and kosher salt in the bowl of a stand mixer. Pour the yeast mixture into flour mixture; slowly add 11 ounces warm water and mix until dough holds together and pulls away from the sides of the bowl.",
        "Grease a large glass bowl with 1 tablespoon olive oil. Place dough in the bowl, turning once to coat with oil. Cover bowl with plastic wrap and place into a cool oven with the oven light on until dough has doubled in size, about 1 1/2 hours.",
        "Line a rimless baking sheet with parchment paper. Sprinkle 2 tablespoons flour over parchment paper. Turn risen dough onto the parchment paper and flatten it gently with your hands, forming a 9x13-inch rectangle.",
        "Place baking sheet into the oven, with the oven light on, until dough has risen, another 1 1/2 hours.",
        "Drizzle the remaining 2 tablespoons of olive oil over dough and top with coarse sea salt.",
        "Position your oven rack slightly lower than center, and place a baking stone on the rack.",
        "Preheat oven to 450 degrees F (230 degrees C). Gently slide the parchment off of the sheet pan and onto the baking stone.",
        "Bake dough in the preheated oven for 8 minutes. Gently lift the crust using a pizza peel or large spatula and pull the parchment paper out so that the crust is directly on the baking stone.",
        "Continue to bake until crust is golden brown, 15 to 16 minutes more. Transfer crust to a cooling rack to cool completely, at least 30 minutes.",
        "Slice the crust into small squares. Cut each square in half horizontally so that you have a top and a bottom. Fold a mortadella slice in half and then in half again; place on top of the pizza bottom. Layer a basil leaf on top of mortadella and top with a mozzarella slice. Add the pizza top and secure with an appetizer pick. Repeat with remaining ingredients."
    ],
    "ingredients": [
        "2 1/4 teaspoons active dry yeast",
        "1/4 cup warm water",
        "1 teaspoon white sugar",
        "3 1/2 cups all-purpose flour",
        "1 tablespoon chopped fresh rosemary",
        "1 1/2 teaspoons kosher salt (such as Diamond Crystal®)",
        "11 fluid ounces warm water",
        "3 tablespoons extra-virgin olive oil, divided",
        "2 tablespoons all-purpose flour",
        "1 1/2 teaspoons sea salt (such as Diamond Crystal®) Coarse Sea Salt)",
        "42 slices thinly sliced mortadella",
        "42 leaves fresh basil (optional)",
        "21 fresh mozzarella balls (ciliegine), cut in half",
        "appetizer picks"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sea Salt and Rosemary Pizza Bianca Bites with Mortadella and Mozzarella",
    "url": "http://allrecipes.com/recipe/239747/sea-salt-and-rosemary-pizza-bianca-bi/"
}
