{
    "directions": [
        "Preheat oven to 350°F. Toss peppers, 2 tablespoons oil, garlic, and 3 teaspoons thyme in 13x9x2-inch metal baking pan. Roast until peppers are tender and brown in spots, turning occasionally, about 1 hour. Cut peppers into 1/2-inch strips and return to pan. Season to taste with salt and pepper. (Can be made 2 hours ahead. Let stand at room temperature.) Bring milk, water, bay leaf, and 1 teaspoon thyme to simmer in heavy large saucepan. Cover and remove from heat. Let steep 15 minutes.",
        "Gradually whisk polenta into milk mixture. Bring to simmer over medium-low heat, whisking constantly. Continue cooking until thick and creamy, stirring often, about 20 minutes. Discard bay leaf. Mix in cream. Season with salt and pepper.",
        "Meanwhile, preheat broiler. Heat remaining 2 tablespoons oil in heavy large skillet over medium-high heat. Sprinkle fish with salt and pepper. Add to skillet; cook until opaque in center, about 4 minutes per side. Remove from heat. Spread 1 tablespoon tapenade over each fillet. Broil red peppers in pan until heated through, about 2 minutes.",
        "Spoon polenta onto 6 plates. Top with fish and red peppers."
    ],
    "ingredients": [
        "3 red bell peppers, quartered",
        "4 tablespoons olive oil",
        "3 garlic cloves, minced",
        "4 teaspoons chopped fresh thyme",
        "3 cups whole milk",
        "2 cups water",
        "1 bay leaf",
        "1 cup polenta (coarse cornmeal)",
        "2 tablespoons whipping cream",
        "6 6-ounce sea bass fillets",
        "6 tablespoons tapenade"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Pepper",
        "Bake",
        "Dinner",
        "Cornmeal",
        "Bass",
        "Bell Pepper",
        "Winter",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sea Bass with Polenta and Roasted Red Bell Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/sea-bass-with-polenta-and-roasted-red-bell-peppers-106113"
}
