{
    "directions": [
        "Preheat oven to 450°F. Divide bones, onions, fennel, carrots, and 1/4 cup oil between 2 rimmed baking sheets; season with salt and pepper and toss to coat. Roast, tossing halfway through, until vegetables are softened and browned, 60–75 minutes.",
        "Heat saffron and remaining 1/4 cup oil in a large pot over medium-high heat, stirring, until fragrant, about 2 minutes. Add leeks and garlic; season with salt and pepper and cook, stirring often, until golden, 8–10 minutes. Add vermouth; bring to a boil, reduce heat, and simmer, stirring occasionally, until slightly reduced, about 3 minutes.",
        "Add roasted bones and vegetables, parsley stems, lemon zest, bay leaves, peppercorns, and 10 cups water to pot. Bring to a boil, reduce heat, and simmer gently, skimming as needed, until reduced by half, about 1 hour. Strain through a sieve into a clean pot; discard solids. Season with salt.",
        "Pulse garlic, parsley, and tarragon in a food processor until very finely chopped. With motor running, slowly add oil, and process until smooth; season with salt and pepper.",
        "Return broth to a simmer; add shellfish, cover pot, and cook until shellfish open (discard any that do not open), about 5 minutes. Transfer shellfish to a large bowl and add a ladleful of broth; tent with foil. Season fish with salt and pepper; add to broth in pot. Cover; cook fish gently until opaque throughout, about 4 minutes.",
        "Divide fish and shellfish among shallow bowls and ladle broth over. Drizzle stew with oil, top with pesto, and serve with toast.",
        "DO AHEAD: Brodo can be made 3 days ahead. Cover and chill. Pesto can be made 1 day ahead. Press plastic wrap directly on surface and chill."
    ],
    "ingredients": [
        "4 pounds fish bones",
        "4 medium onions, chopped",
        "4 fennel bulbs, chopped",
        "4 small carrots (about 8 ounces), chopped",
        "1/2 cup olive oil, divided",
        "Kosher salt, freshly ground pepper",
        "freshly ground pepper",
        "1 teaspoon saffron threads",
        "2 leeks, white and pale-green parts only, halved lengthwise, thinly sliced crosswise",
        "4 garlic cloves, thinly sliced",
        "1 cup dry vermouth",
        "8 fresh flat-leaf parsley stems",
        "4 1\" strips lemon zest removed with a vegetable peeler",
        "2 bay leaves",
        "2 teaspoons black peppercorns",
        "1 garlic clove, chopped",
        "1 cup fresh flat-leaf parsley leaves",
        "1/2 cup fresh tarragon leaves",
        "1/4 cup extra-virgin olive oil",
        "Kosher salt, freshly ground pepper",
        "freshly ground pepper",
        "3 1/2 pounds clams or cockles, scrubbed",
        "8 4-ounce firm fish fillets (such as halibut, snapper, or cod)",
        "Kosher salt, freshly ground pepper",
        "freshly ground pepper",
        "Olive oil (for drizzling)",
        "8 slices country-style bread, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Shellfish",
        "Christmas",
        "Dinner",
        "Seafood",
        "Clam",
        "Fall",
        "Winter",
        "Tarragon",
        "Christmas Eve",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Seafood en Brodo with Tarragon Pesto",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-en-brodo-with-tarragon-pesto-51193680"
}
