{
    "directions": [
        "Mince garlic and finely chop shallot and onion. Cut bell peppers into julienne strips. Cut tomato into 1/4-inch dice. Scrub clams and mussels and remove beards from mussels. Shell and devein shrimp.",
        "In a 4-quart shallow heavy kettle with a tight-fitting lid cook garlic, shallot, onion, and bell peppers in oil, uncovered, over moderate heat, stirring, 5 minutes, or until peppers are softened. Add vermouth, wine, and saffron and boil, uncovered, until liquid is reduced to about 1/3 cup. Add stock or clam juice and cream and bring to a boil. Immediately add clams and simmer until they just begin to open, about 3 minutes. Stir in mussels, shrimp, tomato, and sea salt and pepper to taste and stir until combined well. Simmer cataplana, covered, stirring occasionally, 5 minutes and discard any unopened clams or mussels. Transfer seafood with a slotted spoon to a large bowl and boil cooking liquid, uncovered, until reduced by about half, about 5 minutes. Return seafood to cooking liquid and stir in crayfish and sorrel. Heat cataplana over moderate heat until just heated through."
    ],
    "ingredients": [
        "4 garlic cloves",
        "1 small shallot",
        "1 small onion",
        "1 red bell pepper",
        "1 green bell pepper",
        "1 small vine-ripened tomato",
        "16 small hard-shelled clams (less than 2 inches in diameter) such as littlenecks",
        "30 mussels (preferably cultivated)",
        "16 large shrimp (about 1 pound)",
        "2 tablespoons extra-virgin olive oil",
        "1/2 cup dry vermouth",
        "2 cups dry white wine",
        "1/2 teaspoon crumbled saffron threads",
        "2 cups fish stock or bottled clam juice",
        "1 cup heavy cream",
        "sea salt",
        "30 thawed frozen cooked crayfish tails (about 1/2 pound)",
        "1 tablespoon chopped fresh sorrel leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Leafy Green",
        "Shellfish",
        "Clam",
        "Mussel",
        "Shrimp",
        "Saffron",
        "Fortified Wine",
        "Summer",
        "Simmer",
        "Gourmet"
    ],
    "title": "Seafood \"Cataplana\" with Saffron, Vermouth, and Sorrel",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-cataplana-with-saffron-vermouth-and-sorrel-15625"
}
