{
    "directions": [
        "Heat the oil in a Dutch oven or stockpot, add the onions, potatoes, fennel, salt, and pepper, and saute over medium - low heat for 15 minutes, until the onions begin to brown. Add the wine and scrape up the brown bits with a wooden spoon. Add the tomatoes with their juices, stock, garlic, and saffron to the pot, bring to a boil, then lower the heat and simmer uncovered for 15 minutes, until the potatoes are tender. Add the shrimp, fish, and mussels, bring to a boil, then lower the heat, cover, and cook for 5 minutes. Turn off the heat and allow the pot to sit covered for another 5 minutes. The fish and shrimp should be cooked and the mussels opened. Discard any mussels that don't open. Stir in the Pernod, orange zest, and salt to taste. Serve ladled over one or two slices of toasted baguette."
    ],
    "ingredients": [
        "3 tablespoons good olive oil",
        "1 1/2 cups chopped yellow onions (2 small)",
        "2 cups large - diced small white potatoes",
        "2 cups chopped fennel (1 large bulb)",
        "2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "2 cups good white wine",
        "1 (28 ounce) can plum tomatoes, chopped",
        "1 quart Seafood Stock (recipe follows) or store-bought fish stock",
        "1 tablespoon chopped garlic (3 cloves)",
        "1 teaspoon saffron threads",
        "1 pound large shrimp, shelled and deveined (use the shells for the stock)",
        "1 pound each halibut and bass fillets, cut in large chunks",
        "24 mussels, cleaned",
        "3 tablespoons Pernod",
        "1 teaspoon grated orange zest",
        "Toasted baguette slices, buttered and rubbed with garlic"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Shrimp Recipes",
        "Easy Recipes",
        "Shellfish Recipes",
        "Shrimp",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Stew Recipes",
        "Mussel",
        "Fish"
    ],
    "title": "Seafood Stew",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/seafood-stew-recipe2"
}
