{
    "directions": [
        "Fry the onion in the oil in a 16-inch paella pan until soft, stirring often. Stir in the garlic, and before it begins to color, add the tomatoes. Add the sugar, salt to taste, pimentón (or paprika), and saffron, stir well, and cook until the tomatoes are reduced to a jammy sauce and the oil is sizzling. Add the squid and cook, stirring, for a minute or so. Add the rice and stir well until all the grains are coated. (You can prepare the dish to this point up to an hour in advance.)",
        "Bring the stock and wine to a boil in a saucepan. Pour over the rice, bring to a boil, and add salt to taste (even if the broth tastes a bit salty, it will not be salty when it is absorbed by the rice). Stir well and spread the rice out evenly in the pan (do not stir again). Cook the rice over low heat for 18 to 20 minutes, moving the pan around and rotating it so that the rice cooks evenly. Lay the shrimp on top after 10 minutes and turn them when they have become pink on the first side. Add a little more hot stock toward the end if the rice seems too dry and you hear crackly frying noises before it is done. When the rice is done, turn off the heat and cover the pan with a large piece of foil.",
        "Steam the mussels with a finger of water in a pan with a tight-fitting lid. As soon as they open, they are cooked. Throw away any that have not opened.",
        "Arrange the mussels on top of the paella."
    ],
    "ingredients": [
        "1 large onion, finely chopped",
        "5 tablespoons olive oil",
        "2 garlic cloves, crushed to a paste or finely chopped",
        "2 tomatoes, peeled and chopped",
        "1/2 teaspoon sugar",
        "Salt",
        "1 teaspoon pimentón dulce (or sweet paprika)",
        "A good pinch of saffron threads",
        "4 cleaned small squid, bodies sliced into 1/4-inch-wide rings, tentacles left whole",
        "2 cups medium-grain Spanish paella rice or risotto rice, such as Arborio or Carnaroli",
        "3 cups fish or chicken stock, plus more if needed",
        "1 cup dry white wine",
        "12 jumbo shrimp in their shells",
        "16 mussels, scrubbed and debearded"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Christmas",
        "Easter",
        "New Year's Day",
        "Dinner",
        "Lunch",
        "Mussel",
        "Shrimp",
        "Squid",
        "Saffron",
        "Summer",
        "Healthy",
        "Christmas Eve",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Seafood Paella",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-paella-366249"
}
