{
    "directions": [
        "Cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain, reserving 1/2 cup cooking liquid. Place 3 tablespoons hot cooking liquid in medium bowl. Sprinkle saffron over and let stand at room temperature 5 minutes. Transfer pasta to large bowl. Drizzle pasta with 1 tablespoon lemon juice and 1 tablespoon oil; toss to coat. Let stand at room temperature until cool, stirring occasionally.",
        "Add mayonnaise, sour cream, green onions, capers, minced tarragon, minced dill, sugar, remaining 6 tablespoons lemon juice, and remaining 5 tablespoons oil to bowl with saffron liquid. Whisk to combine. Season saffron dressing to taste with salt and pepper. Pour dressing over pasta. Add shrimp and celery; toss to coat. Add reserved pasta cooking liquid by tablespoonfuls if mixture is dry. Add crab; toss gently. Cover and refrigerate at least 1 hour and up to 4 hours.",
        "Line platter with arugula and butter lettuce leaves. Spoon pasta over greens. Garnish with lemon wedges and tarragon and dill sprigs. Serve cold."
    ],
    "ingredients": [
        "12 ounces campanelle (trumpet-shaped pasta) or macaroni",
        "1/8 teaspoon crushed saffron threads",
        "7 tablespoons fresh lemon juice, divided",
        "6 tablespoons extra-virgin olive oil, divided",
        "1/2 cup mayonnaise",
        "1/2 cup sour cream",
        "1/4 cup thinly sliced green onions",
        "2 tablespoons drained capers",
        "2 tablespoons minced fresh tarragon plus sprigs for garnish",
        "1 tablespoon minced fresh dill plus sprigs for garnish",
        "1 teaspoon sugar",
        "1 pound cooked medium shrimp",
        "1 cup finely chopped celery",
        "1/2 pound Dungeness crabmeat",
        "2 large handfuls of arugula",
        "2 small heads of butter lettuce",
        "Lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Pasta",
        "Freeze/Chill",
        "Quick & Easy",
        "Mayonnaise",
        "Crab",
        "Shrimp",
        "Celery",
        "Arugula",
        "Summer",
        "Tarragon",
        "Sour Cream",
        "Dill",
        "Capers",
        "Lettuce"
    ],
    "title": "Seafood Pasta with Lemon-Saffron Herb Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-pasta-with-lemon-saffron-herb-dressing-232554"
}
