{
    "directions": [
        "Put octopus in pressure cooker with water, bay leaf, and 1/2 teaspoon salt and seal pressure cooker with lid, then cook at high pressure according to manufacturer's instructions 10 minutes. Put pressure cooker in sink (do not remove lid) and run cold water over lid until pressure goes down completely. Remove lid. Transfer octopus to a cutting board, reserving 1/2 cup cooking liquid. Cut off and discard head, then cut tentacles into 1-inch pieces.",
        "Simmer tomatoes with their juice, basil, and oil in a heavy medium saucepan over medium heat, uncovered, stirring and mashing tomatoes occasionally, until thick and reduced to about 3/4 cup, 20 to 25 minutes.",
        "Purée basil, oil, butter, and 1/2 teaspoon salt in a blender, scraping down side as necessary, until smooth. Transfer to a small bowl.",
        "Cook spaghetti in a pasta pot of boiling salted water (3 tablespoons salt for 6 quarts water) until al dente.",
        "Meanwhile, purée garlic and oil in cleaned blender until smooth. Heat a dry 12-inch heavy skillet (not nonstick) over high heat until hot, 2 to 3 minutes. Add oil mixture, then immediately add octopus, shrimp, and mussels and sauté, stirring occasionally, until shrimp are browned on edges and mussels begin to open, 2 to 3 minutes. Add tomato sauce and reserved octopus-cooking liquid and cook, stirring, until mussels just open wide and shrimp are just cooked through, about 2 minutes more (discard any unopened mussels). Season with salt and pepper.",
        "Drain pasta and return to pot. Add squid to hot seafood in skillet, stirring to combine, then add to hot pasta and toss to combine (squid will cook as it is being tossed). Serve drizzled with all of basil purée."
    ],
    "ingredients": [
        "2 pound cleaned frozen octopus, thawed and rinsed",
        "2 cups water",
        "1 Turkish or 1/2 California bay leaf",
        "1 (14- to 15-ounce) can whole tomatoes in juice, drained, reserving juice, and coarsely chopped",
        "2 tablespoons chopped basil",
        "2 tablespoons extra-virgin olive oil",
        "3/4 cup packed basil leaves",
        "1/4 cup extra-virgin olive oil",
        "1 tablespoon unsalted butter, softened",
        "1 pound spaghetti",
        "6 garlic cloves",
        "1/3 cup extra-virgin olive oil",
        "1 pound large shrimp in shell, peeled, leaving tail fan attached, and deveined",
        "3/4 pound cultivated mussels, rinsed",
        "3/4 pound baby squid, cleaned, bodies cut into 1/4-inch rounds, and tentacles left whole",
        "Equipment: a pressure cooker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Pressure Cooker",
        "Garlic",
        "Pasta",
        "Tomato",
        "Lunch",
        "Basil",
        "Mussel",
        "Octopus",
        "Shrimp",
        "Squid",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Seafood Spaghetti",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-spaghetti-240990"
}
