{
    "directions": [
        "Dissolve gelatin in 1/2 cup cold water and let sit.",
        "Mix liquid crab boil (vary amount according to taste) with 1/4 cup water in small bowl. Soak seafood in crab boil mixture. (If using shrimp, cook until done first, then let soak.)",
        "Chop onions and pepper in food processor or blender. Slowly melt butter in skillet and sauté onion and pepper mixture until soft and onions are clear. Remove from pan and set aside.",
        "In the same pan used to cook the onions, add soup and cream cheese and melt over low heat until the cream cheese is melted and the mixture is smooth. Cream cheese burns easily, so stir constantly. Add dissolved gelatin and Worcestershire sauce to taste. The mixture will thicken as you stir. Turn off heat.",
        "Remove seafood from crab boil mixture, drain, and chop in food processor until smooth. Add to cream cheese mixture. Add onion mixture and mix well. Add Creole seasoning to taste.",
        "Pour in mold or shallow dish and refrigerate overnight or at least 3 hours, until thickened (it will set just like Jello).",
        "Release mold onto serving platter and garnish with cilantro. Serve."
    ],
    "ingredients": [
        "2 envelopes plain gelatin",
        "1/2 cup cold water plus additional 1/4 cup",
        "1/2 to 1 tablespoon liquid crab boil",
        "1 pound lump crabmeat or small shrimp (sometimes called salad shrimp; it's okay to use frozen), or 1/2 pound crabmeat and 1/2 pound shrimp, vary to personal preference",
        "1/2 small yellow or white onion",
        "1 green onion",
        "1/4 red bell pepper",
        "4 ounces butter",
        "1 teaspoon Creole seasoning (like Tony Chacherie's)",
        "1 can cream of mushroom soup",
        "1 8-ounce package cream cheese (not low- or nonfat, as the mixture will be too watery)",
        "Worcestershire sauce, to taste",
        "Cilantro, for garnish",
        "Special equipment: blender or food processor; medium-size mold (approximately 6 cups) or shallow dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Food Processor",
        "Mushroom",
        "Shellfish",
        "Buffet",
        "Cream Cheese",
        "Crab",
        "Shrimp",
        "Spice",
        "Spring",
        "Chill"
    ],
    "title": "Seafood Mold",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-mold-108136"
}
