{
    "directions": [
        "Make the chowder base. In a medium pot, heat the olive oil over medium-low heat. Add the onion and cook until softened, about 6 minutes. Add the leek, shallot, garlic, and ginger and cook, stirring occasionally, until the leek is softened, about 6 minutes. Add the squash, carrot, and curry powder, season with salt, and cook, stirring, for a few minutes.",
        "Raise the heat to medium-high, add the lemongrass, bay leaf, coconut milk, and broth, and bring to a simmer. Cook the chowder base until the squash and carrots are very tender, about 30 minutes.",
        "Meanwhile, make the mussels. In a medium pot, heat the olive oil over medium-low heat. Add the shallot and garlic and cook, stirring often, until softened, about 3 minutes. Increase the heat to high, add the wine, and bring to a boil. Add the mussels, cover the pot, and steam them until they just open wide, 3 to 4 minutes.",
        "Using a slotted spoon, transfer the mussels to a medium bowl. Remove the mussels from the shells; discard the shells and any mussels that haven't opened. Strain the broth into a small bowl.",
        "Once the squash is tender, discard the lemongrass and bay leaf. Process the chowder base in a blender until very smooth and creamy, then pass through a fine-mesh strainer into a large pot.",
        "Bring the chowder base to a simmer, then add the raw diced squash, potatoes, and turnips and cook until tender, about 10 minutes. Add the radishes, shrimp, and sea bass and simmer for about 3 minutes. Stir in the mussels and red pepper. The soup's consistency should be thinner than traditional chowder—add a splash of the reserved mussel liquid, if needed. Season with a touch of salt and pepper. Serve the chowder in bowls, topped with a drizzle of extra-virgin olive oil, the red onion, chives, and Aleppo pepper."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1/2 small white onion, minced",
        "1/2 leek (white and pale green parts), halved lengthwise and thinly sliced",
        "1 shallot, minced",
        "1 garlic clove, minced",
        "1 tablespoon peeled and minced ginger",
        "2 cups peeled, seeded, and cubed winter squash, such as kabocha",
        "1 carrot, sliced",
        "1/2 teaspoon mild curry powder",
        "Salt",
        "1 lemongrass stalk, bruised with the side of a chef's knife and halved",
        "1 bay leaf",
        "3/4 cup unsweetened coconut milk",
        "3 1/2 cups Vegetable Broth or water",
        "1 tablespoon olive oil",
        "1 shallot, minced",
        "1 garlic clove, minced",
        "1/2 cup white wine",
        "1 pound mussels, cleaned",
        "1 cup diced winter squash, such as kabocha",
        "1 cup diced potatoes",
        "8 baby turnips, peeled and quartered",
        "8 baby radishes, halved",
        "1/2 pound medium shrimp, peeled, deveined, and halved",
        "1/2 pound skinless black sea bass fillet, cut into small chunks",
        "1 ají dulce or other small red pepper, cored, seeded, halved crosswise, and julienned",
        "Salt and pepper",
        "Extra-virgin olive oil",
        "2 tablespoons minced red onion",
        "1 tablespoon finely chopped chives",
        "Aleppo pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Shellfish",
        "Dinner",
        "Lunch",
        "Seafood",
        "Bass",
        "Mussel",
        "Shrimp",
        "Winter",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Seafood Chowder with Squash",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-chowder-with-squash-51212610"
}
