{
    "directions": [
        "Thinly slice half of fennel bulb; set aside. Coarsely chop other half. Heat 2 tablespoons oil in a medium heavy pot over medium-low. Add chopped fennel, celery, leek, garlic, and bay leaf. Season with salt and pepper and cook, stirring occasionally, until vegetables are soft but have not taken on any color, 10–12 minutes.",
        "Meanwhile, remove shells and heads from all but 2 prawns (keep shells and heads for making broth).",
        "Once vegetables are soft, increase heat to medium and add prawn heads and shells and saffron (if using). Cook, stirring occasionally, until shells are bright pink, about 4 minutes. Add wine and bring to a boil. Reduce heat and simmer, stirring occasionally, until reduced by half, about 3 minutes. Add half of tomatoes and 4 cups water. Bring to a strong simmer, then reduce heat and simmer, uncovered, until reduced by about one-third and flavors have melded, 60–70 minutes.",
        "Remove from heat and puree mixture with an immersion blender until smooth (or let cool slightly and puree in batches in a blender). Strain broth through a finemesh sieve into a large measuring glass or bowl (you should have about 3 1/2 cups).",
        "Wipe out pot and heat 2 tablespoons oil over medium. Add fennel seeds, reserved sliced fennel, and remaining tomatoes, crushing them with your hands. Season with salt and pepper and cook, stirring occasionally, until fennel is softened and seeds are toasted, about 5 minutes. Add broth and bring to a simmer.",
        "Meanwhile, heat remaining 2 tablespoons oil in a small skillet over medium-high. Season snapper and scallops with salt and pepper. Cook snapper, skin side down, pressing gently with the back of a spatula to ensure contact with pan, until skin is brown and crisp, about 4 minutes. Turn fish and cook until cooked through, about 1 minute more. Transfer to a plate.",
        "Cook scallops in same skillet (no need to wipe out) until golden brown and just cooked through, about 3 minutes per side; transfer to plate with snapper. Slice squid bodies into 1/4\"-thick rings. Add cockles and mussels to pot with broth. Cook until they just start to open, then reduce heat to medium-low and add squid and all prawns, making sure they're submerged in the liquid. Simmer until cockles and mussels are opened and prawns and squid are just cooked through, about 3 minutes (discard any cockles and mussels that do not open).",
        "Divide seafood stew between bowls, placing a head-on prawn on top of each; nestle snapper and scallops into broth and scatter tarragon sprigs over. Serve with bread and butter alongside for dipping into broth.",
        "Broth can be made 1 day ahead; cover and chill."
    ],
    "ingredients": [
        "1 medium fennel bulb, halved",
        "6 tablespoons olive oil, divided",
        "2 celery stalks, chopped",
        "1 small leek, white and pale-green parts only, sliced",
        "3 garlic cloves, crushed",
        "1 bay leaf",
        "Kosher salt, freshly ground pepper",
        "1 pound head-on, shell-on prawns or large shrimp",
        "Pinch of saffron (optional)",
        "1/4 cup dry white wine",
        "1 (28-ounce can) whole peeled tomatoes",
        "1 teaspoon fennel seeds",
        "1 small snapper fillet, halved crosswise",
        "6 medium sea scallops, side muscle removed",
        "1/4 pound squid, mix of tentacles and bodies",
        "1/2 pound cockles or littleneck clams, scrubbed",
        "1/2 pound mussels, scrubbed, debearded",
        "Small sprigs tarragon (for serving)",
        "1/2 crusty baguette, sliced, toasted",
        "Unsalted butter, room temperature (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Tomato",
        "Kid-Friendly",
        "Snapper",
        "Clam",
        "Mussel",
        "Shrimp",
        "Squid",
        "Celery",
        "Fennel",
        "Anniversary",
        "Dinner"
    ],
    "title": "Seafood Stew for Two",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-stew-for-two-56390116"
}
