{
    "directions": [
        "Stir salt into hot water until dissolved.",
        "Sift flour, baking powder, and sugar into a large bowl, then make a well in center and add lard and butter. Stir salted water into well with a wooden spoon, melting lard and butter, then stir flour into liquid, adding a little water if necessary, to form a soft and pliable dough. Knead dough on an unfloured surface until smooth and glossy, 3 to 5 minutes (dough will be soft and slightly sticky).",
        "Cover dough with a kitchen towel (not terry cloth).",
        "Cook clams in wine in a medium saucepan, covered, over medium-high heat until just opened wide, about 5 minutes (discard any that remain unopened). Transfer clams to a bowl with a slotted spoon, then cook mussels in same liquid, covered, stirring once or twice, until opened, 3 to 5 minutes (discard unopened ones). Add mussels to clams and strain cooking liquid through a paper-towel-lined sieve into a bowl."
    ],
    "ingredients": [
        "1 teaspoon salt",
        "3/4 cup hot water",
        "2 1/2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon sugar",
        "1/4 cup lard at room temperature",
        "2 tablespoons unsalted butter at room temperature",
        "About 3 cups vegetable oil for frying",
        "1 1/2 pounds small hard-shelled clams (about 2 inches across), scrubbed",
        "1 cup dry white wine",
        "1 1/2 pounds cultivated mussels",
        "1 medium onion, finely chopped",
        "1 cup chopped scallions",
        "2 garlic cloves, finely chopped",
        "3 tablespoons unsalted butter",
        "1 1/2 tablespoons all-purpose flour",
        "1 fresh serrano or jalapeño chile, seeded and finely chopped",
        "1/2 tablespoon paprika (not hot)",
        "1 teaspoon dried oregano",
        "1/2 pound shrimp, peeled and finely chopped",
        "1/2 pound sea scallops, tough ligament from side of each discarded and scallops finely chopped",
        "1 tablespoon chopped parsley",
        "Equipment: a 4-inch round cookie cutter; a deep-fat thermometer",
        "1 deep-fat thermometer",
        "Accompaniment: tomato salsa"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Clam",
        "Mussel",
        "Scallop",
        "Shrimp",
        "Deep-Fry",
        "Gourmet",
        "Chile"
    ],
    "title": "Seafood Empanaditas",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-empanaditas-242309"
}
