{
    "directions": [
        "Cook shallot, carrot, celery, reserved shrimp shells, and reserved scallop muscles in 3 tablespoons butter in a 2- to 3-quart heavy saucepan over moderately low heat, uncovered, stirring occasionally, until vegetables are softened and pale golden, about 5 minutes. Add tomato paste and cook, stirring, 1 minute. Add wine and boil over high heat, stirring occasionally, until reduced to about 1/4 cup, 6 to 8 minutes. Add water, seafood glaze (if using), and parsley sprigs and simmer, covered, 30 minutes.",
        "Discard parsley and purée stock, including shrimp shells, in 2 batches in a blender (use caution when blending hot liquids). Pour through a fine-mesh sieve into a bowl, pressing on and discarding solids.",
        "Melt remaining 2 tablespoons butter in cleaned saucepan over moderately low heat, then add flour and cook roux over low heat, stirring, 3 minutes. Add warm seafood stock all at once, whisking, and bring to a boil, whisking. Add 1/2 cup cream and gently simmer sauce, whisking occasionally, 10 minutes. Stir in lemon juice, 1/2 teaspoon salt, and 1/4 teaspoon pepper.",
        "Transfer 1/2 cup sauce to a bowl set in a larger bowl of ice and cold water to cool for filling.",
        "Cut one third of shrimp and one third of scallops into 1/4-inch pieces and toss with 1/4 teaspoon salt. Purée remaining shrimp and scallops in a food processor with Cognac, cooled 1/2 cup sauce, remaining 3/4 teaspoon salt, and remaining 1/4 teaspoon pepper. Add remaining 1/2 cup cream and pulse just until combined. Transfer mousse to a large bowl and stir in shrimp and scallop pieces and chives.",
        "Preheat oven to 375°F.",
        "Boil lasagne noodles a few at a time in a large pot of boiling salted water , stirring to separate, until al dente, about 2 minutes for fresh noodles or about 6 minutes for no-boil. Gently transfer noodles with tongs and a slotted spatula to a large bowl of cold water to stop cooking, then lift out, shaking off water, and lay flat on dry kitchen towels (not terry cloth). Spread 1/3 cup mousse over each noodle, leaving a 1/2-inch border on both short ends. Starting with a short end, loosely roll up each noodle.",
        "Spread about 1/2 cup sauce on bottom of casserole dish and arrange cannelloni, seam sides down, snugly in 1 layer over sauce. Pour remaining sauce over cannelloni and bake, covered with foil, in middle of oven until sauce is bubbling and filling is just cooked through, 25 to 30 minutes. (To test filling for doneness, insert a metal skewer into a cannelloni and hold it there 5 seconds. Remove skewer and press it against your bottom lip: If metal is warm, casserole is hot all the way through and filling is cooked.)",
        "Preheat broiler.",
        "Remove foil and broil cannelloni about 3 inches from heat until brown spots appear, 3 to 5 minutes. Let stand 10 minutes before serving.",
        "Available at some supermarkets, specialty foods shops, and More Than Gourmet (800-860-9395)."
    ],
    "ingredients": [
        "1/3 cup finely chopped shallot",
        "2 tablespoons finely chopped carrot",
        "2 tablespoons finely chopped celery",
        "1 lb medium shrimp in shells (31 to 35 per lb), peeled, reserving shells, and deveined",
        "1 lb sea scallops, tough muscle removed from side of each and reserved",
        "5 tablespoons unsalted butter, softened",
        "1 teaspoon tomato paste",
        "1 cup dry white wine",
        "3 cups water",
        "1 tablespoon seafood glaze* (optional)",
        "2 fresh flat-leaf parsley sprigs",
        "3 tablespoons all-purpose flour",
        "1 cup heavy cream",
        "1/2 teaspoon fresh lemon juice, or to taste",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "2 tablespoons Cognac",
        "1/2 cup finely chopped fresh chives",
        "14 (6- by 3-inch) flat fresh or no-boil lasagne noodles (without curly edges)",
        "Special equipment: a 3-quart flameproof rectangular casserole dish (about 13 by 9 inches; not glass)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Pasta",
        "Shellfish",
        "Bake",
        "Broil",
        "Christmas",
        "Casserole/Gratin",
        "Scallop",
        "Shrimp",
        "Cognac/Armagnac",
        "White Wine",
        "Fall",
        "Winter",
        "Gourmet"
    ],
    "title": "Seafood Cannelloni",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-cannelloni-107417"
}
