{
    "directions": [
        "Combine oregano, thyme and parsley in small bowl. Transfer half of chopped herbs to processor. Add 1/4 cup olive oil, 1 tablespoon red wine, peppercorns, coriander, 3 minced garlic cloves, cayenne, salt and vinegar. Blend until coarse paste forms. Place chicken on large plate. Rub all but 2 tablespoons paste mixture over chicken. Cover and chill until ready to use.",
        "Divide 1/4 cup olive oil between 2 large Dutch ovens or heavy large deep skillets over medium heat. Divide chorizo, onions, tomatoes, ham, salt pork, remaining chopped herbs and remaining 5 minced garlic cloves between Dutch ovens. Cook until onions are soft but not brown, crumbling sausage with fork and stirring frequently, about 15 minutes. Transfer chorizo mixture to large bowl. (Can be prepared 1 day ahead. Cover and refrigerate remaining 2 tablespoons herb paste, chicken legs and chorizo mixture separately.)",
        "Divide remaining 1/4 cup olive oil between Dutch ovens. Add half of chicken and Italian sausages to each Dutch oven and cook until brown and partially cooked, turning frequently, about 8 minutes for sausages and 12 minutes for chicken. Transfer to plate. Return half of chorizo mixture to each Dutch oven.",
        "Meanwhile, bring stock and clam juice to simmer in heavy medium saucepan. Add saffron and mix well.",
        "Add half of rice to each Dutch oven. Cook over high heat until opaque, stirring frequently, about 5 minutes. Divide remaining herb paste and remaining 7 tablespoons wine between Dutch ovens. Bring to simmer, scraping up any bits. Stir half of stock mixture into each Dutch oven. Divide shrimp, clams, mussels, fish and bay leaves between Dutch ovens. Bring to boil. Reduce heat, cover and simmer until rice is very tender, stirring occasionally, about 25 minutes. Discard any clams or mussels that do not open.",
        "Meanwhile, prepare barbecue (medium-high heat). Brush grill and lobster with vegetable oil. Place lobsters on grill shell side down. Add chicken and grill until lobster and chicken are cooked through, turning occasionally, about 15 minutes. Transfer to large plate. Tent with foil to keep warm. Add Italian sausage and bell peppers to grill and cook until sausage is cooked through and pepper are brown in spots, turning frequently, about 10 minutes. Transfer sausages and peppers to another plate. Cut sausages into 2-inch pieces. Cut bell peppers into 1/2-inch-wide strips.",
        "Divide chicken, lobster, sausage, peppers and peas between Dutch ovens. Cover, remove from heat and let stand 15 minutes. Rearrange shellfish and peppers decoratively atop rice. Serve with lime and lemon wedges."
    ],
    "ingredients": [
        "1/4 cup finely chopped fresh oregano",
        "1/4 cup finely chopped fresh thyme",
        "1/4 cup finely chopped fresh Italian parsley",
        "3/4 cup olive oil",
        "8 tablespoons dry red wine",
        "1 tablespoon cracked black peppercorns",
        "1 tablespoon ground coriander",
        "8 garlic cloves, minced",
        "1 tablespoon cayenne pepper",
        "2 teaspoons salt",
        "1 teaspoon red wine vinegar",
        "8 chicken legs",
        "1 1/2 pound Spanish chorizo or linguiça sausage,* casings removed",
        "4 large onions, coarsely chopped",
        "1/2 pound tomatoes, cut into wedges",
        "8 ounces 1/4-inch-thick ham slices, cut into 2 x 1/4-inch strips",
        "2 tablespoons diced salt pork",
        "1 pound hot Italian sausages",
        "3 1/2 cups chicken stock or canned broth",
        "3 cups bottled clam juice",
        "1 teaspoon saffron threads, crushed",
        "4 cups short-grain rice",
        "1 1/2 pounds uncooked large shrimp, peeled, deveined, tails intact",
        "16 littleneck clams, scrubbed",
        "16 mussels, scrubbed and debearded",
        "1 pound 1-inch-thick halibut or sea bass fillets or shark steaks, cut into 1-inch pieces",
        "2 bay leaves",
        "4 8-ounce frozen uncooked lobster tails (optional), thawed and split lengthwise",
        "Vegetable oil",
        "3 large yellow bell peppers, quartered",
        "3 large red bell peppers, quartered",
        "3 large green bell peppers, quartered",
        "1 10-ounce package frozen peas, thawed",
        "Limes, quartered",
        "Lemon, quartered",
        "*Spanish chorizo, a fresh, garlic-flavored pork link sausage that is milder than Mexican chorizo, is available at Spanish markets. Linguiça, a similar Portuguese sausage, is available at Spanish and Latin American markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fish",
        "Pepper",
        "Pork",
        "Rice",
        "Shellfish",
        "Bake",
        "Summer"
    ],
    "title": "Seafood, Sausage and Bell Pepper Paella",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-sausage-and-bell-pepper-paella-2027"
}
