{
    "directions": [
        "In a small bowl combine well the herring, the onion, the orange juice, and pepper to taste and let the herring marinate, covered and chilled, for at least 3 hours or overnight.",
        "In a bowl with an electric mixer cream the butter and beat in the sour cream and the lemon juice gradually. Beat the mixture until it is light and smooth and beat in the chives and salt and pepper to taste.",
        "Toast the bread until it is just pale golden, cut out 3 decorative shapes from each piece, and spread one side of each shape with some of the lemon-chive butter. In a small bowl toss together the salmon and the red onion and divide the mixture among 16 of the toasts. Drain the herring, discarding the onion, and divide it among 16 of the toasts. Divide the caviar among the remaining 16 toasts. Garnish the salmon canapés with the parsley leaves, garnish the herring canapés with the orange slices, the chives, and the zest, and arrange the canapés on a platter. The canapés may be prepared 1 hour in advance and kept covered and chilled."
    ],
    "ingredients": [
        "1/4 pound marinated herring, rinsed, drained, and cut into 16 pieces",
        "1/2 red onion, sliced thin",
        "3 tablespoons fresh orange juice",
        "3/4 stick (6 tablespoons) unsalted butter, softened",
        "3 tablespoons sour cream",
        "2 teaspoons fresh lemon juice",
        "1 tablespoon minced fresh chives",
        "16 slices of rye bread",
        "2 ounces smoked salmon, chopped fine",
        "2 tablespoons finely chopped red onion",
        "1 ounce black caviar",
        "fresh parsley leaves",
        "thin crosswise slices of orange sections",
        "fresh chives",
        "1/2-inch-long fine julienne of orange zest"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Fish",
        "Marinate",
        "Cocktail Party",
        "Oscars",
        "New Year's Eve",
        "Lemon",
        "Orange",
        "Salmon",
        "Chive",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Seafood Canapes with Lemon-Chive Butter",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-canapes-with-lemon-chive-butter-11732"
}
