{
    "directions": [
        "Bring an 8-quart pot three-quarters full of salted water to a boil.",
        "While water is heating, force beans, stem ends first, through frencher (see cooks' note, below). Cook beans in boiling water, uncovered, until crisp-tender, 3 to 4 minutes, then immediately transfer with a slotted spoon (reserving cooking water) to a bowl of ice and cold water to stop cooking. Drain beans in a colander, then pat dry with paper towels. Set aside.",
        "Return water to a boil, then plunge lobster headfirst into water and cook over high heat, covered, 8 minutes from time it enters water. Transfer lobster with tongs to a shallow baking pan. Reserve water in pot.",
        "While lobster is boiling, coarsely chop tomatoes with onion in a food processor. Transfer to a large bowl and add vinegar and 1/2 teaspoon salt. Let stand 15 minutes. Cut fennel into paper-thin slices with slicer and stir into tomato mixture along with 1 1/2 tablespoons oil.",
        "Return water in pot to a boil. Add shrimp and simmer until just cooked through, about 3 minutes, then transfer to pan with lobster, reserving cooking water. Add scallops to pot and simmer until just cooked through, about 3 minutes, then transfer to pan with lobster and shrimp. Discard cooking water.",
        "When cool enough to handle, remove meat from lobster tail and claws using kitchen shears, catching juices in pan. Working over pan, remove shells from shrimp. Discard lobster and shrimp shells. Cut shrimp in half lengthwise and devein. Cut lobster meat and scallops into 1/2-inch pieces. Transfer seafood to a bowl and pour juices from pan through a fine-mesh sieve over seafood. Toss seafood with pepper and remaining 1/2 tablespoon oil and 1/4 teaspoon salt, then add to fennel mixture along with basil and green beans, tossing well."
    ],
    "ingredients": [
        "1/2 lb green beans, stem ends trimmed",
        "1 (1 1/4-lb) live lobster",
        "3/4 lb cherry tomatoes (2 cups)",
        "1/2 cup coarsely chopped red onion",
        "2 tablespoons red-wine vinegar",
        "3/4 teaspoon salt",
        "2 small fennel bulbs (sometimes called anise; about 1 1/2 lb total), stalks discarded",
        "2 tablespoons extra-virgin olive oil",
        "1 lb large shrimp in shell (21 to 25 per lb)",
        "1 lb sea scallops, tough muscle from side of each discarded if attached",
        "1/4 teaspoon black pepper",
        "1/3 cup torn fresh basil leaves",
        "Special equipment: a green-bean frencher (optional); an adjustable-blade slicer",
        "Garnish: coarse sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Shellfish",
        "Vegetable",
        "Low Fat",
        "Lunch",
        "Seafood",
        "Lobster",
        "Scallop",
        "Shrimp",
        "Fennel",
        "Green Bean",
        "Summer",
        "Healthy",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Seafood Salad with Fennel and Green Beans",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-salad-with-fennel-and-green-beans-232312"
}
