{
    "directions": [
        "Heat olive oil in a very large pot over medium-high heat until it begins to smoke. Place chicken, skin-side down, into hot oil and cook until browned on the outside and no longer pink in the middle, about 5 minutes per side, flipping 4 times. Remove chicken from oil with a slotted spoon and let cool on a plate.",
        "Saute mushrooms, onion, and garlic in the hot oil until onions are translucent, 5 to 7 minutes. Add shrimp, sea scallops, lobster meat, red bell pepper, and green bell pepper; cook and stir for 5 minutes.",
        "Pull meat off the bones of the chicken thighs, discarding bones and skin or using to make a stock. Stir chicken meat into seafood-vegetable mixture.",
        "Mix rice, chicken stock, peas, tomatoes, saffron threads, and salt into seafood-vegetable mixture; cook, stirring frequently, until liquid is absorbed. Reduce heat to low, cover pot, and simmer for 30 minutes.",
        "Nestle clams into rice mixture, cover pot, and cook until clams pop open, about 10 minutes more. Garnish paella with lemon wedges and cover pot. Remove pot from heat and let paella sit until flavors have blended, about 20 minutes."
    ],
    "ingredients": [
        "1/2 cup olive oil",
        "3 pounds chicken thighs",
        "1 pound baby bella mushrooms, sliced",
        "1 cup diced onion",
        "1 tablespoon diced garlic, or to taste",
        "2 pounds peeled and deveined jumbo shrimp",
        "1 pound sea scallops, halved",
        "1 pound lobster meat, chopped",
        "1 cup diced red bell pepper",
        "1 cup diced green bell pepper",
        "6 cups rice",
        "5 cups chicken stock",
        "1 pound frozen peas",
        "1 (14 ounce) can crushed tomatoes",
        "2 teaspoons saffron threads",
        "2 teaspoons salt",
        "2 pounds steamer clams",
        "6 lemon wedges"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Seafood Paella",
    "url": "http://allrecipes.com/recipe/241175/seafood-paella/"
}
