{
    "directions": [
        "Preheat broiler. Arrange eggplants on large baking sheet. Pierce with fork. Broil 4 minutes per side. Scoop out eggplant pulp, leaving 1/2-inch-thick shell intact. Place eggplant pulp in heavy medium saucepan. Pour 2 cups water over. Add 1 teaspoon salt. Bring to boil. Reduce heat, cover and simmer 15 minutes. Uncover and simmer until eggplant is very tender and liquid evaporates, about 5 minutes. Remove from heat.",
        "Preheat oven to 375°F. Brush eggplant shells with 1 tablespoon oil. Bake until shells are tender but still hold shape, about 20 minutes.",
        "Meanwhile, heat 3 tablespoons oil in heavy large skillet over medium-high heat. Add onions; sauté until tender, about 5 minutes. Add boiled eggplant, shrimp and cayenne; sauté until shrimp are cooked through, about 4 minutes. Remove from heat. Stir in 1 cup breadcrumbs and crabmeat. Season with salt and pepper. Fill eggplant shells with seafood mixture. (Can be prepared 1 day ahead; refrigerate.)",
        "Preheat oven to 375°F. Sprinkle stuffing with remaining 2 tablespoons breadcrumbs. Bake stuffed eggplants until heated through, about 30 minutes. Let stand 5 minutes. Serve hot."
    ],
    "ingredients": [
        "4 medium eggplants (about 1 pound each), split lengthwise",
        "2 cups water",
        "1 teaspoon salt",
        "4 tablespoons vegetable oil",
        "2 onions, chopped (about 2 cups)",
        "1 pound uncooked large shrimp, peeled, deveined, coarsely chopped",
        "1/4 teaspoon cayenne pepper",
        "1 cup plus 2 tablespoons dry Italian-style breadcrumbs",
        "1/2 pound crabmeat, drained well, picked over"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Bake",
        "Broil",
        "Crab",
        "Shrimp",
        "Eggplant",
        "Fall",
        "London",
        "England"
    ],
    "title": "Seafood-Stuffed Eggplant",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-stuffed-eggplant-1024"
}
