{
    "directions": [
        "Cook bacon in a 10-inch heavy skillet (preferably cast-iron) over medium heat until browned but not crisp. Transfer bacon to a bowl with a slotted spoon and transfer rendered fat to a heatproof liquid measure, then add enough oil to fat to bring total to 3/4 cup.",
        "Stir together fat and flour in skillet with a wooden spoon, then cook roux over medium-low heat, stirring constantly, until well browned (a shade darker than peanut butter), about 20 minutes.",
        "Add celery, bell pepper, onion, and garlic and cook, stirring occasionally, until vegetables are tender, about 15 minutes. Transfer to a 6- to 7-quart pot.",
        "Stir in stock, tomatoes, okra, thyme, bay leaf, cayenne, and 2 teaspoons salt and briskly simmer, uncovered, stirring occasionally, until vegetables are very tender, about 30 minutes.",
        "Add parsley, scallions, shrimp, and oysters with their liquor and cook, stirring, until seafood is just cooked through, about 5 minutes.",
        "Stir in crabmeat and bacon and simmer until heated through, about 1 minute. Season with salt. Discard bay leaf."
    ],
    "ingredients": [
        "1/2 pound bacon, chopped",
        "About 1/2 cup vegetable oil",
        "3/4 cup all-purpose flour",
        "2 celery ribs, chopped",
        "1 medium green bell pepper, chopped",
        "1 medium onion, chopped",
        "5 garlic cloves, finely chopped",
        "2 1/2 quarts fish or chicken stock (or a combination)",
        "1 (14-ounce) can whole tomatoes in juice, drained and chopped",
        "1 pound frozen cut okra (not thawed)",
        "1 teaspoon chopped thyme",
        "1 Turkish or 1/2 California bay leaf",
        "1 rounded teaspoon cayenne",
        "1/2 cup chopped flat-leaf parsley",
        "1/2 cup chopped scallions",
        "1 1/2 pound medium shrimp in shell, peeled and deveined",
        "2 dozen shucked oysters with their liquor, oysters picked over for shell fragments",
        "1/2 pound lump crabmeat, picked over",
        "Accompaniments: rice; gumbo filé powder",
        "N/A gumbo filé",
        "N/A powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Tomato",
        "Mardi Gras",
        "Lunch",
        "Bacon",
        "Crab",
        "Oyster",
        "Shrimp",
        "Okra",
        "Simmer",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Seafood Gumbo",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-gumbo-241194"
}
