{
    "directions": [
        "Whisk 2 tablespoons oil and next 5 ingredients in small bowl. Arrange salmon and scallops on separate sides in 13x9x2-inch glass baking dish. Pour marinade over and toss to coat, keeping fish and scallops apart. Let marinate at room temperature at least 30 minutes and up to 1 hour, turning occasionally. Drain separately, reserving marinade.",
        "Heat remaining 2 tablespoons oil in large nonstick skillet over medium-high heat. Sprinkle salmon and scallops with salt and pepper. Add salmon to skillet; sauté until just opaque in center, about 3 minutes. Using slotted spoon, transfer salmon to platter. Add scallops to skillet; sauté until just opaque in center, about 1 1/2 minutes per side. Transfer to platter with salmon. Pour reserved marinade into skillet; add mussels and clams. Cover and cook over high heat until mussels and clams open, about 3 minutes (discard any that do not open). Using slotted spoon, transfer mussels and clams to platter with salmon and scallops; cool to room temperature. Drizzle seafood with some Cilantro Dressing.",
        "*Ground chipotle chile pepper is sold in the spice section of most supermarkets."
    ],
    "ingredients": [
        "4 tablespoons olive oil, divided",
        "2 tablespoons fresh lime juice",
        "2 tablespoons grated lime peel",
        "1 1/2 tablespoons honey",
        "1/2 teaspoon salt",
        "1/4 teaspoon (generous) ground chipotle chile pepper*",
        "1 1 1/2-pound skinless salmon fillet, cut into 1 1/4-inch cubes",
        "18 large sea scallops",
        "2 dozen mussels, scrubbed, debearded",
        "2 dozen Manila (small) clams, scrubbed",
        "Cilantro Dressing"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Marinate",
        "Sauté",
        "Low Carb",
        "Graduation",
        "Salmon",
        "Scallop",
        "Summer",
        "Healthy",
        "Cilantro"
    ],
    "title": "Seafood Salad with Cilantro Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-salad-with-cilantro-dressing-109783"
}
