{
    "directions": [
        "In a large pot, bring about 5 cups of water to a boil, add the potatoes, and simmer until potatoes are cooked through but firm, 10 to 12 minutes. Drain potatoes over a large bowl, reserving cooking liquid. (If making chowder ahead of time, let potatoes cool to room temperature, then refrigerate until ready to serve soup.)",
        "Meanwhile, in a large 5-quart pot, melt butter over medium heat. Add bacon, stirring occasionally, until fat is rendered and bacon begins to brown, about 5 minutes. Add celery, leeks, and garlic, and cook until vegetables are translucent, about 6 minutes. Stir in reserved potato cooking liquid, 1/2 teaspoon salt, and thyme. Bring to a boil over medium-high heat. Turn down the heat, cover, and simmer until liquid is opaque and flavorful, about 30 minutes.",
        "When ready to serve, bring soup base to a boil over medium-high heat. Add cooked potatoes, reduce heat to medium, and simmer. When potatoes are heated through, gently add the fish and the clams, nestling them in the broth. Cover the pot and simmer until clams open and fish is opaque and cooked through, 7 to 9 minutes. Add cream and pepper and bring to a simmer again. Season to taste with salt and pepper. Garnish chowder with parsley and serve with crusty bread."
    ],
    "ingredients": [
        "1 1/2 pounds Yukon Gold potatoes, peeled and cut into 1/2-inch cubes (about 2 large potatoes)",
        "1 tablespoon unsalted butter",
        "4 ounces high-quality bacon, sliced into 1/2-inch pieces (about 4 slices)",
        "2 celery stalks, thinly sliced\non a bias (about 1/2 cup)",
        "2 medium leeks, white and light-green parts only, halved and thinly sliced\n(about 1 1/2 cups)",
        "1 garlic clove, minced",
        "1/2 teaspoon kosher salt, plus more for seasoning",
        "1/2 teaspoon fresh thyme leaves",
        "2 pounds skinless haddock (or cod) fillets, cut into 2-inch cubes",
        "3 pounds mixed littleneck clams and cockles, rinsed and scrubbed",
        "2 cups heavy cream",
        "Ground white pepper",
        "1/4 cup freshly chopped flat-leaf parsley",
        "Crusty bread, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Potato",
        "Bacon",
        "Leek",
        "Thyme"
    ],
    "title": "Seafood Chowder with Bacon and Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/seafood-chowder-with-bacon-and-thyme-51254410"
}
