{
    "directions": [
        "Heat oil in a large skillet over medium-high heat. Saute onion and mushrooms in hot oil until onion begins to soften, about 5 minutes. Season vegetable mixture with salt and pepper; continue to saute until onions and mushrooms brown, about 5 minutes more.",
        "Pour the red wine into the pan and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Cook and stir until wine evaporates, about 2 minutes; remove from heat.",
        "Preheat an outdoor grill for medium-high heat and lightly oil the grate.",
        "Cook burgers until they are firm, hot in the center, and just turning from pink to grey, 8 to 10 minutes per side for medium well. An instant-read thermometer inserted into the center should read 150 degrees F (65 degrees C).",
        "Whisk mayonnaise, Sriracha sauce, and espresso together in a bowl until aioli is smooth.",
        "Spread aioli on each hamburger bun. Place a beef patty on the bottom bun, top with a slice of Monterey Jack cheese, 1/4 the onion-mushroom mixture, 1/4 cup arugula, and cover burger with the top bun. Repeat with remaining burgers."
    ],
    "ingredients": [
        "1 teaspoon vegetable oil",
        "1 sweet onion (such as Walla Walla), sliced",
        "8 ounces mushrooms, sliced",
        "salt and ground black pepper to taste",
        "1/2 cup Washington state red wine (such as a Merlot or Syrah)",
        "4 (6 ounce) grass-fed ground beef patties",
        "Seattle Aioli:",
        "1/2 cup mayonnaise",
        "1/2 teaspoon Sriracha sauce",
        "1/2 shot brewed espresso (such as Starbucks®)",
        "4 whole grain or artisan hamburger buns (such as Macrina Bakery®)",
        "4 slices Monterey Jack cheese (such as Beecher's® Just Jack®)",
        "1 cup farmer's market arugula, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Seahawk Burger",
    "url": "http://allrecipes.com/recipe/236417/seahawk-burger/"
}
