{
    "directions": [
        "1. Set a heavy-bottomed 12-inch skillet over low heat for 5 to 10 minutes, or medium heat for 3 to 4 minutes, while preparing the meal and seasoning the fish steaks. Three to four minutes before searing the fish steaks, turn on the exhaust fan and increase the heat to high.",
        "2. Set steaks on a plate, drizzle with oil; turn to coat. Sprinkle with salt and pepper.",
        "3. A minute or so after the residual oils in the skillet send up wisps of smoke, put the fish steaks in the pan. Cook over high heat until the steaks develop a thick, rich brown crust, about 3 1/2 to 4 minutes. Turn the steaks and continue to cook over high heat until the other sides develop a thick, rich brown crust and the fish is medium-rare to medium, 3 1/2 to 4 minutes longer. (For medium-well-done fish, turn the heat to low and cook, turning once, for 1 to 2 minutes longer.) Remove to a plate and let stand 5 minutes.",
        "4. Serve with lemon wedges, or an uncooked relish or flavored butter. Or make a pan sauce by adding 1/2 cup liquid to the skillet; boil until the liquid is reduced to about 1/4 cup. Tilting the skillet so that the reduced liquid is at one side of the pan, whisk in butter or other enrichments until the sauce is smooth and glossy.",
        "Mash the horseradish and butter into a paste. Add the vinegar and season to taste with salt and pepper. Smear a tablespoon of flavored butter over each portion and serve immediately."
    ],
    "ingredients": [
        "1 1/2 pounds tuna, swordfish or shark steaks, but 1 to 1 1/4 inches thick",
        "2 tablespoons olive or vegetable oil",
        "Salt and ground black pepper",
        "Lemon wedges, or a pan sauce, uncooked relish, or flavored butter",
        "3 tablespoons bottled pure horseradish with liquid squeezed out",
        "3 tablespoons butter, at room temperature",
        "1/2 teaspoon vinegar",
        "Salt and ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fish",
        "Sauté",
        "Quick & Easy",
        "Horseradish",
        "Vinegar",
        "Spring"
    ],
    "title": "Seared Fish Steaks with Horseradish Butter",
    "url": "http://www.epicurious.com/recipes/food/views/seared-fish-steaks-with-horseradish-butter-103425"
}
