{
    "directions": [
        "Mix first 7 ingredients in small bowl to blend. Place salmon fillets, skin side down, on rimmed baking sheet. Sprinkle 1 1/2 teaspoons spice mixture over each fillet. Cover with plastic and refrigerate at least 3 hours or overnight.",
        "Whisk vinegar and next 5 ingredients in small bowl to blend. for rice: Melt butter in heavy large saucepan over medium heat. Add rice and sauté until rice begins to turn opaque, about 2 minutes. Stir in 1 cup water and coconut milk and bring to boil. Cover and reduce heat to low; cook until rice is cooked through and liquid is absorbed, about 18 minutes. Season to taste with salt and pepper.",
        "Meanwhile, heat vegetable oil in heavy large skillet over medium-high heat. Add salmon fillets, flesh side down, to skillet. Sear until brown and crisp, about 3 minutes. Turn fillets over and sear skin side until salmon is just cooked through, about 3 minutes.",
        "Spoon rice onto plates, dividing equally. Top each serving with seared salmon fillet, then Thai Vegetables. Drizzle dressing around and serve immediately, passing extra dressing separately."
    ],
    "ingredients": [
        "1 teaspoon chili powder",
        "1 teaspoon curry powder",
        "1 teaspoon ground coriander",
        "1 teaspoon ground cumin",
        "1 teaspoon mustard powder",
        "1 teaspoon salt",
        "1 teaspoon sugar",
        "4 6- to 7-ounce salmon fillets with skin",
        "6 tablespoons rice vinegar",
        "3 tablespoons soy sauce",
        "2 tablespoons oriental sesame oil",
        "2 tablespoons chopped fresh cilantro",
        "1 tablespoon finely chopped peeled fresh ginger",
        "1 teaspoon sugar",
        "1 tablespoon butter",
        "1 cup basmati rice",
        "1 cup water",
        "2/3 cup canned unsweetened coconut milk",
        "2 tablespoons vegetable oil",
        "Thai Vegetables"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Ginger",
        "Rice",
        "Vegetable",
        "Sauté",
        "Coconut",
        "Salmon",
        "Spice",
        "Spring",
        "Healthy",
        "Sesame",
        "Soy Sauce"
    ],
    "title": "Seared Salmon with Thai Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/seared-salmon-with-thai-vegetables-104812"
}
