{
    "directions": [
        "Place duck breast halves between 2 sheets of plastic wrap. Pound lightly to even thickness (about 1/2 to 3/4 inch). Discard plastic wrap. Using sharp knife, score skin in 3/4-inch diamond pattern (do not cut into flesh). DO AHEAD: Can be made 8 hours ahead. Cover and chill.",
        "Melt 1 tablespoon butter in heavy large skillet over medium-high heat. Sprinkle duck with salt and pepper. Add duck, skin side down, to skillet and cook until skin is browned and crisp, about 5 minutes. Turn duck breasts over, reduce heat to medium, and cook until browned and cooked to desired doneness, about 4 minutes longer for small breasts and 8 minutes longer for large breast for medium-rare. Transfer to work surface, tent with foil to keep warm, and let rest 10 minutes.",
        "Meanwhile, pour off all but 2 tablespoons drippings from skillet. Add shallot to skillet and stir over medium heat 30 seconds. Add broth, cherries, Port, and honey. Increase heat to high and boil until sauce is reduced to glaze, stirring often, about 3 minutes. Whisk in 1 tablespoon cold butter. Season sauce to taste with salt and pepper.",
        "Thinly slice duck. Fan slices out on plates. Spoon sauce over and serve.",
        "With the duck, pour a medium-bodied red from Spain's Rioja region. We like the Viña Santurnia 2005 Crianza Rioja ($13), which has black cherry flavors and smoky notes."
    ],
    "ingredients": [
        "2 5-to 6-ounce duck breast halves or one 12-to 16-ounce duck breast half",
        "2 tablespoons (1/4 stick) chilled butter, divided",
        "1/4 cup finely chopped shallot (about 1 large)",
        "1/2 cup low-salt chicken broth",
        "8 halved pitted sweet red cherries, fresh or frozen, thawed",
        "2 tablespoons tawny Port",
        "1 tablespoon orange blossom honey"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Valentine's Day",
        "Father's Day",
        "Dinner",
        "Cherry",
        "Port",
        "Summer",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Seared Duck Breast with Cherries and Port Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/seared-duck-breast-with-cherries-and-port-sauce-353376"
}
