{
    "directions": [
        "Freeze the beef for 30 minutes. Cut across the grain into 1/4-inch slices. In a bowl, combine the lemongrass, 1 Tbs. of the fish sauce, the soy sauce, 3/4 tsp. of the sugar, half of the minced shallots and a generous amount of pepper; stir to mix well. Add the beef, stir to coat and marinate at room temperature for 15 to 30 minutes.",
        "Meanwhile, in a small bowl, combine 3 Tbs. of the oil, the lime juice, chilies, the remaining 1 Tbs. fish sauce, the remaining 3/4 tsp. sugar and the remaining shallots. Season the dressing with salt and pepper.",
        "In a large bowl, combine the lettuce, bean sprouts, cucumbers, basil, mint and onion and toss to mix. Add the dressing and toss to coat.",
        "In a large, heavy fry pan over high heat, warm the remaining 1 Tbs. oil. Working in batches, add the beef in a single layer (do not crowd the pan) and cook, turning once, until just brown, about 20 seconds per side. Arrange the beef on top of the salad and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Weeknight Fresh & Fast,",
        "by Kristine Kidd (Williams-Sonoma, 2011)."
    ],
    "ingredients": [
        "1 lb. beef top sirloin, fat trimmed, cut in half lengthwise",
        "2 Tbs. minced fresh lemongrass (from bottom 6 inches of the\n  stalk)",
        "2 Tbs. Asian fish sauce",
        "1 Tbs. low-sodium soy sauce",
        "1 1/2 tsp. sugar",
        "2 large shallots, minced",
        "Freshly ground pepper, to taste",
        "4 Tbs. peanut oil",
        "3 Tbs. fresh lime juice",
        "1 1/2 to 2 serrano chilies, seeded and minced",
        "Coarse kosher salt, to taste",
        "1 head red leaf lettuce, torn into bite-size pieces",
        "3/4 lb. bean sprouts",
        "4 Persian cucumbers, halved lengthwise and sliced crosswise",
        "1 cup packed fresh basil leaves, preferably Thai basil",
        "1/3 cup packed fresh mint leaves",
        "1/2 red onion, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Seared Beef Salad with Thai Flavors",
    "url": "http://www.williams-sonoma.com/recipe/seared-beef-salad-thai-flavors.html"
}
