{
    "directions": [
        "Soak tomatoes in warm water until softened, 20 to 25 minutes. Drain and pat dry, then mince. Stir together tomatoes, butter, and salt, then form into an 8-inch log on a sheet of plastic wrap and chill, wrapped in plastic wrap, until firm, about 1 hour. Cut tomato butter into 12 equal pieces.",
        "Cook shallot in 1 piece of tomato butter (keep remaining butter chilled) in a small heavy saucepan over moderately low heat, stirring, until softened, about 3 minutes. Add wine and boil until liquid is reduced to about 1/3 cup, about 10 minutes.",
        "Reduce heat to low and whisk in remaining cold tomato butter 1 piece at a time, adding each piece before previous one has completely melted and lifting pan from heat occasionally to cool mixture (sauce should not get hot enough to separate). Whisk in water and lemon juice, then season with salt and pepper.",
        "Transfer beurre blanc to a bowl and keep warm, covered, in a larger bowl of warm water.",
        "Pat scallops dry and season with salt and pepper. Heat 1 teaspoon oil in a 12-inch nonstick skillet over moderately high heat until hot but not smoking, then sear 6 to 8 scallops, turning once, until golden brown and just cooked through, 2 to 4 minutes total. Transfer to a platter as cooked and keep warm, loosely covered with foil. Sear remaining scallops in same manner, wiping out skillet and adding about 1 teaspoon oil between batches.",
        "Spoon 3 tablespoons beurre blanc onto each of 6 plates, then top with scallops."
    ],
    "ingredients": [
        "1/4 cup packed soft dried tomatoes (not packed in oil; 1 1/4 oz)",
        "1 1/2 sticks (3/4 cup) unsalted butter, softened",
        "1/8 teaspoon salt",
        "1/3 cup minced shallot",
        "2/3 cup dry white wine",
        "3 tablespoons water",
        "1 teaspoon fresh lemon juice",
        "2 lb large sea scallops (30), tough muscle removed from side of each if necessary",
        "About 2 tablespoons vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Sauté",
        "Christmas",
        "Scallop",
        "White Wine",
        "Summer",
        "Gourmet"
    ],
    "title": "Seared Scallops with Tomato Beurre Blanc",
    "url": "http://www.epicurious.com/recipes/food/views/seared-scallops-with-tomato-beurre-blanc-106527"
}
