{
    "directions": [
        "Place a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Add the sweet potatoes, cover, and steam until easily pierced with a fork, 15 to 20 minutes.",
        "Meanwhile, melt 2 tablespoons of butter in a large saucepan over medium heat. Whisk in the flour and ginger slice. Cook and stir until the flour has turned golden brown, 2 to 3 minutes. Whisk in the vegetable broth, brown sugar, nutmeg, and cinnamon stick. Bring to a simmer over medium-high heat whisking constantly, then reduce heat to medium-low, and simmer 10 minutes. Add the steamed sweet potatoes and simmer 5 minutes more.",
        "Remove and discard the cinnamon stick and ginger slice. Pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Whisk in the milk and cook over low heat until hot.",
        "While the soup is reheating, season the scallops with salt and pepper. Melt the remaining 2 tablespoons of butter in a large skillet over medium heat until it begins to brown. Cook the scallops in the hot butter until browned and crispy on the outside, but no longer translucent on the inside, about 3 minutes total depending on the size of the scallops.",
        "Ladle the soup into 4 bowls, and lay the scallops on top of the soup. Sprinkle with a little cayenne pepper to serve."
    ],
    "ingredients": [
        "2 sweet potatoes, peeled and cubed",
        "2 tablespoons butter",
        "1 tablespoon all-purpose flour",
        "1 (1/4 inch thick) slice fresh ginger",
        "1 1/2 cups vegetable broth",
        "1 tablespoon brown sugar",
        "1/2 teaspoon ground nutmeg",
        "1 cinnamon stick",
        "1 cup milk",
        "1 pound sea scallops",
        "1 teaspoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "2 tablespoons butter",
        "cayenne pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Seared Scallops with Sweet Potato Soup",
    "url": "http://allrecipes.com/recipe/216429/seared-scallops-with-sweet-potato-sou/"
}
