{
    "directions": [
        "To make the balsamic syrup, pour the vinegar into a small saucepan. Place over low heat, bring to a gentle simmer and cook until reduced to 1/2 cup, about 1 1/2 hours. The vinegar will have become syrupy. Remove from the heat and let cool to room temperature. Transfer the syrup to a small bowl, cover and refrigerate until needed. Set aside 2 Tbs. for this recipe; reserve the remainder for another use. (The balsamic syrup will keep, tightly capped, for up to 1 month.)",
        "Let the beef stand at room temperature for about 30 minutes.",
        "In a small bowl, stir together the ginger, garlic powder, onion powder, cumin seeds, coriander seeds, cilantro, salt and pepper. Spread the mixture on a large flat plate. Brush the beef on all sides with the mustard. Roll the beef in the spice mixture, coating it evenly and pressing the mixture lightly with your fingers so that it adheres to the surface.",
        "In a large, nonstick fry pan over high heat, warm the olive oil. When the oil is hot, add the beef and sear, turning as needed, until browned evenly on all sides, about 5 minutes; the meat will still be rare in the center. Let the meat rest for about 10 minutes. (The meat can be prepared up to this point 1 hour in advance.) Transfer the meat to a cutting board and slice against the grain as thinly as possible.",
        "Divide the slices evenly among individual plates, folding the pieces and overlapping them slightly to cover the center of each plate. Scatter the cilantro, mint and green onions over the beef slices. Finish each plate with a drizzle of extra-virgin olive oil and the reserved balsamic syrup. Serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma,",
        "Entertaining",
        ", Edited by Chuck Williams (Oxmoor House, 2004)."
    ],
    "ingredients": [
        "2 cups young balsamic vinegar",
        "1 1/2-lb. piece of beef tenderloin, trimmed",
        "1 tsp. ground ginger",
        "1 tsp. garlic powder",
        "1 tsp. onion powder",
        "1 tsp. cumin seeds, crushed",
        "1 tsp. coriander seeds, crushed",
        "2 Tbs. chopped fresh cilantro",
        "1 tsp. coarse salt",
        "1 tsp. freshly ground pepper",
        "1 Tbs. Dijon mustard",
        "2 Tbs. olive oil",
        "1/3 cup fresh cilantro leaves, torn into pieces",
        "6 fresh mint leaves, finely slivered",
        "2 green onions, including tender green tops,  thinly sliced diagonally",
        "2 Tbs. fruity extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Seared Beef Tenderloin with Cilantro and Mint",
    "url": "http://www.williams-sonoma.com/recipe/seared-beef-tenderloin-with-cilantro-and-mint.html"
}
