{
    "directions": [
        "Juice each ingredient separately. Combine celery juice, sorrel juice, leek juice, and vinegar in a small bowl; season with salt and more vinegar, if desired.",
        "Place potatoes in a medium saucepan and add water to cover; season with salt. Bring to a boil, reduce heat, and simmer until tender, 10–15 minutes; drain and return to saucepan. Toss potatoes with 1 tablespoon oil, then season with salt.",
        "Meanwhile, heat 1 tablespoon oil in a large skillet over medium-high heat. Season fish with salt and cook, skin side down, until very crisp, about 4 minutes. Turn fish and cook until just cooked through, about 2 minutes longer. Transfer to a plate.",
        "Heat remaining 1 tablespoon oil in same skillet and add scallions. Cook, turning occasionally, until scallions are charred in spots and are slightly softened, about 1 minute. Transfer to plate with fish.",
        "Divide fish, yogurt, and potatoes among shallow bowls. Spoon green sauce around and drizzle with oil. Top with scallions and chervil."
    ],
    "ingredients": [
        "1/3 cup fresh celery juice (from about 2 stalks)",
        "1/3 cup fresh sorrel or cilantro juice (from about 2 cups, lightly packed)",
        "2 teaspoons fresh leek juice (from about 1 dark-green leek top)",
        "1 tablespoon white wine vinegar or lemon juice",
        "Kosher salt",
        "1 pound peanut potatoes or baby potatoes (as small as possible)",
        "Kosher salt",
        "3 tablespoons olive oil, divided, plus more for drizzling",
        "4 4-ounce pieces skin-on hake or cod fillet",
        "4 scallions, trimmed",
        "1/2 cup plain Greek yogurt",
        "Chervil or other tender herb sprigs (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Potato",
        "Dinner",
        "Seafood",
        "Celery",
        "Leek",
        "Spring",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Seared Hake with Baby Potatoes and Green Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/seared-hake-with-baby-potatoes-and-green-sauce-51231680"
}
