{
    "directions": [
        "Halve tofu lengthwise, then cut crosswise into 1/2-inch-thick slices and pat dry well. Put 1 tablespoon soy sauce in a wide shallow dish, then add tofu, turning to coat, and let stand 10 minutes. Pat tofu dry.",
        "Heat oil in a 12-inch heavy skillet over high heat until hot but not smoking, then add tofu in 1 layer and cook, turning over once, until tofu is browned, about 6 minutes total. Transfer with a slotted spoon to a large plate, reserving oil in skillet.",
        "Add garlic, ginger, and red pepper flakes to skillet and sauté, stirring, until fragrant, about 30 seconds. Add beans, bell pepper, and salt and sauté, stirring, 1 minute.",
        "Stir in coconut milk and remaining tablespoon soy sauce and bring to a boil, then boil, uncovered, until beans are tender, about 6 minutes. Transfer vegetables using a slotted spoon to plate with tofu.",
        "Simmer sauce until thickened slightly and reduced to about 3/4 cup, about 2 minutes. Stir in lime juice and pour sauce over vegetables and tofu. Sprinkle with cashews."
    ],
    "ingredients": [
        "1 (14- to 16-oz) package firm tofu",
        "2 tablespoons soy sauce",
        "1/4 cup vegetable oil",
        "1 tablespoon finely chopped garlic",
        "1 tablespoon finely chopped peeled fresh ginger",
        "1/2 teaspoon dried hot red pepper flakes",
        "1 lb green beans, trimmed and cut into 2-inch-long pieces",
        "1 red bell pepper, cut into 1/4-inch-wide strips (2 inches long)",
        "1 teaspoon salt",
        "1 (14- to 15-oz) can unsweetened coconut milk (not low-fat)",
        "1 tablespoon fresh lime juice",
        "1/3 cup chopped salted roasted cashews",
        "Accompaniment: rice noodles or rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ginger",
        "Sauté",
        "Vegetarian",
        "Quick & Easy",
        "Cashew",
        "Tofu",
        "Green Bean",
        "Bell Pepper",
        "Gourmet"
    ],
    "title": "Seared Tofu with with Green Beans and Asian Coconut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/seared-tofu-with-with-green-beans-and-asian-coconut-sauce-232618"
}
