{
    "directions": [
        "Blanch Brussels sprouts in a 3- to 4-quart saucepan of boiling salted water , uncovered, 3 minutes, then drain.",
        "Cook bacon in a 10-inch heavy skillet over moderate heat, turning over occasionally, until crisp. Transfer bacon with a slotted spoon to a small bowl and reserve bacon fat in another small bowl.",
        "Add 1/4 cup broth and 1/4 cup water to skillet and bring to a simmer, scraping up any brown bits. Add butter, salt, sugar, a pinch of pepper, and Brussels sprouts and simmer, covered, 4 minutes. Remove lid and cook over moderately high heat, stirring occasionally, until all liquid is evaporated and Brussels sprouts are tender and golden brown, about 8 minutes more. Stir in bacon and remove from heat.",
        "While Brussels sprouts are browning, pat scallops dry and season with salt and pepper. Heat oil with 2 teaspoons bacon fat in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sear scallops, turning over once, until golden brown and just cooked through, 4 to 6 minutes total. Transfer to a platter as cooked and keep warm, loosely covered with foil.",
        "Pour off and discard any fat from skillet used to cook scallops. Add remaining 3/4 cup broth and simmer, stirring and scraping up any brown bits, 1 minute. Stir cornstarch into remaining 2 teaspoons water in a cup, then stir into sauce along with any scallop juices accumulated on platter. Simmer, stirring, 1 minute, then remove from heat and stir in lemon juice and salt and pepper to taste.",
        "Serve Brussels sprouts topped with scallops and sauce."
    ],
    "ingredients": [
        "10 ounces Brussels sprouts, trimmed and halved lengthwise",
        "3 bacon slices (3 ounces), cut crosswise into 1/2-inch pieces",
        "1 cup low-sodium chicken broth",
        "1/4 cup plus 2 teaspoons water",
        "1 1/2 tablespoons unsalted butter",
        "1/4 teaspoon salt",
        "Pinch of sugar",
        "12 large sea scallops (1 1/4 pounds), tough muscle removed from side of each if necessary",
        "2 teaspoons olive oil",
        "3/4 teaspoon cornstarch",
        "2 teaspoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Shellfish",
        "Vegetable",
        "Sauté",
        "Quick & Easy",
        "Bacon",
        "Scallop",
        "Fall",
        "Brussel Sprout",
        "Gourmet"
    ],
    "title": "Seared Scallops with Brussels Sprouts and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/seared-scallops-with-brussels-sprouts-and-bacon-108676"
}
