{
    "directions": [
        "Stir all ingredients in small saucepan over medium heat until heated through. Set aside. DO AHEAD: Can be made 1 day ahead. Cover and chill. Rewarm before continuing.",
        "Mix all ingredients in large bowl. DO AHEAD: Can be made 2 hours ahead. Cover and chill.",
        "Preheat broiler. Melt butter with oil in heavy large ovenproof skillet over medium-high heat. Stir in garlic. Sprinkle scallops with salt and pepper. Cook scallops until browned on 1 side, about 1 minute. Turn scallops over and cook 1 minute. Spoon 1 teaspoon glaze atop each scallop. Place scallops in broiler until glaze browns, about 1 minute.",
        "Divide salad among 4 plates. Top salad on each plate with 3 scallops. Drizzle remaining glaze over. Sprinkle with chives and serve.",
        "*Sold in the Asian foods section of many supermarkets and at Asian markets."
    ],
    "ingredients": [
        "1/2 cup orange blossom honey",
        "1/4 cup fresh orange juice",
        "4 teaspoons finely grated lemon peel",
        "2 teaspoons finely grated lime peel",
        "1 1/2 teaspoons hot chili sauce (such as sriracha)*",
        "2 cups finely chopped celery (about 4 large stalks)",
        "1 cup finely chopped red bell pepper (about 1 medium)",
        "1 cup finely chopped orange bell pepper (about 1 medium)",
        "1/4 cup apple cider vinegar",
        "3 tablespoons butter",
        "2 tablespoons extra-virgin olive oil",
        "2 garlic cloves, minced",
        "12 large sea scallops, side muscle removed",
        "Chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Seared Scallops with Spicy Honey-Citrus Glaze on Celery Salad",
    "url": "http://www.epicurious.com/recipes/food/views/seared-scallops-with-spicy-honey-citrus-glaze-on-celery-salad-239848"
}
