{
    "directions": [
        "Make coulis: Preheat oven to 400°F.",
        "Quarter onion. In a shallow baking pan toss onion, tomatillos (in husks), chiles, and garlic cloves with 2 tablespoons olive oil until coated. Roast vegetables in middle of oven until tender, about 25 minutes.",
        "Wearing rubber gloves, peel chiles. Cut off tops of chiles and remove seeds and ribs. Discard husks from tomatillos and peel garlic. In a blender purée roasted vegetables and all remaining coulis ingredients except water, adding just enough water, 1 tablespoon at a time, if necessary to facilitate blending. Season coulis with salt.",
        "With a paring knife make 3 slits in top of each salmon fillet and stuff each with a basil leaf. With a mortar and pestle or an electric coffee/spice grinder coarsely grind peppercorns. Brush salmon with extra-virgin olive oil and sprinkle with ground peppercorns and sea salt. In a large nonstick skillet heat olive oil over high heat until hot but not smoking and sear salmon fillets, turning occasionally, until browned on all sides and just cooked through, about 7 minutes total. Serve salmon with coulis."
    ],
    "ingredients": [
        "1 small red onion",
        "1/4 pound fresh tomatillos*",
        "1 fresh green Anaheim chile*",
        "1 fresh poblano chile*",
        "3 unpeeled garlic cloves",
        "2 tablespoons olive oil",
        "1 scant cup cilantro sprigs",
        "1 scant cup packed fresh spinach leaves",
        "1/4 cup extra-virgin olive oil",
        "1 tablespoon fresh lime juice",
        "about 1/4 cup water",
        "four 5-ounce pieces salmon fillet with skin",
        "12 fresh basil leaves",
        "1 teaspoon Sichuan peppercorns**",
        "1 tablespoon extra-virgin olive oil",
        "1 teaspoon coarse sea salt",
        "1 tablespoon olive oil",
        "*available at Latino markets, specialty foods shops, and some supermarkets",
        "**available at Asian markets and some specialty foods shops and supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Pepper",
        "Tomato",
        "Bake",
        "Basil",
        "Salmon",
        "Spinach",
        "Hot Pepper",
        "Healthy",
        "Tomatillo",
        "Gourmet"
    ],
    "title": "Seared Salmon with Tomatillo Coulis",
    "url": "http://www.epicurious.com/recipes/food/views/seared-salmon-with-tomatillo-coulis-15623"
}
