{
    "directions": [
        "Preheat oven to 400°F. Place potatoes in large saucepan and cover with cold water by 1 inch. Bring to boil; reduce heat to medium-high and boil until almost cooked through, about 12 minutes. Drain; cool. Cut potatoes in half.",
        "Melt butter with canola oil in heavy large skillet over high heat. Season salmon with salt and pepper. Place salmon in skillet, flat side up. Cook until brown, about 4 minutes. Turn salmon over and cook 2 minutes. Carefully arrange salmon, flat side down, in large baking dish. Scatter potatoes around salmon.",
        "Combine wine, shallots, and vinegar in heavy large saucepan. Boil until reduced to 1 cup, about 7 minutes. Add chicken broth, chopped tarragon, and mustard. Bring just to boil. Pour hot broth over salmon and potatoes in dish. Bake until salmon and potatoes are cooked through, about 20 minutes.",
        "About 5 minutes before fish is done cooking, heat olive oil in heavy large pot. Add half of spinach to pot and stir until wilted, about 3 minutes. Add remaining spinach and toss just until wilted.",
        "Divide spinach among 4 shallow bowls. Top each with 1 salmon fillet. Divide potatoes and broth among bowls; garnish with tarragon sprigs and serve."
    ],
    "ingredients": [
        "1 1/2 pounds baby potatoes or new red potatoes, unpeeled",
        "2 tablespoons butter",
        "2 tablespoons canola oil",
        "4 6- to 8-ounce skinless wild salmon fillets",
        "2 cups dry white wine",
        "2 large shallots, thinly sliced",
        "2 tablespoons apple cider vinegar",
        "1 1/2 cups low-salt chicken broth",
        "2 tablespoons chopped fresh tarragon leaves plus sprigs for garnish",
        "1 tablespoon Dijon mustard",
        "2 tablespoons olive oil",
        "1 1/2 pounds baby spinach leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Potato",
        "Roast",
        "Sauté",
        "Quick & Easy",
        "High Fiber",
        "Vinegar",
        "Salmon",
        "Spinach",
        "White Wine",
        "Spring",
        "Healthy",
        "Tarragon",
        "Potluck",
        "Shallot"
    ],
    "title": "Seared Wild Salmon with New Potatoes and Dijon Broth",
    "url": "http://www.epicurious.com/recipes/food/views/seared-wild-salmon-with-new-potatoes-and-dijon-broth-234420"
}
