{
    "directions": [
        "Place scallops on a paper towel-lined plate and pat very dry with additional paper towels. Season both sides with 1/4 tsp. salt and 1/4 tsp. pepper total.",
        "Bring 1 cup water to a boil, covered, in a small pot. Add peas and 1/2 tsp. salt; cook until peas are bright green and tender, about 2 minutes for fresh and 4 minutes for frozen. Drain peas through a strainer set over a bowl; reserve cooking liquid.",
        "Meanwhile, add bacon to a large skillet and heat over medium-high. Cook bacon, stirring occasionally, until fat starts to render, about 3 minutes. Add shallot and cook, stirring, until softened and lightly browned and bacon is crisp, about 3 minutes more. Using a slotted spoon, transfer bacon and shallot to a small bowl, reserving fat in skillet. Add 1/2 cup cooked peas to bacon mixture.",
        "Purée lemon juice, 1/8 tsp. salt, 1/8 tsp. pepper, the remaining 1 1/2 cups peas, and 1/2 cup reserved pea cooking liquid in a blender. Add oil and pureé until smooth. Add 2 Tbsp. mint leaves and pureé until just combined but pieces of mint are still visible. Divide pea purée among 4 plates.",
        "Heat skillet with reserved fat over high until just barely smoking. Working in batches and adding more oil if necessary, sear scallops until a golden brown crust has formed and scallop releases from skillet, about 3 minutes per side. Top pea purée with scallops and bacon-pea mixture, then sprinkle with remaining 1 Tbsp. mint."
    ],
    "ingredients": [
        "12 large sea scallops (preferably dry-packed), side muscle removed (about 1 1/2 pounds)",
        "Kosher salt and freshly ground black pepper",
        "2 cups shelled fresh peas (from about 1 1/2 pounds pods) or frozen peas",
        "3 ounces bacon (about 3 slices), cut crosswise into 1/3–inch strips",
        "1 medium shallot, cut crosswise into thin rings",
        "1 1/2 teaspoons fresh lemon juice",
        "1 tablespoon (or more) olive oil",
        "3 tablespoons mint leaves, coarsely chopped, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "22-Minute Meals",
        "Dinner",
        "Scallop",
        "Seafood",
        "Shellfish",
        "Bacon",
        "Pea",
        "Summer",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Seared Scallops With Mint, Peas, and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/seared-scallops-with-mint-peas-and-bacon"
}
