{
    "directions": [
        "Sweet potatoes and nuts Preheat oven to 400°. Mix garlic and 3 tablespoons oil in a small bowl. Prick sweet potatoes all over with a fork and rub with half of garlic oil; set remaining garlic oil aside. Season with salt and roast on a rimmed baking sheet, turning once, until flesh is soft and yielding, 45-55 minutes. Remove from oven; reduce heat to 350°.",
        "Toss pecans and remaining 1/2 teaspoon oil on a rimmed baking sheet; season with salt. Toast, tossing once, until slightly darkened and fragrant, 8-10 minutes.",
        "Let sweet potatoes cool slightly, then cut in half lengthwise. Brush cut sides with reserved garlic oil. Heat a large heavy skillet over medium. Cook sweet potatoes, cut side down, pressing lightly with a spatula, until browned and charred in spots, about 5 minutes. Transfer to a plate and reserve skillet.",
        "Place radicchio in a large bowl. Heat 2 tablespoons oil in reserved skillet over medium-high. Cook sausage, breaking up with a spoon, until browned and cooked through, about 5 minutes. Stir in Aleppo pepper. Transfer meat to a plate with a slotted spoon and pour off all but 2 tablespoons fat from skillet.",
        "Reduce heat to medium. Combine pomegranate molasses, vinegar, and 1/4 cup water in skillet, stirring to combine and scraping pan to loosen browned bits. Bring to a simmer and cook, stirring often, until sauce is slightly thickened, about 3 minutes, then drizzle over radicchio. Add reserved sausage and toss to coat; season with salt.",
        "Mix yogurt and remaining 1 teaspoon oil in a small bowl, thinning with a little water to make pourable; season with salt. Divide yogurt among plates and top with sweet potatoes. Arrange sausage mixture over, along with any pan juices. Top with pecans and mint."
    ],
    "ingredients": [
        "1 garlic clove, finely grated",
        "3 tablespoons plus 1/2 teaspoon olive oil",
        "2 large or 4 small sweet potatoes, preferably garnet, scrubbed",
        "Kosher salt",
        "1/4 cup pecans, chopped",
        "1 head Treviso radicchio, leaves separated and torn into pieces",
        "2 tablespoons plus 1 teaspoon olive oil",
        "8 ounces merguez sausage, casings removed",
        "1/2 teaspoon Aleppo pepper or 1/8 teaspoon crushed red pepper flakes",
        "2 tablespoons pomegranate molasses",
        "1 teaspoon Sherry vinegar or red wine vinegar",
        "Kosher salt",
        "1/3 cup plain sheep's-milk or Greek yogurt",
        "1/4 cup fresh mint leaves",
        "Pomegranate molasses is available at Middle Eastern markets and some supermarkets or online."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Sausage",
        "Sweet Potato/Yam"
    ],
    "title": "Seared Sweet Potatoes with Sausage and Radicchio",
    "url": "http://www.epicurious.com/recipes/food/views/seared-sweet-potatoes-with-sausage-and-radicchio-51260650"
}
