{
    "directions": [
        "With the point of a knife, score the skin side of the breasts in crosshatch pattern, being careful not to pierce the flesh of the meat. Season the duck breasts with salt and pepper. Heat a sauté pan over medium heat for 1 minute before adding the breasts, skin side down. Cook skin side down over medium to low heat, for approximately 10 to 12 minutes to render the fat from the skin before turning the breasts over. When the duck has rendered its fat and the skin has taken on a crisp exterior quality turn the breasts over and sauté the flesh side for 3 to 4 minutes. Carefully remove the duck from the pan, place on a platter to keep warm and pour the excess fat safely into a heat proof container. (The reserved duck fat may be chilled and used for another cooking use.)",
        "While the duck is cooking (or even before you cook the duck), remove the chili pepper from the water in which it had soaked and reserve the liquid. Place the chili into a blender and begin to pureé, adding as much of the reserved liquid as necessary to create a smooth and thin paste-like texture. This chili paste may be refrigerated for a day covered with plastic wrap or pour a tablespoon of olive oil on its surface and keep refrigerated for up to 1 week.",
        "After removing the duck breasts from the pan add the onion to still hot pan and return to the heat. Add a tablespoon or two of reserved duck fat. Sauté the onion briefly before adding the ginger and 2 tablespoons of the chili paste. Add the honey and port to the ginger chili, stir to combine and cook for one minute.",
        "The breasts have rested for several minutes and should now be medium rare. They can be sliced lengthwise or cross-wise and several slices placed on each plate. Drizzle the warm glaze over the duck or for more impact, brush some on the duck breasts before slicing, run the duck under a hot broiler for 1 minute, caramelize the glaze and then slice and drizzle. If you desire, drizzle some around the duck breasts on the serving dish."
    ],
    "ingredients": [
        "2 whole magret duck breasts, approximately 1 pound each, available from specialty meat markets",
        "Salt and freshly ground pepper to taste",
        "1 small dried ancho chili pepper soaked in 1 cup boiling water for 30 minutes",
        "1 small white onion, finely chopped",
        "1 tablespoon grated ginger",
        "2 tablespoons warm honey dissolved in 1/2 cup port wine",
        "2 scallions, chopped, about 1/2 cup",
        "(optional serving suggestion: serve with mashed sweet potatoes or roasted carrot pureé)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Ginger",
        "Poultry",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Hot Pepper",
        "Honey",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Seared Duck Breast with Chili, Honey & Ginger Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/seared-duck-breast-with-chili-honey-ginger-glaze-102303"
}
