{
    "directions": [
        "In a pot of boiling salted water set over high heat, cook the haricots verts for 3 to 4 minutes, until tender. Drain and place them in the center of a large, warm serving platter. Cover and keep warm.",
        "Season the halibut on both sides with salt and pepper. In a 12-inch saute pan, heat the oil over medium-high heat. Cook the fish for about 3 minutes, until lightly browned. Turn, reduce the heat to medium, and cook about 4 minutes longer, until the fish is opaque in the center and browned on both sides. Put the fish on the platter with the beans and cover to keep warm.",
        "Pour off any oil in the pan and add the wine and lemon juice. Raise the heat to high and deglaze the pan by scraping up any browned bits with a wooden spoon. Cook until the sauce reduces by half, about 2 minutes. Reduce the heat and stir in the butter, a piece at a time, to enrich and flavor the sauce. Add the scallions, capers, and tomato. Season with salt and pepper, and pour over the fish on the platter. Serve immediately."
    ],
    "ingredients": [
        "1 pound haricots verts or young green or wax beans",
        "Four 7-ounce halibut fillets, each approximately 1 inch thick",
        "Coarse salt and freshly ground white pepper to taste",
        "2 tablespoons canola oil",
        "1/4 cup Sauvignon Blanc or other dry white wine",
        "2 tablespoons fresh lemon juice, or to taste",
        "1/2 cup unsalted butter",
        "5 scallions, white part only, finely sliced on the bias",
        "1 tablespoon capers, drained and rinsed",
        "1 large, ripe tomato, peeled, seeded, and cut into 1/4-inch dice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Dinner",
        "Halibut",
        "Green Bean",
        "White Wine",
        "Pan-Fry",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Seared Halibut with Haricots Verts, Scallions, and White Wine Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/seared-halibut-with-haricots-verts-scallions-and-white-wine-sauce-104104"
}
