{
    "directions": [
        "Whisk 2/3 cup oil, 3 tablespoons vinegar, and shallot in small bowl to blend. Season vinaigrette to taste with salt and pepper.",
        "Very thinly slice radicchio and endive; tear escarole and frisée into 2-inch lengths. Place in large bowl. (Vinaigrette and slaw can be made 6 hours ahead. Chill dressing; let stand at room temperature 30 minutes before using. Place damp kitchen towel over slaw and chill.)",
        "Heat 2 tablespoons oil in large nonstick skillet over medium-high heat. Sprinkle scallops with salt and pepper. Working in batches, add scallops to skillet and cook until golden and just opaque in center, about 1 1/2 minutes per side.",
        "Rewhisk vinaigrette; pour over slaw and toss to coat. Divide slaw among 8 plates. Arrange 3 scallops atop slaw on each plate. Add remaining 3 tablespoons vinegar to same skillet along with 3 tablespoons water. Bring to boil over medium heat, scraping up any browned bits and dissolving any caramelized juices. Drizzle juices over scallops.",
        "*Banyuls vinegar is a rich, oak-aged vingear (made from the naturally sweet wine of the same name) from the south of France. It can be found at specialty foods stores and online at chefshop.com."
    ],
    "ingredients": [
        "2/3 cup plus 2 tablespoons extra-virgin olive oil",
        "6 tablespoons Banyuls vinegar* or Sherry wine vinegar, divided",
        "1 shallot, thinly slivered",
        "12 ounces assorted red and green chicories (such as radicchio, red and green Belgian endive, escarole hearts, and frisée)",
        "24 large sea scallops",
        "3 tablespoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Shellfish",
        "Sauté",
        "Quick & Easy",
        "Scallop"
    ],
    "title": "Seared Sea Scallops with Banyuls Vinegar and Chicory Slaw",
    "url": "http://www.epicurious.com/recipes/food/views/seared-sea-scallops-with-banyuls-vinegar-and-chicory-slaw-231574"
}
