{
    "directions": [
        "Combine Beaujolais, chopped shallots, balsamic vinegar, crushed peppercorns, and crushed coriander seeds in medium saucepan. Boil until reduced to 1 1/2 cups, about 12 minutes. Add orange juice and boil 5 minutes. Add chicken broth and boil until reduced to 3 cups, about 15 minutes. Strain. Do ahead Sauce can be made 2 days ahead. Cover and chill.",
        "Preheat oven to 250°F. Using sharp knife, score skin of duck breasts diagonally to create 3/4-inch-wide diamond pattern. Sprinkle duck with salt and pepper. Heat 1 large and 1 medium skillet over medium-high heat. Place 2 duck breasts, skin side down, in large skillet and remaining duck breast in medium skillet. Cook until skin is brown and crisp, about 8 minutes. Turn; cook until brown and thermometer inserted into center registers 130°F for medium-rare, about 6 minutes. Transfer to rimmed baking sheet and place in oven to keep warm.",
        "Drain kumquats , reserving syrup. Pour off fat from skillets, reserving 2 tablespoons fat in large skillet for sauce. Heat large skillet with fat over medium-high heat. Add reserved sauce and 4 1/2 tablespoons reserved kumquat syrup. Boil until sauce is thickened and reduced to 3/4 cup, about 5 minutes.",
        "Slice duck breasts crosswise into 1/2-inch-thick slices. Divide duck breast slices among 6 plates. Drizzle duck with red wine sauce, garnish with candied kumquats, sprinkle with crushed peppercorns, and serve."
    ],
    "ingredients": [
        "2 1/4 cups fruity red wine, such as Beaujolais",
        "3/4 cup chopped shallots (about 3 large)",
        "4 1/2 tablespoons balsamic vinegar",
        "22 whole black peppercorns, crushed",
        "12 coriander seeds, crushed",
        "1 cup plus 2 tablespoons fresh orange juice",
        "3 cups low-salt chicken broth",
        "3 (1-pound) Muscovy duck breast halves with skin",
        "Candied kumquats",
        "Additional crushed whole black peppercorns"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Duck",
        "Onion",
        "Sauté",
        "Vinegar",
        "Spice",
        "Red Wine",
        "Winter",
        "Kumquat",
        "Shallot"
    ],
    "title": "Seared Duck Breasts with Red-Wine Sauce and Candied Kumquats",
    "url": "http://www.epicurious.com/recipes/food/views/seared-duck-breasts-with-red-wine-sauce-and-candied-kumquats-236196"
}
