{
    "directions": [
        "Whisk olive oil, lime juice, orange juice, soy sauce, sesame oil, chives and ginger in small bowl to blend. Season with salt and pepper.",
        "Pour oil into heavy medium saucepan to depth of 1 inch. Heat oil to 375°F. Working in batches, fry wonton strips until golden and crisp, about 1 minute. Using tongs, transfer wonton strips to paper towels; drain. Sprinkle with salt and pepper. (Dressing and wonton strips can be made 2 hours ahead. Let stand at room temperature.)",
        "Place tomatoes in small bowl. Add 2 tablespoons dressing and toss to coat. Cook carrots and peas in medium pot of boiling salted water until crisp-tender, about 30 seconds. Drain, rinse with cold water and pat dry. Place in medium bowl; toss with 2 tablespoons dressing.",
        "Stir sesame seeds in heavy large skillet over high heat until seeds are pale golden, about 2 minutes. Transfer seeds to large plate. Sprinkle fish with salt and pepper. Dip fish into seeds, coating on all sides and pressing fish so that seeds adhere. Return same skillet to high heat. Brush skillet with some of deep-frying oil. Add fish to skillet and sear until fish is just opaque in center and coating is deep brown on outside, about 3 minutes per side. Transfer fish to work surface.",
        "Mound lettuces on 4 plates. Thinly slice fish; arrange fish, slices overlapping, on lettuces. Surround lettuces with tomatoes, carrots and peas, dividing equally. Drizzle each salad with some dressing. Garnish with wonton strips. Serve, passing any remaining dressing separately."
    ],
    "ingredients": [
        "1/2 cup olive oil",
        "1/4 cup fresh lime juice",
        "1/4 cup orange juice",
        "2 tablespoons soy sauce",
        "2 tablespoons oriental sesame oil",
        "2 tablespoons minced fresh chives",
        "1 tablespoon minced fresh ginger",
        "Vegetable oil (for deep-frying)",
        "8 wonton wrappers, cut into thin strips",
        "12 large cherry tomatoes, cut in half",
        "2 medium carrots, peeled, cut on diagonal into thin slices",
        "16 sugar snap peas",
        "6 tablespoons sesame seeds",
        "4 5-ounce fresh tuna steaks (each about 3/4 to 1 inch thick)",
        "8 ounces mixed baby lettuces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Tomato",
        "Fry",
        "Sauté",
        "Tuna",
        "Carrot",
        "Chill",
        "Sesame",
        "Sugar Snap Pea",
        "Lettuce",
        "Boil"
    ],
    "title": "Seared Ahi Tuna Salad",
    "url": "http://www.epicurious.com/recipes/food/views/seared-ahi-tuna-salad-4266"
}
