{
    "directions": [
        "Blanch basil in a small saucepan of boiling water 15 seconds, then drain in a sieve and rinse under cold water to stop cooking.",
        "Drain basil and squeeze out excess liquid, then purée in a blender with olive oil, water, lemon juice, and 1/2 teaspoon each of salt and pepper until dressing is bright green and smooth, about 1 minute.",
        "Cut each body sac of calamari lengthwise along seam to open into a flat piece; rinse well. Pat calamari dry, then cut body sacs into 1-inch pieces and halve any large tentacles lengthwise.",
        "Toss beans, tomatoes, celery, and onion with 1/3 cup basil dressing, then gently toss with greens. Season with salt and lemon juice, then divide among 4 plates.",
        "Heat griddle over high heat until hot. Meanwhile, toss calamari with 1/4 teaspoon salt. Brush griddle with vegetable oil, then cook calamari in 1 layer, stirring occasionally with tongs, until browned in spots and just cooked through, 2 to 3 minutes. Divide calamari among salads; drizzle with some of remaining dressing."
    ],
    "ingredients": [
        "2 cups packed basil leaves",
        "1/2 cup olive oil",
        "2 tablespoons water",
        "2 tablespoons fresh lemon juice, or to taste",
        "1 pound cleaned calamari (squid)",
        "1 (15- to 16-ounce) can cannellini beans, rinsed and drained",
        "1/2 pound tomatoes, cut into 1-inch chunks",
        "1 celery rib, chopped",
        "1/2 small onion, finely chopped",
        "1 (3 1/2 - to 5-ounce) package baby greens such as arugula or mâche",
        "1 tablespoon vegetable oil",
        "a large (2-burner) griddle (preferably cast-iron)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Leafy Green",
        "Onion",
        "Quick & Easy",
        "Basil",
        "Squid",
        "Healthy",
        "Party",
        "Gourmet"
    ],
    "title": "Seared Calamari with Basil",
    "url": "http://www.epicurious.com/recipes/food/views/seared-calamari-with-basil-357998"
}
