{
    "directions": [
        "Heat 1/2 tablespoon olive oil in large nonstick skillet over medium-high heat. Add shallot; stir 30 seconds. Add Calvados (brandy may ignite); boil 30 seconds. Add cream; boil 2 minutes. Transfer sauce base to bowl. (Sauce base can be made 2 hours ahead. Let stand at room temperature.)",
        "Preheat oven to 300°F. Sprinkle scallops with salt and pepper. Heat vegetable oil in another large nonstick skillet over high heat. Add 8 scallops.",
        "Cook until brown, about 2 minutes per side. Transfer to rimmed baking sheet; place in oven to keep warm. Repeat with remaining scallops. Add apple juice and thyme to hot skillet. Boil 1 minute, scraping up brown bits. Add sauce base; bring to boil. Remove from heat.",
        "Heat remaining 1 tablespoon olive oil in large saucepan over medium-high heat. Add garlic and stir 30 seconds. Add spinach; toss until barely wilted and still bright green, about 2 minutes. Sprinkle with salt and pepper. Using tongs, mound spinach in center of 8 plates, dividing equally.",
        "Arrange 2 scallops on spinach on each plate. Pour any collected juices from baking sheet into sauce in skillet. Boil until thickened, about 2 minutes. Season with salt and pepper; spoon over scallops."
    ],
    "ingredients": [
        "1 1/2 tablespoons extra-virgin olive oil, divided",
        "1 large shallot, minced",
        "1/3 cup Calvados",
        "1 cup heavy whipping cream",
        "16 large sea scallops, patted dry",
        "1/2 tablespoon vegetable oil",
        "1/2 cup fresh unfiltered apple juice",
        "1 teaspoon chopped fresh thyme",
        "1 large garlic clove, minced",
        "1 9-ounce bag spinach leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Milk/Cream",
        "Appetizer",
        "Bake",
        "Sauté",
        "Scallop",
        "Spinach",
        "Calvados",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Seared Scallops on Spinach with Apple-Brandy Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/seared-scallops-on-spinach-with-apple-brandy-cream-sauce-233377"
}
