{
    "directions": [
        "Stir corn kernels, chicken broth, 2 tablespoons butter, cayenne pepper, and salt together in a saucepan; bring to a simmer, reduce heat to medium-low, and cook until corn is tender, about 5 minutes.",
        "Pour corn mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth. Pour pureed corn mixture through a fine-mesh strainer into a saucepan. Season with salt to taste.",
        "Toss scallops, Fresno pepper, canola oil, kosher salt, and smoked paprika in a bowl until scallops are completely coated. Separate pepper slices from scallops.",
        "Heat a large heavy skillet over high heat until very hot, about 5 minutes. Cook scallops in hot skillet until browned on one side, about 3 minutes. Turn and cook on the other side until cooked through, about 3 minutes more. Cook and stir sliced peppers on the side of the skillet while the scallops are cooking.",
        "Remove skillet from heat; transfer scallops to a plate, leaving peppers in hot skillet. Stir water and 1 tablespoon butter into peppers until butter melts. Drizzle lemon juice over peppers; stir to glaze peppers completely.",
        "Divide corn cream between four bowls. Place 3 scallops over corn puree and top with glazed peppers. Garnish with radish sprouts."
    ],
    "ingredients": [
        "Corn Cream:",
        "2 ears  fresh white corn, kernels cut from cob",
        "1 cup chicken broth",
        "2 tablespoons butter",
        "salt to taste",
        "1 pinch cayenne pepper",
        "Scallops:",
        "12 large sea scallops, rinsed and patted dry",
        "1 red Fresno pepper, thinly sliced",
        "2 teaspoons canola oil",
        "1 teaspoon kosher salt",
        "1/2 teaspoon smoked paprika, or to taste",
        "1 splash water",
        "1 tablespoon butter, or more to taste",
        "1/2 lemon, juiced",
        "1/4 cup radish sprouts, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Seared Scallops with Corn Cream",
    "url": "http://allrecipes.com/recipe/239052/seared-scallops-with-corn-cream/"
}
