{
    "directions": [
        "Cut brioche into 3/4-inch-thick slices, then into 60 (1 1/2-inch) cubes. Heat 1 tablespoon butter with 2 tablespoons oil in a 12-inch nonstick skillet over moderate heat until foam subsides. Cook brioche cubes, 12 at a time, until golden brown on top and bottom, about 3 minutes total. Transfer brioche as cooked to a rack to cool and sprinkle with salt to taste. Between batches, carefully wipe skillet clean with paper towels and add more butter and oil.",
        "Stir pepper and juice into jam. Chill jam, covered, until ready to use.",
        "Preheat oven to 400°F.",
        "Cut foie gras into 1- by 1/2-inch pieces and season with salt and pepper. Heat 1 tablespoon oil in a 12-inch nonstick skillet over moderately high heat until hot but not smoking. Reduce heat to moderate and cook foie gras, about 20 pieces at a time, until golden brown on both sides, about 1 1/2 minutes total. Transfer foie gras as cooked to a shallow baking pan with a spatula and arrange in 1 layer. Between batches, carefully wipe skillet clean.",
        "Reheat foie gras as needed in middle of oven 2 minutes, or until just hot, before assembling hors d'oeuvres. Just before serving, top toasts with lingonberry jam, then foie gras."
    ],
    "ingredients": [
        "3 large brioche or challah loaves, crusts removed",
        "5 tablespoons unsalted butter",
        "3/4 cup plus 3 tablespoons olive oil",
        "2 teaspoons freshly ground black pepper, or to taste",
        "2 teaspoons fresh lemon juice",
        "1 1/2 cups lingonberry jam or spread",
        "1 pound fresh foie gras or cleaned chicken livers (see Cooks' notes)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Poultry",
        "Appetizer",
        "Bake",
        "Sauté",
        "Winter",
        "Lingonberry",
        "Gourmet"
    ],
    "title": "Seared Foie Gras and Lingonberry Jam on Brioche Toast",
    "url": "http://www.epicurious.com/recipes/food/views/seared-foie-gras-and-lingonberry-jam-on-brioche-toast-102725"
}
