{
    "directions": [
        "Heat 1 teaspoon olive oil in a skillet over medium heat. Stir in the shallot and 1 pinch of salt; cook and stir until the shallot has softened, about 5 minutes. Stir shallot, pineapple, ginger, lemon grass, cilantro, honey, vinegar, sesame seeds, red pepper flakes, extra virgin olive oil, and salt to taste, together in a bowl. Set aside.",
        "Place a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Add the green beans, recover, and steam until just tender, 2 to 6 minutes depending on thickness. Immediately immerse in ice water for several minutes until cold to stop the cooking process. Once the green beans are cold, drain well, and set aside.",
        "Heat the safflower oil in a large skillet over high heat. Thoroughly dry each scallop. Once light wisps of smoke are visible in the safflower oil, carefully place the scallops in the skillet. Sear the scallops until golden brown without moving them, about 1 minute. Flip the scallop and cook until desired doneness, about 90 seconds. Turn of the heat and remove scallops from the skillet. Toss green beans into the still-hot skillet for 1 minute. Serve scallops over green beans and top with pineapple salsa."
    ],
    "ingredients": [
        "1 shallot, sliced crosswise",
        "1 teaspoon olive oil",
        "1 pinch salt",
        "1/4 cup finely chopped pineapple",
        "1 tablespoon freshly grated ginger",
        "1 tablespoon lemon grass, finely chopped",
        "1 teaspoon cilantro, finely chopped",
        "1 teaspoon honey",
        "1 teaspoon apple cider vinegar",
        "1/2 teaspoon sesame seeds",
        "1/8 teaspoon red pepper flakes",
        "4 teaspoons extra-virgin olive oil",
        "salt, to taste",
        "1/2 pound French style green beans, trimmed",
        "2 tablespoons safflower oil",
        "4 large sea scallops"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Seared Scallops with Pineapple, Ginger and Lemon Grass Salsa",
    "url": "http://allrecipes.com/recipe/212758/seared-scallops-with-pineapple-ginge/"
}
