{
    "directions": [
        "Whisk first 3 ingredients in small bowl to blend and reserve.",
        "Melt 2 tablespoons butter in heavy large skillet over medium heat. Add shallot, 1 tablespoon ginger, 2 minced garlic cloves, and half of minced chile. Sauté until shallot is soft, about 2 minutes. Increase heat to medium-high and add 1 bag spinach. Stir until beginning to wilt. Add remaining spinach, 1 bag at a time, stirring between additions until just wilted. Season with coarse salt and pepper. Keep warm.",
        "Sprinkle scallops with coarse salt and pepper. Melt 1 tablespoon butter with peanut oil in heavy large nonstick skillet over medium-high heat. Cook scallops until brown on both sides and just opaque in center, about 2 minutes per side. Transfer scallops to plate; tent with foil.",
        "Add 1 tablespoon butter, spring onions, remaining 1 teaspoon minced ginger, 2 minced garlic cloves, and remaining half of minced chile to skillet. Sauté until onions begin to soften, 1 to 2 minutes. Add mirin and simmer until reduced to glaze, 1 to 2 minutes. Whisk in hoisin mixture. Reduce heat to medium-low. Whisk in 2 tablespoons butter. Season to taste with salt and pepper.",
        "Divide spinach among plates. Top with scallops, dividing equally. Spoon sauce over and serve.",
        "Available in the Asian foods section of some supermarkets and at Asian markets."
    ],
    "ingredients": [
        "1/4 cup hoisin sauce*",
        "2 tablespoons unseasoned rice vinegar",
        "1/4 teaspoon hot chili sesame oil*",
        "6 tablespoons (3/4 stick) butter, divided",
        "1/4 cup chopped shallot (about 1 large)",
        "1 tablespoon plus 1 teaspoon minced peeled fresh ginger",
        "4 garlic cloves, minced, divided",
        "1 serrano chile, seeded, minced, divided",
        "4 5-ounce bags baby spinach",
        "Coarse kosher salt",
        "2 pounds sea scallops, side muscles removed",
        "1 tablespoon peanut oil or vegetable oil",
        "3/4 cup finely chopped spring onions or green onions (white and pale green parts only)",
        "1/4 cup mirin (sweet Japanese rice wine)*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauté",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Scallop",
        "Spinach",
        "Spring",
        "Shallot",
        "Butter",
        "Green Onion/Scallion",
        "Pescatarian",
        "Tree Nut Free"
    ],
    "title": "Seared Sea Scallops on Sautéed Spinach with Hoisin Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/seared-sea-scallops-on-sauteed-spinach-with-hoisin-butter-sauce-352091"
}
