{
    "directions": [
        "Cut 2 tablespoons of the butter into pea-sized pieces, put it on a small plate, and stick it in the freezer. Heat a large skillet over medium-heat high for 3 or 4 minutes. Add the remaining 1 tablespoon butter and the olive oil and wait for the butter to melt.",
        "Pat the scallops dry with paper towels, add them to the pan and sprinkle with salt and pepper; work in batches if necessary to avoid crowding the skillet. Cook, turning once, until they are well browned on both sides but not quite cooked through, 2 minutes per side (less if the scallops are under 1 inch across; more if they’re over). Transfer the scallops to a plate.",
        "Stir in the garlic, lemon juice, and wine and scrape all the brown bits off the bottom of the skillet with a spatula. Lower the heat to medium and cook until the liquid in the skillet thickens, a minute or two, then whisk in the butter you chilled in the freezer, one bit at a time, to make a creamy sauce, adding another tablespoon or two of liquid if necessary.",
        "Return the scallops to the skillet and add the chives. Adjust the heat so the sauce bubbles gently and toss to coat the scallops with the sauce. To serve, transfer the scallops to a platter and spoon the sauce over all.",
        "Seared Scallops With Cherry Tomatoes and Basil: Skip the lemon juice. Cut 1 pint cherry tomatoes in half. Add the tomatoes with the garlic and wine and cook until they wrinkle a bit and release their juice, 2 or 3 minutes. Use chopped fresh basil leaves instead of chives.",
        "Releasing From The Pan: The scallops will offer no resistance when they’re ready to turn. Press down gently while the scallops cook to encourage full contact with the pan, then listen for a hiss: That’s moisture heating and evaporating.",
        "Getting A Good Sear: The idea is to brown the scallops well on both sides without overcooking them, so keep the heat as high as you can without creating too much smoke.",
        "Building Sauce With Butter: After you add the liquid and deglaze the pan, the addition of butter develops fantastic creaminess and richness.",
        "Finishing The Dish: As soon as the scallops are cooked through completely and coated with the sauce, remove the pan from the heat; they will continue to cook. Nick-and-peek into one if you need to check for doneness."
    ],
    "ingredients": [
        "3 tablespoons butter",
        "1 tablespoon olive oil",
        "1 1/2 pounds sea scallops",
        "Salt and freshly ground pepper",
        "1 tablespoon minced garlic",
        "Juice of 1 lemon",
        "1/2 cup dry white wine or water, or more as needed",
        "2 tablespoons chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Seafood",
        "Shellfish",
        "Scallop",
        "Butter",
        "Quick & Easy",
        "Dinner",
        "Chive",
        "White Wine"
    ],
    "title": "Seared Scallops With Pan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/seared-scallops-with-pan-sauce"
}
