{
    "directions": [
        "Bring a large pot of water to a boil over high heat. Season heavily with salt. Cook cabbage wedges until crisp-tender but not falling apart, about 5 minutes. Transfer to a paper towel-lined baking sheet. Pulse bread cubes in a food processor until coarse crumbs form; transfer to a medium bowl. Add mustard powder and stir to coat.",
        "Heat 3 tablespoons oil in a small skillet over medium heat. Add breadcrumbs; stir frequently until golden, 4-5 minutes. Season with salt and transfer to a paper towel-lined plate to cool.",
        "Whisk 3 tablespoons oil, Dijon mustard, vinegar, and 1 tablespoon water in a small bowl. Season mustard vinaigrette with salt and pepper.",
        "Heat 1 tablespoon oil in a large cast-iron or nonstick skillet over high heat until smoking. Working in 2 batches and adding remaining 1 tablespoon oil between batches, sear cabbage wedges until dark and crispy edges form on both cut sides, 3-4 minutes per side.",
        "Cook sausages in a large skillet over medium heat until browned and cooked through (time will vary depending on variety and whether fresh or fully cooked).",
        "Transfer cabbage to a platter; arrange sausages around. Scatter breadcrumbs and tarragon over. Serve mustard vinaigrette on the side."
    ],
    "ingredients": [
        "Kosher salt",
        "1 1 1/2-pound head savoy cabbage, cut into 8 wedges with some core attached",
        "1 cup 1\" crustless bread cubes",
        "1 teaspoon mustard powder (such as Colman's)",
        "8 tablespoons olive oil, divided",
        "1 tablespoon Dijon mustard",
        "1 tablespoon white wine vinegar",
        "Freshly ground black pepper",
        "2 pounds mixed sausages (such as sweet Italian, kielbasa, and smoked garlic)",
        "1 tablespoon chopped fresh tarragon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Quick & Easy",
        "Dinner",
        "Sausage",
        "Fall",
        "Winter",
        "Cabbage",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Seared Savoy Cabbage with Mixed Sausages",
    "url": "http://www.epicurious.com/recipes/food/views/seared-savoy-cabbage-with-mixed-sausages-51122440"
}
