{
    "directions": [
        "Preheat oven to 350°F. In a medium bowl, stir together the sugar, spices, and salt. Toast the walnuts lightly on a sheet pan in the oven, for about 4-5 minutes. While the nuts are toasting, heat the spiced sugar in a 10-inch skillet over medium heat. When the sugar just begins to melt around the edges, toss in the warm nuts, straight from the oven. Shake the pan vigorously over the burner until all the nuts are coated in sugar — it will cling in somewhat uneven patches, but that is the effect I like. Pour the nuts onto a plate or baking sheet to cool — don't be tempted to try one until they have really cooled down, since sugar at this temperature will give you a burned tongue to remember!",
        "Toss the salad greens with the spiced walnuts and the vinaigrette and top with a generous slice of ham and 1 ounce of cheese per person, according to the seasons (see Weighing Your Options).",
        "Spring: Grilled Asparagus with Serrano Ham and Maytag Blue Cheese (to grill asparagus, blanch the asparagus to halfway tender, brush with a little olive oil, season with salt and pepper, and grill until lightly brown)",
        "Summer: Fresh Black Mission Figs with Smithfield Ham and Aged Goat Cheese",
        "Fall: Lightly Roasted Seckel Pears with Pecorino Romano and Prosciutto",
        "Winter: Blood Oranges and Fennel with Feta and Prosciutto"
    ],
    "ingredients": [
        "2/3 cup sugar",
        "1 tablespoon ground star anise",
        "2 tablespoons ground coriander seed",
        "1/2 teaspoon cayenne",
        "Salt",
        "2 cups shelled walnut halves",
        "1 pound mixed lettuces, washed and dried",
        "1/4 cup Aged Sherry-Walnut Vinaigrette"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Appetizer",
        "Bake",
        "Quick & Easy",
        "Walnut",
        "Spring",
        "Anise",
        "Lettuce",
        "Coriander",
        "Kidney Friendly",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Seasonal Country Salad with Spiced Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/seasonal-country-salad-with-spiced-walnuts-234558"
}
