{
    "directions": [
        "Nectarine-Thyme Saladita\nPit and slice a perfectly ripe nectarine, then cut the slices in half. Toss in about a tablespoon of fresh thyme leaves, stripped from the stems with your fingers. Serve right away—plain, or with a cruet of extra-virgin olive oil and a wedge of lime.\nCantaloupe-Basil Saladita\nPeel and seed a small, ripe cantaloupe. Cut the flesh into 1/2-inch dice or even smaller and place it in a bowl. Shortly before serving, add about a dozen minced fresh basil leaves and serve soon thereafter.",
        "Apple-Parsley Saladita\nCore and chop a crisp apple or two and toss with a small splash of fresh lemon juice or cider vinegar. Throw in a handful of minced fresh flat-leaf parsley. Drizzle with a little extra-virgin olive oil.",
        "Pomegranate-Mint Saladita\nExtract the seeds from a large pomegranate and place them in a bowl. Shortly before serving, toss with about 25 minced fresh mint leaves and serve pronto. I highly recommend Pickled Red Onions as an accompaniment.",
        "Mango-Cilantro Saladita\nPeel, pit, and cut 2 fresh mangoes (or 2 cups frozen mango chunks) into 1/4-inch dice and splash with up to 2 tablespoons fresh lime juice. Just before serving, toss with a handful or two of cilantro, minced, and a sprinkling of crushed red pepper, if you like. Serve right away. It's great with Pickled Red Onions."
    ],
    "ingredients": [
        "1 ripe nectarine",
        "1 tablespoon fresh thyme leaves",
        "Extra-virgin olive oil",
        "Lime wedge",
        "1 small, ripe cantaloupe",
        "12 fresh basil leaves",
        "2 crisp apples",
        "Splash of fresh lemon juice or cider vinegar",
        "Handful of fresh flat-leaf parsley",
        "Extra-virgin olive oil",
        "Seeds from 1 large pomegranate",
        "25 fresh mint leaves",
        "2 fresh mangoes (or 2 cups frozen mango chunks)",
        "Fresh lime juice",
        "2 handfuls cilantro",
        "Crushed red pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Sauce",
        "Fruit",
        "Herb",
        "Side",
        "Vegetarian",
        "Vegan"
    ],
    "title": "Seasonal Fruit–Herb Saladitas",
    "url": "http://www.epicurious.com/recipes/food/views/seasonal-fruit-herb-saladitas-51196810"
}
