{
    "directions": [
        "Mix millet, quinoa, amaranth, 1 cup oats, 1 cup buttermilk, and 1/2 cup water in a small bowl. Cover and let sit 8–12 hours. (Alternatively, bring ingredients to a simmer in a small saucepan over low heat. Remove from heat and let sit until mixture is thick like porridge, about 2 hours.)",
        "Preheat oven to 350°F. Lightly oil an 8\"-diameter cast-iron skillet or cake pan. Whisk whole wheat flour, all-purpose flour, flaxseed, salt, baking soda, and 1/4 cup sunflower seeds in a large bowl. Work in butter with your fingers until largest pieces are pea-size. Make a well in the center and add brown rice syrup, oat mixture, remaining 1 1/4 cups buttermilk, and remaining 1 Tbsp. oil. Mix with a wooden spoon until dough is smooth, homogenous, and still slightly sticky.",
        "Form dough into a ball and place in prepared pan. Brush with buttermilk; top with more oats and sunflower seeds. Cut a large X into the top and bake until golden brown and an instant-read thermometer inserted into the center of loaf registers 190°F, 55–70 minutes. Let cool in pan.",
        "Bread can be baked 2 days ahead. Store tightly wrapped at room temperature."
    ],
    "ingredients": [
        "1/4 cup millet",
        "1/4 cup quinoa",
        "2 tablespoons amaranth",
        "1 cup old-fashioned oats, plus more for topping",
        "2 1/4 cups buttermilk, divided, plus more for brushing",
        "1 Tbsp. vegetable oil, plus more for pan",
        "3 cups whole wheat flour",
        "1 cup all-purpose flour",
        "2 tablespoons flaxseed",
        "1 tablespoon kosher salt",
        "2 teaspoons baking soda",
        "1/4 cup sunflower seeds, plus more for topping",
        "4 tablespoons unsalted butter, cut into pieces",
        "3 tablespoons brown rice syrup or mild-flavored (light) molasses"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Healthy",
        "Quinoa",
        "Whole Wheat",
        "Thanksgiving",
        "Kid-Friendly"
    ],
    "title": "Seeded Whole Grain Soda Bread",
    "url": "http://www.epicurious.com/recipes/food/views/seeded-whole-grain-soda-bread"
}
