{
    "directions": [
        "1. Cut the puckered ends off the polenta, then slice ½ inch thick. Cut each slice into 4 little wedges.",
        "2. Heat a wide nonstick skillet. Add a drop of the oil and spread it around with a paper towel to create a very light coat, or use cooking oil spray. Add the polenta wedges; cook in a single layer over medium heat until lightly browned, about 5 minutes on each side.",
        "3. Transfer the polenta to a plate. Heat the oil and soy sauce slowly in the same skillet. Before they get too hot, add the seitan and stir well. Raise the heat to medium-high and sauté, stirring frequently, for 5 minutes. Stir in the bok choy, spinach, and scallions, then cover and cook until just wilted, 1 to 2 minutes.",
        "4. Sprinkle in vinegar to taste. Gently fold in the polenta wedges and sun-dried tomatoes, if using, Season with salt and pepper and serve at once."
    ],
    "ingredients": [
        "One 18-ounce tube polenta",
        "1 1/2 tablespoons olive oil",
        "Cooking oil spray, optional",
        "1 tablespoon reduced-sodium soy sauce",
        "1 pound seitan, cut into bite-size pieces or strips",
        "4 large or 6 medium stalks bok choy, with leaves, sliced crosswise",
        "5 to 6 ounces baby spinach",
        "4 scallions, sliced",
        "1 tablespoon balsamic vinegar, or more to taste",
        "1/4 cup oil-packed sliced sun-dried tomatoes, optional",
        "Salt and freshly ground pepper to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soy",
        "Vegetarian",
        "Dinner",
        "Tofu",
        "Spinach",
        "Healthy",
        "Vegan",
        "Bok Choy",
        "Hominy/Cornmeal/Masa",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Seitan and Polenta Skillet with Fresh Greens",
    "url": "http://www.epicurious.com/recipes/food/views/seitan-and-polenta-skillet-with-fresh-greens-368469"
}
