{
    "directions": [
        "Preheat oven to 325°F. Butter three 8-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottoms with parchment paper round; butter parchment. Place chocolate in metal bowl set over saucepan of simmering water. Stir until melted and smooth.",
        "Whisk all purpose flour and next 4 ingredients in medium bowl. Using electric mixer, beat brown sugar, butter, and vanilla in large bowl to blend (mixture will be crumbly). Add eggs 1 at a time, beating well after each addition. Beat in warm melted chocolate. Mix in dry ingredients in 2 additions alternately with buttermilk in 1 addition. Divide batter among prepared pans.",
        "Bake cakes until tester inserted into center comes out clean, about 23 minutes. Cool cakes in pans 10 minutes. Turn cakes out onto rack; peel off parchment. Cool cakes completely. (Can be made 1 day ahead. Wrap cakes in plastic and store at room temperature.)",
        "Place 2 tablespoons cold water in small bowl. Sprinkle unflavored gelatin over; let stand 10 minutes to soften.",
        "Bring 1/2 cup cream to boil in heavy small saucepan. Add hot cream mixture to softened gelatin; stir until dissolved. Place in refrigerator just until cold, whisking frequently, about 5 minutes.",
        "Place remaining 1 cup chilled cream, powdered sugar, and vanilla extract in medium bowl. Using electric mixer, beat until peaks form. Add gelatin mixture and beat until peaks form.",
        "Place 1 cake on 8-inch cardboard round or tart pan bottom. Spread half of filling over. Top with second cake. Spread remaining filling over. Top with third cake. Chill on cardboard round 3 hours.",
        "Bring cream and corn syrup to simmer in heavy small saucepan. Remove from heat. Add chocolate; whisk until smooth. Cool.",
        "Place cake on rack set in large rimmed baking sheet. Spread half of ganache over top and sides of cake. Chill cake 1 hour. Rewarm remaining ganache in small saucepan over low heat just until lukewarm, whisking often. Pour ganache over cold cake, spreading as needed to cover top and sides. Chill until ganache is set, about 1 hour. (Can be made 1 day ahead. Keep chilled.)",
        "Cut out paper heart shapes of differing sizes and arrange atop cake. Sift powdered sugar over. Carefully lift hearts from cake. Serve immediately."
    ],
    "ingredients": [
        "6 ounces semisweet chocolate, chopped",
        "3/4 cup all purpose flour",
        "3/4 cup cake flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon coarse kosher salt",
        "1 3/4 cups (packed) dark brown sugar",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "1 teaspoon vanilla extract",
        "2 large eggs",
        "3/4 cup buttermilk",
        "1 teaspoon unflavored gelatin",
        "1 1/2 cups chilled whipping cream, divided",
        "1/4 cup powdered sugar",
        "1/2 teaspoon vanilla extract",
        "1 cup heavy whipping cream",
        "2/3 cup light corn syrup",
        "18 ounces semisweet chocolate, chopped",
        "Additional powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Kid-Friendly",
        "Wedding",
        "Vanilla",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Semisweet Chocolate Layer Cake with Vanilla Cream Filling",
    "url": "http://www.epicurious.com/recipes/food/views/semisweet-chocolate-layer-cake-with-vanilla-cream-filling-233943"
}
