{
    "directions": [
        "Preheat oven to 325°F. Sprinkle oxtails with salt and pepper, then flour. Heat oil in heavy wide ovenproof pot over high heat. Add oxtails; cook until brown on all sides, about 15 minutes. Transfer to bowl. Add celery, carrots, and onion to pot. Reduce heat to medium-high and sauté until vegetables brown, about 15 minutes. Add wine and tomatoes. Boil until thickened to chunky sauce, about 5 minutes. Sprinkle in garlic. Tie parsley, rosemary, and bay leaves with kitchen string and add to pot. Return oxtails to pot in single layer. Add all broth; bring to boil. Cover pot; place in oven.",
        "Braise oxtails until very tender, about 2 hours. Transfer oxtails to rimmed baking sheet. Using potato masher, crush juices and vegetables in pot to coarse sauce. Pull meat off oxtails and add to sauce. Season ragù with salt and pepper. DO AHEAD: Can be made 2 days ahead. Cool, cover, and chill. Rewarm before continuing.",
        "Butter 13x9x2-inch glass baking dish. Bring milk, butter, and salt to simmer in heavy large pot over medium-high heat. Gradually whisk in semolina. Stir until semolina is very thick and bubbling, about 3 minutes. Remove from heat; mix in yolks, 1 at a time, then 1 cup Parmesan. Place pot over low heat and stir 2 minutes. Spread semolina in prepared dish. Cover and chill until firm, at least 2 hours and up to 2 days. Preheat oven to 475°F. Butter 15x10x2- inch glass baking dish. Using 1 3/4-inch round cutter, cut out as many semolina gnocchi as possible; arrange in prepared dish. Top with warm ragù sprinkle with remaining 1/2 cup Parmesan. Bake until heated through, 10 to 15 minutes. Sprinkle with parsley."
    ],
    "ingredients": [
        "5 pounds 2- to 3-inch pieces oxtails",
        "All purpose flour",
        "1/2 cup olive oil",
        "5 large celery stalks, coarsely chopped",
        "2 large carrots, peeled, chopped",
        "1 large onion, very coarsely chopped",
        "2 cups dry red wine",
        "1 1/4 cups canned crushed tomatoes with added puree",
        "4 garlic cloves, chopped",
        "6 fresh Italian parsley sprigs",
        "2 large fresh rosemary sprigs",
        "3 Turkish bay leaves",
        "2 cups beef broth",
        "1 cup low-salt chicken broth",
        "3 cups whole milk",
        "1/2 cup (1 stick) unsalted butter, diced",
        "1 1/2 teaspoons salt",
        "1 cup semolina flour (pasta flour)*",
        "4 large egg yolks",
        "1 1/2 cups grated Parmesan cheese, divided",
        "Chopped fresh Italian parsley",
        "Available at some supermarkets and at specialty foods stores and Italian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pasta",
        "Tomato",
        "Stew",
        "Parmesan",
        "Red Wine",
        "Winter"
    ],
    "title": "Semolina Gnocchi with Oxtail Ragù",
    "url": "http://www.epicurious.com/recipes/food/views/semolina-gnocchi-with-oxtail-ragu-243396"
}
