{
    "directions": [
        "In the bowl of an electric mixer fitted with the paddle attachment proof the yeast with the sugar in the water for 5 minutes, or until the mixture is foamy, add the flour, the table salt, and the sun-dried tomatoes with 1 tablespoon of the reserved tomato oil, and combine the dough well. With the dough hook knead the dough for 2 minutes, or until it is soft and slightly sticky. Form the dough into a ball, transfer it to an oiled bowl, and turn it to coat it with the oil. Let the dough rise, covered with plastic wrap, in a warm place for 1 1/2 hours, or until it is double in bulk. The dough may be made up to this point, punched down, and kept, covered and chilled, overnight. Let the dough return to room temperature before proceeding with the recipe. Press the dough evenly into an oiled jell-roll pan, 15 1/2 by 10 1/2 by 1 inches, and let it rise, covered loosely, in a warm place for 1 hour, or until it is almost double in bulk.",
        "While the dough is rising, in a saucepan cook the garlic in the olive oil over moderately low heat for 20 minutes, transfer it with a slotted spoon to a cutting surface, discarding the oil, and chop it fine. In a bowl stir together the garlic, the bell peppers, the remaining 3 tablespoons reserved tomato oil, and pepper to taste, sprinkle the mixture evenly over the dough, and sprinkle it with the coarse salt. Bake the focaccia in the bottom third of a preheated 400°F. oven for 30 to 35 minutes, or until it is golden brown, sprinkle it with the red pepper flakes, and let it cool in the pan on a rack. Serve the focaccia warm or at room temperature."
    ],
    "ingredients": [
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "1/2 teaspoon sugar",
        "1 cup lukewarm water",
        "3 1/2 cups semolina flour (durum wheat flour, available at specialty  foods shops)",
        "1 teaspoon table salt",
        "a 4-ounce jar sun-dried tomatoes packed in oil, drained, reserving  1/4 cup of the oil, and the tomatoes chopped",
        "4 garlic cloves",
        "1/4 cup olive oil",
        "3 large red bell peppers, sliced thin",
        "1 teaspoon coarse salt, or to taste",
        "dried hot red pepper flakes for sprinkling the focaccia if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Garlic",
        "Pepper",
        "Tomato",
        "Bake",
        "Winter",
        "Gourmet"
    ],
    "title": "Semolina Focaccia with Bell Peppers, Sun-Dried Tomatoes, and Garlic Confit",
    "url": "http://www.epicurious.com/recipes/food/views/semolina-focaccia-with-bell-peppers-sun-dried-tomatoes-and-garlic-confit-13552"
}
