{
    "directions": [
        "Bring bay leaves, sugar, salt, and 1/2 cup water to a simmer in a small saucepan, stirring occasionally to dissolve sugar, about 5 minutes. Remove from heat and stir in lemon juice. Pluck out bay leaves; let cool.",
        "Preheat oven to 350°F. Butter a 9\"-diameter cake pan. Whisk semolina, sugar, baking powder, orange zest, cardamom, and salt in a medium bowl. Whisk yogurt and milk in a large bowl. Mix in dry ingredients, then 3/4 cup butter. Scrape batter into prepared pan. Bake cake until golden brown and firm, 55–65 minutes. Transfer to a wire rack and let cake cool in pan 10 minutes. Turn a plate over top of pan and invert cake. Using a cake tester or toothpick, poke holes all over cake; gradually pour all but 1/4 cup bay leaf syrup over, letting it soak in. Let sit 30 minutes.",
        "Meanwhile, remove peel and white pith from oranges. Slice into 1/4\"-thick rounds; remove seeds. Combine in a medium bowl with remaining bay leaf syrup; let sit, tossing occasionally, at least 20 minutes. Taste and add lemon juice as needed.",
        "Serve cake with oranges in syrup.",
        "Cake can be baked 2 days ahead. Store tightly wrapped at room temperature."
    ],
    "ingredients": [
        "2 bay leaves",
        "1/3 cup sugar",
        "Pinch of kosher salt",
        "2 teaspoons fresh lemon juice",
        "3/4 cup (1 1/2 sticks) unsalted butter, melted, slightly cooled, plus more for pan",
        "1 1/2 cups coarse-grind semolina flour",
        "1 cup sugar",
        "2 teaspoons baking powder",
        "2 teaspoons finely grated orange zest",
        "1 teaspoon ground cardamom",
        "1/2 teaspoon kosher salt",
        "1 cup plain whole-milk Greek yogurt",
        "3/4 cup whole milk",
        "3 oranges",
        "Lemon juice (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Semolina",
        "Orange",
        "Cardamom",
        "Yogurt",
        "Winter"
    ],
    "title": "Semolina Cake With Oranges",
    "url": "http://www.epicurious.com/recipes/food/views/semolina-cake-with-oranges"
}
