{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Mix paprika, garlic powder, black pepper, sea salt, and cayenne pepper in a bowl until thoroughly combined. Set spice mixture aside.",
        "Heat olive oil in a large skillet over medium heat; cook and stir mushrooms and shallots until mushrooms have released their liquid, 5 to 8 minutes. Set mushroom mixture aside.",
        "Melt 1/4 cup margarine in a large skillet over medium-high heat and stir in 1/4 cup Worcestershire sauce. Rub beef brisket thoroughly with spice mixture; place brisket into the margarine and Worcestershire sauce.",
        "Brown the brisket well on all sides, about 5 minutes per side. As the Worcestershire sauce cooks into the brisket, pour in more, about 1/2 cup at a time, until 1 1/2 cup  Worcestershire sauce has been added.",
        "Place a rack into a heavy Dutch oven; place the brisket onto the rack. Pour in the Worcestershire sauce pan drippings, red wine, water, garlic, and beef broth. Top the brisket with the mushroom mixture. Drizzle 1 tablespoon Worcestershire sauce over the mushrooms and top with 2 tablespoons sliced unsalted margarine.",
        "Cover the Dutch oven and bake brisket in the preheated oven for 3 hours. Reduce heat to 300 degrees F (150 degrees C) and bake 1 more hour. Reduce oven temperature to 225 degrees F (105 degrees C) and bake 1 additional hour. Baste with pan drippings every hour.",
        "Let the brisket rest for about 20 minutes before slicing thinly across the grain. Serve with pan gravy."
    ],
    "ingredients": [
        "2 tablespoons paprika",
        "2 tablespoons garlic powder",
        "2 tablespoons ground black pepper",
        "2 tablespoons sea salt",
        "1 teaspoon cayenne pepper",
        "1/3 cup extra-virgin olive oil",
        "1 (16 ounce) package sliced fresh mushrooms",
        "3 shallots, chopped",
        "1/4 cup unsalted margarine",
        "1 1/2 cups Worcestershire sauce (such as Lea & Perrins®), divided",
        "1 (5 pound) beef brisket",
        "2 cups red wine",
        "1/2 cup water",
        "1 clove garlic, chopped",
        "1 (32 fluid ounce) container beef broth (such as Progresso®)",
        "1 tablespoon Worcestershire sauce (such as Lea & Perrins®)",
        "2 tablespoons unsalted margarine, thinly sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sensational Slow Cooked Beef Brisket",
    "url": "http://allrecipes.com/recipe/221043/sensational-slow-cooked-beef-brisket/"
}
