{
    "directions": [
        "Heat the oil in a large skillet over medium heat. Add the beef, and cook until browned. Add the mushrooms, bell pepper and onion; cook and stir until starting to become tender, about 5 minutes.",
        "In a slow cooker, combine the beef broth, salt, pepper, Worcestershire sauce, red pepper flakes and red wine. Transfer the beef and vegetables to the slow cooker, and stir to blend. Cover, and cook on High for 3 to 4 hours, until beef is extremely tender.",
        "Preheat the oven to 425 degrees F (220 degrees C). Drain the liquid from the slow cooker, and save for dipping. Slice the French bread loaf lengthwise like a submarine sandwich. Mix together the horseradish and mustard; spread onto the inside of the loaf. Place slices of provolone cheese on both sides of the loaf, then fill with the beef and vegetables. Close the loaf, and wrap the entire sandwich with aluminum foil.",
        "Bake for 10 to 15 minutes in the preheated oven. For crunchier bread, you can bake it without the aluminum foil. Slice into servings, and serve with the juices from the slow cooker for dipping."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 pound thinly sliced sirloin steak strips",
        "8 ounces sliced fresh mushrooms",
        "1 green bell pepper, seeded and cut into strips",
        "1 medium onion, sliced",
        "10 slices provolone cheese",
        "1 loaf French bread",
        "1 (14 ounce) can beef broth",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon garlic powder",
        "2 tablespoons Worcestershire sauce",
        "1/8 teaspoon red pepper flakes",
        "1/4 cup Pinot Noir or other dry red wine",
        "1/2 cup prepared horseradish (optional)",
        "1/2 cup brown mustard (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sensational Steak Sandwich",
    "url": "http://allrecipes.com/recipe/87111/sensational-steak-sandwich/"
}
