{
    "directions": [
        "Preheat the oven to 400°F. Soak the chiles in lukewarm water for 30 minutes. Seed them, remove the stems, chop the flesh into tiny pieces, and set aside.",
        "Season the brisket with salt and pepper to taste and dredge with flour. Heat the oil in a heavy roasting pan just large enough to hold the brisket snugly and brown the brisket on both sides, 5 to 7 minutes per side. Remove from the pan.",
        "In the same pan, over medium heat, add the onions and ginger and sauté, stirring occasionally, until the onions are transparent. Add the reserved chiles and deglaze with the orange juice. Reduce the liquid by half. Add the brisket and enough stock or water to cover the meat. Add the cinnamon stick, bay leaf, and peppercorns. Place in the oven and cook, uncovered, until the brisket is tender, about 3 hours, turning at 30-minute intervals.",
        "Transfer the brisket to a platter. Remove the cinnamon stick and bay leaf from the liquid and pour it into a food processor or blender. Purée until smooth. If the sauce is too thin or not flavorful enough, reduce in a pan over medium heat. Cool the meat and the sauce separately, then cover and refrigerate for a few hours or overnight.",
        "When ready to serve, preheat the oven to 350°F. Bring 4 cups of water to a boil. In a large bowl, steep the tea bags in the water to make a strong tea. Discard the bags. Put the prunes and apricots in the tea to plump for about 30 minutes, then drain them. Meanwhile, slice the brisket against the grain and place the slices in a pan. Remove the congealed fat and pour the sauce over the brisket. Add the fruit to the sauce, cover the pan with aluminum foil, and heat the brisket in the oven until hot, about 45 minutes. Check the seasonings before serving."
    ],
    "ingredients": [
        "2 dried pasilla chiles",
        "1 (4-pound) beef brisket, trimmed",
        "Salt and freshly ground black pepper",
        "All-purpose flour, for dredging",
        "1/4 cup olive oil",
        "2 onions, diced",
        "2 tablespoons peeled and chopped fresh ginger",
        "1 cup freshly squeezed orange juice",
        "4 cups chicken or beef stock or water, more if necessary",
        "1 cinnamon stick",
        "1 bay leaf",
        "1 teaspoon peppercorns",
        "4 tea bags strong black tea",
        "2 cups dried pitted prunes",
        "2 cups dried apricots"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Fruit",
        "Roast",
        "Hanukkah",
        "Rosh Hashanah/Yom Kippur",
        "Dinner",
        "Dried Fruit",
        "Meat",
        "Brisket",
        "Chill",
        "Chile Pepper",
        "Advance Prep Required",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sephardic Brisket",
    "url": "http://www.epicurious.com/recipes/food/views/sephardic-brisket-369450"
}
