{
    "directions": [
        "1. In a large skillet, heat the olive oil over medium heat. Add the onion and, if using, the garlic and sauté until soft and translucent, about 5 minutes. Remove from the heat and add the spinach, matza meal, salt, pepper, and, if using, the nutmeg. Stir in the eggs. If the mixture is too loose, add a little more matza meal. The mixture can be stored in the refrigerator for a day.",
        "2. Shape the spinach mixture into patties 3 inches long and 1 1/2 inches wide, with tapered ends. In a large skillet, heat a thin layer of oil over medium heat. In batches, fry the patties, turning, until golden brown, about 3 minutes per side. Drain on paper towels. Serve warm, accompanied with lemon wedges.",
        "Add 1 cup (4 ounces) shredded Muenster, Swiss, Gouda, or Cheddar cheese; or 1/4 cup grated kefalotyri or Parmesan cheese.",
        "Substitute 1/2 to 1 cup finely chopped walnuts for the matza meal.",
        "Add 3/4 cup raisins soaked in white wine for 30 minutes, then drained, and 3/4 cup toasted pine nuts."
    ],
    "ingredients": [
        "3 tablespoons olive oil or vegetable oil",
        "1 large onion, chopped",
        "2 to 4 cloves garlic, minced (optional)",
        "2 pounds fresh spinach, stemmed, cooked, chopped, and squeezed dry, or 20 ounces thawed frozen chopped spinach, squeezed dry",
        "About 1 cup matza meal or fine dried bread crumbs",
        "About 3/4 teaspoon table salt or 1 1/2 teaspoons kosher salt",
        "Ground black pepper to taste",
        "1/2 teaspoon freshly grated nutmeg or 1/2 teaspoon cayenne (optional)",
        "3 large eggs, lightly beaten",
        "Vegetable oil for frying",
        "Lemon wedges for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Fry",
        "Hanukkah",
        "Rosh Hashanah/Yom Kippur",
        "Spinach",
        "Kosher",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sephardic Spinach Patties",
    "url": "http://www.epicurious.com/recipes/food/views/sephardic-spinach-patties-233358"
}
