{
    "directions": [
        "In a sauce pan over medium heat, combine shallots, ginger, lemon juice, and white wine. Cook  until liquid is reduced to approximately 2 tablespoons. Stir in heavy cream, and bring to light boil. Reduce cream by half; do not burn. Stir in soy sauce, then transfer to blender. Blend on low while slowly adding butter, a few cubes at a time, until all of the butter is emulsified. Roughly chop or tear shiso, add to sauce, and blend for about 10 more seconds. Season to taste with kosher salt and pepper. Keep sauce warm.",
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Heat oil in a large saute pan over high heat. Season both sides of the fillets with kosher salt and white pepper. Mix together white and black sesame seeds, and place in a plate or flat dish. Press the TOP side only of each fillet into the mixture, and press seeds into fish so it sticks. Make sure that the crusted sides are evenly crusted with the seeds. When oil is smoking, add fish, sesame seed side down to pan, and be careful of oil splatters. Pan sear fish for about 30 to 45 seconds per side. Place pan into oven, or transfer fish to baking sheet, and cook in oven for about 5 to 6 minutes. Serve sesame crust side up with ginger butter sauce."
    ],
    "ingredients": [
        "3 shallots, minced",
        "2 teaspoons minced fresh ginger root",
        "1 lemon, juiced",
        "1/2 cup dry white wine",
        "1/2 cup heavy cream",
        "1/2 cup unsalted butter, chilled and cut into small cubes",
        "3 tablespoons soy sauce",
        "4 shiso leaves",
        "coarse kosher salt",
        "ground white pepper",
        "2 tablespoons canola oil",
        "6 (6 ounce) mahi mahi fillets",
        "4 tablespoons sesame seeds",
        "4 tablespoons black sesame seeds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sesame Crusted Mahi Mahi with Soy Shiso Ginger Butter Sauce",
    "url": "http://allrecipes.com/recipe/42231/sesame-crusted-mahi-mahi-with-soy-shi/"
}
