{
    "directions": [
        "Preheat oven to 425°F. Pierce eggplants all over with fork. Place on baking sheet. Roast in oven until eggplants are very soft and deflated, turning once, about 1 hour. Cool slightly.",
        "Cut eggplants in half; scrape flesh into strainer set over large bowl (do not allow bottom of strainer to touch bowl). Let eggplant drain 30 minutes. Transfer eggplant to processor. Using on/off turns, process until almost smooth.",
        "Heat vegetable oil in heavy large skillet over medium-high heat. Add 3/4 cup green onions, ginger, garlic and chili-garlic sauce; sauté just until onions soften, about 45 seconds. Stir in brown sugar, soy sauce, vinegar and lemon juice. Bring to simmer, stirring constantly. Mix in eggplant puree and cook until heated through, about 2 minutes. Remove from heat. Stir in tomatoes, 3/4 cup cilantro and sesame oil. Cool to room temperature. Season with salt and pepper. Transfer to medium bowl. (Can be prepared 1 day ahead. Cover and refrigerate. Bring to room temperature before serving.)",
        "Garnish eggplant salsa with 1 tablespoon each green onions and cilantro. Serve with Parmesan Pita Crisps."
    ],
    "ingredients": [
        "2 (1- to 1 1/4-pound) eggplants",
        "1 tablespoon vegetable oil or peanut oil",
        "3/4 cup (packed) plus 1 tablespoon minced green onions",
        "2 1/2 tablespoons minced peeled fresh ginger",
        "4 garlic cloves, minced",
        "1 teaspoon chili-garlic sauce*",
        "3 tablespoons (packed) golden brown sugar",
        "2 tablespoons soy sauce",
        "1 tablespoon rice vinegar",
        "2 teaspoons fresh lemon juice",
        "2 large plum tomatoes, seeded, chopped",
        "3/4 cup (packed) plus 1 tablespoon finely chopped fresh cilantro",
        "1 1/2 teaspoons oriental sesame oil",
        "Parmesan Pita Crisps",
        "*Available at Asian markets and in the Asian foods section of many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Food Processor",
        "Garlic",
        "Vegetable",
        "Bake",
        "Sauté",
        "Eggplant",
        "Sesame"
    ],
    "title": "Sesame-Eggplant Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/sesame-eggplant-salsa-102688"
}
