{
    "directions": [
        "To make the dressing: Put the soy sauce, vinegar, ginger, brown sugar, sesame oil, red pepper flakes, garlic and 2/3 cup of the olive oil into a blender. Blend until completely emulsified. Taste the dressing and adjust to your taste, adding more vinegar or sugar as needed. Pour half of the dressing into a jar and refrigerate for the salad.",
        "Put the tofu cubes into a bowl and pour over the remaining dressing. Cover and refrigerate for at least an hour.",
        "Remove the tofu from the dressing and pat dry. Heat the remaining 2 tablespoons olive oil in a nonstick skillet over medium-high heat. Cook the tofu on all sides until nicely browned and crisp, about 10 minutes. Toss in the sesame seeds and cook for another minute. Remove to a paper towel-lined plate.",
        "To assemble the salad, put the mixed greens, halved tomatoes and sliced onion in a large bowl. Pour on half the remaining dressing, reserving the rest for later use. Toss to coat. Arrange the tofu and mandarin oranges all over the greens. Serve immediately."
    ],
    "ingredients": [
        "1/4 cup low-sodium soy sauce",
        "1/4 cup rice wine vinegar, plus more if needed",
        "2 tablespoons minced fresh ginger",
        "2 tablespoons brown sugar, plus more if needed",
        "3/4 teaspoon toasted sesame oil",
        "Pinch red pepper flakes",
        "2 cloves garlic, minced",
        "2/3 cup plus 2 tablespoons olive oil",
        "One 14-ounce package extra-firm tofu, cut into cubes",
        "2 tablespoons sesame seeds",
        "One 10-ounce package mixed greens",
        "1 cup red grape tomatoes, halved",
        "1/2 red onion, very thinly sliced",
        "One 11-ounce can mandarin oranges, drained"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Salad Recipes",
        "Tofu Recipes",
        "Main Dish Recipes",
        "Lunch"
    ],
    "title": "Sesame Tofu Salad",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/sesame-tofu-salad"
}
