{
    "directions": [
        "In a bowl whisk together 2 cups of the whole-wheat flour, the all-purpose flour, the baking soda, the salt, and the brown sugar, add the butter, and blend the mixture until it resembles coarse meal. Stir in the oats and 1/4 cup of sesame seeds, add 1 1/3 cups of the buttermilk gradually, stirring, and stir the dough until it forms a ball. Turn the dough out onto a floured surface, knead in just enough of the remaining 1/2 cup whole-wheat flour to form a soft but not sticky dough, and knead the dough lightly for 1 minute. Divide the dough into 4 equal pieces, form each piece into a ball, and flattened the balls slightly. Transfer the balls to a lightly buttered baking sheet, brush the tops with the additional buttermilk, and sprinkle them with the remaining 1 teaspoon sesame seeds. Cut a 1/8-inch-deep X across each bread with a sharp knife and bake the breads in the middle of a preheated 425°F. oven for 15 to 20 minutes, or until they are browned lightly and sound hallow when the bottoms are tapped. Transfer the breads to a rack and let them cool completely. The breads keep, wrapped well in plastic wrap and foil, chilled for 1 week or frozen for 1 month."
    ],
    "ingredients": [
        "2 to 2 1/2 cups whole-wheat flour",
        "1 1/3 cups all-purpose flour",
        "1 teaspoon baking soda",
        "2 teaspoons salt",
        "1 1/2 tablespoons firmly packed light brown sugar",
        "1/2 stick (1/4 cup) cold unsalted butter, cut into bits",
        "2/3 cup old-fashioned rolled oats",
        "1/4 cup plus 1 teaspoon sesame seeds, toasted lightly and cooled",
        "1 1/3 cups buttermilk plus additional for brushing the breads"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Bake",
        "Quick & Easy",
        "Oat",
        "Winter",
        "Healthy",
        "Whole Wheat",
        "Gourmet"
    ],
    "title": "Sesame Whole-Wheat Soda Breads",
    "url": "http://www.epicurious.com/recipes/food/views/sesame-whole-wheat-soda-breads-13583"
}
