{
    "directions": [
        "Pat chicken dry and season with salt.",
        "Stir together water, vinegar, soy sauce, sugar, and red pepper flakes in a small bowl until sugar is dissolved.",
        "Heat a wok or 12-inch skillet over high heat until a bead of water dropped onto cooking surface evaporates immediately. Add 1 tablespoon oil, swirling wok to coat evenly, and heat until hot and just smoking. Add onion and stir-fry until golden and crisp-tender, about 2 minutes. Transfer onion to a large bowl.",
        "Add 1/2 tablespoon oil to wok and heat until just smoking, then stir-fry half of chicken until just cooked through, about 1 1/2 minutes. Transfer to bowl with onion and stir-fry remaining chicken in 1/2 tablespoon oil in same manner, transferring to bowl.",
        "Add remaining tablespoon oil to wok and heat until just smoking, then stir-fry mushrooms until just tender, 3 to 4 minutes. Add peas and stir-fry until heated through, about 1 minute, then transfer to bowl.",
        "Add vinegar mixture and sesame seeds to wok and, when liquid just reaches a boil, add chicken mixture and stir-fry until heated through, about 1 minute. Season with salt and pepper and serve over rice."
    ],
    "ingredients": [
        "1 1/2 pounds skinless boneless chicken breasts (4 halves), cut crosswise into 1/4-inch-thick slices",
        "2 tablespoons water",
        "2 tablespoons rice vinegar (not seasoned)",
        "2 tablespoons soy sauce",
        "2 teaspoons sugar",
        "1/2 teaspoon dried hot red pepper flakes",
        "3 tablespoons vegetable oil",
        "1 large onion, halved lengthwise, then thinly sliced lengthwise",
        "3/4 pound fresh shiitake mushrooms, stems discarded and caps quartered",
        "1 1/4 cups frozen peas, thawed",
        "2 tablespoons sesame seeds, toasted",
        "Accompaniment: steamed rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Chicken",
        "Mushroom",
        "Vegetable",
        "Stir-Fry",
        "Quick & Easy",
        "Pea",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Sesame Chicken and Shiitake Stir-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/sesame-chicken-and-shiitake-stir-fry-107007"
}
