{
    "directions": [
        "Put flour and sesame seeds on separate sheets of wax paper and in a shallow bowl beat together egg white and water.",
        "Season chicken breasts with salt and dip them, 1 at a time, in flour, shaking off excess. Dip chicken in egg white, letting excess drip off, and coating with sesame seeds on 1 side, shaking off excess. Transfer chicken breasts as coated to a plate.",
        "In a large non-stick skillet heat 1 teaspoon oil over moderate heat until hot but not smoking and cook chicken, sesame-seed sides down, until golden, about 4 minutes. Turn chicken and cook 4 minutes more, or until just cooked through. Add lemon juice to skillet. Turn chicken to coat with juice and cook until juice is almost evaporated, about 1 minute. Transfer chicken to a cutting board and halve lengthwise.",
        "Make a horizontal cut through center of each baguette piece with a serrated knife, cutting almost but not all the way through, and spread open. In a bowl toss together cabbage, spinach, carrot, remaining teaspoon oil, and salt to taste.",
        "Make sandwiches with slaw, chicken, and bread, pressing together gently."
    ],
    "ingredients": [
        "1 1/2 tablespoons all-purpose flour",
        "2 tablespoons sesame seeds",
        "1 large egg white",
        "1 teaspoon water",
        "2 small boneless skinless whole chicken breasts (about 1 pound total), halved and flattened slightly",
        "2 teaspoons Asian sesame oil",
        "1 tablespoon fresh lemon juice",
        "20 inches (about 10 ounces) of a baguette, cut crosswise into 4 pieces",
        "4 cups shredded Napa cabbage",
        "2 cups packed trimmed spinach leaves, washed well, spun dry, and shredded",
        "1 carrot, shredded"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Chicken",
        "Poultry",
        "Low Fat",
        "Quick & Easy",
        "Lunch",
        "Spinach",
        "Summer",
        "Pan-Fry",
        "Cabbage",
        "Sesame",
        "Gourmet"
    ],
    "title": "Sesame Chicken with Napa Cabbage and Spinach Slaw on Baguette",
    "url": "http://www.epicurious.com/recipes/food/views/sesame-chicken-with-napa-cabbage-and-spinach-slaw-on-baguette-12391"
}
