{
    "directions": [
        "Coat the chicken with the sesame seeds and season it with salt and black pepper. Heat a ridged grill pan or heavy skillet over moderately high heat until it is hot, brush it with the additional vegetable oil, and in it sauté the chicken for 7 to 9 minutes on each side, or until it is just springy to the touch.",
        "While the chicken is cooking, in a large skillet heat the remaining 1 tablespoon vegetable oil over moderately high heat until it is hot but not smoking and in it stir-fry the mushrooms for 3 minutes. Add the cabbage and the bell pepper and stir-fry the vegetables for 5 minutes, or until they are crisp-tender. In a small bowl combine well the vinegar, the soy sauce, the sesame oil, the gingerroot, and the sugar, add the mixture to the vegetables with salt and black pepper to taste, and stir-fry the mixture over moderately high heat for 1 minute. Divide the vegetable mixture between 2 heated plates, cut the chicken against the grain into 1/4-inch-thick slices, and arrange it on top of the vegetables."
    ],
    "ingredients": [
        "1 whole boneless chicken breast, halved",
        "2 teaspoons sesame seeds",
        "1 tablespoon vegetable oil plus additional for brushing the grill pan",
        "1/4 pound fresh shiitake or white mushrooms, stems discarded and the caps sliced thin",
        "1/2 pound cabbage, sliced thin (about 2 cups)",
        "1 small red bell pepper, cut into julienne strips",
        "2 teaspoons white-wine vinegar",
        "2 teaspoons soy sauce",
        "1 teaspoon Oriental sesame oil",
        "1/2 teaspoon minced peeled fresh gingerroot",
        "1/4 teaspoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Mushroom",
        "Sauté",
        "Stir-Fry",
        "Quick & Easy",
        "Bell Pepper",
        "Cabbage",
        "Sesame",
        "Gourmet"
    ],
    "title": "Sesame Chicken and Stir-Fried Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/sesame-chicken-and-stir-fried-vegetables-10381"
}
