{
    "directions": [
        "Wash the chicken under cold running water, pat dry and trim off any excess fat. Cut the chicken into 1-inch cubes and put into a large mixing bowl. Add the marinade ingredients to the bowl and stir to combine. Set aside to marinate while you prepare the sauce.",
        "To make the sauce: In a saucepan, add the sesame oil and set over low heat. Add the ginger and garlic and fry gently until fragrant, about 2 to 3 minutes. Meanwhile, combine the remaining sauce ingredients in a mixing bowl and stir well to dissolve the cornstarch. Gently pour into the saucepan with the fried ginger and garlic. Stir as you pour because the cornstarch will thicken up pretty quickly. Keep warm over low heat.",
        "In a heavy-bottomed pot or deep-fryer heat enough oil to come halfway up the sides of the pot, to 375 degrees F.",
        "Fry the chicken, in small batches, until golden and crispy, about 5 to 6 minutes. Remove the chicken using a wire mesh strainer and drain on paper towels. Season with a little salt, to taste. To serve, arrange the fried chicken on a platter and pour drizzle with the sauce. Sprinkle with a generous amount of toasted sesame seeds and garnish with scallions and cilantro sprigs."
    ],
    "ingredients": [
        "3 boneless chicken breasts (about 1 1/2 pounds total)",
        "6 tablespoons low-sodium soy sauce",
        "2 teaspoons toasted sesame oil",
        "1 teaspoon kosher salt",
        "4 tablespoons all-purpose flour",
        "4 tablespoons cornstarch",
        "4 tablespoons water",
        "1 teaspoon baking powder",
        "3 tablespoons toasted sesame oil",
        "1 teaspoon ginger, minced",
        "1 clove garlic, minced",
        "1 teaspoon chili paste (recommended: Sambal Oelek)",
        "2 cups low-sodium chicken broth",
        "1/4 cup cornstarch",
        "2 tablespoons sherry vinegar",
        "1/2 cup sugar",
        "2 tablespoons soy sauce",
        "Peanut oil, for deep-frying",
        "Salt",
        "3 tablespoons toasted sesame seeds, for garnish",
        "2 to 3 tablespoons finely chopped scallions, for garnish",
        "5 to 6 cilantro sprigs, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Asian",
        "Chinese Recipes",
        "Sesame Chicken",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes",
        "Lunch",
        "Marinating Recipes",
        "Deep-Frying"
    ],
    "title": "Sesame Chicken",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/sesame-chicken-recipe"
}
