{
    "directions": [
        "Preheat the oven to 300 degrees F.",
        "With the tip of a paring knife, make ten 3/4-inch-deep slits on each side of the roast. Insert a garlic clove half into each slit. Season the meat all over with the salt and pepper. Heat the oil in a Dutch oven over medium heat until shimmering. Gently set the roast in it and sear all over, turning with tongs, until well browned, about 14 minutes. Remove the meat from the pan to a plate.",
        "Add the carrots, onions and bay leaves to the pan and cook for 2 minutes. Add the wine and bring to a boil. Reduce the heat and simmer, stirring up the crispy bits at the bottom of the pan with a wooden spoon, until the wine is reduced by half. Return the roast to the pot, laying it on top of the vegetables. Add enough chicken stock to cover the roast by three-quarters. Cover and roast for 1 hour 30 minutes.",
        "Flip the meat over and add the potatoes. Cover and continue cooking until the potatoes are tender but not mushy and the meat is fall-apart tender, 45 minutes more, depending on the thickness of the roast.",
        "Remove the roast and vegetables to a platter. Season the meat with additional salt. Pour the sauce into a gravy boat and pass with the meat and vegetables."
    ],
    "ingredients": [
        "2 to 2 1/2 pounds beef chuck roast",
        "10 cloves garlic, halved",
        "1/2 teaspoon kosher salt",
        "Freshly ground black pepper",
        "1 tablespoon extra-virgin olive oil",
        "3 carrots, cut into large bite-size chunks",
        "2 onions, thickly sliced",
        "2 bay leaves",
        "4 cups dry white wine (1 bottle)",
        "1 cup low-sodium chicken stock",
        "1 1/2 pounds Yukon Gold potatoes, peeled and cut into 2-inch pieces"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pot Roast",
        "Roast Recipes",
        "Potato",
        "Vegetable",
        "Beef",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Set-It-and-Forget-It Pot Roast",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/set-it-and-forget-it-pot-roast"
}
