{
    "directions": [
        "Sprinkle the yeast over the warm water in a large bowl. Let stand until dissolved, about 5 minutes.",
        "Stir the cold water and salt into the yeast mixture and gradually stir in flour until the mixture pulls together into dough. Remove dough from the bowl and knead on a lightly floured surface for 5 to 10 minutes, until a smooth tight ball can be formed. Dust the dough with flour and place in a sealed container or resealable bag with plenty of extra room. Refrigerate for at least 12 hours, and up to 3 days.",
        "Preheat the oven to 500 degrees F (260 degrees C). This will take a while. Stretch out the dough and press into a large oiled baking sheet. The dough should feel cold to the touch. Use a fork to poke holes all over the dough so that it will rise evenly without having giant bubbles.",
        "Toast the breadcrumbs in a large skillet over medium-high heat until golden brown; set aside. Heat half of the olive oil in a large skillet over medium-high heat. Add onion; cook and stir until tender, about 5 minutes. Remove from the heat and stir in the crushed tomatoes, red pepper flakes, pine nuts and raisins.",
        "To assemble the pizza, arrange anchovy fillets evenly over the dough. Spread the tomato sauce heavily over the entire crust. Sprinkle liberally with toasted bread crumbs and drizzle with the remaining olive oil. Allow the dough to rise near the warm oven for about 30 minutes.",
        "Bake the pizza on the bottom rack of the oven for 12 to 15 minutes, until the bottom of the crust is golden brown when you lift it up to look. Cut into 12 servings and enjoy."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/250x250/37989.jpg",
    "ingredients": [
        "1 teaspoon active dry yeast",
        "1/4 cup warm water (110 degrees F/45 degrees C)",
        "3/4 cup cold water",
        "1 teaspoon salt",
        "2 1/4 cups bread flour",
        "3/4 cup soft bread crumbs",
        "1/2 cup olive oil",
        "1 large onion, chopped",
        "1 (14 ounce) can crushed tomatoes",
        "1/2 teaspoon crushed red pepper flakes",
        "2 tablespoons pine nuts",
        "2 tablespoons raisins",
        "1 (2 ounce) can anchovy fillets packed in olive oil, drained"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sfincione Siciliano Pizza",
    "url": "http://allrecipes.com/recipe/139566/sfincione-siciliano-pizza/"
}