{
    "directions": [
        "Mix bread flour, 5 1/3 ounces semolina flour, and kosher salt together in a large bowl; add water and honey and mix. The dough will be very dry, like pasta. If there is still dry flour after a few minutes of mixing, add up to 2 teaspoons more water to ensure all the flour is moistened.",
        "Turn dough onto a counter. Knead a few minutes until the dough is smooth, firm, and not tacky. While firm, the dough must also be workable. Divide the dough into four pieces and flatten. Cover dough with plastic wrap when not working with it. Run each piece through a pasta machine on its widest setting a dozen or so times, folding in half and rotating the sheet 45 degrees each time (see Cook's Note). Dust with flour very sparingly, only if needed to prevent tearing. Repeat with all four pieces. Wrap dough in plastic wrap and refrigerate for 2 hours.",
        "Blend ricotta cheese in a food processor until smooth. Boil 1 cup of water and stir in the sugar. Sift in the semolina, whisking to avoid clumping. It will immediately thicken up. Reduce heat to low, fold in the ricotta, and cook for another 2 minutes, stirring constantly.",
        "Remove pan from heat and return filling to food processor. While processor is running, add egg yolks, one at a time, until fully combined. Add vanilla, cinnamon, and candied orange peel and pulse to mix. Transfer filling to a bowl. Cool to room temperature, cover with plastic wrap, and refrigerate.",
        "Divide each dough piece into four pieces. Cover dough with plastic wrap. Place clean kitchen towels over a work surface. Lay each sheet of dough on the towels while you roll out the remaining sheets.",
        "Run each piece through the pasta machine on progressively smaller settings until dough is as thin as possible. After running it through the pasta machine, stretch each sheet as wide as you can without tearing. Dough sheets should stretch to three times their original width and be so thin you can see through it.",
        "Place a sheet of parchment paper on a work surface. Melt butter and lard. Place the first sheet of pastry on the parchment. Brush the dough with the butter-lard mixture. Lay the second sheet above the first, overlapping a half-inch or so. Roll the sheets up into a tight cylinder, leaving about an inch to overlap the next sheet. Lay the third dough sheet on the parchment, overlapping the second sheet, and brush with the butter mixture. Continue rolling up the log of dough, repeating until all the dough pieces are brushed with the butter mixture and rolled up. Wrap dough log in the parchment sheet and wrap entirely with plastic wrap; refrigerate for 2 hours.",
        "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper. Place filling mixture in a pastry bag or a 1 gallon zipper bag with the corner snipped off.",
        "Cut cylinder of dough into half-inch slices; you should have 16 to 20 pieces. Holding the dough in both hands, use your thumbs to flatten the dough piece from the center outwards. Form flattened slice into a cone shape. Pipe filling into center, close partially, and repeat with remaining dough and filling.",
        "Bake in preheated oven until dough turns golden brown and starts to \"peel\" back from the pastries, 20 to 30 minutes. You can baste the pastries a couple of times with the leftover butter and lard mixture during baking, if you like. Dust with confectioners' sugar before serving."
    ],
    "ingredients": [
        "The Dough:",
        "12 1/3 ounces bread flour",
        "5 1/3 ounces semolina flour",
        "1/3 ounce kosher salt",
        "6 1/2 fluid ounces water, or more if needed",
        "2/3 fluid ounce honey",
        "The Filling:",
        "1 2/3 cups whole-milk ricotta cheese",
        "1 cup water",
        "1/2 cup white sugar",
        "2/3 cup semolina flour",
        "2 large egg yolks",
        "2 teaspoons vanilla extract",
        "1/4 teaspoon ground cinnamon",
        "2 tablespoons finely chopped candied orange peel",
        "For Brushing:",
        "1/2 cup unsalted butter, room temperature",
        "1/2 cup lard, room temperature",
        "1/4 cup confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sfogliatelle Ricce",
    "url": "http://allrecipes.com/recipe/235629/sfogliatelle-ricce/"
}
