{
    "directions": [
        "In large bowl, place meat, garlic, 1 tablepsoon sugar, 2 teaspoons salt, 1 teaspoon pepper, and 1 tablespoon oil. Cover with plastic wrap and refrigerate at least 2 hours and no more than 12 hours.",
        "Whisk together rice-wine vinegar, wine, soy sauce, fish sauce, and 1 tablespoon sugar.",
        "In small ramekin, whisk together lime juice, remaining 1/4 teaspoon salt, and remaining 1/4 teaspoon pepper.",
        "Arrange watercress or lettuce on four plates.",
        "Divide meat into 2 portions and place in two medium bowls.",
        "In wok or large skillet over high heat, heat 2 tablespoons oil until smoking, then add 1 portion meat in one layer. Sear until brown crust forms, about 3 to 4 minutes, then flip to brown other side, another 3 to 4 minutes. Add half of red onion slices and half scallions, and sauté, stirring, until fragrant, about 30 seconds. Add 1/3 cup vinegar mixture and shake pan to release beef, stirring if necessary. Add 1 tablespoon butter, shaking pan until butter melts. Remove meat, and repeat with remaining portion of meat and remaining onions, scallions, vinegar mixture, and butter.",
        "Arrange beef on top of lettuce and serve with lime dipping sauce."
    ],
    "ingredients": [
        "1 1/2 to 2 pounds beef tenderloin (filet mignon), trimmed of excess fat and cut into 1-inch cubes",
        "5 garlic cloves, chopped (about 2 tablespoons)",
        "2 tablespoons sugar",
        "2 1/4 teaspoons kosher salt",
        "1 1/4 teaspoons freshly ground black pepper",
        "5 tablespoons canola oil",
        "1/4 cup rice-wine vinegar",
        "1/4 cup rice wine or white wine",
        "3 tablespoons soy sauce",
        "1 tablespoon fish sauce",
        "Juice of 1 medium lime (about tablespoons)",
        "2 bunches watercress or 1 small head red leaf lettuce, separated into leaves",
        "1 red onion, peeled and thinly sliced (about 2 cups)",
        "3 scallions, trimmed and cut in 1-inch lengths",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Wok",
        "Garlic",
        "Onion",
        "Marinate",
        "Stir-Fry",
        "Quick & Easy",
        "Vinegar",
        "Lime",
        "Beef Tenderloin",
        "Watercress"
    ],
    "title": "Shaking Beef",
    "url": "http://www.epicurious.com/recipes/food/views/shaking-beef-236373"
}
