{
    "directions": [
        "Pour milk into large bowl. Mix in sugar, butter, and salt; cool to lukewarm. Place 1/4 cup warm water in small bowl; mix in yeast. Let stand 6 minutes.",
        "Stir yeast mixture and 1 egg into lukewarm milk mixture. Mix in 4 cups flour. Beat with wooden spoon until mixture is smooth. Cover bowl with plastic wrap and let sponge stand until bubbles appear at edge, about 15 minutes.",
        "Mix nuts and rosemary into sponge. Mix in flour, 1/3 cupful at a time, until soft, slightly sticky dough forms. Turn dough out onto floured surface and knead until smooth and no longer sticky, sprinkling with flour as needed, about 10 minutes. Brush clean large bowl with oil. Add dough; turn to coat. Cover bowl with plastic. Let dough rise in warm draft-free area until doubled in volume, about 1 hour.",
        "Brush two 8 1/2x4 1/2x2 1/2-inch nonstick loaf pans with oil. Punch dough down and turn out onto work surface; shape into two 8-inch-long loaves. Place in pans. Let rise, uncovered, until almost doubled in volume, about 45 minutes.",
        "Position rack in bottom third of oven and preheat to 375°F. Using serrated knife, make shallow cut down center of each loaf. Brush loaves with glaze. Bake until golden and crusty, about 35 minutes. Turn breads out of pans. Cool on racks."
    ],
    "ingredients": [
        "2 1/4 cups very warm whole milk (120°F)",
        "3 tablespoons sugar",
        "2 tablespoons (1/4 stick) unsalted butter, cut into 1/2-inch pieces, room temperature",
        "2 teaspoons salt",
        "1/4 cup warm water (110°F to 115°F)",
        "2 envelopes active dry yeast",
        "1 large egg, beaten to blend",
        "6 1/2 cups (about) all purpose flour",
        "1 cup coarsely chopped walnuts",
        "2 teaspoons chopped fresh rosemary",
        "Vegetable oil",
        "1 large egg yolk, beaten with 1 tablespoon whole milk (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Herb",
        "Nut",
        "Breakfast",
        "Brunch",
        "Bake",
        "Rosemary",
        "Walnut",
        "Fall"
    ],
    "title": "Shaker-Style Walnut and Rosemary Loaf",
    "url": "http://www.epicurious.com/recipes/food/views/shaker-style-walnut-and-rosemary-loaf-108609"
}
