{
    "directions": [
        "Preheat the oven to 350°F.",
        "To make the spicy tomato sauce, in a large saucepan over low heat, combine the olive oil, garlic, tomatoes, Maras pepper, and hawayej. Simmer until the tomatoes are soft and melted, about 15 minutes. It is important to cook the sauce slowly so the tomatoes are soft enough to puree but don’t reduce too much. Set the sauce aside to cool slightly.",
        "Using an immersion blender and starting at low speed, puree the sauce, gradually increasing the speed as the mixture becomes smoother and resembles a silky tomato soup. Stir in the lemon juice and season with salt and pepper to taste. Cover and refrigerate up for up to 1 week or use immediately.",
        "When you are ready to make the shakshuka, gently reheat the sauce and pour it into a 9x13-inch glass baking dish or six soufflé ramekins or small cazuelas (4 to 5 inches in diameter and at least 1-inch high).",
        "To make in a 9x13-inch dish, first crack each egg into a small bowl or ramekin to ensure that the yolks stay intact. Using the back of a spoon, make a divot for each egg and slide it into the sauce, one at a time, so that it doesn’t float on top; leave a little space between each egg.",
        "To make in individual baking dishes, set the ramekins onto a baking sheet. Ladle about 1/2 cup sauce into each dish and, using the back of a spoon, make a divot for the egg. To ensure that the yolks stay intact, first crack each egg into a small bowl or ramekin, then slide it into the sauce.",
        "Lightly season the eggs with salt and transfer to the oven. Bake until the egg whites are just barely set and the yolks are very loose, about 20 minutes.",
        "Remove the shakshuka from the oven. Scoop one egg on top of each pita bread and carefully spoon a generous amount of tomato sauce from the pan over the top of the egg. Place 1 teaspoon of zhoug on top of each serving and pass around additional zhoug at the table. If serving the shakshuka individually, top each shakshuka with 2 teaspoons of zhoug and serve them with a spoon and the bread on the side so that you can use the bread or spoon to scoop up the sauce. Serve immediately with additional zhoug."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "4 teaspoons finely chopped garlic",
        "1 (28-ounce) can diced tomatoes, including the liquid",
        "1 teaspoon Maras pepper",
        "1 1/2 teaspoons hawayei (see Cooks' Note), or 1 teaspoon curry powder",
        "1 1/2 teaspoons freshly squeezed lemon juice",
        "Kosher salt and freshly ground black pepper",
        "6 eggs",
        "6 (6-inch) store-bought pita breads or 3 Sofra Pita Breads, split in half widthwise",
        "1/2 cup Zhoug"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Egg",
        "Tomato",
        "Herb",
        "Spice"
    ],
    "title": "Shakshuka (Baked Eggs With Spicy Tomato Sauce)",
    "url": "http://www.epicurious.com/recipes/food/views/shakshuka-baked-eggs-with-spicy-tomato-sauce"
}
