{
    "directions": [
        "Preheat oven to 400°F. Toast nuts on a rimmed baking sheet until golden brown, about 4 minutes. Transfer to a small bowl. Toss shallots and vegetable oil on same baking sheet; season with salt and pepper. Roast until tender and browned in spots, 20–25 minutes. Let cool. Remove any leathery outer layers.",
        "Meanwhile, bring vinegar and sugar to a simmer in a small skillet over medium-low, swirling occasionally, until syrupy, about 5 minutes. Stir in 1 Tbsp. butter; remove from heat. Arrange shallots, cut side up, in skillet, overlapping slightly if needed and filling in any gaps.",
        "Roll out puff pastry on a lightly floured surface just to smooth any creases (if box has 2 sheets of pastry, stack and gently roll out to adhere). Cut out a circle that’s about 1\" larger than the bottom of the skillet; prick in several places with a fork. Drape pastry over shallots, tucking edges inside skillet. Bake until pastry is golden brown and puffed, 25–30 minutes.",
        "Meanwhile, heat remaining 2 Tbsp. butter in a medium skillet over medium-high. Cook mushrooms and garlic, tossing often, until mushrooms are tender and browned, 5–8 minutes. Season with salt and pepper; set aside.",
        "Let tart sit until pastry is cooled slightly, 5–10 minutes. Carefully invert onto a plate. Top with burrata, mushrooms, arugula, Parmesan, and nuts. Drizzle with olive oil and lemon juice and season with salt."
    ],
    "ingredients": [
        "1 tablespoon pine nuts or chopped almonds",
        "6 large shallots, peeled, halved lengthwise",
        "2 teaspoons vegetable oil",
        "Kosher salt, freshly ground pepper",
        "1/4 cup balsamic vinegar",
        "1 teaspoon sugar",
        "3 tablespoons unsalted butter, divided",
        "1 package frozen puff pastry, thawed",
        "All-purpose flour (for surface)",
        "8 ounces mixed mushrooms (such as maitake, oyster, and/or shiitake), torn into bite-size pieces",
        "1 garlic clove, smashed",
        "3 ounces burrata, torn, or ricotta",
        "1 cup baby arugula",
        "1/2 ounce Parmesan, shaved",
        "Olive oil and lemon wedge (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tart",
        "Shallot",
        "Parmesan",
        "Arugula",
        "Christmas",
        "New Year's Eve",
        "Phyllo/Puff Pastry Dough",
        "Mushroom",
        "Cheese",
        "Side",
        "Vegetarian",
        "Dinner"
    ],
    "title": "Shallot Tarte Tatin",
    "url": "http://www.epicurious.com/recipes/food/views/shallot-tarte-tatin"
}
