{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line two 12-cup muffin tins with paper liners.",
        "Beat 1 cup butter and 2 cups white sugar together in a bowl using an electric mixer until creamy and smooth. Beat in eggs, one at a time, until just incorporated. Stir in raspberry extract. Gradually stir flour, alternating with milk, into creamed butter mixture until just combined; stir in 6 drops food coloring. Pour batter into prepared muffin cups, filling them 3/4 full.",
        "Bake in the preheated oven until a toothpick inserted in the center of a cupcake comes out clean, about 20 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
        "Place blueberries, 1/4 cup white sugar, and cornstarch in a saucepan; bring to a boil. Cook, stirring constantly, until thickened, 3 to 5 minutes. Remove from heat and allow to cool to room temperature.",
        "Cut a small hole in the top center of each cupcake. Pipe the blueberry filling mixture into the holes.",
        "Place 1/2 cup butter in a bowl; beat confectioners' sugar, 1/2 cup at a time, into butter using an electric mixer until just combined. Beat in strawberry extract, vanilla extract, and cream. Gently stir about 4 drops blue food coloring into frosting only until a blue-white effect is created. Pipe the frosting on top of each cupcake.",
        "Cut the candies to look like a shark's fin. Place one fin on top of each cupcake."
    ],
    "ingredients": [
        "Cupcakes:",
        "1 cup butter, softened",
        "2 cups white sugar",
        "3 eggs",
        "1 tablespoon raspberry extract",
        "2 cups all-purpose flour",
        "1/2 cup milk",
        "6 drops blue food coloring",
        "Filling:",
        "1/2 cup blueberries",
        "1/4 cup white sugar",
        "1 teaspoon cornstarch",
        "Frosting:",
        "1/2 cup butter, softened",
        "2 1/2 cups confectioners' sugar",
        "2 teaspoons strawberry extract",
        "1 teaspoon vanilla extract",
        "1/4 cup heavy whipping cream",
        "4 drops blue food coloring",
        "blue wedge-shaped candies"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shark Cupcakes",
    "url": "http://allrecipes.com/recipe/233433/shark-cupcakes/"
}
