{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch cake pan.",
        "Mix both amounts of cake flour, baking powder, and salt in a bowl. Beat 3 egg yolks in a separate bowl with an electric mixer until thickened and lemon-colored, about 5 minutes.",
        "Beat 2/3 cup white sugar, 3 1/2 tablespoons butter, and 3/4 teaspoon vanilla extract in a bowl with an electric mixer until light and fluffy; beat in egg yolks. Beat flour mixture in several additions, alternating with 6 tablespoons milk and ending with flour mixture, into creamed butter-sugar mixture on low until incorporated. Pour batter into the prepared cake  pan.",
        "Bake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 20 to 25 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.",
        "Pour 1 1/2 cups milk into a saucepan; bring to a boil. Remove from heat. Whisk 4 egg yolks and 1/3 cup white sugar in a bowl until well combined; whisk in all-purpose flour. Pour 2 tablespoons of hot milk into egg mixture, whisking constantly. Slowly whisk in remaining hot milk. Return saucepan to stove and bring almost to a boil, stirring constantly, until thickened. Pour custard into a heat-proof bowl; stir in 1 teaspoon vanilla extract. Refrigerate until chilled.",
        "Melt 3 tablespoons butter and chocolate in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Remove from heat; stir in confectioners' sugar and 3/4 teaspoon vanilla extract. Add water as needed to create desired consistency.",
        "Cut cake in half horizontally. Place bottom cake layer on a serving platter. Spread cooled custard onto bottom half; place top cake over custard layer. Spread frosting on top and sides of cake. Chill until serving time."
    ],
    "ingredients": [
        "Cake:",
        "3/4 cup cake flour",
        "2 tablespoons cake flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "3 egg yolks",
        "2/3 cup white sugar",
        "3 1/2 tablespoons butter, softened",
        "3/4 teaspoon vanilla extract",
        "6 tablespoons milk",
        "Custard:",
        "1 1/2 cups milk",
        "4 egg yolks",
        "1/3 cup white sugar",
        "1/4 cup all-purpose flour",
        "1 teaspoon vanilla extract",
        "Frosting:",
        "3 tablespoons butter, softened",
        "2 (1 ounce) squares semisweet chocolate",
        "1 cup confectioners' sugar, sifted",
        "3/4 teaspoon vanilla extract",
        "2 tablespoons hot water, or as needed (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shauna's Boston Cream Cake",
    "url": "http://allrecipes.com/recipe/232562/shaunas-boston-cream-cake/"
}
