{
    "directions": [
        "To make the dough, in a food processor, combine the flours, yeast, sugar and salt. Pulse to mix the ingredients. With the motor running, add the water and olive oil in a steady stream, then pulse until the dough comes together in a rough mass, about 12 seconds. If the dough does not form into a ball, sprinkle with 1 to 2 tsp. of water and pulse again until a rough mass forms. Let the dough rest for 5 to 10 minutes.",
        "Process the dough again for 25 to 30 seconds, steadying the top of the food processor with one hand. The dough should be tacky to the touch but not sticky. Transfer the dough to a lightly floured work surface and form into a smooth ball. Place the dough in a large oiled bowl, turn to coat with oil and cover with plastic wrap. Let the dough rise in a warm place until doubled in bulk and spongy, about 1 1/2 hours.",
        "Turn the dough out onto a lightly floured work surface, punch it down and shape into a smooth cylinder. Divide into 2 equal pieces. Shape each piece into a smooth ball, dusting with flour only if the dough becomes sticky. Cover both balls of dough with a clean kitchen towel and let rest for 10 minutes. Unless you are doubling the recipe for the toppings and making two pizzas, place the second ball in a gallon-size sealable plastic bag and freeze for up to 2 months.",
        "To make the sauce, in a small fry pan over medium heat, warm the olive oil. Add the onion, garlic and a pinch each of salt and pepper. Sauté until the onion is translucent, 3 to 4 minutes, taking care not to let the onion or garlic brown. Transfer the contents of the pan, including all of the oil, to a bowl and let cool.",
        "When the onion mixture is cool, stir in the ricotta, cream and oregano. Taste and season with more salt and pepper if needed. Use the sauce immediately, or store in an airtight container in the refrigerator for up to 1 week.",
        "Place a pizza stone in the middle of an oven and preheat to 450°F (230°C). Once the oven has reached 450°F (230°C), let the stone continue to heat for 15 to 30 minutes longer, without opening the door.",
        "Using a vegetable peeler, shave the asparagus spears into long, thin ribbons. Transfer to a bowl, toss with the olive oil and season with salt and pepper. Set aside.",
        "On a floured pizza peel, stretch or roll out the pizza dough into a 12-inch (30-cm) round. If the dough springs back, let it rest for about 10 minutes before continuing. Brush the entire dough round with olive oil and season lightly with salt and pepper. Leaving a 1-inch (2.5-cm) border, spread the sauce over the dough. Arrange the asparagus ribbons attractively on the pizza and scatter the basil and oregano all over the top. Drizzle with a little more olive oil.",
        "Carefully slide the pizza from the peel onto the hot stone in the oven and bake until the crust begins to brown, about 6 minutes. Crack the egg into a small bowl, being careful not to break the yolk. Open the oven door and quickly slide the egg from the bowl onto the center of the pizza. Continue baking until the egg is set but the yolk is still runny, 4 to 6 minutes longer.",
        "Transfer the pizza to a cutting board. Let cool for a few minutes, then slice and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Pizza Night",
        ", by Kate McMillan (Weldon Owen, 2014)"
    ],
    "ingredients": [
        "3 1/3 cups (17 oz./530 g) all-purpose flour, plus more for dusting",
        "1/4 cup (1 1/2 oz./45 g) whole-wheat flour",
        "1 package (2 1/2 tsp.) quick-rise yeast",
        "1 Tbs. sugar",
        "1 Tbs. kosher salt",
        "1 1/4 cups (10 fl. oz./310 ml) warm water (110°F/43°C), plus more as needed",
        "2 Tbs. olive oil, plus more as needed",
        "2 Tbs. olive oil",
        "1/2 yellow onion, minced",
        "3 garlic cloves, minced",
        "Kosher salt and freshly ground pepper",
        "1 cup (8 oz./250 g) whole-milk ricotta cheese",
        "1/4 cup (2 fl. oz./60 ml) heavy cream",
        "1 Tbs. fresh oregano leaves, chopped",
        "1/2 lb. (250 g) asparagus, ends trimmed",
        "2 tsp. olive oil, plus more for brushing and drizzling",
        "Kosher salt and freshly ground pepper",
        "4 to 6 fresh basil leaves, torn into large pieces",
        "1 Tbs. fresh oregano leaves",
        "1 egg"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Shaved Asparagus & Herb Pizza with Egg",
    "url": "http://www.williams-sonoma.com/recipe/shaved-asparagus---herb-pizza-with-egg.html"
}
