{
    "directions": [
        "Trim excess fat from lamb and remove any membrane. Lightly score flesh with a knife and pat dry with paper towels. Season lamb very generously with salt and pepper; place on a wire rack set inside a rimmed baking sheet.",
        "Grind cumin, caraway, and coriander seeds in a spice mill or with a mortar and pestle to a powder. Transfer to a small bowl and stir in chiles, garlic, oil, paprika, and cinnamon; rub all over lamb. Chill uncovered on wire rack 12–24 hours.",
        "Let lamb sit to come to room temperature, about 1 hour.",
        "Preheat oven to 450°F. Roast lamb until well browned all over, 20–25 minutes. Remove from oven and reduce oven temperature to 250°F.",
        "Meanwhile, grind caraway and coriander seeds in a spice mill or with a mortar and pestle to a powder.",
        "Heat oil in a large Dutch oven or other heavy pot over medium (if lamb doesn't fit in the pot you have, set a roasting pan over two burners instead). Add onion and cook, stirring occasionally, until translucent, 5–7 minutes. Add ancho chile powder, chipotle chile powder, turmeric, black pepper, cinnamon, and ground seeds and stir to coat onion. Cook, stirring, until spices are fragrant, about 2 minutes. Add tomatoes and broth and bring liquid to a simmer; season lightly with salt.",
        "Carefully place lamb in pot and add just enough water to cover if it is not submerged. Cover pot and braise lamb in oven until meat is very tender and bone wiggles easily in the joint, 4 1/2–5 1/2 hours. (If using a roasting pan, add water as needed so liquid comes halfway up side of leg, cover with foil, and turn lamb once during braising.) Transfer lamb to a platter and tent with foil to keep warm while you make the sauce.",
        "Increase heat to medium-high and bring braising liquid to a boil; cook, stirring often to prevent sticking, until reduced by half, 25–30 minutes. Taste sauce and season with salt if needed. Spoon over lamb. Serve with Herb Salad alongside.",
        "Lamb can be braised 2 days ahead. Keep in braising liquid; cover and chill. Reheat, covered, over medium-low until liquid is simmering and meat is warmed through."
    ],
    "ingredients": [
        "1 (6-pound) bone-in leg of lamb, shank attached, frenched",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons cumin seeds",
        "2 teaspoons caraway seeds",
        "2 teaspoons coriander seeds",
        "2 Thai chiles, very finely chopped",
        "4 garlic cloves, finely grated",
        "1/2 cup olive oil",
        "1 tablespoon paprika",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon caraway seeds",
        "1/2 teaspoon coriander seeds",
        "1/4 cup olive oil",
        "1 large onion, thinly sliced",
        "1 tablespoon ancho chile powder",
        "1 tablespoon chipotle chile powder",
        "1 teaspoon ground turmeric",
        "1/2 teaspoon freshly ground black pepper",
        "1/4 teaspoon ground cinnamon",
        "1 (28-ounce) can crushed tomatoes",
        "4 cups low-sodium chicken broth",
        "Kosher salt",
        "Herb Salad with Pickled Red Onion and Preserved Lemon (for serving)",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Party",
        "Lamb",
        "Kid-Friendly",
        "Kosher",
        "Cumin",
        "Cinnamon",
        "Coriander",
        "Caraway",
        "Paprika",
        "Tomato",
        "Chile Pepper"
    ],
    "title": "Shawarma-Spiced Braised Leg of Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/shawarma-spiced-braised-leg-of-lamb"
}
