{
    "directions": [
        "Arrange racks in upper and lower thirds of oven and preheat to 350°F. Pulse pumpkin seeds in a food processor until finely chopped. Transfer to rimmed baking sheet and toss with panko. Toast until lightly browned, 10–12 minutes. Transfer to a large plate and stir in 3/4 tsp. salt and 1/4 tsp. pepper; wipe off sheet.",
        "Meanwhile, cut each fillet in half lengthwise. Slice each piece on a diagonal into 3/4\" strips. Whisk eggs, 1/4 cup mayonnaise, 1 1/2 tsp. chili powder, 3/4 tsp. salt, and 1/4 tsp. pepper in a medium bowl. Set wire rack into rimmed baking sheet. Spray with cooking spray.",
        "Dredge each piece of fish in mayonnaise mixture, then roll in pumpkin-panko mixture, pressing to adhere. Arrange in a single layer on prepared rack. Spread corn with remaining 1/4 cup mayonnaise. Sprinkle with remaining 1 1/2 tsp. chili powder, 3/4 tsp. salt, and 1/4 tsp. pepper and arrange on second baking sheet. Place baking sheet with fish on upper rack of oven and corn on lower rack. Bake fish until opaque and flesh flakes apart when pierced with a paring knife, 18–22 minutes, and bake corn, turning once halfway through, until tender, about 20 minutes.",
        "Meanwhile, working one at a time, warm tortillas with tongs directly over a gas burner, turning them often, until lightly charred and puffed in spots, about 1 minute per side. (If you don't have a gas stove, wrap tortillas in foil and heat in a 350°F oven until warmed through, or wrap in damp paper towels and microwave in 20-second bursts until warm.) Transfer to a plate and cover with a kitchen towel to keep warm.",
        "Divide fish among tortillas and top with cabbage, avocado, cilantro, jalapeños, and hot sauce. Serve with corn and lime wedges alongside."
    ],
    "ingredients": [
        "1 1/2 cups pumpkin seeds (pepitas)",
        "1 1/2 cups panko (Japanese breadcrumbs)",
        "2 1/4 teaspoons kosher salt, divided",
        "3/4 teaspoon freshly ground black pepper, divided",
        "3–4 skinless mild fish fillets (such as red snapper, striped bass, or halibut; each 3/4\" thick, about 1 pound total), pin bones removed",
        "2 large eggs",
        "1/2 cup mayonnaise, divided",
        "3 teaspoons chili powder, divided",
        "Nonstick vegetable cooking spray",
        "4 ears of corn, husked",
        "12 taco-size corn tortillas",
        "Shredded green cabbage, sliced avocado, cilantro leaves with tender stems, pickled jalapeño slices, hot sauce, and lime wedges (for serving)",
        "An ovenproof wire rack that fits inside an 18x13\" rimmed baking sheet; 2 (18x13\") rimmed baking sheets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Kid-Friendly",
        "Dinner",
        "Spring",
        "Summer",
        "Healthy",
        "Tortillas",
        "Seed",
        "Pescatarian",
        "Dairy Free"
    ],
    "title": "Sheet-Pan Crispy Fish Tacos With Chili-Roasted Corn",
    "url": "http://www.epicurious.com/recipes/food/views/sheet-pan-crispy-fish-tacos-with-chili-roasted-corn-56390001"
}
