{
    "directions": [
        "Position racks in upper and lower thirds of oven and preheat to 425°F. Arrange chicken cutlets in a single layer on rimmed baking sheet and season with 1/2 tsp. pepper. Place 1 sage leaf on top of each cutlet, then wrap each in 1 slice of prosciutto, starting from the top and wrapping in a single layer, making sure cutlet stays flat.",
        "Finely chop remaining 4 sage leaves and toss with potatoes, garlic, 1 Tbsp. oil, 1/2 tsp. salt, and 1/2 tsp. pepper on second rimmed baking sheet.",
        "Cook chicken in upper third of oven and potatoes in lower third until prosciutto is crisp and an instant-read thermometer inserted into the thickest part of chicken registers 165°F, 12-14 minutes.",
        "Meanwhile, whisk anchovies, vinegar, honey, and remaining 2 Tbsp. oil, 1/4 tsp. salt, and 1/4 tsp. pepper in a large bowl; add kale and toss to coat.",
        "Remove both baking sheets from oven; let chicken rest. Spread kale evenly over potatoes and return to upper third of oven. Roast until potatoes are tender and kale is browned at edges, about 5 minutes more.",
        "Divide chicken among 4 plates. Serve potatoes and kale alongside."
    ],
    "ingredients": [
        "8 boneless, skinless chicken breast cutlets (about 2 pounds total)",
        "1 1/4 teaspoons freshly ground black pepper, divided",
        "12 small fresh sage leaves, divided",
        "8 thin slices prosciutto (about 6 ounces)",
        "1 pound baby new potatoes, sliced in half lengthwise, quartered if large",
        "1 garlic clove, finely chopped",
        "3 tablespoons olive oil, divided",
        "3/4 teaspoon kosher salt, divided",
        "3 oil-packed anchovy fillets, drained, finely chopped",
        "1 tablespoon red wine vinegar",
        "2 teaspoons honey",
        "1 bunch curly kale (about 8 ounces), ribs and stems removed, coarsely chopped",
        "2 (18x13\") rimmed baking sheets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Potato",
        "Bake",
        "Kid-Friendly",
        "Dinner",
        "Kale",
        "Quick and Healthy",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sheet-Pan Chicken Saltimbocca With Roasted Potatoes and Crispy Kale",
    "url": "http://www.epicurious.com/recipes/food/views/sheet-pan-chicken-saltimbocca-with-roasted-potatoes-and-crispy-kale-56390004"
}
