{
    "directions": [
        "Heat 1 tablespoon olive oil in heavy large saucepan over medium heat. Add chopped onion and cook until almost tender, stirring occasionally, about 5 minutes. Add sausage meat. Cook until sausage is no longer pink, breaking up with fork, about 5 minutes. Add clams and mussels. Increase heat to medium-high, cover and cook until shells open, about 5 minutes. Transfer clams and mussels to medium bowl, discarding any that do not open. Cover shellfish and keep warm.",
        "Meanwhile, combine clam juice and saffron threads in small saucepan; bring mixture to simmer. Reduce heat to low; keep warm.",
        "Add arborio rice to same saucepan that clams and mussels were cooked in and stir 2 minutes over medium heat. Add dry white wine and cook until wine is evaporated, stirring constantly, about 3 minutes. Add warm clam juice mixture and simmer until rice is just tender and liquid is creamy, stirring frequently, about 20 minutes.",
        "Mix shrimp, peas and chopped tomatoes into risotto and cook until shrimp are just cooked through, stirring frequently, about 3 minutes. Season risotto to taste with salt and pepper. Top risotto with clams and mussels and serve immediately."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1/2 onion, chopped",
        "1/2 pound hot Italian sausages, casings removed",
        "1 pound clams, scrubbed",
        "1/2 pound mussels, scrubbed, debearded",
        "4 8-ounce bottles clam juice",
        "1 teaspoon saffron threads",
        "2 cups arborio rice or medium-grain rice",
        "1/2 cup dry white wine",
        "1/2 pound uncooked medium shrimp, peeled, deveined",
        "1 10-ounce package frozen peas, thawed",
        "2 large plum tomatoes, seeded, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Shellfish",
        "Tomato",
        "Sausage",
        "Clam",
        "Mussel",
        "Shrimp"
    ],
    "title": "Shellfish Paella Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/shellfish-paella-risotto-1512"
}
