{
    "directions": [
        "Scrub the clams thoroughly with a stiff brush under cold water, discarding any that have cracked shells or that are not shut tightly.",
        "In a kettle cook the onion, the fennel, and the bell pepper in the oil over moderate heat, stirring, until the vegetables are softened. Stir in the zest, the minced thyme, the bay leaf, the cayenne, and the saffron, cook the mixture, stirring, for 30 seconds, and add the wine, the stock, the tomatoes, and salt and pepper to taste. Simmer the mixture, uncovered, for 15 minutes, add the garlic, and simmer the mixture for 5 minutes. The stew may be prepared up to this point 2 days in advance, cooled, uncovered, and kept covered and chilled. Stir in the shrimp and the clams and simmer the mixture, covered, for 5 minutes. Add the crab legs and the scallops, simmer the stew, covered, for 3 minutes, or until the scallops are just cooked through and the clams are opened, and discard the bay leaf and any unopened clams. Divide the stew among 8 heated bowls and garnish it with the thyme sprigs.",
        "In a well-buttered heavy saucepan combine the fish bones and trimmings, the onion, the parsley, the lemon juice, and the salt and steam the mixture, covered, over moderately high heat for 5 minutes. Add the water and the wine, bring the liquid to a boil, skimming the froth, and simmer the stock for 20 minutes. Strain the stock through a fine sieve into a bowl, let it cool to warm, and chill it, covered. The stock keeps, covered and chilled, for 1 week if it is brought to a boil every 2 days and then allowed to cool to warm, uncovered, before being chilled again. The stock keeps, frozen, for 3 months. Makes about 6 cups."
    ],
    "ingredients": [
        "1 large onion, chopped",
        "2 pounds fennel bulb (sometimes called anise, available at most supermarkets), trimmed and sliced thin",
        "1 red bell pepper, sliced thin lengthwise",
        "1/4 cup olive oil",
        "the zest of 1 orange, removed in strips with a vegetable peeler",
        "2 teaspoons minced fresh thyme leaves or 1 teaspoon dried, crumbled, plus thyme sprigs for garnish",
        "1 bay leaf",
        "1/4 teaspoon cayenne",
        "1/2 teaspoon crumbled saffron threads",
        "2 cups dry white wine",
        "4 cups white fish stock or bottled clam juice",
        "a 28- to 32-ounce can tomatoes, drained and chopped",
        "2 large garlic cloves, minced",
        "16 small shrimp, shelled and deveined",
        "16 small hard-shelled clams cleaned",
        "1 pound King crab legs, thawed, shelled, and the cartilage discarded",
        "8 large sea scallops, halved, or 16 small sea scallops",
        "2 pounds bones and trimmings of any white fish such as sole, flounder, or whiting, chopped",
        "2 cups sliced onion",
        "24 long parsley sprigs",
        "4 tablespoons fresh lemon juice",
        "1 teaspoon salt",
        "7 cups cold water",
        "1 cup dry white wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Stew",
        "Clam",
        "Crab",
        "Scallop",
        "Shrimp",
        "Saffron",
        "White Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Shellfish Stew Provençale",
    "url": "http://www.epicurious.com/recipes/food/views/shellfish-stew-provencale-11300"
}
