{
    "directions": [
        "Peel carrots and cut crosswise into 1/2-inch pieces.",
        "In a large saucepan bring 4 cups salted water to a boil and cook carrots until tender, about 7 minutes. Reserve 2 cups cooking liquid and drain carrots in a colander. In a blender purée hot carrots in batches with reserved cooking liquid, gingerroot, cumin, and salt and pepper to taste (use caution when blending hot liquids).",
        "Scrub clams and mussels, pulling beards from mussels if necessary. Shell shrimp and devein if desired.",
        "In a heavy 6-quart kettle with a tight-fitting lid boil wine with shallot until wine is reduced by about half. Reduce heat to low and add butter, stirring, and half of carrot purée. Add clams and simmer, covered, over moderate heat, stirring, 5 to 10 minutes, checking them every minute after 5 minutes and transferring them as they open with a slotted spoon to a bowl. (Discard any clams that are unopened after 10 minutes.)",
        "Add mussels to wine mixture and simmer, covered, stirring, 3 to 8 minutes, checking them every minute after 3 minutes and transferring them as they open with a slotted spoon to bowl. (Discard any mussels that are unopened after 8 minutes.)",
        "Add shrimp and remaining carrot purée to wine mixture and simmer, uncovered, stirring, until shrimp are just cooked through, about 3 minutes. Return clams and mussels to kettle and heat, stirring gently, until just heated through.",
        "Divide shellfish and sauce among 4 bowls and garnish with chives. Serve shellfish with toasts."
    ],
    "ingredients": [
        "1/2 pound carrots",
        "3/4 teaspoon grated peeled fresh gingerroot",
        "1/4 teaspoon ground cumin, or to taste",
        "20 littleneck clams (about 1 3/4 pounds)",
        "20 mussels (preferably cultivated; about 3/4 pound)",
        "3/4 pound medium shrimp (20 to 24)",
        "1/2 cup dry white wine",
        "1/4 cup chopped shallot",
        "1 tablespoon unsalted butter, cut into pieces",
        "Garnish: chopped fresh chives",
        "Accompaniment: 3/4 pound no-fat country-style bread, cut into 8 slices and toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Ginger",
        "Shellfish",
        "Vegetable",
        "Low Fat",
        "Clam",
        "Mussel",
        "Shrimp",
        "Carrot",
        "White Wine",
        "Fall",
        "Healthy",
        "Simmer",
        "Gourmet"
    ],
    "title": "Shellfish with Carrot Ginger Purée",
    "url": "http://www.epicurious.com/recipes/food/views/shellfish-with-carrot-ginger-puree-14091"
}
