{
    "directions": [
        "Light a grill or preheat a grill pan. Arrange your grill so about half is set to high heat and half is set to moderate. Soak 6 to 8 bamboo skewers for about 15 minutes.",
        "Twist off the lobster claws and use the base of a knife handle or a mallet to crack them. Arrange the lobster on a baking sheet and brush the cut sides of the bodies with some of the melted butter; season lightly with salt and pepper.",
        "Thread 3 to 4 shrimp on each of the skewers, brush with olive oil, season with salt and pepper and add them to the baking sheet.",
        "Grill the lobster claws over moderate heat, turning occasionally, for about 5 minutes. Add the lobster bodies to the hot side of the grill cut side down; grill just until the meat just starts to brown, about 3 minutes. Flip the lobster and transfer it to the cooler part of the grill with the claws. Generously brush the bodies with more butter and close the lid. Grill until cooked through, about 5 minutes longer. Transfer the bodies and claws to a platter.",
        "Meanwhile, arrange the clams on the hot part of the grill, close the lid and grill until they pop open, 5 to 7 minutes. As each opens, transfer it to a bowl, trying to keep as much as the juice as possible.",
        "Grill the shrimp over high heat until light brown grill marks form, 2 to 3 minutes. Flip and grill for 2 to 3 minutes longer, until cooked through. Transfer to the platter with the lobster and serve all of the seafood with the sauces."
    ],
    "ingredients": [
        "Two 1 1/2-pound lobsters, bodies and tails split in half and gills removed (ask your fish monger to do this for you)",
        "2 tablespoons butter, melted",
        "Salt",
        "Freshly ground pepper",
        "1 pound jumbo shrimp, peeled and deveined (tails left intact)",
        "Extra virgin olive oil, for brushing",
        "2 dozen littleneck clams, scrubbed",
        "Tarragon-Cilantro Salsa Verde , Sambal-Orange Vinaigrette and Chorizo-Lemon Butter , for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Backyard BBQ",
        "Clam",
        "Lobster",
        "Shrimp",
        "Summer",
        "Grill"
    ],
    "title": "Shellfish Mixed Grill",
    "url": "http://www.epicurious.com/recipes/food/views/shellfish-mixed-grill-51241450"
}
