{
    "directions": [
        "Cook bacon in pot (a.k.a. boiler) over medium heat, stirring occasionally, until brown and crisp, 5–8 minutes. Add onions and fennel and cook, stirring occasionally, until lightly golden and tender, 8–10 minutes. Add wine, salt, and 15 quarts cold water; cover pot and bring stock to a rolling boil. Cook 30 minutes.",
        "Stir chili-garlic sauce and Old Bay into stock; increase heat to high. Place potatoes in basket insert and carefully lower into pot. Cover pot and return stock to a boil; cook 10 minutes. Add lobsters, mussels, clams, and corn to basket, cover, and return to a boil, about 5 minutes. Add shrimp, turn off heat, and let sit, covered, until just cooked through, about 5 minutes. Stir in 16 cups ice water and let sit, covered, 15 minutes to infuse. Meanwhile, whisk chiles, lime zest, lime juice, oil, vinegar, and sugar in a small bowl. Let sauce sit at room temperature 30 minutes to let flavors meld.",
        "Carefully lift out basket and place on a rimmed baking sheet. Arrange potatoes, corn, lobsters, clams, mussels, and shrimp on several layers of newspapers to absorb excess moisture; discard stock. Stir basil and mint into sauce and serve alongside seafood and vegetables."
    ],
    "ingredients": [
        "1 pound thick-cut smoked bacon, cut into 1\" pieces",
        "3 large onions, chopped",
        "2 large fennel bulbs, chopped",
        "1 750 ml bottle dry white wine",
        "1 cup kosher salt",
        "16 ounces chili-garlic sauce",
        "1 cup Old Bay seasoning",
        "4 pounds medium red-skinned potatoes",
        "3 (1 1/2–2-pound) live lobsters",
        "2 pounds mussels, scrubbed, debearded",
        "24 littleneck clams, scrubbed",
        "6 ears of corn, husked, cut in half",
        "2 pounds head-on, shell-on jumbo shrimp",
        "4 serrano chiles, finely grated",
        "1 tablespoon finely grated lime zest",
        "1/2 cup fresh lime juice",
        "1/2 cup grapeseed oil",
        "3 tablespoons distilled white vinegar",
        "1 teaspoon sugar",
        "1/4 cup finely chopped fresh basil",
        "1/4 cup finely chopped fresh mint",
        "Made of restaurant-grade aluminum, the 40-quart Vollrath 68270 Boiler/ Fryer with Basket is brawny enough to handle this family-size seafood boil. ($108; webstaurantstore.com)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Potato",
        "Kid-Friendly",
        "Dinner",
        "Clam",
        "Lobster",
        "Mussel",
        "Shrimp",
        "Fennel",
        "Corn",
        "Summer",
        "Boil",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Shellfish Boil with Spicy Green Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/shellfish-boil-with-spicy-green-dipping-sauce-56389866"
}
