{
    "directions": [
        "Place the potatoes and cauliflower into a pot, then pour in the chicken broth. Add water to nearly cover the vegetables; bring to a boil. Reduce heat to low, and simmer until the potatoes and cauliflower are tender, about 20 minutes. Drain the potatoes and cauliflower, but keep about 1/2 cup of the cooking liquid. Separate the cooked potatoes into a large bowl. Transfer the cauliflower into a blender or food processor along with about 1/4 cup of the cooking liquid, and pulse until the cauliflower is thoroughly pureed. Spoon the blended cauliflower into the bowl with the potatoes, and mash together until the cauliflower and potatoes form a smooth, white mixture. Season the mixture with salt and black pepper. For a softer topping, stir in a few more spoonfuls of the cooking liquid.",
        "Preheat oven to 400 degrees F (200 degrees C). Spray a 9x12-inch baking dish with cooking spray.",
        "Heat the olive oil in a large skillet over medium heat, and cook the onion and carrots until the onion is translucent, about 5 minutes; stir in the ground turkey, and cook until the meat is no longer pink, breaking it up into small chunks as it cooks. Stir in peas and Worcestershire sauce, then cook until the meat has begun to brown, about 10 more minutes. If the filling mixture starts to look dried out, stir in a few spoonfuls of the cauliflower cooking liquid to keep it moist. Place the filling into the prepared baking dish, then smooth it out into an even layer. Top the filling with the mashed potato and cauliflower mixture, and spread with a fork, leaving little peaks and swirls in the topping.",
        "Bake the pie in the preheated oven until the filling is bubbling, about 25 minutes. Turn on the oven's broiler, and broil the pie about 6 inches from the heat source until the mashed topping has browned, about 10 more minutes."
    ],
    "ingredients": [
        "4 potatoes, cut into chunks",
        "1/2 head cauliflower, separated into florets",
        "2 cups chicken broth",
        "salt and ground black pepper to taste",
        "1 tablespoon olive oil",
        "1/2 onion, chopped",
        "3 carrots, shredded",
        "1 1/2 pounds ground turkey",
        "1 1/2 cups frozen peas",
        "2 tablespoons low-sodium Worcestershire sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shepherd's Turkey Pie",
    "url": "http://allrecipes.com/recipe/215439/shepherds-turkey-pie/"
}
