{
    "directions": [
        "Blanch onions in a 2- to 3-quart pot of boiling salted water 1 minute, then transfer with a slotted spoon to a bowl of cold water to stop cooking. Drain onions and peel, trimming root ends with a paring knife. Wash leek slices in a bowl of water, agitating them, then lift out and drain in a medium-mesh sieve.",
        "Preheat oven to 350°F.",
        "Pat lamb dry and sprinkle with 1 teaspoon salt and 1/4 teaspoon pepper. Put lamb and 3 tablespoons flour in a sealable plastic bag, then seal bag and shake to coat lamb.",
        "Melt 2 tablespoons butter in casserole dish over moderately high heat until foam subsides, then brown half of lamb, turning, about 6 minutes. Add 1 tablespoon garlic and cook, stirring, 2 minutes. Transfer browned lamb and garlic to a plate with a slotted spoon and repeat with remaining lamb and tablespoon garlic (do not add more butter).",
        "Add wine to casserole dish and deglaze by boiling over high heat, stirring and scraping up brown bits, 1 minute, then stir in tomato paste and boil, stirring, until liquid is reduced by half, about 5 minutes. Add broth, water, thyme, browned lamb with any juices that have accumulated on plate, onions, leeks, carrots, turnips, remaining teaspoon salt, and remaining 1/4 teaspoon pepper and stir to combine. Bring to a simmer over moderately high heat, then remove from heat.",
        "Cover dish with lid or foil and braise lamb and vegetables in middle of oven, stirring once or twice, until lamb is tender, 1 1/2 to 2 hours. Season with salt and pepper.",
        "Peel and quarter potatoes. Cover potatoes with salted cold water by 1 inch in a 4-quart heavy pot, then simmer, uncovered, until very tender, 20 to 25 minutes. Drain in a colander.",
        "Bring cream, milk, and butter to a simmer in same pot over moderate heat, stirring occasionally until butter is melted, then remove from heat and stir in salt and pepper. Force hot potatoes through ricer into hot cream mixture and stir gently to combine. Keep warm, covered.",
        "Preheat broiler.",
        "Make a beurre manié by stirring together remaining 1 1/2 tablespoons butter and remaining 2 tablespoons flour in a small bowl to form a paste. Spoon 1 cup cooking liquid from casserole dish into a small saucepan and bring to a boil. Whisk in beurre manié, then simmer, whisking occasionally, until thickened, about 2 minutes. Gently stir sauce into lamb and vegetables.",
        "Spoon potatoes over lamb and vegetables and spread evenly with a fork, making a pattern with tines. Broil about 3 inches from heat until top is golden, about 3 minutes."
    ],
    "ingredients": [
        "10 oz pearl onions",
        "4 medium leeks (white and pale green parts only), cut into 1/2-inch-thick slices",
        "2 lb boneless lamb shoulder, cut into 1-inch cubes",
        "2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "5 tablespoons all-purpose flour",
        "3 1/2 tablespoons unsalted butter, softened",
        "2 tablespoons chopped garlic",
        "1/2 cup dry white wine",
        "1 1/2 tablespoons tomato paste",
        "1 cup beef broth",
        "1 cup water",
        "2 teaspoons chopped fresh thyme",
        "5 carrots, cut diagonally into 1/3-inch-thick slices",
        "2 medium turnips, peeled and cut into 1/2-inch pieces",
        "2 lb russet (baking) potatoes",
        "1/2 cup heavy cream",
        "1/2 cup milk",
        "3 tablespoons unsalted butter",
        "1 teaspoon salt",
        "1/4 teaspoon black pepper",
        "Special equipment: a wide 3-quart heavy flameproof casserole (about 2 inches deep; not glass); a potato ricer or a food mill fitted with medium disk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Lamb",
        "Potato",
        "Vegetable",
        "Bake",
        "Broil",
        "Fall",
        "Winter",
        "Gourmet"
    ],
    "title": "Shepherd's Pie",
    "url": "http://www.epicurious.com/recipes/food/views/shepherds-pie-107418"
}
