{
    "directions": [
        "Preheat oven to 375 degrees F.",
        "In a medium saucepan, cover potatoes and crushed garlic with enough water to cover by 1-inch. Add some salt and bring to a boil over high heat, then reduce to medium-high and cook until fork tender, about 15 minutes. Drain potatoes, return to pot, and mash together with 3 tablespoons of the butter and the heavy cream. Season with salt and pepper, to taste, and set aside.",
        "In a large pan on medium-high heat, combine 1 tablespoon butter and 1 tablespoon oil. When butter has melted, add beef, Worcestershire sauce, cayenne pepper and salt and pepper, to taste, and cook until meat is brown. Stir in tomato paste and saute for a few minutes. Add stock and bring to a simmer. Season and remove mixture to a bowl. In the same pan, add remaining butter and oil and saute onions until almost tender, then add red bell pepper, zucchini, carrots and paprika. Cook until tender, about 10 minutes. Remove from heat.",
        "To assemble, in a 9 by 12-inch baking dish layer half of beef, pressing down to pack in, then sprinkle the cheese on evenly. Pour the remaining half of the beef over the cheese and press down. Next, add the sauteed vegetables and top with the mashed potatoes, spreading out with a spatula or the back of a spoon to even out and to form decorative peaks and valleys. Sprinkle top with paprika and bake for 30 minutes or until edges on potatoes turn golden brown. Serve with Mushroom Onion Gravy.",
        "In a medium saucepan over medium heat, saute onions and mushrooms in oil until tender and mushrooms release their moisture, about 5 minutes. Add flour and stir to evenly coat. Slowly whisk in wine and then the broth. Simmer until thickened and season with salt and pepper, to taste."
    ],
    "ingredients": [
        "2 pounds russet potatoes, washed, peeled and cut into chunks",
        "1 clove garlic, smashed",
        "Salt",
        "6 tablespoons butter",
        "1/2 cup heavy cream",
        "Freshly ground black pepper",
        "2 tablespoons vegetable oil",
        "1 1/2 pounds ground beef (85 percent lean)",
        "2 teaspoons Worcestershire sauce",
        "1/2 teaspoon cayenne pepper",
        "2 tablespoons tomato paste",
        "1/2 cup low-sodium beef stock",
        "1/2 large onion, finely chopped",
        "1 red bell pepper, julienned",
        "2 zucchini, julienned",
        "2 carrots, peeled and grated",
        "1 teaspoon Hungarian hot paprika, plus more for garnish",
        "4 ounces Havarti cheese, grated",
        "Mushroom Onion Gravy, recipe follows",
        "1/2 large onion, chopped",
        "8 ounces white button mushrooms, sliced",
        "3 tablespoons oil",
        "3 tablespoons all-purpose flour",
        "1 cup red wine",
        "2 cups beef broth",
        "Salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Gravy",
        "Vegetable",
        "Mushroom",
        "Meat"
    ],
    "title": "Shepherd's Pie with Mushroom Onion Gravy",
    "url": "http://www.foodnetwork.com/recipes/sunny-anderson/shepherds-pie-with-mushroom-onion-gravy-recipe"
}
