{
    "directions": [
        "Melt butter in large skillet over medium heat. Add shallots; sauté until beginning to brown, about 6 minutes. Add flour; stir 1 minute. Add Madeira, then braising liquid. Whisk until mixture thickens and boils, about 3 minutes. Stir in beef and vegetables. Season with salt and pepper. Keep warm. DO AHEAD Can be made 1 day ahead. Cool slightly. Cover; chill. Rewarm over medium heat.",
        "Preheat oven to 375°F. Boil parsnips and potatoes in medium saucepan of salted water until tender, 12 minutes. Drain. Return to saucepan. Cook over medium heat until dry, about 1 minute. Add butter and cream; mash until smooth. Stir in 1/3 cup cheese. Season with salt and pepper.",
        "Transfer filling to 8x8x2-inch baking dish. Spread topping over filling. Sprinkle remaining cheese over. Bake until bubbling and top begins to brown, about 30 minutes."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter",
        "1 cup sliced shallots (about 4 large)",
        "2 tablespoons all purpose flour",
        "3 tablespoons Madeira",
        "1 1/3 cups degreased braising liquid from Red Wine Brasato with Glazed Root Vegetables",
        "4 cups 3/4-inch cubes beef reserved from Red Wine Brasato with Glazed Root Vegetables",
        "1 1/2 cups glazed vegetables reserved from Red Wine Brasato with Glazed Root Vegetables",
        "1 pound parsnips, peeled, quartered lengthwise, woody core cut away",
        "3/4 pound russet potatoes, peeled, cut into 1-inch cubes",
        "1 tablespoon butter, room temperature",
        "1/4 cup heavy whipping cream, room temperature",
        "2/3 cup coarsely shredded Gruyère cheese (about 3 ounces), divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Cheese",
        "Dairy",
        "Onion",
        "Potato",
        "Vegetable",
        "Bake",
        "Casserole/Gratin",
        "Parsnip",
        "Fortified Wine",
        "Fall",
        "Winter"
    ],
    "title": "Shepherd's Pie with Parsnip Topping",
    "url": "http://www.epicurious.com/recipes/food/views/shepherds-pie-with-parsnip-topping-237036"
}
