{
    "directions": [
        "Grease a 3-quart 2- to 3-inch-deep gratin dish or casserole with a 1 teaspoon of butter.",
        "In a large skillet, heat 1 tablespoon of the butter over medium heat. Add the onion and saute, stirring frequently, until golden, about 10 to 12 minutes. Add the garlic and thyme and cook for 1 minute more. Add the meat, break it up with a wooden spoon, and cook until the meat loses its red color, about 5 minutes. Add the 1 teaspoon salt, 1/4 teaspoon pepper, and tomato paste and cook for 1 minute more. Add the crushed tomatoes and bay leaf and bring to a simmer. Cover and cook for 20 minutes. Remove the bay leaf and spoon off any excess fat if needed. Stir in the parsley and add salt and pepper to taste.",
        "Heat the remaining 1 tablespoon butter in a skillet over medium-high heat and saute the mushrooms until golden, about 5 minutes. Season with salt and pepper. Set aside.",
        "Preheat the oven to 350 degrees F. Spread the meat mixture over the bottom of the casserole, top with the mushrooms, and then the carrots and turnips. Beat the egg into the potatoes and spread them completely over the vegetables to finish the pie. Bake for 30 to 40 minutes, until heated through.",
        "If desired, sprinkle on the cheese on top and broil the pie under a preheated broiler. Serve immediately.",
        "Put the vegetables in a skillet just large enough to hold them in a single layer. Add enough water so that it comes halfway up their sides along with the butter and sugar. Bring to a boil over high heat, then adjust the heat to maintain a simmer. Cover the vegetables with a round of parchment paper just large enough to fit the inside diameter of the pan, or with a lid set ajar. Simmer the vegetables until tender, about 8 to 10 minutes. Remove the cover and raise the heat to high. Toss the vegetables frequently in the pan, as the liquid evaporates to a shiny smooth glaze. Season with salt and pepper to taste and serve.",
        "Yield: 4 to 6 servings",
        "In a large saucepan, combine the potatoes, 1 teaspoon of the salt, and cold water to cover. Bring to a boil over high heat. Lower the heat to maintain a simmer and cook until fork tender, about 10 minutes. Drain the potatoes and return to the pan. Shake the pan over medium heat for about a minute to dry the potatoes. Transfer the potatoes to a food mill, ricer, or bowl.",
        "Put the milk and butter in the saucepan, and heat over medium-high heat until the milk is hot and the butter melts. Remove pan from the heat. Mash the potatoes through the food mill, ricer, or by hand into the pan. Stir to combine with the milk and butter. Season with salt and pepper to taste and nutmeg if desired. Serve immediately.",
        "Yield: 4 to 6 servings",
        "Copyright 2001 Television Food Network, G.P. All rights reserved."
    ],
    "ingredients": [
        "1 teaspoon plus 2 tablespoons unsalted butter",
        "1 1/2 cups diced onion",
        "2 large cloves garlic, minced",
        "2 teaspoons chopped fresh thyme leaves",
        "2 pounds ground lamb",
        "1 teaspoon kosher salt, plus more as needed",
        "1/4 teaspoon freshly ground black pepper, plus more as needed",
        "3 tablespoons tomato paste",
        "1 cup canned crushed tomatoes",
        "1 bay leaf",
        "3 tablespoons minced flat-leaf parsley leaves",
        "1/2 pound button or cremini mushrooms, trimmed and quartered",
        "3 cups glazed carrots and turnips, recipe follows",
        "1 large egg",
        "4 cups mashed potatoes, recipe follows",
        "1/4 cup grated farmhouse cheddar (optional)",
        "3/4 pound turnips, cut into 1-inch pieces",
        "3/4 pound carrots, cut into 1-inch pieces",
        "2 teaspoons unsalted butter",
        "1/2 teaspoon sugar",
        "Kosher salt and freshly ground black pepper",
        "2 pounds russet potatoes (about 4 medium), peeled and cut into 1-inch pieces",
        "1 teaspoon kosher salt plus more",
        "3/4 cup whole milk",
        "1/4 cup unsalted butter",
        "Freshly ground black pepper",
        "Freshly grated nutmeg (optional)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheesy Potatoes",
        "Cheese",
        "Potato",
        "Vegetable",
        "Skillet Recipes",
        "British",
        "European Recipes",
        "Shepherd's Pie Recipes",
        "Cheddar",
        "Lamb Recipes",
        "Meat",
        "Mushroom",
        "Carrot Recipes",
        "Tomato",
        "Turnip Recipes",
        "Main Dish Recipes",
        "Holiday"
    ],
    "title": "Shepherd's Pie",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/shepherds-pie-recipe"
}
