{
    "directions": [
        "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove the bacon, and reserve the grease. Allow the bacon to cool, then crumble, and set aside with the grease.",
        "Meanwhile, heat 1 tablespoon of clarified butter in a large pot over medium heat. Stir in the onion, green pepper, celery, and garlic. Cook and stir until the onion has softened and turned translucent, about 10 minutes. Pour in the white wine and brandy, and bring to a simmer. Season with the basil, white pepper, cayenne pepper, thyme, and Worcestershire sauce. Add the corn and potatoes, then pour in the chicken stock. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer 10 minutes.",
        "While the soup is simmering, melt 1/2 cup of butter in a small saucepan over medium-low heat. Stir in the flour, and cook, stirring constantly, until the flour has turned the color of peanut butter to make a roux, about 10 minutes.",
        "Stir the roux into the soup, and pour in the heavy cream, half-and-half cream, reserved bacon and grease, and shrimp. Return to a simmer over medium-high heat, and cook until the shrimp are no longer translucent in the center, the potatoes are tender, and the soup has thickened, about 15 minutes. Season to taste with Creole seasoning, and stir in the crab meat to serve."
    ],
    "ingredients": [
        "5 slices bacon",
        "1 tablespoon clarified butter",
        "3/4 cup chopped onion",
        "1/4 cup chopped green bell pepper",
        "1/2 cup chopped celery",
        "1 1/2 teaspoons minced garlic",
        "1/4 cup dry white wine",
        "1 teaspoon brandy",
        "1 1/2 teaspoons dried basil",
        "1 teaspoon ground white pepper",
        "1/4 teaspoon cayenne pepper",
        "1/2 teaspoon dried thyme leaves",
        "2 teaspoons Worcestershire sauce",
        "3 cups fresh corn kernels",
        "4 large potatoes, peeled and diced",
        "1 1/2 quarts chicken stock",
        "1/2 cup butter",
        "1/2 cup all-purpose flour",
        "3 cups heavy cream",
        "1 cup half-and-half cream",
        "1 pound peeled and deveined small shrimp",
        "1 tablespoon Creole seasoning",
        "1 pound fresh lump crabmeat, shell pieces removed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sheryl's Corn and Crab Chowder",
    "url": "http://allrecipes.com/recipe/174755/sheryls-corn-and-crab-chowder/"
}
