{
    "directions": [
        "Preheat oven to 325°F. Butter and flour 10-inch-diameter tube pan with 3 1/2-inch-high sides. Finely grind toasted almonds in processor. Blend in flour and baking powder. Using electric mixer, beat butter and 2/3 cup sugar in large bowl until blended. Beat in almond paste a few pieces at a time. Add vanilla extract and beat until mixture resembles paste. Add 3 whole eggs 1 at a time, beating well after each addition. Beat in 3 egg yolks. Stir in dry ingredients. Using electric mixer fitted with clean dry beaters, beat 3 egg whites in medium bowl to soft peaks. Gradually add remaining 1 tablespoon sugar and beat until stiff but not dry. Fold white into batter in 2 additions. Pour batter into prepared pan (batter will fill pan less than halfway). Bake until tester inserted near center of cake comes out clean, about 45 minutes. Cool cake in pan on rack 1 hour. Pierce top of cake all over with wooden skewer.",
        "Combine cream Sherry, sugar and butter in heavy small saucepan. Stir over low heat until sugar dissolves. Simmer until reduced to 1 cup, about 15 minutes. Mix in almond extract. Let syrup stand until just cool. Brush half of syrup over cake in pan. Let cake stand 1 hour. Turn cake out onto platter. Reheat remaining syrup just until butter melts. Pierce more holes in cake. Brush syrup over cake. Let cake stand 30 minutes. (Can be prepared 1 day ahead. Cover cake and let stand at room temperature.) Cut cake into wedges. Garnish with dollops of sweetened whipped cream and berries and serve."
    ],
    "ingredients": [
        "1 cup toasted whole almonds (about 5 1/4 ounces)",
        "1 cup cake flour",
        "1 1/2 teaspoons baking powder",
        "10 tablespoons (1 1/4 sticks) unsalted butter, room temperature",
        "2/3 cup plus 1 tablespoon sugar",
        "7 ounces almond paste, cut into small pieces",
        "1 1/2 teaspoons vanilla extract",
        "3 large eggs",
        "3 large eggs, separated",
        "1 1/4 cups cream Sherry",
        "1/3 cup sugar",
        "1/4 cup (1/2 stick) butter",
        "1/4 teaspoon almond extract",
        "Lightly sweetened whipped cream",
        "1 1/2-pint basket boysenberries, blackberries or raspberries",
        "1 1-pint basket strawberries, hulled, halved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Berry",
        "Nut",
        "Dessert",
        "Bake",
        "Almond",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sherry-Soaked Almond Cake with Mixed Berries",
    "url": "http://www.epicurious.com/recipes/food/views/sherry-soaked-almond-cake-with-mixed-berries-1896"
}
