{
    "directions": [
        "Bring half-and-half with lemon and orange zests and cinnamon stick just to a boil over moderate heat. Cover and let stand off heat 25 minutes, then reheat to a simmer. Discard zests and cinnamon stick.",
        "Whisk together yolks, sugar, and Sherry in a large bowl until smooth. Gradually whisk in hot milk mixture. Transfer custard to cleaned saucepan and cook over moderately low heat, stirring constantly, until thickened enough to coat back of a wooden spoon and an instant-read thermometer registers 170°F.",
        "Pour custard through a fine sieve into a bowl and cover surface with wax paper to prevent a skin from forming. Chill until thoroughly cold, about 3 hours. Freeze in an ice-cream maker. Transfer to an airtight container and freeze until firm.",
        "Bring figs, Sherry, juice, and honey, covered, to a boil in a small saucepan. Simmer, covered, just until figs are tender, about 40 minutes, then uncover and simmer until liquid is reduced to about 1 cup, about 8 minutes. Cool figs in syrup.",
        "Serve ice cream with honeyed figs and syrup."
    ],
    "ingredients": [
        "3 cups half-and-half",
        "4-inch strip fresh lemon zest",
        "4-inch strip fresh orange zest",
        "1/2 cinnamon stick",
        "8 large egg yolks",
        "1/2 cup sugar",
        "1/4 cup Amontillado Sherry",
        "12 soft (moist) dried Calimyrna figs (10 oz), tough stems removed and figs halved lengthwise",
        "1 cup Amontillado Sherry",
        "1 cup fresh orange juice",
        "6 tablespoons honey",
        "Garnish: candied orange zest"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Fruit",
        "Dessert",
        "Frozen Dessert",
        "Lemon",
        "Orange",
        "Fig",
        "Sherry",
        "Fall",
        "Honey",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sherry Crema Catalana Ice Cream with Honeyed Figs",
    "url": "http://www.epicurious.com/recipes/food/views/sherry-crema-catalana-ice-cream-with-honeyed-figs-103209"
}
