{
    "directions": [
        "In a 12-inch heavy skillet set over moderately low heat, cook onions in butter, stirring occasionally, until softened. Stir in mushrooms and bell peppers and cook over moderate heat, stirring occasionally, until liquid mushrooms give off is evaporated and mixture begins to brown. Add ham and Sherry and cook, stirring, until liquid is evaporated.",
        "In a bowl stir together mushroom mixture, parsley, and bread crumbs. Season with salt and pepper, to taste, and cool, uncovered.",
        "Preheat oven to 400 degrees F.",
        "On a lightly floured surface roll out 1 pastry sheet into a 14 by 10-inch rectangle. Halve rectangle lengthwise with a long sharp knife and spread about half of mushroom filling on 1 half, leaving a 1-inch border all around. Brush edges of mushroom-topped pastry with some egg wash and put remaining pastry half on top of filling. Crimp edges of dough together with fork tines and cut several slits in empanada with small sharp knife. Carefully transfer empanada with 2 spatulas to a large baking sheet, leaving room for second empanada, and brush with some remaining egg wash. Make another empanada in same manner with remaining puff pastry sheet, filling, and egg wash.",
        "Put empanadas in middle of oven and reduce temperature to 375 degrees F. Bake empanadas until golden, about 35 minutes. Empanadas may be made 1 day ahead, cooled completely on a rack, and chilled, wrapped in foil. Reheat empanadas, uncovered, on a baking sheet in a preheated 375 degree F oven until hot, about 6 minutes.",
        "With a serrated knife cut empanadas into 3/4-inch slices.",
        "Wine Suggestions: Dry Manzanilla; Jerez Region Spanish Cava (Sparkling Wine) Montecillo Winery Rioja"
    ],
    "ingredients": [
        "2 medium onions, finely chopped",
        "6 tablespoons unsalted butter",
        "1 1/2 pounds mushrooms, finely chopped",
        "2 small red bell peppers, finely chopped",
        "1 (6-ounce) piece serrano ham or prosciutto, trimmed and chopped fine",
        "1/3 cup cream Sherry",
        "1/2 cup packed fresh parsley leaves, washed, spun dry, and minced",
        "3 tablespoons fine dry bread crumbs",
        "Salt and freshly ground black pepper",
        "1 (17 1/4-ounce) package frozen puff pastry sheets (2 pastry sheets) thawed",
        "Egg wash, made by beating 1 large egg with 1 teaspoon water"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Make Ahead",
        "European Recipes",
        "Spanish",
        "Wine Recipes",
        "Meat",
        "Mushroom",
        "Vegetable",
        "Ham",
        "Appetizer",
        "Recipes for Parties",
        "Sauteing Recipes"
    ],
    "title": "Sherried Mushroom Empanadas",
    "url": "http://www.foodnetwork.com/recipes/sherried-mushroom-empanadas-recipe"
}
