{
    "directions": [
        "Cut off the wing tips, reserving them for another use such as stock if desired, and halve the wings at the joint. In a shallow bowl dredge the wings in the flour, shaking off the excess. In a heavy skillet large enough to hold the wings in one layer without crowding heat the oil and the butter over moderately high heat until the fat is hot but not smoking and in it brown the wings. With a slotted spoon transfer the wings to a plate. In the fat remaining in the skillet cook the onion and the garlic over moderate heat, stirring, until the onion is softened. Add the mushrooms and the thyme and cook the mixture, stirring, until the mushrooms are tender. Add the Sherry and boil the mixture until the liquid is reduced by half. Add the broth, the juice, and salt and pepper to taste, return the wings to the skillet, and simmer the mixture, covered partially, for 20 minutes. Stir in the peas and simmer the mixture, covered, for 5 minutes, or until the peas are tender. Serve the wings and the sauce with the noodles."
    ],
    "ingredients": [
        "2 pounds chicken wings (about 10)",
        "all-purpose flour seasoned with salt and pepper for dredging the wings",
        "2 tablespoons vegetable oil",
        "2 tablespoons unsalted butter",
        "1 large onion, halved lengthwise and sliced thin lengthwise",
        "1 large garlic clove, minced",
        "8 to 10 ounces mushrooms, sliced thin",
        "1/2 teaspoon dried thyme, crumbled",
        "1/2 cup medium-dry Sherry",
        "1 cup chicken broth",
        "1 teaspoon fresh lemon juice, or to taste",
        "a 10-ounce package frozen peas",
        "cooked noodles as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Braise",
        "Sauté",
        "Super Bowl",
        "Pea",
        "Sherry",
        "Gourmet"
    ],
    "title": "Sherried Chicken Wings with Mushrooms and Peas",
    "url": "http://www.epicurious.com/recipes/food/views/sherried-chicken-wings-with-mushrooms-and-peas-11551"
}
