{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Heat the oil in a large skillet over medium-high heat until it begins to smoke. Meanwhile, mix the white and black sesame seeds together with the togarashi powder; set aside. Season the tenderloins with salt, then press into sesame mixture until completely coated. Sear the tenderloins on all sides until golden brown, about 1 minute per side.",
        "Transfer the tenderloins to a baking sheet, and bake in preheated oven until the internal temperature reaches 145 degrees F (63 degrees C), 20 to 25 minutes. When done, remove pork, and allow to rest for five minutes in a warm place.",
        "While pork is roasting, prepare sauce by simmering the shallots, ginger, lime juice, and wine in a small saucepan over medium-high heat until it has reduced to about 2 tablespoons of liquid. Add the cream, and continue to simmer until it has reduced by half. Pour mixture into a blender, along with soy sauce and miso. Blend on low speed for 10 seconds until pureed, then slowly add butter, a few cubes at a time with blender running until it is incorporated. Season to taste with salt, and keep in a warm place until ready to use.",
        "To serve, slice the tenderloin into medallions, and pour warm sauce overtop; serve immediately."
    ],
    "ingredients": [
        "For the Pork:",
        "1/4 cup white sesame seeds",
        "1/4 cup black sesame seeds",
        "2 tablespoons shichimi togarashi (Japanese 7 spice)",
        "4 pounds pork tenderloins",
        "Kosher salt",
        "2 tablespoons canola oil",
        "For the Sauce:",
        "3 shallots, minced",
        "2 tablespoons minced fresh ginger",
        "3/4 cup dry white wine",
        "2 tablespoons fresh lime juice",
        "1 cup whipping cream",
        "2 tablespoons soy sauce",
        "3 tablespoons white miso paste",
        "1 cup cold, unsalted butter, cut into 1-inch cubes",
        "Kosher salt to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shichimi-Seared Pork Tenderloin",
    "url": "http://allrecipes.com/recipe/111328/shichimi-seared-pork-tenderloin/"
}
