{
    "directions": [
        "Combine beef, 2 tablespoons soy sauce, Sherry, garlic, ginger and sesame oil in medium bowl. Cover; chill 1 to 2 hours.",
        "Soak mushrooms in 2 cups hot water until soft. Drain mushrooms, reserving liquid. Cut mushroom caps into quarters; discard stems. Combine broccoli and mushroom liquid in shallow medium saucepan. Cover and boil until broccoli is just crisp-tender, about 3 minutes. Using slotted spoon, transfer broccoli to plate. Boil liquid until reduced to 3 tablespoons, about 4 minutes. Pour liquid into small bowl and cool completely. Whisk cornstarch into mushroom liquid. Set aside.",
        "Heat vegetable oil in heavy large nonstick wok or skillet over high heat until almost smoking. Add mushrooms and stir-fry 1 minute. Add beef mixture and green onions and stir-fry until beef is almost cooked through, about 3 minutes. Toss in broccoli and stir until broccoli is heated through, about 1 minute. Pour in cornstarch mixture and stir until liquid boils and thickens, about 30 seconds. Transfer to platter. Season generously with pepper and serve, passing soy sauce separately."
    ],
    "ingredients": [
        "8 ounces lean well-trimmed top sirloin, cut into 1/2x1/2x2-inch strips",
        "2 tablespoons low-sodium soy sauce",
        "1 tablespoon dry Sherry",
        "2 large garlic cloves, minced",
        "2 teaspoons minced peeled fresh ginger",
        "1/2 teaspoon oriental sesame oil",
        "1 ounce dried shiitake mushrooms",
        "2 cups hot water",
        "8 ounces broccoli florets",
        "1 teaspoon cornstarch",
        "1 teaspoon vegetable oil",
        "2 green onions, cut into 2-inch pieces",
        "Additional low-sodium soy sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Ginger",
        "Mushroom",
        "Marinate",
        "Stir-Fry",
        "Low Fat",
        "Broccoli"
    ],
    "title": "Shiitake-Beef Stir-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/shiitake-beef-stir-fry-104"
}
