{
    "directions": [
        "Melt butter in a 9- to 10-inch nonstick skillet over moderate heat, then cook mushrooms and shallots, stirring occasionally, 3 minutes. Add water and cook, stirring, until liquid is evaporated and mushrooms are tender and golden, about 5 minutes. Stir in tarragon.",
        "While mushrooms are cooking, lightly beat together whole eggs, whites, parmesan, kosher salt, and pepper to taste.",
        "Preheat broiler.",
        "Add egg mixture to mushrooms, then cook over high heat, stirring briskly, until eggs are softly scrambled, 2 to 4 minutes. Reduce heat to low and form frittata into a 6 1/2-inch square with a spatula. Cook over low heat until bottom is set, about 2 minutes.",
        "Place skillet under broiler (wrap nonmetal handles in foil), 5 to 6 inches from heat, and broil until eggs are just firm to the touch and barely golden, 1 to 2 minutes.",
        "Transfer frittata to a cutting board and cool. Trim edges of square, then cut frittata into 24 rectangles.",
        "Cut each prosciutto slice lengthwise into 3 strips. Wrap a prosciutto strip lengthwise around each egg rectangle, then tie a chive around crosswise. Serve at room temperature."
    ],
    "ingredients": [
        "2 teaspoons unsalted butter",
        "8 ounces fresh shiitake mushrooms, stems discarded and caps finely chopped",
        "2 shallots, minced",
        "1/4 cup water",
        "1 1/2 tablespoons finely chopped fresh tarragon",
        "2 whole large eggs",
        "6 large egg whites",
        "1/4 cup finely shredded parmesan",
        "1/2 teaspoon kosher salt",
        "8 thin slices prosciutto",
        "24 thin fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Mushroom",
        "Broil",
        "Sauté",
        "Cocktail Party",
        "Parmesan",
        "Spring",
        "Pan-Fry",
        "Healthy",
        "Prosciutto",
        "Chive",
        "Gourmet"
    ],
    "title": "Shiitake Frittata Squares with Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/shiitake-frittata-squares-with-prosciutto-104878"
}
