{
    "directions": [
        "Preheat oven to 450°F.",
        "In a shallow baking pan drizzle oil over shiitakes and toss to coat. Roast mushrooms, stirring once or twice, 12 to 15 minutes, or until golden. Keep oven at 450°F.",
        "Mince roasted shiitake and in a shallow bowl stir together with bread crumbs and salt and pepper to taste. Have ready in separate shallow bowls seasoned flour and egg.",
        "Working with 1 chicken breast at a time, dredge in flour, shaking off excess, and dip in egg, letting excess drip off. Coat chicken with mushroom mixture, gently knocking off excess, and transfer to a plate. Chicken may be prepared up to this point 2 hours ahead and chilled, uncovered, on a rack.",
        "In a 12-inch non-stick skillet heat oil over moderately high heat oil over moderately high heat until hot but not smoking and sauté chicken until golden, about 1 minute on each side. Transfer chicken with tongs to baking pan and roast in middle of oven 10 minutes, or until just cooked through.",
        "Wipe out skillet and cook shallot in butter over moderately low heat, stirring, until softened. Add shiitake and salt and pepper to taste and sauté over moderately high heat, stirring, until mushrooms are softened and browned lightly. Stir in wine, vinegar, and rosemary and boil until all liquid is evaporated. Add cream and simmer, stirring, until thickened slightly, about 1 minute. Season mixture with salt and pepper.",
        "Serve chicken with creamed mushrooms."
    ],
    "ingredients": [
        "2 teaspoons olive oil",
        "6 ounces fresh shiitake mushrooms, stems discarded and caps chopped coarse (about 1/2 cup)",
        "1/3 cup fine dry bread crumbs",
        "1/3 cup all-purpose flour, seasoned with salt and pepper",
        "1 large egg, beaten lightly",
        "2 whole skinless boneless chicken breasts (about 1 1/2 pounds), halved",
        "2 tablespoons olive oil",
        "1 large shallot, minced (about 1/4 cup)",
        "1 tablespoon unsalted butter",
        "1/2 pound fresh shiitake mushrooms, stems discarded and caps chopped coarse",
        "1/2 cup dry white wine",
        "1 tablespoon white-wine vinegar",
        "1 teaspoon chopped fresh rosemary leaves or a rounded 1/4 teaspoon dried rosemary, crumbled",
        "1/2 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Poultry",
        "Bake",
        "Gourmet"
    ],
    "title": "Shiitake-Crusted Chicken with Creamed Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/shiitake-crusted-chicken-with-creamed-mushrooms-12010"
}
