{
    "directions": [
        "In a bowl toss beef with flour until coated well. In a 10- to 12-inch skillet heat 1 tablespoon oil over moderately high heat and brown beef in batches, transferring beef to plate with slotted spoon or tongs.",
        "Add remaining tablespoon oil to skillet and cook shallots and onion with salt and pepper to taste over moderate heat, stirring, until softened. Add wine and boil until cooking liquid is almost evaporated. Add mushrooms and cook, stirring, until tender and liquid they give off is evaporated. Add broth and simmer 1 minute. Stir in sour cream and Worcestershire sauce. Return beef to skillet and gently simmer, covered, stirring occasionally, 3 to 5 minutes, or until sauce is thickened. Stir in parsley and salt and pepper to taste.",
        "Peel turnips and potato and cut into 1-inch pieces. In a 3- to 4-quart saucepan cover turnips and potato with cold water by 1 inch and simmer, covered, until very tender, 15 to 20 minutes. Drain turnips and potatoes in a colander and in batches force through a ricer or food mill fitted with medium disk into pan. Stir in butter and salt and pepper to taste.",
        "Serve Stroganov with turnip potato purée or noodles."
    ],
    "ingredients": [
        "two 5- to 6-ounce mignons, cut crosswise into 1/4-inch-thick pieces",
        "2 tablespoons all-purpose flour seasoned with salt and pepper",
        "2 tablespoons olive oil",
        "1/3 cup finely chopped shallots (about 2 large)",
        "1/2 cup finely chopped onion",
        "1/2 cup dry red wine",
        "1/4 pound fresh shiitake mushrooms, stems discarded and caps sliced (about 2 cups)",
        "1/4 pound white mushrooms, trimmed and sliced (about 2 cups)",
        "3/4 cup beef broth",
        "1/4 cup sour cream",
        "1 1/2 teaspoons Worcestershire sauce, or to taste",
        "2 tablespoons finely chopped fresh parsley leaves",
        "Accompaniment: turnip potato purée (recipe follows) or buttered egg noodles",
        "1/2 pound white turnips",
        "a 1/2-pound russet (baking) potato",
        "1 1/2 tablespoons unsalted butter, softened"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Onion",
        "Potato",
        "Quick & Easy",
        "Turnip",
        "Red Wine",
        "Winter",
        "Shallot",
        "Gourmet"
    ],
    "title": "Shiitake Beef Stroganov",
    "url": "http://www.epicurious.com/recipes/food/views/shiitake-beef-stroganov-11370"
}
