{
    "directions": [
        "Heat olive oil and 1/2 tablespoon butter in a large skillet over high heat; saute mushrooms with a pinch of salt in the oil and butter until mushrooms release their liquid and the liquid evaporates, 8 to 10 minutes. Make a well in the center of the mushrooms and melt remaining 1/2 tablespoon butter. Saute shallots in hot butter until translucent, 2 to 3 minutes. Mix shallots into mushrooms and continue to cook, stirring constantly, until mushrooms are browned.",
        "Pour brandy into mushrooms; saute until alcohol cooks off, 1 to 2 more minutes. Turn off heat and season with cayenne pepper, salt, and black pepper. Set mushroom mixture aside to cool to room temperature.",
        "Mix Dijon mustard, horseradish, and mayonnaise until smooth in a small bowl.",
        "Slice the top 25% of the bread loaf off to make a lid and set lid aside. Remove the interior bread from the loaf to create a large bread bowl with 1/2-inch-thick sides. Spread Dijon mustard sauce over entire interior of bread bowl and under the lid.",
        "Pound each steak out on a work surface to about the same diameter as the inside of the bread bowl, using a meat mallet. Season steaks generously on both sides with salt and black pepper.",
        "Heat vegetable oil in a large skillet over high heat until oil is nearly smoking. Sear steaks in the hot skillet just until browned and interior is your desired degree of doneness, about 2 minutes per side for medium. Remove steaks to a plate, leaving pan drippings in skillet. Pour water into skillet and dissolve the browned bits of food and steak juices into water. Bring to a boil and cook until drippings are reduced to about 2 tablespoons, about 5 minutes. Pour pan drippings into mushrooms.",
        "Place a browned steak into the bottom of the bread bowl. Spread mushroom filling over the steak, packing it in well. Place slices of pate over mushroom filling if desired. Place the second steak into bread bowl over the pate; place prepared bread lid on the bowl.",
        "Wrap the loaf loosely in plastic wrap and then aluminum foil. Place onto a sheet pan, put another sheet pan on top, and weigh the top sheet pan down with heavy pots, cans of food, or any heavy, stable object. Place sandwich into refrigerator and press for at least 6 hours (preferably overnight).",
        "Unwrap the bread loaf and slice the sandwich into wedges for serving."
    ],
    "ingredients": [
        "Mushrooms:",
        "1 tablespoon olive oil",
        "1 tablespoon butter, divided",
        "1 1/2 pounds button mushrooms, finely chopped",
        "salt",
        "1/2 cup minced shallots",
        "2 tablespoons brandy",
        "1 pinch cayenne pepper, or to taste",
        "salt and freshly ground black pepper to taste",
        "Mustard sauce:",
        "3 tablespoons Dijon mustard",
        "1 tablespoon extra-hot prepared horseradish, or to taste",
        "1 tablespoon mayonnaise",
        "The bread and fillings:",
        "1 (1 1/2) pound round loaf of crusty bread",
        "2 (1 pound) beef rib-eye steaks, well trimmed",
        "salt and freshly ground black pepper to taste",
        "1 tablespoon vegetable oil",
        "1/4 cup water",
        "3 ounces finely textured pate (such as foie gras), sliced (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shooter's Steak Sandwich",
    "url": "http://allrecipes.com/recipe/235856/shooters-steak-sandwich/"
}
