{
    "directions": [
        "Trim the short ribs of excess fat. Thoroughly pat the meat dry with paper towels.",
        "In a large, heavy pot over medium-high heat, warm 1 Tbs. of the olive oil. Add the prosciutto and sauté until lightly browned, 2 to 3 minutes. Using a slotted spoon, transfer the prosciutto to a large platter.",
        "Working in batches, add the short ribs to the pot and brown on all sides, about 12 minutes per batch. Transfer the beef and its juices to the platter.",
        "Add the remaining 2 Tbs. olive oil to the pot and stir in the onion, carrot, garlic, bay leaves, cinnamon stick and cumin. Sauté until the vegetables are softened, lightly colored and aromatic, about 10 minutes. Return the short ribs and prosciutto to the pot, add the 1 tsp. salt and several grinds of pepper and stir well. Stir in the tomato paste, wine and enough broth to just cover the meat. Cover the pot partially with a lid, reduce the heat to low and braise, stirring occasionally, until the meat is tender, about 3 hours.",
        "Remove the pot from the heat, and remove and discard the bay leaves and cinnamon stick. Carefully pour the contents of the pan through a fine-mesh sieve into a bowl. Transfer the short ribs to a cutting board. Using your hands or 2 forks, shred the meat into bite-size pieces. Return the meat to the pot. Let the sauce stand for a few minutes. Using a large spoon, skim the fat off the surface. Taste the sauce and adjust the seasoning with salt and pepper. Pour the sauce over the meat in the pan and rewarm over medium-low heat before serving. Serves 6 to 8.",
        "Adapted from Williams-Sonoma",
        "Cook Good Food",
        "(Weldon Owen, 2014)."
    ],
    "ingredients": [
        "4 lb. (2 kg) bone-in beef short ribs",
        "3 Tbs. olive oil",
        "2 oz. (60 g) prosciutto, cut into narrow strips",
        "1 large yellow onion, chopped",
        "1 carrot, peeled and chopped",
        "1 large garlic clove, minced",
        "2 bay leaves",
        "1 cinnamon stick",
        "1 tsp. ground cumin",
        "1 tsp. kosher salt, plus more, to taste",
        "Freshly ground pepper, to taste",
        "3 Tbs. tomato paste",
        "1/2 cup (4 fl. oz./125 ml) dry red wine",
        "3 1/2 cups (28 fl. oz./875 ml) beef broth, or as needed"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Short Rib Ragù",
    "url": "http://www.williams-sonoma.com/recipe/short-rib-ragu.html"
}
