{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "In the bowl of an electric mixer fitted with a paddle attachment, mix together the butter and 1 cup of sugar until they are just combined. Add the vanilla. In a medium bowl, sift together the flour and salt, then add them to the butter-and-sugar mixture. Mix on low speed until the dough starts to come together. Dump onto a surface dusted with flour and shape into a flat disk. Wrap in plastic and chill for 30 minutes.",
        "Roll the dough 1/2-inch thick and cut with a 3 by 1-inch finger-shaped cutter. Place the cookies on an ungreased baking sheet and sprinkle with sugar. Bake for 20 to 25 minutes, until the edges begin to brown. Allow to cool to room temperature.",
        "When the cookies are cool, place them on a baking sheet lined with parchment paper. Put 3 ounces of the chocolate in a glass bowl and microwave on high power for 30 seconds. (Don't trust your microwave timer; time it with your watch.) Stir with a wooden spoon. Continue to heat and stir in 30-second increments until the chocolate is just melted. Add the remaining chocolate and allow it to sit at room temperature, stirring often, until it's completely smooth. Stir vigorously until the chocolate is smooth and slightly cooled; stirring makes it glossier.",
        "Drizzle 1/2 of each cookie with just enough chocolate to coat it."
    ],
    "ingredients": [
        "3/4 pound unsalted butter, at room temperature",
        "1 cup sugar, plus extra for sprinkling",
        "1 teaspoon pure vanilla extract",
        "3 1/2 cups all-purpose flour",
        "1/4 teaspoon salt",
        "6 to 7 ounces very good semisweet chocolate, finely chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Baking",
        "Sugar Cookie",
        "Shortbread Cookie",
        "Cookie",
        "Chocolate",
        "Sugar"
    ],
    "title": "Shortbread Cookies",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/shortbread-cookies-recipe"
}
