{
    "directions": [
        "Season the short ribs with salt and pepper and refrigerate for at least 6 hours. Remove from the refrigerator, bring to room temperature, and season again with salt and pepper.",
        "Preheat an oven to 350°F (180°C).",
        "In a large sauté pan over high heat, warm the olive oil until very hot. Sear the short ribs until browned on all sides, 6 to 8 minutes. Transfer to a large, heavy ovenproof pot.",
        "Reduce the heat under the sauté pan to medium, add the onion, garlic, celery and carrot and sauté for 5 minutes. Add the wine and bay leaves, increase the heat to high and boil until the liquid is reduced by half, 10 to 12 minutes. Add the broth and bring to a boil. Pour the contents of the sauté pan into the pot. Cover tightly, transfer to the oven and cook for 2 1/2 hours.",
        "Remove the short ribs from the pot. When they are cool enough to handle, remove the meat from the bones and shred into bite-size pieces. Strain the braising liquid and reserve 1 1/4 cups (10 fl. oz./310 ml); discard the vegetables left in the strainer.",
        "Return the shredded meat and the reserved braising liquid to the pot. Stir in the beans and the tomatoes with their juices. Set the pot over medium-high heat and bring to a boil. Stir in the parsley and season with salt and pepper.",
        "To make the paprika sour cream, in a bowl, stir together the sour cream, lemon juice, paprika and salt. Serve the stew immediately, topped with a generous dollop of the paprika sour cream. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Soup of the Day,",
        "by Kate McMillan (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "3 lb. (1.5 kg) beef short ribs, halved",
        "Salt and freshly ground pepper, to taste",
        "2 Tbs. olive oil",
        "1 yellow onion, chopped",
        "6 garlic cloves, minced",
        "2 celery stalks, chopped",
        "1 carrot, peeled and chopped",
        "3 cups (24 fl. oz./750 ml) dry red wine",
        "2 bay leaves",
        "4 1/2 cups (36 fl. oz./1.1 l) beef broth",
        "1 can (15 oz./470 g) cannellini or other white beans, drained",
        "1 can (14 1/2 oz./455 g) diced tomatoes with juices",
        "1/4 cup (1/3 oz./10 g) chopped fresh flat-leaf parsley",
        "2/3 cup (5 1/2 oz./170 g) sour cream",
        "1 tsp. fresh lemon juice",
        "1/2 tsp. smoked paprika",
        "1/4 tsp. salt"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Short Rib Stew with Paprika Sour Cream",
    "url": "http://www.williams-sonoma.com/recipe/short-rib-stew.html"
}
