{
    "directions": [
        "Put the short ribs in a resealable plastic bag. In a bowl, combine half of the green onions with the garlic, ginger, tamari, honey, lime juice, sesame oil and 1/4 cup of the water. Pour the marinade into a large sealable plastic bag, coating the meat evenly. Seal the bag and refrigerate for at least 3 hours or up to 12 hours.",
        "One hour before cooking, remove the ribs from the marinade and pat dry. Strain the marinade into a small saucepan and add the remaining 2 cups water. Set over high heat and bring to a boil. Remove from the heat.",
        "Preheat a Cuisinart multicooker on the brown/sauté setting to 450°F according to the manufacturer’s instructions. Warm the vegetable oil in the multicooker. Add the short ribs and brown on all sides, about 5 minutes. Pour in the marinade. Set the multicooker on the slow cook-high setting, cover and cook for 3 hours. Add the carrots, cover and cook for 1 hour more. The meat should be very tender and falling off the bone; if not, continue cooking until tender. Turn off the multicooker and let the meat and sauce cool for 1 hour.",
        "Using a slotted spoon, transfer the ribs to a cutting board; if desired, remove the bones. Skim the fat off the sauce. Set the multicooker on the brown/sauté setting to 350°F and bring the sauce to a simmer. Stir in the demi-glace and simmer until the sauce is thickened, 10 to 12 minutes. Return the meat to the multicooker and warm through.",
        "Transfer the ribs, carrots and sauce to individual bowls and garnish with the remaining green onions. Serve immediately with steamed rice. Serves 4.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "3 lb. bone-in beef short ribs, each about 3 inches long",
        "1 bunch green onions, white and light green portions, chopped",
        "5 garlic cloves, minced",
        "1/2 oz. fresh ginger, peeled and minced",
        "1/2 cup tamari or soy sauce",
        "1/4 cup honey",
        "Juice of 1 lime",
        "1 tsp. sesame oil",
        "2 1/4 cups water",
        "1 Tbs. vegetable oil",
        "2 carrots, peeled and cut into 1-inch pieces",
        "1 Tbs. beef demi-glace",
        "Steamed rice for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Short Ribs Braised with Ginger and Soy",
    "url": "http://www.williams-sonoma.com/recipe/short-ribs-braised-ginger-soy.html"
}
