{
    "directions": [
        "Place beans in large saucepan. Add enough cold water to cover by 3 inches. Bring to boil. Remove from heat. Cover and soak beans 1 hour. Drain.",
        "Return beans to pan. Add enough cold water to cover beans by 3 inches. Bring to boil. Cover and simmer over medium-low heat until beans are almost tender, about 30 minutes. Drain.",
        "Meanwhile, preheat oven to 300°F. Cook bacon in heavy large ovenproof pot over medium heat until crisp, about 8 minutes. Using slotted spoon, transfer bacon to large bowl. Discard all but 2 tablespoons drippings from pot. Increase heat to medium-high. Working in batches, cook pork shoulder and kielbasa in pot until brown, about 8 minutes per batch. Using slotted spoon, transfer pork and kielbasa to bowl with bacon.",
        "Add onions, celery and carrots to pot. Sauté until vegetables are tender, about 5 minutes. Add garlic and thyme; sauté 1 minute. Mix in broth, tomatoes with juices and tomato paste; bring to boil. Stir in meats from bowl, then drained beans. Return to boil. Cover pot. Transfer to oven; bake until pork is tender, about 1 hour. Maintain oven temperature.",
        "Using slotted spoon, transfer 1 cup beans and vegetables from pot to processor and purée. Return purée to pot. Stir in wine. Season with salt and pepper. (Can be made 1 day ahead. Refrigerate uncovered until cool, then cover and refrigerate. Bring cassoulet to simmer before continuing.)",
        "Smooth top of cassoulet. Mix breadcrumbs, Parmesan and oil in bowl. Sprinkle half of crumb mixture over cassoulet. Arrange bell pepper atop crumb mixture. Sprinkle with remaining crumb mixture. Bake cassoulet uncovered until pork and beans are very tender and topping is golden and crisp, about 45 minutes.",
        "Garnish cassoulet with parsley."
    ],
    "ingredients": [
        "1 pound dried Great Northern beans",
        "5 bacon slices, coarsely chopped",
        "1 3 1/2-pound boneless pork shoulder, trimmed of excess fat, cut into 1- to 1 1/2-inch pieces",
        "1 pound kielbasa, cut into 3/4-inch-thick slices",
        "2 1/2 cups chopped onions",
        "1 cup sliced celery",
        "1 cup sliced peeled carrots",
        "4 large garlic cloves, minced",
        "1 tablespoon dried thyme",
        "2 cups canned low-salt chicken broth",
        "1 14 1/2-ounce can diced tomatoes in juice",
        "2 tablespoons tomato paste",
        "1/2 cup dry white wine",
        "2 cups coarse fresh breadcrumbs made from French bread",
        "1/2 cup grated Parmesan cheese",
        "2 tablespoons olive oil",
        "1 small red bell pepper, cut into 1/4-inch-thick rounds",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Bean",
        "Pork",
        "Tomato",
        "Bake",
        "Sauté",
        "Casserole/Gratin",
        "Bacon",
        "Sausage",
        "Winter",
        "Potluck"
    ],
    "title": "Shortcut Pork Cassoulet",
    "url": "http://www.epicurious.com/recipes/food/views/shortcut-pork-cassoulet-5880"
}
