{
    "directions": [
        "Preheat oven to 325°F. Heat 2 tablespoons oil in heavy large ovenproof pot over medium-high heat. Sprinkle ribs with salt and pepper. Working in batches, add ribs to pot and brown well, turning often, about 8 minutes per batch. Using tongs, transfer ribs to large bowl.",
        "Pour off all but 2 tablespoons drippings from pot or add oil as necessary to measure 2 tablespoons. Add onion, chopped carrot, and celery and cook over medium-low heat until vegetables are soft, stirring frequently, about 10 minutes. Add garlic, flour, and herbes de Provence; stir 1 minute. Add wine and 2 cups broth; bring to boil over high heat, scraping up browned bits. Add tomatoes with juices and bay leaf. Return ribs and any accumulated juices to pot. If necessary, add enough water to pot to barely cover ribs. Bring to boil.",
        "Cover pot tightly and transfer to oven. Bake until ribs are very tender, stirring occasionally, about 2 hours 15 minutes. (Can be made 1 day ahead. Cool slightly, then refrigerate uncovered until cold. Cover and keep refrigerated. Bring to simmer before continuing.)",
        "Add remaining 1/2 cup broth, peeled baby carrots, and Niçois olives to pot; press carrots gently to submerge. Cover, return to oven and continue cooking at 350°F until carrots are tender, about 15 minutes. Discard bay leaf. Transfer short ribs and carrots to platter. Tent with foil to keep warm. If necessary, boil sauce to thicken slightly. Season to taste with salt and pepper. Pour sauce over short ribs. Sprinkle with parsley. Serve with Crème Fraîche Mashed Potatoes",
        "A dried herb mixture available at specialty foods stores and in the spice section of some markets. A mix of dried thyme, basil, savory, and fennel seeds can be substituted.",
        "** Small brine-cured black olives; available at Italian markets, specialty foods stores, and some supermarkets."
    ],
    "ingredients": [
        "2 tablespoons (or more) olive oil",
        "6 pounds meaty beef short ribs",
        "1 large onion, finely chopped",
        "1 medium carrot, finely chopped",
        "1 celery stalk, finely chopped",
        "12 whole garlic cloves, peeled",
        "2 tablespoons all purpose flour",
        "1 tablespoon dried herbes de Provence*",
        "2 cups red Zinfandel",
        "2 1/2 cups canned beef broth",
        "1 14 1/2-ounce can diced tomatoes in juice",
        "1 bay leaf",
        "1/2 cup (about) water",
        "24 baby carrots, peeled",
        "1/2 cup Niçois olives,** pitted",
        "3 tablespoons chopped fresh parsley",
        "Crème Fraîche Mashed Potatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Beef",
        "Potato",
        "Vegetable",
        "Bake",
        "Braise",
        "Valentine's Day",
        "Dinner",
        "Meat",
        "Beef Rib",
        "Carrot",
        "Fall",
        "Winter",
        "Anniversary",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Short Ribs Provençale with Crème Fraîche Mashed Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/short-ribs-provencale-with-creme-fraiche-mashed-potatoes-106096"
}
