{
    "directions": [
        "Preheat oven to 325 degrees F. In a large ovenproof saute pan or roasting pan, heat the olive oil over medium-high heat.",
        "Sprinkle the short ribs on all sides with the salt, pepper, garlic salt and seasoned salt. Pat the seasonings into the meat. Dredge the short ribs in the flour and pat off any excess flour.",
        "Place the short ribs in the pan and sear until browned on both sides, 2 to 3 minutes. Add the garlic, carrots, celery and onions and saute for 3 minutes. Add the wine and simmer for 5 minutes. Stir in the chicken stock, veal stock, water, undrained tomatoes and Worcestershire sauce. Bring to a simmer. Cover and place in the oven. Roast for 2 hours. Then add the potatoes, cover and roast for an additional 30 minutes.",
        "Be sure to occasionally check the liquid in the pan to make sure there is enough to keep the meat moist and simmering. Add more stock if necessary.",
        "Serve over Three Cheese Polenta.",
        "In a large saucepan combine water, polenta and 1/2 teaspoon salt. Stir over high heat until mixture boils; reduce heat to medium-low. Simmer polenta for 25 to 30 minutes or until smooth, whisking occasionally to ensure a smooth consistency. Remove from heat and stir in the cheeses and butter. Add salt and pepper to taste. Set aside and keep warm."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "Four 8-ounce boneless beef short ribs",
        "1/2 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/2 teaspoon garlic salt",
        "1/2 teaspoon seasoned salt",
        "1 cup all-purpose flour",
        "6 cloves garlic, smashed",
        "2 carrots, peeled and diced small",
        "2 stalks celery, diced small",
        "1 Vidalia onion, diced small",
        "1 cup red wine",
        "2 cups chicken stock",
        "2 cups veal stock or beef stock",
        "2 cups water",
        "One 14.5-ounce can peeled plum tomatoes",
        "2 tablespoons Worcestershire sauce",
        "6 medium red potatoes, diced small, with skin on",
        "Three Cheese Polenta, recipe follows",
        "4 1/2 cups water",
        "1 cup finely ground polenta",
        "Salt",
        "1/4 cup shredded Gruyere cheese",
        "1/4 cup shredded Parmesan cheese",
        "1/4 cup mild Cheddar cheese",
        "1/4 cup unsalted butter",
        "Black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Short Ribs",
        "Polenta Recipes",
        "Beef",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Short Ribs of Beef",
    "url": "http://www.foodnetwork.com/recipes/short-ribs-of-beef-recipe"
}
