{
    "directions": [
        "Cover short ribs with cold water and soak, chilled, at least 2 hours.",
        "Drain ribs and transfer to an 8-to 10-quart heavy pot with cold water (8 cups). Simmer ribs, partially covered, skimming any foam, 2 hours. Chill ribs in liquid (covered once cool) until fat solidifies, about 4 hours.",
        "Meanwhile, soak mushrooms in hot water (4 cups), turning occasionally, until softened, about 1 hour. Squeeze excess liquid from mushrooms and reserve 2 cups soaking liquid; cut off and discard mushroom stems, then halve caps.",
        "Discard fat from ribs and return to a simmer. Peel potatoes and cut into 1-inch pieces, then add to ribs with radish, carrots, garlic, dates (if using), soy sauce, fish sauce, molasses, red-pepper paste, mushrooms, reserved mushroom-soaking liquid, and water (if necessary) to barely cover meat and vegetables with liquid. Simmer, partially covered, stirring occasionally, 30 minutes.",
        "Stir in onion and scallions and simmer, covered, stirring occasionally, until meat is very tender and vegetables are tender, 15 to 20 minutes. Skim off any fat, then stir in sesame oil. Stir before serving and serve additional red-pepper paste on the side."
    ],
    "ingredients": [
        "6 pounds beef short ribs (with bone; preferably cut into 2-inch pieces by butcher)",
        "8 cups cold water plus 4 cups hot water",
        "12 large dried Chinese black mushrooms",
        "1 pound boiling potatoes",
        "1 (3/4-pound) Korean radish or daikon, peeled and cut into 1-inch chunks",
        "4 large carrots, sliced 1/2 inch thick",
        "12 garlic cloves, smashed",
        "1/2 cup dried red dates (optional)",
        "1/2 cup soy sauce",
        "2 tablespoons Asian fish sauce",
        "2 tablespoons molasses (not robust or blackstrap)",
        "1 tablespoon Korean hot red-pepper paste plus additional for serving",
        "1 large onion, cut into 1-inch wedges",
        "1 bunch scallions, cut into 2-inch pieces",
        "3 tablespoons Asian sesame oil",
        "Accompaniment: brown rice and barley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Potato",
        "Dinner",
        "Date",
        "Radish",
        "Winter",
        "Chill",
        "Potluck",
        "Simmer",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Short Rib and Vegetable Stew",
    "url": "http://www.epicurious.com/recipes/food/views/short-rib-and-vegetable-stew-351895"
}
