{
    "directions": [
        "Generously season the short ribs with salt and pepper. Dredge the ribs in flour and shake off the excess.",
        "In the stovetop-safe insert of a slow cooker over medium-high heat, cook the pancetta until crispy, 3 to 5 minutes. Transfer to a paper towel-lined plate.",
        "Working in batches, add the ribs to the insert and brown on all sides, about 10 minutes total. Transfer to a plate.",
        "Pour off the fat from the insert. Set the insert over medium heat and warm the olive oil. Add the onion, carrot and celery and sauté until soft, about 10 minutes. Add the garlic and tomato paste and cook for about 1 minute. Add 1 cup of the wine and stir to scrape up the browned bits. Add the remaining wine and the demi-glace and bring to a simmer. Add the short ribs, the pancetta, rosemary and cheese rind. Set the insert on the slow-cooker base. Cover and cook on high for 4 hours, stirring occasionally.",
        "Skim the fat off the cooking liquid, and discard the rosemary and cheese rind. Transfer the ribs to a serving bowl and cover with aluminum foil. Pass the vegetables and cooking liquid through a food mill into a fry pan. Simmer over medium heat until reduced by one-third, about 10 minutes. Adjust the seasonings with salt. Serve the ribs and sauce over polenta. Serves 4 to 5."
    ],
    "ingredients": [
        "3 lb. beef short ribs",
        "Salt and freshly ground pepper, to taste",
        "1/2 cup all-purpose flour",
        "3 oz. pancetta, cut into 1/2-inch pieces",
        "2 Tbs. olive oil",
        "1 yellow onion, diced",
        "1 carrot, peeled and diced",
        "2 celery stalks, diced",
        "3 garlic cloves, chopped",
        "1 1/2 Tbs. tomato paste",
        "1 bottle (750ml) Barolo or other full-bodied red wine",
        "1 Tbs. veal or beef demi-glace",
        "1 fresh rosemary sprig",
        "1-inch piece Parmigiano-Reggiano cheese rind",
        "Polenta for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Short Ribs Braised with Barolo",
    "url": "http://www.williams-sonoma.com/recipe/short-ribs-braised-with-barolo.html"
}
