{
    "directions": [
        "Preheat oven to 350°F.",
        "Soak ancho chiles in boiling-hot water until softened, about 20 minutes, then drain in a colander set over a bowl. Taste soaking liquid: It will be a little bitter, but if unpleasantly so, discard it; otherwise, reserve for braising. Transfer ancho chiles to a blender and purée with onion, garlic, chipotles with sauce, maple syrup, lime juice, and 1 teaspoon salt.",
        "Pat ribs dry and sprinkle with pepper and remaining 2 teaspoons salt. Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown ribs in 3 batches, turning occasionally, about 5 minutes per batch. Transfer as browned to a roasting pan just large enough to hold ribs in 1 layer.",
        "Carefully add chile purée to fat remaining in skillet (use caution, since it will splatter and steam) and cook over moderately low heat, stirring frequently, 5 minutes. Add reserved chile soaking liquid (or 1 1/2 cups water) and coffee and bring to a boil, then pour over ribs (liquid should come about halfway up sides of meat).",
        "Cover roasting pan tightly with foil and braise ribs in middle of oven until very tender, 3 to 3 1/2 hours. Skim fat from pan juices and serve with ribs."
    ],
    "ingredients": [
        "4 dried ancho chiles, stemmed, seeded, and ribs discarded",
        "2 cups boiling-hot water",
        "1 medium onion, quartered",
        "3 garlic cloves, coarsely chopped",
        "2 tablespoons finely chopped canned chipotle chilesin adobo plus 2 teaspoons adobo sauce",
        "2 tablespoons pure maple syrup",
        "1 tablespoon fresh lime juice",
        "3 teaspoons salt",
        "6 lb beef short ribs orflanken",
        "1 teaspoon black pepper",
        "1 tablespoon vegetable oil",
        "1/2 cup brewed coffee"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Pepper",
        "Braise",
        "Beef Rib",
        "Hot Pepper",
        "Winter",
        "Maple Syrup",
        "Gourmet"
    ],
    "title": "Short Ribs Braised in Coffee Ancho Chile Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/short-ribs-braised-in-coffee-ancho-chile-sauce-107596"
}
