{
    "directions": [
        "Chop onion. In a 2-quart heavy saucepan cook onion and chicken legs in butter over moderate heat, stirring, 5 minutes. Drain tomatoes and measure 1 cup packed, reserving remainder for another use. Stir tomatoes into chicken mixture with water, cayenne to taste, and cumin and simmer, covered, 1 hour. Working over pan, pull meat off bones with tongs, returning it to pan, and discard bones. Simmer chicken mixture, uncovered, until most liquid is evaporated, about 20 minutes. Stir in salt and cool chicken mixture. Chicken mixture may be made 1 day ahead and cooled completely before being chilled, covered. Bring mixture to room temperature before proceeding.",
        "Halve cucumber lengthwise and crosswise and seed. Cut pieces lengthwise into very thin strips. In a bowl toss cucumber with 1 tablespoon lime juice and season with salt and pepper. Halve, peel, and pit avocado. Cut avocado into 1/4-inch-thick slices. In a small bowl toss avocado with remaining lime juice and season with salt and pepper.",
        "Cut 1 inch off 1 edge of each tortilla. On a work surface arrange 1 tortilla with cut edge farthest from you and smear a small piece of avocado lengthwise along cut edge of tortilla (this will help the \"wrap\" hold together). Spread about one fourth chicken mixture across lower fourth of tortilla about 1 inch from bottom. Top chicken mixture with 1/2 cup cilantro sprigs. Top cilantro with 4 or 5 avocado slices and top avocado with about one fourth cucumber. Beginning with bottom edge, tightly roll up tortilla and arrange seam side down on work surface. Make 3 more wraps with remaining tortillas, chicken mixture, cilantro, avocado, and cucumber. Wraps may be made 6 hours ahead and chilled, individually wrapped in plastic wrap. Cut wraps on a slight diagonal into *-inch-thick slices and serve chilled or at room temperature."
    ],
    "ingredients": [
        "1 small onion",
        "2 skinless whole chicken legs (about 1 pound)",
        "2 tablespoons unsalted butter",
        "a 14- to 16-ounce can whole tomatoes",
        "1/2 cup water",
        "1/4 to 1/2 teaspoon cayenne",
        "1 teaspoon ground cumin",
        "3/4 teaspoon salt",
        "1 English cucumber",
        "2 tablespoons fresh lime juice, or to taste",
        "1 firm-ripe California avocado",
        "four 12-inch flour tortillas",
        "2 cups fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Cocktail Party",
        "Avocado",
        "Cucumber",
        "Spring",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Shredded-Chicken Wraps with Avocado, Cucumber, and Cilantro",
    "url": "http://www.epicurious.com/recipes/food/views/shredded-chicken-wraps-with-avocado-cucumber-and-cilantro-101187"
}
