{
    "directions": [
        "Mix chiles, garlic, onion, and vinegar in a small bowl; season with salt.",
        "Thinly slice sweet potatoes and carrots into 3x1/4\" planks (use a mandoline if you have one), then slice lengthwise into matchsticks. Place in a medium bowl and toss with a few pinches of salt. Let sit until slightly softened, about 30 minutes. Rinse off salt and pat dry.",
        "Pour oil into a large heavy pot to a depth of at least 2\" but with at least a 4\" headspace, as oil will bubble aggressively when you add fritters. Fit pot with thermometer; heat oil over medium-high until thermometer registers 330°F–340°F.",
        "Meanwhile, combine club soda and fish sauce in a large measuring glass. Add cornstarch and whisk until smooth. Place half of sweet potato and carrot mixture, shrimp, and cilantro in a medium bowl and toss to combine. Pour in half of cornstarch slurry and toss to coat (slurry should cling to shrimp and vegetables in a light, even layer).",
        "Using a slotted spoon, carefully lower half of slurry-coated vegetable and shrimp mixture into oil. Once bubbling subsides, mixture will disperse across the surface of oil. Using a spider or a clean slotted spoon, corral vegetables and shrimp by gathering them against the side of the pot until they form a large mound that clings together and can be turned as a single unit. Fry, turning occasionally and increasing heat as needed to keep oil temperature between 330°F and 340°F, until fritter is golden brown and crisp around edges, about 4 minutes. Transfer to a wire rack set inside a rimmed baking sheet. Repeat process with remaining slurry-coated vegetable and shrimp mixture, adding a splash or so of club soda if needed to loosen batter (it should look like a glossy coating), to make another fritter.",
        "Repeat entire process with remaining sweet potato and carrot mixture, cilantro, shrimp, and cornstarch slurry to make 2 more fritters.",
        "Season fritters lightly with salt. Serve with chile vinegar alongside for dipping.",
        "Chile vinegar can be made 3 days ahead. Cover and chill.\nVegetables can be salted, drained, and patted dry 1 day ahead. Cover and chill."
    ],
    "ingredients": [
        "3 Thai chiles, thinly sliced",
        "1 garlic clove, finely chopped",
        "2 tablespoons chopped red onion",
        "1/4 cup sugarcane vinegar or distilled white vinegar",
        "Kosher salt",
        "1 medium sweet potato, peeled",
        "4 medium carrots, peeled",
        "Kosher salt",
        "8 cups (or more) vegetable oil",
        "3/4 cup (or more) club soda",
        "1 teaspoon fish sauce",
        "1 1/4 cups cornstarch",
        "4 ounces small or medium shrimp, peeled, deveined",
        "1 cup cilantro leaves with tender stems",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Philippines",
        "Appetizer",
        "Sweet Potato/Yam",
        "Carrot",
        "Vinegar",
        "Cilantro",
        "Shrimp",
        "Deep-Fry",
        "Fry"
    ],
    "title": "Shredded Sweet Potato and Carrot Fritters (Ukoy)",
    "url": "http://www.epicurious.com/recipes/food/views/shredded-sweet-potato-and-carrot-fritters-ukoy"
}
