{
    "directions": [
        "Remove frozen skin from plastic bag and cut it into roughly 3/4-inch pieces (about 1 1/4 cups).",
        "Combine the skin, 1 cup water, and 1/4 teaspoon salt in a 2- to 3-quart heavy saucepan and briskly simmer mixture, stirring occasionally (the skin tends to stick to the bottom), until water is evaporated and cracklings begin to fry in their own fat (you'll hear the sizzling), about 15 minutes.",
        "Reduce heat and continue to fry the cracklings slowly, stirring frequently, until deep golden and crisp, about 10 to 20 minutes longer.",
        "Using a slotted spoon, transfer them to paper towels to drain. Taste and season with salt, if necessary. Reserve or discard fat remaining in pan as you wish (see Cooks' Notes).",
        "While cracklings are cooking, cut the center rib from the kale and discard, then thinly slice the leaves crosswise.",
        "Whisk together lemon juice, mustard, and 1/4 teaspoon salt in a large bowl. Add the oil in a stream, whisking, and whisk dressing until it is emulsified.",
        "Add kale and toss to coat with dressing.",
        "Sprinkle cracklings over salad and grind pepper to taste over it. Toss again just before serving."
    ],
    "ingredients": [
        "Turkey skin from 2 to 3 pounds each of turkey thighs and drumsticks, frozen in as thin a mass as possible (see Cooks' Notes)",
        "1 cup water",
        "Salt",
        "1 pound kale, preferably lacinato (also called Tuscan or dinosaur kale)",
        "1 tablespoon fresh lemon juice",
        "1/2 teaspoon Dijon mustard",
        "3 tablespoons olive oil",
        "freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "turkey",
        "Appetizer",
        "Side",
        "Thanksgiving",
        "Kale",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Shredded Kale Salad with Turkey Skin Cracklings",
    "url": "http://www.epicurious.com/recipes/food/views/shredded-kale-salad-with-turkey-skin-cracklings-369376"
}
