{
    "directions": [
        "Fill a large pot with 12 cups water; stir in 6 Tbsp. salt. Add beef, onion, garlic, peppercorns, cumin, and cloves. Bring to a simmer and cook, partially covered, until beef shreds easily with a fork, 1 1/2–2 hours. Drain, then transfer to a large bowl and let cool. Using 2 forks or your fingers, coarsely shred beef. Season with salt.",
        "Add onion, lime juice, pineapple juice, and oregano to beef mixture and mix well. Season with salt. Let sit at least 1 hour at room temperature or chill up to 1 day. Stir in radishes, chiles, cilantro, and chives just before using.",
        "If frying tortillas, fit a large skillet with candy or deep-fry thermometer; pour in oil to measure 1\". Heat over medium-high until thermometer registers 375°F. Fry tortillas in batches until crispy, turning every 30 seconds, about 2 minutes total. Drain on paper towel-lined baking sheets and season with salt.",
        "Spread 1 Tbsp. Creamy Black Bean Spread on a tostada shell. Top with 1/4 cup beef salad, then lettuce, Quick Pickled Onions, radishes, avocado, crema, queso fresco, and salsa. Repeat with remaining tostada shells. Serve at room temperature.",
        "Beef salad can be chilled for up to 1 day. Bring to room temperature and stir in radishes, chiles, cilantro, and chives just before using."
    ],
    "ingredients": [
        "6 tablespoons kosher salt, plus more to taste",
        "1 (2-pound) beef chuck roast",
        "1 medium white onion, peeled, quartered",
        "5 garlic cloves, peeled",
        "1 tablespoon black peppercorns",
        "1 tablespoon cumin seeds",
        "1/2 teaspoon whole cloves",
        "1 medium white onion, diced, briefly rinsed in a colander, patted dry",
        "1/2 cup fresh lime juice",
        "1/2 cup pineapple juice",
        "1 teaspoon dried oregano, crushed",
        "Kosher salt",
        "8 large radishes, cut into thin matchsticks",
        "6 serrano chiles (or 3–4 jalapeños), stemmed, seeded, deveined",
        "1/2 cup coarsely chopped fresh cilantro",
        "1/4 cup coarsely chopped fresh chives",
        "16 small corn tortillas or store-bought crispy tostada shells",
        "Vegetable oil (for frying; if needed)",
        "Kosher salt (if needed)",
        "1 1/2 cups Creamy Black Bean Spread",
        "Shredded iceberg lettuce, Quick Pickled Onions , thinly sliced radishes, sliced avocado, crema (Mexican salted cream) or sour cream, queso fresco, red chile or tomato salsa (for serving)",
        "A candy or deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Healthy",
        "Tortillas",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Shredded Beef Tostadas with Chiles and Lime",
    "url": "http://www.epicurious.com/recipes/food/views/shredded-beef-tostadas-with-chiles-and-lime-56389831"
}
