{
    "directions": [
        "1. Combine the pork, egg white, cornstarch, salt, and 1 tablespoon of water in a medium bowl. Cover, and refrigerate for 30 minutes.",
        "2. Heat a large wok over high heat. Add enough vegetable oil to come about 1 inch up the sides of the wok, and heat it to 325° F. Add the pork and stir gently until it turns light brown, about 40 seconds. Using a wide wire-mesh strainer, transfer the pork to a colander to drain. Discard all but 4 tablespoons of oil from the wok.",
        "3. To start the sauce, mix the vinegar, soy sauce, sugar, and rice wine in a small bowl and set it aside. Dissolve the cornstarch in 3 tablespoons cold water, and set it aside.",
        "4. Return the wok to high heat. Add the ginger, garlic, and scallions, and stir-fry until they are fragrant, about 15 seconds. Add the bamboo shoots, water chestnuts, tree ears, and bell pepper and stir-fry until the bell pepper starts to soften, about 30 seconds. Transfer the vegetables to the colander. Add the vinegar mixture to the wok and stir for 10 seconds. Then add the hot chili paste and stir for 10 seconds more. Return the pork and vegetables to the wok, and stir-fry until the sauce comes to a boil and thickens, about 20 seconds. Add the hot chili oil, if using, and stir-fry for 10 seconds. Add the sesame oil and serve immediately."
    ],
    "ingredients": [
        "8 ounces fresh ham or pork butt, cut into pieces 2 inches long, one quarter inch wide, and one quarter inch thick",
        "1 large egg white",
        "1 teaspoon cornstarch",
        "one eighth teaspoon salt",
        "Vegetable oil, for passing through",
        "3 tablespoons distilled white vinegar",
        "3 tablespoons soy sauce",
        "3 tablespoons sugar",
        "2 tablespoons rice wine or dry sherry",
        "1 tablespoon cornstarch",
        "One 1/2-inch piece peeled fresh ginger, minced",
        "3 garlic cloves, sliced 1/8-inch thick",
        "2 scallions, white part only, cut into thin 2-inch-long strips",
        "1/2 cup canned sliced bamboo shoots (cut into thin 2-inch-long strips)",
        "1/2 cup sliced water chestnuts",
        "1/2 cup dried tree ears, soaked in hot tap water until softened, drained, patted dry, and torn by hand into 1-inch pieces",
        "1/2 medium red bell pepper, seeds and ribs removed, cut into thin 2-inch-long strips",
        "1 1/2 tablespoons hot chili paste",
        "1 teaspoon hot chili oil, optional",
        "1 teaspoon dark sesame oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Egg",
        "Garlic",
        "Ginger",
        "Pork",
        "Soy",
        "Stir-Fry"
    ],
    "title": "Shredded Pork with Garlic Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/shredded-pork-with-garlic-sauce-237523"
}
