{
    "directions": [
        "In a large saucepan combine the beef, 1 of the onions, sliced, 1 of the garlic cloves, the salt, and water to cover, bring the water to a boil, and simmer the mixture, covered partially, for 1 1/2 to 2 hours, or until the beef is tender. Let the beef cool in the broth, drain it, reserving 1/3 cup of the broth, and with forks shred it. In a large skillet cook the remaining onion, minced, and the remaining 2 garlic cloves, minced, in the oil over moderately low heat, stirring, until the onion is softened, add the shredded beef, the tomato sauce, the chili, the cumin, the reserved broth, and salt and pepper to taste, and simmer the mixture, stirring, for 3 to 5 minutes, or until it is thickened. Let the filling cool.",
        "Working with 1 warmed tortilla at a time and keeping the others covered, spread about 2 rounded tablespoons of the filling down the center of each tortilla, roll up the tortillas, enclosing the filling, and secure the ends closed with wooden picks. Keep the rolled tortillas covered with plastic wrap. The flautas may be prepared up to this point 2 hours in advance and kept covered tightly with plastic wrap and chilled.",
        "In a large skillet heat 1/2 inch of the oil over moderately high heat until it is hot but not smoking, in it fry the flautas in batches, turning them, for 1 to 2 minutes, or until they are crisp, and transfer them with tongs as they are fried to paper towels to drain. Spread the lettuce on a platter or divide it among 6 plates, arrange the flautas on it, and top them with the guacamole and the sour cream.",
        "In the oven: Stack 6 tortillas at a time wrap each stack in foil, and heat the tortillas in the middle of a preheated 325°F. oven for 5 minutes for corn tortillas and 15 minutes for flour tortillas. (If the tortillas are very dry to begin with, pat each tortilla between dampened hands before stacking them.)",
        "In the microwave: Stack 6 tortillas at a time, wrap each stack in a microwave-safe plastic bag, and heat the tortillas in a microwave oven at high power (100%) for 30 seconds to 1 minute, or until they are heated through and pliable."
    ],
    "ingredients": [
        "2 pounds boneless beef chuck, cut into 2-inch pieces",
        "2 onions",
        "3 garlic cloves",
        "1 teaspoon salt",
        "2 tablespoons olive oil",
        "1/2 cup tomato sauce",
        "1 fresh or pickled jalapeño chili, or to taste seeded and chopped (wear rubber gloves)",
        "3/4 teaspoon ground cumin",
        "twelve 7-inch tortillas, warmed (procedure follows)",
        "vegetable oil for frying flautas",
        "3 cups shredded romaine or iceberg lettuce",
        "guacamole and sour cream as accompaniments"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Tomato",
        "Fry",
        "Winter",
        "Jalapeño",
        "Tortillas",
        "Gourmet"
    ],
    "title": "Shredded Beef Flautas",
    "url": "http://www.epicurious.com/recipes/food/views/shredded-beef-flautas-13587"
}
