{
    "directions": [
        "Place the grated root veggies and onion in a large kitchen towel and wring out any liquid, then add them to a medium bowl.",
        "Stir in the egg whites. Stir in the flour, salt, and pepper to taste.",
        "In a large skillet, heat 1/4 cup of the oil over medium-high heat. Use a scant 1/4 cup measure to scoop pancakes into the skillet, using the bottom of the measuring cup to spread the mixture into 1/2-inch-thick patties. Cook until the first side is deeply golden brown and crisp, 3 to 4 minutes, then turn the pancakes over and brown the other side, 3 to 4 minutes more. Transfer the pancakes to a wire rack to cool slightly. Work in batches so you don’t overcrowd the pan, adding more oil to the pan as needed.",
        "Serve the pancakes topped with a few pinches of flaky sea salt, a dollop of sour cream, and a sprinkle of scallions.",
        "If you want these guys a little spicy, mince 1/2 a jalapeño or Fresno chile and add it to the mixture before frying."
    ],
    "ingredients": [
        "2 cups of shredded rutabaga, parsnips, or sweet potato (from about 2 medium vegetables), shredded on the medium holes of a box grater",
        "1 medium yellow onion, grated on the medium holes of a box grater",
        "3 large egg whites, beaten",
        "1/4 cup all-purpose flour, plus more if needed so mixture just holds together",
        "1 teaspoon kosher salt",
        "Freshly cracked black pepper",
        "1/2 cup coconut or grapeseed oil",
        "Flaky sea salt",
        "1/4 cup sour cream or crème fraîche",
        "2 scallions, finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Pancake",
        "Potato",
        "Parsnip",
        "Rutabaga",
        "Sweet Potato/Yam",
        "Root Vegetable",
        "Side"
    ],
    "title": "Shredded Root Vegetable Pancakes",
    "url": "http://www.epicurious.com/recipes/food/views/shredded-root-vegetable-pancakes"
}
