{
    "directions": [
        "Put all beef ingredients in a 5- to 6-quart heavy pot with 1 teaspoon salt and enough water (about 2 quarts) to cover beef. Simmer, partially covered, skimming foam and adding more hot water if necessary to keep beef covered, until tender, about 2 hours.",
        "Remove beef and shred (once cool).",
        "Strain broth through a fine-mesh sieve into a bowl, discarding solids, and skim off fat.",
        "Preheat broiler.",
        "Toss tomatoes with 1 tablespoons oil in a 4-sided sheet pan. Broil 3 to 4 inches from heat until softened and charred, 10 to 12 minutes.",
        "Slit guajillo chiles lengthwise, then stem and seed. Heat a dry heavy medium skillet (not nonstick) over medium heat until hot, then toast chiles in 2 batches, opened flat, turning and pressing with tongs, until more pliable and slightly changed in color, about 30 seconds per batch. Transfer to a bowl and soak in hot water to cover until softened, 20 to 30 minutes.",
        "Toast peppercorns, cumin seeds, allspice, and clove in hot skillet over medium heat, stirring constantly, until fragrant and a shade darker, 30 seconds to 1 minute. Transfer to a blender.",
        "Drain soaked chiles and purée in blender with toasted spices, broiled tomatoes, onion, garlic, 3 chiles de árbol, 2 cups broth, and 1 teaspoon salt until smooth, about 2 minutes. For a spicier sauce, add remaining 2 chiles de árbol and purée again.",
        "Heat remaining 2 tablespoons oil in cleaned pot over medium-high heat until it shimmers, then slowly add sauce, stirring (it will spatter), and simmer, stirring frequently, 5 minutes. Add beef and 1 cup broth (reserve remainder for another use) and cook over medium-low heat, stirring, until meat is heated through, about 5 minutes."
    ],
    "ingredients": [
        "3 pounds skirt steak",
        "1 white onion, quartered",
        "3 garlic cloves",
        "2 Turkish bay leaves or 1 California",
        "1/4 teaspoon black peppercorns",
        "3 whole allspice",
        "1 whole clove",
        "3/4 pound tomatoes (2 to 3 medium), quartered",
        "3 tablespoons vegetable oil, divided",
        "3 ounces dried guajillo chiles, wiped clean",
        "1/4 teaspoon black peppercorns",
        "1/4 teaspoon cumin seeds",
        "3 whole allspice",
        "1 whole clove",
        "1/2 cup chopped white onion",
        "3 large garlic cloves",
        "3 to 5 dried chiles de árbol, wiped clean, stemmed, and seeded, or 1/2 teaspoon hot red-pepper flakes",
        "Equipment: an electric coffee/spice grinder",
        "Accompaniments: hot corn tortillas or rice; cooked black beans (rinsed and drained if canned); chopped white onion; lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Tomato",
        "Broil",
        "Super Bowl",
        "Steak",
        "Spice",
        "Hot Pepper",
        "Potluck",
        "Simmer",
        "Gourmet"
    ],
    "title": "Shredded Beef in Guajillo Sauce (_Carne Deshebrada en Salsa Roja_ )",
    "url": "http://www.epicurious.com/recipes/food/views/shredded-beef-in-guajillo-sauce-em-carne-deshebrada-en-salsa-roja-em-242595"
}
