{
    "directions": [
        "Combine grits, 5 cups water, and 1 teaspoon salt and bring to a boil in a 3- to 4-quart heavy saucepan. Reduce heat and simmer, covered, stirring occasionally, until grits are creamy and soft, about 30 minutes. Season with salt and keep warm, covered.",
        "Meanwhile, rinse shrimp under cold running water, then pat dry and sprinkle with 1/4 teaspoon salt. Cook sausage in a dry 12-inch heavy skillet over moderately high heat, stirring, until browned and fat is rendered, about 4 minutes.",
        "Add shrimp to sausage mixture and cook, stirring, until shrimp just turn opaque, about 2 minutes, then transfer shrimp to a plate.",
        "Add onion and bell pepper to sausage mixture and increase heat to high, then cook, stirring occasionally, until vegetables are softened, 8 to 10 minutes.",
        "Sprinkle flour over sausage mixture, then cook, stirring, 1 minute. Add remaining cup water and bring to a boil, stirring and scraping up any brown bits from bottom of skillet. Return shrimp to skillet and stir in remaining 1/4 teaspoon salt, or to taste, then remove from heat.",
        "Stir grits and divide among 4 plates, then spoon shrimp mixture with sauce on top and serve immediately."
    ],
    "ingredients": [
        "1 cup grits (not quick or instant; 8 oz)",
        "6 cups water",
        "1 1/2 teaspoons salt",
        "1 lb medium shrimp in shell (31 to 35 per lb; about 40), peeled (deveined if desired)",
        "2 Hillshire Farms smoked sausage \"Hot Links\" (from a 5-link package), chopped",
        "1 medium onion, finely chopped (1 cup)",
        "1 green bell pepper, finely chopped (1 cup)",
        "1 teaspoon all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Sauté",
        "Sausage",
        "Seafood",
        "Corn",
        "Gourmet"
    ],
    "title": "Shrimp and Grits",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-grits-233262"
}
