{
    "directions": [
        "Mix Greek-style yogurt, cucumber, dill, 2 tablespoons lemon juice, shallots, and 3/4 teaspoon crushed aniseed in small bowl; season tzatziki generously with salt and pepper. Chill.",
        "Prepare barbecue (medium-high heat). Brush grill with oil. Thread shrimp onto 4 metal skewers. Brush shrimp all over with olive oil; sprinkle with salt, pepper, and remaining 1/2 teaspoon crushed aniseed. Grill just until shrimp are opaque in center, about 3 minutes per side. Divide spinach among 4 plates; drizzle lightly with additional lemon juice and olive oil. Top each with 1 shrimp skewer. Spoon tzatziki over shrimp; sprinkle with feta cheese and serve.",
        "*A thick yogurt; sold at some supermarkets and at specialty foods stores (such as Trader Joe's and Whole Foods markets) and Greek markets. If unavailable, place plain yogurt in cheesecloth-lined strainer set over large bowl. Cover and chill overnight to drain."
    ],
    "ingredients": [
        "1 cup Greek-style (2% or nonfat) yogurt*",
        "1 cup 1/4-inch cubes English hothouse cucumber",
        "3 tablespoons chopped fresh dill",
        "2 tablespoons fresh lemon juice plus additional for drizzling",
        "2 tablespoons chopped shallots",
        "1 1/4 teaspoons aniseed, finely crushed, divided",
        "Olive oil (for brushing and drizzling)",
        "1 pound uncooked large shrimp, peeled, deveined, tails left intact",
        "8 cups baby spinach leaves",
        "3/4 cup crumbled feta cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Side",
        "Picnic",
        "Low Carb",
        "Quick & Easy",
        "Yogurt",
        "Low Cal",
        "High Fiber",
        "Low/No Sugar",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Feta",
        "Shrimp",
        "Spinach",
        "Summer",
        "Grill",
        "Chill",
        "Grill/Barbecue",
        "Healthy",
        "Party",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Shrimp Skewers with Tzatziki, Spinach, and Feta",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-skewers-with-tzatziki-spinach-and-feta-242967"
}
