{
    "directions": [
        "Bring 3 cups water to a simmer in a large saucepan. Gradually whisk in grits. Turn heat to low; gently simmer until grits begin to thicken. Continue cooking, stirring often and adding water by 1/4 cupfuls if too thick, until tender, about 1 hour. Stir in cheese, butter, and jalapeño, then cream. Season with salt and pepper. Keep warm.",
        "Meanwhile, heat a large heavy skillet over medium heat. Add tasso; sauté until fat begins to render, about 5 minutes (if tasso is very lean, add 1 tablespoon oil to skillet). Add garlic and 1 tablespoon butter; stir until butter melts. Add shrimp. When garlic begins to brown, add beer and chicken stock. Simmer until shrimp is cooked through, about 2 minutes. Remove skillet from heat; set aside.",
        "Heat a large nonstick skillet over medium heat. Add remaining 1 tablespoom butter to skillet; swirl to melt and cover bottom of pan. Crack eggs into pan and cook until whites are just set but yolks are still runny, about 3 minutes.",
        "Divide grits among bowls, forming a well in center. Spoon shrimp mixture into center of grits. Top with egg. Sprinkle tarragon over."
    ],
    "ingredients": [
        "1 cup yellow grits (not instant)",
        "1 cup grated sharp white cheddar",
        "1 tablespoon unsalted butter",
        "1 jalapeño, seeded, diced",
        "1/4 cup heavy cream",
        "Kosher salt",
        "freshly ground pepper",
        "1/2 cup 1/3\" cubes tasso, andouille sausage, or bacon",
        "1 tablespoon vegetable oil (optional)",
        "3 garlic cloves, sliced",
        "2 tablespoons (1/4 stick) butter, divided",
        "16 large shrimp (about 1 pound), peeled, deveined",
        "1/4 cup (or more) beer",
        "1/4 cup low-salt chicken stock",
        "4 large eggs",
        "1 tablespoon chopped fresh tarragon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Shellfish",
        "Brunch",
        "Dinner",
        "Lunch",
        "Seafood",
        "Shrimp",
        "Fall",
        "Hominy/Cornmeal/Masa",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Shrimp & Grits",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-grits-367141"
}
