{
    "directions": [
        "Place radishes in a small bowl. Bring white wine vinegar, sugar, red pepper flakes, 1/2 tsp. salt, and 3/4 cup water to a simmer in a small saucepan over medium-high heat and cook, stirring occasionally, until sugar is dissolved, about 5 minutes. Immediately pour brine over radishes and let cool. Cover and chill at least 2 hours.",
        "Meanwhile, rinse rice until water runs clear (this removes surface starch and keeps rice from getting gummy). Combine rice and 1 1/2 cups water in a medium saucepan, season with 1 1/2 tsp. salt and let sit 30 minutes.",
        "Bring rice to a boil. Reduce heat to low, cover, and cook until rice is tender, 18–22 minutes. Remove from heat and let sit (still covered) 10 minutes, then fluff with a fork; keep warm.",
        "Soak hijiki in 1/2 cup cold water in a small bowl until softened, 10–12 minutes. Drain; set aside.",
        "Bring a medium pot of water to a boil; season generously with salt. Add shrimp, cover pot, and remove from heat. Let sit until shrimp are cooked through, about 3 minutes. Drain and transfer shrimp to a bowl of ice water; let cool. Drain and pat dry; cut into 1/2\" pieces. Set aside.",
        "Whisk shallot, soy sauce, gochujang, rice vinegar, fish sauce, honey, and oil in a large bowl. Add reserved hijiki and shrimp to honey-gochujang dressing; toss to coat. Cover; chill 1 hour. Taste and season with more salt if needed.",
        "Divide rice among bowls and top with shrimp mixture, drained pickled radishes, and mizuna. Sprinkle with sesame seeds.",
        "Radishes can be pickled 5 days ahead; keep chilled. Shrimp can be cooked 8 hours ahead; cover and chill."
    ],
    "ingredients": [
        "6 red radishes, trimmed, thinly sliced",
        "3/4 cup white wine vinegar",
        "3 tablespoons sugar",
        "1 teaspoon crushed red pepper flakes",
        "2 teaspoons kosher salt, divided, plus more",
        "1 1/2 cups short-grain sushi rice",
        "1 tablespoon dried hijiki (seaweed)",
        "1 1/2 pounds large shrimp, peeled, deveined",
        "1 medium shallot, finely chopped",
        "1/4 cup soy sauce",
        "1 tablespoon plus 2 teaspoons gochujang (Korean hot pepper paste)",
        "4 teaspoons unseasoned rice vinegar",
        "1 tablespoon fish sauce",
        "2 teaspoons honey",
        "1 teaspoon toasted sesame oil",
        "2 cups baby mizuna or arugula",
        "2 teaspoons toasted sesame seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shrimp",
        "Radish",
        "Pickles",
        "Rice",
        "Hawaii",
        "Seafood",
        "Shellfish",
        "Dinner"
    ],
    "title": "Shrimp Poke With Pickled Radishes",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-poke-with-pickled-radishes"
}
