{
    "directions": [
        "In a deep 12-inch heavy skillet stir together oil and flour and cook roux over moderate heat, stirring constantly, until color of peanut butter, about 10 minutes. Add onion and cook,stirring occasionally, until softened. Stir in garlic and cook,stirring, 1 minute. Add hot water, tomato sauce, chili powder,sugar, Worcestershire sauce, salt, bitters, cayenne, and black pepper and simmer, uncovered, stirring occasionally, until reduced to about 2 1/2 cups, about 35 minutes. Season sauce with salt. Sauce may be made 1 week ahead and chilled, covered. Reheat sauce in skillet before proceeding.",
        "Stir bell peppers into sauce and cook, covered, over moderate heat,stirring frequently to avoid scorching, until crisp-tender, about 10 minutes. Transfer peppers with a slotted spoon to a large bowl,letting excess sauce drip into skillet, and cover and plastic wrap.Stir shrimp into sauce and cook, covered, over moderate heat, stirring occasionally, until cooked through, about 5 minutes. Transfer shrimp with slotted spoon to bowl and cover. Boil sauce, stirring, until thickened. Pour sauce, lemon juice, and salt to taste over shrimp mixture and stir to combine well. Serve shrimp and peppers over rice and sprinkle with parsley."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "2 1/2 tablespoons all-purpose flour",
        "1 1/2 cups chopped onion (about 1 large)",
        "3 large garlic cloves, minced",
        "4 cups hot water",
        "an 8-ounce can tomato sauce (about 3/4 cup)",
        "2 tablespoons chili powder",
        "1 tablespoon sugar",
        "1 tablespoon Worcestershire sauce",
        "2 teaspoons salt",
        "1/2 teaspoon Angostura bitters",
        "1/2 teaspoon cayenne",
        "1 teaspoon black pepper",
        "3 yellow bell peppers, cut into 1/2-inch-wide strips",
        "3 red bell peppers, cut into 1/2-inch-wide strips",
        "2 1/2 pounds jumbo shrimp (about 36), shelled, leaving tail and last shell section intact, and deveined",
        "1/4 cup fresh lemon juice",
        "Accompaniment: basmati rice with mustard seeds and golden raisins",
        "Garnish: 2 tablespoons minced fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pepper",
        "Tomato",
        "Low Cal",
        "Shrimp",
        "Gourmet"
    ],
    "title": "Shrimp and Peppers in Spicy Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-peppers-in-spicy-tomato-sauce-13119"
}
