{
    "directions": [
        "Build a medium-hot fire in a charcoal grill, or heat a gas grill to high. If using shell-on shrimp, use small scissors to cut shells along the curved backs. Remove veins, keeping shells intact. Place shrimp and lobster in a large bowl; drizzle with 2 tablespoons oil and season with salt. Mix onion and 2 tablespoons lime juice in a small bowl.",
        "Grill shrimp until just opaque in center, 2-3 minutes per side. Transfer to a large plate. Grill lobster tails, flesh side down, until slightly charred, 1-2 minutes. Turn flesh side up and grill until just opaque in center, about 5 minutes longer. Add lobster tails to plate with shrimp and let rest for 5-10 minutes. Remove lobster meat from shells; discard shells. Cut lobster into 1\" pieces.",
        "Drain red onion; place in a large bowl. Add 3 tablespoons lime juice, 2 tablespoons oil, jicama, greens, tomatillos, and 1 cup cilantro. Season with salt and more lime juice, if desired. Add seafood; toss to coat. Drizzle Ancho Chile Oil over; garnish with cilantro."
    ],
    "ingredients": [
        "1 pound large shell-on or peeled shrimp",
        "4 lobster tails (about 2 pounds total), halved lengthwise",
        "4 tablespoons olive oil, divided",
        "Kosher salt",
        "1/4 cup thinly sliced red onion",
        "5 tablespoons (or more) fresh lime juice, divided",
        "2 cups 3x1/4x1/4\" pieces peeled jicama (from one 1-pound jicama)",
        "2 cups hardy greens, such as purslane or watercress sprigs, with tender stems",
        "2 cups thinly sliced tomatillos or small green tomatoes (about 8 medium)",
        "1 cup fresh cilantro leaves with tender stems plus more for garnish",
        "2 tablespoons Ancho Chile Oil or store-bought chili oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Shellfish",
        "Appetizer",
        "Fourth of July",
        "High Fiber",
        "Backyard BBQ",
        "Lunch",
        "Seafood",
        "Lobster",
        "Shrimp",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Cilantro",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Shrimp, Lobster, and Jicama Salad",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-lobster-and-jicama-salad-51104660"
}
