{
    "directions": [
        "Cook spinach in 1 inch simmering water in a small saucepan, stirring, until wilted, about 5 seconds. Drain in a sieve and rinse under cold water until cool. Squeeze to remove as much moisture as possible. Finely chop spinach and stir with remaining filling ingredients until blended.",
        "Stack a few wonton wrappers (keep remaining wrappers covered) and cut into rounds with a 2 1/2-inch cutter. Spread 1 slightly rounded teaspoon filling onto each round, spreading up to but not over edge. Bring up edge of each round, pleating to form a cup and leaving open at top.",
        "Bring enough water to a boil in a wok so that bottom rim of steamer (not basket) rests in water. Line steamer rack with lettuce. Arrange dumplings over lettuce, making sure dumplings do not touch each other. Cover with steamer lid and steam until filling is cooked through, 8 to 10 minutes.",
        "Stir together all sauce ingredients."
    ],
    "ingredients": [
        "1 cup baby spinach",
        "6 oz shrimp, shelled, deveined, and pulsed to a coarse paste in a food processor",
        "3 tablespoons finely chopped rinsed canned water chestnuts",
        "2 scallions (green parts only), finely chopped",
        "1 tablespoon Asian sesame oil",
        "2 teaspoons finely grated peeled fresh ginger",
        "1 teaspoon sugar",
        "1 teaspoon medium-dry Sherry",
        "1 teaspoon oyster sauce",
        "1/2 teaspoon salt",
        "24 wonton wrappers",
        "Large soft lettuce leaves for lining steamer",
        "2 tablespoons soy sauce",
        "2 tablespoons water",
        "1 teaspoon sugar",
        "Squeeze of juice from 1 tablespoon finely grated peeled fresh ginger",
        "Dried hot red pepper flakes or Asian chile paste to taste",
        "Special equipment: a bamboo steamer and a wok"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Ginger",
        "Shellfish",
        "Cocktail Party",
        "Shrimp",
        "Spinach",
        "Sherry",
        "Spring",
        "Healthy",
        "Sesame",
        "Gourmet"
    ],
    "title": "Shrimp and Spinach Dumplings with Asian Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-spinach-dumplings-with-asian-dipping-sauce-104880"
}
