{
    "directions": [
        "Spray a 9x12-inch baking dish with cooking spray.",
        "Beat 1 1/2 cups milk and eggs together in a large bowl using an electric mixer until frothy, about 2 minutes. Add 1 1/4 cups flour and 1/4 teaspoon salt to milk mixture; beat until incorporated, about 2 more minutes.",
        "Heat a non-stick skillet over medium heat. Pour 1/4 cup batter into the skillet and immediately rotate the skillet until the batter evenly coats the bottom in a thin layer. Cook until the top of the crepe is no longer wet and the bottom has turned light brown, about 4 minutes. Run a spatula around the edge of the skillet to loosen; flip crepe and cook until the other side has turned light brown, about 2 more minutes.",
        "Whisk water, 1/4 cup flour, 1/4 teaspoon salt together in a bowl.",
        "Place butter and garlic in a non-stick skillet over low heat. Cover skillet and cook until garlic is golden brown, about 7 minutes. Add shrimp and lobster meat; stir, cover skillet, and cook until shrimp are bright pink and cooked through, about 5 minutes. Add lemon juice and cayenne pepper; stir, cover skillet, and cook for 5 more minutes.",
        "Whisk water-flour mixture and stir into shrimp mixture. Sprinkle Parmesan cheese over shrimp mixture; cook and stir over medium heat until thickened, about 1 minute. Remove skillet from heat and spoon shrimp filling onto each crepe. Roll each crepe around filling and place in the prepared baking dish.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Combine 1 cup milk, mayonnaise, and 1 tablespoon flour in a small saucepan; cook and stir over medium heat until bubbling, 2 to 3 minutes. Drizzle sauce over filled crepes.",
        "Bake in the preheated oven until crepes are cooked through and sauce is bubbling, 25 to 30 minutes."
    ],
    "ingredients": [
        "cooking spray",
        "Crepes:",
        "1 1/2 cups milk",
        "3 eggs",
        "1 1/4 cups all-purpose flour",
        "1/4 teaspoon salt",
        "Filling:",
        "1 1/2 cups water",
        "1/4 cup all-purpose flour",
        "1/4 teaspoon salt",
        "2 tablespoons butter",
        "4 cloves garlic, minced",
        "2 pounds shrimp, peeled and deveined",
        "8 ounces lobster meat (optional)",
        "1 tablespoon lemon juice",
        "1 pinch cayenne pepper",
        "1/4 cup grated Parmesan cheese",
        "Sauce:",
        "1 cup milk",
        "2 tablespoons mayonnaise",
        "1 tablespoon all-purpose flour"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shrimp Crepes",
    "url": "http://allrecipes.com/recipe/236387/shrimp-crepes/"
}
