{
    "directions": [
        "Pull 1 wrapper off the stack and place on a flat work surface. Lay 1 cilantro leaf in the center of the wrapper, followed by 1 shrimp curled into a circle. Drizzle 1/8 teaspoon of the Chili Oil on top of the shrimp.",
        "Egg wash with a pastry brush around the top edge of the wrapper. Fold in half, firmly pressing the edges together. Place the dumplings on a baking sheet dusted with semolina.",
        "Fill a wok with 2 cups of vegetable oil and bring oil to 350 degrees F. Cook the dumplings (3 or 4 at a time) for about 2 minutes, turning after 1 minute or when golden brown. Drain on absorbent paper.",
        "Serve warm with mango slices and Saffron-Coconut Milk Sauce, along with Chili Oil on the side.",
        "Pulse the chiles, sambal and grapeseed oil in the food processor. Transfer to a squeeze bottle. Allow the flavors to infuse for at least 30 minutes prior to serving.",
        "Serve at room temperature.",
        "Place the saffron in the white wine and set aside for 20 to 30 minutes. Place the coconut milk and heavy cream in a small pot and over medium heat cook down by half. Whisk in the saffron wine, lemon juice, kosher salt, and cayenne pepper.",
        "Serve the sauce warm."
    ],
    "ingredients": [
        "12 round dumpling wrappers",
        "12 cilantro leaves",
        "12 medium shrimp uncooked, peeled, deveined, tails removed",
        "1 recipe Chili Oil, recipe follows",
        "1 egg, beaten",
        "Semolina, for dusting pan",
        "Vegetable or peanut oil, for frying dumplings",
        "Mango slices, as accompaniment",
        "1 recipe Saffron-Coconut Milk Sauce, recipe follows",
        "7 Thai bird chiles, seeded",
        "2 teaspoons sambal oelek*",
        "1/2 cup grapeseed oil",
        "1/8 teaspoon saffron",
        "2 tablespoons white wine",
        "1 can coconut milk",
        "1 1/2 cups heavy cream",
        "2 tablespoons lemon juice",
        "1/4 teaspoon kosher salt",
        "1/8 teaspoon cayenne pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Asian Appetizer",
        "Appetizer",
        "Asian",
        "Fruit",
        "Mango",
        "Shellfish Recipes",
        "Shrimp"
    ],
    "title": "Shrimp Dumplings",
    "url": "http://www.foodnetwork.com/recipes/shrimp-dumplings-recipe"
}
