{
    "directions": [
        "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally, until tender yet firm to the bite, about 8 minutes. Drain.",
        "Preheat oven to 375 degrees F (190 degrees C). Lightly oil a 9x13-inch baking dish.",
        "Heat oil in skillet over medium-high heat. Add mushrooms; cook and stir until tender, about 10 minutes. Add garlic; cook for 1 minute. Stir in spinach and cook just until wilted, 1 to 2 minutes. Remove skillet from heat and transfer mixture to a bowl.",
        "Melt butter in the same skillet over medium heat until a pinch of flour sprinkled into the butter will just begin to bubble. Whisk in flour to form a thick paste the consistency of cake frosting. Continue cooking, whisking constantly, until flour has turned golden and begins to smell like toast, 10 to 12 minutes.",
        "Slowly pour 1 cup of milk into flour mixture; whisk until smooth. Pour in remaining 1 cup milk; whisk until smooth. Whisk in garlic salt, cayenne pepper, kosher salt, and pepper. Bring mixture to a simmer; whisk in lemon zest and lemon juice. Remove skillet from heat.",
        "Spoon enough sauce in prepared baking dish to coat bottom. Overlap 5 lasagna noodles on top. Spread spinach mixture evenly over the pasta. Arrange shrimp on spinach layer. Drizzle with half the remaining sauce. Overlap remaining lasagna noodles on top. Cover with remaining sauce. Sprinkle with parsley.",
        "Bake in the preheated oven for 10 minutes. Turn baking dish; continue baking until cooked through and bubbly, about 15 minutes more. Cool 15 minutes before serving."
    ],
    "ingredients": [
        "10 lasagna noodles",
        "2 tablespoons olive oil",
        "1 pound white button mushrooms, sliced",
        "2 tablespoons minced garlic",
        "1 (9 ounce) bag fresh baby spinach leaves",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "2 cups cold milk",
        "1 teaspoon garlic salt",
        "1/2 teaspoon cayenne pepper",
        "kosher salt and ground black pepper to taste",
        "1 lemon, zested and juiced",
        "2 pounds uncooked medium shrimp, peeled and deveined",
        "1 tablespoon dried parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shrimp and Spinach Lasagna",
    "url": "http://allrecipes.com/recipe/257088/shrimp-and-spinach-lasagna/"
}
