{
    "directions": [
        "Cook shrimp shells in 1 tablespoon butter in a 4-quart pot over moderately high heat, stirring frequently, until golden. Add Pernod and boil, stirring frequently, until most of liquid is evaporated. Add water and bay leaf and simmer, uncovered, 20 minutes. Pour shrimp stock through a fine sieve into a bowl, pressing on shells and then discarding them.",
        "While stock is simmering, cook shrimp with salt to taste in 1 tablespoon butter in a 6-quart heavy pot over moderate heat, stirring frequently, until just cooked through, 3 to 4 minutes. Transfer with a slotted spoon to a bowl. Add remaining 2 tablespoons butter to pot, then cook carrots, celery, and onion over moderate heat, stirring, until softened. Stir in rice, tomato paste, cayenne, salt, and shrimp stock and simmer, covered, until rice is tender, about 20 minutes. Set aside 12 shrimp and stir remainder into bisque.",
        "Purée bisque in batches in a blender (use caution when blending hot liquids), then pour through fine sieve into another pot. Stir in cream and cook over low heat until heated through (do not boil). Stir in lemon juice and salt to taste.",
        "Cut reserved shrimp into 1/4-inch dice, then use as part of garnish for bisque."
    ],
    "ingredients": [
        "1 1/4 lb medium shrimp, shelled and deveined, shells reserved",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/2 cup Pernod",
        "2 qt water",
        "1 bay leaf (not California)",
        "3 carrots, chopped",
        "2 celery ribs, chopped",
        "1 medium onion, chopped",
        "2 tablespoons long-grain rice",
        "2 tablespoons tomato paste",
        "3/4 teaspoon cayenne",
        "2 teaspoons salt",
        "1/3 cup heavy cream",
        "Fresh lemon juice to taste",
        "Garnish: chopped fresh chives",
        "Accompaniment:anise seed flatbreads"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Blender",
        "Rice",
        "Shellfish",
        "Tomato",
        "Lunch",
        "Shrimp",
        "Pernod",
        "Winter",
        "Simmer",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Shrimp Bisque with Pernod",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-bisque-with-pernod-104879"
}
