{
    "directions": [
        "In a small bowl whisk together honey, mustard, lime juice, and tarragon. Add oil in a stream, whisking until emulsified, and season with salt and pepper. Dressing may be prepared up to this point 1 day ahead and chilled, covered. Bring dressing to room temperature before proceeding. Stir in chives.",
        "Have ready a large bowl of ice and cold water. In a large saucepan of boiling salted water cook favas until crisp-tender, about 2 1/2 minutes, and transfer with a slotted spoon to ice water to stop cooking. Drain favas in a colander and gently peel away outer skins. Transfer favas to a large serving bowl.",
        "Have ready another large bowl of ice and cold water. Return water in pan to a boil and cook asparagus until crisp-tender, about 3 1/2 minutes. Transfer asparagus with slotted spoon to ice water to stop cooking. Drain asparagus in colander and pat dry with paper towels.",
        "Return water in pan to a boil and cook shrimp until just cooked through, about 2 minutes. Transfer shrimp with slotted spoon to paper towels to cool.",
        "In bowl with favas, toss together 1/3 cup dressing, asparagus, shrimp, mâche, frisée, and salt and pepper to taste. Drizzle salad with some of remaining dressing and garnish with chives."
    ],
    "ingredients": [
        "1 1/2 teaspoons honey",
        "1 teaspoon Dijon mustard",
        "1/4 cup fresh lime juice",
        "1 tablespoon chopped fresh tarragon leaves",
        "2/3 cup extra-virgin olive oil",
        "1 tablespoon finely chopped fresh chives (wash and dry before chopping)",
        "2 pounds fresh fava beans, shelled (about 1 cup)",
        "1 pound thin asparagus, trimmed and cut diagonally into 2-inch pieces",
        "1 pound medium shrimp (about 30), shelled and deveined",
        "3 cups mâche* (lamb's-lettuce), rinsed and dried",
        "1 1/2 cups frisée* (French curly endive), rinsed and dried",
        "Garnish: 1 tablespoon finely chopped fresh chives",
        "*available at specialty produce markets and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Leafy Green",
        "Mustard",
        "Shellfish",
        "Lunch",
        "Lime",
        "Shrimp",
        "Asparagus",
        "Spring",
        "Healthy",
        "Honey",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Shrimp, Fava Bean, and Asparagus Salad",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-fava-bean-and-asparagus-salad-13700"
}
