{
    "directions": [
        "Bring 6 cups broth to simmer in medium saucepan. Add shrimp. Turn off heat, cover, and let stand until shrimp are just opaque in center, about 3 minutes. Using slotted spoon, transfer shrimp to small bowl; cover with foil to keep warm. Cover broth to keep warm.",
        "Heat oil in heavy large saucepan over medium heat. Add chopped onion and sauté until tender, about 5 minutes. Add minced garlic and stir 1 minute. Add rice and stir until edge of rice is translucent but center is still opaque, about 2 minutes. Add wine and cook until wine is absorbed, stirring occasionally, about 2 minutes. Add 3/4 cup chicken broth. Simmer until almost all broth is absorbed, stirring often, about 2 minutes. Continue to add broth, 3/4 cup at a time, until rice is just tender and mixture is creamy, stirring often and allowing almost all broth to be absorbed after each addition, about 25 minutes total. During last 5 minutes, add spinach in 4 batches, stirring and allowing spinach to wilt after each addition. Mix in shrimp, 1/2 cup Parmesan cheese, and basil. Season risotto to taste with salt and pepper. Spoon risotto into shallow bowls and serve, passing additional cheese separately."
    ],
    "ingredients": [
        "6 cups (about) low-salt chicken broth",
        "1 pound uncooked large shrimp, peeled, deveined",
        "2 tablespoons olive oil",
        "1 1/2 cups chopped onion",
        "2 large garlic cloves, minced",
        "11/2 cups arborio rice or medium-grain white rice (about 9 1/2 ounces)",
        "1/2 cup dry white wine",
        "1 6-ounce package baby spinach leaves",
        "1/2 cup freshly grated Parmesan cheese",
        "1/4 cup chopped fresh basil",
        "Additional grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Rice",
        "Appetizer",
        "Sauté",
        "Parmesan",
        "Basil",
        "Shrimp",
        "Spinach",
        "White Wine",
        "Simmer",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Shrimp Risotto with Baby Spinach and Basil",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-risotto-with-baby-spinach-and-basil-107841"
}
