{
    "directions": [
        "Heat oil in large skillet over medium-high heat. Add onion; sauté until very brown, about 6 minutes. Add tomatoes, garlic, and chipotle chiles. Cook 1 minute. Transfer mixture to blender; puree until smooth. Season with salt and pepper. Transfer puree to bowl. Cover and chill until cold.",
        "Combine all ingredients in processor; puree until smooth. Season to taste with salt and pepper. Transfer puree to bowl. Press plastic wrap onto surface of puree; chill at least 20 minutes and up to 3 hours.",
        "Add enough vegetable oil to heavy large pot to reach depth of 3 1/2 inches. Heat over medium-high heat to 375°F.",
        "Whisk rice flour and club soda in large bowl to blend. Working in batches, dip shrimp into batter and fry until golden brown, about 3 minutes. Using slotted spoon, transfer shrimp to paper towels.",
        "Divide romaine among 8 stemmed cocktail glasses. Simultaneously pour 1/4 cup tomato puree and 1/4 cup avocado puree over romaine in each glass, letting purees meet in center. Hang 3 shrimp over rim of each glass.",
        "*Chipotle chiles canned in a spicy tomato sauce, sometimes called adobo, are available at Latin American markets, specialty foods stores, and some supermarkets.",
        "**Rice flour is available at specialty and natural foods stores."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "2 large tomatoes, coarsely chopped",
        "3 garlic cloves, minced",
        "1 teaspoon minced canned chipotle chiles*",
        "2 large ripe avocados, peeled, pitted",
        "1/3 cup chopped fresh cilantro",
        "1/4 cup fresh lime juice",
        "1/4 cup minced shallots",
        "2 tablespoons minced jalapeño chiles",
        "Vegetable oil (for deep-frying)",
        "2 cups rice flour**",
        "2 cups club soda",
        "24 uncooked large shrimp, peeled, deveined, tail shells left intact",
        "4 cups thinly sliced romaine lettuce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Tomato",
        "Appetizer",
        "Fry",
        "Sauté",
        "Lime",
        "Shrimp",
        "Avocado",
        "Jalapeño",
        "Cilantro"
    ],
    "title": "Shrimp Tempura Cocktail",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-tempura-cocktail-108545"
}
