{
    "directions": [
        "Mix soy sauce, liquid smoke flavoring, kosher salt, 1 cup white sugar, black pepper, and garlic powder in a large nonstick skillet. Bring to a boil, reduce heat to low, and stir constantly until the mixture becomes thick and paste-like, 5 to 10 minutes. Remove from heat and let the mixture cool.",
        "Coat beef roast completely with rub paste and cover roast with plastic wrap. Place wrapped roast on a baking sheet and refrigerate 1 to 2 days to infuse flavor into the meat.",
        "Remove roast from refrigerator, unwrap, and let stand until meat reaches room temperature, about 2 hours.",
        "Preheat oven to 500 degrees F (260 degrees C).",
        "Cook roast in preheated oven for 10 minutes only; reduce oven heat to 250 degrees F (120 degrees C), leaving the oven door slightly open as the temperature drops, until oven temperature reaches about 300 degrees.",
        "Roast the meat until temperature reaches your desired degree of doneness, 2 to 3 hours. An instant-read meat thermometer inserted into the center of the roast reads 130 degrees F (54 degrees C) for rare, 140 degrees F (60 degrees C) for medium-rare, 150 degrees F (65 degrees C) for medium, or 160 degrees F (70 degrees C) for well done. Temperature will continue to rise as the meat rests.",
        "Let roast rest for 15 minutes to redistribute juices; scrape off the rub mixture.",
        "While meat is resting, heat 2 tablespoons butter with olive oil in a large skillet over medium heat. Cook and stir green onions in the hot oil and butter until browned, 10 to 15 minutes. Stir beef broth, bourbon whiskey, triple sec, 1/2 cup white sugar, and brown sugar into green onions, stirring to combine and dissolve sugars. Bring to a simmer, reduce heat to low, and cook until flavors have blended, about 5 minutes. Melt remaining 6 tablespoons butter into sauce and simmer until butter is smoothly incorporated into sauce.",
        "Shake cornstarch with water in a small lidded jar and whisk cornstarch mixture into sauce. Simmer until thickened, about 5 minutes. Serve sauce with meat."
    ],
    "ingredients": [
        "Rub:",
        "1/2 cup soy sauce",
        "1 (4 fluid ounce) bottle liquid hickory smoke flavoring",
        "2 cups kosher salt",
        "1 cup white sugar",
        "2 tablespoons ground black pepper",
        "2 tablespoons garlic powder",
        "7 1/2 pounds beef standing rib roast",
        "Sauce:",
        "2 tablespoons butter",
        "1 tablespoon olive oil",
        "2 bunches green onions, chopped",
        "1 cup beef broth",
        "1/2 cup bourbon whiskey",
        "2 fluid ounces triple sec",
        "1/2 cup white sugar",
        "1/4 cup brown sugar",
        "6 tablespoons butter",
        "2 tablespoons cornstarch, or as desired",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shrike's Prime Rib with Whiskey Sauce",
    "url": "http://allrecipes.com/recipe/230191/shrikes-prime-rib-with-whiskey-sauce/"
}
