{
    "directions": [
        "Butterfly shrimp by cutting almost, but not all the way, through backs. Toss with garlic, oil, and lime juice. Season with salt. Marinate, chilled, 1 hour.",
        "Drain yogurt in a fine-mesh sieve set over a bowl, chilled, 1 hour. Cook coriander and cumin in oil in a small skillet over moderate heat, stirring occasionally, until fragrant. Coarsely chop chiles, then purée in a blender with drained yogurt, coriander mixture, and cilantro until smooth. Stir in lime juice, pistachios, and salt to taste.",
        "Preheat broiler.",
        "Gently press 1 shrimp open and thread lengthwise onto a skewer near pointed end. Repeat with remaining shrimp and skewers.",
        "Arrange satés in a row on 1 long side of a broiler pan so that blunt ends of skewers point toward middle of pan. Cover exposed portions of skewers with a sheet of foil (don’t cover shrimp). Arrange another row of satés over foil. Continue adding rows of satés and layers of foil until pan is full, making sure exposed skewer ends of last row of satés are covered with foil.",
        "Broil until shrimp are just cooked through, 3 to 4 minutes.",
        "Serve satés with chutney for dipping."
    ],
    "ingredients": [
        "2 1/2 lpounds deveined shelled shrimp (about 65)",
        "1 tablespoon minced garlic",
        "3 tablespoons olive oil",
        "2 tablespoons fresh lime juice",
        "1 (16-ounce) container plain yogurt",
        "2 teaspoons ground coriander",
        "1 teaspoon ground cumin",
        "1 tablespoon olive oil",
        "4 fresh jalapeño chiles, 3 with seeds and ribs removed",
        "2 cups fresh cilantro sprigs",
        "2 tablespoons fresh lime juice",
        "1 cup shelled natural pistachios, toasted and finely ground",
        "Special equipment: about 65 (6- to 8-inch) bamboo skewers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Shellfish",
        "Broil",
        "Marinate",
        "Cocktail Party",
        "Yogurt",
        "Oscars",
        "Lime",
        "Pistachio",
        "Shrimp",
        "Spice",
        "Jalapeño",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Shrimp Sates with Spiced Pistachio Chutney",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-sates-with-spiced-pistachio-chutney-103368"
}
