{
    "directions": [
        "In a blender or food processor purée half of large tomatoes, 1/2 cup bell pepper, 1/4 cup cucumber, 2 tablespoons onion, garlic paste, cumin, and jalapeño. Transfer purée to a bowl and stir in cherry tomatoes with remaining chopped large tomatoes, bell pepper, cucumber, and onion. Stir in vinegar and salt and pepper to taste. (Chill gazpacho, covered, at least 3 hours and up to 1 day.)",
        "In a saucepan of generously salted boiling water boil shrimp 30 seconds, or until just cooked through. Transfer shrimp with a slotted spoon to a bowl and cool. (Shrimp may be cooked 1 day ahead and chilled, covered.) Chop shrimp and stir into gazpacho.",
        "Before serving, thin gazpacho with ice water and top with croutons and garnish.",
        "In a blender or small food processor purée basil and oil and season with salt and pepper to taste.",
        "Preheat oven to 350°F.",
        "On a baking sheet toss bread with basil oil and bake in middle of oven, shaking baking sheet occasionally, 10 to 15 minutes, or until croutons are golden brown and crisp. Season croutons with salt and pepper. (Croutons may be made 3 days ahead and kept in a sealable plastic bag in a cool dry place.) Makes about 2 cups."
    ],
    "ingredients": [
        "2 pounds vine-ripened large tomatoes (about 5), chopped",
        "1 red bell pepper, chopped (about 1 cup)",
        "1/2 cup peeled, seeded, and finely chopped cucumber",
        "1/4 cup finely chopped red onion",
        "2 garlic cloves, minced and mashed to a paste with 1/2 teaspoon salt",
        "1/2 teaspoon ground cumin",
        "1 fresh jalapeño chili, chopped fine (wear rubber gloves)",
        "1/2 pound vine-ripened cherry tomatoes, quartered",
        "2 tablespoons red-wine vinegar, or to taste",
        "1/2 pound small to medium shrimp, shelled and, if desired, deveined",
        "1/4 to 1/2 cup ice water for thinning gazpacho",
        "3/4 cup packed fresh basil leaves, washed well and spun dry",
        "3 tablespoons extra-virgin olive oil",
        "4 slices firm white sandwich bread, cut into 1/2-inch cubes (about 3 cups)",
        "Garnish if desired: finely diced cucumber and red bell pepper and chopped fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Shellfish",
        "Tomato",
        "Quick & Easy",
        "Lunch",
        "Basil",
        "Shrimp",
        "Cucumber",
        "Summer",
        "Chill",
        "Gourmet"
    ],
    "title": "Shrimp Gazpacho with Basil Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-gazpacho-with-basil-croutons-12647"
}
