{
    "directions": [
        "Preheat oven to 350°F. Pierce potatoes all over with fork. Place on baking sheet. Toss garlic with 1 tablespoon oil in small bowl. Enclose garlic in foil; place on baking sheet with potatoes. Bake until potatoes and garlic are tender, about 30 minutes for garlic and 1 hour 15 minutes for potatoes. Cool garlic and potatoes slightly. Remove peel from garlic. Remove skins from potatoes. Combine potatoes and garlic in bowl. Mash until smooth.",
        "Add shrimp, cilantro, panko, chili, onion and 1 1/2 teaspoons Latin Spice Mix. Stir to blend well. Season with salt. Form mixture into six 3-inch-diameter patties.",
        "Preheat oven to 375°F. Lightly coat cakes in flour. Heat 3 tablespoons oil in heavy large skillet over medium-high heat. Cook cakes in batches until brown, adding more oil if necessary, about 2 minutes per side. Place on baking sheet. Bake until heated through, about 5 minutes.",
        "Spoon Chayote Slaw in center of plates. Place 1 cake on each plate. Spoon Chipotle Tartar Sauce atop cakes; serve.",
        "*Available in Asian markets and in the Asian foods section of some supermarkets.",
        "**A fresh green chili, often called a pasilla, available at Latin American markets and some supermarkets."
    ],
    "ingredients": [
        "1 pound tan-skinned sweet potatoes",
        "4 large garlic cloves, unpeeled",
        "4 tablespoons (or more) vegetable oil",
        "8 ounces peeled cooked large shrimp, coarsely chopped",
        "2/3 cup chopped fresh cilantro",
        "2/3 cup panko (Japanese breadcrumbs)*",
        "2 tablespoons finely chopped poblano chili**",
        "2 tablespoons finely chopped red onion",
        "1 1/2 teaspoons Latin Spice Mix",
        "All purpose flour",
        "Slaw Chayote",
        "Chipotle Tartar Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Shellfish",
        "Appetizer",
        "Bake",
        "Sauté",
        "Shrimp",
        "Hot Pepper",
        "Sweet Potato/Yam",
        "Winter",
        "Cilantro"
    ],
    "title": "Shrimp and Sweet Potato Cakes with Chayote Slaw and Chipotle Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-sweet-potato-cakes-with-chayote-slaw-and-chipotle-sauce-102840"
}
