{
    "directions": [
        "Cook oil, turmeric, and zest in a 1- to 2-quart saucepan over low heat, stirring frequently, 5 minutes. Transfer to a small bowl and chill at least 1 hour. Pour through a fine-mesh sieve into another small bowl (discard solids).",
        "Combine sauce ingredients in a 4- to 6-quart pot and boil, stirring occasionally, until reduced to about 2 cups, 30 to 40 minutes. Pour through a medium-mesh sieve into a bowl (discard solids), then set bowl in a larger bowl of ice and cold water to chill sauce.",
        "Cook shrimp in cleaned 4- to 6-quart pot of boiling salted water until just cooked through, 1 to 2 minutes. Drain and transfer to another bowl of ice and cold water to cool. Drain and halve lengthwise, then chill, covered.",
        "Heat 4 tablespoons lemon oil in a 10-inch heavy skillet over moderately high heat until hot but not smoking, then sauté carrots, stirring, until just tender, about 3 minutes. Spread carrots with oil from skillet on a plate and chill.",
        "Grate zest from oranges into a large bowl. Cut remaining rind and white pith from oranges with a sharp paring knife and discard. Cut orange segments free from membranes and add to zest.",
        "Slice fennel and onion very thinly crosswise with slicer.",
        "Stir carrots into orange mixture along with fennel, onion, lime juice, remaining lemon oil, chives, mint, and salt.",
        "Mound salad on 8 plates and top with shrimp. Drizzle about 3 tablespoons carrot sauce around each mound."
    ],
    "ingredients": [
        "1/2 cup canola oil",
        "1/2 teaspoon turmeric",
        "1 tablespoon finely grated fresh lemon zest (from 2 lemons, grated with a rasplike Microplane zester)",
        "1 qt fresh carrot juice (from about 3 1/2 lb carrots)",
        "1 qt fresh orange juice",
        "1 tablespoon minced peeled fresh ginger",
        "2 stalks fresh lemongrass (lower 6 inches only), thinly sliced crosswise",
        "2 fresh Thai red chiles, minced, including seeds",
        "2 lb large shrimp in shell (21 to 25 per lb), peeled and deveined",
        "2 carrots, cut into very thin matchsticks",
        "3 navel oranges",
        "1 fennel bulb, halved lengthwise",
        "1 small red onion, halved lengthwise",
        "3/4 cup fresh lime juice",
        "1/4 cup 1-inch pieces fresh chives",
        "2 tablespoons finely chopped fresh mint",
        "1/2 teaspoon salt, or to taste",
        "Special equipment: a Japanese Benriner* or other adjustable-blade slicer; a rasplike Microplane zester"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Orange",
        "Shrimp",
        "Fennel",
        "Hot Pepper",
        "Carrot",
        "Summer",
        "Chive",
        "Lemongrass",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Shrimp Ceviche with Carrot, Orange, and Fennel",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-ceviche-with-carrot-orange-and-fennel-109509"
}
