{
    "directions": [
        "In a food processor blend the shallots, the garlic, the gingerroot, the Sherry, the salt, the sugar, the cornstarch, the egg white, the chopped coriander, and the soy sauce, add the shrimp, pulsing the motor, and purée the mixture until it is paste-like but not completely smooth.",
        "Spread 1 heaping tablespoon of the shrimp mixture on each slice of bread, rounding off the top, dip the coated side of each slice in the bread crumbs, shaking off the excess, and cut each slice into 4 triangles. The shrimp toasts may be prepared up to this point 1 day in advance and kept covered tightly with plastic wrap and chilled.",
        "In a large heavy skillet heat 1 1/2 inches of the oil to 360°F. and in it fry the shrimp toasts, coated sides down first, in batches, for 1 minute on each side, or until they are golden. Let the shrimp toasts drain well on paper towels, garnish each shrimp toast with some of the pickled ginger and 1 of the coriander leaves, and serve the shrimp toasts immediately."
    ],
    "ingredients": [
        "4 shallots",
        "4 garlic cloves",
        "1 teaspoon minced peeled fresh gingerroot",
        "2 teaspoons dry Sherry",
        "1/2 teaspoon salt",
        "1 teaspoon sugar",
        "1 tablespoon cornstarch",
        "1 tablespoon beaten egg white",
        "1 tablespoon finely chopped fresh coriander plus small leaves for garnish",
        "1 tablespoon light soy sauce",
        "1 pound shrimp (about 24), shelled, deveined if desired",
        "12 slices of homemade-type white bread, crusts discarded",
        "1 cup fine fresh bread crumbs",
        "vegetable oil for deep-frying",
        "1/4 cup pickled ginger (available at Asian markets and some specialty foods shops), drained and cut into julienne strips, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Garlic",
        "Ginger",
        "Appetizer",
        "Fry",
        "Quick & Easy",
        "Shrimp",
        "Chill",
        "Shallot",
        "Gourmet"
    ],
    "title": "Shrimp Toast with Pickled Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-toast-with-pickled-ginger-10459"
}
