{
    "directions": [
        "Set oven to broil. Brush individual pizza crusts with melted butter, and sprinkle with chopped parsley and garlic salt. Place on a baking sheet and broil until sizzling. Remove, and set aside.",
        "Heat 1 cup oil in a heavy skillet over medium-high heat. In batches, place tortilla strips in hot oil, and cook until crisp. Remove to paper towels, and discard oil.",
        "Add whipping cream to a saucepan, and whisk over high heat. When the cream begins to boil, whisk in sour cream. Reduce to medium heat. Stir in chicken bouillon and jalapeno juice, and simmer.",
        "In a separate saucepan, warm 2 tablespoons butter over medium heat. Whisk in flour; continue whisking until the mixture is a pale golden color. Then whisk flour mixture into cream mixture, whisking until well blended. Remove from heat, and stir in jalapenos and cheese. Set aside.",
        "Warm 1 tablespoon vegetable oil in a Dutch oven over medium-high heat. Stir in salt pork, and brown on all sides. Remove salt pork to paper towels, and discard oil.",
        "Warm 6 tablespoons butter in a large Dutch oven over medium heat. Stir in onions, celery, green and red bell peppers, garlic, and thyme. Cook until the vegetables are softened, about 5 minutes. Stir in the corn, and cook about 5 minutes, stirring. Stir in andouille and salt pork. Season with salt, pepper, 1/4 cup parsley, and Creole seasoning; cook about 10 minutes. Add shrimp, and cook until pink, about 5 minutes. Drain the butter sauce off of the shrimp and meats, and reserve the sauce in a bowl or jar.",
        "Stir the cream sauce into the shrimp and meat mixture. Stir in 3 cups of penne pasta. Reduce the heat to medium low, and simmer for 5 to 10 minutes.",
        "To serve, place pizza bread in the bottom of individual bowls. Ladle a spoonful or two of the reserved butter sauce over the bread, then ladle over sauce. Add more pasta, if desired. Sprinkle with Creole seasoning, and top with crispy tortilla strips."
    ],
    "ingredients": [
        "8 mini baked pizza crusts",
        "2 tablespoons butter, melted",
        "2 tablespoons chopped fresh parsley",
        "garlic salt to taste",
        "1 cup oil for frying",
        "8 (6 inch) corn tortillas, cut into strips",
        "Creamy Jalapeno Sauce:",
        "2 cups whipping cream",
        "1 cup sour cream",
        "1 teaspoon chicken bouillon granules",
        "1 tablespoon liquid from the jar of jalapeno peppers",
        "2 tablespoons butter",
        "1 tablespoon flour",
        "2 tablespoons diced jalapeno peppers",
        "4 ounces shredded Monterey Jack cheese",
        "Macque Choux:",
        "1 tablespoon vegetable oil",
        "1/2 pound salt pork*, julienned",
        "6 tablespoons butter",
        "1 cup chopped onions",
        "1/2 cup diced celery",
        "1/2 cup diced green bell pepper",
        "1/2 cup diced red bell pepper",
        "5 cloves garlic, minced",
        "1 tablespoon minced fresh thyme",
        "1 (20 ounce) package frozen corn",
        "1/2 pound andouille sausage, sliced",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/4 cup minced fresh parsley",
        "Creole seasoning to taste",
        "2 pounds medium shrimp - peeled and deveined",
        "4 cups cooked penne pasta"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shrimp Macque Choux",
    "url": "http://allrecipes.com/recipe/89469/shrimp-macque-choux/"
}
