{
    "directions": [
        "Bring clam juice, 2 1/4 cups water, and cream to boil in heavy large saucepan over medium-high heat. Gradually whisk in polenta. Reduce heat to medium-low. Simmer polenta until thick and tender, stirring constantly, 15 to 20 minutes. Add hot pepper sauce; season with salt and freshly ground pepper. Cover to keep warm (if polenta becomes firm, add 1/3 cup water and stir over low heat to loosen and rewarm).",
        "Heat oil in large skillet over medium-high heat. Sprinkle shrimp on 1 side with coarse salt and pepper. Add to skillet; sear 1 minute per side. Transfer shrimp to plate. Add fennel, tomatoes, shallots, preserved lemon, and garlic. Sauté until fennel is tender, about 4 minutes. Add Pernod; boil 1 minute. Add cream; boil 1 minute. Return shrimp to skillet. Toss until just opaque in center, about 1 minute.",
        "Spoon polenta onto plates. Top with shrimp and sauce."
    ],
    "ingredients": [
        "4 1/2 8-ounce bottles clam juice",
        "2 1/4 cups (or more) water",
        "3/4 cup heavy whipping cream",
        "1 1/2 cups polenta (coarse cornmeal)",
        "3/4 teaspoon hot pepper sauce",
        "Coarse kosher salt",
        "2 tablespoons extra-virgin olive oil",
        "12 uncooked extra-large shrimp (8 to 10 per pound), peeled, deveined, butterflied, flattened",
        "1 cup finely chopped fresh fennel",
        "1/2 cup finely chopped plum tomatoes",
        "1/3 cup minced shallots",
        "4 teaspoons chopped Quick-Preserved Lemon",
        "1/4 cup Pernod or other anise-flavored liqueur",
        "1/2 cup heavy whipping cream",
        "Ingredient Info: Polenta is sold at some supermarkets and at natural foods stores and Italian markets. If unavailable, substitute an equal amount of regular yellow cornmeal and cook about half as long."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Tomato",
        "High Fiber",
        "Backyard BBQ",
        "Dinner",
        "Cornmeal",
        "Shrimp",
        "Fennel",
        "Grill",
        "Grill/Barbecue",
        "Lemon Juice",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Shrimp Scampi with Quick Preserved Lemon and Fennel on Polenta",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-scampi-with-quick-preserved-lemon-and-fennel-on-polenta-360729"
}
