{
    "directions": [
        "Cut off artichoke stems with a serrated knife and discard. With scissors trim tips of leaves. In a large saucepan of boiling salted water cook artichokes 30 to 45 minutes, or until bottoms are tender when pierces with a knife.",
        "While artichokes are cooking, preheat oven to 500°F.",
        "Drop garlic into a food processor with motor running and mince. Turn motor off. Add lemon juice, black pepper, Worcestershire sauce, Tabasco, basil, salt, oregano, and cayenne and pulse to combine. Add butter and blend until combined well.",
        "Spread shrimp in 3-cup shallow baking dish large enough to hold them in one layer and sprinkle with scallions. Drop spoonfuls of butter mixture evenly over top and bake, stirring once or twice, until shrimp are cooked through, about 5 minutes.",
        "Invert artichokes on paper towels to drain. Divide artichokes and shrimp with sauce between soup plates and serve with crusty bread and lemon wedges."
    ],
    "ingredients": [
        "2 large artichokes (each about 3/4 pound)",
        "1 large garlic clove",
        "1 tablespoon fresh lemon juice or to taste",
        "1 tablespoon freshly ground black pepper",
        "2 teaspoons Worcestershire sauce",
        "1/2 teaspoon Tabasco",
        "1/2 teaspoon dried basil, crumbled",
        "1/2 teaspoon salt, or to taste",
        "1/4 teaspoon dried oregano, crumbled",
        "1/4 teaspoon cayenne",
        "1 stick (1/2 cup) cold unsalted butter, cut into bits",
        "1/2 pound small shrimp in their shells, preferably with heads (about 24)",
        "3 scallions, minced",
        "Accompaniments: crusty bread and lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Garlic",
        "Bake",
        "Lemon",
        "Shrimp",
        "Artichoke",
        "Boil",
        "Gourmet"
    ],
    "title": "Shrimp and Artichokes in Peppery Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-artichokes-in-peppery-butter-sauce-14416"
}
