{
    "directions": [
        "Make the shrimp broth: Remove the shells and tails from the shrimp and put the shells and tails in a medium saucepan. Clean and devein the shrimp and refrigerate until ready to use.",
        "Add the peppercorns, the intact onion piece, large celery chunks, 3 crushed garlic cloves and 2 bay leaves to the saucepan and cover with 5 cups of water. Bring to a high simmer and then lower the heat to maintain a low simmer. Cook until the water has reduced by about a third, 20 to 30 minutes. Let the broth cool completely and then strain (you should have about 3 cups. If you have less than 3 cups, add enough water to make up the difference).",
        "Make the jambalaya: Heat the oil in a large 12-inch skillet over medium heat. Add the flour and use a whisk to constantly stir until the mixture is toasted, about 2 minutes. Add the bell pepper, scallion whites, andouille, tomato paste, the chopped onion, celery and garlic, the remaining 2 bay leaves and 1 teaspoon of salt. Cook, stirring frequently, until the vegetables are soft, about 5 minutes (add splashes of shrimp broth or water if the mixture sticks at all). Add the rice and stir to coat.",
        "Pour in the remaining broth, crushed tomatoes, thyme, cayenne, half the scallion greens and 1 teaspoon of salt. Stir to combine and bring to a simmer. Adjust the heat to low, cover and cook for 15 minutes. Add the shrimp, cover and continue to cook until the rice is tender and the shrimp are cooked through, 5 to 7 minutes more. Remove the bay leaves.",
        "Sprinkle the top of the jambalaya with the parsley and remaining scallion greens. Serve with hot sauce."
    ],
    "ingredients": [
        "1 pound shell-on shrimp",
        "1 teaspoon black peppercorns",
        "1 onion, 1 half left intact, the other chopped",
        "3 celery stalks, 1 cut into large chunks and 2 chopped",
        "5 garlic cloves, 3 crushed and 2 chopped",
        "4 bay leaves",
        "2 tablespoons vegetable oil",
        "2 tablespoons all-purpose flour",
        "1 green bell pepper, chopped",
        "1 bunch scallions, chopped, white and green parts separated",
        "2 links (about 5 1/2 ounces) andouille sausage, chopped",
        "1 tablespoon tomato paste",
        "Kosher salt",
        "1 cup long-grain rice",
        "One 15-ounce can crushed tomatoes",
        "1 teaspoon dried thyme",
        "Large pinch cayenne pepper",
        "1/2 cup parsley leaves, roughly chopped",
        "Louisiana-style hot sauce, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Cajun",
        "Jambalaya Recipes",
        "Shellfish Recipes",
        "Shrimp",
        "Main Dish Recipes"
    ],
    "title": "Shrimp Jambalaya",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/shrimp-jambalaya"
}
