{
    "directions": [
        "If using bean-thread noodles, in a bowl soak them in warm water to cover 10 minutes and drain. In a small saucepan of boiling salted water cook bean-thread noodles 3 minutes. (Alternatively, cook angel's hair pasta in boiling salted water until al dente.) In a colander drain bean-thread noodles or angel's hair pasta and rinse under cold water to stop cooking.",
        "Butterfly each shrimp by cutting almost completely through lengthwise along outside curve and devein.",
        "In pan simmer broth, jalapeño, reserved coriander stems, and gingerroot, covered, 5 minutes. While broth is simmering halve avocado lengthwise. Pit, peel, and cut avocado into lengthwise slices.",
        "Between 2 heated large shallow soup bowls divide radishes, scallions, mushrooms, avocado, noodles or pasta, and reserved coriander leaves, putting each ingredient in a separate mound.",
        "Season shrimp with salt and add to broth. Simmer broth mixture 3 minutes, or until shrimp are just cooked through, and with a slotted spoon transfer shrimp to soup bowls, arranging them on top of vegetables. Add lime juice to broth and pour broth mixture gently through a sieve into soup bowls over shrimp and vegetable mixture."
    ],
    "ingredients": [
        "a 1.8-ounce package bean-thread (cellophane) noodles",
        "8 jumbo shrimp (about 3/4 pound total), shelled, leaving tail and connecting shell segment intact",
        "1 3/4 cups fresh chicken broth",
        "1 fresh jalapeño chili, halved lengthwise (wear rubber gloves)",
        "8 fresh long coriander sprigs, washed, dried,and stems and leaves reserved separately",
        "a 1/2-inch piece fresh gingerroot, peeled sliced thin, and cut into strips",
        "1/2 avocado (preferably California)",
        "2 radishes, sliced thin",
        "2 scallions, sliced thin",
        "2 large mushrooms, sliced thin",
        "1 tablespoon fresh lime juice, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Pasta",
        "Quick & Easy",
        "Low Cal",
        "Shrimp",
        "Winter",
        "Cilantro",
        "Simmer",
        "Boil",
        "Gourmet"
    ],
    "title": "Shrimp and Vegetables in Ginger Coriander Broth",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-vegetables-in-ginger-coriander-broth-14288"
}
