{
    "directions": [
        "Pour the Worcestershire sauce into a small saucepan over medium heat, and boil to reduce the sauce to 1/4 cup, about 10 minutes. Remove from heat and let cool, then stir in the hot pepper sauce. Set aside.",
        "In a large saucepan, bring the chicken stock to a boil, then stir in the grits. Cook the grits until thick and the chicken broth has been absorbed, about 30 minutes, stirring occasionally to break up grits sticking to the bottom of the pan. Pour in the half-and-half and milk, stir to combine, and bring back to a boil. Reduce heat to a simmer, and cook the grits an additional 30 minutes to absorb the cream and milk, stirring occasionally. Remove the grits from the heat, and set aside.",
        "Heat the canola oil in a large skillet over medium-high heat, and cook and stir the sliced sausage until the edges brown. Stir in the mushrooms, and cook and stir the mixture until the mushrooms have released their juice and the juice has been almost cooked away, about 10 minutes. Add the tomato, sprinkle with salt to help bring out the juice, and stir in the green onions and shrimp. Cook and stir the mixture until the shrimp have turned opaque and pink, about 4 minutes.",
        "Pour the reserved Worcestershire sauce mixture over the shrimp, mix well to thoroughly combine, and cook and stir the shrimp mixture for 3 to 4 minutes, until heated through and blended. Stir in the parsley and serve over hot cooked grits topped with Monterey Jack cheese."
    ],
    "ingredients": [
        "1/2 cup Worcestershire sauce",
        "1/4 cup hot pepper sauce",
        "1 (48 ounce) can chicken broth",
        "1 1/4 cups stone-ground corn grits",
        "1/2 cup half-and-half cream",
        "3/4 cup whole milk",
        "2 tablespoons canola oil",
        "1 (16 ounce) package smoked sausage, sliced diagonally into 1/8 inch slices",
        "1 (8 ounce) package sliced fresh mushrooms",
        "1/3 cup chopped fresh tomato",
        "1 pinch kosher salt",
        "1 bunch green onions, chopped",
        "1 pound uncooked shrimp, peeled and deveined",
        "1/3 cup chopped fresh flat-leaf parsley",
        "1/2 cup shredded Monterey Jack cheese (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shrimp and Grits for the Displaced Southerner",
    "url": "http://allrecipes.com/recipe/206587/shrimp-and-grits-for-the-displaced-so/"
}
