{
    "directions": [
        "In a heavy saucepan melt butter over moderately low heat and whisk in flour until smooth. Cook roux, whisking, 3 minutes. Whisk in stock, milk, Sherry, and lemon juice in a stream and simmer, whisking occasionally, until thickened, about 10 minutes. Sauce may be prepared up to this point 3 days ahead and chilled, its surface covered with plastic wrap.",
        "In a large non-stick skillet cook fennel and leeks with salt and pepper to taste in 2 tablespoons oil over moderate heat, stirring, until softened and beginning to turn golden and transfer to a large bowl.",
        "In skillet heat 1 tablespoon oil over moderately high heat until hot but not smoking and sauté shrimp with salt and pepper to taste until pink and just cooked through, about 30 seconds on each side. Add shrimp to fennel mixture.",
        "Remove tough muscle from side of each scallop and cut scallops into 1/2-inch pieces. In skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and sauté scallops and cod, stirring, until opaque and just cooked through, about 1 1/2 minutes. Add scallops and cod to shrimp mixture. In a small bowl whisk together egg and lemon juice and stir into seafood mixture.",
        "Transfer sauce to a bowl and whisk until smooth. In another bowl with an electric mixer beat cream until it just holds soft peaks and fold into sauce gently but thoroughly.",
        "Preheat oven to 375°F.",
        "Pour 1 cup sauce into a baking dish, 13 by 9 by 2 inches (sauce will not cover bottom completely), and cover with 3 lasagna sheets, making sure they do not touch each other. Spread one third shrimp mixture over pasta and sprinkle with 1 tablespoon bread crumbs. Drop one fourth remaining sauce onto shrimp mixture by spoonfuls and gently spread with back of spoon. Sprinkle 1/2 cup Parmesan over sauce and make 2 more layers in same manner, beginning and ending with pasta. Spread remaining sauce evenly over top, making sure pasta is completely covered, and sprinkle with remaining 1/4 cup Parmesan.",
        "Cover dish tightly with foil, tenting slightly to prevent foil from touching top layer, and bake in middle of oven 30 minutes. Remove foil and bake lasagna 10 minutes more, or until bubbling and golden. Let lasagna stand 5 minutes before serving."
    ],
    "ingredients": [
        "1/2 stick (1/4 cup) unsalted butter",
        "1/3 cup all-purpose flour",
        "2 cups white fish stock",
        "2 cups milk",
        "1/4 cup medium-dry Sherry",
        "1 tablespoon fresh lemon juice",
        "2 pounds fennel bulb (sometimes called anise), sliced thin and  chopped (about 4 cups)",
        "white and pale green parts of 1 1/2 pounds leeks, halved lengthwise, chopped, rinsed well, and drained (about 4 cups)",
        "4 tablespoons extra-virgin olive oil",
        "1 pound medium shrimp (31 to 35), shelled and cut crosswise into  1/2-inch pieces",
        "1 pound sea scallops",
        "1 pound cod fillet, cut into 3/4-inch dice",
        "1 large egg, beaten lightly",
        "4 teaspoons fresh lemon juice",
        "1 cup heavy cream",
        "twelve 7- by 3 1/2-inch sheets dry no-boil lasagne pasta",
        "3 tablespoons fine dry bread crumbs",
        "1 3/4 cups freshly grated Parmesan (about 7 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Fish",
        "Onion",
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Bake",
        "Cod",
        "Scallop",
        "Shrimp",
        "Winter",
        "Gourmet"
    ],
    "title": "Shrimp, Scallop, and Cod Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-scallop-and-cod-lasagne-13493"
}
