{
    "directions": [
        "Char bell peppers over gas flame or in broiler until blackened on all sides. Remove from heat. Enclose peppers in paper bag. Let stand 10 minutes. Peel and seed peppers. Cut into 1/4-inch-thick strips. Set aside.",
        "Preheat broiler. Toss shrimp with 1 tablespoon oil. Place on baking sheet. Broil shrimp until just opaque in center, about 2 minutes. Cut shrimp lengthwise in half. Transfer to bowl.",
        "Preheat oven to 400°F. Brush 2 baking sheets with oil. Place 2 tortillas on 1 prepared baking sheet. Place 1 tortilla on second prepared baking sheet. Sprinkle 1/4 cup chopped cilantro over each tortilla, then 1/3 cup Monterey Jack cheese and 1/3 cup cheddar cheese. Arrange 8 tomatillo slices atop cheese on each tortilla, then bell pepper strips and shrimp, dividing equally. Sprinkle remaining 1 cup Monterey Jack cheese over shrimp on each tortilla, dividing equally. Top with remaining 3 tortillas, pressing lightly to adhere. Brush tops of tortillas with oil. Bake quesadillas until cheese melts and tortillas are crisp, about 10 minutes.",
        "Cut each quesadilla into 6 wedges and serve."
    ],
    "ingredients": [
        "2 red bell peppers",
        "1 pound uncooked medium shrimp, peeled, deveined",
        "1 tablespoon vegetable oil",
        "Vegetable oil",
        "6 9- to 10-inch-diameter flour tortillas",
        "3/4 cup chopped fresh cilantro",
        "2 cups (packed) grated Monterey Jack cheese with jalapeños (about 8 ounces)",
        "1 cup (packed) grated sharp cheddar cheese (about 4 ounces)",
        "6 medium tomatillos , husked, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Vegetable",
        "Appetizer",
        "Broil",
        "Shrimp",
        "Fall",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Shrimp and Tomatillo Quesadillas",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-tomatillo-quesadillas-4403"
}
