{
    "directions": [
        "Position rack in center of oven and preheat to 400°F. Butter one 10-cup soufflé dish or six 1 1/4-cup soufflé dishes; sprinkle with Parmesan cheese to coat. (If using 1 1/4-cup dishes, place all 6 on rimmed baking sheet.) Combine crab, shrimp, roasted peppers and tarragon in processor; chop finely, using on/off turns.",
        "Melt butter in heavy large saucepan over medium heat. Add flour, shallot and cayenne. Cook without browning until mixture begins to bubble, whisking constantly, about 1 minute. Gradually whisk in milk, then wine. Cook until smooth, thick and beginning to boil, whisking constantly, about 2 minutes. Remove from heat. Mix yolks and salt in bowl. Add yolk mixture all at once to sauce; whisk in quickly. Stir in crab mixture. Using electric mixer, beat whites in large bowl until stiff but not dry. Fold 1/4 of whites into lukewarm soufflé base to lighten. Fold in 3/4 cup Parmesan cheese, then remaining whites. Transfer soufflé mixture to prepared dish.",
        "Place soufflé in oven. Bake soufflé until puffed, golden and gently set in center, about 40 minutes for large soufflé (or 25 minutes for small soufflés). Using oven mitts, transfer soufflé to platter and serve immediately."
    ],
    "ingredients": [
        "Grated Parmesan cheese",
        "1/2 cup crabmeat (about 3 1/2 ounces)",
        "1/2 cup small cooked shrimp (about 3 1/2 ounces)",
        "1/4 cup (packed) well-drained roasted red peppers from jar",
        "2 tablespoons fresh whole tarragon leaves",
        "1/4 cup (1/2 stick) butter",
        "5 tablespoons all purpose flour",
        "1 large shallot, minced",
        "1/8 teaspoon (scant) cayenne pepper",
        "1 1/4 cups whole milk",
        "1/4 cup dry white wine",
        "6 large egg yolks",
        "1 teaspoon salt",
        "8 large egg whites",
        "3/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Egg",
        "Pepper",
        "Shellfish",
        "Bake",
        "Parmesan",
        "Crab",
        "Shrimp",
        "Bell Pepper",
        "Tarragon",
        "Ramekin"
    ],
    "title": "Shrimp and Crab Souffles with Red Bell Pepper and Tarragon",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-crab-souffles-with-red-bell-pepper-and-tarragon-103236"
}
