{
    "directions": [
        "Char bell peppers over gas flame or in broiler until blackened on all sides. Enclose in paper bag. Let stand 10 minutes. Peel and seed peppers, then cut into matchstick-size strips. Transfer to large bowl. Add garbanzo beans and quartered artichoke hearts.",
        "Bring large saucepan of salted water to boil. Remove from heat. Add shrimp. Let stand until just cooked through, stirring occasionally, about 5 minutes. Drain. Pat dry with paper towels. Transfer shrimp to small bowl. Chill until cold. Wrap each shrimp with 1 prosciutto strip. (Can be made 8 hours ahead. Cover garbanzo bean mixture and prosciutto-wrapped shrimp separately and refrigerate.)",
        "Place radicchio leaves on plates. Toss garbanzo bean mixture with enough Balsamic Dressing to coat. Season to taste with salt and pepper. Spoon garbanzo bean mixture into radicchio leaves, dividing equally. Top with prosciutto-wrapped shrimp. Drizzle some dressing over shrimp. Garnish plates with pickled peppers and olives and serve."
    ],
    "ingredients": [
        "2 small red bell peppers",
        "3 15-ounce cans garbanzo beans (chickpeas), drained, rinsed",
        "10 canned artichoke hearts, drained, patted dry, quartered",
        "20 large uncooked shrimp, peeled, deveined, tails left intact",
        "5 paper-thin slices prosciutto, each slice cut lengthwise into 4 strips",
        "10 radicchio leaves",
        "Balsamic Dressing",
        "Pickled hot or sweet cherry peppers, drained",
        "Kalamata olives or other brine-cured black olives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Pork",
        "Appetizer",
        "Roast",
        "Shrimp",
        "Chickpea",
        "Bell Pepper",
        "Summer",
        "Prosciutto",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Shrimp and Prosciutto with Balsamic Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-prosciutto-with-balsamic-dressing-100986"
}
