{
    "directions": [
        "Bring shrimp shells and 7 cups water to a simmer and keep at a bare simmer, covered.",
        "Toss shrimp with 1/2 teaspoon salt, then chill, covered.",
        "Toss together peas, chives, zest, and pepper in a bowl.",
        "Cook onion in butter with remaining 3/4 teaspoon salt in a wide 4- to 5-quart heavy pot over moderately low heat, stirring, until softened, 3 to 5 minutes.",
        "Add rice and cook, stirring, 2 minutes. Increase heat to moderate, then add wine and cook, stirring, 1 minute. Stir in 1/2 cup simmering shrimp broth (pour through a sieve, then discard shells) and cook, stirring constantly and keeping at a strong simmer, until most of broth is absorbed. Continue cooking and adding broth, about 1/2 cup at a time, stirring constantly and letting each addition be absorbed before adding next, until rice is tender and creamy-looking but still al dente, about 18 minutes total. Add shrimp and pea mixture and continue to cook, stirring and adding more broth as necessary, until shrimp are just cooked through, 3 to 5 minutes. (You may have some broth left over.) Season with salt and serve risotto immediately."
    ],
    "ingredients": [
        "3/4 lb medium shrimp in shell (31 to 35 per lb), peeled, deveined, and shells reserved",
        "7 cups water",
        "1 1/4 teaspoons salt",
        "1 cup thawed frozen baby peas (5 oz)",
        "1/4 cup chopped fresh chives",
        "1 teaspoon finely grated fresh lemon zest",
        "1/2 teaspoon black pepper",
        "1 medium onion, finely chopped",
        "3 tablespoons unsalted butter",
        "1 1/3 cups Arborio rice (9 oz)",
        "3/4 cup dry white wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Rice",
        "Sauté",
        "Quick & Easy",
        "Shrimp",
        "Pea",
        "White Wine",
        "Spring",
        "Summer",
        "Chive",
        "Gourmet"
    ],
    "title": "Shrimp and Pea Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-pea-risotto-109531"
}
