{
    "directions": [
        "Blanch 3/4 cup basil in a 2-quart saucepan of boiling salted water 2 minutes, then drain in a sieve and plunge into a bowl of ice water to stop cooking. Drain basil again and press out excess liquid. Purée basil with grapeseed oil in a blender 2 minutes. Pour mixture into an airtight container and chill 8 to 12 hours. Pour through a very fine sieve into a small bowl (do not press on solids).",
        "Squeeze juice from 1 lemon half into a large bowl of water, then drop same half into water.",
        "Keep stem attached and, at opposite end, cut off top inch of 1 artichoke with a serrated knife. Bend back outer leaves until they snap off close to base, then discard several more layers in same manner until you reach pale yellow leaves with pale green tips.",
        "Cut remaining leaves flush with top of artichoke bottom using a sharp knife, then trim dark green fibrous parts from base and sides of artichoke. Rub cut surfaces with remaining lemon half. Cut 1/4 inch from stem to expose inner core. Trim sides of stem (still attached) down to pale inner core. Rub cut surfaces with same lemon half. Cut artichoke into 4 wedges, then cut out any remaining purple leaves and fuzzy choke and drop artichoke wedges into lemon water. Prepare remaining 3 artichokes in same manner.",
        "Cook onion in olive oil in a 12-inch heavy skillet over moderate heat, stirring occasionally, until softened, about 5 minutes. Drain artichokes and pat dry with paper towels. Arrange artichokes over onion, then add wine and simmer, covered, until artichokes are tender, 30 to 40 minutes. Transfer mixture with a slotted spoon to a large bowl and keep warm, covered.",
        "Pat shrimp dry and sprinkle with salt, cayenne, and 1 tablespoon orange dust. Heat butter in cleaned skillet over moderately high heat until foam subsides, then cook shrimp until just cooked through, about 2 minutes on each side.",
        "Toss arugula, remaining 1/2 cup micro-basil, lemon juice, and remaining 2 teaspoons orange dust with artichoke mixture and season with salt. Divide mixture among 4 plates and arrange shrimp around salad. Drizzle each serving with some basil oil and sprinkle with additional orange dust."
    ],
    "ingredients": [
        "3/4 cup loosely packed fresh basil leaves plus 1/2 cup micro-basil or small basil leaves",
        "1/4 cup grapeseed oil",
        "1 lemon, halved",
        "4 large artichokes (12 ounces each)",
        "1 medium onion, thinly sliced",
        "2 tablespoons olive oil",
        "1 1/2 cups dry white wine",
        "16 extra-large (16 to 20 per pound) shrimp in shell without heads, peeled and deveined",
        "1/4 teaspoon salt",
        "1/8 teaspoon cayenne",
        "1 tablespoon plus 2 teaspoons orange dust plus additional to taste",
        "3 tablespoons unsalted butter",
        "8 ounces arugula, coarse stems discarded",
        "1 1/2 tablespoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Shellfish",
        "Basil",
        "Shrimp",
        "Artichoke",
        "Arugula",
        "White Wine",
        "Summer",
        "Gourmet"
    ],
    "title": "Shrimp with Orange Dust",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-with-orange-dust-107193"
}
