{
    "directions": [
        "Heat oil in a 1-quart heavy saucepan over moderate heat until hot but not smoking, then fry shallot, stirring, until golden brown, about 2 minutes. Transfer with a slotted spoon to paper towels to drain (shallots will crisp as they cool). Reserve oil.",
        "Soak tamarind pulp in boiling-hot water in a small bowl until softened, about 5 minutes. Force pulp through a sieve into a bowl, discarding solids. Add sugar, soy sauce, fish sauce, and 1 1/2 tablespoons lime juice and stir until sugar is dissolved.",
        "Halve, pit, and peel avocados. Cut into 1 1/2-inch chunks and toss with remaining 1 1/2 tablespoons lime juice in a bowl.",
        "Transfer reserved oil to a 12-inch heavy skillet and heat over moderately high heat until hot but not smoking, then sauté ginger, garlic, chiles, and salt, stirring constantly, until fragrant, about 30 seconds. Add shrimp and sauté, turning over once, 2 minutes total. Stir in tamarind mixture and simmer until shrimp are just cooked through, about 2 minutes more.",
        "Spoon shrimp and avocado over rice, then sprinkle with peanuts and fried shallot."
    ],
    "ingredients": [
        "1/4 cup vegetable oil",
        "1 large shallot, thinly sliced and separated into rings",
        "1/4 cup tamarind pulp (from a pliable block)",
        "1/2 cup boiling-hot water",
        "2 tablespoons sugar",
        "1 tablespoon soy sauce",
        "1 tablespoon Asian fish sauce",
        "3 tablespoons fresh lime juice",
        "2 firm-ripe California avocados",
        "1 tablespoon minced peeled fresh ginger",
        "1 garlic clove, minced",
        "2 (1 1/2- to 2-inch-long) fresh Thai chiles or 1 serrano, stemmed and minced (including seeds)",
        "1/4 teaspoon salt",
        "1 lb large shrimp in shell (21 to 25 per lb), peeled, leaving tail and first segment of shell intact, and deveined",
        "1/3 cup roasted salted peanuts, chopped",
        "Accompaniment: jasmine rice",
        "Garnish: fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Shellfish",
        "Sauté",
        "Dinner",
        "Seafood",
        "Shrimp",
        "Avocado",
        "Spring",
        "Tamarind",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Tree Nut Free"
    ],
    "title": "Shrimp and Avocado in Tamarind Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-avocado-in-tamarind-sauce-231801"
}
