{
    "directions": [
        "Melt butter in a heavy-bottomed pot over medium-high heat. Cook andouille sausage in the melted butter until completely browned, about 5 minutes. Remove the sausage with a slotted spoon to a plate lined with paper towel.",
        "Cook and stir onion, celery, and green bell pepper in the butter remaining in the pot until the onion becomes translucent, 5 to 10 minutes.",
        "Stir garlic into the onion mixture; cook and stir together for 1 minute.",
        "Stir tomato paste through the vegetable mixture; cook and stir another 3 to 5 minutes.",
        "Return andouille sausage to the pot along with diced tomatoes, Worcestershire sauce, Cajun seasoning, and black pepper; stir to combine.",
        "Pour chicken broth over the sausage mixture; bring to a boil.",
        "Stir rice into the mixture, place a cover on the pot, reduce heat to medium-low, and cook undisturbed until the rice is tender, 25 to 30 minutes.",
        "Add shrimp and cod to the rice mixture. Increase heat to medium-high and cook until the mixture comes to a boil; reduce heat again to medium-low and cook uncovered another 10 minutes, stirring occasionally.",
        "Season with salt and fold parsley into the jambalaya to serve."
    ],
    "ingredients": [
        "1/4 cup butter",
        "10 ounces andouille sausage, halved lengthwise and cut into 1/4-inch half-moons",
        "1 cup diced onion",
        "1 cup diced celery",
        "1 cup diced green bell pepper",
        "1 1/2 teaspoons minced garlic",
        "1 (6 ounce) can tomato paste",
        "1 (14.5 ounce) can diced tomatoes",
        "2 teaspoons Worcestershire sauce (such as Lea & Perrins®)",
        "1 1/2 teaspoons Cajun seasoning (such as Tony Chachere's), or to taste",
        "1/2 teaspoon ground black pepper",
        "4 cups low-sodium chicken broth",
        "2 cups medium-grain rice",
        "3/4 pound shrimp, peeled and deveined",
        "3/4 pound cod fillets, cut into 1 1/2-inch chunks (optional)",
        "salt to taste",
        "1/3 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shrimp, Sausage, and Fish Jambalaya",
    "url": "http://allrecipes.com/recipe/220219/shrimp-sausage-and-fish-jambalaya/"
}
