{
    "directions": [
        "Whisk together vinaigrette ingredients with salt and pepper to taste.",
        "Cut peel, including all white pith, from fruit with a sharp paring knife and cut segments free from membranes. Halve enough grapefruit segments to measure 1 1/2 cups (reserve any remaining segments for another use).",
        "Coarsely chop hazelnuts. Melt butter in a 12-inch nonstick skillet over moderate heat until foam subsides, then cook hazelnuts with salt and pepper to taste, stirring, until a shade darker, about 5 minutes. Transfer nuts to paper towels to cool, reserving skillet.",
        "Quarter avocados lengthwise, then pit and peel. Cut lengthwise into 1/4-inch-thick slices. Drizzle with lime juice and season with salt and pepper.",
        "Pat shrimp dry and season with salt and pepper. Heat oil in skillet over moderately high heat until hot but not smoking, then sauté shrimp, turning them, until golden and just cooked through, about 3 minutes.",
        "Toss together spinach, half of grapefruit segments, and half of vinaigrette with salt and pepper to taste.",
        "Arrange avocados and remaining grapefruit on 4 plates and top with shrimp, salad, and sprouts. Spoon remaining vinaigrette over salad and sprinkle with nuts."
    ],
    "ingredients": [
        "1/4 cup fresh grapefruit juice",
        "2 teaspoons fresh lime juice",
        "1/4 teaspoon finely grated peeled fresh ginger",
        "1 tablespoon vegetable oil",
        "1 pink or red grapefruit",
        "1 white grapefruit",
        "1/4 cup hazelnuts, lightly toasted and any loose skins rubbed off",
        "1 tablespoon unsalted butter",
        "2 firm-ripe California avocados",
        "1 teaspoon fresh lime juice",
        "1/2 lb large shrimp (8 to 10), shelled and deveined",
        "1 tablespoon vegetable oil",
        "2 cups baby spinach (2 oz)",
        "1/4 cup trimmed sprouts (preferably radish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Citrus",
        "Fruit",
        "Nut",
        "Shellfish",
        "Appetizer",
        "Quick & Easy",
        "Lunch",
        "Grapefruit",
        "Shrimp",
        "Avocado",
        "Spinach",
        "Winter",
        "Hazelnut",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Shrimp and Avocado Salad with Grapefruit Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-avocado-salad-with-grapefruit-vinaigrette-106147"
}
