{
    "directions": [
        "Drain tomatoes, reserving juice, and finely chop. Bring stock and shrimp shells to a boil in a 3-quart saucepan, then simmer, partially covered, 15 minutes. Pour stock through a sieve into a bowl, discarding shells. (Stock will appear cloudy.) Devein shrimp, then halve lengthwise and toss with 1/2 teaspoon salt in a bowl. Chill shrimp, covered, until ready to use.",
        "Melt butter in a 6- to 7-quart heavy pot over moderately low heat, then add flour and cook roux, stirring constantly, until the color of peanut butter, 10 to 15 minutes. Add onion, bell pepper, and garlic and cook, stirring occasionally, until bell pepper is softened, 3 to 5 minutes. Stir in tomatoes with juice, stock, 1 cup water, 1 1/2 teaspoons salt, and cayenne and bring to a boil, stirring frequently. Reduce heat and simmer court bouillon, partially covered, 30 minutes.",
        "While courtbouillon simmers, bring remaining 1 1/4 cups water to a boil in a 1- to 1 1/2-quart heavy saucepan. Add rice and remaining 1/4 teaspoon salt and return to a boil. Cover pan, then reduce heat to low and cook until water is absorbed and rice is tender, about 15 minutes. Let stand, covered, 5 minutes, then fluff with a fork.",
        "Add shrimp to courtbouillon and simmer, uncovered, stirring occasionally, until shrimp are just cooked through, about 2 minutes. Stir in scallion greens.",
        "Divide rice among soup plates, then ladle in courtbouillon with shrimp."
    ],
    "ingredients": [
        "1 (1-lb) can whole tomatoes in juice",
        "5 cups white fish stock",
        "1 1/4 lb medium shrimp in shell (31 to 35 per lb), peeled, reserving shells",
        "2 1/4 teaspoons salt",
        "2 1/2 tablespoons unsalted butter",
        "1/4 cup plus 1 tablespoon all-purpose flour",
        "1 cup finely chopped onion (1 medium)",
        "3/4 cup finely chopped green bell pepper (1/2 medium)",
        "2 garlic cloves, minced",
        "2 1/4 cups water",
        "1/4 teaspoon cayenne, or to taste",
        "2/3 cup long-grain white rice",
        "1 1/2 cups thinly sliced scallion greens (from 2 bunches)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Onion",
        "Rice",
        "Shellfish",
        "Tomato",
        "Appetizer",
        "Sauté",
        "Christmas",
        "Shrimp",
        "Fall",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Shrimp Courtbouillon with Rice",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-courtbouillon-with-rice-231172"
}
