{
    "directions": [
        "Bring a large pot of salted water to a boil. Add the linguine and cook as the label directs.",
        "Meanwhile, heat a large skillet over medium-high heat. Pat the shrimp and scallops dry, then season with salt and pepper. Add 1 1/2 tablespoons butter to the pan and cook the shrimp until golden on one side, about 3 minutes. Turn the shrimp and add half of the garlic; cook until the garlic is fragrant but the shrimp are still translucent, 1 to 2 more minutes. Transfer the shrimp to a plate.",
        "Add the scallops to the skillet and cook until golden on one side, about 3 minutes. Turn the scallops, add the remaining garlic and cook 1 to 2 more minutes. Add the lemon juice and wine and bring to a boil, scraping up any browned bits with a wooden spoon. Cook until the sauce is reduced by half, about 3 minutes. Return the shrimp to the pan, then add the basil and the remaining 2 tablespoons butter; season with salt and pepper.",
        "Drain the pasta and transfer to a large serving bowl. Toss with the shrimp, scallops and sauce; garnish with parsley and lemon.",
        "Photograph by Kang Kim"
    ],
    "ingredients": [
        "Kosher salt",
        "1 pound linguine",
        "12 jumbo shrimp, peeled and deveined",
        "12 large sea scallops, tough foot muscles removed",
        "Freshly ground pepper",
        "3 1/2 tablespoons unsalted butter",
        "2 cloves garlic, minced",
        "2 tablespoons fresh lemon juice, plus lemon wedges for garnish",
        "1/2 cup dry white wine",
        "1/4 cup torn fresh basil",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Skillet Recipes",
        "Pasta Recipes",
        "Shellfish Recipes",
        "Shrimp",
        "Fruit",
        "Lemon Recipes",
        "Main Dish Recipes",
        "Lunch"
    ],
    "title": "Shrimp and Scallop Scampi with Linguine",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/shrimp-and-scallop-scampi-with-linguine-recipe"
}
