{
    "directions": [
        "Place a steamer insert into a saucepan and fill with water to just below the bottom of the insert. Bring the water to a boil. Add the edamame, place a cover on the saucepan, and steam until just tender, 2 to 6.",
        "Place steamed edamame in a food processor; blend until smooth. Transfer edamame puree to a large bowl.",
        "Stir the shrimp, bok choy, egg white, ginger, soy sauce, 1 tablespoon sesame oil, garlic, and salt into the edamame puree.",
        "Pour about 2 tablespoons water in a dish.",
        "Scoop about 1 teaspoon of the shrimp mixture onto the center of a dumpling wrapper.",
        "Wet the edge of the wrapper with water, then fold over to create a half-moon shape; pinch edge to seal.",
        "Place the finished dumpling on a lightly floured baking sheet and cover with a damp towel; repeat with remaining wrappers.",
        "Working in batches of 6 to 8 dumplings, heat about 1 tablespoon peanut oil in a large skillet over medium heat. Pan-fry dumplings until crispy on one side, about 2 minutes.",
        "Flip dumplings and cook for 1 more minute. Add 1/4 cup water to the skillet and cover.",
        "Steam dumplings until shrimp are bright pink and no longer transparent in the center, about 4 minutes more. Repeat with remaining dumplings.",
        "For the dipping sauce: Whisk low-sodium soy sauce, sesame oil, green onion, sugar, rice vinegar, and red pepper flakes together in a shallow bowl until sugar has dissolved."
    ],
    "ingredients": [
        "1 cup frozen shelled edamame (green soybeans)",
        "1/3 pound large shrimp - peeled, deveined, and cut into 1/3-inch pieces",
        "1/2 cup finely chopped bok choy",
        "1 egg white",
        "1 tablespoon minced fresh ginger root",
        "1 tablespoon soy sauce",
        "1 tablespoon sesame oil",
        "1 clove garlic, minced, or more to taste",
        "1 teaspoon salt",
        "2 tablespoons water",
        "36 dumpling wrappers",
        "1/4 cup peanut oil, divided",
        "1 cup water, divided",
        "1/2 cup low-sodium soy sauce",
        "1 tablespoon sesame oil",
        "1 green onion, sliced",
        "2 teaspoons white sugar",
        "1 tablespoon rice vinegar",
        "1/2 teaspoon red pepper flakes, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shrimp and Edamame Dumplings",
    "url": "http://allrecipes.com/recipe/220476/shrimp-and-edamame-dumplings/"
}
