{
    "directions": [
        "Peel and devein shrimp; reserve shells. Coarsely chop shrimp. Place shrimp in small bowl; cover and refrigerate.",
        "Melt 1 tablespoon butter in heavy medium saucepan over medium heat. Add onion and celery. Cover and cook until tender, stirring occasionally, about 5 minutes. Add reserved shrimp shells, 3 cups cold water and next 5 ingredients. Bring liquid to boil. Reduce heat to low and simmer until liquid is reduced to 5 cups, about 30 minutes. Strain shrimp stock; discard solids.",
        "Melt 4 tablespoons butter in heavy large pot over medium heat. Add flour and whisk until mixture bubbles but does not brown, about 3 minutes. Whisk in Madeira and tomato paste, then shrimp stock. Simmer until mixture thickens slightly, about 8 minutes. (Can be prepared 1 day ahead. Cool slightly. Cover and refrigerate. Bring soup to simmer before continuing.) Mix in half and half. Cook until soup is heated through (do not boil). Season soup to taste with salt and pepper.",
        "Meanwhile, melt remaining 2 tablespoons butter in heavy large skillet over medium-high heat. Add zucchini and red bell pepper. Sauté until vegetables are crisp-tender, about 3 minutes. Add reserved shrimp. Sauté just until shrimp are cooked through and vegetables are tender, about 3 minutes longer. Season shrimp mixture with salt and pepper.",
        "Spoon 1/3 cup shrimp mixture into center of each bowl. Ladle soup around shrimp mixture and serve."
    ],
    "ingredients": [
        "1 pound uncooked large shrimp",
        "7 tablespoons butter",
        "3/4 cup chopped onion",
        "3/4 cup chopped celery",
        "3 cups cold water",
        "2 cups bottled clam juice",
        "1 cup dry white wine",
        "2 fresh parsley sprigs",
        "1/4 teaspoon dried thyme",
        "1/4 teaspoon whole black peppercorns",
        "1/4 cup all purpose flour",
        "1/4 cup Madeira",
        "3 tablespoons tomato paste",
        "3/4 cup half and half",
        "1 medium zucchini, cut into 1/4-inch cubes",
        "1 medium-size red bell pepper, cut into 1/4-inch cubes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Tomato",
        "Lunch",
        "Shrimp",
        "Bell Pepper",
        "Zucchini",
        "Fortified Wine",
        "White Wine"
    ],
    "title": "Shrimp, Zucchini and Red Bell Pepper Bisque",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-zucchini-and-red-bell-pepper-bisque-5749"
}
