{
    "directions": [
        "Soak mushrooms in 1 1/2 cups hot water in medium bowl until softened, about 20 minutes. Drain mushrooms, reserving 1 cup soaking liquid. Squeeze out excess moisture. Cut off stems and discard. Cut caps in half. Toss mushrooms, shrimp, Sherry and 1 tablespoons cornstarch together in medium bowl to coat evenly. Let stand 15 minutes.",
        "Whisk 1 cup reserved mushroom soaking liquid, oyster sauce, remaining 1 tablespoon cornstarch and sugar in small bowl until cornstarch dissolves. Cover black beans with hot water and soak 1 minute. Drain beans and chop finely. Combine beans in small bowl with garlic, ginger, chili and half of green onions.",
        "Heat 1/4 cup oil in wok or heavy large skillet over high heat. Add shrimp mixture and stir-fry until shrimp curl and turn pink, about 2 minutes. Pour content of wok into sieve to drain shrimp.",
        "Line platter with cooked rice. Heat remaining 2 tablespoons peanut oil in same wok over high heat. Stir-fry black bean mixture until fragrant, about 1 minute. Return shrimp mixture to wok. Stir mushroom liquid mixture and add to wok. Cook until sauce thickens and begins to boil, stirring constantly, about 1 minute. Spoon contents of wok over rice on platter. Garnish with remaining green onions and serve."
    ],
    "ingredients": [
        "12 medium-size dried Chinese black mushrooms or dried shiitake mushrooms (about 1 ounce)",
        "1 1/2 cups hot water",
        "1 pound large uncooked shrimp, peeled, deveined",
        "1 tablespoon dry Sherry or dry white wine",
        "2 tablespoons cornstarch",
        "2 tablespoons oyster sauce",
        "1 1/2 teaspoons sugar",
        "2 tablespoons salted black beans",
        "1 1/2 tablespoons minced garlic",
        "1 1/2 tablespoons minced peeled fresh ginger",
        "1 tablespoon minced seeded red or green chili (such as serrano or jalapeño)",
        "2 green onions, finely chopped",
        "1/4 cup plus 2 tablespoons peanut oil",
        "Freshly cooked rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Garlic",
        "Ginger",
        "Mushroom",
        "Stir-Fry",
        "Shrimp"
    ],
    "title": "Shrimp and Mushrooms in Spicy Black Bean Oyster Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-mushrooms-in-spicy-black-bean-oyster-sauce-1609"
}
