{
    "directions": [
        "in a large bowl dissolve sugar in water. Sprinkle yeast over water and let stand until foamy, about 5 minutes. Stir in 2 cups flour and salt and blend mixture until it forms a dough. Knead dough on a floured surface, incorporating as much of remaining 1/4 cup flour as necessary to prevent dough from sticking, until smooth and elastic, about 5 minutes.",
        "(Alternatively, dough may be made in a food processor. Proof yeast as described above. In the food processor process yeast mixture with 2 cups flour and salt until mixture forms a ball, adding more water, 1 teaspoon at a time, if too dry or some of remaining 1/4 cup flour, 1 tablespoon at a time, if too wet, and knead dough by processing it 15 seconds more.)",
        "Put dough, prepared by either method, in a deep oiled bowl and turn to coat with oil. Let dough rise, covered with plastic wrap in a warm place 1 hour, or until doubled in bulk, and punch down. Dough is now ready to be formed into pizza.",
        "In a medium heavy saucepan cook onion, bell pepper, celery, and garlic in oil, covered, over moderately low heat, stirring, until celery is softened, about 10 minutes. Add tomatoes and juice, thyme, and cayenne and simmer, uncovered, stirring, until mixture is very thick, about 20 minutes. Season with salt and pepper. Sauce may be made 1 day ahead and chilled, covered.",
        "Stir in shrimp and cook sauce, stirring, until shrimp are cooked through, the liquid they give off is evaporated, and the sauce is thickened.",
        "Preheat oven to 500°F.",
        "Sprinkle cornmeal on an oiled 14-inch black steel pizza pan or black steel baking sheet. Roll out dough on a lightly floured surface into a 14-inch round and fit into pan. Sprinkle dough with half of mozzarella and top with shrimp Creole, spreading mixture evenly, and remaining cheese.",
        "Bake pizza in lower third of an electric oven or on floor of a gas oven 10 minutes, or until crust is golden."
    ],
    "ingredients": [
        "1 medium onion, chopped",
        "1 small green bell pepper, chopped",
        "1 celery rib, chopped",
        "1 large garlic clove, minced",
        "1 tablespoon vegetable oil",
        "1 14- to 16-ounce can whole peeled tomatoes including their juice, chopped",
        "1/4 teaspoon dried thyme, crumbled",
        "cayenne to taste",
        "1 pound small shrimp (about 48), shelled and deveined",
        "yellow cornmeal for sprinkling pan",
        "1/4 pound smoked mozzarella cheese*, grated (about 1 cup)",
        "*Available at specialty foods shops and some supermarkets",
        "1/2 teaspoon sugar",
        "2/3 cup warm water (110°F.-115°F.)",
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "2 to 2 1/4 cups unbleached flour",
        "1/2 teaspoon salt",
        "olive oil for oiling bowl"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Tomato",
        "Appetizer",
        "Bake",
        "Mozzarella",
        "Shrimp",
        "Bell Pepper",
        "Winter",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Shrimp Creole and Smoked Mozzarella Pizzas",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-creole-and-smoked-mozzarella-pizzas-11352"
}
