{
    "directions": [
        "Combine the shallots, 5 cloves garlic and 2 tablespoons of the olive oil in a mini food processor. Process to make a smooth paste.",
        "Pour 6 tablespoons olive oil and the remaining garlic into a large skillet over medium-high heat. Let the garlic sizzle for a minute, then add half of the shrimp and all of the thyme. Season with 1/2 teaspoon salt and cook until the shrimp are seared but not fully cooked, 1 to 2 minutes. Remove to a plate and repeat with the remaining shrimp and another 1/2 teaspoon salt. Remove the shrimp and thyme from the skillet to the plate.",
        "Add the remaining 4 tablespoons olive oil and the garlic-shallot paste to the same skillet set over medium heat. Cook, stirring constantly, until the paste has dried out and begins to stick to the bottom of the skillet, 2 to 3 minutes. Return the thyme to the skillet and pour in the white wine, lemon juice, the remaining 1 1/2 teaspoons salt, 4 tablespoons butter and 1 cup water. Bring the sauce to a rapid boil and cook until reduced by half, 4 to 5 minutes.",
        "When the sauce has reduced, whisk in the remaining butter and return the shrimp to the pan. Cook and toss until the shrimp are coated with the sauce and just cooked through, 2 to 3 minutes. Stir in the parsley. If the sauce still seems too thin, stir in the breadcrumbs and bring to a boil just to thicken. Serve immediately.",
        "Photograph by David Malosh"
    ],
    "ingredients": [
        "3 shallots, peeled and chopped (about 1/2 cup)",
        "7 cloves garlic, crushed and peeled",
        "3/4 cup extra-virgin olive oil",
        "2 pounds extra-large or jumbo shrimp, peeled and deveined",
        "4 sprigs fresh thyme",
        "2 1/2 teaspoons kosher salt",
        "2 cups dry white wine",
        "2 tablespoons freshly squeezed lemon juice",
        "6 tablespoons unsalted butter",
        "1/2 cup chopped fresh Italian parsley",
        "1 tablespoon dry breadcrumbs, if needed"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Shrimp Recipes",
        "Easy Recipes",
        "Shellfish Recipes",
        "Shrimp",
        "Italian",
        "Fruit",
        "Lemon Recipes",
        "Shallot Recipes",
        "Vegetable"
    ],
    "title": "Shrimp Scampi",
    "url": "http://www.foodnetwork.com/recipes/shrimp-scampi-recipe2"
}
