{
    "directions": [
        "Melt the butter with the olive oil in a large skillet over a medium-high heat. Add the shrimp and garlic, then saute until the shrimp are opaque, about 3 minutes. Remove the shrimp to a plate.",
        "Increase the heat to high, then throw in the zucchini. Stir it around for about 45 seconds, then scoot the zucchini to the edges of the pan. Throw in the corn and cook it for a minute, then push it to the edges of the pan. Throw in the grape tomatoes, stir them around for a minute, then sprinkle on some salt and pepper to taste.",
        "Then throw the shrimp back in. Stir everything around for about 45 seconds, or until it's all combined and hot. Then pour it onto a big platter.",
        "Sprinkle on the fresh basil and some Parmesan shavings then ... this is the best part ... squeeze the lemon all over the top. This adds a wonderful, indescribable freshness.",
        "You can serve this with rice, with pasta or it's just perfect on its own."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "2 pounds jumbo shrimp, peeled and deveined, tails on",
        "4 cloves garlic, minced",
        "2 large zucchini, diced",
        "2 large ears of corn, kernels removed",
        "3/4 cup red grape tomatoes, sliced in half lengthwise",
        "3/4 cup yellow grape tomatoes, sliced in half lengthwise",
        "Salt and freshly ground black pepper",
        "12 to 18 fresh basil leaves, cut in chiffonade",
        "Parmesan shavings",
        "Juice of 1 lemon",
        "Rice or pasta, for serving, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Shellfish Recipes",
        "Shrimp",
        "Vegetable",
        "Main Dish Recipes",
        "Low Calorie",
        "Low-Fat",
        "Gluten Free",
        "Diabetes-Friendly",
        "Stir-Frying Recipes",
        "Sauteing Recipes"
    ],
    "title": "Shrimp Stir-Fry",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/shrimp-stir-fry"
}
