{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.",
        "Bring the water and 3/4 teaspoon of salt to a boil in a large pot. Whisk in the grits and return to a boil. Reduce heat to low, and cook, stirring frequently until the grits are tender and very thick, about 30 minutes. Remove from the heat, and stir in 1 3/4 teaspoons of salt and 1/2 teaspoon of pepper, 1/2 cup butter, 2 tablespoons garlic, and the Cheddar cheese until the cheese has melted. Beat the eggs in a bowl with the milk until smooth, then stir into the grits until evenly combined. Pour into the prepared baking dish.",
        "Bake in the preheated oven until the grits are hot in the center, and the top is golden brown, about 1 hour.",
        "Meanwhile, melt the clarified butter in a skillet over medium heat. Stir in 2 tablespoons of garlic, and cook until golden, about 2 minutes. Add the leeks, and cook 1 minute more. Stir in the morel mushrooms, oyster mushrooms, chanterelle mushrooms, tomatoes, and Creole seasoning; cook and stir until the mushrooms begin to release their liquid, about 3 minutes. Pour in the cognac and simmer 2 minutes before pouring in the shrimp stock and veal stock. Return to a simmer, and cook until the liquid has reduced by half. Stir in the shrimp, thyme, and 3 tablespoons of butter. Cook and stir over low heat until the shrimp is no longer translucent, about 4 minutes; season to taste with salt and pepper.",
        "Serve the shrimp and mushroom sauce alongside the baked grits."
    ],
    "ingredients": [
        "6 cups water",
        "3/4 teaspoon salt",
        "2 cups yellow grits",
        "1 3/4 teaspoons salt",
        "1/2 teaspoon ground black pepper",
        "1/2 cup unsalted butter",
        "2 tablespoons minced garlic",
        "1 (8 ounce) package shredded Cheddar cheese",
        "3 eggs",
        "1 cup whole milk",
        "1/4 cup clarified butter",
        "2 tablespoons minced garlic",
        "1 leek, halved and cut into 1/4-inch pieces",
        "2 ounces fresh morel mushrooms, chopped",
        "3 ounces fresh oyster mushrooms, chopped",
        "3 ounces fresh chanterelle mushrooms, chopped",
        "2 tomatoes, peeled, seeded, and chopped",
        "1 tablespoon Creole seasoning",
        "1/2 cup cognac",
        "1/2 cup shrimp stock",
        "1/3 cup veal stock",
        "1 pound peeled and deveined gulf shrimp",
        "2 tablespoons chopped fresh thyme",
        "3 tablespoons unsalted butter",
        "salt and black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shrimp Cognac and Baked Cheese Grits",
    "url": "http://allrecipes.com/recipe/213556/shrimp-cognac-and-baked-cheese-grits/"
}
