{
    "directions": [
        "Separate the asparagus tips from the rest of the cut pieces, and set the tips aside. Heat 3/4 cup of olive oil over medium heat. Cook and stir the garlic in the hot oil until it begins to turn brown, about 5 minutes. Stir in the cut pieces of asparagus (not the tips), and season with salt and pepper. Cook and stir the asparagus until tender but still bright green, about 10 minutes, then add the asparagus tips. Cook and stir for 5 more minutes.",
        "While the asparagus is cooking, fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the fettuccine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink, return to the pot, and drizzle 2 teaspoons of olive oil over the pasta.",
        "Remove the asparagus from the skillet with a slotted spoon, leaving oil in skillet, and set the asparagus aside. Pat the shrimp dry with paper towels, and place in the hot skillet over medium-high heat. Sprinkle the shrimp with the seafood seasoning, and cook and stir the shrimp until they are pink and no longer translucent.  Return the asparagus to the skillet, and cook the shrimp and asparagus until thoroughly heated, 2 to 3 more minutes.",
        "Stir the shrimp and asparagus into the cooked fettuccine, and toss with shredded Parmesan cheese. The olive oil serves as the sauce, so add more as needed to generously coat the pasta, shrimp and asparagus."
    ],
    "ingredients": [
        "1 bunch fresh asparagus, trimmed and cut into 1 inch pieces",
        "3/4 cup olive oil, or more if needed",
        "6 cloves garlic, pressed",
        "salt and pepper to taste",
        "1 pound dry fettuccine pasta",
        "2 teaspoons olive oil",
        "1 pound uncooked shrimp - peeled, deveined, and tails removed",
        "2 tablespoons seafood seasoning (such as Old Bay®), or to taste",
        "1 cup shredded Parmesan cheese, or more if desired"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shrimp and Asparagus Fettuccine",
    "url": "http://allrecipes.com/recipe/213640/shrimp-and-asparagus-fettuccine/"
}
