{
    "directions": [
        "Heat oil in a 4- to 5-quart heavy pot over moderately high heat until hot but not smoking, then cook shrimp shells, stirring, 1 minute. Add water, onion halves, carrot, bay leaf, parsley, thyme, peppercorns, and salt and simmer, uncovered, 30 minutes.",
        "Pour stock through a large sieve lined with a dampened paper towel into a large bowl, discarding solids. Return stock to cleaned pot. Add shrimp and cook over high heat (stock will be hot but not boiling), stirring frequently, until just cooked through, about 2 minutes. Transfer shrimp with a slotted spoon to a large shallow baking pan, spreading in 1 layer to cool quickly. Boil stock until reduced to about 1 1/2 cups, 30 to 40 minutes, then transfer to a bowl.",
        "Stir together flour and 1 1/2 tablespoons butter until a paste forms, then set aside. Cook minced onion in 1 tablespoon butter in cleaned pot over moderately low heat, stirring, until softened, about 3 minutes. Add Sherry and boil until liquid is reduced to about 1/3 cup, about 2 minutes. Add shrimp stock and bring to a simmer, then reduce heat to low and whisk in remaining 5 1/2 tablespoons butter until just incorporated. Whisk in flour paste, bit by bit, and simmer sauce, whisking, until slightly thickened, about 2 minutes. Add lemon juice, shrimp, and salt and pepper to taste and cook over moderate heat, stirring, until shrimp are just heated through, about 1 minute."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "3 pounds medium shrimp in shell (31 to 35 per pound), rinsed, peeled, and shells reserved",
        "8 cups water",
        "1 onion, halved, plus 1/2 cup minced onion",
        "1 carrot, halved",
        "1 Turkish or 1/2 California bay leaf",
        "2 fresh parsley sprigs",
        "1 fresh thyme sprig",
        "1/2 teaspoon whole black peppercorns",
        "1 1/2 teaspoons salt",
        "1 1/2 tablespoons all-purpose flour",
        "1 stick (1/2 cup) unsalted butter, cut into tablespoon pieces and softened",
        "1/2 cup medium-dry Sherry",
        "2 teaspoons fresh lemon juice, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Shrimp",
        "Curry",
        "Sherry",
        "Simmer",
        "Gourmet"
    ],
    "title": "Shrimp in Sherry Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-in-sherry-butter-sauce-108107"
}
