{
    "directions": [
        "Whisk mayonnaise, 1/4 cup horseradish, and vinegar in a small bowl to blend. Season horseradish mayonnaise to taste with salt, pepper, and more horseradish, if desired. Fold in tarragon.",
        "line a baking sheet with paper towels. Combine dill, next 3 ingredients, and 3 tablespoons salt in a large wide pot. Squeeze juice from lemon halves into pot; add lemon halves. Add 3 quarts water and bring to a boil. reduce heat to medium; simmer poaching liquid for 10 minutes.",
        "Working in batches, place shrimp in a sieve and poach, shaking sieve occasionally, until shrimp just begin to curl and turn opaque, 15-20 seconds. Transfer to prepared sheet; let cool.",
        "Combine cucumber, shrimp, and 1/4 cup horseradish mayonnaise in a medium bowl; fold to coat. Season to taste with salt, pepper, and more horseradish, if desired. DO AHEAD: Can be made 8 hours ahead. Cover and chill shrimp and remaining mayonnaise separately."
    ],
    "ingredients": [
        "1 cup mayonnaise",
        "1/4 cup (or more) prepared horseradish",
        "2 teaspoons white wine vinegar",
        "3 tablespoons kosher salt plus more",
        "Freshly ground black pepper",
        "1 tablespoon chopped fresh tarragon",
        "1/2 bunch dill",
        "1 shallot, halved",
        "10 whole black peppercorns",
        "1 bay leaf",
        "1 lemon, halved",
        "1 pound frozen, thawed shelled wild Maine shrimp or small shrimp (preferably wild American) cut into 1/2\" pieces",
        "1/2 cup unpeeled English or Persian cucumber cut into 1/4\" pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Quick & Easy",
        "Lunch",
        "Horseradish",
        "Mayonnaise",
        "Shrimp",
        "Cucumber",
        "Summer",
        "Healthy",
        "Party",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Shrimp and Cucumber Salad with Horseradish Mayo",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-cucumber-salad-with-horseradish-mayo-395904"
}
