{
    "directions": [
        "Fill a large bowl with 10 cups cool water; stir in 1/4 cup salt (it should taste like seawater). Add shrimp and soak 30 minutes, then drain.",
        "Fill a medium pot with 8 cups water; stir in 1/4 cup salt. Bring to a boil, add shrimp, and immediately turn off heat. Let sit until pink, opaque, and barely cooked through, about 3 minutes. Drain, transfer to a large bowl, and let cool.",
        "Add tomato, onion, cucumber, chiles, lime juice, and cilantro to shrimp. Season with salt. Chill until ready to use.",
        "If frying tortillas, fit a large skillet with candy or deep-fry thermometer; pour in oil to measure 1\". Heat over medium-high until thermometer registers 375°F. Fry tortillas in batches until crispy, turning every 30 seconds, about 2 minutes total. Drain on paper towel-lined baking sheets and season with salt.",
        "Spread 1 heaping Tbsp. Hold-the-Lime Guacamole on a tostada shell. Top with 1/4 cup shrimp salad, then lettuce, crema, queso fresco, and salsa. Repeat with remaining tostada shells. Serve at room temperature.",
        "Shrimp salad can be chilled for up to 1 day. Bring to room temperature before serving."
    ],
    "ingredients": [
        "1/2 cup kosher salt, divided, plus more to taste",
        "1 pound small shrimp (51–60 count), peeled, deveined, tails removed",
        "3 plum or 2 regular medium tomatoes, seeded, finely chopped",
        "1 small (or 1/2 large) white onion, cut into 1/4\" cubes, rinsed with cool water, patted dry",
        "1/2 English hothouse cucumber, seeded, finely chopped",
        "3–4 serrano chiles, stemmed, seeded, deveined, finely chopped",
        "2/3 cup fresh lime juice",
        "1/2 cup coarsely chopped fresh cilantro",
        "24 small corn tortillas or store-bought crispy tostada shells",
        "Vegetable oil (for frying; if needed)",
        "Kosher salt (if needed)",
        "2 cups Hold-the-Lime Guacamole",
        "Shredded iceberg lettuce, crema (Mexican salted cream) or sour cream, queso fresco, tomatillo salsa (for serving)",
        "A candy or deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Low Fat",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Shrimp",
        "Spring",
        "Summer",
        "Healthy",
        "Tortillas",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Shrimp-Salad Tostadas with Tomatoes and Cucumber",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-salad-tostadas-with-tomatoes-and-cucumber-56389832"
}
