{
    "directions": [
        "Bring a large pot of water to a boil, and salt generously. Add the pasta, and boil according to package directions until al dente, tender but still slightly firm. Strain, and toss with a splash of oil.",
        "Meanwhile, arrange the shrimp in a single layer on a large pie pan or paper plate, and pat them with a paper towel until completely dry. Season with salt and pepper.",
        "Heat a large skillet over medium heat, and add 2 tablespoons of the butter. When the butter melts, raise the heat to medium-high, and invert the plate of shrimp over the skillet so the shrimp fall into the pan all at once. Cook the shrimp, without moving them, until the underside is pink, 1 to 2 minutes. Flip the shrimp, and cook until fully pink and cooked through, about 2 minutes more. Transfer the shrimp to a bowl.",
        "Reduce the heat to medium, and add the remaining 6 tablespoons butter. Scrape the bottom of the skillet with a wooden spoon to release any browned bits. When the butter has mostly melted, whisk in the cream and nutmeg and bring to a simmer, then cook for 2 minutes. Lower the heat to keep the sauce warm.",
        "Whisk the Parmigiano-Reggiano into the sauce. Add the shrimp and cooked pasta, and toss well. Season with salt and pepper. Serve hot in heated bowls."
    ],
    "ingredients": [
        "Kosher salt",
        "12 ounces fettuccine",
        "Olive oil, for tossing",
        "3/4 pound large shrimp (about 16), shelled and deveined, tails removed",
        "Freshly ground black pepper",
        "1 stick (8 tablespoons) unsalted butter",
        "2 cups heavy cream",
        "2 pinches freshly grated nutmeg",
        "1 1/2 cups freshly grated Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Alfredo",
        "Pasta Recipes",
        "Shellfish Recipes",
        "Shrimp",
        "Main Dish Recipes"
    ],
    "title": "Shrimp Fettuccine Alfredo",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/shrimp-fettuccine-alfredo"
}
