{
    "directions": [
        "Combine all broth ingredients in a 4- to 6-quart heavy pot and simmer, partially covered, 30 minutes. Pour through a fine-mesh sieve, then discard solids. Transfer broth to a 3-quart heavy saucepan and cover.",
        "Wash quinoa in 3 changes of cold water in a bowl, draining in fine-mesh sieve between changes of water. Return quinoa to bowl.",
        "Pat shrimp dry and sprinkle with teaspoon salt.",
        "Heat vegetable oil and achiote seeds in a 1 1/2- to 2-quart heavy saucepan over low heat until oil is bright yellow, about 10 minutes. Pour oil through sieve into cleaned 4- to 6-quart heavy pot, discarding seeds.",
        "Add 1 tablespoon butter to oil in pot and heat over moderately high heat until foam subsides, then cook shrimp and 1/4 teaspoon pepper, stirring, until shrimp are almost cooked through, 3 to 5 minutes. Transfer to a large bowl using a slotted spoon. (Do not clean pot.)",
        "Heat 2 tablespoons butter in pot over moderate heat until foam subsides, then cook mushrooms with 1/2 teaspoon salt and remaining 1/4 teaspoon pepper, stirring and scraping up any brown bits from bottom of pot, until mushrooms are softened and exude liquid, about 5 minutes. (If mushrooms do not exude liquid, add 1/2 cup water to help scrape up any brown bits.) Add mushrooms with liquid to shrimp. (Do not clean pot.)",
        "Heat olive oil and remaining tablespoon butter in pot over moderate heat until foam subsides, then cook onion, garlic, and remaining 1/2 teaspoon salt, stirring occasionally, until onion is softened, about 5 minutes. Add quinoa and aj amarillo and cook, stirring, 5 minutes. Add wine and saffron, then simmer briskly, stirring constantly, until wine is absorbed, about 5 minutes.",
        "Meanwhile, bring clam broth to a simmer and stir, then keep at a bare simmer.",
        "Add 1/2 cup broth to quinoa and simmer briskly, stirring constantly, until broth is absorbed. Continue simmering and adding hot broth, about 1/2 cup at a time, stirring quinoa frequently and letting each addition be absorbed before adding the next, until quinoa is tender and its germs separate from grains, about 30 minutes total. (There will be some broth left over.)",
        "Stir cream into risotto and bring to a simmer over moderate heat, then add shrimp mixture with any juices and cook, stirring, until shrimp are just cooked through, 1 to 2 minutes. Remove from heat and stir in cheese and 2 tablespoons basil, then season with salt and pepper. Serve sprinkled with remaining tablespoon basil."
    ],
    "ingredients": [
        "8 cups cold water",
        "2 lb small hard-shell clams (2 to 2 1/2 inches in diameter)",
        "1 celery rib, coarsely chopped",
        "1 large carrot, coarsely chopped",
        "1/2 large red onion, coarsely chopped",
        "1 Turkish or 1/2 California bay leaf",
        "1/4 teaspoon black pepper",
        "2 cups quinoa (12 ounces)",
        "2 lb medium shrimp in shell (31 to 35 per pound), peeled and deveined",
        "1 1/2 teaspoons salt",
        "1/3 cup vegetable oil",
        "1 tablespoon achiote (annatto) seeds",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/2 teaspoon black pepper",
        "1/2 lb cremini or button mushrooms, trimmed and sliced (3/4 inch thick; 3 cups)",
        "1/2 lb oyster mushrooms, trimmed and large caps halved lengthwise (2 3/4 cups)",
        "1 (5- to 6-oz) portabella mushroom cap, sliced (1/4 inch thick)",
        "2 tablespoons olive oil",
        "1/2 large red onion, thinly sliced",
        "2 garlic cloves, thinly sliced",
        "2 tablespoons bottled aj amarillo purée",
        "1 cup dry white wine",
        "3/4 teaspoon crumbled saffron threads",
        "1/2 cup heavy cream",
        "1/4 lb finely grated Parmigiano-Reggiano (2 cups)",
        "3 tablespoons chopped fresh basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Parmesan",
        "Quinoa",
        "Clam",
        "Shrimp",
        "White Wine",
        "Gourmet"
    ],
    "title": "Shrimp and Mushroom Quinoa Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-mushroom-quinoa-risotto-235472"
}
