{
    "directions": [
        "Bring yuca, water, onion, garlic, and 1/2 teaspoon salt to a boil in a 3-quart saucepan, then reduce heat and simmer, uncovered, until yuca is very tender, 10 to 15 minutes.",
        "Drain in a colander. When yuca is cool enough to handle, remove any stringy fibrous cores and transfer mixture to a food processor. Add coconut milk and remaining teaspoon salt and purée until very smooth, about 1 minute. Transfer to a bowl and keep warm, covered, until ready to serve.",
        "While yuca cooks, simmer shrimp shells in water with 1/2 teaspoon salt in a 1 1/2- to 2-quart saucepan, uncovered, until liquid is reduced to about 2 cups, about 20 minutes. Pour shrimp broth through a sieve into a bowl, discarding shells.",
        "Purée green bell pepper in cleaned food processor until smooth, about 1 minute.",
        "Heat olive oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then add pepper purée, onion, garlic, and 1/2 teaspoon salt (mixture will splatter) and sauté, stirring occasionally, until mixture starts to brown, 6 to 10 minutes. Add tomatoes, malagueta peppers or Thai chiles (if using), and 1 cup shrimp broth (reserve remainder for another use) and simmer, stirring occasionally, until liquid is reduced by half, about 6 minutes.",
        "Toss shrimp with remaining 1/2 teaspoon salt and add to tomato mixture. Cook, stirring frequently, until shrimp are just cooked through, 3 to 4 minutes.",
        "Remove from heat and stir in cilantro and dendê oil (if using). Serve shrimp over yuca purée.",
        "*Available at some Latino markets.",
        "**Available at some Latino markets and sendexnet.com."
    ],
    "ingredients": [
        "1 (16- to 18-oz) bag frozen peeled yuca*, not thawed",
        "4 cups water",
        "1 medium onion, chopped",
        "1 garlic clove, chopped",
        "1 1/2 teaspoons salt",
        "1 cup well-stirred canned unsweetened coconut milk (8 fl oz)",
        "2 lb large shrimp in shell (21 to 25 per lb), peeled and deveined, reserving shells",
        "3 cups water",
        "1 1/2 teaspoons salt",
        "1 green bell pepper, chopped",
        "1/4 cup extra-virgin olive oil",
        "1 medium onion, chopped",
        "1 garlic clove, finely chopped",
        "1 lb fresh tomatoes, chopped",
        "4 bottled red malagueta peppers or 1- to 2-inch fresh red Thai chiles*",
        "1/2 cup chopped fresh cilantro",
        "2 tablespoons dendê oil** (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Tomato",
        "Sauté",
        "Shrimp",
        "Bell Pepper",
        "Hot Pepper",
        "Yuca",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Shrimp in Yuca Coconut Purée",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-in-yuca-coconut-puree-232614"
}
