{
    "directions": [
        "In a large heavy skillet cook onion in oil over moderate heat, stirring, until softened. Add garlic and cook, stirring, 1 minute. Add remaining sauce ingredients and salt and pepper to taste and simmer sauce, stirring occasionally, 45 minutes, or until thickened. Discard bay leaf and in a food processor purée sauce until smooth. Tomato sauce may be prepared up to this point 2 days ahead and chilled, covered.",
        "In a small bowl stir together Creole seasoning ingredients.",
        "In a large heavy saucepan cook onion, celery, bell peppers, and jalapeño in oil over moderate heat, stirring frequently, until softened. Add garlic and cook 1 minute. Add Creole seasoning and cook, stirring, 1 minute. Add tomatoes and 2 cups sauce and simmer, stirring occasionally, 30 minutes. Creole sauce may be prepared up to this point 1 day ahead and chilled, covered. Bring Creole sauce to a simmer before proceeding.",
        "Discard bay leaves and add shrimp to Creole sauce. Simmer mixture, stirring occasionally, 3 minutes, or until shrimp are cooked through.",
        "Serve shrimp Creole over rice, garnished with parsley."
    ],
    "ingredients": [
        "1 large onion, chopped",
        "3 tablespoons olive oil",
        "3 garlic cloves, minced",
        "2 1/2 small cans (14 to 16 ounces each) whole tomatoes including juice",
        "a 6-ounce can tomato paste",
        "1 cup dry red wine",
        "1 tablespoon sugar",
        "1 teaspoon dried hot red pepper flakes, or to taste",
        "2 teaspoons dried oregano, crumbled",
        "1 bay leaf",
        "2 bay leaves",
        "1 teaspoon paprika",
        "3/4 teaspoon dried basil, crumbled",
        "3/4 teaspoon dried thyme, crumbled",
        "3/4 teaspoon salt",
        "1/2 teaspoon freshly ground white pepper",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon cayenne",
        "1/2 teaspoon dried oregano, crumbled",
        "1 onion, chopped",
        "1 celery rib, chopped",
        "1/2 green bell pepper, chopped",
        "1/2 red bell pepper, chopped",
        "1 fresh jalapeño chili, or to taste, seeded and chopped fine (wear rubber gloves)",
        "3 tablespoons olive oil",
        "2 garlic cloves, minced",
        "two 14- to 16-ounce cans whole tomatoes, drained and chopped coarse",
        "1 1/2 pounds medium shrimp (about 48), shelled and deveined if desired",
        "Accompaniment: cooked rice",
        "Garnish: 1/4 cup packed fresh parsley leaves, washed well, spun dry, and chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Tomato",
        "Mardi Gras",
        "Shrimp",
        "Spice",
        "Bell Pepper",
        "Winter",
        "Jalapeño",
        "Gourmet"
    ],
    "title": "Shrimp Creole",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-creole-11451"
}
