{
    "directions": [
        "Drain tofu and wrap firmly in cheese cloth; place between 2 cake pans or plates and place a 5-pound weight on top. Refrigerate for 12 to 16 hours.",
        "Combine soy sauce and 5-spice in a shallow bowl; add tofu. Marinate tofu in refrigerator for 15 minutes; flip tofu and marinate for 15 minutes more.",
        "Place rice noodles in a bowl and pour in enough boiling water to cover; allow to sit until noodles have softened, about 10 minutes. Drain and cut noodles into thirds.",
        "Combine brown sugar, lime juice, fish sauce, and vinegar in a bowl and stir until sugar is dissolved and sauce is smooth.",
        "Remove tofu from marinade and cut into 1/4-inch wide strips.",
        "Heat peanut oil in a large skillet or wok over medium-high heat; add tofu pieces, 2 to 4 at a time, and cook, stirring constantly, until lightly browned and cooked through, about 30 seconds per side. Transfer cooked tofu to a paper towel-lined plate, reserving oil in the skillet.",
        "Place 2/3 of the green onions and garlic in the same skillet, adding more oil if needed; cook and stir until fragrant, about 30 seconds. Add eggs; cook and stir until scrambled and cooked through, 2 to 3 minutes. Add shrimp; cook and stir until warmed through, about 30 seconds. Add noodles and toss until evenly mixed.",
        "Stir brown sugar sauce into noodle mixture and toss to coat. Add kimchi and toss until well mixed and pad Thai is heated through, about 1 minute more. Transfer pad Thai to serving plates and top with bean sprouts and remaining green onions."
    ],
    "ingredients": [
        "6 ounces extra-firm tofu",
        "1 1/2 cups soy sauce",
        "1 teaspoon Chinese five-spice powder",
        "4 ounces maifun (rice noodle sticks)",
        "boiling water to cover",
        "1/4 cup brown sugar",
        "2 tablespoons lime juice",
        "2 tablespoons fish sauce",
        "1 tablespoon rice wine vinegar",
        "2 tablespoons peanut oil, or more as needed",
        "1 cup chopped green onions (green parts only), divided",
        "2 teaspoons minced garlic",
        "2 eggs, well-beaten",
        "1/2 cup frozen cooked salad shrimp, thawed",
        "1/4 cup coarsely chopped kimchi",
        "3 ounces fresh bean sprouts"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shrimp and Tofu Pad Thai",
    "url": "http://allrecipes.com/recipe/246173/shrimp-and-tofu-pad-thai/"
}
