{
    "directions": [
        "Thaw shrimp, if frozen. Peel and devein shrimp, leaving tails intact (if desired). Rinse shrimp; pat dry with paper towels. Place shrimp in a resealable plastic bag.",
        "Combine the VOSKOS(R) Nonfat Vanilla Greek Yogurt, water, balsamic vinegar, vegetable oil, and rosemary in a bowl. Pour more than half of the mixture over the shrimp in the resealable bag; seal bag. Turn bag to combine mixture and coat shrimp. Marinate shrimp for 30 to 60 minutes in the refrigerator, turning occasionally. Reserve remaining marinade; chill.",
        "Drain shrimp, discarding marinade. Thread shrimp on four 12-inch skewers leaving a 1/4-inch space between shrimp. For a charcoal grill, place skewers on the grill rack; cover and grill directly over medium coals for 5 to 8 minutes or until shrimp are opaque, turning once and brushing with reserved marinade after turning. Discard remaining marinade. (For gas grill, preheat grill. Reduce heat to medium. Place skewers on grill rack over heat. Cover and grill as directed.) Serve with couscous.",
        "Fruited Couscous: Combine chicken broth and orange juice; bring to boiling. Stir in couscous; cover and remove from heat. Let stand 5 minutes. Stir in orange peel, green onions, and dried cherries. Serve with shrimp."
    ],
    "ingredients": [
        "20 fresh or frozen large shrimp in shells",
        "1 (5.3 ounce) container VOSKOS® Nonfat Vanilla Greek Yogurt",
        "1/2 cup water",
        "1/4 cup white balsamic vinegar",
        "1 tablespoon vegetable oil",
        "1 teaspoon dried rosemary, crushed",
        "Fruited Couscous:",
        "3/4 cup chicken broth",
        "1/3 cup orange juice",
        "3/4 cup couscous",
        "1/2 teaspoon finely shredded orange peel",
        "1/4 cup sliced green onions",
        "1/4 cup snipped dried cherries"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shrimp with Fruited Couscous",
    "url": "http://allrecipes.com/recipe/237943/shrimp-with-fruited-couscous/"
}
