{
    "directions": [
        "Cut white and pale green parts of scallions into 2-inch pieces and thinly slice dark green parts.",
        "Stir together shrimp, 1 tablespoon Sherry, cornstarch, white pepper, and 1/2 teaspoon salt in a bowl.",
        "Rinse cabbage in a colander. Tap colander lightly, then transfer cabbage to a large bowl with excess water clinging to leaves.",
        "Heat a 14-inch wok or 12-inch heavy skillet over high heat until beginning to smoke, then add 2 tablespoons oil. When oil begins to smoke, add shrimp and stir-fry until golden and almost cooked through, about 4 minutes. Transfer to a clean bowl.",
        "Add remaining tablespoon oil to wok and heat until just smoking, then stir-fry ginger and white and pale green parts of scallions until slightly softened, about 2 minutes. Add bell pepper and stir-fry until softened, about 2 minutes. Stir in remaining tablespoon Sherry and cook until most of liquid is evaporated. Add cabbage with water from bowl, soy sauce, and remaining 1/2 teaspoon salt and cook, covered, until cabbage is tender, about 5 minutes.",
        "Stir in shrimp along with any juices accumulated in bowl and simmer, uncovered, until shrimp are just cooked through, about 1 minute. Add scallion greens and toss to combine well."
    ],
    "ingredients": [
        "1 bunch scallions",
        "1 lb large shrimp in shell (16 to 20 per lb), peeled and deveined",
        "2 tablespoons medium-dry Sherry",
        "1 teaspoon cornstarch",
        "1/4 teaspoon white pepper",
        "1 teaspoon salt",
        "1 (2-lb) head Napa cabbage, quartered lengthwise, cored, and cut crosswise into 1 1/2-inch pieces (10 cups)",
        "3 tablespoons vegetable oil",
        "1 teaspoon minced peeled fresh ginger",
        "1 red bell pepper, cut into 1/4-inch-wide strips (1 cup)",
        "1 tablespoon soy sauce",
        "Accompaniment: cooked rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Shellfish",
        "Vegetable",
        "Stir-Fry",
        "Shrimp",
        "Sherry",
        "Spring",
        "Winter",
        "Gourmet"
    ],
    "title": "Shrimp with Napa Cabbage and Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-with-napa-cabbage-and-ginger-109017"
}
