{
    "directions": [
        "Mix butter, minced tarragon, chives, and lemon peel in small bowl.",
        "Melt 2 tablespoons herb butter in large skillet over medium heat. Add leeks and thyme; sauté 5 minutes. Reduce heat to medium-low; sauté until very tender, about 6 minutes longer.",
        "Bring 8 cups water and tarragon sprigs to boil in large saucepan over high heat. Add beans and cook until crisp-tender, about 4 minutes. Using slotted spoon, transfer beans to bowl of ice water. Add peas to boiling water; cook 2 minutes. Using slotted spoon, transfer peas to bowl with beans; drain. Add shrimp to saucepan, reduce heat, and simmer until opaque in center, about 2 minutes. Using slotted spoon, transfer shrimp to small bowl. Add shells to saucepan; boil until liquid is reduced to 1/4 cup, about 40 minutes. Discard shells and tarragon sprigs. Stir lemon juice into cooking liquid. Remove pan from heat; whisk in remaining herb butter. Stir in shrimp. Reheat leeks. Stir in beans and peas. Serve shrimp with sauce alongside vegetables."
    ],
    "ingredients": [
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1/2 cup minced fresh tarragon plus sprigs from 1 package fresh tarragon (tied together)",
        "4 teaspoons minced fresh chives",
        "2 1/2 teaspoons grated lemon peel",
        "4 cups chopped leeks (white and pale green parts only)",
        "1/2 teaspoon dried thyme",
        "12 ounces green beans, trimmed, cut into 1 1/2-inch pieces",
        "2 cups frozen petite peas",
        "16 uncooked jumbo shrimp, peeled, deveined, shells reserved",
        "2 tablespoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Sauté",
        "Shrimp",
        "Leek",
        "Green Bean",
        "Pea",
        "Tarragon",
        "Boil"
    ],
    "title": "Shrimp with Lemon, Tarragon, Green Beans, and Peas",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-with-lemon-tarragon-green-beans-and-peas-109382"
}
