{
    "directions": [
        "Toast the saffron, stirring over low heat, in a dry skillet until fragrant, then stir in the clam juice. Simmer until reduced to 1/2 cup, 5 to 6 minutes. Set saffron broth aside to cool. Whisk together the aj‭ amarillo, saffron broth, orange juice, and lime juice in a large bowl. Stir in diced and chopped vegetables and herbs.",
        "Now it’s time to poach the seafood. Have the bowls of ice water ready. Cut the shrimp in half lengthwise. Remove any tough muscles from the sides of the scallops. Poach shrimp in 4 quarts simmering salted water, stirring occasionally until just cooked through, 40 seconds. Scoop out shrimp with a slotted spoon and add to one bowl of ice water. Return water to a simmer and poach scallops the same way, transferring them to the second bowl of ice water and discarding the cooking water. Drain the seafood well and toss it in the saffron broth mixture. Season with salt and your favorite hot pepper sauce to taste. (We used a fruity habanero chile sauce.) Chill the ceviche, covered, 1 hour and serve garnished with sliced jalapeños and a sprig of cilantro.",
        "*A hot yellow chile paste available at Latino markets and by mail from Kitchen/Market, 888-468-4433."
    ],
    "ingredients": [
        "1/4 teaspoon crumbled saffron",
        "1 (8-oz) bottle clam juice",
        "2 tablespoons diced red onion",
        "2 tablespoons diced, seeded yellow tomato",
        "2 tablespoons chopped scallions",
        "2 tablespoons chopped fresh chives",
        "1 tablespoon chopped fresh cilantro",
        "3/4 to 1 teaspoon ají amarillo*",
        "6 tablespoons fresh orange juice",
        "1/4 cup fresh lime juice",
        "2 bowls of ice water",
        "1 pound shelled and deveined shrimp",
        "1/2 pound bay scallops (or quartered sea scallops)",
        "a red and a green jalapeño chile, thinly sliced crosswise for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Shellfish",
        "Tomato",
        "Appetizer",
        "Poach",
        "Scallop",
        "Shrimp",
        "Saffron",
        "Summer",
        "Jalapeño",
        "Gourmet"
    ],
    "title": "Shrimp and Scallop Ceviche",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-scallop-ceviche-103705"
}
