{
    "directions": [
        "Soak noodles in cold water to cover 15 minutes. Drain and cut in half with scissors.",
        "Heat a wok or large heavy skillet over high heat until a bead of water dropped on cooking surface evaporates immediately. Swirl 1 tablespoon peanut oil in wok to coat evenly and heat until just smoking. Stir-fry onion, ginger, and red pepper flakes 1 minute. Add mushrooms and stir-fry until just tender, about 2 minutes. Transfer mixture to a large bowl and season with salt.",
        "Swirl another tablespoon peanut oil in wok to coat evenly and heat until just smoking. Stir-fry bok choy until barely tender, then add scallions and salt to taste and stir-fry until bok choy is crisp-tender. Add to mushroom mixture.",
        "Pat shrimp dry and season with salt. Swirl remaining tablespoon peanut oil in wok and heat until just smoking. Stir-fry shrimp 2 minutes, or until just cooked through, and transfer to bowl with vegetables.",
        "Add broth and garlic to wok and bring to a boil. Stir noodles into broth and boil until tender and most of broth is absorbed, 4 to 5 minutes.",
        "Return shrimp and vegetables to wok and stir-fry until heated. Stir in sesame oil, jícama, and salt to taste.",
        "Serve stir-fry sprinkled with cilantro leaves."
    ],
    "ingredients": [
        "6 ounces bean thread noodles (preferably 1/8 to 1/4 inch wide)",
        "3 tablespoons peanut or vegetable oil",
        "1 medium onion, thinly sliced",
        "1 teaspoon minced peeled fresh ginger",
        "1/2 teaspoon dried hot red pepper flakes",
        "12 fresh shiitake mushrooms, coarse stems removed and caps halved",
        "4 heads baby bok choy (1pound total), leaves removed and bulb cut into thin wedges",
        "4 scallions, cut diagonally into 1-inch pieces",
        "1 pound large shrimp, shelled",
        "2 cups chicken broth",
        "2 garlic cloves, minced",
        "1 tablespoon Asian sesame oil",
        "1 small jícama (1 pound), peeled and cut into 2-inch-long julienne",
        "1/2 cup fresh cilantro leaves",
        "Accompaniment: lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Garlic",
        "Ginger",
        "Mushroom",
        "Onion",
        "Shellfish",
        "Stir-Fry",
        "Quick & Easy",
        "Shrimp",
        "Jícama",
        "Bok Choy",
        "Gourmet"
    ],
    "title": "Shrimp and Noodle Stir Fry",
    "url": "http://www.epicurious.com/recipes/food/views/shrimp-and-noodle-stir-fry-103376"
}
