{
    "directions": [
        "Mix goat meat, yogurt, prunes, ginger, garlic paste, 1 1/2 teaspoons salt, cumin, black pepper, turmeric, red chile pepper, cinnamon, and cloves together in a bowl. Cover bowl with plastic wrap and marinate in the refrigerator, 8 to 14 hours.",
        "Rinse the rice under lukewarm water 2 times. Place rice in a pot and cover with enough cold water to reach 1 1/4 to 1 1/2 inches above rice; soak for 1 hour.",
        "Melt unsalted butter in a large skillet over low heat; cook and stir onions until translucent and golden, about 10 minutes. Add tomatoes; cook and stir until oil separates and rises to the surface, 5 to 10 minutes.",
        "Mix marinated goat meat mixture and potatoes into onion mixture; cook and stir until meat is browned and cooked through, 20 to 30 minutes. Pour 1 1/2 cups cold water (or enough to cover) over goat meat mixture and cook until meat is tender, 30 to 40 minutes. Increase heat to medium and cook, stirring frequently, until oil separates from the mixture, about 5 minutes. Decrease heat to low and keep warm.",
        "Preheat oven to 275 degrees F (135 degrees C).",
        "Bring 12 cups water, 3 tablespoons salt, and 1 tablespoon butter to a boil in a large pot for 3 to 4 minutes. Drain rice and add to boiling water; cook for 10 minutes. Remove from heat and carefully drain water.",
        "Spoon 1/2 the rice into the bottom of a large baking dish; top with 1/2 the goat meat mixture. Arrange 1/2 the bay leaves over goat meat mixture. Repeat layering with remaining rice, goat meat mixture, and bay leaves. Cover dish with aluminum foil.",
        "Bake in the preheated oven until rice is fully cooked, 30 to 40 minutes."
    ],
    "ingredients": [
        "1 1/2 pounds goat meat",
        "1 1/4 cups plain Greek yogurt, stirred",
        "6 pitted prunes, or more to taste",
        "3 1/2 tablespoons diced fresh ginger",
        "1 1/4 tablespoons garlic paste",
        "1 1/2 teaspoons salt, or to taste",
        "1 1/2 teaspoons ground cumin",
        "1 1/2 teaspoons ground black pepper",
        "1 teaspoon turmeric powder",
        "1/2 teaspoon ground red chile pepper",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1 1/4 pounds basmati rice",
        "1 1/2 cups unsalted butter",
        "6 onions, thinly sliced",
        "4 ripe tomatoes, cut into 1/4-inch cubes",
        "4 potatoes, peeled and quartered",
        "1 1/2 cups cold water, or more as needed",
        "12 cups water",
        "3 tablespoons salt",
        "1 tablespoon butter",
        "4 bay leaves, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Shyam's Goat Biryani",
    "url": "http://allrecipes.com/recipe/237347/shyams-goat-biryani/"
}
