{
    "directions": [
        "Bring large pot of water to boil over high heat. Add beef; return water to boil. Reduce heat. Simmer until beef is brown on outside, turning occasionally, about 8 minutes; drain. Rinse beef under cold water until cool; cut into 1 1/2-inch cubes. Wipe out pot.",
        "Heat 1/4 cup oil in same pot over medium-high heat. Add ginger and garlic. Sauté 1 minute. Add chopped onions; sauté until translucent, about 3 minutes. Add chili bean paste; stir 30 seconds. Add 16 cups water, whole green onions, 1/2 cup soy sauce, 2 tablespoons salt, star anise, and rock sugar. Mix in beef. Tie peppercorns in cheesecloth; add to pot. Bring soup to boil. Reduce heat to medium-low. Gently simmer uncovered 1 hour, adjusting heat to avoid boiling.",
        "Add tomatoes to pot. Continue to simmer soup until beef is very tender, 45 to 60 minutes. Adjust seasoning, adding more soy sauce by tablespoonfuls and more salt, if desired. Season with pepper.",
        "Meanwhile, cook noodles according to package directions. Drain well.",
        "Divide noodles among large soup bowls. Add some bok choy to each, if desired. Ladle soup and meat over. Garnish with chopped green onions and cilantro. Serve with Pickled Mustard Greens .",
        "Chili bean paste is a spicy, fermented soybean paste. **Star anise—**a star-shaped seedpod—is available at some supermarkets. Chinese yellow rock sugar is made from raw sugar; it is often used in Chinese sauces and teas. Despite their name, Sichuan peppercorns aren't related to regular peppercorns; the mildly hot dried berries, which resemble split peppercorns, come from the prickly ash tree. Shandong la mian are Chinese wheat noodles. Look for these ingredients at specialty foods stores and Asian markets."
    ],
    "ingredients": [
        "5 pounds boneless beef shank",
        "1/4 cup vegetable oil",
        "1 2 1/2-inch piece fresh ginger, peeled, cut into 1/3-inch-thick rounds, each smashed with flat side of knife",
        "3 large garlic cloves, coarsely chopped",
        "2 cups chopped onions",
        "2 1/2 tablespoons chili bean paste (Sichuan hot bean paste; dou ban jiang)",
        "3 whole green onions, trimmed, plus 2 cups chopped green onions (for garnish)",
        "1/2 cup (or more) soy sauce (do not use low-sodium)",
        "2 tablespoons (or more) salt",
        "6 whole star anise",
        "2 1 1/2-inch cubes Chinese yellow rock sugar (about 2 1/2 ounces) or 2 1/2 tablespoons sugar",
        "1/2 tablespoon Sichuan peppercorns",
        "2 large plum tomatoes (about 8 ounces), each cut into 4 wedges",
        "Freshly ground white pepper or black pepper",
        "1 pound eggless Chinese wheat noodles (Shandong la mian)",
        "3 baby bok choy, each halved lengthwise, bottom 1 1/2 inches trimmed, rinsed (optional garnish)",
        "Chopped fresh cilantro (for garnish)",
        "Pickled Mustard Greens"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Ginger",
        "Low Fat",
        "Dinner",
        "Mustard Greens",
        "Noodle",
        "Simmer",
        "Green Onion/Scallion",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sichuan Beef Noodle Soup with Pickled Mustard Greens",
    "url": "http://www.epicurious.com/recipes/food/views/sichuan-beef-noodle-soup-with-pickled-mustard-greens-357515"
}
