{
    "directions": [
        "Prepare a hot fire in a grill.",
        "In a bowl, stir together the onion, 1 Tbs. of the olive oil, salt and pepper. Place the onion on the grill and cook, turning once, until browned and tender, 10 to 12 minutes total. Transfer to a plate.",
        "In a bowl, stir together the zucchini, the remaining 1 Tbs. oil, salt and pepper. Place the zucchini on the grill and cook, turning once, until just tender, 8 to 10 minutes total. Transfer to a plate.",
        "Place a grill-top pizza stone in the center of the grill and preheat over high heat until the thermometer on the stone registers 450°F. Turn the burners underneath the pizza stone to low and leave the outside burners on high.",
        "On a floured work surface, roll out the pizza dough into a 12-inch square about 1 inch thick, dusting with flour as needed. Sprinkle a pizza peel with cornmeal. Place the dough on the peel, and top the dough with the tomato sauce, provolone, zucchini, onion and tomatoes. Carefully slide the pizza onto the preheated stone. Cover the grill and cook until the cheese has melted and the crust is lightly browned, 15 to 20 minutes.",
        "Using the pizza peel, transfer the pizza to a cutting board and let cool for 5 minutes. Sprinkle with Parmigiano-Reggiano and basil and drizzle with olive oil. Cut into slices and serve immediately. Serves 4 to 6."
    ],
    "ingredients": [
        "1/2 red onion, peeled and cut into 4 wedges",
        "2 Tbs. olive oil, plus more for drizzling",
        "Salt and freshly ground pepper, to taste",
        "4 zucchini, cut lengthwise into slices 1/4 inch thick",
        "1/2 batch Sicilian-Style Pizza Dough",
        "Cornmeal for dusting",
        "1 cup tomato sauce",
        "2 cups grated provolone cheese",
        "1 cup grape tomatoes, halved",
        "Grated Parmigiano-Reggiano cheese for sprinkling",
        "2 Tbs. thinly sliced fresh basil"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Sicilian Zucchini Pizza",
    "url": "http://www.williams-sonoma.com/recipe/sicilian-zucchini-pizza.html"
}
