{
    "directions": [
        "Preheat oven to 350°F. Rub 13x9x2-inch glass baking dish with cut side of garlic clove. Brush dish with olive oil. Heat 2 tablespoons oil in heavy large skillet over medium heat. Add onions, sprinkle with coarse salt, and sauté until soft and beginning to brown, stirring frequently, about 13 minutes.",
        "Arrange 1/3 of potatoes in even layer in prepared dish. Sprinkle with coarse salt and pepper. Scatter half of onions over. Sprinkle with 2 tablespoons Pecorino Romano and 1 tablespoon capers. Repeat layering with half of remaining potatoes, coarse salt and pepper, remaining onions, 2 tablespoons Pecorino Romano, and 1 tablespoon capers. Drizzle with 1 tablespoon olive oil.",
        "Arrange remaining potato slices over. Sprinkle with coarse salt and pepper and remaining 1 tablespoon capers. Drizzle with remaining 1 tablespoon olive oil. Pour chicken broth over. Press down firmly on potatoes to compact gratin.",
        "Cover gratin tightly with foil and bake until potatoes are tender, about 1 hour 20 minutes. Uncover and sprinkle with remaining 4 tablespoons Pecorino Romano. Bake gratin uncovered until cheese is lightly browned, about 15 minutes. Let gratin stand 10 minutes at room temperature before serving."
    ],
    "ingredients": [
        "1 garlic clove, halved",
        "Olive oil for brushing plus 4 tablespoons, divided",
        "2 cups chopped onions",
        "Coarse kosher salt",
        "2 1/4 pounds russet potatoes, peeled, very thinly sliced",
        "8 tablespoons (packed) grated Pecorino Romano cheese, divided",
        "3 tablespoons drained capers",
        "2 cups low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Potato",
        "Side",
        "Bake",
        "High Fiber",
        "Casserole/Gratin",
        "Parmesan",
        "Winter",
        "Potluck",
        "Capers",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sicilian-Style Potato Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/sicilian-style-potato-gratin-241633"
}
