{
    "directions": [
        "Peel garlic. Trim stem ends of eggplants. Halve eggplants lengthwise and cut crosswise into 1/2-inch-thick slices. In a large sieve drain tomatoes. Transfer tomatoes to a bowl and squeeze to break into smaller pieces.",
        "In a 6-quart kettle bring 5 quarts salted water to a boil for pasta.",
        "In a 12-inch heavy skillet heat 1 cup oil over moderately high heat until hot but not smoking. Fry eggplant in 2 batches, turning, until golden brown on both sides. Transfer eggplant as fried with a slotted spoon to paper towels to drain, arranging it in one layer. Season eggplant with salt and pepper.",
        "Pour off oil from skillet and wipe clean with paper towels. Add remaining 1/4 cup oil to skillet and cook garlic over low heat, stirring, until golden. Stir in tomatoes with any juices that have accumulated in bowl and simmer, stirring frequently, until slightly thickened, about 15 minutes. Season sauce with salt and pepper.",
        "While sauce is simmering, cook pasta until al dente. Reserve 1 cup pasta cooking water and drain pasta in a colander. Transfer half of tomato sauce with half of ricotta salata to a large bowl and toss with pasta and half of eggplant, adding some reserved pasta cooking water if sauce becomes too thick. Transfer pasta to a serving bowl and top with remaining sauce and eggplant and some of remaining cheese.",
        "Garnish pasta with basil and serve remaining cheese on the side."
    ],
    "ingredients": [
        "3 garlic cloves",
        "1 pound Asian eggplants (about 6 medium)",
        "two 28- to 32-ounce cans whole tomatoes",
        "1 pound ridged ziti or rigatoni",
        "1 1/4 cups olive oil",
        "3 ounces freshly grated ricotta salata cheese (about 3/4 cup)",
        "Garnish: fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Tomato",
        "Vegetarian",
        "Dinner",
        "Basil",
        "Eggplant",
        "Summer",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sicilian Pasta with Eggplant",
    "url": "http://www.epicurious.com/recipes/food/views/sicilian-pasta-with-eggplant-101551"
}
