{
    "directions": [
        "Combine artichoke hearts, mayonnaise, Parmesan cheese, lemon zest, lemon juice, red pepper flakes, salt, and black pepper in a food processor or blender. Blend until smooth. Cover and refrigerate until ready to use.",
        "Heat olive oil in a large pot or Dutch oven over medium-high heat. Stir tri-tip steak slices into the hot oil and cook, stirring constantly until they begin to brown, about 3 minutes. Sprinkle with Italian seasoning, salt, and black pepper. Add onion, yellow pepper, orange pepper, sweet hot peppers, and garlic basil spread; cook and stir until onion begins to soften, about 5 minutes. Stir in mushrooms, capers, Marsala wine, and anchovy fillet and cook until mushrooms are browned and wine has evaporated, about 5 minutes.",
        "Place provolone cheese and Gorgonzola cheese on top of the hot beef mixture and gently fold until cheese is melted, about 2 minutes. Remove beef-cheese mixture from heat.",
        "Spread each hoagie bun with about 1/4 cup artichoke aioli. Spoon beef-cheese mixture into buns and garnish with basil."
    ],
    "ingredients": [
        "Artichoke Aioli:",
        "1 (6.5 ounce) jar marinated artichoke hearts, drained",
        "2 tablespoons mayonnaise",
        "2 tablespoons grated Parmesan cheese",
        "1 teaspoon lemon zest",
        "1/2 lemon, juiced",
        "1/4 teaspoon red pepper flakes",
        "salt and ground black pepper to taste",
        "Filling:",
        "2 tablespoons olive oil",
        "1 1/2 pounds beef tri-tip steak, thinly sliced",
        "1 teaspoon Italian seasoning",
        "1 onion, sliced thin",
        "1 yellow bell pepper, sliced into strips",
        "1 orange bell pepper, sliced into strips",
        "1/4 cup pickled sweet and hot pepper rings",
        "1/4 cup garlic basil spread (see footnote for recipe link)",
        "1 cup sliced mushrooms",
        "1 tablespoon capers",
        "1 tablespoon Marsala wine",
        "1 anchovy fillet (optional)",
        "12 slices aged provolone cheese",
        "1/4 cup crumbled Gorgonzola cheese",
        "Assembly:",
        "4 Italian-style hoagie buns, split lengthwise",
        "1/4 cup chopped fresh basil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sicilian Steak Sandwich",
    "url": "http://allrecipes.com/recipe/229854/sicilian-steak-sandwich/"
}
