{
    "directions": [
        "Soak the raisins in warm water until they plump, about 10 minutes.  Drain and set aside.",
        "Heat 3 tablespoons of olive oil in a saucepan over medium-high heat.  Stir in the onion, garlic, pine nuts, and olives.  Season with bay leaves, oregano, and cayenne.  Cook until the onions have softened and begun to turn golden, about 5 minutes. Stir in the tomatoes and season with salt and pepper; cook for 5 more minutes.  Add the raisins, balsamic vinegar, and sugar; cook, stirring occasionally until thickened, about 5 more minutes.  Remove the bay leaves, and stir in the julienned basil.  Cover and keep warm.",
        "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.",
        "While the pasta is cooking, heat the remaining 1 tablespoon of olive oil in a skillet over medium heat.  While the skillet is heating, toss the chicken with the lemon juice to coat (the lemon zest will be used later).  Cook the chicken on both sides until golden brown and the juices run clear, about 15 minutes.  Transfer to a warm plate, and allow to rest for about five minutes.",
        "To serve, slice each chicken breast against the grain into thin slices.  Divide the pasta into four wide, shallow bowls.  Fan the chicken slices out over top of the pasta, and spoon the tomato sauce over them.  Sprinkle with lemon zest, Parmesan cheese, and a sprig of basil to garnish."
    ],
    "ingredients": [
        "3/4 cup golden raisins",
        "3 tablespoons extra virgin olive oil",
        "1 medium onion, halved and thinly sliced",
        "1 tablespoon minced garlic",
        "2 tablespoons pine nuts",
        "2 tablespoons chopped black olives",
        "2 bay leaves",
        "1/4 teaspoon dried oregano",
        "1/4 teaspoon cayenne pepper",
        "1 (15 ounce) can diced tomatoes, drained",
        "salt and pepper to taste",
        "1 tablespoon balsamic vinegar",
        "1 teaspoon white sugar",
        "2 tablespoons julienned fresh basil",
        "1 (16 ounce) package angel hair pasta",
        "1 tablespoon extra virgin olive oil",
        "4 (6 ounce) skinless, boneless chicken breast halves",
        "1 lemon, zested and juiced",
        "1/4 cup shaved Parmesan cheese",
        "4 sprigs fresh basil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sicilian Lemon Chicken with Raisin-Tomato Sauce",
    "url": "http://allrecipes.com/recipe/109845/sicilian-lemon-chicken-with-raisin-to/"
}
