{
    "directions": [
        "In a saucepan, bring 2 cups water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes. Remove from heat and set aside.",
        "Place raisins in a small saucepan and cover with boiling water. Cook over low heat or 10 minutes. Remove from heat, drain and set aside.",
        "To Make Dough: In a medium bowl or in a food processor, combine flour and 1/3 cup superfine sugar. Cut in butter or pulse in processor until mixture looks like cornmeal. Mix in 1 egg yolk. Stir in ice water, 1 tablespoon at a time, until mixture holds together when you squeeze it. Wrap with plastic wrap and let rest in refrigerator for at least 2 hours.",
        "In a medium saucepan, combine cooked rice, milk, orange zest and 1 tablespoon of sugar. Cook over low heat, stirring frequently, until mixture is creamy and thick. Remove from heat. Whisk 3 egg yolks with 1/3 cup sugar in a large bowl. Gradually add hot rice mixture, about a cup at a time, whisking constantly. Stir in ricotta cheese, cooked raisins and cinnamon. Add vanilla and orange flower water. Let mixture cool to room temperature.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Roll out 3/4 of the pastry dough into an 11-inch circle and line the bottom and sides of a 9-inch springform pan. Cover lightly with plastic wrap and refrigerate. Roll out remaining dough into a 10-inch circle and cut into lattice strips.",
        "In a large glass or metal mixing bowl, beat egg whites until stiff peaks form. Fold 1/3 of the whites into the batter to lighten it, then quickly fold in remaining whites until no streaks remain.",
        "Pour filling into dough-lined pan. Criss-cross the lattice strips over the filling. Seal the lattice strips to the bottom pastry edge.",
        "Bake in preheated oven for an hour, or until pastry is golden brown. Cool at room temperature for about 4 hours, then keep refrigerated."
    ],
    "ingredients": [
        "1/2 cup butter, chilled",
        "1/3 cup superfine sugar",
        "1 egg yolk",
        "2 cups all-purpose flour",
        "3 tablespoons ice water, or as needed",
        "1 cup uncooked white rice",
        "2 cups water",
        "1/4 cup raisins",
        "1 1/3 cups milk",
        "1 1/2 tablespoons grated orange zest",
        "1 tablespoon white sugar",
        "1 cup ricotta cheese",
        "3 egg yolks",
        "1/3 cup white sugar",
        "1/8 teaspoon ground cinnamon",
        "1 teaspoon vanilla extract",
        "2 tablespoons orange flower water",
        "4 egg whites"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sicilian Easter Pie",
    "url": "http://allrecipes.com/recipe/19435/sicilian-easter-pie/"
}
