{
    "directions": [
        "1. Prepare crust: Sift flour, sugar, salt, and cinnamon into a bowl. Cut in the butter and shortening with a fork until the mixture resembles coarse meal. Moisten with just enough apple juice, tossing ingredients lightly with a fork. Form dough into a ball. Wrap and refrigerate for 2 hours.",
        "2. Cut off 1/3 of the dough and return it to the refrigerator. Roll out the other 2/3 between 2 sheets of wax paper. Line a greased 9-inch pie pan with the dough. Trim overhang and crimp decoratively. Preheat oven to 350°F.",
        "3. Whisk all filling ingredients, except apples, in a bowl. Add apples, then spoon into the pastry-lined pie pan. Combine topping ingredients and sprinkle over filling.",
        "4. Roll out the remaining dough between wax paper to form a circle 10 inches in diameter. Cut into strips 1/2-inch wide and arrange lattice-fashion over apples; trim ends of strips and crimp edges decoratively.",
        "5. Bake pie in the center of the oven until the juices are bubbling and the apples are tender, about 55-60 minutes. (Cover loosely with foil if the crust browns too quickly.) Serve warm or cooled."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "5 tablespoons sugar",
        "3/4 teaspoon salt",
        "3/4 teaspoon ground cinnamon",
        "6 tablespoons cold unsalted butter",
        "6 tablespoons cold shortening",
        "4 to 6 tablespoons apple juice",
        "2/3 cup sour cream",
        "1/3 cup sugar",
        "1 egg, lightly beaten",
        "1/4 teaspoon salt",
        "1 teaspoon vanilla extract",
        "3 tablespoons all-purpose flour",
        "5 or 6 tart apples, peeled and sliced",
        "3 tablespoons brown sugar",
        "3 tablespoons sugar",
        "1 teaspoon ground cinnamon",
        "1 cup chopped walnuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Apple",
        "Fall",
        "Sour Cream",
        "Parade",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Silver Palate Sour Cream Apple Pie",
    "url": "http://www.epicurious.com/recipes/food/views/silver-palate-sour-cream-apple-pie-106665"
}
