{
    "directions": [
        "Adjust oven rack to lower-middle position and heat oven to 450 degrees.",
        "Place lamb cubes in a bowl. Drizzle with 2 tablespoons oil and sprinkle generously with salt and pepper, turning to coat.",
        "Place Italian sausages, 1 cup water, and remaining 1 tablespoon oil in a large heavy roasting pan set over two burners. Cover with heavy-duty foil and turn heat to medium-high. Cook until sausages lose their raw color, about 5 minutes. Remove foil (reserve it) and continue to cook until water evaporates. Add smoked sausages and cook, turning frequently, until all sausages are browned, 5 to 8 minutes longer. Transfer to a plate. When cool enough to handle, cut Italian sausages into bite-size chunks. Halve smoked sausages lengthwise. Set aside.",
        "Generously sprinkle duck breasts with salt and pepper. Reduce heat under roasting pan and add duck breasts, skin side down. Cook until fat has rendered and skin is mahogany brown, 10 to 12 minutes.",
        "Turn duck breasts over and continue to cook until cooked through, about 5 minutes longer.",
        "Remove duck from pan. Drain fat from pan and reserve. Slice each breast crosswise into 4 pieces.",
        "Return roasting pan to medium-high heat. Add lamb cubes and cook, turning once, until a brown crust forms on two sides, 8 to 10 minutes. Transfer lamb to a large ovenproof pot; set roasting pan aside. Add broth mixture and wine to lamb and cover with reserved foil, pressing down so that it almost touches meat, then sealing foil around top of pot, leaving a small opening for steam to escape. Bring to a simmer and simmer for a few minutes to burn off alcohol.  Seal foil completely, then cover pot with lid. Bake, without checking pot, for 1 hour and 15 minutes; meat will be very tender.",
        "Meanwhile, reheat roasting pan over medium-high heat. Add enough reserved duck fat or olive oil to pan to equal 2 tablespoons. Add onions and garlic and saute until tender, about 5 minutes. Add prosciutto and thyme and saute to blend flavors, 1 to 2 minutes longer. Add tomatoes and beans and simmer to blend flavors, about 10 minutes. Remove from heat.",
        "Transfer cooked lamb and broth to roasting pan. Add duck, sausages, and enough water to make a soupy, moist casserole. You can let the cassoulet mixture stand at room temperature for up to 2 hours.",
        "An hour before serving, adjust oven rack to lower-middle position and heat oven to 350 degrees. Bring cassoulet to a simmer.",
        "Mix bread crumbs, melted butter, and parsley and sprinkle over cassoulet. Bake until crumbs are golden and stew is bubbly, about 45 minutes. Let stand for 5 minutes, and serve."
    ],
    "ingredients": [
        "3 pounds boneless lamb shoulder roast, cut into 11/2-inch cubes (or a combination of lamb and boneless pork shoulder roast)",
        "3 tablespoons olive oil",
        "Salt and freshly ground black pepper",
        "1 pound mild Italian sausages",
        "1 cup water for sausages",
        "1/2 pound kielbasa, cut into 6 pieces",
        "1 1/2 pounds boneless duck breast halves",
        "1 (14.5 ounce) can chicken broth",
        "2 cups water",
        "1 cup full-bodied dry red wine",
        "reserved duck fat",
        "2 large onions, cut into medium dice",
        "6 garlic cloves, minced",
        "2 ounces thinly sliced prosciutto, minced",
        "2 teaspoons dried thyme",
        "1 (14.5 ounce) can diced tomatoes",
        "6 (16 ounce) cans white beans, drained",
        "3 cups fresh bread crumbs (process sliced bread in a food processor or blender)",
        "3 tablespoons butter, melted",
        "1/3 cup minced fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Simplified Cassoulet",
    "url": "http://allrecipes.com/recipe/88825/simplified-cassoulet/"
}
