{
    "directions": [
        "1. Set a heavy-bottomed 12-inch nonstick or cast iron skillet over low heat while preparing meat, vegetable, garlic, and eggs. Marinate the meat in 1 tablespoon of soy sauce. Three to four minutes from making the fried rice, increase the heat to high and turn on the exhaust fan.",
        "2. Put 1 tablespoon of oil and the onion in the skillet; stir-fry until the onion is still crisp but starts to turn brown, about 1 minute. Add the raw meat or vegetable; stir-fry until crisp-tender for vegetables or lightly browned for meat, about 1 minute. Add the cooked meat or vegetable; stir-fry until lightly browned, about 1 minute longer. (If both meat and vegetables are raw or cooked, stir-fry the meat first, giving it a little head start.) Stir in the garlic, then transfer the mixture to a plate; set aside.",
        "3. Put the remaining 3 tablespoons oil in the skillet; heat until shimmering. Add the rice; stir-fry, breaking up clumps, until heated through, about 2 minutes. Add the egg; stir until scrambled, about 1 minute. Return the meat/vegetable mixture, along with the remaining 3 tablespoons of soy sauce and the scallions, to the pan and stir to combine. Serve immediately."
    ],
    "ingredients": [
        "1 medium onion, halved from pole to pole; each half cut into 6 wedges",
        "4 to 6 ounces meat of choice, cooked or raw, cut into bite-size pieces",
        "4 to 6 ounces vegetable of choice, cooked or raw, cut into bite-size pieces",
        "1 large garlic clove, minced",
        "2 large eggs, beaten",
        "4 tablespoons soy sauce",
        "4 tablespoons vegetable oil",
        "4 cups cooked rice",
        "4 scallions, white and green parts, minced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Rice",
        "Side",
        "Fry"
    ],
    "title": "Simple Fried Rice",
    "url": "http://www.epicurious.com/recipes/food/views/simple-fried-rice-358301"
}
