{
    "directions": [
        "Stir the flour, sugar, and the salt together in a large bowl, or in the bowl of a heavy-duty mixer. Make a well in the center, and pour the warm water in to the well. Sprinkle the yeast over the water and stir it in. Add the eggs to the well, and combine with the water. Gradually stir the dry ingredients into the wet to form a firm dough. Continue beating by hand for five minutes or in the mixer for 3 minutes until the dough is elastic. It will be somewhat sticky, but it shouldn't stick to your hands.",
        "Add the melted butter and mix just until it is incorporated. Now the dough will be more like a batter — sticky (it may stick to your fingers ) but not wet.",
        "Cover the bowl with a tea towel and leave it in a warm spot (68-70°F.), until the dough has risen slightly, almost imperceptibly, about 1 hour.",
        "Generously butter and 8 1/2 x 4 1/2 x 2 1/2-inch loaf pan.",
        "Punch down the dough and place it in the prepared loaf pan, spreading it as evenly as possible so it fills the pan. Cover with a damp towel and let rise in a warm spot (68-70°F.) until it has increased by about one third (the change in size is not dramatic), about 1 1/2 hours.",
        "Preheat the oven to 375°F.",
        "Whisk the egg and water together in a small bowl and paint the loaf with the mixture. To help it rise evenly, slash the top of the loaf in several places (or snip it with a pair of kitchen shears). Bake in the center of the oven until the brioche is puffed and golden, 35-40 minutes.",
        "Remove the pan from the oven and turn the brioche out onto a wire rack to cool."
    ],
    "ingredients": [
        "3 cups unbleached, all-purpose flour",
        "1/4 cup sugar",
        "1-1/2 teaspoons sea salt",
        "3 tablespoons warm water",
        "1 teaspoon active dry yeast",
        "4 large eggs, beaten",
        "8 tablespoons (1 stick) unsalted butter, melted",
        "1 egg",
        "2 teaspoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Dairy",
        "Egg",
        "Bake"
    ],
    "title": "Simple Brioche",
    "url": "http://www.epicurious.com/recipes/food/views/simple-brioche-101116"
}
