{
    "directions": [
        "Process butter in a food processor until smooth. Add granulated sugar and brown sugar and process until thoroughly blended into butter, about 1 minute. Add egg yolks and vanilla; process until mixture is smooth and looks glossy, about 30 seconds. Add salt, cinnamon, ginger, cardamom, baking powder, and 2 cups plus 2 Tbsp. flour; pulse until dough comes together around the blade. Turn out onto a work surface and knead a couple of times to incorporate any floury bits. Divide dough in half; pat into two 1/2\"-thick disks. Wrap in plastic and chill until firm, 45–60 minutes.",
        "Let dough sit 5 minutes at room temperature to soften slightly.",
        "Preheat oven to 350°F. Working with 1 disk at a time, roll out dough on a lightly floured surface to 1/4\" thick. Punch out cookies with cookie cutters and transfer to parchment-lined baking sheets, spacing at least 1\" apart. Sprinkle with sanding sugar, if using, and press in lightly to adhere. Gather up scraps and reroll once. Chill cookies on baking sheets until firm, 5–10 minutes, then bake until edges are golden brown, 12–18 minutes. Let cool 5 minutes on baking sheet; transfer to a wire rack and let cool completely.",
        "If using royal icing, decorate cooled cookies and let dry 2 hours.",
        "Dough can be made 1 month ahead; freeze instead of chilling. Cookies can be baked 2 weeks ahead (do not decorate with royal icing); place in airtight container and freeze."
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, cut into pieces, chilled",
        "1/2 cup granulated sugar",
        "1/4 cup (packed) light brown sugar",
        "2 large egg yolks",
        "2 teaspoons vanilla extract",
        "1 teaspoon kosher salt",
        "2 teaspoons ground cinnamon",
        "2 teaspoons ground ginger",
        "1/2 teaspoon ground cardamom, cloves, or nutmeg",
        "1/4 teaspoon baking powder",
        "2 cups plus 2 tablespoons all-purpose flour, plus more for surface",
        "Colored sanding sugars or royal icing (optional; for decorating)",
        "Assorted cookie cutters"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Christmas",
        "Bake",
        "Ginger",
        "Cinnamon",
        "Spice",
        "Cardamom",
        "Dessert"
    ],
    "title": "Simple Christmas Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/simple-christmas-cookies"
}
