{
    "directions": [
        "Heat 1 tablespoon coconut oil in a large sauté pan and fry the onion, garlic, ginger and chili for 2 to 3 minutes to soften, stirring frequently. Stir in the spices and season well with a pinch of salt and pepper. Continue to fry over medium heat for a further minute or two until fragrant. Transfer the mixture to a mini food processor and blend until smooth, adding a splash of water if necessary to loosen the consistency to a paste.",
        "Return the pan to the heat and put in another tablespoon of coconut oil. Add the paste and fry for 2 to 3 minutes. Add the eggplant and sauté for a minute or two, stirring to coat it with the paste, before adding the cherry tomatoes. Pour in the stock, bring to a boil, then reduce the heat and simmer for 10 to 12 minutes.",
        "Add the coconut milk and the shrimp and cook for 3 to 4 minutes, until the shrimp are pink and cooked through and the sauce has just thickened. Stir in the spinach, wilt for a minute, then season to taste with salt and pepper. Serve immediately."
    ],
    "ingredients": [
        "Coconut oil",
        "1 onion, chopped",
        "2 cloves garlic, finely grated",
        "Thumb-sized piece fresh ginger, peeled and grated",
        "1 red or green chili, deseeded (if you like) and finely chopped",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "1/2 teaspoon garam masala",
        "1/2 teaspoon turmeric",
        "Sea salt",
        "Freshly ground black pepper",
        "1 eggplant, grated or finely sliced",
        "1/4 pound cherry tomatoes, cut in half",
        "1 1/4 cups vegetable stock",
        "1 cup coconut milk",
        "1/2 pound raw tiger shrimp, peeled",
        "1 large handful baby spinach"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Dinner",
        "Curry",
        "Shrimp",
        "Coconut",
        "Eggplant",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Simple Shrimp, Coconut and Eggplant Curry",
    "url": "http://www.epicurious.com/recipes/food/views/simple-shrimp-coconut-and-eggplant-curry"
}
