{
    "directions": [
        "Put oven rack in lowest position and preheat oven to 450°F. Rinse turkey inside and out, then pat dry. Sprinkle turkey cavities and skin with salt and pepper. Fold neck skin under body and secure with metal skewers, then tie drumsticks together with kitchen string and tuck wings under body.",
        "Put turkey on rack in roasting pan. Add 1 cup water to pan and roast without basting, rotating pan halfway through roasting, until thermometer inserted into fleshy part of thighs (test both thighs; do not touch bones) registers 170°F, 2 1/4 to 2 3/4 hours.",
        "Carefully tilt turkey so any juices from inside large cavity run into roasting pan, then transfer turkey to a platter, reserving juices in roasting pan. Let turkey stand, uncovered, 30 minutes (temperature of thigh meat will rise to 180°F).",
        "Pour pan juices through a fine-mesh sieve into measuring cup (do not clean roasting pan), then skim off and discard fat. (If using a fat separator, pour pan juices through sieve into separator and let stand until fat rises to top, 1 to 2 minutes. Carefully pour pan juices from separator into measure, discarding fat.)",
        "Straddle roasting pan across 2 burners, then add remaining cup water and deglaze roasting pan by boiling over high heat, stirring and scraping up brown bits, 1 minute. Pour through sieve into measuring cup containing pan juices. Add enough turkey stock to pan juices to bring total to 8 cups (if stock is congealed, heat to liquefy).",
        "Melt butter in a 4-quart heavy pot and stir in flour. Cook roux over moderate heat, whisking, 5 minutes. Add stock mixture in a stream, whisking constantly to prevent lumps, then bring to a boil, whisking occasionally. Stir in any turkey juices accumulated on platter and simmer 5 minutes. Season gravy with salt and pepper, then stir in cider vinegar (to taste)."
    ],
    "ingredients": [
        "1 (16-lb) turkey at room temperature 1 hour, any feathers and quills removed with tweezers or needlenose pliers, and neck and giblets removed and reserved for another use if desired",
        "1 tablespoon salt",
        "1 3/4 teaspoons black pepper",
        "2 cups water",
        "7 to 8 cups turkey stock",
        "1 stick (1/2 cup) unsalted butter",
        "3/4 cup all-purpose flour",
        "1 1/2 to 2 tablespoons cider vinegar",
        "Special equipment: 2 small metal skewers; kitchen string; a 17- by 14-inch flameproof roasting pan with a flat rack; an instant-read thermometer; a 2-qt glass measuring cup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Dinner",
        "Meat",
        "Fall",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Simple Roast Turkey with Rich Turkey Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/simple-roast-turkey-with-rich-turkey-gravy-236409"
}
