{
    "directions": [
        "Dissolve yeast in the water; stir in the sugar and beat in 2 1/2 cups of rice flour to make a soft sponge. Set aside in a warm place to double in bulk, about 40 minutes. Mix in 2 more cups of rice flour and 1/4 cup of shortening and place the dough on a greased work surface; knead in the remaining 1/4 cup of shortening to make a smooth dough. Cut the dough into 15 equal-sized pieces; form each piece into a ball.",
        "Heat the vegetable oil in a skillet over medium heat; cook and stir the onion and garlic in the hot oil until translucent, about 5 minutes. Stir in the chicken, soy sauce, 2 teaspoons of sugar, green onion, salt, and pepper. If the mixture is juicy, add cornstarch to thicken.",
        "Working on a lightly greased work surface, flatten a dough ball into a circle about 4 inches in diameter with the heel of your hand. Place about 1 tablespoon of filling into the center of the dough ball, bring the edges of the dough together at the top, and pinch and twist to seal in the filling. Place each filled dumpling onto waxed paper with the pinched seal at the bottom while you finish the rest of the dumplings.",
        "Spray a multi-layered bamboo steamer with cooking spray, place the steamer on top of a large saucepan, and pour in water to several inches below the steamer. Bring the water to a boil.",
        "Working in several batches, place 3 or 4 filled buns into each steamer layer without letting the buns touch each other or the edge of the steamer, cover the steamer, and let the buns steam over medium-low heat until puffy and the dough is springy, about 15 minutes per batch. Serve warm."
    ],
    "ingredients": [
        "1 tablespoon active dry yeast",
        "1 1/2 cups lukewarm water",
        "1/4 cup white sugar",
        "4 1/2 cups rice flour, divided",
        "1/2 cup solid vegetable shortening, divided",
        "1 teaspoon vegetable oil",
        "1 large onion, diced",
        "1 clove garlic, chopped, or to taste",
        "1 1/2 pounds shredded cooked chicken meat",
        "1/4 cup soy sauce",
        "2 teaspoons white sugar",
        "1/2 cup diced green onion",
        "1 pinch salt and black pepper to taste",
        "1 teaspoon cornstarch, if needed (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Siopao (Filipino Steamed Dumplings)",
    "url": "http://allrecipes.com/recipe/71067/siopao-filipino-steamed-dumplings/"
}
