{
    "directions": [
        "For the red block: Toss together the kidney beans, tomatoes, hot sauce and a large pinch of salt in a medium bowl or container with a lid and refrigerate. This can be done up to 1 day ahead.",
        "For the orange block: Heat the oil in a large nonstick skillet over medium-high heat. Add the chorizo and cook, stirring and breaking up into small pieces, until browned and cooked through, about 4 minutes. Add the bell peppers and a large pinch of salt and toss until crisp-tender, about 3 minutes. Cool completely and refrigerate in a medium bowl or container with a lid. This can be done up to 1 day ahead.",
        "For the yellow block: Toss together the corn and cojita in a medium bowl or container with a lid and refrigerate. This can be done up to 1 day ahead.",
        "For the green block: Toss together the scallions and cilantro in a small bowl or container with a lid and refrigerate. This can be done up to 1 day ahead.",
        "For the purple block: Toss together the cabbage and 1/2 teaspoon salt in a medium bowl. Put the red onions in a small bowl of ice water. Let the cabbage and onions sit at room temperature for 30 minutes. Pour off any accumulated liquid from the cabbage and drain the onions. Refrigerate, separately, in their prep bowls or in containers with lids. This can be done up to 1 day ahead.",
        "For the black block: Toss together the beans and olives in a medium or container with a lid and refrigerate. This can be done up to 1 day ahead.",
        "For the cheese sauce: Working in batches, put the milk and cream cheese in a blender and puree. Pour into a very large pot and heat over medium heat, stirring frequently, until the mixture begins to bubble. Add handfuls of both the Monterey Jack and American cheese at a time, stirring well after each addition, until melted and smooth. Once all of the cheese has been added, simmer for a few minutes, then stir in the garlic, vinegar and 1 tablespoon salt. Let the cheese sauce cool and thicken. Keep warm. (The cheese sauce can be made, cooled and refrigerated up to 1 day ahead and then reheated). Makes about 12 cups.",
        "Assemble the nachos: If making ahead and refrigerating the prepared ingredients in advance, let each bowl of ingredients sit at room temperature for at least 1 hour or microwave to just take the chill off. The green layer of scallions and cilantro is the exception: Keep refrigerated until using.",
        "Tape together two 7-foot lengths of parchment or wax paper to make one double-wide 7-foot sheet. Lay it, tape-side down, down the middle of a long table or countertop. Spread the chips out into a 1-foot-wide and 6-foot-long rectangle.",
        "Ladle about 3/4 of the cheese sauce (about 8 cups) all over the chips; reserve the remaining sauce to serve on the side. Starting at the left end of the rectangle, sprinkle the red block ingredients to cover a 12-inch square and top with the sliced Fresno chiles. Next to the red block, sprinkle the orange ingredients to cover another 12 inches. Next to the orange block, follow up with the yellow ingredients and top with the sliced pepperoncini. Next sprinkle the green ingredients and top with the avocado. Then do the purple ingredients, and finally finish the last 12 inches with the black ingredients.",
        "Encourage your guests to fill their plates with nachos and top them with extra cheese sauce, sour cream, hot sauce and salsa. Platefuls of nachos can be reheated in the microwave, toaster oven or conventional oven if desired."
    ],
    "ingredients": [
        "Two 14.5-ounce cans kidney beans, rinsed and drained",
        "2 large tomatoes, finely chopped",
        "A few dashes of hot sauce",
        "Kosher salt",
        "2 Fresno chiles, thinly sliced",
        "2 tablespoons vegetable oil",
        "3/4 pound fresh chorizo, casings removed",
        "3 medium orange bell peppers, cut into a 1/4-inch dice",
        "Kosher salt",
        "1 pound frozen corn, thawed",
        "1/2 cup crumbled cojita cheese or grated Parmesan",
        "1/4 cup sliced pickled pepperoncini",
        "1/4 cup sliced pickled pepperoncini or banana peppers",
        "1 bunch scallions, thinly sliced",
        "1 bunch fresh cilantro, chopped",
        "2 firm-ripe avocados, diced",
        "1/4 head red cabbage, thinly sliced",
        "Kosher salt",
        "1/2 small red onion, thinly sliced",
        "One 15-ounce can black beans, rinsed and drained",
        "Two 3.8-ounce cans sliced black olives, drained",
        "8 cups whole milk",
        "One 8-ounce package cream cheese",
        "2 pounds shredded Monterey Jack",
        "1 pound white American cheese, cut into small pieces",
        "3 cloves garlic, finely grated",
        "2 tablespoons white wine vinegar",
        "Kosher salt",
        "Five 13-ounce bags tortillas chips",
        "Sour cream and your favorite salsas and hot sauces, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beans and Legumes",
        "Cheese",
        "Appetizer"
    ],
    "title": "Six-Foot Nachos",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/six-foot-nachos"
}
