{
    "directions": [
        "Preheat oven to 450 degrees F (230 degrees C).",
        "Heat vegetable oil in a large skillet over medium heat; cook and stir onion in the hot oil until softened and slightly browned, 5 to 10 minutes. Add ground beef, taco seasoning, and garlic. Cook and stir until beef is crumbly, evenly browned, and no longer pink, about 10 minutes. Drain and discard any excess grease. Stir in water and simmer until beef mixture has thickened, about 10 minutes. Remove from heat and cool slightly.",
        "Arrange the cut tortillas on a shallow baking sheet.",
        "Toast tortilla in the preheated oven until stiff enough to stand up as 'tombstones' in the dip, about 5 minutes per side. Brush toasted tortilla with melted butter and sprinkle with chili powder. Tap off any excess powder.",
        "Spread refried beans into the bottom of a 9x13-inch baking dish. Mix sour cream and salsa together in a small bowl; spread over refried beans. Sprinkle ground beef mixture atop salsa-sour cream layer. Top with a black bean layer; spread Cheddar cheese into a layer. Add green onions and cilantro as the top 'grass' layer. Arrange tortilla 'tombstones' in the 'grass'."
    ],
    "ingredients": [
        "1 teaspoon vegetable oil",
        "1 small onion, diced",
        "1 pound lean ground beef",
        "1 (1 ounce) packet taco seasoning mix",
        "2 cloves garlic, minced",
        "1/2 cup water",
        "1 (8 inch) flour tortilla, cut into strips resembling 'tombstones'",
        "1 tablespoon melted butter, or as needed",
        "1 pinch chili powder, or as needed",
        "2 (14.25 ounce) cans vegetarian refried beans",
        "1 cup sour cream",
        "1 cup salsa",
        "2 (15 ounce) cans black beans, drained and rinsed",
        "2 cups shredded Cheddar cheese",
        "2 bunches green onions, chopped",
        "1 bunch fresh cilantro, chopped (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Six Feet Under Dip",
    "url": "http://allrecipes.com/recipe/229139/six-feet-under-dip/"
}
