{
    "directions": [
        "If using fresh fava beans, blanch beans in medium saucepan of boiling salted water 2 minutes; transfer to bowl of ice water. Peel beans. If using fresh peas, blanch in same saucepan of boiling salted water until just tender, about 3 minutes. Using slotted spoon, transfer peas to ice water; cool. Drain peas.",
        "Place fava beans, peas, olive oil, 2 tablespoons mint leaves, and lemon peel in large skillet. Cook over medium heat until warmed through, stirring often, about 3 minutes. Season with salt and pepper. Divide vegetable mixture among 6 plates.",
        "Heat large nonstick skillet over medium heat. Add cheese slices and fry until golden, about 1 minute per side. Arrange 3 cheese slices atop vegetables on each plate. Drizzle with lemon juice, top with peperoncini, garnish with lemon wedges and mint sprigs, and serve immediately."
    ],
    "ingredients": [
        "1 1/4 pounds fresh fava beans, shelled, or 10 ounces double-peeled frozen fava beans, thawed",
        "1 1/4 cups shelled fresh peas or thawed frozen petite peas (about 7 ounces)",
        "3 tablespoons extra-virgin olive oil",
        "2 tablespoons fresh mint leaves plus 6 sprigs for garnish",
        "1 tablespoon grated lemon peel",
        "3 (8 1/2-ounce) packages Halloumi cheese,* each cut lengthwise into 6 slices, rinsed, patted dry",
        "2 tablespoons fresh lemon juice",
        "6 peperoncini",
        "1 lemon, cut into 6 wedges",
        "*Available at some supermarkets and at specialty foods stores, natural foods stores, and Greek markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Cheese",
        "Citrus",
        "Dairy",
        "Herb",
        "Pepper",
        "Vegetable",
        "Mint"
    ],
    "title": "Sizzling Halloumi Cheese with Fava Beans and Mint",
    "url": "http://www.epicurious.com/recipes/food/views/sizzling-halloumi-cheese-with-fava-beans-and-mint-238258"
}
