{
    "directions": [
        "Bring a large pot of water to a boil over high heat. Stir in the spaghettini, and return to a boil. Cook the pasta until it has cooked through, but is still firm to the bite, about 6-8 minutes. Drain well and keep warm.",
        "Heat 2 tablespoons oil in a large skillet over medium heat. Stir in the tomatoes; cook until they soften and begin to break down. Stir in the garlic powder, oregano, basil, salt, pepper, sugar, and ketchup.  Heat sauce through and reserve.",
        "Heat the remaining 3 tablespoons oil in a separate cast iron skillet over medium heat. Stir in chicken; cook until browned. Stir in crushed garlic cloves; cook for 1 additional minute.",
        "Remove chicken from skillet and reserve. Turn heat to high. Stir the green pepper, red pepper, onion, and mushrooms into the skillet and cook until they begin to soften. Stir in browned chicken. Turn heat to medium and cook until chicken is no longer pink in the center, and the vegetables are cooked through, about 5 minutes.",
        "Toss the chicken and vegetables with the tomato sauce and the hot pasta. Serve sprinkled with Parmesan cheese."
    ],
    "ingredients": [
        "1/2 (8 ounce) package spaghettini",
        "2 tablespoons olive oil",
        "8 roma (plum) tomatoes, halved and sliced",
        "1 teaspoon garlic powder",
        "1/2 teaspoon dried oregano",
        "2 teaspoons dried basil",
        "1 pinch salt",
        "1 teaspoon ground black pepper",
        "1 1/2 teaspoons white sugar",
        "1 tablespoon ketchup",
        "3 tablespoons olive oil",
        "2 skinless, boneless chicken breasts, cut into thin strips",
        "2 garlic cloves, crushed",
        "1 green bell pepper, chopped",
        "1 red bell pepper, chopped",
        "1 red onion, chopped",
        "1 cup sliced fresh mushrooms (optional)",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Skillet Chicken Pasta",
    "url": "http://allrecipes.com/recipe/58419/skillet-chicken-pasta/"
}
