{
    "directions": [
        "Rinse potatoes in a colander under cold water until water runs clear. Squeeze firmly to remove excess liquid. Transfer to a large bowl. Add salt and pepper; toss to coat.",
        "Heat 6 tablespoons oil in a large nonstick skillet over medium-high heat. Add half of potatoes; press gently into an even layer. Sprinkle with scallion whites. Top with remaining potatoes; press gently again. Cook until golden brown on bottom and sides, 10-15 minutes.",
        "Slide hash browns onto a plate. Carefully place skillet upside down over hash browns and flip to invert into skillet, browned side up. Drizzle remaining 2 tablespoons oil around sides of skillet. Cook hash browns until bottom is golden brown, 10-15 minutes longer; slide onto a plate and season with sea salt. Top with scallion greens and cut into wedges.",
        "DO AHEAD: Hash browns can be made 1 hour ahead. Place on a wire rack set inside a large rimmed baking sheet and keep them in a 200°F oven. Top with scallions before serving."
    ],
    "ingredients": [
        "5 russet potatoes (about 3 pounds), peeled, coarsely shredded",
        "1 1/2 teaspoons kosher salt",
        "1/4 teaspoons freshly ground black pepper",
        "8 tablespoons vegetable oil, divided",
        "2 bunches scallions, greens and whites separated, thinly sliced",
        "Coarse sea salt (such as Maldon)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Breakfast",
        "Brunch",
        "Side",
        "Vegetarian",
        "Kid-Friendly",
        "Quick & Easy",
        "Mother's Day",
        "Root Vegetable",
        "Pan-Fry",
        "Vegan",
        "Green Onion/Scallion",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Skillet Hash Browns",
    "url": "http://www.epicurious.com/recipes/food/views/skillet-hash-browns-51160910"
}
