{
    "directions": [
        "Preheat the oven to 450 degrees F.",
        "Place the thyme, fennel seeds, 1 tablespoon salt, and 1 teaspoon pepper in a mini food processor and process until ground. Pour the olive oil into a small glass measuring cup, stir in the herb mixture, and set aside.",
        "Distribute the lemon slices in a 12-inch cast iron skillet and distribute the onion and garlic on top. Place the chicken, skin side down, on top of the onion and brush with about half the oil and herb mixture. Turn the chicken skin side up, pat it dry with paper towels (very important!), and brush it all over with the rest of the oil and herb mixture.",
        "Roast the chicken for 30 minutes. Pour the wine into the pan (not on the chicken!) and roast for another 10 to15 minutes, until a meat thermometer inserted into the thickest part of the breast registers 155 to 160 degrees.",
        "Remove the chicken from the oven, sprinkle it with the lemon juice, cover the skillet tightly with aluminum foil, and allow to rest for 10 to 15 minutes. Cut the chicken in quarters or eighths, sprinkle with salt, and serve hot with the pan juices, cooked lemon, and onion."
    ],
    "ingredients": [
        "2 teaspoons fresh thyme leaves",
        "1 teaspoon whole fennel seeds",
        "Kosher salt and freshly ground black pepper",
        "1/3 cup good olive oil",
        "1 lemon, halved and sliced 1/4 inch thick",
        "1 yellow onion, halved and sliced 1/4 inch thick",
        "2 large garlic cloves, thinly sliced",
        "1 (4-pound) chicken, backbone removed and butterflied",
        "1/2 cup dry white wine, such as Pinot Grigio",
        "Juice of 1 lemon"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Skillet Recipes",
        "Chicken",
        "Poultry Recipes",
        "Fruit",
        "Lemon Recipes",
        "Main Dish Recipes",
        "Roasting"
    ],
    "title": "Skillet-Roasted Lemon Chicken",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/skillet-roasted-lemon-chicken"
}
