{
    "directions": [
        "Place a rack in lower third of oven; preheat to 400°F. Heat 3 Tbsp. oil in a large ovenproof skillet over medium. Add onions and cook, stirring occasionally, until softened but not browned, 6–8 minutes. Add squash and cook, stirring occasionally, until almost tender, 8–10 minutes. Mix in thyme and red pepper flakes and transfer to a medium bowl; let cool. Wipe out and reserve skillet.",
        "Add kale, eggs, Parmesan, and lemon zest to squash mixture and gently mix to combine; season with salt and pepper. Layer phyllo sheets inside reserved skillet. Spoon kale-and-squash mixture into phyllo and dot top with goat cheese. Brush edges of phyllo lightly with oil and fold over filling, overlapping slightly, leaving center exposed.",
        "Cook pie over medium heat until bottom of pastry is just golden (carefully lift up on one side with a heatproof rubber spatula so that you can take a peek), about 3 minutes. Transfer skillet to oven and bake pie until kale is wilted and tender and phyllo is golden brown and crisp, 20–25 minutes. Let pie cool in skillet at least 15 minutes before slicing into wedges.",
        "Pie can be baked 6 hours ahead. Let cool; store uncovered at room temperature."
    ],
    "ingredients": [
        "3 tablespoons olive oil, plus more for brushing",
        "2 medium red onions, finely chopped",
        "1/2 small butternut squash (about 1 pound), peeled, cut into 3/4-inch pieces",
        "1 1/2 teaspoons chopped thyme",
        "1/2 teaspoon crushed red pepper flakes",
        "1 bunch Tuscan kale, ribs and stems removed, thinly sliced crosswise",
        "2 large eggs, beaten to blend",
        "3 ounces Parmesan, grated",
        "1 teaspoon finely grated lemon zest",
        "Kosher salt, freshly ground pepper",
        "8 ounces frozen phyllo pastry, thawed (half a 1-pound package)",
        "4 ounces fresh goat cheese or feta, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Phyllo/Puff Pastry Dough",
        "Butternut Squash",
        "Thyme",
        "Kale",
        "Parmesan",
        "Goat Cheese",
        "Vegetarian",
        "Dinner",
        "Winter",
        "Fall"
    ],
    "title": "Skillet Phyllo Pie With Butternut Squash, Kale, and Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/skillet-phyllo-pie-with-butternut-squash-kale-and-goat-cheese"
}
