{
    "directions": [
        "Cook the pasta according to the package instructions; drain and set aside.",
        "Heat the oil in a large skillet over medium-high heat. Season the chicken with the Italian seasoning and some salt. Add the chicken to the skillet and cook until golden brown, 2 to 3 minutes per side. Remove the chicken to a plate and set aside.",
        "Add the onions and garlic to the same skillet and cook, stirring, for 3 minutes. Add the broth, then scrape the bottom of the skillet to loosen the bits. Cook for another 2 to 3 minutes to let the broth reduce. Add the marinara sauce and red pepper flakes, bring to a simmer and simmer for 10 minutes.",
        "Turn off the heat and add the drained pasta, mozzarella, ricotta, Parmesan and basil. Add the cooked chicken on top. Toss to combine, then add more of the mozzarella, ricotta, Parmesan or basil until the sauce is just how you like it. Serve with a sprinkling of Parmesan and a little basil on top."
    ],
    "ingredients": [
        "12 ounces bow tie pasta",
        "2 tablespoons olive oil",
        "2 boneless, skinless chicken breasts, sliced or diced",
        "1 tablespoon Italian seasoning or herbes de Provence",
        "Salt",
        "1 medium onion, diced",
        "2 cloves garlic, minced",
        "1 cup low-sodium chicken broth",
        "1 jar good-quality marinara sauce (14 to 16 ounces)",
        "1 teaspoon red pepper flakes",
        "1 cup grated mozzarella cheese, plus more if needed",
        "1/2 cup whole milk ricotta cheese, plus more if needed",
        "1/4 cup grated Parmesan, plus more if needed and for serving",
        "12 fresh basil leaves, cut into chiffonade or chopped, plus more if needed and for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Skillet Recipes",
        "Lasagna Recipes",
        "Cheese",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes"
    ],
    "title": "Skillet Chicken Lasagna",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/skillet-chicken-lasagna"
}
