{
    "directions": [
        "Preheat the oven to 450. Cover the potatoes with cold water in a saucepan and salt the water. Bring to a boil over medium-high heat and cook until tender, about 8 minutes; drain and set aside.",
        "Pile the rosemary leaves, garlic, 2 teaspoons salt and the red pepper flakes on a cutting board, then mince and mash into a paste using a large knife. Transfer the paste to a bowl. Stir in the juice of 1 lemon and the olive oil. Add the chicken and turn to coat.",
        "Heat a large cast-iron skillet over medium-high heat. Add the chicken, skin-side down, cover and cook until the skin browns, about 5 minutes. Turn the chicken; add the mushrooms and potatoes to the skillet and drizzle with the juice of the remaining lemon.",
        "Add the rosemary sprigs and the squeezed lemon halves to the skillet; transfer to the oven and roast, uncovered, until the chicken is cooked through and the skin is crisp, 20 to 25 minutes.",
        "Per serving: Calories 413; Fat 23 g (Saturated 5 g); Cholesterol 87 mg; Sodium 1,055 mg; Carbohydrate 19 g; Fiber 2 g; Protein 32 g",
        "Photograph by Antonis Achilleos"
    ],
    "ingredients": [
        "3/4 pound small red-skinned potatoes, halved, or quartered if large",
        "Kosher salt",
        "2 sprigs fresh rosemary, plus 1 tablespoon leaves",
        "1 clove garlic, smashed",
        "Pinch of red pepper flakes",
        "Juice of 2 lemons (squeezed halves reserved)",
        "2 tablespoons extra-virgin olive oil",
        "4 skin-on, bone-in chicken breasts (6 to 8 ounces each)",
        "10 ounces cremini mushrooms, halved"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Healthy",
        "Skillet Recipes"
    ],
    "title": "Skillet Rosemary Chicken",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/skillet-rosemary-chicken-recipe"
}
