{
    "directions": [
        "Finely chop the green onion tops by first cutting them lengthwise into long, thin strips. Combine chopped green onion tops, extra-virgin olive oil, minced Italian parsley, and salt in small bowl; whisk to blend. (Can be prepared 3 hours ahead. Let stand at room temperature.)",
        "Lightly toast 4 sourdough bread slices. Spread each with 1 tablespoon green onion oil. Arrange 1/4 of arugula on each bread slice. Top each with 2 slices prosciutto. Transfer 1 prepared bread slice to each of 4 plates.",
        "Divide remaining green onion oil equally among four 1 1/4-cup custard cups or ramekins. Using pastry brush, spread green onion oil over inside of each cup to coat (most of mixture will fall back to bottom of cup). This will keep the eggs from sticking, making them easier to unmold later. Break open 2 eggs into each prepared cup. Place cups in large skillet. Pour enough water into skillet to reach halfway up sides of cups.",
        "Set skillet over medium-high heat and bring water to simmer. Reduce heat to medium-low. Cover skillet and gently cook eggs until whites are just firm to touch and yolks are set to desired consistency, about 6 minutes.",
        "Using spatula and oven mitt or hand towel as aids, lift cups with eggs from water. Cut around eggs to loosen. Turn 2 eggs out onto each prepared bread slice. Garnish with Italian parsley sprigs."
    ],
    "ingredients": [
        "1 cup finely chopped green onion tops",
        "1/2 cup extra-virgin olive oil",
        "1/4 cup minced fresh Italian parsley",
        "1/2 teaspoon coarse salt",
        "4 1/2-inch-thick slices country-style sourdough bread, each about 4x6 inches",
        "3 ounces arugula leaves (about 4 cups)",
        "8 thin slices prosciutto (about 4 ounces)",
        "8 large eggs",
        "Fresh Italian parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Breakfast",
        "Brunch",
        "Poach",
        "New Year's Day",
        "Arugula",
        "Prosciutto",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Skillet Poached Eggs with Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/skillet-poached-eggs-with-prosciutto-106109"
}
