{
    "directions": [
        "Heat oil in heavy large deep skillet or pot over medium heat. Add sausages and cook until browned and thermometer inserted horizontally into Italian sausages registers 165°F, turning occasionally, about 12 minutes. Transfer sausages to plate. Add onion to skillet; sprinkle with salt and cook until tender and beginning to brown, about 4 minutes. Add garlic; stir 30 seconds. Add broth and peas; cover and cook until peas are almost tender, about 12 minutes. Add beans; cover and simmer until beans are almost tender, about 4 minutes. Add tomatoes; cook uncovered until tomatoes begin to burst, about 2 minutes. Add thyme and sausages with any accumulated juices. Cook until sausages are heated through, peas and beans are tender, and liquid coats back of spoon, 3 to 4 minutes. Season to taste with salt and pepper. Spoon vegetable mixture into large shallow bowl. Arrange sausages over and serve."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 pound fresh hot Italian sausages (about 5)",
        "3/4 pound fully cooked andouille sausages (about 4)",
        "1 small onion, chopped",
        "3 garlic cloves, minced",
        "3 cups low-salt chicken broth",
        "2 cups freshly shucked black-eyed peas (from 1 generous pound peas in pod) or one 11-ounce container shucked fresh black-eyed peas",
        "12 ounces Romano beans or string beans, trimmed, cut crosswise into 3-inch pieces",
        "1 10-ounce container grape tomatoes",
        "1 tablespoon minced fresh thyme"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Tomato",
        "Father's Day",
        "Dinner",
        "Meat",
        "Sausage",
        "Legume",
        "Pea",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Skillet Sausages with Black-Eyed Peas, Romano Beans, and Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/skillet-sausages-with-black-eyed-peas-romano-beans-and-tomatoes-354295"
}
