{
    "directions": [
        "Heat oil in a 12\" (preferably cast-iron) skillet over medium-high. Add onion and cook, stirring, until it starts to soften, about 2 minutes. Add zucchini, coriander, cumin, salt, and pepper. Cook, stirring, until onion and zucchini are softened and lightly browned, about 3 minutes. Stir 1 1/2 cups salsa, scraping up any brown bits from the pan. Fold in the chicken and cook until warmed through, about 1 minute. Transfer enchilada filling to a medium bowl; set skillet aside (do not wipe out).",
        "Meanwhile, wrap tortillas in damp paper towels and microwave on high in 30-second bursts, flipping after each burst, until warmed, about 1 minute total. Alternatively, wrap in foil and heat in a 350°F oven until warmed through, 10–12 minutes.",
        "Pour 1 cup salsa into reserved skillet. Working with one at a time, dip tortillas in salsa until coated on both sides; transfer to a large rimmed baking sheet. Divide enchilada filling among tortillas. Roll each tortilla around filling and place seam side down in skillet, arranging in a pinwheel formation.",
        "Heat enchiladas over medium-high. Pour remaining salsa over enchiladas, making sure each is coated. Sprinkle with cheese. Cover with a lid or large baking sheet and cook until cheese is melted and enchiladas are warmed through, about 3 minutes. Top with sour cream, avocado, and cilantro. Serve with lime wedges alongside."
    ],
    "ingredients": [
        "2 tablespoons neutral vegetable oil, such as grapeseed",
        "1 cup thinly sliced onion (about 1 small onion)",
        "1 cup (1/2\" pieces) zucchini",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "2 (16-ounce) jars store-bought tomatillo salsa or 4 cups homemade tomatillo salsa, divided",
        "2 cups shredded cooked chicken (from 1/2 [2 1/2-pound] rotisserie chicken)",
        "8 (5-6\") corn tortillas",
        "3/4 cup grated Monterey Jack cheese",
        "Sour cream, 1 sliced avocado, cilantro leaves with tender stems, and lime wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "22-Minute Meals",
        "Chicken",
        "Zucchini",
        "Salsa",
        "Tortillas",
        "Dinner",
        "Coriander",
        "Cumin",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Skillet Chicken and Zucchini Enchiladas With Tomatillo Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/skillet-chicken-and-zucchini-enchiladas-with-tomatillo-sauce"
}
