{
    "directions": [
        "Dissolve sugar in 1 tablespoon water in small saucepan over medium heat. Increase heat; boil without stirring until amber, brushing pan sides with wet pastry brush, about 5 minutes. Add vinegar and crushed pepper (mixture will bubble vigorously). Stir until caramel bits dissolve. Cool.",
        "Pour 2 cups oil into heavy medium saucepan. Attach deep-fry thermometer to side of pan and heat oil to 350°F. Working in batches, fry shallots until golden brown, stirring occasionally, 1 1/2 to 2 minutes per batch. Using slotted spoon, transfer shallots to paper towels. Sprinkle with coarse salt.",
        "Heat drippings with 1 tablespoon peanut oil in large pot over medium-high heat. Add half of greens and sprinkle with coarse salt and pepper; toss until wilted. Add remaining greens; toss to wilt, about 5 minutes. Reduce heat to medium-low, cover, and cook until greens are tender, adding water by 1/4 cupfuls if dry, about 45 minutes. Season with coarse salt and pepper.",
        "Rewarm gastrique. Transfer greens to large shallow bowl. Drizzle some gastrique over and sprinkle shallots over. Serve, passing remaining gastrique."
    ],
    "ingredients": [
        "1/4 cup sugar",
        "1/2 cup apple cider vinegar",
        "1 teaspoon dried crushed red pepper",
        "2 cups plus 1 tablespoon peanut oil",
        "2 cups thinly sliced shallots",
        "Coarse kosher salt",
        "2 tablespoons bacon drippings",
        "2 pounds greens (such as collards, chard, and kale), stems removed, cut crosswise into 1/2-inch-wide strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "High Fiber",
        "Vinegar",
        "Bacon",
        "Kale",
        "Deep-Fry",
        "Low Cholesterol",
        "Collard Greens",
        "Shallot",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Skillet Greens with Crispy Shallots and Cider Gastrique",
    "url": "http://www.epicurious.com/recipes/food/views/skillet-greens-with-crispy-shallots-and-cider-gastrique-351050"
}
