{
    "directions": [
        "Whisk all ingredients in small bowl to blend. Season dressing to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Whisk first 6 ingredients to blend in 13x9x2-inch glass baking dish. Add steaks to marinade; turn to coat. Cover and refrigerate at least 8 hours.",
        "Combine onions, lemon juice and coarse salt in medium bowl. Let stand 1 hour, tossing occasionally.",
        "Prepare barbecue (medium-high heat). Remove steaks from marinade. Sprinkle with salt and pepper. Grill about 3 minutes per side for medium-rare. Transfer steaks to work surface.",
        "Melt butter in heavy large skillet over medium-high heat. Add shallot and mushrooms; sauté until well browned, about 7 minutes. Add vinegar to skillet and bring to boil, scraping up browned bits. Remove from heat; mix in oil. Season mushroom mixture to taste with salt and pepper.",
        "Combine lettuces, onions and mushroom mixture in large bowl; toss. Divide lettuce mixture among 6 plates. Thinly slice steaks across grain; arrange atop lettuce mixture. Drizzle some of aioli over salads. Pass remaining aioli separately."
    ],
    "ingredients": [
        "1 cup mayonnaise",
        "1/4 cup coarse-grained Dijon mustard",
        "2 tablespoons white wine vinegar",
        "1 tablespoon minced canned chipotle chilies",
        "1/2 cup dark beer",
        "1/4 cup olive oil",
        "2 tablespoons chopped garlic",
        "2 tablespoons red wine vinegar",
        "1 teaspoon Worcestershire sauce",
        "3/4 teaspoon hot pepper sauce (such as Tabasco)",
        "2 pounds skirt steak, trimmed of fat",
        "2 red onions, thinly sliced into rounds",
        "2 tablespoons fresh lemon juice",
        "3/4 teaspoon coarse salt",
        "3 tablespoons butter",
        "1 large shallot, sliced",
        "3/4 pound assorted mushrooms (such as crimini and oyster), sliced",
        "1/4 cup Sherry wine vinegar",
        "1/4 cup olive oil",
        "10 ounces mixed baby lettuces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Beef",
        "Garlic",
        "Leafy Green",
        "Mushroom",
        "Onion"
    ],
    "title": "Skirt Steak with Mushrooms and Chipotle Aïoli",
    "url": "http://www.epicurious.com/recipes/food/views/skirt-steak-with-mushrooms-and-chipotle-aioli-4269"
}
