{
    "directions": [
        "Heat a dry 12-inch heavy skillet (not nonstick) over moderately high heat 2 minutes. Meanwhile, pat steaks dry and sprinkle all over with pepper and 1/2 teaspoon salt (total).",
        "Add 1 tablespoon oil to hot skillet and swirl to coat, then sauté steaks, turning over once, 5 to 8 minutes total for medium-rare. Transfer steaks to a platter, reserving fat in skillet, and keep warm, covered.",
        "While steaks are sautéing, cook garlic and almonds in remaining 2 tablespoons oil in a 10-inch heavy skillet over moderately high heat, stirring, until golden, 1 to 2 minutes. Add pepper stir-fry, cinnamon, cloves, and remaining 1/2 teaspoon salt and sauté vegetables, stirring, 4 minutes.",
        "Once steaks are removed from larger skillet, add vegetables and tomato paste to fat in skillet and cook over moderately high heat, stirring and scraping up brown bits, 1 minute. Stir in vinegar, water, raisins, and sugar and boil over moderately high heat until sauce is thickened slightly, about 2 minutes.",
        "Season sauce with salt and pepper and spoon over steaks."
    ],
    "ingredients": [
        "1 3/4 pounds skirt steak, cut crosswise into 4 serving pieces",
        "1/2 teaspoon black pepper",
        "1 teaspoon salt",
        "3 tablespoons olive oil",
        "2 garlic cloves, peeled and smashed",
        "2 tablespoons slivered almonds",
        "1 (1-pound) bag frozen pepper stir-fry, thawed in a bowl of hot water and drained well",
        "Pinch of ground cinnamon",
        "Pinch of ground cloves",
        "1 tablespoon tomato paste",
        "1 1/2 tablespoons cider vinegar",
        "1/2 cup water",
        "1/4 cup raisins",
        "1/2 teaspoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Fruit",
        "Garlic",
        "Nut",
        "Pepper",
        "Tomato",
        "Sauté",
        "Quick & Easy",
        "Gourmet"
    ],
    "title": "Skirt Steak with Peppers, Raisins, and Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/skirt-steak-with-peppers-raisins-and-almonds-238107"
}
