{
    "directions": [
        "Prepare grill for cooking.",
        "Thread onions onto skewers (or put in grill basket), then brush with 1/2 tablespoon oil and season with salt and pepper. When fire is medium-hot (you can hold your hand 5 inches above rack for 3 to 4 seconds), grill onions, turning occasionally, until tender, 16 to 20 minutes. Transfer to a cutting board. When just cool enough to handle, cut onions into 1-inch pieces and toss with vinegar and 1/2 teaspoon salt.",
        "While onions are grilling, stir together lime juice and remaining teaspoon salt and 2 tablespoons oil in a shallow dish, then add steak and marinate at room temperature, turning once, 10 minutes.",
        "Pat steak dry, then rub with pepper. Grill steak on lightly oiled grill rack, turning once, 6 to 10 minutes total for medium-rare. Transfer to cutting board, then let stand 5 minutes before cutting diagonally into thin slices.",
        "While steak is standing, toast tortillas directly on grill rack, turning once, until puffed slightly and browned in spots, about 1 minute total. Serve steak, onions, cilantro, and salsa all wrapped in tortillas."
    ],
    "ingredients": [
        "2 large onions, peeled and cut lengthwise into 6 wedges, leaving root ends intact",
        "2 1/2 tablespoons olive oil",
        "2 1/2 teaspoons balsamic vinegar",
        "1 1/2 teaspoons salt",
        "1/4 cup fresh lime juice",
        "2 lb skirt steak, halved crosswise",
        "2 1/2 teaspoons coarsely ground black pepper",
        "18 flour tortillas",
        "1 cup fresh cilantro leaves",
        "Accompaniment: tomatillo or tomato salsa; lime wedges",
        "Special equipment: metal skewers or a grill basket"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Citrus",
        "Onion",
        "Quick & Easy",
        "Backyard BBQ",
        "Dinner",
        "Vinegar",
        "Lime",
        "Steak",
        "Grill/Barbecue",
        "Cilantro",
        "Tortillas",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Skirt Steak Fajitas with Lime and Black Pepper",
    "url": "http://www.epicurious.com/recipes/food/views/skirt-steak-fajitas-with-lime-and-black-pepper-106578"
}
