{
    "directions": [
        "Heat grill to high.",
        "Wrap tortillas in aluminum foil and on the top rack of the grill while the steak is grilling.",
        "Heat grill pan over high heat. Brush steak with oil and season with salt and pepper on both sides. Grill on one side until golden brown and slightly charred, about 3 to 4 minutes. Turn the steak over and cook to medium-rare doneness, about 3 to 4 minutes longer. Let rest 5 minutes then slice against the grain into 1/4-inch thick slices.",
        "Fill each tortilla with some lettuce, 3 to 4 pieces of meat, onion, grilled tomato salsa, sour cream, and avocado.",
        "Heat grill to high.",
        "Heat oil in a small saute pan and saute the chiles, onion, and garlic until soft.",
        "Brush tomatoes with oil and season with salt and pepper. Grill on both sides until slightly charred and soft.",
        "Transfer tomatoes and serrano mixture to a food processor; add the lime juice and salt and pepper and process until smooth. Add the cilantro and pulse a few times (there should be flecks of cilantro in the salsa.) Transfer to a bowl."
    ],
    "ingredients": [
        "8 (6-inch) flour tortillas",
        "1 1/2 pounds skirt steak",
        "2 tablespoons canola oil",
        "Salt and freshly ground black pepper",
        "1/2 head romaine lettuce, thinly shredded",
        "1 medium red onion, thinly sliced",
        "1 ripe avocado, peeled, pitted, halved and diced",
        "Grilled Tomato Salsa, recipe follows",
        "8 ounces sour cream",
        "2 tablespoons canola oil, plus more for brushing tomatoes",
        "2 serrano chiles",
        "1 small red onion, coarsely chopped",
        "4 cloves garlic, peeled",
        "6 plum tomatoes, halved and seeded",
        "Salt and freshly ground black pepper",
        "2 limes, juiced",
        "1/4 cup chopped fresh cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Grilling Recipes",
        "Easy Recipes",
        "Grilling",
        "Grilled Steak",
        "Steak",
        "Roasted Tomato",
        "Roasted Vegetable",
        "Roasting",
        "Tomato",
        "Vegetable",
        "Taco Recipes",
        "Lettuce Recipes",
        "Meat",
        "Avocado",
        "Beef",
        "Dairy Recipes",
        "Sauteing Recipes"
    ],
    "title": "Skirt Steak Tacos with Roasted Tomato Salsa",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/skirt-steak-tacos-with-roasted-tomato-salsa-recipe"
}
