{
    "directions": [
        "Purée garlic, lime juice, oil, paprika, cilantro, cumin, salt, and onion powder in a blender until smooth. Transfer marinade to a resealable plastic bag and add steak. Seal bag and turn to coat; chill at least 4 hours.",
        "DO AHEAD: Steak can be marinated 1 day ahead. Keep chilled.",
        "Prepare grill for medium-high heat. (Alternatively, heat a grill pan over medium-high heat.) Drizzle cabbage, white onion, and scallions with 4 tablespoons oil; season with salt and pepper. Grill, turning occasionally, until vegetables are charred and softened, about 4 minutes for scallions, 10–12 minutes for cabbage and onion. Let vegetables cool slightly.",
        "Core cabbage and cut into bite-size pieces along with scallions and onion. Toss chopped vegetables in a large bowl with red onion, lime juice, cilantro, and remaining 2 tablespoons oil; season with salt and pepper.",
        "Remove steak from marinade, scraping off excess; season with salt and pepper. Grill steak until medium-rare, about 3 minutes per side. Transfer to a cutting board and let rest 5–10 minutes before slicing. Serve steak with vegetables, tortillas, and Dried Chile Salsa."
    ],
    "ingredients": [
        "4 garlic cloves, peeled",
        "1/4 cup fresh lime juice",
        "1/4 cup olive oil",
        "3 tablespoons hot smoked Spanish paprika",
        "2 tablespoons chopped fresh cilantro",
        "1 tablespoon ground cumin",
        "1 teaspoon kosher salt",
        "1 teaspoon onion powder",
        "2 pounds skirt steak, cut into 4 equal pieces",
        "1/2 medium head green cabbage, cut into 2 wedges, core intact",
        "1 large white onion, halved with some root end attached",
        "1 bunch scallions, trimmed",
        "6 tablespoons olive oil, divided",
        "Kosher salt, freshly ground pepper",
        "1 freshly ground pepper",
        "1/4 small red onion, finely chopped",
        "3 tablespoons fresh lime juice",
        "1 tablespoon chopped fresh cilantro",
        "Warm flour tortillas (for serving)",
        "Dried Chile Salsa"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Vegetable",
        "Super Bowl",
        "Cinco de Mayo",
        "Dinner",
        "Lunch",
        "Steak",
        "Tailgating",
        "Cabbage",
        "Tortillas",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Skirt Steak Fajitas with Grilled Cabbage and Scallions",
    "url": "http://www.epicurious.com/recipes/food/views/skirt-steak-fajitas-with-grilled-cabbage-and-scallions-51214630"
}
