{
    "directions": [
        "Preheat oven to 350°F. Roast chiles and garlic on a rimmed baking sheet until lightly browned and softened, 12–15 minutes. Add cashews to baking sheet and roast until nuts are golden brown, 5–7 minutes. Let cool slightly, then peel garlic. Transfer garlic, cashews, and chiles (include all the seeds if you like things hot, or half of them if you aren’t sure) to a blender; add vinegar, sugar, and 1/2 cup water and purée until smooth. Season with salt.",
        "Whisk vinegar, mayonnaise, and yogurt in a medium bowl. Add cabbage and scallion and toss to coat; season with salt. Set aside.",
        "Season steak with salt and pepper; sprinkle with cumin. Heat 1 Tbsp. oil in a large skillet over medium-high. Cook steak until deeply browned, about 4 minutes per side for medium-rare. Transfer to a cutting board; let sit 10 minutes before slicing.",
        "Meanwhile, if making your own tostadas, pour oil into a small skillet to 1/4\" depth. Heat over medium. Working one at a time, fry tortillas until crisp, about 1 minute per side. Transfer to paper towels.",
        "Top tostadas with some salsa, followed by steak, more salsa, slaw, and cilantro. Serve with lime wedges.",
        "Salsa can be made 1 week ahead. Cover and chill."
    ],
    "ingredients": [
        "2 Fresno or other red chiles",
        "2 garlic cloves, unpeeled",
        "1/2 cup cashews",
        "2 tablespoons apple cider vinegar",
        "1/4 teaspoon sugar",
        "Kosher salt",
        "2 tablespoons apple cider vinegar",
        "2 tablespoons mayonnaise",
        "2 tablespoons plain Greek yogurt",
        "1/4 large head of red cabbage, very thinly sliced (about 4 cups)",
        "1 scallion, chopped",
        "Kosher salt",
        "1 skirt steak (about 1 1/2 pounds), cut into 4 pieces",
        "Freshly ground black pepper",
        "1 teaspoon ground cumin",
        "1 tablespoon vegetable oil; plus more for frying (about 1/3 cup; optional)",
        "4 small corn tortillas or 4 store-bought tostadas",
        "Chopped cilantro and lime wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Steak",
        "Chile Pepper",
        "Garlic",
        "Cashew",
        "Salsa",
        "Tortillas",
        "Dinner"
    ],
    "title": "Skirt Steak Tostadas With Cashew Salsa and Red Cabbage Slaw",
    "url": "http://www.epicurious.com/recipes/food/views/skirt-steak-tostadas-with-cashew-salsa-and-red-cabbage-slaw"
}
