{
    "directions": [
        "Peel, seed, and cut chiles lengthwise into 1/2-inch-wide strips. Set aside. Brush steaks with 1 tablespoon oil. Mix 1 teaspoon cumin and ancho chile powder; rub spice mixture on both sides of steaks. Sprinkle with salt and pepper.",
        "Heat 1 tablespoon oil in large nonstick skillet over medium-high heat. Add zucchini, poblanos, and green onions; sauté until zucchini is tender, about 2 minutes. Stir in 1 teaspoon cumin. Add cream; boil until slightly thickened, about 2 minutes longer. Season to taste with salt and pepper.",
        "Heat remaining 1 tablespoon olive oil in another large nonstick skillet over medium-high heat. Add both steaks to skillet and cook to desired doneness (about 4 minutes per side for medium-rare). Remove steaks from pan. Let cool 5 minutes. Thinly slice steaks across grain.",
        "Transfer steaks to platter. Top with poblanos and cilantro.",
        "Using tongs, char the chile over a gas flame, or place it in the broiler, and turn it occasionally. When chile is blackened all over, enclose it in a paper bag for 10 to 15 minutes to allow the chile to steam, which loosens the skin. Using your fingers or the back of a knife, remove the blackened skin from the chile."
    ],
    "ingredients": [
        "2 large poblano chiles, roasted (see below)",
        "2 12-ounce skirt steaks",
        "3 tablespoons olive oil, divided",
        "2 teaspoons ground cumin, divided",
        "1 teaspoon ancho chile powder",
        "1 cup diced yellow or green zucchini",
        "3/4 cup chopped green onions",
        "1/2 cup whipping cream",
        "2 tablespoons chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Beef",
        "Pepper",
        "Roast",
        "Sauté",
        "Quick & Easy",
        "Steak",
        "Zucchini",
        "Spring"
    ],
    "title": "Skirt Steak with Poblano Rajas and Zucchini",
    "url": "http://www.epicurious.com/recipes/food/views/skirt-steak-with-poblano-rajas-and-zucchini-231083"
}
