{
    "directions": [
        "Boil the potato in a small pot of salted water.",
        "Add the 2 cloves of garlic and sea salt to a blender or food processor, and pulse until it becomes a thick paste. Add more garlic if desired. Squeeze the water from the bread, and drain the potato, reserving some of the cooking water. Add the bread and potato to the garlic paste along with the almonds and half the lemon juice. Process until the mixture is well combined, but still slightly coarse in texture.",
        "While the processor is running, start to slowly pour the olive oil into the mixture. If it is too thick, add a spoonful of the reserved potato water and continue to add the oil. Once the mixture becomes lighter in color and thinner in texture, stop and taste your creation. Season with salt and pepper to taste, and add a little of the remaining lemon juice. Taste again, and if you are lucky enough to have gotten it just right, put into a bowl or jar and reserve in the fridge for up to 1 week.",
        "If the skordalia seems unbalanced, use your taste buds to steer you in the right direction. If you want it more pungent, add more garlic. If the garlic flavor is overpowering, add a few drops of lemon juice. Season with more salt. Blend. Taste again. Repeat as many times as needed to get it where you want it. Skordalia needs to taste good to you, not to me."
    ],
    "ingredients": [
        "1/2 small potato, peeled",
        "Salt and pepper",
        "2 cloves garlic, or to taste",
        "1 teaspoon sea salt",
        "2 slices bread, crusts removed and slices soaked in water",
        "1/2 cup (60 grams) almonds, toasted",
        "Juice of 1 lemon",
        "1 cup (250 milliliters) extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dip",
        "Cookbook Critic",
        "Garlic",
        "Bread",
        "Lemon Juice",
        "Condiment/Spread"
    ],
    "title": "Skordalia (Garlic Dip)",
    "url": "http://www.epicurious.com/recipes/food/views/skordalia-garlic-dip"
}
