{
    "directions": [
        "Whisk vinegar and mustard in small bowl. Gradually whisk in olive oil. Season to taste with salt and pepper. (Dressing can be made 1 day ahead. Cover and chill.)",
        "Cook fava beans in large pot of boiling salted water until tender, about 2 minutes. Transfer to bowl of ice water to cool. Drain and peel (if using fresh). Transfer to paper towels to dry. Place fava beans, radishes, herbs, and dressing in medium bowl; toss to coat. Season with salt and pepper. Let salad stand at room temperature at least 20 minutes and up to 1 hour.",
        "Melt butter with canola oil in heavy large skillet over high heat. Sprinkle steaks with salt and pepper. Add steaks to skillet and cook to desired doneness, about 4 minutes per side for medium-rare. Transfer to cutting board; let stand 10 minutes. Cut each steak into 3 slices.",
        "Divide salad among 4 plates. Arrange 1 sliced steak atop each salad. Sprinkle some of cheese over each and serve."
    ],
    "ingredients": [
        "3 tablespoons apple cider vinegar",
        "2 teaspoons country-style Dijon mustard",
        "1/4 cup extra-virgin olive oil",
        "2 cups fresh fava beans (from about 2 pounds fresh pods) or frozen double-peeled, thawed",
        "10 medium radishes, very thinly sliced",
        "1/4 cup chopped fresh herbs, such as tarragon, basil, thyme, and parsley",
        "1 tablespoon butter",
        "1 tablespoon canola oil",
        "4 5- to 7-ounce filet mignon steaks",
        "1/3 cup crumbled goat's milk feta cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Beef",
        "Herb",
        "Mustard",
        "High Fiber",
        "Feta",
        "Radish",
        "Spring",
        "Pan-Fry",
        "Healthy"
    ],
    "title": "Sliced Filet Mignon with Fava Beans, Radishes, and Mustard Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/sliced-filet-mignon-with-fava-beans-radishes-and-mustard-dressing-234424"
}
