{
    "directions": [
        "Heat 3/4 cup milk in a small saucepan over medium heat until simmering, stirring constantly.",
        "Remove saucepan from heat and stir in 1/4 cup margarine. Allow mixture to cool until lukewarm.",
        "Using the bread hook with an electric mixer, mix together the self-rising flour, yeast, and sugar and sucralose blend in a large mixing bowl.",
        "Stir the water, egg, and warm milk into the yeast mixture using the electric mixer; stir well to combine.",
        "Gradually stir in half of the whole wheat flour until no dry spots remain.",
        "Stir in the remaining flour, a 1/2 cup at a time, mixing well after each addition.",
        "When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.",
        "Cover dough with a damp cloth and allow to rest for 10 minutes.",
        "Mix the cream cheese, bananas, and pineapple together in a bowl.",
        "Stir in the pineapple extract and 3 packets of sweetener; mixture will be lumpy.",
        "Roll the dough out to about 9x12-inches.",
        "Spread the banana filling about 2-inches away from one of the longer edges.",
        "Roll the dough into a cylinder shape, beginning with the edge without filling.",
        "Pinch the seam to seal.",
        "Shape the dough into a ring by bringing the two open edges together; pinch to seal.",
        "Wipe any filling from the outside of the ring.",
        "Cover with a damp cloth and allow to rise for 30 minutes more.",
        "Preheat an oven to 375 degrees F (190 degrees C).",
        "Transfer the dough ring to a greased and floured baking sheet.",
        "Bake in the preheated oven until browned, about 20 minutes.",
        "Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
        "Mix 1 tablespoon margarine with confectioners' sugar in a small bowl.",
        "Stir in the remaining milk 1 tablespoon at a time until the mixture is easily drizzled.",
        "Drizzle about 1/4 of the icing over the cooled cake.",
        "Divide the remaining icing into 3 small bowls.",
        "Stir in the green food coloring into one bowl; stir the yellow food coloring into the next bowl; and stir the purple food coloring into the last bowl.",
        "Drizzle each of the colored icings over the cake."
    ],
    "ingredients": [
        "3/4 cup skim milk",
        "1/4 cup reduced-fat margarine, softened",
        "1 1/2 cups self-rising flour",
        "1 tablespoon instant yeast",
        "1/4 cup sugar and sucralose blend for baking (such as SPLENDA® Sugar Blend)",
        "1/4 cup water",
        "1 egg, beaten",
        "1 3/4 cups whole wheat flour",
        "3/4 (8 ounce) package fat-free cream cheese, softened",
        "2 very ripe bananas, mashed",
        "1/4 cup finely chopped pineapple",
        "1/8 teaspoon pineapple extract",
        "3 packets granular no-calorie sucralose sweetener (such as Splenda®)",
        "1 tablespoon reduced-fat margarine, softened",
        "1 cup confectioners' sugar",
        "2 1/2 tablespoons skim milk",
        "1/8 teaspoon green food coloring",
        "1/8 teaspoon yellow food coloring",
        "1/8 teaspoon purple food coloring"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Slim Fit King Cake",
    "url": "http://allrecipes.com/recipe/220017/slim-fit-king-cake/"
}
