{
    "directions": [
        "For the avocado crema: Place the cilantro, sour cream, avocado, lime zest and juice in a food processor and run until smooth. Season with salt and pepper and reserve, covered with plastic wrap pressed directly on top to keep from browning.",
        "For the filling: Preheat a heavy-bottomed 12-inch skillet over high heat, and then add in the oil. Add the poblano peppers, season with cumin, salt and pepper and toss to coat. Saute until the peppers are slightly soft and blistered, 5 to 7 minutes. Remove from the heat and set aside.",
        "In the same skillet, add the chorizo and cook over medium heat, breaking up with a wooden spoon as it cooks. Cook the chorizo until well browned and cooked through, 10 to 15 minutes. If your chorizo has extra fat you can drain it on a paper-towel-lined plate to remove excess fat and then add the chorizo back to the pan along with the salsa. If your chorizo doesn't have that much fat, just add in your salsa and keep the party going. Simmer until heated through, about 5 minutes.",
        "For the sandwich build: Slice, butter and toast each of the rolls until golden brown and crusty.",
        "Sprinkle some cheese on the bottom bun, and then a hefty spoonful of the hot chorizo. On top of the chorizo place some poblanos. Smear the top bun with lots of avocado crema and serve 'em up."
    ],
    "ingredients": [
        "1/2 cup fresh cilantro, leaves and tender stems",
        "1/4 cup sour cream",
        "1 avocado",
        "1 lime, zested and juiced",
        "Salt and freshly cracked black pepper",
        "1 tablespoon canola oil",
        "2 poblano peppers, seeded, ribbed and cut into 1/4-inch-by-2-inch strips",
        "1 teaspoon ground cumin",
        "Salt and freshly cracked black pepper",
        "2 pounds fresh Mexican chorizo",
        "One 12-ounce jar salsa (I like chunky, but use whatever you like)",
        "Salted butter, at room temperature, for toasting the buns",
        "4 fresh telera or bolillo rolls",
        "1 cup shredded Chihuahua cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Sandwich",
        "Chorizo",
        "Sausage Recipes",
        "Avocado",
        "Vegetable"
    ],
    "title": "Sloppy Jose with Chorizo, Charred Poblanos and Avocado Crema",
    "url": "http://www.foodnetwork.com/recipes/jeff-mauro/sloppy-jose-with-chorizo-charred-poblanos-and-avocado-crema-recipe"
}
