{
    "directions": [
        "Preheat the oven to 425 degrees F.",
        "Halve the peppers through the stems; remove the stems, seeds and membranes. In a 9-by-13-inch baking dish, toss the peppers with 1 tablespoon of the olive oil and 1/2 teaspoon salt, then arrange the peppers cut-sides up. Set aside.",
        "Heat the remaining 3 tablespoons olive oil in a large skillet over medium heat. Add the turkey and cook, breaking it up, until no longer pink, about 3 minutes. Add the carrots, onions, mushrooms and garlic and cook until the vegetables begin to soften, about 5 minutes. Season with the cumin, smoked paprika, 1/2 teaspoon salt and some pepper; stir to combine. Add the tomatoes, ketchup, mustard, brown sugar, vinegar, parsley and 3/4 cup water. Bring to a rapid simmer and cook until thickened, about 10 minutes.",
        "Spoon the filling into the pepper halves and sprinkle with the Cheddar. Pour 1/4 cup water into the bottom of the baking dish and tent with foil (so the foil is not touching the cheese). Bake until the peppers begin to soften, 20 to 25 minutes. Uncover and bake until peppers are very tender and the filling is browned and bubbly, another 15 to 20 minutes.",
        "Serve the stuffed peppers topped with crumbled corn chips."
    ],
    "ingredients": [
        "3 large red, yellow or orange bell peppers",
        "4 tablespoons extra-virgin olive oil",
        "Kosher salt and freshly ground black pepper",
        "1 pound ground turkey",
        "1 medium carrot, finely chopped",
        "1 small onion, finely chopped",
        "One 6-ounce package white mushrooms, finely chopped",
        "2 cloves garlic, finely chopped",
        "2 teaspoons ground cumin",
        "2 teaspoons smoked paprika",
        "One 14.5-ounce can fire-roasted tomatoes",
        "1/2 cup ketchup",
        "1 tablespoon Dijon mustard",
        "1 tablespoon light brown sugar",
        "1 tablespoon cider vinegar",
        "2 tablespoons chopped fresh Italian parsley",
        "1 cup grated Cheddar",
        "Corn chips, crumbled, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Bell Peppers",
        "Vegetable",
        "Poultry Recipes",
        "Turkey Recipes",
        "Main Dish Recipes"
    ],
    "title": "Sloppy Joe-Stuffed Peppers",
    "url": "http://www.foodnetwork.com/recipes/ayesha-curry/sloppy-joe-stuffed-peppers"
}
