{
    "directions": [
        "Put oven rack in upper third of oven and preheat oven to 400°F. Line a large shallow baking pan with foil, allowing 2 inches to hang over each end of pan.",
        "Wash leek pieces well in a bowl of cold water, then lift out and drain well.",
        "Whisk together honey, oil, salt, and pepper and add onions, shallots, and leeks, tossing to coat. Spread onion mixture in an even layer in baking pan. Scatter thyme on top, then cover with another large sheet of foil and crimp edges all around to seal, forming a package.",
        "Roast until very tender, about 1 hour. Carefully remove top sheet of foil (steam will emerge) and turn on broiler. Broil onion mixture 5 to 6 inches from heat until tops of onions are browned and caramelized, 2 to 5 minutes. (Check frequently, removing pieces as they brown.) Discard thyme.",
        "Whisk together oil, lemon juice, garlic, mustard, salt, and pepper in a large bowl.",
        "Trim endives and halve lengthwise. Cut in half crosswise, then cut lengthwise into 1/4-inch-wide strips.",
        "Just before serving, add endives to dressing along with spinach and chives and toss until lightly coated. Season with salt and pepper. 3Divide salad among 6 plates and top with warm onion mixture."
    ],
    "ingredients": [
        "4 medium leeks (1 lb total; white and pale green parts only), trimmed and cut crosswise into 1-inch pieces (1 cup)",
        "2 tablespoons mild honey",
        "1 tablespoon olive oil",
        "1/2 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 sweet onion such as Vidalia (1/2 lb), trimmed and cut crosswise into 6 slices",
        "1 large red onion (1/2 lb), trimmed and cut lengthwise into 6 wedges",
        "1 large white onion (10 oz), trimmed and cut lengthwise into 6 wedges",
        "6 medium shallots (10 oz total), trimmed",
        "8 fresh thyme sprigs",
        "1 tablespoon olive oil",
        "2 teaspoons fresh lemon juice",
        "1 teaspoon finely chopped garlic",
        "1 teaspoon coarse-grain mustard",
        "1/2 teaspoon salt",
        "1/2 teaspoon black pepper",
        "2 Belgian endives",
        "5 cups baby spinach (5 oz)",
        "1/4 cup chopped fresh chives or scallions",
        "Accompaniment: lemon wedges (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Onion",
        "Side",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "Leek",
        "Spinach",
        "Healthy",
        "Chive",
        "Endive",
        "Shallot",
        "Gourmet",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Slow-Cooked Onion Salad",
    "url": "http://www.epicurious.com/recipes/food/views/slow-cooked-onion-salad-230992"
}
