{
    "directions": [
        "Line a 5- to 6-quart slow cooker with a Reynolds(R) Slow Cooker Liner.",
        "Combine onions and beer in prepared slow cooker. If necessary, cut meat so it will fit in cooker. In a small bowl, combine the chili powder,  teaspoon cumin, black pepper, and garlic powder. Sprinkle the mixture evenly over all sides of meat; rub in with your fingers. Place meat in cooker.",
        "Cover and cook 8 to 10 hours on low or 5 hours on high.",
        "Transfer meat to a cutting board. Pull meat apart into shreds using two forks. Return meat to the slow cooker. Stir in barbecue sauce, vinegar, honey,  teaspoon cumin, and ginger gently with a rubber spatula. Heat through.",
        "Spoon meat into buns with a slotted spoon. Drizzle with sauce mixture as desired.  Top with Lime Carrot Slaw.",
        "Lime Carrot Slaw: Place a bag of pre-shredded cabbage and carrots into a large bowl. In a screw-top jar, combine olive oil; lime zest; lime juice; jalapeno; honey; salt; and black pepper. Cover and shake to combine. Stir into the cabbage mixture."
    ],
    "ingredients": [
        "2 medium onions, sliced into thin wedges",
        "1/2 cup light beer or water",
        "1 (2 pound) boneless pork loin roast, trimmed of fat",
        "1 teaspoon chili powder",
        "1 teaspoon ground cumin, divided",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon garlic powder",
        "1 cup barbecue sauce",
        "1/4 cup cider vinegar",
        "1 tablespoon honey",
        "1/2 teaspoon ground ginger",
        "12 whole wheat hamburger buns, split and toasted",
        "Lime Carrot Slaw:",
        "1 (8 ounce) package pre-shredded cabbage and carrots",
        "1/4 cup olive oil",
        "2 teaspoons lime zest",
        "3 tablespoons lime juice",
        "1 jalapeno, thinly sliced",
        "1 tablespoon honey",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Slow Cooker BBQ Pulled Pork Sandwiches",
    "url": "http://allrecipes.com/recipe/238138/slow-cooker-bbq-pulled-pork-sandwiche/"
}
