{
    "directions": [
        "Preheat the oven to 275 degrees. Use an oven thermometer to be sure your oven temperature is accurate.",
        "Place the filet on a sheet pan and pat it dry (all over) with paper towels. Brush the filet all over with the oil, reserving about half a tablespoon. Sprinkle it all over with the salt and pepper (it will seem like a lot but believe me, it makes a difference). Place the tarragon branches around the beef, tying them in 4 or 5 places with kitchen twine to keep them in place, and then brush the tarragon with the reserved oil.",
        "Roast the filet of beef for 1 1/4 to 1 1/2 hours, until the temperature registers 125 degrees in the center for rare and 135 degrees for medium-rare. Cover the filet with aluminum foil and allow to rest for 20 minutes. Slice thickly and serve warm or at room temperature with Basil Parmesan Mayonnaise.",
        "Place the egg yolks, lemon juice, Parmesan, mustard, basil, garlic, 1 tablespoon salt, and 1 teaspoon pepper in a food processor fitted with the steel blade. Process for 20 seconds, until smooth. Combine the vegetable oil and olive oil in a 2-cup liquid measuring cup. With the processor running, slowly pour the oil mixture through the feed tube to make a thick emulsion. Taste for seasonings -- the mayonnaise is a sauce so it should be highly seasoned. Store in the refrigerator until ready to use; it will keep for up to a week."
    ],
    "ingredients": [
        "1 whole filet of beef tenderloin, trimmed and tied (4 1/2 pounds)",
        "3 tablespoons good olive oil",
        "4 teaspoons kosher salt",
        "2 teaspoons coarsely ground black pepper",
        "10 to 15 branches fresh tarragon",
        "Basil Parmesan Mayonnaise, for serving, recipe follows",
        "2 extra-large egg yolks, at room temperature",
        "3 tablespoons freshly squeezed lemon juice",
        "1/2 cup freshly grated Parmesan cheese",
        "1 tablespoon Dijon mustard",
        "1/2 cup chopped fresh basil leaves, lightly packed",
        "1/2 teaspoon minced garlic",
        "Kosher salt and freshly ground black pepper",
        "1 cup vegetable oil, at room temperature",
        "1/2 cup good olive oil, at room temperature"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheese",
        "Parmesan Cheese Recipes",
        "Beef",
        "Meat",
        "Main Dish Recipes",
        "Roasting"
    ],
    "title": "Slow-Roasted Filet of Beef and Basil Parmesan Mayonnaise",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/slow-roasted-filet-of-beef-and-basil-parmesan-mayonnaise-recipe"
}
