{
    "directions": [
        "Place basmati rice in a large container and cover with several inches of cool water. Let soak, about 30 minutes. Drain.",
        "Heat 2 tablespoons vegetable oil in a large skillet over medium heat. Add cinnamon sticks, 8 cloves, and 4 black cardamom pods; fry until fragrant, about 1 minute. Add onions; cook and stir until lightly browned, about 5 minutes. Stir in ginger-garlic paste; cook until fragrant, about 1 minute. Sprinkle mint and cilantro on top; cook 1 minute more.",
        "Stir chicken into the skillet; season with 1 teaspoon salt. Cook and stir until chicken is browned, about 20 minutes. Stir in yogurt, green chile peppers, lemon juice, remaining 2 tablespoons oil, chile pepper, and turmeric. Cook until oil begins to separate from the sauce, 10 to 20 minutes. Reduce heat to low.",
        "Bring water to a boil in a large pot. Add 1 teaspoon salt, cumin, 2 green cardamom pods, 2 cloves, and bay leaves; boil for 1 minute. Add drained rice. Bring water back up to a boil and cook for 2 minutes. Remove from heat and drain, reserving whole spices in the rice.",
        "Spoon chicken mixture into a slow cooker. Top with partially cooked rice; mix together.",
        "Cook on High until rice is tender, about 1 hour 30 minutes."
    ],
    "ingredients": [
        "2 1/2 cups basmati rice",
        "1/4 cup vegetable oil, divided",
        "4 cinnamon sticks",
        "8 whole cloves",
        "4 pods black cardamom",
        "2 onions, sliced",
        "2 tablespoons ginger-garlic paste",
        "1/4 cup chopped fresh mint",
        "3 tablespoons chopped fresh cilantro",
        "1 1/2 pounds boneless chicken breast, cut into 2-inch cubes",
        "1 teaspoon salt",
        "3/4 cup fat-free yogurt",
        "4 green chile peppers",
        "1/4 cup lemon juice",
        "1 tablespoon ground chile pepper",
        "1/4 teaspoon ground turmeric",
        "10 cups water",
        "1 tablespoon salt",
        "1 teaspoon cumin seeds",
        "2 pods green cardamom",
        "2 whole cloves",
        "2 bay leaves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Slow-Cooked Chicken Biryani",
    "url": "http://allrecipes.com/recipe/246561/slow-cooked-chicken-biryani/"
}
