{
    "directions": [
        "To make the garlic rub, in a small dish, use the back of a spoon to mash together the garlic and salt. Then mash in the pepper, rosemary, thyme and mustard. Rub the paste onto all sides of the roast. Let the meat stand at room temperature for 30 minutes, or cover and refrigerate for up to 8 hours. If refrigerated, remove from the refrigerator 30 minutes before grilling.",
        "Prepare a charcoal or gas grill for indirect grilling over medium heat.",
        "For a charcoal grill: Place a drip pan on the center of the fire bed. Oil the grill rack. Sprinkle about half of the wood chips on the coals. Place the roast, fat side up, on the rack over the drip pan and cover the grill. Cook, without turning, adding the remaining wood chips after 1 hour and more coals as needed to maintain the temperature, until the roast is richly browned on all sides and cooked to your liking, about 2 hours for medium-rare.",
        "For a gas grill: Add the wood chips to the grill in a smoker box or perforated foil packet. Place the roast, fat side up, away from the heat elements and cover the grill. Cook, without turning, until the roast is richly browned on all sides and cooked to your liking, about 2 hours for medium-rare.",
        "If the rib bones blacken during roasting, lightly cover them with aluminum foil. Do not open the grill cover more than necessary or you will release the flavorful smoke and the temperature will drop.",
        "To test for doneness, insert an instant-read thermometer into the thickest part of the roast, away from the bone; it should register about 130°F. The temperature will rise another 5° to 10°F while the roast is resting.",
        "Transfer the roast to a carving board, cover loosely with aluminum foil and let rest for 15 minutes. Carve into thick slices on the bone, or cut away from the bone and carve into thinner slices. Serves 8.",
        "Adapted from Williams-Sonoma,",
        "Essentials of Grilling",
        ", by Denis Kelly, Melanie Barnard, Barbara Grunes & Michael McLaughlin (Oxmoor House, 2003)."
    ],
    "ingredients": [
        "4 large garlic cloves, finely chopped",
        "1 1/2 tsp. coarse sea or kosher salt",
        "1 1/2 tsp. freshly ground coarse pepper",
        "2 Tbs. chopped fresh rosemary",
        "2 Tbs. chopped fresh thyme",
        "2 Tbs. Dijon mustard",
        "1 standing 4-rib beef roast, 8 to 10 lb., trimmed   of excess fat",
        "2 to 3 handfuls mesquite chips, soaked if using   charcoal"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Slow-Smoked Rib Roast",
    "url": "http://www.williams-sonoma.com/recipe/slow-smoked-rib-roast.html"
}
