{
    "directions": [
        "Preheat the oven to 300 degrees F. Test your oven with an oven thermometer to be sure it's accurate!",
        "Score the fat on the pork diagonally with a sharp knife in a crosshatch pattern. With a small paring knife, make a dozen 1/2-inch-deep cuts in the top and sides of the pork to allow the seasonings to permeate the meat.",
        "Place the garlic, onion, jalapeno, and oregano in a food processor and process until the ingredients are finely chopped. Add the cumin, chile powder, 1 tablespoon salt, and 1 1/2 teaspoons pepper and process for 30 seconds to make a paste. Add the vinegar and olive oil and process to incorporate. Rub the mixture all over the pork, including the sides and the bottom, and place the pork in a large roasting pan, fat side up. Pour 2 cups of the wine into the pan and cover the whole roasting pan tightly with aluminum foil. Roast for 2 1/2 hours, remove the foil, and roast for another 4 to 4 1/2 hours, until the meat is very, very tender when tested with a carving fork. Every 2 hours, add another cup of wine to keep some liquid in the pan.",
        "Remove the pan from the oven, cover it tightly with aluminum foil, and allow the meat to rest for 15 to 30 minutes. Slice, sprinkle with salt, and serve with lime wedges on the side."
    ],
    "ingredients": [
        "1 (7- to 9-pound) bone-in pork butt with a layer of fat on top",
        "6 garlic cloves",
        "1 large yellow onion, chopped",
        "1 jalapeno pepper, ribs removed, seeded, and chopped",
        "1/4 cup chopped fresh oregano leaves",
        "1 1/2 tablespoons ground cumin",
        "1 1/2 teaspoons chipotle chile powder",
        "Kosher salt and freshly ground black pepper",
        "1 1/2 tablespoons apple cider vinegar",
        "1/4 cup good olive oil",
        "1 (750 ml) bottle dry white wine, such as Pinot Grigio",
        "Lime wedges, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pork Roast",
        "Meat",
        "Pork",
        "Roast Recipes",
        "Main Dish Recipes"
    ],
    "title": "Slow-Roasted Spiced Pork",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/slow-roasted-spiced-pork"
}
