{
    "directions": [
        "Combine all the ingredients except for the chicken in a resealable container, cover tightly, and shake well to combine. (Dry rub can be stored, covered, in a cool, dry place for up to 2 months.)",
        "In a stockpot, bring 1 gallon water and 1 cup dry rub to a boil, stirring until the sugar and salt are dissolved. Let the brine cool to room temperature, then transfer to a nonreactive container and refrigerate until chilled. Add the chicken to the cold brine and refrigerate for 4 to 8 hours.",
        "Set a wire rack on a baking sheet. Remove the chicken from the brine, pat dry with paper towels, and place on the wire rack. Discard the brine. Refrigerate for 6 hours.",
        "Put the chicken on a rimmed baking sheet and coat the chicken lightly all over with 1/2 cup dry rub (you may not need all of the rub) and set aside.",
        "Remove any ash and debris if the smoker has been previously used and clean the grates. Fill a chimney starter about halfway with hardwood charcoal. Loosely crumple a couple of pieces of newspaper and drizzle or spray them with vegetable oil (this helps the paper burn longer and speeds up the charcoal-lighting process). Stuff the paper into the chimney's lower chamber place the chimney on the smoker's top grate, and light it. Let the charcoal burn until the coals are glowing red and coated in gray ash, about 15 minutes. Put on a pair of heavy-duty fireproof gloves and carefully dump the charcoal into one side of the grill—over the bottom air vent if your grill has one—leaving the other half free of coals. Place a disposable aluminum tray on the other side to use as a drip pan.",
        "Place a few hardwood chunks or a foil packet of wood chips over the coals. Add the top grate and put your meat over the drip pan. Cover the grill, placing the air vents in the lid over the meat. Open both vents about halfway.",
        "Place the chicken in the smoker and smoke, maintaining a smoker temperature of between 200° and 225°F, replenishing the wood chunks or chips as needed, until an instant-read thermometer inserted into the center of a leg registers 165°F, 3 to 5 hours. Transfer the chicken to a cutting board and let rest for 10 minutes.",
        "At this point, you can cut the chicken into quarters or tear the meat into shreds to make pulled chicken. Or, if you want extra-crispy skin, you can briefly roast the chicken in a 450°F oven, or prepare a grill with hot and cool sides, put the chicken over the cool side, cover the grill, and cook for 5 to 10 minutes."
    ],
    "ingredients": [
        "3/4 cup packed dark brown sugar",
        "1/2 cup kosher salt",
        "1/2 cup ground espresso beans",
        "2 tablespoons freshly ground black pepper",
        "2 tablespoons garlic powder",
        "1 tablespoon ground cinnamon",
        "1 tablespoon ground cumin",
        "1 tablespoon cayenne pepper",
        "1 whole chicken (about 4 pounds), giblets removed",
        "Charcoal kettle grill, chimney starter, heavy-duty fireproof gloves, disposable aluminum tray, instant-read thermometer, hardwood charcoal, wood chunks or soaked wood chips, large non-reactive 5-gallon container."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Low Fat",
        "Kid-Friendly",
        "Grill/Barbecue",
        "Low Cholesterol",
        "Cinnamon",
        "Cumin"
    ],
    "title": "Slow-Smoked Barbecue Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/slow-smoked-barbecue-chicken-56389582"
}
