{
    "directions": [
        "In a medium-size skillet, heat the oil over medium-high heat and add the shallots, asparagus, and zucchini. Cook for a few minutes, just so the asparagus begins to be tender and the zucchini browns a bit. Remove from the heat and set aside to cool for 10 minutes. Coat the bottom and 2 inches up the sides of the slow cooker with nonstick cooking spray. Transfer the cooled vegetables to the crock.",
        "In a medium-size bowl, whisk together the eggs, Parmesan, and basil. Add some salt and a few turns of black pepper. Pour into the crock and stir to mix with the vegetables. Cover and cook on high for 60 to 70 minutes, until the frittata is set and the tip of a knife inserted into the center comes out clean. Do not overcook or else the eggs will become too firm. Cut into 4 sections and lift out with a spatula to plates. Serve immediately.",
        "Substitute the asparagus with 1 (10-ounce) package defrosted frozen artichoke hearts, thawed and coarsely chopped, plus 1 cup frozen peas, thawed.",
        "Substitute the asparagus with 1/2 pound broccoli florets, chopped into bite-size pieces (about 2 cups).",
        "On top of the vegetables, make a layer of 1 to 2 cups diced ham, or 8 slices cooked center-cut bacon, crumbled, or 8 slices Canadian bacon, or 6 thin slices prosciutto, chopped.",
        "Add a top layer of thinly sliced mozzarella, fontina, white American, or provolone cheese."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "2 medium-size shallots, chopped",
        "8 ounces asparagus, trimmed and cut into 2-inch pieces on the diagonal",
        "1 medium-size zucchini, sliced 1/2-inch thick",
        "12 large eggs",
        "1 cup grated Parmesan cheese",
        "1/4 cup chopped fresh basil or flat-leaf parsley leaves",
        "Sea salt and freshly ground black pepper",
        "5-7-qt. oval slow-cooker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Slow Cooker",
        "Frittata",
        "Egg",
        "Brunch",
        "Asparagus",
        "Zucchini",
        "Spring"
    ],
    "title": "Slow-Cooker Asparagus and Zucchini Frittata",
    "url": "http://www.epicurious.com/recipes/food/views/slow-cooker-asparagus-and-zucchini-frittata"
}
