{
    "directions": [
        "Pat the chicken dry with paper towels. Season the chicken generously all over with salt and pepper. In a large, heavy fry pan over medium-high heat, warm the 2 Tbs. olive oil. Working in batches to avoid crowding, add the chicken and sear, turning as needed, until golden brown, about 8 minutes total. Transfer the chicken to a plate.",
        "Pour off most of the fat from the pan and return it to medium-high heat. Add the onion and bay leaves and sauté until the onion is golden, about 5 minutes. Add the garlic and cook for 1 minute. Stir in the tarragon, the 1/2 tsp. salt and several grinds of pepper. Pour in the wine and stock and stir to dislodge any browned bits from the pan bottom. Transfer the contents of the pan to a slow cooker and stack the chicken on top. Cover and cook on low according to the manufacturer’s instructions until the chicken is tender, about 3 hours.",
        "Meanwhile, make the tapenade: In a food processor, combine the green olives, black olives, figs, garlic, olive oil, brandy, lemon zest and rosemary and pulse to form a chunky tapenade.",
        "Transfer the chicken to a plate and cover loosely with aluminum foil. Remove and discard the bay leaves. Strain the braising liquid into a small saucepan, let stand for a few minutes and then skim away the fat with a large spoon. Bring to a boil over high heat and boil until reduced by about half to concentrate the flavors, about 10 minutes.",
        "In a bowl, drizzle the arugula with a little olive oil, season with salt and pepper and toss. Divide the chicken among warmed plates and drizzle with the braising liquid. Top each portion with a large spoonful of tapenade and some of the arugula. Serve immediately. Serves 6.",
        "Adapted from Williams-Sonoma",
        "The New Slow Cooker,",
        "by Brigit Binns (Weldon Owen, 2010)."
    ],
    "ingredients": [
        "1 chicken, about 3 1/2 lb., cut into 8 pieces (2 thighs, 2 drumsticks, 2 breast-wing portions and 2 lower-breast portions)",
        "Salt, to taste, plus 1/2 tsp.",
        "Freshly ground pepper, to taste",
        "2 Tbs. olive oil, plus more for drizzling",
        "1/2 large yellow onion, finely chopped",
        "3 bay leaves",
        "5 garlic cloves, finely chopped",
        "1 tsp. dried tarragon",
        "1/2 cup dry white wine",
        "1/2 cup chicken stock",
        "1 cup pitted mild green olives, such as Picholine or Lucques",
        "1 cup pitted black olives, such as Niçoise",
        "2 dried brown figs, such as Brown Turkey, stemmed and chopped",
        "2 garlic cloves, chopped",
        "2 Tbs. extra-virgin olive oil",
        "2 tsp. brandy",
        "1 tsp. grated lemon zest",
        "1/4 tsp. minced fresh rosemary",
        "4 cups baby arugula"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Slow-Cooker Provençal Chicken",
    "url": "http://www.williams-sonoma.com/recipe/slow-cooker-provencal-chicken.html"
}
