{
    "directions": [
        "Combine the salt, brown sugar, paprika, black pepper, garlic powder, onion powder, cayenne pepper, and celery seed in a bowl; set aside. Remove all heavy fat from the ribs, then remove and discard the membrane covering the rib side. Cut the slabs into 3 to 4 bone portions, cutting evenly between the ribs to leave some meat on each portion.",
        "Rub the spice mixture into the rib portions front and back until all of the spice mixture has been used. Place the ribs into a resealable plastic bag, and refrigerate 4 hours to overnight. Letting the ribs sit overnight will give them the best flavor.",
        "When ready to cook, fill the water pan of your smoker with the apple, orange, lemon, lime, onion, red wine, and water. If you do not have a water pan, place the ingredients into a metal bowl, and set the bowl on the drip tray, above the heat source. Smoke with the wood chips of your choice at 250 to 300 degrees F (120 to 150 degrees C) until the ribs are no longer pink, and the meat easily pulls from the bone, 4 to 6 hours or more depending on the smoker and temperature. Change the wood chips according to manufacturer's directions.",
        "Preheat an outdoor grill for medium-low heat, and lightly oil grate. Stir together the soy sauce, lime juice, and ketchup in a bowl to make the barbeque sauce; set aside.",
        "After the ribs are fully cooked, remove them from the smoker, and brush them with the barbeque sauce. Cook on the preheated grill, brushing occasionally with the sauce, until the sauce has become sticky and infused into the ribs, 15 to 20 minutes."
    ],
    "ingredients": [
        "1/4 cup kosher salt",
        "1/4 cup packed brown sugar",
        "1/4 cup paprika",
        "3 tablespoons ground black pepper",
        "1 tablespoon garlic powder",
        "1 tablespoon onion powder",
        "1 teaspoon cayenne pepper",
        "1/2 teaspoon celery seed",
        "16 pounds pork spareribs",
        "1 apple, quartered",
        "1 orange, cut into wedges",
        "1 lemon, cut into wedges",
        "1 lime, cut into wedges",
        "1 onion, cut into wedges",
        "3 cups red wine",
        "3 cups water",
        "1/4 cup soy sauce",
        "1/4 cup lime juice",
        "1/2 cup ketchup"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Slow Smoked Pork Spareribs",
    "url": "http://allrecipes.com/recipe/173108/slow-smoked-pork-spareribs/"
}
