{
    "directions": [
        "In a large skillet, heat the canola oil over medium-high heat. Season the brisket on both sides with a generous pinch of salt. Sear the brisket in the hot pan until browned, about 4 minutes per side.",
        "To the slow cooker, add the parsley stems, celery and bay leaf. Put the seared brisket on top of the vegetables. In a large bowl whisk together the broth, wine, tomato paste, and pot roast seasoning. Pour the mixture over the brisket, top with onions, and cook on low, until the meat is fork-tender, about 4 to 6 hours. One hour before the brisket is done add the carrots, and mushrooms.",
        "Remove the meat, carrots, and mushrooms from the slow cooker and set aside. Strain the liquid into a medium pan over medium-high heat. In a small bowl, whisk together the gravy mix with 1 cup of cold water. Turn the heat to medium and whisk in the gravy mixture. Cook until thickened, about 2 minutes.",
        "Slice the brisket and arrange it on a serving platter. Serve it with the carrots, mushrooms, and gravy. Garnish with the reserved chopped parsley leaves and serve."
    ],
    "ingredients": [
        "Canola oil, for searing",
        "1 (2 1/2 to 3 pound) brisket",
        "Kosher salt",
        "1 bunch parsley, stems reserved and leaves chopped",
        "2 stalks celery with leaves, chopped",
        "1 bay leaf",
        "1 (14.5-ounce) can beef broth",
        "2 cups red wine",
        "2 tablespoons tomato paste",
        "1 (.87-ounce) packet slow cooker pot roast seasoning",
        "2 medium onions, chopped",
        "2 large carrots, sliced",
        "2 (8-ounce) packages mixed wild mushrooms",
        "1 (.87-ounce) packet brown gravy mix",
        "1 cup cold water",
        "Special equipment: a slow cooker"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Gravy",
        "Beef",
        "Meat"
    ],
    "title": "Slow Cooker Brisket with Brown Gravy",
    "url": "http://www.foodnetwork.com/recipes/sandra-lee/slow-cooker-brisket-with-brown-gravy-recipe"
}
