{
    "directions": [
        "For the sauce: Puree the onion in a blender with 1/4 cup water. Place the pureed onion in a 2-quart saucepan with additional water to cover. Bring to a boil, then reduce the heat. Cook, stirring constantly until the water has almost evaporated. Add the vinegar, tomato juice, pepper, garlic powder, cayenne and hot sauce and mix well. Bring to a boil, and then stir in the sugar. Immediately remove from the heat. Set 1 cup aside for the roast. Let the remaining sauce cool completely, then refrigerate for later use.",
        "For the roast: Put the quartered onions in the bottom of a 5- to 6-quart slow cooker. Mix the brown sugar, paprika, salt and pepper and rub it over the pork roast. Then place in the slow cooker on top of the onions. Drizzle the reserved 1 cup of sauce over the roast. Cook the roast in the slow cooker on low for 10 to 12 hours, checking after 10 hours for tenderness.",
        "Remove the meat and onions from the slow cooker. Discard the onions and finely shred the pork. Reserve the juices from the slow cooker to add to the meat for desired juiciness.",
        "Serve on a bun with the juice."
    ],
    "ingredients": [
        "1 cup finely chopped onion",
        "2 cups cider vinegar",
        "6 ounces tomato juice",
        "1/2 tablespoon pepper",
        "1 teaspoon garlic powder",
        "Pinch cayenne",
        "Dash hot sauce, such as Tabasco",
        "1 teaspoon sugar",
        "2 medium sweet onions, such as Vidalia, quartered",
        "2 teaspoons light brown sugar",
        "1 teaspoon smoked paprika",
        "2 teaspoons salt",
        "Pinch black pepper",
        "One 4- to 6-pound Boston butt pork roast, bone-in",
        "Buns, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pulled Pork",
        "Meat",
        "Pork",
        "Main Dish Recipes",
        "Lunch",
        "Slow-Cooker"
    ],
    "title": "Slow Cooker Georgia Pulled Pork Barbeque",
    "url": "http://www.foodnetwork.com/recipes/trisha-yearwood/slow-cooker-georgia-pulled-pork-barbeque-recipe"
}
