{
    "directions": [
        "Whisk lemon juice and mustard in small bowl. Gradually whisk in oil, then add capers. Season dressing to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill. Bring to room temperature and rewhisk before using.",
        "Place 1 asparagus spear flat on work surface. Using vegetable peeler, shave asparagus into long thin strips. Place asparagus strips in medium bowl with shaved fennel. DO AHEAD: Can be made 4 hours ahead. Cover and chill.",
        "Coat rimmed baking sheet with nonstick spray. Mix breadcrumbs, cheese, herbs, and lemon peel in another medium bowl. Sprinkle with salt and pepper. Drizzle melted butter over. Using fork, toss to incorporate evenly.",
        "Place halibut fillets on prepared baking sheet, spacing apart. Sprinkle with salt and pepper. Divide breadcrumbs among fillets to cover top (about 1/3 cup each), pressing to adhere. DO AHEAD: Can be made 1 hour ahead. Cover and chill.",
        "Preheat oven to 300°F. Bake halibut until opaque in center, about 20 minutes. Turn on broiler. Broil halibut just until breadcrumbs start to brown, about 1 minute.",
        "Place 1 halibut fillet on each of 6 plates. Pour dressing over asparagus and fennel mixture; toss to coat. Season salad to taste with salt and pepper. Divide salad among plates and serve."
    ],
    "ingredients": [
        "4 1/2 teaspoons fresh lemon juice",
        "1 tablespoon Dijon mustard",
        "3 tablespoons extra-virgin olive oil",
        "2 tablespoons drained capers, chopped",
        "3/4 pound asparagus spears (about 1 bunch), trimmed",
        "1/2 cup thinly sliced fennel bulb (preferably shaved with V-slicer)",
        "Nonstick vegetable oil spray",
        "2 1/2 cups fresh breadcrumbs made from crustless French bread",
        "3 tablespoons finely grated Parmesan cheese",
        "2 tablespoons finely chopped fresh Italian parsley",
        "1 tablespoon finely chopped fresh thyme",
        "2 teaspoons finely grated lemon peel",
        "3 tablespoons butter, melted",
        "6 6-ounce halibut fillets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Broil",
        "High Fiber",
        "Dinner",
        "Halibut",
        "Asparagus",
        "Fennel",
        "Spring",
        "Breadcrumbs",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Slow-Roasted Halibut with Shaved Asparagus and Fennel Salad",
    "url": "http://www.epicurious.com/recipes/food/views/slow-roasted-halibut-with-shaved-asparagus-and-fennel-salad-358230"
}
