{
    "directions": [
        "Bring a large pot of heavily salted water to a rapid boil over high heat. Working in 2 batches, blanch kale for 2 minutes. Drain, let cool, and squeeze out excess water with your hands. Coarsely chop; set aside.",
        "Heat a large pot over medium heat for 2 minutes. Add 1/4 cup oil, rosemary sprig, and chile. Let sizzle, shaking pan often, for about 1 minute. Reduce heat to medium-low; add onion. Season with 1/2 teaspoon salt and a pinch of pepper. Cook for 2 minutes, stirring often; stir in garlic. Cook, stirring often, until onion is soft and starting to brown, 5-7 minutes.",
        "Add remaining 2 tablespoons oil and kale; stir to coat. Season with 1/4 teaspoon salt, reduce heat to medium-low, and cook, stirring often, until kale turns almost black and is slightly crisp at edges, about 30 minutes. Let cool. Discard rosemary and chile."
    ],
    "ingredients": [
        "3/4 teaspoon kosher salt, divided, plus more",
        "1 pound Tuscan kale (about 2 bunches), center ribs and stems removed",
        "1/4 cup plus 2 tablespoons extra-virgin olive oil",
        "1/2 sprig rosemary",
        "1 dried chile de árbol, broken into 4 pieces",
        "1 cup sliced yellow onion",
        "Freshly ground black pepper",
        "2 garlic cloves, thinly sliced",
        "Ingredient info: Tuscan kale, also called black kale, dinosaur kale, Lacinato kale, or cavolo nero, has long, narrow, dark green bumpy leaves; find it at farmers' markets and some supermarkets. Dried chiles de árbol are available at Latin markets, specialty foods stores, and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Onion",
        "Side",
        "Sauté",
        "Thanksgiving",
        "Vegetarian",
        "Low Cal",
        "Kale",
        "Fall",
        "Winter",
        "Vegan",
        "Chile Pepper",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Slow-Cooked Tuscan Kale",
    "url": "http://www.epicurious.com/recipes/food/views/slow-cooked-tuscan-kale-51124300"
}
