{
    "directions": [
        "Season the chicken with salt and pepper. In the stovetop-safe insert of a slow cooker over medium-high heat, warm 1 Tbs. of the oil. Working in 2 batches, add the chicken and sear until golden brown, 4 to 5 minutes per batch. Transfer to a bowl.",
        "Warm the remaining 1 Tbs. oil in the insert. Add the mushrooms, salt and pepper and cook, stirring occasionally, until tender and golden brown, about 8 minutes. Add to the bowl with the chicken.",
        "Reduce the heat to medium and melt the butter. Add the flour and cook, stirring constantly, until the mixture smells fragrant and nutty, about 2 minutes. Whisk in the sherry and demi-glace. Slowly whisk in the stock until smooth, then bring to a boil. Add the chicken, mushrooms, thyme, pearl onions, celery, carrots, potatoes, salt and pepper. Place the insert on the slow-cooker base, cover and cook on high according to the manufacturer’s instructions for 2 hours.",
        "Meanwhile, make the biscuits: In a large bowl, whisk together the 2 cups flour, the baking powder, salt and sugar. Using a pastry blender or 2 knives, cut in the butter until pea-size crumbs form, then use your fingers to smear the butter into flat disks. Stir in the cheese, chives and parsley. Stir in the buttermilk until the dough just comes together.",
        "Transfer the dough to a floured work surface and roll out into a 9 1/2-by-11-inch rectangle. Fold the dough into thirds, rotate 90 degrees and roll out into the same-size rectangle. Fold again into thirds, rotate 90 degrees and roll out into a 7-by-9 1/2-inch rectangle about 1/2 inch thick. Using a floured 2 1/2-inch biscuit cutter, cut out the biscuits. Gather up the scraps, reroll the dough and cut out more biscuits. You should have 13 biscuits.",
        "Preheat an oven to 425ºF.",
        "Remove the insert from the slow-cooker base. Stir in the peas, chives and parsley. Arrange the biscuits on top and brush with the melted butter. Transfer to the oven and bake until the biscuits are golden brown and a toothpick inserted into the center of a biscuit comes out clean, 20 to 25 minutes. Let rest for 15 minutes before serving. Serves 8 to 10."
    ],
    "ingredients": [
        "2 lb. boneless, skinless chicken breasts, cut into 1-inch cubes",
        "Kosher salt and freshly ground pepper, to taste",
        "2 Tbs. canola oil",
        "3/4 lb. chanterelle mushrooms, cleaned and quartered",
        "16 Tbs. (2 sticks) unsalted butter, cut into 1/2-inch cubes",
        "1 cup all-purpose flour",
        "1/3 cup dry sherry",
        "1 Tbs. chicken demi-glace",
        "5 cups chicken stock",
        "2 tsp. chopped fresh thyme",
        "1 1/2 cups pearl onions",
        "3 celery stalks, sliced",
        "5 carrots, sliced",
        "1 lb. red potatoes, cut into 1/2-inch dice",
        "2 cups all-purpose flour, plus more as needed",
        "1 Tbs. baking powder",
        "1 1/2 tsp. kosher salt",
        "2 tsp. sugar",
        "8 Tbs. (1 stick) cold unsalted butter, cut into 8 pieces",
        "1 cup grated Parmigiano-Reggiano cheese",
        "1/4 cup chopped fresh chives",
        "2 Tbs. chopped fresh flat-leaf parsley",
        "3/4 cup plus 2 Tbs. buttermilk",
        "",
        "1 1/2 cups fresh or frozen peas",
        "1/4 cup chopped fresh chives",
        "1/4 cup chopped fresh flat-leaf parsley",
        "2 Tbs. unsalted butter, melted"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Slow-Cooked Chicken with Herbed Biscuits",
    "url": "http://www.williams-sonoma.com/recipe/slow-cooked-chicken-herb-biscuit.html"
}
