{
    "directions": [
        "Mix garlic, yogurt, mint, and lemon juice in a medium bowl. Season with salt, pepper, and more lemon juice, if desired.",
        "Mint yogurt can be made 1 day ahead. Cover and chill.",
        "Process anchovies, garlic, oil, parsley, mint, capers, and lemon juice in a food processor until herbs are finely chopped; season with salt and pepper.",
        "Salsa verde can be made 1 day ahead. Cover and chill.",
        "Prepare grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off).",
        "Blend rosemary, garlic, and 3/4 cup oil in a blender or food processor until rosemary and garlic are finely chopped. Season lamb all over with salt and pepper and smear with rosemary mixture.",
        "Grill lamb, fat side up, over direct heat, turning often and moving to cooler side of grill as needed to control flareups, until evenly browned all over, 15–20 minutes (lamb and marinade are both very fatty, so monitor closely and move off the grill for a moment if flare-ups get too intense). Position lamb over indirect heat and grill until an instant-read thermometer inserted into the thickest part of lamb registers 135°, 1 1/2–2 hours. (The leg is composed of several muscle groups; take the temperature in multiple spots for the most accurate reading.)",
        "Transfer lamb to a cutting board and let rest 5 minutes. Holding bone, thinly slice lamb against the grain, continuing until you reach the bone. Rotate lamb and continue to thinly slice (slice only as much as you are serving.)",
        "Top lamb with lemons and mint; serve with mint yogurt and salsa verde.",
        "Lamb can be marinated 1 day ahead; chill. Lamb can be grilled 2 hours ahead; hold at room temperature. Grill over high to reheat, about 4 minutes, before slicing and finishing as directed above."
    ],
    "ingredients": [
        "1 garlic clove, finely chopped",
        "2 cups whole-milk plain Greek yogurt",
        "1 cup chopped fresh mint",
        "1 tablespoon (or more) fresh lemon juice",
        "Kosher salt, freshly ground pepper",
        "6 oil-packed anchovy fillets",
        "4 garlic cloves, chopped",
        "3/4 cup extra-virgin olive oil",
        "3/4 cup chopped fresh parsley",
        "1/2 cup chopped fresh mint",
        "2 tablespoons drained capers",
        "1 tablespoon fresh lemon juice",
        "Kosher salt, freshly ground pepper",
        "1 cup rosemary leaves",
        "3/4 cup peeled garlic cloves (from about 2 heads)",
        "3/4 cup extra-virgin olive oil, plus more for serving",
        "1 (5 1/2–6 1/2-pounds) whole bone-in leg of lamb, shank attached, frenched",
        "Kosher salt, freshly ground pepper",
        "1 cup chopped preserved lemons",
        "1/2 cup chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Kid-Friendly",
        "Yogurt",
        "Mint",
        "Rosemary",
        "Grill/Barbecue"
    ],
    "title": "Slow-Grilled Leg of Lamb with Mint Yogurt and Salsa Verde",
    "url": "http://www.epicurious.com/recipes/food/views/slow-grilled-leg-of-lamb-with-mint-yogurt-and-salsa-verde-56389667"
}
