{
    "directions": [
        "Put oven rack in middle position and preheat oven to 225°F.",
        "Finely grate ginger on small holes of a box grater into a fine-mesh sieve, then set sieve over a bowl and press on ginger to extract 2 teaspoons juice. Bring soy sauce, wine, mirin, brown sugar, and ginger juice to a boil in a 3- to 3 1/2-quart heavy saucepan. Reduce heat to moderate and briskly simmer, stirring occasionally, until syrupy and reduced to about 1 cup, 45 to 55 minutes. Transfer to a bowl, then quick-chill by setting bowl in a larger bowl of ice water and stirring occasionally for 5 minutes. Stir in lime juice. Reserve 1/2 cup glaze in a small bowl for brushing after roasting.",
        "Line a 17- by 12-inch heavy shallow baking pan with foil and coat foil with oil (1 tablespoon).",
        "Arrange salmon, skin side down, diagonally in pan, then spoon about 2 tablespoons glaze over salmon, spreading it evenly with back of spoon. Let stand 5 minutes, then spoon and spread another 2 tablespoons glaze over salmon.",
        "Roast 15 minutes. Remove from oven and glaze again (use a clean spoon each time), then roast 10 minutes more. Repeat glazing and continue to roast until fish is just cooked through (opaque), 10 to 20 minutes more (35 to 45 minutes total, depending on thickness of fish; check frequently after 35 minutes). Transfer with 2 wide metal spatulas to a platter, then coat with a final layer of reserved glaze (about 2 tablespoons) using a clean spoon. Serve remaining glaze on the side if desired."
    ],
    "ingredients": [
        "1 (4-inch) piece peeled fresh ginger",
        "1 cup soy sauce",
        "2 cups dry red wine",
        "1 1/3 cups mirin (Japanese sweet rice wine)",
        "1/4 cup packed dark brown sugar",
        "2 teaspoons fresh lime juice",
        "1 tablespoon olive oil",
        "1 (4 1/2-pound) salmon fillet (preferably wild king; about 1 1/2 inches at thickest point), small bones removed",
        "Accompaniment: lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Fish",
        "Ginger",
        "Roast",
        "Dinner",
        "Seafood",
        "Salmon",
        "Red Wine",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Slow-Roasted Red-Wine-Lacquered Salmon Fillet",
    "url": "http://www.epicurious.com/recipes/food/views/slow-roasted-red-wine-lacquered-salmon-fillet-238700"
}
