{
    "directions": [
        "Pat the beef dry with paper towels and sprinkle well on all sides with salt and pepper. Heat the oil in a large deep skillet or Dutch oven over medium-high heat (or if your slow cooker has a browning feature, preheat it). Sear the meat on all sides until browned, then transfer to a plate.",
        "Add the garlic and onions to the pan or slow cooker and cook until softened, about 5 minutes. Add the tomato paste and cook, stirring, for 1 minute. Add the red wine and cook, scraping any browned bits off the bottom of the pan. If searing in a skillet, transfer the contents of the pan to a slow cooker set on low heat.",
        "Nestle the beef into the onions and add the broth, wine, Worcestershire, carrots, parsley, thyme, bay leaves and celery, and stir well to combine. Cover and cook until the meat is fork-tender, about 8 hours.",
        "Remove the roast from the slow cooker and cover to keep warm. Strain the cooking liquid into a large saucepan, and simmer over medium-low heat until thickened, about 10 minutes. (You can also puree some of the carrots and onions in a food processor and add it to the cooking liquid to thicken it.)",
        "Slice the pot roast, ladle the gravy over it, and serve."
    ],
    "ingredients": [
        "One 4- to 5-pound beef chuck roast",
        "Kosher salt and freshly ground black pepper",
        "2 tablespoons olive oil",
        "4 cloves garlic, coarsely chopped",
        "2 yellow onions, thickly sliced lengthwise",
        "2 tablespoons tomato paste",
        "2 cups reduced-sodium beef broth",
        "1/2 cup dry red wine",
        "2 tablespoons Worcestershire sauce",
        "3 carrots, peeled and chopped",
        "3 sprigs fresh parsley",
        "3 sprigs fresh thyme",
        "2 dried bay leaves",
        "2 stalks celery, sliced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Pot Roast",
        "Roast Recipes",
        "Beef",
        "Meat",
        "Main Dish Recipes",
        "Gluten Free",
        "Diabetes-Friendly",
        "Low-Carb",
        "Slow-Cooker"
    ],
    "title": "Slow Cooker Pot Roast",
    "url": "http://www.foodnetwork.com/recipes/slow-cooker-pot-roast"
}
