{
    "directions": [
        "Preheat oven to 500°F. Spread onions, celery, and carrots over bottom of large roasting pan. Rub thyme and mint over lamb shanks; sprinkle generously with salt and pepper. Place lamb shanks atop vegetables. Drizzle 3 tablespoons oil over. Roast uncovered 30 minutes. Pour 1 cup chicken stock over lamb and vegetables in pan. Reduce oven temperature to 425°F. Continue to roast uncovered until lamb is very tender and almost falls off bones, adding 1 cup stock to pan every 30 minutes and turning and basting lamb occasionally, about 3 hours longer. Using tongs, transfer lamb shanks to bowl; cover to keep warm.",
        "Transfer vegetables and pan juices to large saucepan; skim fat from surface. Add remaining 1 cup stock, wine, juniper berries if desired, and bay leaf to saucepan. Simmer 10 minutes to blend flavors. Strain, pressing on solids to extract as much vegetable pulp and liquid as possible. Return strained liquid to same saucepan; bring to boil. Mix flour and butter to blend in small bowl. Add to saucepan; whisk until sauce thickens slightly and is reduced to 2 cups, about 2 minutes. Season sauce with salt and pepper.",
        "Spoon Braised Lentils onto 4 plates. Drizzle remaining 2 tablespoons oil over lentils. Top each serving with 1 lamb shank. Spoon sauce over lamb.",
        "Available in the spice section of most supermarkets."
    ],
    "ingredients": [
        "2 1/2 cups chopped red onions",
        "1 cup diced celery",
        "1 cup diced peeled carrots",
        "3 tablespoons chopped fresh thyme",
        "3 tablespoons chopped fresh mint",
        "4 large lamb shanks (about 6 pounds total)",
        "5 tablespoons extra-virgin olive oil",
        "8 cups chicken stock or canned low-salt chicken broth",
        "1/2 cup dry red wine",
        "4 juniper berries* (optional)",
        "1 bay leaf",
        "1 tablespoon all purpose flour",
        "1 tablespoon butter, room temperature",
        "Braised Lentils"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Lamb",
        "Onion",
        "Braise",
        "Roast",
        "Celery",
        "Carrot",
        "Red Wine",
        "Winter"
    ],
    "title": "Slow Roasted Lamb Shanks with Braised Lentils",
    "url": "http://www.epicurious.com/recipes/food/views/slow-roasted-lamb-shanks-with-braised-lentils-105551"
}
