{
    "directions": [
        "Combine flour, salt, and pepper in a shallow dish; add beef pieces. Toss to coat each piece evenly. Reserve remaining flour mixture for later use.",
        "Heat oil in a large non-stick skillet; cook and stir coated beef, working in batches, until browned on all sides, about 10 minutes per batch. Transfer cooked beef to a slow cooker.",
        "Cook and stir onion in the same skillet used for beef until golden, about 5 minutes. Add beer and garlic; bring to a boil for 1 minute. Scrape browned bits of food from bottom of the pan with a wooden spoon. Pour onion mixture into the slow cooker.",
        "Mix beef broth, parsley, thyme, and bay leaves into beef mixture in slow cooker.",
        "Cook on Low until beef is almost tender, 2 1/2 to 3 hours. Sprinkle in the reserved flour mixture; stir well. Add potatoes and carrots.",
        "Cook on High until potatoes are tender, about 1 hour.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Arrange puff pastry on baking sheets; pierce each piece several times with a fork.",
        "Bake in the preheated oven until golden and crispy, about 10 minutes. Ladle stew into individual dishes; top each with a pastry square."
    ],
    "ingredients": [
        "1/2 cup all-purpose flour",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "3 pounds boneless beef chuck, trimmed and cut into 1 1/2-inch pieces",
        "1/4 cup vegetable oil",
        "1 large yellow onion, coarsely chopped",
        "1 (15 ounce) can Irish stout beer (e.g. Guinness®)",
        "4 cloves garlic, chopped",
        "1 (14.5 ounce) can beef broth",
        "1 tablespoon chopped fresh parsley",
        "2 sprigs fresh thyme",
        "2 bay leaves",
        "1 pound round red potatoes, halved",
        "3 carrots, cut into 1-inch chunks",
        "1 (17.5 ounce) package frozen puff pastry, thawed and cut into quarters (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Slow Cooker Guinness® Beef Stew",
    "url": "http://allrecipes.com/recipe/232694/slow-cooker-guinness-beef-stew/"
}
