{
    "directions": [
        "Preheat broiler. Line a 5- to 6-quart slow cooker with a Reynolds(R) Slow Cooker Liner. Open slow cooker liner and place it inside a slow cooker bowl. Fit liner snugly against the bottom and sides of bowl; pull top of liner over rim of bowl.",
        "Place the potatoes and onion in the prepared slow cooker. Top with the brisket, apple juice, thyme, salt and pepper.",
        "Cook on low for 4 hours. Add the cabbage and apples to the slow cooker; cook on low for an additional 2 hours.",
        "While the corned beef cooks, place rye bread on a baking sheet lined with Reynolds Wrap(R) Foil. Spread bread with 2 tablespoons butter and broil 4 to 5 inches from heat 1 to 2 minutes or until toasted. Sprinkle with Gruyere cheese. Broil 1 to 2 minutes more or until cheese melts and browns.",
        "Carefully remove lid to allow steam to escape. Remove corned beef from slow cooker and thinly slice across the grain. Place on a large platter with the vegetables and apples, and drizzle with broth from the slow cooker to serve. Serve with rye bread cheese toasts. Do not lift or transport liner with food inside. Cool slow cooker completely; remove liner and toss."
    ],
    "ingredients": [
        "Corned Beef:",
        "1 pound tiny new potatoes",
        "1 yellow onion, quartered",
        "1 (2 pound) lean center-cut corned beef brisket",
        "2 cups apple juice",
        "2 teaspoons dried thyme",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "1 pound cabbage - outer leaves removed, cored, cut into 1/2-inch-thick wedges",
        "2 cooking apples, cored and quartered",
        "1 Reynolds® Slow Cooker Liner",
        "Rye Bread Cheese Toasts:",
        "12 slices party rye",
        "2 tablespoons butter, softened",
        "3/4 cup shredded Gruyere cheese",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Slow Cooker Corned Beef and Cabbage from Reynolds®",
    "url": "http://allrecipes.com/recipe/245840/slow-cooker-corned-beef-and-cabbage-f/"
}
