{
    "directions": [
        "Generously season the brisket all over with salt and pepper. In the stovetop-safe insert of a slow cooker over medium-high heat, warm the olive oil until just smoking. Add the brisket and sear on all sides and the ends, 12 to 15 minutes total. Transfer to a platter.",
        "Add the onions to the insert and cook, turning once, until lightly browned 2 to 3 minutes per side. Add the garlic and stir until fragrant, about 1 minute. Slowly add the wine, stirring constantly. Tie the rosemary and thyme sprigs together in a square of cheesecloth. Add the herb bundle, demi-glace, tomato paste and broth to the insert and bring to a simmer. Continue to simmer until the liquid is slightly thickened, 3 to 4 minutes.",
        "Return the brisket, seam side down, to the insert and transfer to the slow-cooker base. Cover and cook on high according to the manufacturer’s instructions for 4 hours. Carefully transfer the brisket to a carving board, cover loosely with aluminum foil and let rest for 20 to 30 minutes.",
        "Meanwhile, skim the excess fat off the cooking liquid and set the insert on the stovetop over medium-high heat. Simmer until the sauce is slightly thickened, 5 to 8 minutes. Adjust the seasoning with salt and pepper.",
        "Cut the brisket into slices and spoon the sauce and onions on top. Serves 6 to 8.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "1 flat-cut beef brisket, 4 1/2 to 5 lb. (2.25 to 2.5 kg), rolled and tied",
        "Kosher salt and freshly ground pepper",
        "1 Tbs. olive oil",
        "1 1/2 lb. (750 g) cipollini onions, peeled",
        "4 garlic cloves, smashed",
        "1/2 cup (4 fl. oz./125 ml) dry red wine, such as Zinfandel",
        "3 fresh rosemary sprigs",
        "3 fresh thyme sprigs",
        "2 Tbs. chicken demi-glace",
        "1/4 cup (2 oz./60 g) tomato paste",
        "1 3/4 cups (14 fl. oz./430 ml) beef broth"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Slow Cooker Beef Brisket",
    "url": "http://www.williams-sonoma.com/recipe/slow-cooker-beef-brisket.html"
}
