{
    "directions": [
        "1. Grease the slow cooker with cooking spray.",
        "2. Place the eggplant and zucchini in a large colander and toss well with 3 tablespoons of the salt; let sit for about 45 minutes. Rinse well to remove the salt, then dry well, gently squeezing out excess water with a kitchen towel. Add to the greased slow cooker. Heat 2 tablespoons of the butter in a 10-inch, heavy sauté pan over medium-high heat. When warm, add the onions, bell peppers, and garlic and sauté until the vegetables are softened, about 8 minutes. Transfer to the slow cooker. Reduce the heat to medium and add the remaining 1 tablespoon of butter. As soon as it melts, add the flour and tomato paste, and cook until the mixture is thickened and the flour disappears, about 1 minute. Increase the heat to medium high and add the tomatoes with their juices, thyme, and pepper. Cook, crushing the tomatoes a bit with a wooden spoon, until thickened and smooth, about 6 minutes. Mix with the vegetables in the slow cooker. Cover the slow cooker and cook on low until the vegetables are tender, 4 to 5 hours. Uncover and remove from the heat; immediately stir in the cheese and basil.",
        "While the ratatouille is cooking, add the stock and salt to a medium, heavy saucepan and bring to a boil over medium-high heat. Once boiling, gradually whisk in the cornmeal. Reduce the heat to low, and cook, stirring every 3 minutes, until creamy and thickened, 30 to 35 minutes. Remove from the heat and stir in the butter, cheese, and pepper.",
        "Ladle polenta into individual bowls, spoon ratatouille on top, and serve immediately."
    ],
    "ingredients": [
        "Cooking spray",
        "2 large eggplants, peeled and cut into 1/2-inch pieces (about 10 1/2 cups)",
        "3 medium zucchini or yellow summer squash, cut into 1/2-inch pieces (about 6 1/2 cups)",
        "3 tablespoons coarse salt",
        "3 tablespoons unsalted butter, divided",
        "2 small to medium red onions, halved and thinly sliced (about 3 1/2 cups)",
        "2 red bell peppers, cut into 1/2-inch pieces (about 3 cups)",
        "3 tablespoons finely chopped garlic",
        "1/4 cup all-purpose flour",
        "1/4 cup tomato paste",
        "One 28-ounce can whole peeled tomatoes",
        "1 tablespoon finely chopped fresh thyme leaves",
        "10 grinds black pepper",
        "1/2 cup packed freshly grated Parmigiano-Reggiano (about 1/4 pound)",
        "1 cup coarsely chopped fresh basil leaves",
        "6 cups low-sodium vegetable or chicken stock",
        "1 1/2 teaspoons coarse salt",
        "1 1/2 cups polenta or coarse-ground cornmeal (not instant)",
        "1/2 stick unsalted butter",
        "4 ounces fresh goat cheese (about 1/2 cup)",
        "10 grinds black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Slow Cooker",
        "Tomato",
        "Vegetarian",
        "Dinner",
        "Goat Cheese",
        "Eggplant",
        "Bell Pepper",
        "Squash",
        "Zucchini",
        "Spring",
        "Summer",
        "Healthy",
        "Hominy/Cornmeal/Masa",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Slow-Cooked Ratatouille Over Goat Cheese Polenta",
    "url": "http://www.epicurious.com/recipes/food/views/slow-cooked-ratatouille-over-goat-cheese-polenta-51152210"
}
