{
    "directions": [
        "In the stovetop-safe insert of a slow cooker over medium-high heat, warm 2 Tbs. of the olive oil. Working in batches, sear the beef until browned on all sides, 4 to 6 minutes per batch. Transfer to a platter.",
        "Warm 2 Tbs. of the olive oil in the insert. Add the mushrooms and cook, stirring occasionally, until browned and tender, 6 to 8 minutes. Transfer to the platter.",
        "Warm the remaining 1 Tbs. olive oil in the insert. Add the yellow onion and cook, stirring occasionally, until softened, 6 to 8 minutes. Add the garlic and flour and cook, stirring frequently, until fragrant, about 1 minute. Slowly whisk in the beer, broth and demi-glace and bring to a simmer. Add the bouquet garni, salt, pepper, beef, mushrooms and pearl onions.",
        "Place the insert on the slow-cooker base, cover and cook on high for 2 hours. Add the carrots, cover and cook for 2 hours more. Stir in the peas.",
        "Preheat a broiler. Spread the mashed potatoes over the beef mixture, forming a 1-inch layer, and sprinkle with the cheese. Transfer the insert to the broiler and broil until the cheese is melted and starting to brown, 10 to 12 minutes. Let rest for 10 minutes before serving. Serves 12."
    ],
    "ingredients": [
        "5 Tbs. olive oil",
        "5 lb. boneless beef chuck, cut into 1-inch cubes",
        "1 lb. button mushrooms, quartered if large",
        "1 yellow onion, diced",
        "3 garlic cloves, minced",
        "5 Tbs. all-purpose flour",
        "1/2 cup Guinness or other stout beer",
        "1 cup beef broth",
        "1/4 cup mushroom demi-glace",
        "1 bouquet garni",
        "Salt and freshly ground pepper, to taste",
        "1 bag (14 oz.) frozen pearl onions, thawed",
        "1 1/4 lb. carrots, peeled and cut into 1-inch pieces",
        "1 cup fresh or thawed frozen peas",
        "6 cups mashed potatoes",
        "1/2 cup grated cheddar cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Slow-Cooker Shepherd’s Pie",
    "url": "http://www.williams-sonoma.com/recipe/slow-cooker-shepherds-pie.html"
}
