{
    "directions": [
        "To prepare in a slow cooker: Heat the oil in a skillet over medium heat. Add the onions and celery and cook until the onions are soft and translucent, 3 to 5 minutes. Add the garlic and cook until fragrant, 45 to 60 seconds. Transfer to a slow cooker. Add the diced tomatoes and tomato sauce. Fill the tomato sauce can with water and add to the cooker, as well. Add the chicken, pork, corn, butterbeans and potatoes. Season with salt and pepper. Turn the cooker on high and cook for 4 hours, or cook on low for 8 hours. Taste and adjust for seasoning with salt and pepper.",
        "To prepare on the stove: Heat the oil in a large heavy-duty pot over medium heat. Add the onions and celery and cook until the onions are soft and translucent, 3 to 5 minutes. Add the garlic and cook until fragrant, 45 to 60 seconds. Add the diced tomatoes and tomato sauce. Fill the tomato sauce can with water and add to the pot, as well. Add the chicken, pork, corn, butterbeans and potatoes. Season with salt and pepper. Bring to a boil over high heat. Reduce the heat to simmer and cook uncovered, stirring often, until the potatoes and butterbeans are tender and the mixture is thick, about 45 minutes. Taste and adjust for seasoning with salt and pepper."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "1 onion, chopped",
        "1 stalk celery, chopped",
        "2 cloves garlic, very finely chopped",
        "Two 28-ounce cans low-sodium diced tomatoes",
        "One 15-ounce can low-sodium tomato sauce",
        "One 2-pound roast or BBQ chicken, meat coarsely shredded (skin and bones discarded)",
        "1 pound chopped or pulled BBQ pork",
        "Scraped kernels from 4 ears fresh sweet corn (about 2 cups) or 2 cups frozen corn, defrosted",
        "1 1/2 cups frozen butterbeans, defrosted",
        "2 Idaho potatoes, peeled and cut into 1/2-inch cubes",
        "Coarse kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Southern Recipes",
        "Stew Recipes",
        "Beef",
        "Meat",
        "Vegetable",
        "Pork",
        "Beans and Legumes",
        "Main Dish Recipes",
        "Slow-Cooker"
    ],
    "title": "Slow Cooker Brunswick Stew",
    "url": "http://www.foodnetwork.com/recipes/slow-cooker-brunswick-stew"
}
