{
    "directions": [
        "Preheat oven to 500°F.",
        "Season each duck inside and out with salt and pepper. Using knife, skewer, or sharp fork, prick skin of each bird all over 20 to 30 times, taking care not to let knife puncture flesh (it's helpful to hold knife nearly parallel to duck and then slide it in). Stuff each cavity with 1 neck; 1/2 of thyme and garlic; 8 shallot halves; and 1/4 of fennel. Using kitchen string, tie legs loosely together.",
        "Transfer ducks, breast sides up, to rack set in large roasting pan. Cover loosely with foil and roast 15 minutes. Reduce heat to 300°F and continue to roast, basting every 30 minutes and skimming fat from pan juices occasionally, 3 hours.",
        "Remove foil from ducks. Stir remaining fennel into pan juices and roast 30 minutes more. Stir olives into pan juices and roast until duck skin is dark golden and crisp and meat is tender, about 30 minutes more (total roasting time: about 4 1/4 hours). Transfer ducks to cutting board.",
        "Remove rack from roasting pan. With slotted spoon, remove fennel and olives from pan juices and place in blender. Pour pan juices into 1-quart glass measure. Skim fat off top and reserve for another use. Add juices to fennel and olives in blender, then add lemon zest and juice. Purée until smooth. Taste and add salt and pepper and additional lemon juice if desired.",
        "Remove confit vegetables from cavities and carve ducks. Arrange meat and vegetables on platter. Garnish with chopped fennel fronds. Serve sauce alongside."
    ],
    "ingredients": [
        "2 (4-pound) ducks, necks reserved, rinsed inside and out, patted dry, and any feathers and quills removed with tweezers or needle-nose pliers",
        "1 teaspoon kosher salt, plus additional to taste",
        "1/2 teaspoon freshly ground black pepper, plus additional to taste",
        "1 bunch fresh thyme",
        "1 head garlic, cloves separated, skin left on",
        "8 shallots, peeled and halved",
        "4 heads fennel, trimmed (fronds reserved for garnish), halved lengthwise, and cut into 1/4-inch slices",
        "1 cup pitted kalamata olives",
        "1 teaspoon finely grated lemon zest",
        "1 teaspoon freshly squeezed lemon juice, plus additional to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Garlic",
        "Olive",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Lemon",
        "Fennel",
        "Fall",
        "Thyme",
        "Shallot"
    ],
    "title": "Slow-Roasted Duck with Olive Gravy and Garlic-Fennel Confit",
    "url": "http://www.epicurious.com/recipes/food/views/slow-roasted-duck-with-olive-gravy-and-garlic-fennel-confit-236323"
}
