{
    "directions": [
        "Preheat oven to 250°F. Brush a large baking dish with oil. Combine chickpeas, cumin, and 1 tablespoon oil in a medium bowl. Mash about half of chickpeas with a fork; season with salt and pepper. Transfer chickpea mixture to prepared dish.",
        "Heat remaining 1 tablespoon oil in a large skillet over medium-high heat. Cook garlic, stirring, until fragrant, about 30 seconds. Add mustard greens and cook, tossing, until slightly wilted, about 1 minute. Add honey and 1/4 cup water; season with salt and pepper. Cook, tossing, until greens are completely wilted, about 2 minutes. Transfer to dish with chickpea mixture.",
        "Season salmon with salt and pepper; arrange over greens and chickpea mixture and drizzle with oil. Bake until salmon is opaque in the center, 30–35 minutes.",
        "Whisk shallot, lemon juice, mustard, and honey in a small bowl; season with salt and pepper. Gradually whisk in olive oil; season with salt and pepper.",
        "Heat vegetable oil in a small saucepan over medium-high heat. Cook capers until opened and crisp, about 30 seconds; drain on paper towels.",
        "Drizzle salmon with vinaigrette and top with capers."
    ],
    "ingredients": [
        "2 tablespoons olive oil, plus more",
        "1 15.5-ounce can chickpeas, rinsed",
        "1/2 teaspoon ground cumin",
        "Kosher salt, freshly ground pepper",
        "1 garlic clove, thinly sliced",
        "1 small bunch mustard greens, ribs and stems removed, leaves coarsely chopped",
        "1 teaspoon honey",
        "4 6-ounce skinless salmon fillets",
        "1/2 small shallot, very finely chopped",
        "2 tablespoons fresh lemon juice",
        "1 teaspoon Dijon mustard",
        "1/2 teaspoon honey",
        "Kosher salt, freshly ground pepper",
        "1/4 cup olive oil",
        "1/4 cup vegetable oil",
        "2 tablespoons capers, rinsed, patted dry"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Leafy Green",
        "Bake",
        "Dinner",
        "Seafood",
        "Salmon",
        "Chickpea",
        "Mustard Greens",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Slow-Cooked Salmon, Chickpeas, and Greens",
    "url": "http://www.epicurious.com/recipes/food/views/slow-cooked-salmon-chickpeas-and-greens-51224050"
}
