{
    "directions": [
        "Coarsely chop together the rosemary, sage and thyme, and transfer them to a small bowl. Add 2 tablespoons of the oil, and stir to combine.",
        "Score the fat cap of the pork shoulder in a crosshatch pattern, then rub it all over with 2 1/2 tablespoons salt and 2 teaspoons pepper.",
        "Heat a large skillet over medium-high heat. Add the remaining 3 tablespoons oil, and heat until shimmering. Add the pork, fat-side down, and brown it well, 3 to 4 minutes, then brown it all over, 3 to 4 minutes per side. Transfer the pork to a large plate.",
        "Add the wine, garlic and allspice to the pan, bring to a simmer and reduce by about half. Set aside.",
        "Put the carrots, celery, onions and bay leaves in the insert of a 7-quart slow cooker. Rub the herbed oil all over the pork, being sure to push some into all the natural divisions between muscles; place it on top of the vegetables, and pour in any collected juices. Add the reduced wine mixture and the chicken broth, cover and cook on low for 8 hours.",
        "Transfer the pork to a cutting board, and tent with foil. Transfer the vegetables to a serving platter with a slotted spoon. Discard the bay leaves, and tent the vegetables with foil. Pour the juices into a liquid measuring cup, and let them settle for about 10 minutes. The fat should rise to the surface; spoon off as much as you can, and discard. Pour the juices into a small saucepan, and bring to a boil.",
        "While the juices boil, make a cornstarch slurry: For every cup of juices, mix 1 teaspoon cornstarch into 1 tablespoon cold water until dissolved. Reduce the heat so the juices are simmering, whisk in the slurry and cook, whisking frequently, until the sauce has slightly thickened, about 5 minutes. Stir in 2 tablespoons of the parsley. Season with salt if necessary.",
        "Slice the pork against the grain into 1/4-inch-thick slices, and arrange on a large platter with the vegetables. Ladle some of the sauce on top. Season the meat with a pinch of salt, and garnish with the remaining 2 tablespoons parsley. Serve with egg noodles, and pass the remaining sauce."
    ],
    "ingredients": [
        "3 tablespoons fresh rosemary leaves",
        "3 tablespoons fresh sage leaves",
        "1 tablespoon fresh thyme leaves",
        "5 tablespoons olive oil",
        "One 5- to 6-pound boneless pork shoulder with a fat cap",
        "Kosher salt and freshly ground black pepper",
        "1/2 cup dry white wine",
        "2 large cloves garlic, finely chopped",
        "1/4 teaspoon ground allspice",
        "4 large carrots, cut into rough 1-inch chunks",
        "4 celery ribs, cut into 2-inch-long pieces",
        "1 large onion, trimmed but left intact at the root end, cut into eighths",
        "2 bay leaves",
        "1 cup low-sodium chicken broth",
        "3 to 4 teaspoons cornstarch",
        "1/4 cup chopped fresh parsley",
        "Buttered egg noodles, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pork Roast",
        "Meat",
        "Pork",
        "Roast Recipes",
        "Pot Roast",
        "Main Dish Recipes",
        "Slow-Cooker"
    ],
    "title": "Slow Cooker Pork Roast",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/slow-cooker-pork-roast"
}
