{
    "directions": [
        "Season the ribs liberally with herbs and salt and pepper. Place in a large non-reactive bowl or deep container and cover with wine. Marinate for 12 hours in the refrigerator.",
        "Preheat oven to 375 degrees F.",
        "Remove ribs from marinade, pour all the wine into a sauce pot, and reduce by half. Meanwhile, heat a layer of olive oil in a large cast iron pan over medium-high heat. Sear ribs on all sides until well browned. Place browned ribs into a braising or deep roasting pan. Brown onion, carrots, celery, and garlic in the same cast iron pan, adding more oil as needed. Scatter browned vegetables over the ribs. Add the reduced wine, the stock, bay leaves, and mushrooms. Cover the pan with parchment paper and foil and place in the oven for 5 hours. Transfer from the oven and allow the ribs to rest for 1 hour before removing the bones. Skim any fat from the sauce. Remove vegetables from the pan and set aside. While ribs are resting, strain sauce into a sauce pot and reduce for 1 hour. Pour hot sauce over ribs and vegetables and serve."
    ],
    "ingredients": [
        "5 pounds ( 3-inch thick cut) bone-in beef short ribs",
        "1 bunch each fresh thyme, rosemary, and sage leaves, chopped",
        "2 tablespoons each kosher salt and freshly ground black pepper",
        "2 (750-ml) bottles Cabernet Sauvignon",
        "Olive oil, for searing ribs",
        "1 yellow onion, medium dice",
        "2 carrots, peeled and medium dice",
        "2 ribs celery, medium dice",
        "3 cloves garlic",
        "4 quarts veal stock",
        "3 bay leaves",
        "1-ounce dry porcini mushrooms"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Short Ribs",
        "Ribs Recipes",
        "Beef",
        "Meat",
        "Mushroom",
        "Vegetable",
        "Main Dish Recipes",
        "Roasting",
        "Marinating Recipes"
    ],
    "title": "Slow Braised Beef Short Ribs",
    "url": "http://www.foodnetwork.com/recipes/slow-braised-beef-short-ribs-recipe"
}
