{
    "directions": [
        "Place the onion and garlic into a large slow cooker. Pour in the ketchup, beer, vinegar, Worcestershire sauce, and liquid smoke; set aside. Combine the salt, pepper, chili powder, paprika, oregano, and brown sugar until evenly blended. Rub the spice mixture all over the beef brisket. Place the brisket into the slow cooker. Sprinkle the remaining spice mixture over top.",
        "Cover, and cook on Low until the beef is easily shredded with two forks, 10 to 12 hours.",
        "Remove the beef from the slow cooker, and place into a large bowl. Ladle the fat from the remaining sauce in the slow cooker and discard. Pour about 2 cups of the sauce from the slow cooker into a saucepan. Bring to a simmer over medium heat. Dissolve the cornstarch in the water, and stir into the simmering sauce. Cook and stir 5 to 10 minutes until the sauce has thickened. Meanwhile, shred the meat into small pieces using two forks.",
        "Pour the thickened sauce and remaining sauce from the slow cooker into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the sauce right in the slow cooker.",
        "Stir the shredded beef and pureed sauce together in the slow cooker. Use tongs to serve the beef on the potato buns."
    ],
    "ingredients": [
        "1 large onion, chopped",
        "4 cloves garlic, minced",
        "1 cup ketchup",
        "1/2 cup beer",
        "1/2 cup white vinegar",
        "1 tablespoon Worcestershire sauce",
        "4 drops liquid smoke flavoring",
        "1/2 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1 1/2 teaspoons chili powder",
        "1 teaspoon smoked paprika",
        "1 teaspoon dried oregano",
        "1/2 cup brown sugar",
        "4 pounds beef brisket",
        "2 teaspoons cornstarch",
        "2 tablespoons water",
        "16 potato buns, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Slow Cooked Barbecue Beer Beef",
    "url": "http://allrecipes.com/recipe/216703/slow-cooked-barbecue-beer-beef/"
}
