{
    "directions": [
        "In a large saucepan over high heat, boil the wine until reduced by half, about 15 minutes. Place the parsley sprigs, thyme sprigs and bay leaf against the cut side of the halved leek and tie with kitchen twine. Set aside.",
        "Preheat a Cuisinart multicooker on the brown/sauté setting to 350°F. Add the bacon and cook until crisp, about 10 minutes. Transfer to a paper towel-lined plate to drain. Discard all but 2 Tbs. of the fat from the insert. Season the chicken with salt and pepper. Increase the heat to 450°F. Working in batches, brown the chicken, turning once, 8 to 10 minutes per batch. Transfer to a plate.",
        "Discard all but 2 Tbs. of the fat from the insert. Add the mushrooms and cook, stirring occasionally, until they are beginning to brown, 6 to 8 minutes. Add the shallots and cook, stirring, for 2 minutes. Transfer to a bowl.",
        "Melt the butter in the insert. Add the garlic, tomato paste and flour and cook, stirring constantly, for 1 minute. Whisk in the reduced wine and the broth and bring to a simmer. Add the bacon, chicken, mushroom mixture, carrots and bouquet garni. Set the multicooker on the slow cook-high setting, cover and cook until the chicken is fork-tender, about 2 hours.",
        "Transfer the chicken to a plate. Skim the fat off the sauce. Set the multicooker on the brown/sauté setting to 400°F. Cook, stirring occasionally, until the sauce is thickened, 6 to 8 minutes. Discard the bouquet garni and adjust the seasonings with salt and pepper. Return the chicken to the insert. Garnish with the chopped parsley and serve immediately. Serves 4 to 6.",
        "Adapted from",
        "Canal House Cooking",
        ", Vol. 2, by Christopher Hirsheimer & Melissa Hamilton."
    ],
    "ingredients": [
        "1 bottle (750ml) Pinot Noir",
        "5 fresh flat-leaf parsley sprigs, plus 2 Tbs. finely chopped parsley",
        "3 fresh thyme sprigs",
        "1 bay leaf",
        "1/2 leek (cut lengthwise)",
        "6 oz. thick-cut bacon, cut into 1/2-inch dice",
        "3 1/4 lb. whole chicken legs",
        "Kosher salt and freshly ground pepper, to taste",
        "1 lb. small button mushrooms",
        "3/4 lb. shallots, halved",
        "1 Tbs. unsalted butter",
        "3 garlic cloves, minced",
        "2 Tbs. tomato paste",
        "2 Tbs. all-purpose flour",
        "1 3/4 cups chicken broth",
        "3/4 lb. carrots, peeled and cut into 2-inch pieces"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Slow-Cooker Coq au Vin",
    "url": "http://www.williams-sonoma.com/recipe/slow-cooker-coq-au-vin.html"
}
