{
    "directions": [
        "Wipe guajillo chiles clean with a damp cloth, then slice off stem ends and remove seeds. Preheat large skillet over medium heat, then toast chiles, turning frequently, until fragrant and beginning to darken, about 30 seconds. Transfer to bowl, cover with cold water, and soak 20 minutes.",
        "While guajillos are soaking, toast chiles de arbol in same skillet over medium heat until fragrant, about 30 seconds. Transfer to plate and cool.",
        "Drain guajillos and combine in blender with chiles de arbol, pineapple, garlic, cumin, cloves, canela, orange juice, and 1 cup water. Blend until very smooth.",
        "Heat olive oil in medium saucepan over medium heat and fry sauce, stirring occasionally with wooden spoon, 30 minutes. Mix in vinegar and sugar; season with salt. Strain sauce through fine sieve, discarding solids. Cool completely. (Sauce can be made ahead and stored, covered, in refrigerator. Before using, taste and add salt if needed.)",
        "Combine orange zest and canela in medium bowl. Rinse lamb shanks and pat dry. Sprinkle liberally with salt, then with orange-canela mixture. Set aside to rest for 15 minutes.",
        "Arrange steamer rack in very large stockpot and add water to just below bottom of rack. Cover and bring water to boil.",
        "Place 1 parchment sheet on work surface and place 1 pineapple slice in center. Put 1 lamb shank, bone pointing upward, on top of pineapple, and spoon a thick coating of guajillo-pineapple sauce over meat. Draw up sides of parchment and tie tightly around bone with kitchen twine. Assemble 5 more pouches in same manner and place in steamer. Steam until meat is very tender and falling off the bone, about 2 1/2 hours.",
        "To serve, place each pouch on a plate, untie, and discard twine. Spoon some roasted vegetables onto parchment next to meat, and place 2 coconut tamales alongside."
    ],
    "ingredients": [
        "14 dried guajillo chiles (about 3 oz)",
        "6 dried chiles de arbol",
        "1/2 pineapple, peeled, cored, and chopped (about 4 cups)",
        "10 cloves garlic, peeled",
        "1 teaspoon cumin seeds",
        "8 whole cloves",
        "2 tablespoons ground canela (see Tips, below)",
        "1 cup freshly squeezed orange juice",
        "6 tablespoons extra-virgin olive oil",
        "1 tablespoon apple cider vinegar",
        "2 tablespoons sugar",
        "Finely grated zest of 1 orange",
        "1 tablespoon ground canela (see Tips, below)",
        "Six large lamb shanks (about 1 1/4 pounds each), trimmed of excess fat",
        "Six 1/2-inch-thick fresh pineapple rings, cored",
        "6 large sheets parchment paper",
        "Kitchen twine",
        "Roasted Vegetables",
        "Coconut Tamales"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Lamb",
        "Pepper",
        "Vegetable",
        "Braise",
        "Passover",
        "Coconut",
        "Pineapple",
        "Spring",
        "Kosher"
    ],
    "title": "Slow-Braised Lamb Shanks with Guajillo-Pineapple Sauce, Roasted Vegetables, and Coconut Tamales",
    "url": "http://www.epicurious.com/recipes/food/views/slow-braised-lamb-shanks-with-guajillo-pineapple-sauce-roasted-vegetables-and-coconut-tamales-231938"
}
