{
    "directions": [
        "Spread peach slices between several layers of paper towels and let dry, gently pressing occasionally and replacing any soaked towels, 20 minutes.",
        "Meanwhile, pour melted butter over bottom of a 6-quart oval slow cooker. Stir together brown sugar, cinnamon, and nutmeg in a bowl and sprinkle over butter.",
        "Arrange peaches in a tight layer over brown sugar. (You may need to make a partial second layer to fit them all in.)",
        "Beat softened butter with white sugar in a large bowl with an electric mixer until light and fluffy, about 3 minutes. Beat in eggs, 1 at a time, beating well after each addition. Beat in almond extract.",
        "Whisk together flour, baking powder, and salt in a separate bowl. Working in batches, stir flour mixture into egg mixture alternately with milk, beginning and ending with flour mixture. Mix batter until well combined. Spoon over peaches and spread evenly.",
        "Drape paper towels over top of slow cooker (to absorb any condensation during baking), then cover with lid. Cook on High until a wooden skewer inserted into center of cake comes out clean, 2 to 2 1/2 hours.",
        "Remove lid and paper towels. Using oven mitts, remove ceramic liner from slow cooker and let cool 10 minutes. Run a knife around edge of cake and carefully turn out onto a serving platter."
    ],
    "ingredients": [
        "3 (15 ounce) cans sliced peaches in heavy syrup, drained well",
        "5 tablespoons butter, melted",
        "2/3 cup packed light brown sugar",
        "1 teaspoon cinnamon",
        "1/2 teaspoon nutmeg",
        "1 1/2 sticks butter, softened",
        "1 cup white sugar",
        "2 large eggs",
        "1/2 teaspoon pure almond extract",
        "2 cups flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 cup whole milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Slow Cooker Peach Upside Down Cake",
    "url": "http://allrecipes.com/recipe/256823/slow-cooker-peach-upside-down-cake/"
}
