{
    "directions": [
        "Peel pears, leaving stems intact, then core from bottom with melon-ball cutter. Toss pears with lemon juice in a bowl as peeled, then arrange on their sides in a 10-inch heavy skillet. Add wine, butter, and lemon juice from bowl (liquid will not cover pears) and bring to a boil. Reduce heat and simmer, covered, until pears are just tender, 10 to 20 minutes. Transfer pears with a slotted spoon to a dish. Boil poaching liquid, uncovered, until just syrupy and reduced to about 1/4 cup, 12 to 15 minutes. Spoon syrup over pears and cool to room temperature, stirring occasionally, about 10 minutes.",
        "Put oven rack in middle position and preheat oven to 400°F.",
        "Pulse almonds with 1/2 cup sugar in a food processor until finely ground, then transfer to a bowl (do not clean processor).",
        "Process butter with 1/2 cup sugar in processor until pale and creamy, then pulse in vanilla. Add eggs 1 at a time, blending well after each addition, then pulse in almond mixture, flour, and salt until just combined.",
        "Lightly butter and flour ramekins, knocking out excess flour, then arrange in a baking pan. Divide batter among ramekins (about a slightly rounded 1/2 cup per ramekin), then gently nestle a pear, leaning it slightly and pressing it very lightly, into batter in center of each cake. (Cakes will rise around pears as they bake.) Reserve reduced poaching liquid for another use. Sprinkle pears and tops of cakes with remaining tablespoon sugar.",
        "Bake, rotating pan halfway through baking, until cakes are just firm and pale golden with slightly darker edges, about 20 minutes.",
        "Transfer ramekins to a rack and cool 10 minutes, then run a thin knife around edge of each cake and invert onto a plate. Turn cakes right side up and serve warm or at room temperature."
    ],
    "ingredients": [
        "12 firm small Seckel pears (2 to 3 inches long)",
        "1 tablespoon fresh lemon juice",
        "2 cups Essencia or other Muscat wine",
        "1/2 tablespoon unsalted butter",
        "1 1/2 cups whole blanched almonds (1/2 lb)",
        "1 cup plus 1 tablespoon sugar",
        "2 sticks (1 cup) unsalted butter, softened, plus additional for greasing ramekins",
        "1 teaspoon pure vanilla extract",
        "4 large eggs",
        "2/3 cup all-purpose flour plus additional for dusting",
        "3/8 teaspoon salt",
        "Special equipment: a small melon-ball cutter; 12 (4-oz) ramekins or 2 muffin pans with 6 large (1-cup) muffin cups"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Pear",
        "Almond",
        "Fall",
        "Winter",
        "Party",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Small Pear and Almond Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/small-pear-and-almond-cakes-236427"
}
