{
    "directions": [
        "1. Fill a pot for the pasta with at least 6 quarts water, place over high heat, and bring to a boil.",
        "2. Peel and finely chop the onion. Put it in a 12-inch skillet with the olive oil. Place over medium-high heat and sauté, stirring occasionally, until the onion turns a rich golden color, about 5 minutes.",
        "3. While the onion is sautéing, peel the tomatoes and coarsely chop. When the onion is done, add the tomatoes, season with salt, and cook until the tomatoes are no longer watery, 10 to 15 minutes.",
        "4. Add about 2 tablespoons salt to the boiling water, put in the pasta, and stir well. Cook until al dente.",
        "5. While the tomatoes are cooking, remove the swordfish skin and cut the fish into 1/4-inch dice. Finely chop enough of the parsley leaves to measure 2 tablespoons. When the tomatoes are done, add the swordfish, season with salt and pepper, and cook briefly until the fish is cooked through, 2 to 3 minutes. Add the parsley, cook for another minute, and remove from the heat.",
        "6. When the pasta is done, drain it well, toss with the sauce, and serve at once."
    ],
    "ingredients": [
        "1/2 medium yellow onion",
        "1/4 cup extra virgin olive oil",
        "1 1/2 pounds ripe tomatoes",
        "Salt",
        "1 pound maccheroncini",
        "1 pound swordfish",
        "6 to 8 sprigs flat-leaf Italian parsley",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Pasta",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Swordfish",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Small Maccheroni with Swordfish",
    "url": "http://www.epicurious.com/recipes/food/views/small-maccheroni-with-swordfish-233214"
}
