{
    "directions": [
        "Place chiles in small bowl; cover with hot water. Let stand until softened, about 15 minutes. Drain; chop. Transfer to mini processor; process to coarse puree (or finely chop chiles). Measure 1/4 cup puree and set aside (reserve any remaining puree for another use). DO AHEAD: Can be made 3 days ahead. Cover and chill.",
        "Bring potatoes to boil in large saucepan. Reduce heat to medium and simmer until potatoes are tender, about 16 minutes. Drain. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Heat oil in same saucepan over medium-low heat. Add 1/4 cup chile puree and garlic; stir 30 seconds. Add potatoes; stir to coat. Using back of wooden spoon, smash potatoes until largest pieces are about 1-inch cubes. Stir to heat through. Stir in cheese, 1/2 cup parsley, and cilantro. Transfer to bowl, sprinkle with remaining 1 tablespoon parsley, and serve.",
        "*Available at many supermarkets and at specialty foods stores and Latin markets nationwide."
    ],
    "ingredients": [
        "2 dried ancho chiles,* stemmed, halved, seeded",
        "3 pounds baby red potatoes (about 1 1/2 inches in diameter)",
        "1/2 cup extra-virgin olive oil",
        "3 garlic cloves, chopped",
        "1 cup grated dry Jack cheese or 2/3 cup grated Parmesan cheese and 1/3 cup grated sharp white cheddar cheese",
        "1/2 cup plus 1 tablespoon chopped fresh Italian parsley",
        "1/4 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Potato",
        "Side",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Cheddar",
        "Parmesan",
        "Hot Pepper",
        "Cilantro",
        "Parsley",
        "Monterey Jack",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Smashed Baby Red Potatoes with Ancho Chiles and Dry Jack Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/smashed-baby-red-potatoes-with-ancho-chiles-and-dry-jack-cheese-240407"
}
