{
    "directions": [
        "Put aside one fourth of pineapple for another use. Cut enough of remainder into 1/4-inch dice to measure 1/2 cup and reserve the rest. Squeeze juice from reserved rind with your hands into a blender. Cut reserved pineapple into 1-inch chunks and purée with juice in blender at high speed until very smooth, about 1 minute.",
        "Pour purée into a dampened-cheesecloth-lined sieve set over a bowl. Drain until you have 1 cup juice, about 30 minutes.",
        "Boil juice in a small skillet over moderately high heat until reduced to about 1/4 cup, 10 to 14 minutes.",
        "Meanwhile, cook oil, rosemary sprig, and garlic in a small heavy saucepan over moderately low heat, stirring, until garlic is golden, 2 to 3 minutes. Discard rosemary and garlic and transfer 1 tablespoon oil to a 10-inch heavy skillet. Whisk remaining oil into reduced juice and stir in diced pineapple, lemon juice, and salt.",
        "Pat chops dry. Sprinkle with pepper.",
        "Heat oil in skillet over moderately high heat until hot but not smoking, then sauté chops, turning once, until browned and heated through, about 5 minutes. Transfer to a platter and keep warm.",
        "Discard fat from skillet, then add pineapple sauce and bring to a boil over moderate heat, scraping up any brown bits. Pour sauce over chops."
    ],
    "ingredients": [
        "1 pineapple (labeled \"extra sweet\"), peeled (reserving rind), quartered, and cored",
        "1/4 cup olive oil",
        "1 (4-inch) sprig fresh rosemary",
        "1 large garlic clove, smashed",
        "2 teaspoons fresh lemon juice",
        "1/8 teaspoon salt",
        "2 (6- to 8-oz) fully cooked smoked pork chops",
        "1 rounded 1/4 teaspoon black pepper",
        "Special equipment: cheesecloth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Sauté",
        "Pineapple",
        "Rosemary",
        "Pork Chop",
        "Summer",
        "Gourmet"
    ],
    "title": "Smoked Pork Chops with Pineapple-Rosemary Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-pork-chops-with-pineapple-rosemary-sauce-106525"
}
