{
    "directions": [
        "Boil vinegar and shallots in heavy medium saucepan until almost no liquid remains, about 6 minutes. Add clam juice and oil; simmer until reduced to 1 cup, about 10 minutes. Whisk yolks in medium bowl. Gradually whisk in simmering sauce. return sauce to pan; stir over medium-low heat until thermometer has registered 140°F for 3 minutes (do not boil). Strain into bowl. Mix in dill. (Can be made 8 hours ahead. Chill.)",
        "Preheat oven to 425°F. Line cooking rack with waxed paper. Butter 2 baking sheets. Place 1 phyllo sheet on work surface. Brush with melted butter. Top with second sheet. Brush with butter. Continue layering and buttering with remaining sheets. Cut phyllo into twelve 4 1/2 x 2-inch rectangles. Place on prepared sheets, spacing apart. Sprinkle with sesame seeds. Bake until phyllo is golden, watching closely to prevent burning, about 8 minutes. Using metal spatula, transfer phyllo to waxed paper-lined rack; cool.",
        "REwarm sauce over low heat, stirring constantly (so not boil). Place 4 phyllo rectangles on work surface. Cover each with salmon. Season with pepper. Sprinkle each with 1/2 teaspoon onion. Spoon 1 teaspoon sauce over. Top each with another phyllo rectangle, the salmon. Season with pepper. Sprinkle each with 1/2 teaspoon onion. Spoon 1 teaspoon sauce over. Top with remaining phyllo rectangles.",
        "Whisk oil and vinegar in large bowl. Add curly endive and toss to coat. season with salt and pepper. Divide salad among 4 plates. Top each with 1 napoleon. Serve, passing remaining sauce separately."
    ],
    "ingredients": [
        "1/2 cup white wine vinegar",
        "1/4 cup minced shallots",
        "1 cup bottled clam juice",
        "1/2 cup corn oil",
        "4 large egg yolks",
        "1/4 cup minced fresh dill",
        "6 fresh phyllo pastry sheets or frozen, thawed",
        "7 tablespoons butter, melted",
        "1 1/2 tablespoon sesame seeds",
        "8 ounces (about) thinly sliced smoked salmon",
        "4 teaspoons minced onion",
        "1/4 cup olive oil",
        "1 1/2 tablespoons white wine vinegar",
        "8 cups torn curly endive"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Herb",
        "Appetizer",
        "Bake",
        "Salmon",
        "Spring",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Smoked Salmon Napoleans with Greens",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-salmon-napoleans-with-greens-4452"
}
