{
    "directions": [
        "Preheat your grill to medium heat. Using a paper towel soaked with olive oil, coat the inside of a cast iron skillet. Heat it on the grill.",
        "Add prepped Brussels sprouts, sweet potatoes and red onion to a large mixing bowl. Pour 2 tbsp olive oil, garlic, mustard, smoked paprika, brown sugar, cayenne pepper, kosher salt & freshly ground black pepper over the vegetables. Toss in the bowl to coat evenly.",
        "Create a foil tray out of aluminum foil, about 12” x 5”. Spread vegetables in a single layer on tray. Cover the tray with another sheet of aluminum foil to form a pouch. Roast on the grill for 20-30 minutes, until vegetables are tender. Turn bag every 10 minutes.",
        "Once the skillet has reached temperature, place the al fresco Sweet & Smokey BBQ Chicken sausages into the skillet. Cook while constantly turning for 7 minutes, until the outside has begun to brown.",
        "Add in the roasted Brussels sprouts, roasted sweet potatoes, and red onions. Sprinkle the rosemary into the skillet and toss to distribute evenly.",
        "Cook in the skillet for another 5 minutes, until the veggies begin to brown. Remove from the grill and enjoy!"
    ],
    "ingredients": [
        "1 (12 ounce) package al fresco® Sweet & Smokey BBQ Chicken Sausage",
        "1 pound Brussels sprouts, cut in half",
        "2 large sweet potatoes, peeled, cut into 1-inch cubes",
        "1 large red onion, cut into quarters vertically",
        "1 tablespoon minced garlic",
        "1 teaspoon dry mustard powder",
        "1 teaspoon smoked paprika",
        "2 tablespoons brown sugar",
        "1/4 teaspoon cayenne pepper",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "Olive oil",
        "1 teaspoon chopped fresh rosemary"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Smoky Skillet with Brussels Sprouts & Sweet Potato",
    "url": "http://allrecipes.com/recipe/246621/smoky-skillet-with-brussels-sprouts/"
}
