{
    "directions": [
        "Melt butter in heavy medium skillet over high heat. Add sliced mushrooms and sauté until soft, about 8 minutes. Add white wine, season to taste with salt and pepper and simmer until liquid evaporates. Transfer mixture to medium bowl and cool. Mix in ricotta cheese, sliced sun-dried tomatoes, grated Parmesan cheese, minced onion, minced garlic and rosemary.",
        "Preheat oven to 375°F. Butter heavy large baking sheet. Place 1 phyllo sheet on work surface (cover remaining phyllo sheets with damp towel to prevent drying) and brush with butter. Cover with second sheet of phyllo and brush with butter. Place 1 turkey slice 3 inches in from short end of sheet. Spread generous 1/3 cup ricotta filling over turkey. Fold bottom of phyllo over turkey, then roll twice. Fold in long sides of phyllo. Continue to roll up pastry, enclosing filling completely. Brush packet with butter. Arrange seam side down on prepared baking sheet. Repeat with remaining phyllo, butter, turkey slices and ricotta filling, making 6 packets total. (Packets can be prepared 1 day ahead. Cover and refrigerate.) Bake turkey packets until golden and crisp, about 30 minutes."
    ],
    "ingredients": [
        "1 1/2 teaspoons butter",
        "8 ounces mushrooms, sliced",
        "3 tablespoons dry white wine",
        "3/4 cup whole milk ricotta",
        "1/2 cup thinly sliced drained oil-packed sun-dried tomatoes",
        "1/2 cup grated Parmesan cheese (about 1 1/2 ounces)",
        "1/2 cup minced red onion",
        "1 teaspoon minced garlic",
        "1 teaspoon dried rosemary, crumbled",
        "12 fresh phyllo pastry sheets or frozen, thawed",
        "3/4 cup (1 1/2 sticks) unsalted butter, melted",
        "6 1/4-inch-thick smoked turkey breast slices (about 3 ounces each)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Tomato",
        "turkey",
        "Bake",
        "Lunch",
        "Parmesan",
        "Ricotta",
        "New Mexico"
    ],
    "title": "Smoked Turkey in Fancy Coats",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-turkey-in-fancy-coats-2686"
}
