{
    "directions": [
        "Line a 6\"-diameter ring mold, 6\"-diameter cake pan or springform pan, or 16-oz. ramekin with plastic wrap, pressing it along the bottom and up the sides (you can also use a small bowl, but the layers won’t be quite as even). Pulse cream cheese, goat cheese, horseradish, and lemon zest in a food processor until well combined and creamy.",
        "Press a third of smoked salmon into an even layer across the bottom of mold. Spread half of cream cheese mixture evenly over salmon, smoothing surface with a rubber spatula.",
        "Toss radishes and onion in a small bowl to combine, then scatter over cream cheese mixture and press down lightly into mixture. Top with half of remaining salmon, making an even layer, then scatter capers over. Spread remaining cream cheese mixture over capers and finish with a final layer of the remaining salmon. Cover dip with plastic wrap and chill at least 1 hour to let dip set and flavors meld.",
        "Uncover dip and carefully invert onto a plate. Remove ring mold, then carefully peel away plastic. Top with chives. Serve with endives and bagel chips for spreading over."
    ],
    "ingredients": [
        "4 ounces cream cheese",
        "2 ounces fresh goat cheese",
        "3 tablespoons prepared beet horseradish",
        "2 teaspoons finely grated lemon zest",
        "1 pound hot-smoked salmon, skin removed, flaked, divided",
        "2 large radishes, trimmed, finely chopped",
        "1/3 cup finely chopped red onion",
        "1/2 cup drained capers, chopped",
        "3 tablespoons finely chopped chives",
        "2 Belgian endives, leaves separated",
        "Bagel chips or pumpernickel bread (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Dip",
        "Salmon",
        "Fish",
        "Christmas",
        "Hanukkah",
        "Cream Cheese",
        "Goat Cheese",
        "Capers"
    ],
    "title": "Smoked Salmon 7-Layer Dip",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-salmon-7-layer-dip"
}
