{
    "directions": [
        "To make the pita chips, preheat an oven to 400°F. Line a rimmed baking sheet with aluminum foil.",
        "In a small heavy frying pan over medium heat, toast the cumin until fragrant, about 2 minutes. Pour onto a plate to cool, then crush in a spice mill or with a mortar and pestle along with the salt, until the mixture is finely ground.",
        "Brush the pita breads on both sides with the oil, cut them into 8 wedges each and arrange the wedges on the prepared baking sheet. Sprinkle the tops evenly with the salt and cumin mixture. Bake until the wedges are light golden brown and crisp, 10 to 15 minutes, turning them over halfway through baking. Serve the pita chips warm or at room temperature.",
        "To make the dip, place an oven rack 4 to 5 inches below the heating element and preheat the broiler. Line a broiler pan with aluminum foil and lightly grease the foil with oil.",
        "Cut the eggplants in half lengthwise and place, cut side down, on the prepared pan. Broil until the skins char and the eggplant flesh is tender, about 20 minutes. Transfer the eggplant to a colander and set it in the sink to drain and cool slightly.",
        "Turn the oven temperature to 400°F. Trim off the stem ends of the garlic. Place the cloves on a small square of aluminum foil, drizzle with 1 tsp. olive oil and wrap the cloves securely in the foil. Bake until the garlic is soft when tested with a small knife, about 15 minutes. Unwrap the garlic and let stand until cool enough to handle. Leave the oven on.",
        "Using a spoon, scrape the eggplant flesh out of the skins into a blender. Squeeze the garlic from its peels and add to the blender along with the lemon juice, tahini and salt. Blend the ingredients until smooth, then season to taste with salt. Transfer the dip to a serving bowl and let stand for a few minutes to blend the flavors.",
        "To serve, garnish the dip with the smoked paprika and place on a platter. Arrange the pita chips alongside and serve immediately. Serves 8.",
        "Adapted from Williams-Sonoma",
        "New Flavors for Appetizers",
        ", by Amy Sherman (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "1 tsp. cumin seeds",
        "3/4 tsp. kosher salt",
        "3 pita breads, 7 inches in diameter",
        "1 1/2 Tbs. olive oil",
        "",
        "Extra-virgin olive oil, as needed",
        "2 globe eggplants, about 2 lb. total",
        "6 garlic cloves, unpeeled",
        "2 Tbs. fresh lemon juice",
        "1/4 cup tahini",
        "Scant 1/4 tsp. sea salt, plus more, to taste",
        "1/4 tsp. smoked sweet or hot paprika"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Smoky Eggplant Dip with Cumin-Crusted Pita Chips",
    "url": "http://www.williams-sonoma.com/recipe/smoky-eggplant-dip-with-cumin-crusted-pita-chips.html"
}
