{
    "directions": [
        "Toast the chipotle in a small skillet over medium heat. Remove the stem and seeds.",
        "Combine the vinegar and toasted chipotle in a small bowl. Set aside to soften.",
        "In a medium pot, cook the bacon in the olive oil over medium-low heat until beginning to crisp. Turn the heat up to medium, add the poblano, onion, carrot, garlic, and Scotch bonnet, and season with salt and pepper. Cook until the vegetables begin to soften, about 4 minutes.",
        "Add the annatto seeds and stir. Then add the chipotle-vinegar mixture, the bay leaf, cumin, and 1 teaspoon pepper, and simmer until almost all of the liquid has evaporated, 2 to 3 minutes. Add the orange juice and simmer until only a small amount of liquid remains, 4 to 6 minutes.",
        "Add the chicken stock and reduce almost to a glaze, about 7 minutes (you'll know it is done when the bubbles start getting bigger). Add the heavy cream and vanilla bean, stir, and simmer for 8 to 10 minutes, until the cream in quite thick. Pass the mixture through a fine-mesh strainer; discard the solids. Reserve.",
        "In a sauté pan, heat the canola oil. Add the plantain, season with salt and pepper, and cook over medium heat, turning occasionally, until dark golden brown on all sides. Transfer to a paper towel to drain.",
        "In a blender, puree the plantain with the strained liquid. If any lumps of plantain remain, strain one more time. Refrigerate until needed; this will keep for 4 or 5 days."
    ],
    "ingredients": [
        "1 chipotle chile",
        "1 tablespoon Chipotle Vinegar or Spanish sherry vinegar",
        "2 1/2 ounces smoky bacon, diced",
        "1 tablespoon olive oil",
        "1 poblano pepper, stemmed, seeded, and minced",
        "1/2 large red onion, diced",
        "1 carrot, peeled and diced",
        "2 cloves garlic, sliced",
        "1 Scotch bonnet chile, stemmed, seeded, and minced",
        "Kosher salt and freshly ground black pepper",
        "1 teaspoon annatto seeds",
        "1 bay leaf, broken in half",
        "1 teaspoon toasted and ground cumin seeds",
        "1/2 cup fresh orange juice",
        "1/2 cup Chicken Stock",
        "2 cups heavy cream",
        "1 vanilla bean, split lengthwise",
        "1 tablespoon canola oil",
        "1/2 very ripe plantain (the skin should be almost black)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Sauce",
        "Milk/Cream",
        "Orange",
        "Bacon",
        "Vanilla",
        "Hot Pepper",
        "Plantain",
        "Simmer"
    ],
    "title": "Smoky Plantain Crema",
    "url": "http://www.epicurious.com/recipes/food/views/smoky-plantain-crema-108216"
}
