{
    "directions": [
        "Place the bacon into a large pot set over medium heat. Cook for a few minutes to release some of the drippings, then add the onions and celery. Cook and stir until bacon is crisp and onions and celery are tender.",
        "Put in the carrots, green onions, and parsley and then pour in the water and fish stock. Season the soup with salt, pepper and dill. Cover and simmer over low heat until carrots are tender, about 15 minutes. Add the potatoes and simmer for another 20 minutes, or until tender.",
        "Meanwhile, melt the butter in a small skillet over medium heat. Stir in the flour until smooth. Continue to cook and stir until the mixture is light brown. Pour in a little bit of the milk to thin the roux, then pour it into the pot with the vegetables. Pour the rest of the milk into the pot and heat through, stirring constantly.",
        "When the soup has thickened slightly, stir in the white wine if using. Mix in the lemon juice, smoked salmon and corn. Cook over medium heat until hot but not boiling. Ladle into soup bowls to serve."
    ],
    "ingredients": [
        "10 slices bacon, chopped",
        "2 large onions, finely chopped",
        "4 stalks celery, finely chopped",
        "3 carrots, finely chopped",
        "5 green onions, finely chopped",
        "1/3 cup chopped fresh parsley",
        "1/2 cup water",
        "6 cups fish stock",
        "salt to taste",
        "1 1/2 tablespoons ground black pepper",
        "1 1/2 tablespoons dried dill weed",
        "8 red potatoes, cubed",
        "1 cup butter",
        "1 cup all-purpose flour",
        "5 cups milk",
        "3/4 cup white wine (optional)",
        "1/4 cup lemon juice",
        "1 1/2 pounds flaked or chopped smoked salmon",
        "1 1/2 cups frozen corn kernels"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Smoked Salmon Chowder",
    "url": "http://allrecipes.com/recipe/151944/smoked-salmon-chowder/"
}
