{
    "directions": [
        "Mix first 6 ingredients in small bowl. Rub spice mixture all over both sides of steak. Chill overnight.",
        "Prepare barbecue (medium-high heat). Place drained wood chips in aluminum foil pan; place pan directly atop coals on barbecue. When chips begin to smoke, sprinkle steak with salt and pepper. Grill steak about 6 minutes per side for rare. Cool slightly. Trim and discard any fat from steak, then finely chop steak.",
        "Heat oil in large nonstick skillet over medium-high heat. Add onion and bell pepper; sauté until tender, about 8 minutes. Add chopped steak and tomato paste; sauté 3 minutes. Stir in parsley. Season with salt and pepper. (Can be made 1 day ahead. Cover; chill. Bring to room temperature before using.)",
        "Blend flour, paprika, and salt in processor. Add lard by tablespoonfuls to processor. Using on/off turns, cut in until coarse meal forms. Add 1/2 cup water; process until moist clumps form, adding more water by teaspoonfuls if dough is dry. Gather dough into ball. Divide dough in half; flatten each half into disk. Wrap each disk in plastic; let stand at room temperature 30 minutes.",
        "Oil 2 large baking sheets. Roll out 1 dough disk on lightly floured surface to generous 1/8-inch thickness. Using 4-inch-diameter plate or bowl as guide, cut out rounds. Place 1 rounded tablespoon steak filling in center of each dough round. Top filling on each with scant 1 teaspoon goat cheese. Brush dough edges with egg glaze. Fold dough over filling, enclosing filling. Using fork, seal crust edges. Transfer empanadas to prepared sheets. Repeat with second dough disk, remaining filling, and cheese. Gather and reroll dough scraps and cut out additional rounds until all dough is used. (Can be made 1 day ahead. Cover empanadas and remaining egg glaze separately and chill.)",
        "Preheat oven to 375°F. Brush empanadas with remaining egg glaze. Bake empanadas until crust is golden, about 28 minutes. Transfer to plates."
    ],
    "ingredients": [
        "1 teaspoon paprika",
        "1 teaspoon garlic powder",
        "1 teaspoon sugar",
        "1 teaspoon dried oregano",
        "1 teaspoon dried ancho chile powder",
        "1 teaspoon dried chipotle chile powder",
        "1 16-ounce rib-eye steak (about 1 1/4 inches thick)",
        "2 cups hickory or mesquite wood chips, soaked in water 1 hour, drained",
        "1 9-inch-diameter disposable aluminum foil pan",
        "3 tablespoons olive oil",
        "1 medium white onion, chopped",
        "1 large green bell pepper, chopped",
        "3 tablespoons tomato paste",
        "2 tablespoons chopped fresh parsley",
        "4 cups all purpose flour",
        "2 teaspoons paprika",
        "1 teaspoon salt",
        "1 cup lard, room temperature",
        "1/2 cup (or more) room-temperature water",
        "1 4- to 5-ounce log soft fresh goat cheese",
        "2 eggs, beaten to blend (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Appetizer",
        "Bake",
        "Goat Cheese",
        "Spice",
        "Bell Pepper",
        "Parsley",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Smoked Rib-Eye and Goat Cheese Empañadas",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-rib-eye-and-goat-cheese-empanadas-108546"
}
