{
    "directions": [
        "Heat 1 tablespoon oil in a large skillet over medium-high heat. Cook and stir onions until they soften and begin to brown at the edges, 8 to 10 minutes. Add the garlic and cook for one minute. Transfer mixture to a slow cooker. Cover and set cooker to Low.",
        "Mix together paprika, salt, and pepper in a large bowl. Toss the meat cubes in the paprika mixture until evenly coated.",
        "Heat one tablespoon of the oil in the skillet over medium-high heat. Put a third of the beef cubes into the skillet and cook until nicely browned on all sides. Transfer to the slow cooker. Pour 2 tablespoons of water into the skillet and scrape the browned bits from the pan; pour liquid into the slow cooker. This prevents the paprika from burning when you brown the next batches of beef. Add another tablespoon of oil to the skillet and cook the next batch the same way; repeat for the third batch.",
        "Stir the tomato paste and the rest of the water into the slow cooker; cover. Cook on High for 4 to 5 hours (or on Low for 6 to 9 hours).",
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the egg noodles, and cook  uncovered, stirring occasionally, until the noodles have cooked through, but are still firm to the bite, about 5 minutes. Drain.",
        "Serve goulash over noodles with a dollop of sour cream and a sprig of parsley."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "3 onions, sliced",
        "3 cloves garlic, chopped",
        "1/4 cup smoked Spanish paprika",
        "2 teaspoons kosher salt",
        "1 teaspoon coarsely ground black pepper",
        "3 pounds lean beef stew meat, cut into 1-inch cubes",
        "3 tablespoons vegetable oil, divided",
        "1 1/2 cups water",
        "1 (6 ounce) can tomato paste",
        "1 (10 ounce) package egg noodles",
        "1/2 cup sour cream (optional)",
        "8 sprigs fresh parsley (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Smoked Paprika Goulash for the Slow Cooker",
    "url": "http://allrecipes.com/recipe/182157/smoked-paprika-goulash-for-the-slow-c/"
}
