{
    "directions": [
        "If the smoked pork butt is encased in netting let it soak in warm water to cover for 5 minutes and cut away the netting, being careful not to cut the meat. Tie the pork butt at 1-inch intervals with kitchen string, set it on a rack in a roasting pan, and roast it in a preheated moderately slow oven (325°F) for 1 hour and 30 minutes. Transfer the pork to a platter, let it cool completely, and discard the strings.",
        "In a large saucepan of boiling salted water cook the mustard greens and the cabbage for 10 minutes, drain the mixture in a colander, and refresh it under running cold water. Squeeze the mixture dry in a dish towel.",
        "In a stainless steel or enameled saucepan steam the spinach in the water clinging to the leaves, covered over moderately high heat for 3 minutes, or until it is wilted, drain it in a colander, and refresh it under cold water. Squeeze the spinach dry in a dish towel and chop it.",
        "In a stainless steel or enameled skillet cook the salt pork over moderate heat, stirring, until it is golden, add the onion, the celery, and the red pepper flakes, and cook the mixture over moderately low heat, stirring, until the vegetables are soft. Add the scallions and cook the mixture, stirring, for 2 minutes, or until the scallions are softened. Add the mustard greens, the cabbage, and the spinach and cook the mixture over moderate heat, stirring, for 2 minutes, or until any excess liquid is evaporated.",
        "In a food processor fitted with the steel blade purée the mixture coarse with the mustard and transfer the puree to a bowl. Add the egg yolk, the breadcrumbs , and salt and pepper to taste, combine the filling well, and let it cool to room temperature.",
        "In a small bowl proof the yeast with a pinch of the sugar in 1/3 cup lukewarm water for 15 minutes, or until it is foamy.",
        "In a food processor fitted with the steel blade or in a bowl with an electric mixer blend the flour, the salt, and the remaining sugar, with the motor running add the eggs and the shortening, and beat mixture for 1 minute.",
        "Add the yeast mixture and knead the dough in the food processor for 2 minutes or beat the dough with the electric mixer for 2 minutes. (If using the electric mixer turn the dough out onto a floured surface and knead it for 5 minutes.) Transfer the dough to a lightly oiled bowl and turn it to coat it with the oil. Let the dough rise, covered with plastic wrap, in a warm place for 2 hours, or until it is double in bulk, and punch it down.",
        "Roll out the dough 1/8 inch thick on a very lightly oiled surface, cut it into a 15- by 13-inch rectangle, reserving the scraps, and brush it with some of the egg wash.",
        "Spread the filling over the dough, leaving a 2 1/2-inch border all around, and arrange the pork roast lengthwise on it. Wrap the dough around the pork to enclose it, pinching the edges together to seal them, turn the package seam side down, tucking the ends under firmly, and transfer it to a lightly oiled baking sheet.",
        "Brush the package with some of the remaining egg wash, roll the reserved scraps into 3 thin ropes, and arrange them decoratively on the top, pressing them gently onto the dough. Brush the package with some of the remaining egg wash and bake it in the middle of a preheated hot oven (400°F) for 15 minutes. Reduce the heat to moderately hot (375°F), cover the top of the package loosely with foil, and bake the package for 25 minutes more. Transfer the smoked pork in pastry with metal spatulas to a heated platter and let it stand for 10 minutes before slicing."
    ],
    "ingredients": [
        "1 3–4 pound smoked pork butt",
        "1/4 pound mustard greens, turnip greens, or collards, washed well, stems discarded, and chopped",
        "1/4 pound cabbage, cored and chopped",
        "1/4 pound spinach, washed well and stems discarded",
        "2 ounces salt pork, rind discarded and the pork cut into a 1/4-inch dice",
        "1/4 cup minced onion",
        "1/4 cup minced celery",
        "1/4 teaspoon red pepper flakes",
        "1/2 cup thinly sliced scallions",
        "1/4 teaspoon dry mustard",
        "1 large egg yolk",
        "2 tablespoons stale bread crumbs",
        "Kosher salt, freshly ground pepper",
        "2 1/2  teaspoons active dry yeast",
        "2  tablespoons sugar",
        "3 1/2 cups all-purpose flour",
        "1  teaspoon salt",
        "2 large eggs, beaten lightly",
        "1/2  cup vegetable shortening, melted and cooled",
        "1 egg wash, made by beating 1 large egg with a pinch of salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Gourmet",
        "Pork",
        "Mustard",
        "Egg",
        "Spinach"
    ],
    "title": "Smoked Pork in Pastry",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-pork-in-pastry"
}
