{
    "directions": [
        "Spread corn tortilla strips in single layer on paper towel. Let tortilla strips stand at room temperature overnight to dry.",
        "Heat olive oil in heavy large pot over medium heat. Add chopped onion, chopped carrot, chopped celery, minced garlic and dried oregano. Sauté until vegetables are crisp-tender, about 10 minutes. Add chicken broth, golden hominy, crushed tomatoes and chipotle chilies; bring to simmer. Reduce heat, cover and simmer 30 minutes. Season to taste with salt and pepper. (Soup can be prepared 3 days ahead. Cool slightly. Refrigerate soup uncovered until cold, then cover soup and refrigerate.)",
        "Bring soup to simmer over medium heat. Add shrimp and cook until opaque in center, stirring occasionally, about 3 minutes. Stir in chopped fresh cilantro. Divide soup among 10 soup bowls. Top soup with dried tortilla strips, dividing equally. Serve soup, passing lime wedges separately.",
        "*Chipotle chilies canned in a spicy tomato sauce, sometimes called adobo, are available at Latin American markets, specialty foods stores and some supermarkets"
    ],
    "ingredients": [
        "4 5-inch-diameter corn tortillas, halved, cut into thin strips",
        "2 tablespoons olive oil",
        "1 cup finely chopped onion",
        "1 cup finely chopped carrot",
        "1/2 cup finely chopped celery",
        "6 garlic cloves, minced",
        "1/2 teaspoon dried oregano",
        "7 cups canned low-salt chicken broth",
        "2 15-ounce cans golden hominy, drained",
        "1/3 cup canned crushed tomatoes with added purée",
        "2 teaspoons chopped canned chipotle chilies*",
        "1 pound uncooked small shrimp, peeled, deveined",
        "1/2 cup chopped fresh cilantro",
        "Lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Tomato",
        "Appetizer",
        "Sauté",
        "Shrimp",
        "Hot Pepper",
        "Healthy",
        "Cilantro",
        "Tortillas",
        "Hominy/Cornmeal/Masa",
        "Simmer",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Smoky Shrimp, Hominy and Tortilla Soup",
    "url": "http://www.epicurious.com/recipes/food/views/smoky-shrimp-hominy-and-tortilla-soup-104307"
}
