{
    "directions": [
        "In a small saucepan sprinkle gelatin over lemon juice and soften 10 minutes. In a bowl with an electric mixer beat together mascarpone and 1/2 cup sour cream until combined well. Quarter eggs and with back of a spoon force through a coarse sieve into mascarpone mixture. Add horseradish and stir well.",
        "Add remaining 1/4 cup sour cream to gelatin mixture and heat over moderately low heat, stirring, just until gelatin is dissolved. Add gelatin mixture to mascarpone mixture and stir well.",
        "Cut about one third salmon into strips and arrange 1 in every other ridge of a 3-cup brioche or other mold, letting ends hang over edge. Chop remaining salmon into 1/2-inch pieces and fold with chives into mascarpone mixture. Spoon mousse into mold and fold ends of salmon strips over top. Chill mousse, covered, at least 2 hours, or until firm, and up to 2 days. Run a thin knife along inside of each ridge of mold and dip mold into a bowl of hot water a few seconds. Invert a plate over mold and invert mousse onto it.",
        "With a slotted spoon arrange pickled onions decoratively on and around mousse touching each other, and keeping covered with plastic wrap.",
        "Brush mushroom rolls all over with melted butter and rearrange, seam sides down and barely touching, in pan. Chill mushroom rolls, covered, at least 1 hour and up to 1 day.",
        "Preheat oven to 425°F.",
        "Bake mushroom rolls in upper third of oven 15 minutes, or until golden. Halve rolls crosswise and tie a chive around each half.",
        "In a saucepan barely cover onions with cold water. Bring water to a boil and simmer 1 minute. Drain onions in a colander and return to pan with vinegar, salt, and cold water to just cover. Bring liquid to a boil and simmer 3 minutes. Remove pan from heat and cool onions in liquid. Pickled onions may be made 1 week ahead and chilled in liquid, covered. Makes about 2 cups."
    ],
    "ingredients": [
        "1 teaspoon unflavored gelatin",
        "2 tablespoons fresh lemon juice",
        "1 1/2 cups mascarpone cheese* (about 3/4 pound)",
        "3/4 cup sour cream",
        "2 hard-cooked large eggs",
        "1 tablespoon drained bottled horseradish, or to taste",
        "3/4 pound sliced smoked salmon*",
        "1/2 cup chopped fresh chives",
        "about 2 cups pink pickled onions (recipe follows)",
        "2 medium red onions, chopped",
        "1/2 cup cider vinegar",
        "1 1/2 teaspoons salt",
        "Garnish: chive blossoms",
        "Accompaniment: Melba toasts and/or sesame flatbread",
        "*available at specialty foods shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fish",
        "Cocktail Party",
        "Fall",
        "Gourmet"
    ],
    "title": "Smoked Salmon and Chive Mascarpone Mousse with Pink Pickled Onions",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-salmon-and-chive-mascarpone-mousse-with-pink-pickled-onions-13083"
}
