{
    "directions": [
        "Mix together all the spices in a bowl. Liberally rub the entire brisket with the spices, wrap tightly in plastic wrap and refrigerate for at least 4 hours and up to 24 hours. Remove the brisket from the refrigerator 1 hour before beginning the smoking process to take the chill off, and remove the plastic wrap.",
        "Get your smoker running at 225 degrees F with hardwood charcoal and a few handfuls of soaked wood chips. This temperature should be maintained throughout the entire smoke. (If you are using a grill: Set up the grill for indirect heat, banking the coals on one side of the grill and scattering the wood chips on top. Maintain the temperature at 225 degrees throughout the smoking process, adding chips as necessary, until you wrap the brisket in foil.)",
        "Place the brisket fat-side up on your smoker grate and close it up for the long smoke.",
        "Open your barbecue smoker every hour or 2 and spray the brisket liberally with apple juice to help keep the meat from drying out. Also keep apple juice in the water pan if you are using a water smoker.",
        "When the internal temperature reaches 165 to 170 degrees, after about 4 hours, wrap the brisket in aluminum foil and continue to cook for another 3 1/2 to 4 1/2 hours. This little trick is a big help in getting the meat tender, especially for beginners. Figure that a brisket smoked at around 200 degrees will take about 1 1/2 hours per pound. The brisket is done when the internal temperature reaches 185 degrees F. Remove and let rest 20 minutes before slicing. Remove the foil from the brisket over a large pan or disposable pan and reserve the liquid. Cut off the brisket points and reserve for another use (such as Honey-Rum Pinto Beans with Burnt Ends). After the points are removed, look to see which way the grain runs and slice thinly across the grain. Smear some barbecue sauce on Grilled Texas Toast, top with brisket and Pickled Red Onions.",
        "Preheat the grill to medium-high. Heat the oil in a small saute pan and cook the garlic for 1 minute. Let cool slightly. Stir in the butter and season with salt and pepper. Grill the bread until lightly golden brown on both sides. Remove from the grill and spread 1 side of each slice with some of the garlic butter.",
        "Bring the vinegar, sugar, mustard seeds and 1 tablespoon salt to a boil in a small saucepan and cook until the sugar and salt dissolves, about 1 minute. Transfer to a small bowl and let cool for 10 minutes. Add the onions and stir to combine. Cover and refrigerate for at least 1 hour and up to 24 hours."
    ],
    "ingredients": [
        "3 tablespoons ancho chile powder",
        "2 tablespoons kosher salt",
        "1 tablespoon allspice, ground",
        "1 tablespoon celery seeds",
        "1 tablespoon coriander seeds, ground",
        "1 tablespoon garlic powder",
        "1 tablespoon mustard seeds, ground",
        "1 tablespoon dried oregano",
        "1 tablespoon smoked Spanish paprika",
        "1 tablespoon freshly ground black pepper",
        "One 8- to 10-pound brisket, untrimmed",
        "2 cups apple juice (in a spray bottle)",
        "Bobby Flay BBQ Sauce or your favorite BBQ sauce, heated",
        "Texas Toast, recipe follows",
        "Pickled Red Onions, recipe follows",
        "2 teaspoons canola oil",
        "4 cloves garlic, smashed and chopped to a paste",
        "2 sticks unsalted butter, softened",
        "Kosher salt and freshly ground black pepper",
        "2 loaves good quality Pullman or pain de mie, sliced into 2-inch thick slices",
        "2 tablespoons finely chopped flat-leaf parsley",
        "1 1/2 cups red wine vinegar",
        "2 tablespoons sugar",
        "1 teaspoon mustard seeds",
        "Kosher salt",
        "1 small red onion, halved and thinly sliced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Onion Recipes",
        "Vegetable",
        "Main Dish Recipes",
        "Grilling"
    ],
    "title": "Smoked, Spice Rubbed, Texas-Style Brisket on Texas Toast",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/smoked-spice-rubbed-texas-style-brisket-on-texas-toast-recipe"
}
