{
    "directions": [
        "Put oven rack in middle position and preheat oven to 500°F.",
        "Stir together pimentón, cumin, coriander, salt, and pepper. Rub mixture all over pork. (Press lightly so rub adheres; you will have some leftover rub.) Put pork on a metal rack in a roasting pan, rib side down. Roast pork 10 minutes, then reduce heat to 300°F and continue to roast until a meat thermometer inserted diagonally into center registers 140°F, 1 hour 10 minutes to 1 hour 25 minutes more.",
        "Let pork stand, loosely covered with foil, 20 to 25 minutes before carving. (Temperature of meat will rise to about 150°F.)",
        "Soak raisins in Sherry in a medium bowl, covered, 30 minutes. Add vinegar, shallot, garlic, salt, and pepper, then add oil in a slow stream, whisking until combined. Whisk in parsley just before serving.",
        "Slice pork and serve with vinaigrette and a sprinkling of kosher salt."
    ],
    "ingredients": [
        "1/4 cup (1 oz) bittersweet (agridulce) pimentón de la Vera (smoked Spanish paprika; available at La Tienda; tienda.com)",
        "1 tablespoon ground cumin",
        "1 tablespoon ground coriander",
        "1 tablespoon kosher salt plus additional for sprinkling",
        "1 tablespoon coarsely cracked black pepper",
        "1 (5- to 6-lb) center-cut bone-in pork loin rib roast",
        "1/4 cup golden raisins",
        "1/4 cup dry Sherry",
        "1/3 cup red-wine vinegar",
        "2 tablespoons finely chopped shallot",
        "1 tablespoon minced garlic",
        "1 teaspoon table salt, or to taste",
        "1/2 teaspoon black pepper, or to taste",
        "1/2 cup extra-virgin olive oil (preferably Spanish)",
        "3 tablespoons finely chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Quick & Easy",
        "Dinner",
        "Vinegar",
        "Raisin",
        "Pork Rib",
        "Sherry",
        "Winter",
        "Gourmet"
    ],
    "title": "Smoked-Paprika Pork Rib Roast with Sherry Raisin Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-paprika-pork-rib-roast-with-sherry-raisin-vinaigrette-233307"
}
