{
    "directions": [
        "If the smoked cod has a strong smoky flavor, soak it in water for 30 minutes, drain, and rinse.",
        "In a large saucepan, cover the cod and smoked cod with water, and add the juice of half a lemon and the thyme.  Bring the cooking liquid to a gentle simmer.  Poach the fish for 8 to 10 minutes, or until the fish is just cooked and tender.  Remove the fish to a bowl, and reserve the poaching liquid.  When the fish has cooled enough to handle, break it into large bite-sized pieces.  Set aside.",
        "While the cod is cooking, peel the parsnips, and cut them into 1/4-inch-thick slices.  Peel the potatoes, cut them into 1/2 inch dice, and place them in a bowl of water to prevent discoloring.",
        "In a large saucepan or kettle, melt 2 tablespoons of butter or margarine over medium heat.  Add onion, and cook until wilted and golden.  Add the parsnips, potatoes, and 3 cups of the reserved poaching liquid.  Bring the mixture to a boil, reduce heat, and cover.  Simmer for 15 minutes, or until the vegetables are tender.",
        "Heat the milk and cream in a small saucepan.  Do not boil.  Stir to the vegetable mixture.",
        "Add cod and smoked cod; stir.  Season with salt and freshly ground pepper to taste.  Just before serving, stir in remaining tablespoon of butter.  Top each serving with freshly ground pepper and chives."
    ],
    "ingredients": [
        "1 pound cod fillets",
        "1/2 pound lightly smoked cod, skin and bones removed",
        "1/2 lemon",
        "1 sprig fresh thyme",
        "1 pound parsnip, chopped",
        "1/2 pound potatoes",
        "3 tablespoons butter",
        "1 onion, chopped",
        "1 cup milk",
        "1 cup heavy whipping cream",
        "salt to taste",
        "ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Smoky Cod and Parsnip Chowder",
    "url": "http://allrecipes.com/recipe/13304/smoky-cod-and-parsnip-chowder/"
}
