{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x12-inch baking dish.",
        "Bring a large pot of lightly salted water to a boil; add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain and return pasta to pot.",
        "Melt 2 tablespoons oil and butter together in a saucepan over medium heat. Whisk flour into hot oil-butter mixture until mixture has a paste-like consistency. Cook, whisking constantly, until flour mixture is light golden, about 5 minutes.",
        "Pour milk into flour mixture, 1 cup at a time, whisking thoroughly until mixture is smooth between additions. Cook, stirring constantly, until mixture thickens and coats the back of a spoon, about 15 minutes. Reduce heat to low.",
        "Mix Gouda cheese and Gruyere cheese into milk mixture until completely melted; add Pecorino Romano cheese and stir until melted. Stir 1 tablespoon pepper into cheese mixture. Remove from heat.",
        "Heat remaining oil in a large skillet over medium-high heat. Saute garlic, pinch of salt, and a pinch of pepper in hot oil until fragrant, about 30 seconds. Add kale; saute until tender, about 15 minutes.",
        "Stir cheese sauce, kale, and turkey ham into penne; mix thoroughly. Pour into the prepared baking dish.",
        "Bake in the preheated oven until sauce is bubbling, 20 to 25 minutes."
    ],
    "ingredients": [
        "1 pound penne pasta",
        "1/4 cup canola oil, divided",
        "2 tablespoons unsalted butter",
        "3 tablespoons all-purpose flour",
        "3 cups whole milk",
        "4 ounces shredded smoked Gouda cheese",
        "4 ounces shredded Gruyere cheese",
        "1 cup finely grated Pecorino Romano cheese",
        "1 tablespoon freshly ground black pepper",
        "1 clove garlic, crushed, or more to taste",
        "salt and ground black pepper to taste",
        "8 ounces kale, stemmed and coarsely chopped",
        "8 ounces turkey ham, diced, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Smoky Penne and Cheese with Ham and Kale",
    "url": "http://allrecipes.com/recipe/237776/smoky-penne-and-cheese-with-ham-and-k/"
}
