{
    "directions": [
        "Preheat oven to 400°F. Wrap beets individually in foil, place on a rimmed baking sheet, and roast until tender, 50-60 minutes. Let cool. Peel and cut into 1/4\" cubes.",
        "Whisk lemon juice, horseradish, and vinegar in a medium bowl; gradually add oil, whisking to blend well. Season with salt. DO AHEAD: Beets and vinaigrette can be made 1 day ahead. Cover separately and chill.",
        "Heat oven to 400°F. Place cod on a rimmed baking sheet. Rub with 1 tablespoon oil. Roast until just opaque in center, 10-15 minutes. Let fish cool, then flake with a fork.",
        "Mix cod, whitefish, eggs, shallot, matzo, chives, 2 tablespoons dill, and 2 tablespoons water in a medium bowl. Season with pepper and mix vigorously to combine (mixture will be stiff). DO AHEAD: Fritter mixture can be made 1 day ahead; cover and chill.",
        "Reduce oven temperature to 200°F; set a wire rack inside a large rimmed baking sheet. Heat remaining 4 tablespoons oil in a large skillet over medium-high heat. Working in batches, drop scant 1/4-cupfuls of fritter mixture into skillet; press gently with a spatula to flatten. Cook, turning once and adding more oil if needed, until golden brown and crispy around edges, about 4 minutes per batch. Transfer to prepared rack. Keep warm in oven while cooking remaining fritters.",
        "Mix beets into vinaigrette. Serve fritters with vinaigrette; top with dill."
    ],
    "ingredients": [
        "2 medium red beets (about 8 ounces total)",
        "1/4 cup fresh lemon juice",
        "2 tablespoons prepared horseradish",
        "1 tablespoon Sherry vinegar",
        "1/2 cup extra-virgin olive oil",
        "Kosher salt",
        "1 12-ounce skinless cod or pike fillet",
        "5 tablespoons (or more) vegetable oil, divided",
        "8 ounces smoked whitefish, skin and bones removed, flaked",
        "3 large eggs, beaten to blend",
        "1 large shallot, finely chopped",
        "1 piece matzo, finely crushed (about 1/4 cup)",
        "1/4 cup chopped fresh chives",
        "2 tablespoons chopped fresh dill plus more for serving",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Appetizer",
        "Fry",
        "Passover",
        "Seafood",
        "Beet",
        "Kosher for Passover",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Smoked Fish Fritters with Beet Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-fish-fritters-with-beet-vinaigrette-51147490"
}
