{
    "directions": [
        "Place sieve over medium bowl; line sieve with double layer of cheesecloth, leaving long overhang. Place ricotta cheese in prepared sieve and wrap cheesecloth around ricotta, squeezing gently to release some of liquid from ricotta. Cover and refrigerate until ricotta has released most of its liquid and cheese is dry enough to form into balls, at least 24 hours and up to 2 days. Discard drained liquid.",
        "Line baking sheet with plastic wrap or parchment paper. Place drained ricotta cheese in another medium bowl. Mix Pecorino Romano cheese and smoked mozzarella into ricotta. Season to taste with salt and pepper. Add 1 egg; stir to blend. Place flour in small bowl. Whisk remaining 2 eggs in another small bowl to blend. Place Parmesan in another small bowl. Form ricotta mixture into walnut-size balls (about 1 packed tablespoonful for each). Working with 1 cheese ball at a time, dip into beaten egg, then roll in flour, then coat with beaten egg again. Roll cheese ball in Parmesan cheese, coating completely. Place on prepared baking sheet. Repeat with remaining cheese balls. Chill at least 1 hour. DO AHEAD: Can be made 4 hours ahead. Cover and keep chilled.",
        "Pour enough olive oil into large skillet to reach depth of 1 1/2 inches. Lean deep-fry thermometer against side of skillet with bulb submerged in oil; heat oil to 360°F.",
        "Working in batches, lower a few cheese balls at a time into hot oil and fry until golden, turning occasionally, 30 seconds to 1 minute. Using slotted spoon, transfer fritters to paper towels to drain. Divide among plates and serve hot.",
        "If you can find it, buy a brand of ricotta cheese that has a strainer built into the container, which eliminates the need for draining. Look for smoked mozzarella at some supermarkets and at specialty foods stores.",
        "With both appetizers, pour an Italian Chardonnay. Donatella likes the tropical fruity notes of the 2008 Tormaresca Chardonnay from Puglia (Italy, $12). If you can't find that bottle, try the biodynamic 2008 Alois Lageder \"Beta Delta\" Chardonnay-Pinot Grigio (Italy, $22). Its blend of aromatic fruit and bright acidity would be delicious with the ricotta fritters and the bread with burrata."
    ],
    "ingredients": [
        "1 15-ounce container ricotta cheese, preferably organic",
        "3/4 cup finely grated Pecorino Romano cheese",
        "1/2 cup coarsely grated smoked mozzarella cheese",
        "3 large eggs",
        "All purpose flour",
        "1 cup (or more) finely grated Parmesan cheese",
        "Olive oil (for frying)",
        "Cheesecloth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Appetizer",
        "Vegetarian",
        "Mozzarella",
        "Parmesan",
        "Ricotta",
        "Family Reunion",
        "Deep-Fry",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Smoky Ricotta Fritters",
    "url": "http://www.epicurious.com/recipes/food/views/smoky-ricotta-fritters-358534"
}
