{
    "directions": [
        "1. To make the popper filling, combine the cheeses in a medium-size bowl and stir them together with a fork. Put the cheese mixture in a gallon-size zipper-top plastic bag and cut a small hole in one corner of the bag. Squeeze each jalapeño full of the cheese mixture. Place the cheese-filled jalapeños in the egg carton. Push a pecan half into each pepper. Wrap a half strip of bacon around each jalapeño and secure with a toothpick.",
        "2. Fill your charcoal chimney with briquets, set the chimney on the bottom grill grate, and light or prepare a fire in your smoker. For a gas grill, turn half the burners to high.",
        "3. When the coals are ready, dump them into the bottom of your grill, and spread them evenly across half. Scatter the drained wood chips on the hot coals, or put the dry wood chips in a metal container and place closest to a burner on a gas grill. Place the jalapeños on the indirect side of the grill. When the smoke starts to rise, close the lid.",
        "4. Smoke the peppers at 350°F for 1 hour and 15 minutes until the bacon is cooked and the jalapeño have a smoky aroma."
    ],
    "ingredients": [
        "8 ounces cream cheese or Neufchâtel cheese, at room temperature",
        "1/2 cup shredded sharp cheddar cheese",
        "12 large jalapeño chiles (green, red, or both), cored and seeded",
        "1 empty cardboard egg carton, lid removed, or a metal jalapeño popper rack",
        "12 pecan halves, toasted (see Note)",
        "8 ounces thin-sliced smoked bacon",
        "1/2 cup wood chips, soaked in water and drained, or 1 cup dry wood chips for a gas grill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Oscars",
        "Cheddar",
        "Cream Cheese",
        "Bacon",
        "Pecan",
        "Tailgating",
        "Family Reunion",
        "Poker/Game Night",
        "Jalapeño",
        "Party"
    ],
    "title": "Smoked Stuffed Chile Poppers",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-stuffed-chile-poppers-354409"
}
