{
    "directions": [
        "Heat oil in large pot over medium-high heat. Add turkey; sauté until brown on all sides, about 8 minutes. Transfer to plate. Add 1 cup bacon to pot; stir 1 minute. Add next 5 ingredients. Sauté until vegetables begin to soften, about 15 minutes. Mix in tomato paste. Add 12 cups broth; return turkey to pot. Bring to boil. Reduce heat to medium. Simmer until turkey and vegetables are very tender, about 45 minutes.",
        "Transfer turkey to large plate; cool. Cut meat into bite-size pieces, discarding all skin, bones, and tendons. Working in batches, puree chowder in processor until smooth. Return puree to same pot; add diced turkey. Thin chowder with more broth by 1/4 cupfuls if too thick. Season with cayenne, salt, and pepper. DO AHEAD Can be made 2 days ahead. Chill uncovered until cold, then cover and keep chilled. Rewarm before serving.",
        "Cook onions and brussels sprouts in pan of boiling salted water until tender, about 5 minutes. Drain; peel onions. Cut onions and brussels sprouts in half through core. do ahead Can be made 2 days ahead. Cover and chill.",
        "Sauté 1 cup bacon in skillet over medium heat until crisp. Transfer to paper towels. Pour off all but 1 tablespoon drippings. Add onions and brussels sprouts to skillet. Toss until heated through.",
        "Ladle chowder into bowls. Top with onions, brussels sprouts, bacon, and fresh sage. Serve Croutons alongside or on top of chowder."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "4 smoked turkey drumsticks (4 to 4 1/2 pounds total)",
        "2 cups chopped applewood-smoked bacon (about 10 ounces), divided",
        "2 pounds russet potatoes, peeled, diced",
        "5 cups chopped onions",
        "4 cups chopped celery",
        "3 cups chopped carrots",
        "12 large garlic cloves, peeled",
        "2 tablespoons tomato paste",
        "12 cups (or more) low-salt chicken broth",
        "Cayenne pepper",
        "24 pearl onions",
        "24 small fresh brussels sprouts",
        "Very thin strips of fresh sage",
        "Pumpernickel and Cranberry Croutons"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Garlic",
        "Onion",
        "Potato",
        "turkey",
        "Super Bowl",
        "Bacon",
        "Fall",
        "Winter"
    ],
    "title": "Smoked Turkey and Bacon Chowder with Pumpernickel and Cranberry Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-turkey-and-bacon-chowder-with-pumpernickel-and-cranberry-croutons-237090"
}
