{
    "directions": [
        "Heat butter in a large heavy pot over medium. Add breadcrumbs and cook, stirring occasionally, until golden brown, 5–7 minutes; season with salt. Transfer to a plate.",
        "Cook oil and bacon in same pot over medium-low, stirring often, until bacon is browned around the edges, 5–8 minutes. Add onion and garlic and cook, stirring often, until garlic is golden, about 5 minutes. Stir in red pepper flakes and black pepper, then add stock, vinegar, brown sugar, and hot sauce, then mix in collard greens and reduce heat to low. Bring to a simmer; cover and cook, stirring occasionally, until greens are very tender but still have some chew, 60–70 minutes.",
        "Uncover pot, add beans, and simmer until beans and greens are very tender and liquid is slightly reduced, 15–20 minutes. Season with salt. Serve topped with breadcrumbs.",
        "Collard greens can be cooked 1 day ahead. Let cool in liquid, then cover and chill. Reheat gently over low before adding beans."
    ],
    "ingredients": [
        "4 tablespoons unsalted butter",
        "1/2 cup coarse fresh breadcrumbs",
        "Kosher salt",
        "1/4 cup vegetable oil",
        "8 ounces smoked bacon, chopped",
        "1 large onion, finely chopped",
        "1 head of garlic, cloves separated, thinly sliced",
        "1 teaspoon crushed red pepper flakes",
        "1 teaspoon freshly ground black pepper",
        "3 cups pork or chicken stock or low-sodium chicken broth",
        "1 cup apple cider vinegar",
        "1/3 cup (packed) dark brown sugar",
        "1/3 cup hot sauce (preferably Texas Pete)",
        "2 medium bunches of collard greens, stems trimmed, leaves chopped (about 8 cups)",
        "2 cups frozen lima beans and/or black-eyed peas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Collard Greens",
        "Bacon",
        "Vinegar",
        "Hot Pepper",
        "Lima Bean"
    ],
    "title": "Smoky Tangy Greens And Beans",
    "url": "http://www.epicurious.com/recipes/food/views/smoky-tangy-greens-and-beans"
}
