{
    "directions": [
        "Season the beef generously with salt and pepper. In the stovetop-safe insert of a slow cooker over medium-high heat, warm 1 Tbs. of the oil. Add one-third of the beef and sear until well browned on all sides, 6 to 8 minutes. Transfer to a large bowl. Sear the remaining beef in 2 more batches, warming 1 Tbs. oil in the insert before searing each batch.",
        "Reduce the heat to medium and warm the remaining 2 Tbs. oil. Add the onions, carrots, celery and bell peppers and cook, stirring occasionally, until softened, 10 to 12 minutes. Add the garlic and cook, stirring frequently, for 1 minute. Add the chili powder, cumin, oregano and coriander and cook, stirring constantly, for 1 minute. Add the beef, broth and tomatoes, and season with salt and pepper.",
        "Place the insert on the slow-cooker base, cover and cook on high according to the manufacturer’s instructions until the meat is tender, about 5 hours; during the last 30 minutes of cooking, stir in the kidney beans, black beans and cornmeal.",
        "Fill the chamber of a handheld smoking gun with mesquite wood chips according to the manufacturer’s instructions. Place the nozzle directly above the chili, cover the slow cooker tightly with plastic wrap and smoke the chili. Repeat the smoking with another chamber of chips. Remove the nozzle and cover the slow cooker tightly with plastic wrap. Let stand for 10 minutes, then remove the plastic wrap.",
        "Fill the chamber of the smoking gun with mesquite wood chips. Place the cheese in a pie dish, place the nozzle directly above the cheese, cover the dish tightly with plastic wrap and smoke the cheese. Remove the nozzle and cover the dish tightly with plastic wrap. Let stand for 10 minutes, then remove the plastic wrap.",
        "Position a rack in the middle of an oven and preheat the broiler. Top the chili evenly with the tortilla chips and sprinkle with 1 cup of the cheese. Transfer the insert to the broiler and broil until the cheese is melted, about 4 minutes. Serve with the remaining cheese, guacamole and sour cream alongside. Serves 10 to 12."
    ],
    "ingredients": [
        "4 1/2 lb. beef chuck roast, cut into 1-inch cubes",
        "Kosher salt and freshly ground pepper, to taste",
        "5 Tbs. vegetable oil",
        "3 large yellow onions, diced",
        "2 carrots, peeled and diced",
        "1 celery stalk, diced",
        "2 red bell peppers, seeded and diced",
        "10 garlic cloves, minced",
        "2/3 cup chili powder",
        "2 Tbs. ground cumin",
        "1 Tbs. dried oregano",
        "2 tsp. ground coriander",
        "1 cup beef broth",
        "2 cans (each 28 oz.) crushed tomatoes",
        "1 can (15 oz.) kidney beans, rinsed and drained",
        "1 can (15 oz.) black beans, rinsed and drained",
        "1/4 cup finely ground cornmeal",
        "8 oz. sharp cheddar cheese, shredded",
        "3 cups tortilla chips",
        "Guacamole for serving",
        "Sour cream for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Smoky Beef Chili with Tortilla Chip Crust",
    "url": "http://www.williams-sonoma.com/recipe/smoky-beef-chili-with-tortilla-chip-crust.html"
}
