{
    "directions": [
        "Remove top grill rack from grill (leaving bottom rack for coals) and open vents on bottom of grill. Light charcoal in chimney starter and let burn 10 minutes. Carefully pour hot coals evenly over 2 opposite sides of bottom rack, leaving free of coals a trough down middle of bottom rack. Carefully pour remaining (unlit) charcoal over lit coals, banking them to the sides to maintain trough in middle. Let coals burn, uncovered, until smoldering (coals will turn from white to gray), about 1 hour.",
        "Stack opened paper bags on a work surface, then stack butcher-paper sheets on top. Turn stack so a long side of paper is nearest you.",
        "Stir together salt, pepper, cilantro, garlic, scallions, and oil in a small bowl.",
        "Rinse fish and pat dry, then cut 3 diagonal slashes on both sides of each fish. If necessary, trim tails so that each fish is no more than 13 inches long.",
        "Arrange fish flat lengthwise, side by side (head to tail) in middle of top sheet of stacked butcher paper.",
        "Squeeze lime juice over both sides of fish, then rub fish all over with cilantro mixture, being sure to rub mixture into slashes and all over inner cavities.",
        "Wrap fish in top sheet of butcher paper, overlapping long edges, then folding ends over fish. Turn package upside down to help keep closed, then wrap in second sheet of butcher paper in same manner. Turn package over again. Continue to wrap and turn fish in butcher paper and then brown bag sheets, 1 sheet at a time. Tuck short end of last few sheets inside ends of package to close.",
        "When coals are ready, fill a sink with water and immerse fish package for 1 minute to soak completely, then transfer to a shallow baking pan. Wearing protective mitts, transfer fish package to trough in coals, setting pan aside. Shovel smoldering coals from sides over package using spatulas, burying it as well as possible.",
        "Cook fish 30 minutes. (Some of paper will burn. If paper flames, cover grill briefly.)",
        "Wearing mitts and using both spatulas, carefully uncover package (douse any flames with water if necessary) and transfer to baking pan. Open package (use scissors if necessary) and fillet fish onto a warm platter. Serve with lime wedges."
    ],
    "ingredients": [
        "1 (10-lb) bag hardwood charcoal",
        "4 large brown-paper grocery bags, opened flat (at least 37 by 17 inches)",
        "3 (38- by 18-inch) sheets unglazed butcher paper",
        "1/2 tablespoon salt",
        "1 teaspoon black pepper",
        "1/2 cup chopped fresh cilantro",
        "4 large garlic cloves, thinly sliced",
        "4 scallions (white and pale green parts only), finely chopped",
        "3 tablespoons extra-virgin olive oil",
        "2 (2- to 2 1/2-lb) whole black bass or sea bass, cleaned and scales removed",
        "1 lime, halved",
        "Special equipment: a 22-inch-wide kettle grill; a chimney starter; grilling mitts; 2 long sturdy metal grilling spatulas",
        "Accompaniment: lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Low Carb",
        "Low Fat",
        "Bass",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Smoked Black Bass",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-black-bass-234644"
}
