{
    "directions": [
        "For the prime rib: Rub the prime rib with the spice rub, put in the refrigerate on a rack set over a baking sheet (uncovered) and let marinate for at least 4 hours and up to 8 hours.",
        "For the red wine steak sauce: Heat the oil in a medium saucepan over medium heat. Add the garlic and shallots and cook until soft, about 2 minutes. Add the tomatoes, increase the heat to high and cook until softened, about 5 minutes. Add the wine, ketchup, 1/2 cup water, raisins, molasses, brown sugar, horseradish, Dijon mustard, Worcestershire, cayenne, allspice and salt and pepper to taste and cook for 10 minutes longer. Add a splash of red wine vinegar, and taste for salt and pepper. Transfer to a blender and blend until smooth. Let cool to room temperature.",
        "Prepare your grill using a kamada-style grill, kettle grill, bullet smoker or gas grill method for smoking. Remove the prime rib from the refrigerator 30 minutes before cooking and let sit at room temperature. Sprinkle well with salt and put the prime rib, fat-side up, on the grill grate. Maintaining a temperature of about 250 degrees F (if using a kettle grill or bullet smoker, replenish fire with unlit coals, as needed, to maintain temperature; see manufacturer's instructions), cook until an instant-read thermometer inserted in the center reads 130 degrees F, between 3 1/2 to 4 hours. During the last hour of cooking (at about 110 degrees F), begin brushing with some of the red wine steak sauce and stop adding chips to the smoker. Remove the prime rib from the grill, brush with more of the red wine steak sauce and let rest, loosely covered with foil, for 20 minutes before slicing.",
        "Combine all ingredients in a small bowl."
    ],
    "ingredients": [
        "One 4-rib prime rib roast (6 to 8 pounds), untrimmed",
        "1 cup Bobby Flay's Spice Rub for Pork and Beef, recipe follows",
        "Kosher salt",
        "2 tablespoons canola oil",
        "8 cloves garlic, chopped",
        "2 shallots, chopped",
        "2 plum tomatoes, chopped",
        "1 cup plus 2 tablespoons dry red wine",
        "1 cup ketchup",
        "1/4 cup golden raisins",
        "2 tablespoons molasses",
        "2 tablespoons brown sugar",
        "1 heaping tablespoon horseradish",
        "1 heaping tablespoon Dijon mustard",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon cayenne powder",
        "1/2 teaspoon ground allspice",
        "Kosher salt and freshly ground black pepper",
        "Splash red wine vinegar",
        "4 tablespoons ancho chile powder",
        "2 tablespoons ground coriander",
        "2 tablespoons dry mustard",
        "2 tablespoons Spanish paprika",
        "2 tablespoons freshly ground black pepper",
        "2 tablespoons kosher salt",
        "1 tablespoon chile de arbol powder",
        "1 tablespoon ground cumin",
        "1 tablespoon dried oregano"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sauce Recipes",
        "Roast Recipes",
        "Prime Rib",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Smoked Prime Rib with Red Wine Steak Sauce",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/smoked-prime-rib-with-red-wine-steak-sauce-recipe"
}
