{
    "directions": [
        "Soak sliced onion in a bowl of ice and cold water 15 minutes, then drain well and pat dry.",
        "While onion soaks, stir together cheeses, chives, zest, and pepper in a bowl with a rubber spatula until combined well.",
        "Spread about 1 1/2 tablespoons cheese mixture evenly over each of 2 tortillas (keep remaining tortillas covered with plastic wrap). Top 1 tortilla with an even layer of salmon, covering cream cheese completely, then top with other tortilla, cheese side down. Make 5 more quesadillas in same manner, then stack on a plate and chill, covered with plastic wrap, until ready to heat.",
        "Halve, pit, and peel avocado, then cut lengthwise into 1/8-inch-thick slices. Lightly brush avocado slices with lemon juice.",
        "Heat griddle over high heat until very hot, then reduce heat to moderate. Lightly brush 2 quesadillas on both sides with some oil, then toast on griddle (1 at a time if necessary) until undersides are golden with some blackened spots, about 1 minute. Flip quesadillas over with a spatula and toast until undersides are golden with some blackened spots, 1 to 2 minutes, then transfer to a baking sheet, arranging in 1 layer, and cover with foil to keep warm. Toast remaining quesadillas in same manner, using a second baking sheet.",
        "Heat remaining oil in a 12-inch heavy skillet over high heat until hot but not smoking, then cook tomatoes, stirring occasionally and seasoning with salt and pepper, until just beginning to soften, about 1 minute.",
        "Transfer quesadillas to plates, then top with onion, avocado, tomatoes, and arugula."
    ],
    "ingredients": [
        "1 small red onion, thinly sliced crosswise",
        "6 oz cream cheese, softened",
        "6 oz soft mild goat cheese at room temperature",
        "2 teaspoons finely chopped fresh chives",
        "1/2 teaspoon finely grated fresh lemon zest",
        "1/4 teaspoon black pepper",
        "12 (8-inch) flour tortillas (not low-fat)",
        "1 lb sliced smoked salmon (preferably Nova)",
        "1 firm-ripe California avocado",
        "2 teaspoons fresh lemon juice",
        "3 tablespoons extra-virgin olive oil",
        "1 lb cherry tomatoes, halved lengthwise (2 2/3 cups)",
        "4 cups loosely packed arugula leaves (2 to 3 bunches)",
        "Special equipment: a large (2-burner) cast-iron griddle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Leafy Green",
        "Tomato",
        "Appetizer",
        "Breakfast",
        "Brunch",
        "Lunch",
        "Salmon",
        "Avocado",
        "Arugula",
        "Summer",
        "Tortillas",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Smoked-Salmon Quesadillas with Warm Tomatoes and Arugula",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-salmon-quesadillas-with-warm-tomatoes-and-arugula-232335"
}
