{
    "directions": [
        "Using wood chips in a gas grill is very easy but takes a little planning. If your grill has a smoker attachment, follow the manufacturer's instructions and fill it with wood chips that have been soaked in water or other non-flammable liquid for 30 minutes. If you don't have a smoker box, follow these simple instructions: Fill a small disposable aluminum pan with soaked wood chips, remove the cooking grate, and place the pan in the upper left corner of the grill, or at the spot where all the burners come together. The pan of wood chips will be resting directly on the ceramic briquettes, flavorizerbars, or lava rocks.",
        "Preheat the grill with all the burners on high until smoke begins to appear around the edges of the grill. At this time, set the grill for indirect cooking (turn the burners that will be directly under the food off) and turn the other burners down to medium-low heat. Immediately place the food in the center of the cooking grate and close the lid of the grill to retain the heat and the smoke. You won't need to add more chips, as one panful is enough to impart a nice smoky flavor to the food.",
        "Note: It is essential that you put the soaked wood chips in a gas grill during the preheat stage. Once you set the burners for indirect heat, there won't be enough heat to smolder the chips. Likewise, if you don't soak the chips, they will ignite and burn, not smoke.",
        "Using wood chips on a charcoal grill is much simpler than a gas grill. There is no special equipment necessary; all you do is soak the chips and put a handful directly on top of the white-gray ashed briquettes. To set up a charcoal grill for indirect cooking, place two equal piles of ashed briquettes on each side of the grill, separated by an aluminum pan filled with a bit of water. If you want just a hint of smoke, only use one handful of chips. If you want a more pronounced smoke flavor, add a handful or two more, but be careful: Too much smoke will turn the meat acrid and your food will taste more like ashes than smoke.",
        "Note: There is a barbecue contingent that believes that smoke dehydrates the cooking chamber and steals moisture from the meat. To prevent any loss of moisture, I usually add some liquid in an aluminum pan to both charcoal and gas grills. After all, it can't hurt and we all know that steam does tenderize and cook food.",
        "Remove and discard excess fat from the turkey. Rinse the bird and pat dry. Twist the wing tips under the back. Brush the turkey with oil and lightly sprinkle with salt and pepper inside and out. If you brined your bird, skip the salt and pepper.",
        "If using a gas grill, place the turkey on a roasting rack set in a disposable aluminum-foil roasting pan and place in the grill over the unlit burners. Bend the roasting pan to accommodate closing the gas grill.",
        "If using a charcoal grill, set an aluminum pan filled with 2 inches water on the charcoal grate directly under where the turkey will smoke. Place the turkey, breast?side-up, directly on the cooking grate above the pan. Add wet wood chips directly to the gray-ashed charcoal briquettes. Place the lid on the grill and adjust the vents so that two-thirds of them are closed on the bottom and the top.",
        "Cook over indirect heat without lifting the lid for at least 40 minutes to get good smoke on the turkey. Add more wet wood chips to the smoker box or to the charcoal as desired. After a total of 1 1/2 hours, you won't need to add any more wood, as the turkey will have developed a nice burnished color and \"cooked\" skin. Charcoal grillers will have to add about 12 briquettes to each side every hour; gas grillers don't need to do any tending. No need to baste; the thin coating of oil will promote browning and keep the juices inside the bird.",
        "While the turkey smokes, prepare the glaze. In a small saucepan over low heat, melt the hot pepper jelly, stirring occasionally so it doesn't burn. When the jelly is melted, stir in the vinegar to combine. Add the salt and red pepper flakes, if using. If the glaze is too thick, add a bit more vinegar. Taste and adjust seasonings.",
        "Cook the turkey for 12 minutes per pound total, or until a meat thermometer inserted in the thickest part of the thigh (not touching bone) registers 165°F and the juices run clear when the meat is pierced. Brush the smoked turkey with the glaze, cover, and cook for 15 minutes more. Transfer to a serving platter and let rest for at least 20 minutes before carving and serving."
    ],
    "ingredients": [
        "1 14- to 16-pound turkey, neck and giblets reserved for another use, turkey brined if desired",
        "Olive oil",
        "Kosher salt and freshly ground black pepper",
        "12 ounces hot pepper jelly, preferably homemade",
        "2 tablespoons unseasoned rice vinegar, plus more to taste",
        "Pinch kosher salt, plus more to taste",
        "Pinch crushed red pepper flakes, plus more to taste, optional",
        "Gas or charcoal grill, small disposable aluminum pan, 2 cups wood chips or chunks, plus more if desired, soaked in cold water for 30 minutes (if using a gas grill: aluminum roasting pan (for turkey) and roasting rack)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Thanksgiving",
        "Hot Pepper",
        "Jam or Jelly"
    ],
    "title": "Smoked Turkey with Hot Pepper Jelly Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-turkey-with-hot-pepper-jelly-glaze-51258630"
}
