{
    "directions": [
        "Finely grind coriander seeds, peppercorns, and cloves in an electric coffee/spice grinder or with a mortar and pestle, then stir together with sugar, kosher salt, cilantro, and zest in a bowl. Cut tough muscles from scallops and toss scallops in salt mixture. Bury scallops in salt mixture and chill, covered, 30 minutes. Rinse scallops lightly and dry well with paper towels.",
        "Line drip tray of smoker with foil and spread wood chips evenly over center of smoker pan. Put drip tray on top of chips and put a lightly oiled rack in tray. Season scallops lightly with salt and pepper and put on rack. Put smoker on stove, centered on 1 burner, and heat, uncovered, over moderate heat until chips begin to smolder, 2 to 3 minutes. Reduce heat to low, slide cover on, and smoke scallops 15 minutes. Remove smoker from heat (scallops will be partially cooked).",
        "Boil vinegar in a very small heavy saucepan over moderate heat until reduced by about half, about 3 minutes. Keep warm, covered.",
        "Heat oil in a 10-inch nonstick skillet over moderately high heat until just smoking, then sear scallops until browned on both sides, about 4 minutes total.",
        "Serve scallops on sautéed spinach, drizzled with balsamic glaze."
    ],
    "ingredients": [
        "1/2 teaspoon coriander seeds",
        "1/4 teaspoon white peppercorns",
        "6 whole cloves",
        "1 cup sugar",
        "2 cups kosher salt",
        "1/4 cup chopped fresh cilantro",
        "2 tablespoons finely grated fresh lemon zest",
        "16 large sea scallops (1 1/4 to 1 1/2 lb)",
        "1/3 cup balsamic vinegar",
        "1/2 tablespoon vegetable oil",
        "Accompaniment: sautéed spinach with pancetta",
        "Special equipment: a stovetop smoker/cooker and 3 tablespoons fine wood chips such as oak or hickory"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pork",
        "Appetizer",
        "Marinate",
        "Sauté",
        "Vinegar",
        "Scallop",
        "Spinach",
        "Smoker",
        "Cilantro",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Smoked Sea Scallops with Balsamic Glaze on Sauteed Spinach with Pancetta",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-sea-scallops-with-balsamic-glaze-on-sauteed-spinach-with-pancetta-104640"
}
