{
    "directions": [
        "Prepare the ribs (see below). Combine the brown sugar, chili powder, paprika, cumin, mustard powder and 2 tablespoons salt in a small bowl. Rub the ribs all over with the cut sides of the lemon and then the spice mixture and place in a large roasting pan or resealable plastic bag. Cover and refrigerate at least 2 hours or overnight.",
        "Meanwhile, soak the wood chips in water 1 hour, then prepare your grill for smoking, filling the smoker box with one-quarter each of the wood chips and apple.",
        "About 30 minutes before smoking, remove the ribs from the refrigerator and let stand at room temperature. Meanwhile, combine the apple juice, Worcestershire sauce and vinegar in a small spray bottle. Shake to mix.",
        "Once the grill reaches 250 degrees F, lightly brush the grates with vegetable oil and place the ribs on the cooler side of the grill, meat-side up. Spray with the apple juice mixture. Close the grill and let smoke 1 hour.",
        "Replenish the smoker box with another one-quarter each of the wood chips and apple. Flip the ribs so they're meat-side down with the opposite edge of the racks closer to the smoker box. Spray with the apple juice mixture; close the grill and let smoke 1 more hour. Repeat this process every hour until the ribs are dark brown and tender and the meat starts to shrink away from the bones, about 2 more hours. Remove the ribs from the grill and let rest 5 minutes before slicing.",
        "How to prep your ribs:",
        "Position the ribs meat-side down. Insert a paring knife under the membrane that covers the back of the rack. Loosen the membrane with the knife. Grab the membrane with your fingers and peel off completely."
    ],
    "ingredients": [
        "2 racks baby back ribs (about 3 pounds each)",
        "1/4 cup packed light brown sugar",
        "1 tablespoon chili powder",
        "1 tablespoon paprika",
        "2 teaspoons ground cumin",
        "1 teaspoon mustard powder",
        "Kosher salt",
        "1 lemon, halved",
        "1 apple, quartered",
        "1 cup apple juice or cider",
        "2 tablespoons Worcestershire sauce",
        "1 tablespoon apple cider vinegar",
        "Vegetable oil, for brushing"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Ribs Recipes",
        "Apple",
        "Fruit",
        "Meat"
    ],
    "title": "Smoked Baby Back Ribs",
    "url": "http://www.foodnetwork.com/recipes/smoked-baby-back-ribs"
}
