{
    "directions": [
        "Cook bacon in a 4-quart heavy pot over moderate heat, stirring occasionally, until fat is rendered and bacon is golden brown, about 6 minutes. Pour off all but 2 tablespoons fat from pot (if your bacon renders less fat, add enough olive oil to bring total to 2 tablespoons), then add onion and carrots to bacon and cook over moderate heat, stirring frequently, until onion is softened and golden, about 5 minutes. Add lentils and cook, stirring, 1 minute. Add water, stirring and scraping up any brown bits from bottom of pot, then reduce heat to moderately low and simmer, covered, until lentils are very tender, 15 to 25 minutes. Stir in salt and pepper.",
        "Preheat broiler. Arrange baguette slices on a baking sheet or broiler pan and spread top of each slice with butter. Broil slices 6 inches from heat until pale golden, about 1 minute. Spread buttered sides with a thin layer of mustard, then top each toast with 2 slices of cheese and broil until cheese is melted and bubbling, about 1 minute.",
        "Serve soup with Cheddar toasts."
    ],
    "ingredients": [
        "2 bacon slices, finely chopped",
        "1 cup finely chopped onion (1 large)",
        "2 large carrots, quartered and cut into 1/4-inch dice",
        "1 cup red lentils (7 oz)",
        "1 qt water",
        "3/4 teaspoon salt",
        "1 1/2 teaspoons black pepper",
        "6 (1-inch-thick) baguette slices, cut on a long diagonal",
        "1 tablespoon unsalted butter",
        "1 to 2 teaspoons Dijon mustard",
        "1/4 lb extra-sharp Cheddar, cut into 12 (1/4-inch-thick) slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Onion",
        "Pepper",
        "Broil",
        "Quick & Easy",
        "Cheddar",
        "Bacon",
        "Lentil",
        "Carrot",
        "Winter",
        "Gourmet"
    ],
    "title": "Smoky Red-Lentil Soup with Cheddar Toasts",
    "url": "http://www.epicurious.com/recipes/food/views/smoky-red-lentil-soup-with-cheddar-toasts-233967"
}
