{
    "directions": [
        "Heat 1 tablespoon oil in large saucepan over medium-high heat. Add sausage; sauté until browned, breaking up with fork, about 6 minutes. Add prosciutto; stir 1 minute. Transfer mixture to bowl.",
        "Heat 2 tablespoons oil in same pan over medium-high heat. Add onions and next 4 ingredients. Sauté until tender, about 5 minutes. Stir in tomato paste. Add tomatoes with reserved juice, basil, and sausage mixture. Reduce heat; simmer until sauce thickens, stirring occasionally, about 15 minutes. Season with salt and pepper. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Cook noodles in large pot of boiling salted water until just tender but still firm to bite. Drain. Arrange in single layer on baking sheet. Stir ricotta and 1 1/2 cups mozzarella in bowl. Season with salt and pepper; mix in egg.",
        "Brush 13x9x2-inch glass baking dish with oil. Spread 1 cup tomato sauce evenly over bottom. Arrange 3 noodles atop sauce. Spread 3/4 cup cheese mixture thinly over noodles. Spoon 1 1/2 cups sauce over. Repeat with noodles, cheese mixture, and sauce 2 more times. Cover with 3 noodles. Sprinkle with remaining 1/2 cup mozzarella. Cover with foil. (Can be prepared 1 day ahead. Chill.)",
        "Preheat oven to 350°F. Bake lasagna, covered, 40 minutes. Uncover and bake until heated through, about 15 minutes longer. Let stand 10 minutes and serve."
    ],
    "ingredients": [
        "3 tablespoons olive oil, divided",
        "1 pound Italian sweet sausages, casings removed",
        "2 ounces sliced prosciutto, chopped",
        "2 cups chopped onions",
        "1 celery stalk, chopped",
        "3 garlic cloves, chopped",
        "1 teaspoon dried oregano",
        "1/4 teaspoon dried crushed red pepper",
        "2 tablespoons tomato paste",
        "1 28-ounce can Italian-style tomatoes in juice, tomatoes chopped, juice reserved",
        "2 tablespoons chopped fresh basil",
        "12 10x2-inch lasagna noodles",
        "1 15-ounce container whole-milk ricotta cheese",
        "2 cups (packed) coarsely grated smoked mozzarella cheese, divided",
        "1 large egg",
        "Olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Bake",
        "Mozzarella",
        "Ricotta",
        "Sausage"
    ],
    "title": "Smoked Cheese and Sausage Lasagna",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-cheese-and-sausage-lasagna-109240"
}
