{
    "directions": [
        "Mix all the rub ingredients together and set aside.",
        "Remove the steaks from the refrigerator and allow them to come to room temperature for about 30 minutes. Meanwhile, heat a grill to high, placing the majority of the coals and a couple (optional) fist-sized wood chunks in the center of the grill to create a cool zone on the outer edges.",
        "Once the steaks have come to room temperature, coat all sides with the olive oil; then season generously with the coffee-coriander rub. Place the steaks in the center of the grill, cover, and cook for 3 minutes. Flip and grill, covered, for another 3 minutes. Flip and cook each side for an additional 2 to 3 minutes, until they reach your desired level of doneness (145° to 150°F for medium-rare and 150° to 160°F for medium according to the USDA. Remember, however, that the meat will rise in temperature as much as 10 degrees as it rests). Remove from the grill and allow to rest for at least 5 minutes so that the juices have time to redistribute and don't end up all over your serving platter or cutting board."
    ],
    "ingredients": [
        "2 tablespoons ground coffee",
        "3 tablespoons smoked paprika",
        "1 1/2 tablespoons coriander seeds, lightly toasted and ground",
        "1/2 teaspoon dry mustard",
        "1 teaspoon coarsely ground black pepper",
        "2 tablespoons kosher salt",
        "4 New York strip steaks, about 1 1/2 inches thick",
        "1/4 cup extra virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Beef",
        "Fourth of July",
        "Father's Day",
        "Backyard BBQ",
        "Meat",
        "Steak",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Coriander",
        "Paprika"
    ],
    "title": "Smoke in Da Eye Grilled Coffee-Coriander-Rubbed New York Strip Steak",
    "url": "http://www.epicurious.com/recipes/food/views/smoke-in-da-eye-grilled-coffee-coriander-rubbed-new-york-strip-steak-51166600"
}
