{
    "directions": [
        "In a food processor fitted with the blade attachment, or in a blender, pulse the egg yolks, lemon juice, Dijon, garlic, 2 teaspoons salt, and Worcestershire until thoroughly combined. With the machine running, add the vegetable oil very slowly to make an emulsified dressing.",
        "Drain the oysters from their oil, reserving 1 tablespoon of the oil for the croutons. Add the drained oysters to the dressing and pulse until smooth.",
        "Combine crackers, olive oil, 1 teaspoon kosher salt, and black pepper with the reserved tablespoon of oyster oil in a medium skillet over medium-high heat. Cook, tossing often, until the crackers are toasty. Set aside to cool.",
        "Put a spoonful of the dressing directly onto each plate. Place a romaine heart half, face up, on the dressing, and drizzle with additional dressing. Top with croutons, cracked black pepper and cheese.",
        "Dressing can be made up to 7 days ahead. Pour into a container and keep chilled."
    ],
    "ingredients": [
        "2 egg yolks",
        "1/4 cup fresh lemon juice",
        "1 tablespoon Dijon mustard",
        "2 teaspoons minced garlic",
        "3 teaspoons kosher salt, divided",
        "1 teaspoon Worcestershire sauce",
        "3/4 cup vegetable oil",
        "1 3.7-ounce can smoked oysters packed in oil",
        "2 cups oyster crackers",
        "1 tablespoon extra-virgin olive oil",
        "1 teaspoon freshly ground black pepper, plus more for serving",
        "4 romaine hearts, bases removed and halved lengthwise",
        "1/4 cup grated Pecorino Romano cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Lettuce",
        "Oyster",
        "Quick & Easy",
        "Dinner",
        "Fish",
        "Cheese",
        "Egg",
        "Appetizer",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Smoked Oyster Caesar",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-oyster-caesar-salad"
}
