{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Line a roasting pan with a large sheet of aluminum foil.",
        "Toss butternut squash, shallot, 2 tablespoons canola oil, paprika, chili powder, chipotle powder, and ginger together in a bowl until evenly mixed and coated. Pour into prepared roasting pan and wrap aluminum foil around squash mixture.",
        "Bake in the preheated oven until squash is tender, 30 to 40 minutes.",
        "Heat 1 tablespoon canola oil in a cast-iron skillet over medium heat. Cook and stir reserved butternut squash seeds, pinch salt, and pinch ground black pepper in the skillet until lightly toasted, 5 minutes. Add Brussels sprouts leaves and cook, stirring occasionally, until leaves are slightly crispy and seeds are browned, 10 to 15 minutes. Stir maple syrup into seed mixture and immediately remove from heat.",
        "Pour butternut squash mixture and almond milk into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until soup is smooth.",
        "Pour butternut squash soup into bowls and top with squash seeds and Brussels sprouts mixture, pomegranate seeds, and goat cheese."
    ],
    "ingredients": [
        "1 butternut squash - peeled and cut into cubes, seeds removed and reserved",
        "1/2 shallot, diced",
        "3 tablespoons canola oil, divided",
        "2 teaspoons smoked paprika",
        "1 1/2 teaspoons chili powder",
        "1 1/2 teaspoons chipotle chile powder",
        "1 teaspoon minced fresh ginger",
        "salt and ground black pepper to taste",
        "6 fresh Brussels sprouts, cored and separated into leaves",
        "2 tablespoons maple syrup",
        "1 1/2 cups almond milk",
        "1/4 cup crumbled goat cheese, or to taste",
        "seeds of 1 pomegranate"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Smokey Butternut Squash Soup",
    "url": "http://allrecipes.com/recipe/235260/smokey-butternut-squash-soup/"
}
