{
    "directions": [
        "In a small bowl whisk together sour cream and peppercorns. Sauce may be made 1 day ahead and chilled, covered.",
        "In a blender purée chives with oil and salt until smooth. Pour purée through a fine sieve into a bowl, pressing on solids, and discard solids. Chive oil may be made 1 day ahead and chilled, covered. Bring chive oil to room temperature before proceeding. Whisk lemon juice into chive oil and season with pepper.",
        "In a bowl toss mesclun with just enough vinaigrette to coat and season with salt and pepper. On each of 6 chilled plates decoratively layer mesclun and mackerel in small mounds and drizzle with some remaining vinaigrette. On each plate decoratively arrange salmon with a dollop of sauce and 1 lemon wedge, and a wedge of mousse and some toasts."
    ],
    "ingredients": [
        "1/4 cup sour cream",
        "1 teaspoon pink peppercorns*, crushed",
        "1/2 cup coarsely chopped fresh chives (wash and dry before chopping)",
        "3 tablespoons extra-virgin olive oil",
        "1/8 teaspoon coarse salt",
        "1 tablespoon plus 1/2 teaspoon fresh lemon juice, or to taste",
        "1 cup loosely packed mesclun (mixed baby greens), rinsed and dried",
        "4 ounces peppered smoked mackerel**, cut into twelve 2-inch pieces",
        "4 ounces thinly sliced smoked salmon",
        "6 lemon wedges",
        "6 wedges smoked trout mousse",
        "about 18 anchovy toasts",
        "*available at specialty foods shops and some supermarkets",
        "**available at fish markets and deli counters at many supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Fish",
        "No-Cook",
        "Rosh Hashanah/Yom Kippur",
        "Lunch",
        "Lemon",
        "Salmon",
        "Trout",
        "Winter",
        "Chive",
        "Sour Cream",
        "Lettuce",
        "Gourmet"
    ],
    "title": "Smoked Fish Trio",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-fish-trio-13605"
}
