{
    "directions": [
        "Place chile and 1 tomato in a small saucepan and add water to cover. Bring to a simmer over medium heat and cook until tomato is burst and chile is soft, about 5 minutes. Remove from heat and add hoja santa. Let cool slightly, then blend tomato, chile, and hoja santa with 1 cup cooking liquid until smooth.",
        "Halve remaining tomato, squeeze or scoop out seeds, and chop flesh. Finely chop half of leek and add to tomato; slice other half lengthwise into thin strips about 1 1/2\" long.",
        "Heat olive oil in a large skillet over medium-low and cook onion, carrot, and chopped leek and tomato. Cook, stirring often and reducing heat if vegetables start to take on any color, until tomato is falling apart and vegetables cook down, 25-30 minutes.",
        "Season vegetable mixture with salt and increase heat to medium-high; add garlic. Cook, stirring, until garlic is golden brown, about 2 minutes.",
        "Add swordfish and tomato puree. Bring to a gentle simmer and cook, stirring often, until liquid is almost completely absorbed, 8-12 minutes. Stir in vinegar; taste and adjust with salt and more vinegar if needed. Let cool.",
        "Meanwhile, use cutter to punch out circles from tortillas (you should have about 24). Heat vegetable oil in a medium skillet over medium-high. Working in batches, fry tortilla rounds until puffed and crisp, about 30 seconds per side. Transfer to paper towels to drain; season with salt.",
        "Working in batches, cook leek strips in same oil until golden brown and crisp, about 2 minutes. Transfer to paper towels; season with salt.",
        "To serve, top each tostadita with a dollop of avocado cream and a small spoonful of swordfish mixture. Garnish with fried leeks.",
        "Do Ahead: Swordfish mixture can be made 2 days ahead. Cover and chill. Bring to room temperature before serving."
    ],
    "ingredients": [
        "1 morita chile, seeds removed",
        "2 plum tomatoes, divided",
        "2 tablespoons finely chopped hoja santa or 1 tablespoon finely chopped fresh basil with 1 tablespoon finely chopped fennel fronds",
        "1 leek, white and pale-green parts only, halved lengthwise, divided",
        "1/3 cup olive oil",
        "1 small onion, finely chopped",
        "1 large carrot, finely chopped",
        "Kosher salt",
        "1 garlic clove, finely chopped",
        "8 ounces smoked swordfish, shredded",
        "2 teaspoons Sherry vinegar or red wine vinegar",
        "8 corn tortillas, preferably blue",
        "1 cup vegetable oil",
        "Avocado Cream",
        "A 2 1/2\" cookie cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Appetizer",
        "Low Fat",
        "Kid-Friendly",
        "Healthy",
        "Swordfish",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Smoked Swordfish Tostaditas",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-swordfish-tostaditas-51264480"
}
