{
    "directions": [
        "Heat the oven to 350°F. Lay the wedges of radicchio on a small sheet pan and drizzle with about 2 tablespoons of the olive oil. Season with salt and pepper and cover the pan with aluminum foil. (Covering the pan allows the radicchio to steam and roast at the same time.) Cook until very tender and lightly browned, about 30 minutes. (The radicchio can be roasted a day ahead.)",
        "Heat a panini or sandwich grill until hot (400°F to 450°F). If you don't have a panini grill, heat a grill pan or ¬cast-¬iron pan over ¬medium--low heat. Pat the radicchio dry, if need be, and cut away any tough core. Make two sandwiches, layering the ham, cheese, and radicchio. (You may not use all of the radicchio.)",
        "Brush the outsides of the sandwiches with olive oil and grill in the press for 9 to 10 minutes; you want to crisp and brown the bread and melt the cheese a bit, but the meat need not be excessively hot. If using a pan, weight the sandwiches down with another heavy pan set on top. Cook for 2 to 3 minutes on each side, watching them carefully and adjusting the heat as needed. Cut and serve."
    ],
    "ingredients": [
        "1 head radicchio, cut through the core into 8 wedges",
        "1/4 cup extra virgin olive oil",
        "Kosher salt and freshly ground black pepper",
        "Four 1/2-inch slices ciabatta or other good crusty bread",
        "6 thin slices smoked ham",
        "2 to 3 ounces assertive cheese, such as Gorgonzola or Camembert, crumbled or thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Quick & Easy",
        "Graduation",
        "Father's Day",
        "Lunch",
        "Ham",
        "Radicchio",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Smoked Ham, Roasted Radicchio, And Cheese Panini",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-ham-roasted-radicchio-and-cheese-panini-363311"
}
