{
    "directions": [
        "In a small saucepan sprinkle the gelatin over the lemon juice, let it soften for 10 minutes, and heat the mixture over moderately low heat, stirring, until the gelatin is dissolved. In a food processor purée the avocado with the cream cheese, the horseradish, and the gelatin mixture until the mixture is smooth. Transfer the mixture to a bowl, set the bowl in a larger bowl of ice and cold water, and stir the mixture until it is thickened to the consistency of thick mayonnaise.",
        "Arrange the smoked salmon slices, overlapping them slightly, on a sheet of plastic wrap to form a 17- by 7-inch rectangle and spread them with the avocado mixture, leaving 1/2-inch border. Using the plastic wrap as an aid and beginning with a long side roll up the smoked salmon jelly-roll fashion, wrap it in the plastic wrap, and twist the ends of the plastic wrap closed. Chill the smoked salmon roll for 3 hours, or until it is frim and the filling is set.",
        "With a 1 1/2-inch round cutter cut out rounds from the pumpernickel, reserving the scraps for another use. Remove the plastic wrap from the salmon roll carefully on a cutting board and with and electric knife or other very sharp knife cut it crosswise int 1/4-inch slices. Arrange each salmon roll slice on a pumpernickel round and garnish each canapé with a parsley sprig and 2 short sections of chive. The canapés keep, covered tightly with plastic wrap and chilled, for 2 hours."
    ],
    "ingredients": [
        "1 envelope of unflavored gelatin",
        "2 tablespoons fresh lemon juice",
        "1/2 California avocado",
        "an 8-ounce package cream cheese, softened",
        "3 tablespoons drained bottled horseradish",
        "1/2 pound thinly sliced smoked salmon",
        "18 thin slices of dense pumpernickel",
        "tiny parsley sprigs for garnish",
        "fresh chives for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cocktail Party",
        "Cream Cheese",
        "Salmon",
        "Avocado",
        "Shower",
        "Gourmet"
    ],
    "title": "Smoked Salmon, Avocado, and Horseradish Spirals",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-salmon-avocado-and-horseradish-spirals-101582"
}
