{
    "directions": [
        "In a slow cooker, combine the garlic, onions, chilies, adobo sauce, honey, Worcestershire, mustard and beer. Season the brisket with salt. Place the brisket, fat side up, in the slow cooker. Cover and cook on high for 8 hours. Transfer the brisket and juices to a shallow pan and let cool at room temperature for 1 hour. Cover with plastic wrap and refrigerate for at least 6 hours or up to 24 hours.",
        "Spoon the solidified fat off the juices. Transfer the brisket to a plate, cover with plastic wrap and refrigerate until ready to grill.",
        "Transfer the juices to a large saucepan. Using an immersion blender, puree until only small pieces of onion remain. Set the pan over medium-low heat, bring to a simmer and cook, stirring occasionally, until the juices have thickened, about 2 hours.",
        "Prepare a medium-hot fire in a grill. Place the brisket on the grill and cook until crispy, 7 to 10 minutes. Using tongs, turn the brisket over and cook until crispy, 5 to 7 minutes. Brush the top of the meat with sauce, turn the brisket over and cook for 3 to 5 minutes, then repeat.",
        "Transfer the brisket to a carving board and brush with more sauce. Cover loosely with aluminum foil and let rest for 10 minutes. Slice the brisket against the grain and arrange on a warmed platter. Pass the remaining sauce alongside. Serves 6 to 8.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "6 garlic cloves, minced",
        "2 yellow onions, chopped",
        "6 canned chipotle chilies in adobo sauce,   drained and chopped, plus 1⁄4 cup sauce",
        "1⁄4 cup honey",
        "1 Tbs. Worcestershire sauce",
        "2 tsp. brown mustard",
        "1 1⁄2 cups lager or other light beer",
        "1 flat-end beef brisket, 3 to 4 lb., fat trimmed   to 1⁄4 inch",
        "Salt, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Smoky Spicy Brisket",
    "url": "http://www.williams-sonoma.com/recipe/smoky-spicy-brisket.html"
}
