{
    "directions": [
        "To prepare the crêpes, stir the whole-wheat flour, all-purpose flour, and salt together in a medium bowl. Whisk the milk, eggs, and melted butter together in a small bowl. Pour half of the milk mixture into the flour mixture and whisk until smooth. Add the remaining milk mixture and continue whisking until the batter is completely smooth. Strain the batter through a fine-mesh strainer. Let the batter rest for half an hour before cooking.",
        "Line a tray with parchment paper. Heat a crêpe pan or a 7-inch nonstick sauté pan or skillet over moderately high heat. Spray the pan lightly with cooking oil or brush with melted butter. Pour 1/4 cup of batter into the side of the pan and swirl to coat the bottom, forming a thin layer. Cook until bubbles appear on the surface of the crêpe and the edges begin to brown lightly. Flip the crêpe over using a spatula. Cook the second side for about 10 seconds and turn the crêpe onto the prepared tray to cool. Continue cooking crepes until all the batter is used. You should have 11 crêpes (see Note).",
        "To prepare the filling, in the bowl of a food processor fitted with a blade attachment, process the cream cheese until smooth, about 30 seconds. Scrape the bowl with a rubber spatula and add the scallion, capers, lemon juice, milk, and salmon. Process for another 15 seconds, then scrape the bowl with a rubber spatula again. Blend for another 10 seconds or until the mixture looks fairly smooth. Divide the filling into 10 portions, each about 2 heaping tablespoons.",
        "Place a crêpe on a serving plate and spread one portion of filling completely and evenly over its surface with a metal offset spatula or the back of a spoon. Top with another crêpe and carefully spread another portion of filling on top, making sure you spread to the edges. Continue until all of the filling and the crêpes are stacked, ending with a plain crêpe on top. Cover the torte with plastic film and chill for at least 1/2 hour before slicing and serving.",
        "Cut the torte into small wedges with a sharp knife. Clean the knife between cuts to make a neat sliced appearance. Any remaining pieces of torte can be wrapped tightly with plastic film and stored in the refrigerator for up to 1 week."
    ],
    "ingredients": [
        "1/2 cup whole-wheat flour",
        "1/2 cup all-purpose flour",
        "1/4 teaspoon salt",
        "1 1/4 cups whole milk",
        "2 eggs",
        "2 tablespoons unsalted butter, melted",
        "One 8-ounce package cream cheese at room temperature",
        "1 tablespoon plus 2 teaspoons roughly chopped scallion, green part only",
        "2 teaspoons capers, drained and rinsed",
        "1/2 teaspoon fresh lemon juice",
        "2 tablespoons whole milk",
        "One 4-ounce package smoked salmon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Fish",
        "Appetizer",
        "Brunch",
        "Side",
        "Dinner",
        "Lunch",
        "Buffet",
        "Cream Cheese",
        "Seafood",
        "Salmon",
        "Advance Prep Required",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Smoked-Salmon Crêpe Torte",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-salmon-crepe-torte-355371"
}
