{
    "directions": [
        "Cook carrots in pan of boiling salted water until very tender, about 8 minutes. Drain, reserving 1/2 cup cooking water in small bowl. Stir matzo meal into water; let stand 10 minutes. Place carrots in processor. Heat olive oil in heavy medium skillet over medium-low heat. Add onion and sauté until soft, about 5 minutes. Add green onions and stir 1 minute. Add onion mixture to carrots in processor. Add matzo meal mixture; blend until mixture is pureed and smooth. Using electric mixer, beat 3 eggs and lemon juice in large bowl until foamy and slightly thickened, about 4 minutes. Stir in mixture from processor; do not clean processor bowl.",
        "Blend fish fillets, smoked fish, salt, and pepper in same processor bowl until fish is finely chopped. Add remaining egg and blend to coarse paste. Add fish mixture to matzo meal mixture and mix thoroughly. Cover and refrigerate until very cold, about 2 hours.",
        "Line large baking sheet with waxed paper. Using wet hands, shape 1/4 cup fish mixture for each dumpling into egg-shaped oval. Place on prepared sheet. Cover with waxed paper and chill while preparing cabbage and steamer.",
        "Set vegetable steamer rack in large pot. Fill pot with enough water to meet, but not cover, bottom of rack. Line rack with cabbage leaves. Arrange 8 fish dumplings on leaves; cover with additional cabbage. Bring water to boil. Cover pot and steam dumplings until cooked through and firm to touch, about 25 minutes. Transfer upper cabbage leaves to platter. Top with cooked dumplings. Cover with bottom cabbage leaves. Steam remaining dumplings in additional cabbage leaves in 2 more batches. Cover and refrigerate gefilte fish until cold, at least 6 hours. (Can be prepared 2 days ahead. Keep refrigerated.)",
        "Push garlic through garlic press into small bowl or mince garlic and place in small bowl. Mix in horseradish and lemon juice. Gradually whisk in mayonnaise. Season sauce with salt and pepper. Cover; chill up to 1 day.",
        "Line plates with lettuce leaves. Arrange 1 or 2 fish dumplings on each. Spoon lemon-horseradish sauce alongside."
    ],
    "ingredients": [
        "3/4 cup thinly sliced peeled carrots",
        "1/4 cup matzo meal",
        "2 tablespoons olive oil",
        "1 cup chopped onion",
        "1 cup chopped green onions",
        "4 large eggs",
        "1 tablespoon fresh lemon juice",
        "1 1/2 pounds mild white fish fillets (such as sole or flounder), cut into small pieces",
        "2 cups flaked smoked whitefish (about 8 ounces), carefully boned",
        "3/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 large cabbage, separated into leaves",
        "2 garlic cloves",
        "1/4 cup prepared white horseradish",
        "2 tablespoons fresh lemon juice",
        "1 cup mayonnaise",
        "Butter lettuce leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Appetizer",
        "Steam",
        "Passover",
        "Rosh Hashanah/Yom Kippur",
        "Horseradish",
        "Lemon",
        "Spring",
        "Kosher",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Smoked Whitefish Gefilte Fish with Lemon-Horseradish Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-whitefish-gefilte-fish-with-lemon-horseradish-sauce-106399"
}
