{
    "directions": [
        "Stir cheddar cheese, 1 tablespoon maple syrup, cream cheese, and sage in small bowl to blend. Place 1 chicken breast, skin side down, on work surface. Using small sharp knife, cut 1 1/2-inch-deep by 2-inch-long horizontal pocket in chicken. Pack in 1/4 of stuffing. Press tenderloin into pocket opening to seal in stuffing. Repeat with remaining chicken and stuffing. Arrange chicken on small baking sheet. Combine 1/4 cup maple syrup, whisky, brown sugar, and butter in small saucepan. Whisk over medium heat until sauce comes to simmer and is blended. (Chicken and basting sauce can be made 1 day ahead. Cover separately and refrigerate.)",
        "Whisk first 5 ingredients in medium bowl to blend. Mix in apple, red onion, and green onions. Season slaw to taste with salt and pepper. Refrigerate at least 1 hour and up to 4 hours, tossing occasionally.",
        "Spray grill rack with nonstick spray and prepare barbecue (medium-high heat). Rewarm basting sauce; transfer half to bowl and reserve. Set pan with remaining sauce at edge of grill to keep warm. Grill chicken, skin side down, until golden, about 3 minutes. Turn chicken over, repositioning over medium to medium-low heat. Grill until cooked through, turning occasionally and basting with sauce in pan during last 5 minutes, about 8 minutes. Transfer chicken to platter. Serve with apple slaw, passing reserved sauce separately."
    ],
    "ingredients": [
        "1/2 cup coarsely grated smoked cheddar cheese",
        "1 tablespoon plus 1/4 cup pure maple syrup",
        "1 tablespoon cream cheese, room temperature",
        "2 teaspoons chopped fresh sage",
        "4 boneless chicken breast halves with skin and tenderloin attached",
        "1/4 cup Scotch whisky",
        "2 tablespoons (packed) golden brown sugar",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 tablespoon olive oil",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon pure maple syrup",
        "1 tablespoon Scotch whisky",
        "1 1/2 teaspoons chopped fresh sage",
        "1 very large Granny Smith apple, halved, cored, cut into matchstick-size strips (about 2 1/2 cups)",
        "1/4 cup paper-thin slices red onion",
        "2 green onions, chopped",
        "Nonstick vegetable oil spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Chicken",
        "Fruit",
        "Wheat/Gluten-Free",
        "Backyard BBQ",
        "Dinner",
        "Cheddar",
        "Apple",
        "Summer",
        "Grill/Barbecue",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Smoked-Cheddar-Stuffed Chicken with Green Apple Slaw",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-cheddar-stuffed-chicken-with-green-apple-slaw-232385"
}
