{
    "directions": [
        "Whisk first 9 ingredients in large roasting pan to blend. Add ribs to pan; turn to coat. Chill overnight, turning ribs occasionally. Remove ribs from marinade, reserving marinade.",
        "Place handful of torn newspaper in bottom of charcoal chimney. Top with 30 charcoal briquettes. Remove top rack from barbecue. Place chimney on lower barbecue rack. Light newspaper; let charcoal burn until ash is gray, about 30 minutes.",
        "Open bottom barbecue vent. Turn out hot charcoal onto 1 half of bottom rack. Using metal spatula, spread charcoal to cover approximately 1/3 of rack. Fill foil loaf pan halfway with water and place opposite charcoal on bottom rack.",
        "Place top rack on barbecue. Arrange ribs on top rack above water in loaf pan. Cover barbecue with lid, positioning top vent directly over ribs. Place stem of candy thermometer through top vent, with gauge on outside and tip near ribs (thermometer should not touch meat or barbecue rack); leave in place during cooking. Use top and bottom vents to maintain temperature between 250°F and 300°F, opening vents wider to increase heat and closing to decrease heat. Leave any other vents closed. Check temperature every 10 minutes.",
        "Cook ribs until meat is very tender when pierced with knife, turning ribs and basting with reserved marinade every 20 minutes, about 1 hour 30 minutes total. Open barbecue only when necessary (to baste meat, for instance) and close quickly to minimize loss of heat and smoke. After first 30 minutes of cooking, use technique described earlier to light additional 15 charcoal briquettes in same charcoal chimney set atop nonflammable surface.",
        "If cooking temperature drops below 250°F, use oven mitts to lift off top rack with ribs and place on heatproof surface. Using tongs, add half of hot gray charcoal from chimney to bottom rack. Replace top rack on barbecue, placing ribs above water in loaf pan. Cover with lid.",
        "Transfer ribs to baking sheet; let stand 10 minutes. Cut meat between bones to separate ribs and serve.",
        "*Available at Asian markets and in the Asian foods section of many supermarkets."
    ],
    "ingredients": [
        "1/2 cup soy sauce",
        "1/2 cup hoisin sauce*",
        "1/2 cup oyster sauce*",
        "1/2 cup honey",
        "1/2 cup cream Sherry",
        "2 tablespoons finely grated peeled fresh ginger",
        "2 tablespoons black bean garlic sauce*",
        "6 garlic cloves, minced",
        "1/2 teaspoon Chinese five-spice powder",
        "3 1 1/2-pound racks baby back pork ribs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Marinate",
        "Fourth of July",
        "Dinner",
        "Pork Rib",
        "Summer",
        "Honey",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Smoked Baby Back Ribs with Hoisin-Honey Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-baby-back-ribs-with-hoisin-honey-glaze-105305"
}
