{
    "directions": [
        "Lightly oil a straight-sided 2-cup mold or soufflé dish.",
        "In a food processor purée trout with 1/4 cup cream, butter, lemon juice, and salt until smooth and transfer to a bowl. In a very small saucepan sprinkle gelatin over water and let soften 1 minute. Heat mixture over moderately low heat, stirring, just until gelatin is dissolved (do not let boil) and cool to room temperature. In a bowl with an electric mixer beat remaining 1/2 cup cream until it just holds stiff peaks and fold into trout purée with gelatin mixture and salt to taste until combined well.",
        "Spoon half of mousse into mold or soufflé dish and smooth top. Spoon roe evenly over mousse (roe will not cover mousse completely) and sprinkle evenly with dill. Spoon remaining mousse over dill, spreading mousse evenly (being careful not to disturb roe and dill), and gently smooth surface. Chill mousse, covered, at least 12 hours and up to 2 days.",
        "To unmold mousse, run a thin knife around edge of mold or soufflé dish and dip bottom into a bowl of hot water 5 seconds. Invert mousse onto a plate and cut into 8 wedges (reserve 2 wedges for another use). Put sesame seeds in a shallow bowl and carefully dip outside edge of each wedge in seeds to coat."
    ],
    "ingredients": [
        "2 smoked trout fillets* (about 8 ounces total), skin and bones discarded and fish broken into small pieces (about 1 cup packed)",
        "3/4 cup well-chilled heavy cream",
        "1 tablespoon unsalted butter, softened",
        "2 tablespoons fresh lemon juice",
        "1/2 teaspoon coarse salt",
        "1 teaspoon unflavored gelatin",
        "2 tablespoons water",
        "3 tablespoons salmon roe",
        "1/4 cup fresh dill sprigs, chopped coarse",
        "3 tablespoons black sesame seeds**",
        "*available at fish markets and deli counters of many supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "No-Cook",
        "Buffet",
        "Lemon",
        "Trout",
        "Chill",
        "Dill",
        "Gourmet"
    ],
    "title": "Smoked Trout Mousse",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-trout-mousse-13606"
}
