{
    "directions": [
        "Prepare the smoker according to manufacturer's directions.",
        "Place shrimp, juice of half a lime, garlic powder, celery salt, smoked paprika, cayenne pepper, and ground chipotle powder in a bowl, stir to coat shrimp, and marinate in refrigerator for at least 1 hour.",
        "Transfer shrimp to a large piece of aluminum foil, fold the foil over the shrimp, and fold the edges over several times to make a packet. Cut several slits in the top of the aluminum packet.",
        "Place the aluminum packet of shrimp onto the rack in the smoker. Place remaining lime half onto the rack. Smoke the shrimp and lime until shrimp are cooked through, 20 to 30 minutes.",
        "Remove aluminum packet and lime half from smoker; cut each shrimp into 4 pieces and transfer to a large bowl. Squeeze the juice from the smoked lime over the shrimp.",
        "Bring water to a boil in a saucepan over medium heat. Stir in grits, reduce heat to low, and simmer until thickened, about 5 minutes. Stir half-and-half into the grits until they are are workable and the consistency of mayonnaise.",
        "Stir chopped chipotle pepper, adobo sauce, and cilantro into the grits; set grits mixture aside.",
        "Melt butter in a skillet over medium heat; cook and stir red onion in the hot butter until translucent, about 4 minutes. Stir in garlic and cook until fragrant, about 30 seconds. Allow onion and garlic to cool; stir into the smoked shrimp.",
        "Mix cooked grits into smoked shrimp; stir 1/4 cup panko crumbs into the mixture to make it stiff enough to hold its shape. Chill for 30 minutes to 1 hour to allow mixture to set up.",
        "Pour remaining 2 cups panko crumbs into a shallow bowl. Scoop about 2 tablespoons of the grits mixture, form into a small patty, and lightly press into the panko crumbs to coat both sides. Set patties aside.",
        "Heat olive oil in a large skillet over medium heat until oil shimmers.",
        "Pan-fry the grits cakes until golden brown on both sides, 3 to 4 minutes per side. Keep finished patties warm while remaining cakes finish cooking."
    ],
    "ingredients": [
        "8 large shrimp, peeled and deveined",
        "1/2 fresh lime, juiced",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon celery salt",
        "1/2 teaspoon smoked paprika",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon ground dried chipotle pepper",
        "1/2 fresh lime",
        "1 1/2 cups water",
        "1/2 cup quick-cooking grits",
        "1 tablespoon half-and-half, or as needed",
        "1 chipotle pepper in adobo sauce, finely chopped",
        "1 tablespoon adobo sauce from chipotle peppers",
        "1/4 cup finely chopped cilantro",
        "1 tablespoon butter",
        "1/2 red onion, finely diced",
        "2 cloves garlic, crushed",
        "2 1/4 cups panko bread crumbs, divided",
        "1 cup olive oil for frying, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Smoked Shrimp and Grit Cakes",
    "url": "http://allrecipes.com/recipe/220899/smoked-shrimp-and-grit-cakes/"
}
