{
    "directions": [
        "In a heatproof bowl pour enough boiling water over tomatoes to cover and let stand 20 to 30 minutes, or until soft. Drain tomatoes and pat dry.",
        "Cut loaf diagonally into 4 pieces and halve each piece horizontally. Spread pesto on cut sides of bread and make 4 sandwiches with chicken, tomatoes, and arugula.",
        "To a food processor with motor running add garlic and blend until minced. Add basil, parsley, and nuts and blend well. Add oil and blend until smooth. Transfer pesto to a bowl and stir in olives. Pesto may be made 5 days ahead and chilled, surface covered tightly with plastic wrap.",
        "Bring pesto to room temperature before using. Makes about 3/4 cup."
    ],
    "ingredients": [
        "3 ounces dried tomatoes (about 3/4 cup), not packed in oil",
        "a long loaf (about 20 inches) French or Italian bread",
        "about 1/2 cup basil olive pesto",
        "6 to 8 ounces smoked chicken breast, sliced thin",
        "1/2 bunch arugula, trimmed, washed well, and spun dry (about 1 cup)",
        "Can be prepared in 45 minutes or less.",
        "1 large garlic clove",
        "1 cup packed fresh basil leaves, washed well and spun dry",
        "1 cup packed fresh parsley leaves (preferably flat-leaf), washed well and spun dry",
        "1/3 cup pine nuts",
        "1/4 cup olive oil",
        "1/4 cup Kalamata or other brine-cured black olives, pitted and chopped fine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Food Processor",
        "Chicken",
        "Olive",
        "Tomato",
        "Lunch",
        "Basil",
        "Arugula",
        "Summer",
        "Chill",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Smoked Chicken and Sun-Dried Tomato Sandwiches with Basil Olive Pesto",
    "url": "http://www.epicurious.com/recipes/food/views/smoked-chicken-and-sun-dried-tomato-sandwiches-with-basil-olive-pesto-10141"
}
