{
    "directions": [
        "Preheat oven to 350°F. Finely grind graham crackers, toasted almonds and 3 tablespoons sugar in processor. Add 1/2 cup melted butter; process mixture until moist crumbs form. Press graham cracker mixture onto bottom and up sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Bake crust until edges are golden, about 12 minutes. Cool graham cracker crust completely.",
        "Spread 2 cups softened ice cream in crust. Spoon 3/4 cup cooled Fudge Sauce over. Freeze until sauce is just set, about 10 minutes. Refrigerate or freeze remaining ice cream as necessary to prevent ice cream from melting. Repeat layering with 2 cups ice cream, then 3/4 cup sauce. Freeze until sauce is just set. Spread remaining 2 cups ice cream over. Cover and freeze cake overnight. Refrigerate remaining Fudge Sauce.",
        "Preheat broiler. Warm remaining Fudge Sauce in small saucepan over low heat. Remove from heat. Place cake in pan on baking sheet. Spread marshmallow creme over top of cake. Sprinkle miniature marshmallows over in single layer. Broil just until marshmallows are deep brown, watching closely to avoid burning, about 1 minute. Run knife between pan sides and cake to loosen. Remove pan sides. Cut cake into wedges. Serve cake immediately with warm Fudge Sauce."
    ],
    "ingredients": [
        "16 whole graham crackers (about 8 ounces)",
        "1 cup whole almonds, toasted",
        "3 tablespoons sugar",
        "1/2 cup (1 stick) unsalted butter, melted",
        "1 1/2 quarts coffee ice cream, softened until spreadable",
        "Fudge Sauce",
        "1 7-ounce jar marshmallow creme",
        "2 cups miniature marshmallows"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Dairy",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Backyard BBQ",
        "Almond",
        "Fall",
        "Spring",
        "Birthday",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "S'mores Coffee and Fudge Ice Cream Cake",
    "url": "http://www.epicurious.com/recipes/food/views/smores-coffee-and-fudge-ice-cream-cake-102836"
}
