{
    "directions": [
        "Preheat oven to 350°F. Spray 9-inch-diameter metal pie pan with nonstick spray. Mix graham cracker crumbs and melted butter in bowl to blend. Transfer to prepared pie pan. Press crumb mixture onto bottom and up sides of pan. Bake until crust is set and golden, about 11 minutes. Cool completely.",
        "Using offset spatula, spread half of softened ice cream evenly in crust. Sprinkle 1 cup chopped chocolate-covered graham crackers evenly over. Spread remaining ice cream over, covering graham crackers completely. Freeze until firm, at least 4 hours.",
        "Drop marshmallow creme by tablespoonfuls over top of pie. Using moistened fingertips, spread in even layer, covering top of pie completely. Sprinkle mini marshmallows evenly over, pressing slightly to adhere. Cover and freeze until firm, about 4 hours.",
        "Bring whipping cream to boil in heavy small saucepan. Remove from heat. Add chocolate; let stand 2 minutes to soften, then whisk until melted and smooth. (Pie and sauce can be made 3 days ahead. Keep pie frozen. Cover and chill sauce; rewarm sauce over low heat just until pourable before serving.)",
        "Preheat broiler. Cover pie crust edges with foil collar. Broil pie just until marshmallows are golden brown, watching closely to avoid burning and rotating pan to brown evenly if necessary, about 2 minutes. Transfer pie to platter and serve immediately with warm sauce."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 1/2 cups graham cracker crumbs",
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "1 quart chocolate ice cream, slightly softened until spreadable",
        "2 cups coarsely chopped chocolate-covered graham crackers",
        "1 1/2 cups marshmallow creme",
        "2 cups mini marshmallows",
        "1/2 cup whipping cream",
        "5 ounces imported milk chocolate, finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Thanksgiving",
        "Winter",
        "Family Reunion",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "S'mores Ice Cream Pie with Warm Milk Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/smores-ice-cream-pie-with-warm-milk-chocolate-sauce-107666"
}
