{
    "directions": [
        "Whisk all-purpose flour, whole wheat flour, cinnamon, baking soda, and salt in a small bowl.",
        "Using an electric mixer on high speed, beat butter, brown sugar, and granulated sugar in a large bowl until pale and fluffy, 2–3 minutes. Add honey and beat on medium to combine. Add egg, egg yolk, and vanilla and beat to combine, scraping down sides as needed. Reduce speed to low and gradually add dry ingredients, scraping down sides as needed, until just blended, then stir in half of the chocolate. Cover dough and chill at least 1 hour or up to overnight.",
        "Arrange racks in middle and upper third of oven and preheat to 375°F. Line 2 rimmed baking sheets with parchment or wax paper. Scoop out dough by the heaping tablespoonful, roll into a balls, and arrange 3 inches apart, 6 on each sheet.",
        "Bake cookies, swapping the trays and rotating them once halfway through, until golden, 10–11 minutes. Transfer cookies to a wire rack to cool and repeat with second batch. Let cookies cool.",
        "Place remaining 8 ounces chocolate in a microwave-safe bowl and heat 30 seconds. Stir, then heat 30 seconds more. Repeat until chocolate is melted through. Turn cookies over and, using a small spatula, spread a thin layer of chocolate on flat sides of cookies. Chill cookies to let chocolate set, at least 15 minutes.",
        "Place marshmallows onto skewers and toast over a flame. Place 2 toasted marshmallows on chocolate side of 1 cookie and top with chocolate side of another cookie to make a sandwich. Repeat with remaining marshmallows and cookies.",
        "Cookies can be baked, covered with chocolate, and chilled (without marshmallows) in an airtight container for up to 5 days or frozen for up to 1 month."
    ],
    "ingredients": [
        "3/4 cup all-purpose flour",
        "3/4 cup whole wheat flour",
        "1 1/2 teaspoons ground cinnamon",
        "3/4 teaspoon baking soda",
        "3/4 teaspoon kosher salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "3/4 cup (packed) dark brown sugar",
        "2 tablespoons granulated sugar",
        "6 tablespoons honey",
        "1 large egg",
        "1 egg yolk",
        "1 teaspoon vanilla extract",
        "16 ounces bittersweet chocolate, coarsely chopped (about 3 cups), divided",
        "24 marshmallows"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Spring",
        "Summer",
        "Grill/Barbecue",
        "Honey",
        "Marshmallow",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "S'mores Sandwich Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/smores-sandwich-cookies-56389706"
}
