{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Mix crumbs and sugar in medium bowl. Add melted butter; stir until mixture is evenly moistened. Press onto bottom of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Bake until set, about 12 minutes. Remove from oven; cool. Reduce oven temperature to 325°F.",
        "Stir chocolate in top of double boiler set over barely simmering water until smooth. Remove from over water and cool to lukewarm, stirring occasionally.",
        "Combine cream cheese, sugar, and salt in processor and blend until smooth. With motor running, add whipping cream through feed tube and process just until blended. With motor running, add melted chocolate, then add eggs 1 at a time, blending and scraping down sides after each addition until mixture is smooth. Pour batter over crust in pan.",
        "Bake cake until outer edge is slightly puffed and cake is barely set in center (center will look shiny and move slightly when pan is gently shaken), about 55 minutes. Transfer cake to rack. Run small sharp knife around cake to loosen. Chill uncovered until cold, 8 hours or overnight. DO AHEAD: Can be made 2 days ahead. Cover and keep refrigerated.",
        "Whisk sugar, egg whites, 3 tablespoons water, cream of tartar, and 1/8 teaspoon salt to blend in large metal bowl. Set bowl over saucepan of simmering water; whisk constantly until sugar dissolves and mixture thickens and is hot to touch, about 3 minutes. Remove bowl from over water and stir in marshmallows (keep water simmering in saucepan). Let stand until marshmallows soften, about 3 minutes. Set bowl with mixture over simmering water; using hand held electric mixer, beat until stiff shiny peaks form, about 4 minutes. Beat in vanilla.",
        "Scrape topping onto cheesecake. Using offset metal spatula, spread topping to edges of cake, swirling decoratively. Let stand until set, about 15 minutes.",
        "Using kitchen torch, lightly brown topping in spots. (Or preheat broiler; place cake at least 4 inches from heat source and broil just until topping is lightly browned in spots, watching closely to avoid burning, about 2 minutes.) Chill cake until cold. DO AHEAD: Can be made 1 day ahead. Cover with cake dome and keep chilled. Remove pan sides. Place cake on platter.",
        "Mix raspberries and blueberries in medium bowl. Cut cake into wedges. Serve berry mixture alongside."
    ],
    "ingredients": [
        "1 1/2 cups graham cracker crumbs (made from 9 whole crackers finely ground in processor; 1 packet)",
        "3 tablespoons sugar",
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "9 ounces high-quality milk chocolate (such as Lindt or Ghirardelli), chopped",
        "2 8-ounce packages cream cheese, room temperature",
        "3/4 cup sugar",
        "1/8 teaspoon salt",
        "3/4 cup heavy whipping cream",
        "3 large eggs",
        "1 cup sugar",
        "2 large egg whites",
        "3 tablespoons water",
        "1 teaspoon cream of tartar",
        "1/8 teaspoon salt",
        "12 large marshmallows, cut into quarters with wet kitchen scissors",
        "1/2 teaspoon vanilla extract",
        "1 1-pint container fresh raspberries",
        "1 1-pint container fresh blueberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Food Processor",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Kid-Friendly",
        "Cream Cheese",
        "Blueberry",
        "Raspberry",
        "Summer",
        "Chill",
        "Double Boiler",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "S'mores Cheesecake with Summer Berries",
    "url": "http://www.epicurious.com/recipes/food/views/smores-cheesecake-with-summer-berries-242718"
}
