{
    "directions": [
        "Preheat the oven to 350 degrees F. Line a 13 by 9-inch baking pan with foil, with the ends of the foil extending over the sides of the pan. Spray lightly with cooking spray.",
        "Mix the graham cracker crumbs, butter, and brown sugar in a medium bowl. Press them firmly onto the bottom of the prepared pan and bake for 10 to 15 minutes.",
        "Remove the crust from the oven and lower the temperature to 300 degrees F.",
        "With an electric hand mixer, beat the cream cheese, marshmallow cream, sugar, and the vanilla in large bowl until well blended. Add the eggs, 1 at a time, mixing on low speed after each addition just until blended. Add the flour and mix well. Pour over crust and bake for 50 minutes.",
        "Remove the cheesecake from the oven and top with chocolate chips and miniature marshmallows. Using a handheld torch, char the marshmallows and lightly melt the chocolate. Remove the cheesecake from the pan using the foil handles before cutting into squares. Garnish each bar with a sprinkling of coarse graham cracker pieces."
    ],
    "ingredients": [
        "Nonstick cooking spray",
        "2 cups crushed graham crackers (16 to 18 crackers), plus a few coarsely chopped, for garnish",
        "1/4 cup butter, melted",
        "3 tablespoons brown sugar",
        "3 (8-ounce) packages cream cheese, softened",
        "8 ounces marshmallow cream (preferred brand fluff)",
        "1 cup sugar",
        "1 tablespoon vanilla extract",
        "4 eggs",
        "3 tablespoons all-purpose flour",
        "1 cup semisweet chocolate chips, for top",
        "1 cup mini marshmallows, for top"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Chocolate Cheesecake",
        "Chocolate"
    ],
    "title": "S'mores Cheesecake Bars",
    "url": "http://www.foodnetwork.com/recipes/aaron-mccargo-jr/smores-cheesecake-bars-recipe"
}
