{
    "directions": [
        "Heat 2 tablespoons butter plus 2 tablespoons oil in each of 2 skillets over medium heat.",
        "Put the onion and pepper slices in one skillet and cook until browned and caramelized, about 10 minutes.",
        "Meanwhile, whisk together the seasoned salt, lemon pepper, cumin, cayenne pepper, salt, black pepper and 1/2 cup of the flour in a pie plate. Dredge the pork chops in the flour mixture.",
        "Fry the chops in batches in the other skillet until well browned, 2 to 3 minutes per side. Remove the chops from the skillet and set aside.",
        "To this skillet, add the remaining 3 tablespoons butter and 3 tablespoons flour. Stir and cook until the roux gets some color on it, about 2 minutes. Whisk in the stock a bit at a time, working out all the lumps, then add the cream. Add the onions and peppers, coating them in the sauce.",
        "Serve with plenty of sauce and the caramelized onions/peppers and accompany with the Smashed Red Potatoes.",
        "Put the potatoes in a glass or microwavable bowl and microwave according to the manufacturer's instructions, 5 to 10 minutes. Carefully remove the bowl and smash the potatoes with a fork. Add the butter, salt and pepper, then smash again. Cover with a towel until ready to serve."
    ],
    "ingredients": [
        "7 tablespoons salted butter",
        "4 tablespoons olive oil",
        "1 large onion, sliced",
        "1 green bell pepper, sliced",
        "1 red bell pepper, sliced",
        "1 teaspoon seasoned salt",
        "1 teaspoon lemon pepper",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon cayenne pepper",
        "Pinch kosher salt",
        "Pinch freshly ground black pepper",
        "1/2 cup plus 3 tablespoons all-purpose flour",
        "6 to 8 thin-cut breakfast pork chops",
        "1 1/2 cups low-sodium chicken stock",
        "1 tablespoon cream",
        "Smashed Red Potatoes, recipe follows, for serving",
        "6 large red potatoes",
        "6 tablespoons salted butter",
        "Pinch kosher salt",
        "Pinch freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pork Chop",
        "Meat",
        "Pork",
        "Main Dish Recipes"
    ],
    "title": "Smothered Pork Chops",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/smothered-pork-chops"
}
