{
    "directions": [
        "Heat 2 tablespoons oil in heavy medium skillet over medium-high heat. Add shallots and garlic; sauté 30 seconds. Add clam juice, cream, wine, orange juice, sun-dried tomatoes, lime juice, herbes de Provence, Worcestershire sauce, 1/2 teaspoon orange peel, and lime peel; boil until sauce is reduced to 1 1/2 cups, stirring occasionally, about 10 minutes. (Sauce can be made 1 day ahead. Cover and refrigerate. Rewarm before using.)",
        "Place flour in shallow dish. Sprinkle snapper fillets with salt and pepper. Dredge snapper in flour, turning to coat; shake off excess. Heat remaining 2 tablespoons oil in heavy large skillet over medium-high heat. Add snapper and cook until brown and cooked through, about 4 minutes per side. Transfer to plate. Add sauce to skillet and bring to simmer.",
        "Meanwhile, cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain well. Return pasta to pot. Add half of sauce and toss to coat.",
        "Divide pasta equally among 4 plates. Top with snapper, then drizzle with sauce and sprinkle with basil and additional minced orange peel.",
        "A dried herb mixture available at specialty foods stores and in the spice section of some supermarkets. If unavailable, a combination of dried thyme, basil, savory, and fennel seeds can be substituted."
    ],
    "ingredients": [
        "4 tablespoons olive oil",
        "4 shallots, thinly sliced (about 1/2 cup)",
        "2 garlic cloves, chopped",
        "1 8-ounce bottle clam juice",
        "3/4 cup whipping cream",
        "1/2 cup white wine",
        "1/2 cup fresh orange juice",
        "2 tablespoons diced drained oil-packed sun-dried tomatoes",
        "1 tablespoon fresh lime juice",
        "1 teaspoon herbes de Provence* or salad herbs",
        "1 teaspoon Worcestershire sauce",
        "1/2 teaspoon grated orange peel",
        "1/2 teaspoon grated lime peel",
        "All purpose flour",
        "4 5- to 6-ounce red snapper fillets",
        "8 ounces angel hair pasta",
        "2 tablespoons thinly sliced fresh basil",
        "Additional minced orange peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Citrus",
        "Dairy",
        "Fish",
        "Garlic",
        "Pasta",
        "Sauté",
        "Quick & Easy",
        "Orange",
        "Snapper",
        "Summer",
        "Pan-Fry"
    ],
    "title": "Snapper on Angel Hair with Citrus Cream",
    "url": "http://www.epicurious.com/recipes/food/views/snapper-on-angel-hair-with-citrus-cream-106631"
}
