{
    "directions": [
        "Preheat oven to 375 degrees F. Line two cookie sheets with Reynolds(R) Parchment Paper.",
        "Beat the butter with an electric mixer on medium to high speed for 30 seconds in a large mixing bowl. Add 1 1/2 cups sugar, baking soda, cream of tartar, and salt. Beat until combined, scraping the sides of the bowl occasionally. Add the eggs, one at a time, beating after each addition just until combined. Beat in the vanilla. Beat in as much of the flour as you can with the mixer. Using a wooden spoon, stir in any remaining flour and the pecans. Cover and chill about 1 hour or until the dough is easy to handle.",
        "Combine 1/4 cup sugar, cinnamon, and nutmeg in a small bowl.",
        "Shape dough into 1 1/2-inch balls. Roll the balls in the sugar mixture to coat. Arrange 2 inches apart on the prepared cookie sheets. Flatten the dough balls slightly.",
        "Bake 8 to 10 minutes or until edges are firm and bottoms are very light brown. Let cool on the cookie sheets for 2 minutes. Slide the parchment paper with baked cookies on it to wire racks and let cool completely. Once cooled, slide the parchment paper onto a work surface.",
        "Spread Cinnamon Buttercream Frosting onto the flat side of half of the cookies. Top with remaining cookies, flat-sides down.",
        "Cinnamon Buttercream Frosting: Beat butter with an electric mixer on medium speed in a large mixing bowl until smooth. Add 2 cups powdered sugar, beating well. Beat in 1/4 cup milk, cinnamon, and vanilla. Gradually beat in 6 cups more powdered sugar. Beat in 2 to 4 teaspoons more milk until the frosting is of spreading consistency."
    ],
    "ingredients": [
        "1 cup butter, softened",
        "1 3/4 cups sugar, divided",
        "1 teaspoon baking soda",
        "1 teaspoon cream of tartar",
        "1/4 teaspoon salt",
        "2 eggs",
        "1 teaspoon vanilla",
        "3 cups all-purpose flour",
        "1/2 cup chopped pecans, toasted",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "Cinnamon Buttercream Frosting:",
        "2/3 cup butter, softened",
        "8 cups powdered sugar, divided, or more as needed",
        "1/4 cup milk, plus more as needed",
        "1 teaspoon ground cinnamon",
        "1 teaspoon vanilla"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Snickerdoodle Sandwich Cookies",
    "url": "http://allrecipes.com/recipe/238761/snickerdoodle-sandwich-cookies/"
}
