{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch pan. Sift together the flour, baking powder and salt. Set aside.",
        "In a large bowl, cream together the butter and 1 1/2 cups sugar until light and fluffy. Beat in the flour mixture alternately with the milk, mixing just until incorporated. Stir in the 1/2 teaspoon vanilla and lemon extracts.",
        "In a large glass or metal mixing bowl, beat 5 egg whites until stiff peaks form. Fold 1/3 of the whites into the batter, then quickly  fold in remaining whites until no streaks remain.",
        "Pour batter into prepared pan. Bake in the preheated oven for 45 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.",
        "To make the Fluffy White Frosting:  Combine 1 1/2 cups sugar, 2 egg whites, corn syrup, and cream of tartar in the top of a double boiler. Add cold water and beat on low speed of electric mixer just until blended.  Place over boiling water and beat constantly on high speed about 3 minutes or until soft peaks form. Remove from heat and place over cold water. Add vanilla and beat an additional 3 minutes or until frosting is thick enough to spread.",
        "To make the snowballs: Cut cake into 2-inch squares. Trim corners of each square, leaving rounded edges. Spread top and sides with frosting. Sprinkle coconut generously over frosting."
    ],
    "ingredients": [
        "1 cup butter",
        "2 cups white sugar",
        "3 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/8 teaspoon salt",
        "1 cup milk",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon lemon extract",
        "5 egg whites",
        "1 1/2 cups white sugar",
        "2 egg whites",
        "1 tablespoon light corn syrup",
        "1/4 teaspoon cream of tartar",
        "1/4 cup water",
        "1 teaspoon vanilla extract",
        "4 cups flaked coconut"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Snowball Cake II",
    "url": "http://allrecipes.com/recipe/19096/snowball-cake-ii/"
}
