{
    "directions": [
        "Preheat oven to 350°F.",
        "Drop nuts into boiling water and cook 2 minutes. Drain in a colander and transfer to a bowl of ice and water to stop cooking. Drain in colander again. Peel off skins and pat nuts dry, then spread in 1 layer in a shallow baking pan.",
        "Bake in middle of oven until dry and lightly toasted, about 7 minutes, then cool. Coarsely chop 2 tablespoons nuts and leave remaining nuts whole.",
        "Finely grind whole pistachios with 2 tablespoons sugar in a food processor. Add 3 tablespoons milk and process to a paste. Blend in 5 tablespoons milk and transfer pistachio cream to a bowl. Chill, covered, 8 hours.",
        "Whisk together 2 tablespoons sugar and remaining 3 1/2 cups milk in a deep 12-inch skillet and bring to a bare simmer (milk should steam but not bubble).",
        "While milk is heating, beat whites with lemon juice and a pinch of salt in a large bowl with an electric mixer at medium speed until they just hold soft peaks. Gradually beat in 1/2 cup plus 2 tablespoons sugar, a little at a time, and beat until meringue just holds stiff peaks.",
        "Using an oval-shaped ice cream scoop or an oval soupspoon, form 8 meringue \"eggs,\" gently dropping them as formed into milk mixture (keep milk at a bare simmer). Poach meringues until set on bottom, about 2 minutes, then carefully turn over and poach until set throughout, about 2 minutes more. Transfer with a slotted spoon to a plastic-wrap-lined shallow baking pan and make 8 more meringues in same manner.",
        "Pour poaching liquid through a very fine sieve into a large glass measure. Whisk together yolks, remaining 2 tablespoons sugar, and a pinch of salt in a 2-quart heavy saucepan, then slowly add poaching liquid, whisking constantly. Cook custard over moderately low heat, stirring constantly with a wooden spoon, until it's thick enough to coat back of spoon and registers 170 to 175°F on an instant-read thermometer (do not boil).",
        "Pour custard into a metal bowl and stir in pistachio cream and almond extract. Set bowl in a larger bowl of ice and cold water and cool custard, stirring occasionally. Pour custard through very fine sieve into another bowl, pressing on and discarding solids.",
        "Melt chocolate in a small metal bowl set over a small saucepan of barely simmering water, stirring occasionally, until smooth.",
        "Pour custard into 8 shallow bowls or rimmed plates and arrange meringues on top. Drizzle chocolate over meringues and custard and sprinkle with chopped pistachios."
    ],
    "ingredients": [
        "1/2 cup plus 2 tablespoons shelled unsalted pistachios (not dyed red, preferably raw)",
        "1 cup sugar",
        "1 quart whole milk",
        "4 large eggs, separated",
        "1 teaspoon fresh lemon juice",
        "3 drops almond extract",
        "2 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Pistachio",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Snow Eggs with Pistachio Custard and Chocolate Drizzle",
    "url": "http://www.epicurious.com/recipes/food/views/snow-eggs-with-pistachio-custard-and-chocolate-drizzle-106287"
}
