{
    "directions": [
        "Preheat oven to 350° F.",
        "In a small bowl stir together hoisin, sugar, five-spice powder, and 1 teaspoon soy sauce. In a small glass baking dish brush pork with hoisin mixture and roast in middle of oven 40 minutes, or until a thermometer inserted in center registers 160° F. Let pork stand on a cutting board 15 minutes. Cut pork crosswise into thin slices and halve slices diagonally.",
        "In a large saucepan skim any fat from surface of broth and bring broth to a boil with gingerroot, star anise, garlic, and remaining tablespoon soy sauce. Remove pan from heat and steep broth, covered, 30 minutes. Pour broth through a sieve into another large saucepan.",
        "While broth is steeping, in a 5-quart kettle bring 3 1/2 quarts salted water to a boil and add noodles. When water returns to boil add 1 cup cold water and bring to boil again. Repeat procedure and simmer noodles 5 minutes, or until just tender. In a colander drain noodles and rinse under cold water. Drain noodles well and divide among 4 large soup bowls.",
        "Bring broth to a boil. Cut bok choy crosswise into 1/8-inch slices and add to broth. Simmer mixture 2 minutes, or until bok choy is risp-tender. Divide pork, bok choy, and broth among bowls."
    ],
    "ingredients": [
        "1 tablespoon hoisin sauce",
        "1 tablespoon sugar",
        "1 1/2 teaspoons Chinese five-spice powder",
        "1 tablespoon plus 1 teaspoon soy sauce",
        "a 3/4-pound piece well trimmed boneless pork loin",
        "8 cups chicken broth",
        "six 1/8-inch slices peeled fresh gingerroot",
        "3 star anise",
        "2 large garlic cloves",
        "1/2 pound dried soba noodles",
        "1/2 pound bok choy (about 1/2 small head)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Ginger",
        "Pasta",
        "Pork",
        "Roast",
        "Spice",
        "Winter",
        "Anise",
        "Bok Choy",
        "Simmer",
        "Gourmet"
    ],
    "title": "Soba Noodle Soup with Roast Pork and Bok Choy",
    "url": "http://www.epicurious.com/recipes/food/views/soba-noodle-soup-with-roast-pork-and-bok-choy-14014"
}
