{
    "directions": [
        "Warm vinegar, sugar, and salt in small saucepan over medium heat, stirring occasionally until sugar dissolves, about 1 minute. Stir in garlic and jalapeño. Cool. Mix in lime juice, sesame oil, and lime peel.",
        "Cook noodles in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain well. Rinse under cold water; drain again. Transfer noodles to dish-towel-lined platter to drain. Transfer noodles to large bowl. Add dressing and toss to coat. (Can be prepared 6 hours ahead. Cover and refrigerate.)",
        "Add cucumber, mango, basil, and mint to noodles and toss gently. Arrange salad on platter. Sprinkle with chopped peanuts. Garnish with lime wedges. (Can be made 2 hours ahead. Cover and let stand at room temperature.)"
    ],
    "ingredients": [
        "3/4 cup rice vinegar",
        "1/4 cup sugar",
        "3/4 teaspoon salt",
        "3 large garlic cloves, chopped",
        "1 red jalapeño or serrano chile, seeded, chopped",
        "3 tablespoons fresh lime juice",
        "1 tablespoon oriental sesame oil",
        "1 1/2 teaspoons grated lime peel",
        "12 ounces green soba or chuka soba (Japanese-style) noodles",
        "1 large English hothouse cucumber, halved lengthwise, thinly sliced crosswise",
        "1 large ripe mango, peeled, halved, pitted, thinly sliced crosswise",
        "1 cup chopped fresh basil",
        "1 cup chopped fresh mint",
        "1 cup chopped toasted salted peanuts",
        "Lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fruit",
        "Pasta",
        "Vegetable",
        "Appetizer",
        "Super Bowl",
        "Mango",
        "Cucumber",
        "Winter",
        "Party",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Soba Noodle Salad with Cucumber and Mango",
    "url": "http://www.epicurious.com/recipes/food/views/soba-noodle-salad-with-cucumber-and-mango-109064"
}
