{
    "directions": [
        "In a 6-quart kettle bring 5 quarts salted water to a boil for noodles.",
        "Peel and cut pear into matchstick pieces.",
        "In a large non-stick skillet heat 1 tablespoon vegetable oil over moderately high heat and brown tofu. Transfer tofu with a slotted spoon to paper towels to drain and season with salt and pepper.",
        "Add carrots to skillet and sauté, stirring, until just tender and golden brown. Transfer carrots with slotted spoon to a bowl. Add to skillet remaining 2 tablespoons vegetable oil, mushrooms, scallions, gingerroot, and pear and cook over moderate heat, stirring constantly, until vegetables are tender. Remove skillet from heat and stir in carrots.",
        "Cook noodles in boiling water until al dente. Drain noodles in a colander and immediately rinse with cold water. In a large bowl toss noodles with 1 teaspoon sesame oil.",
        "Return skillet to moderate heat and add 1/4 cup water, tamari or soy sauce, vinegar, and remaining teaspoon sesame oil. Bring mixture to a simmer and cook, stirring, until hot. Add noddles, tossing to combine and adding more water if necessary, and cook until heated through. Season noodles with salt and pepper and serve warm topped with tofu and sesame seeds."
    ],
    "ingredients": [
        "an 8-ounce package soba (buckwheat noodles)*",
        "1 Asian or Bosc pear",
        "3 tablespoons vegetable oil",
        "a 1/2-pound piece firm tofu, rinsed, patted dry, hard edges trimmed, and cut into 1/2-inch cubes",
        "4 carrots, cut into 1 1/2-by 1/4-inch sticks",
        "1/2 pound fresh shiitake mushrooms, stems discarded and caps sliced thin",
        "4 scallions, sliced thin (about 1 1/2 cups)",
        "2 tablespoons finely chopped peeled fresh ginger",
        "2 teaspoons sesame oil",
        "1 tablespoon tamari or soy sauce, or to taste",
        "2 tablespoons seasoned rice vinegar",
        "1 tablespoon sesame seeds, toasted lightly",
        "*available at Asian markets and natural foods stores"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Mushroom",
        "Soy",
        "Vegetable",
        "Stir-Fry",
        "Vegetarian",
        "Pear",
        "Noodle",
        "Sesame",
        "Gourmet"
    ],
    "title": "Soba Noodles with Vegetables, Crispy Tofu, and Toasted Sesame Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/soba-noodles-with-vegetables-crispy-tofu-and-toasted-sesame-seeds-11438"
}
