{
    "directions": [
        "In a saucepan bring the water to a boil with the kombu, simmer the kombu for 2 minutes, and remove it with tongs, discarding it. Stir in the bonito flakes and simmer the mixture, stirring occasionally, for 3 minutes. Stir in the soy sauce, the mirin, and the sugar and simmer the broth for 5 minutes. Strain the broth through a fine sieve into a heatproof bowl and pour it back into the pan.",
        "In a kettle of salted boiling water cook the noodles for 3 to 5 minutes, or until they are al dente, being careful not to overcook them, drain them in a colander, and rinse them under cold water.",
        "Add the carrots to the broth and simmer them, covered, for 5 minutes. Stir in the spinach and the tofu and simmer the soup for 1 minute. In a small bowl stir together well 1/2 cup of the soup broth and the miso and pour the mixture back into the pan. Divide the noodles among 6 large bowls, ladle the soup over them, and sprinkle each serving with some of the scallions."
    ],
    "ingredients": [
        "7 cups water",
        "a 6-inch length of kombu * (dried kelp), wiped with a dampened cloth",
        "1 ounce (about 2 cups) dried bonito flakes*",
        "1/2 cup soy sauce",
        "3 tablespoons mirin * (syrup rice wine)",
        "1 tablespoon sugar",
        "1/2 pound dried soba* (buckwheat noodles)",
        "2 carrots, sliced thin",
        "1/2 pound spinach, coarse stems discarded and the leaves washed well, spun dry, and cut crosswise into 1 1/2-inch-wide strips",
        "8 to 10 ounces firm tofu (preferably silken), cut into 1/2-inch cubes",
        "3 to 4 tablespoons miso* (fermented bean paste), or to taste, if desired",
        "2 scallions, minced",
        "*available at Japanese markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Wine",
        "Pasta",
        "Tofu",
        "Spinach",
        "Fall",
        "Soy Sauce",
        "Simmer",
        "Gourmet"
    ],
    "title": "Soba Soup with Spinach and Tofu",
    "url": "http://www.epicurious.com/recipes/food/views/soba-soup-with-spinach-and-tofu-12716"
}
