{
    "directions": [
        "In a bowl, whisk together the sugar, sake, mirin, and rice vinegar until the sugar is completely dissolved. Add the white miso, ginger, and 1 tablespoon of the oil and whisk until well combined. Set the miso glaze aside.",
        "Bring a large pot of water to a boil over high heat and cook the noodles until tender yet firm, about 3 minutes. Drain, shock under cold running water, and drain again.",
        "Heat a well-oiled grill pan over medium heat. Brush the asparagus and scallops with all or most of the remaining 3 tablespoons of oil and season with salt and pepper to taste. Grill the asparagus first until just tender, 3 to 5 minutes total, rolling them about to heat them evenly all around. Divide and top each noodle serving with asparagus. Grill the scallops in the same pan until cooked through and crisp on each side, about 2 minutes per side. Divide the scallops among the servings of noodles, and spoon some miso glaze over each. Serve garnished with toasted walnuts."
    ],
    "ingredients": [
        "3 tablespoons sugar",
        "1/4 cup sake",
        "3 tablespoons mirin",
        "2 tablespoons rice vinegar",
        "1/3 cup white miso",
        "1 tablespoon finely grated ginger",
        "1/4 cup vegetable oil",
        "10 ounces dried soba noodles",
        "36 medium asparagus spears, coarse woody ends snapped or cut off",
        "18 sea scallops",
        "Kosher salt and freshly ground black pepper",
        "12 walnut halves, lightly toasted and coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Vegetable",
        "Dinner",
        "Seafood",
        "Scallop",
        "Asparagus",
        "Sake",
        "Grill/Barbecue",
        "Healthy",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free"
    ],
    "title": "Soba with Grilled Asparagus and Sea Scallops with Sweet Miso Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/soba-with-grilled-asparagus-and-sea-scallops-with-sweet-miso-sauce-354711"
}
