{
    "directions": [
        "Cut chicken into 1/2-inch-wide strips, then cook in a 5- to 6-quart pot of boiling salted water , stirring occasionally, until just cooked through, 1 to 2 minutes. Transfer chicken with a slotted spoon to a bowl (drain any excess liquid), reserving water in pot.",
        "Return water to a boil, then cook noodles, stirring occasionally, until just tender, 4 to 8 minutes. Reserve 3/4 cup noodle-cooking water and drain noodles in a colander. Rinse noodles under cold water to stop cooking, then drain well.",
        "While noodles cook, cut cucumber lengthwise into julienne strips, slicing until you reach core, then rotating cucumber a quarter turn, continuing to slice and rotate until left with nothing but core. Pat dry.",
        "Whisk together peanut butter, soy sauce, sesame oil, chile paste, and reserved cooking water until smooth.",
        "Divide noodles among large serving bowls. Spoon about 1/4 cup peanut sauce over noodles in each bowl, then divide chicken, cucumber, and scallions among bowls. Serve immediately with remaining sauce and additional chile paste. Stir noodles just before eating."
    ],
    "ingredients": [
        "1 pound chicken cutlets or tenders",
        "1 pound soba noodles",
        "1/2 seedless cucumber (usually plastic-wrapped)",
        "2/3 cup creamy peanut butter (not natural)",
        "1/4 cup soy sauce",
        "1 tablespoon Asian sesame oil",
        "2 teaspoons Chinese chile garlic paste (preferably Lan Chi) or Sriracha (Southeast Asian chile sauce) plus additional for serving",
        "1/4 cup chopped scallions",
        "Special equipment: an adjustable-blade slicer with 1/4-inch julienne blade"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Nut",
        "Onion",
        "Pasta",
        "Soy",
        "Vegetable",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Peanut",
        "Gourmet",
        "Dairy Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Soba with Chicken and Peanut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/soba-with-chicken-and-peanut-sauce-238676"
}
