{
    "directions": [
        "Purée tomatillos, chiles, onion, garlic, salt, and water in a blender until smooth.",
        "Heat oil in a 10-inch heavy skillet over moderate heat until hot but not smoking, then carefully add tomatillo purée (oil will splatter) and simmer, stirring, until thickened, 8 to 10 minutes. Stir in cilantro and simmer 1 minute. Transfer to a small bowl.",
        "Put oven rack in middle position and preheat oven to 200°F.",
        "Heat 1 tablespoon oil in cleaned dried skillet over moderate heat until hot but not smoking, then briefly cook tortillas, 3 at a time, until softened and hot but still pale, about 10 seconds per side, adding more oil if necessary. Transfer tortillas with tongs to paper towels to drain briefly, then to a large shallow baking pan in oven to keep warm, arranging tortillas in one layer (overlapping slightly if necessary) and covering pan with foil.",
        "Spread each warm tortilla with about 1 teaspoon salsa, then top sparingly with a few shreds of chicken. Thin crema with a little water and drizzle over chicken, then sprinkle with onion and cheese. Serve immediately."
    ],
    "ingredients": [
        "1/2 lb fresh tomatillos, husks discarded and tomatillos rinsed and quartered",
        "3 fresh green serrano chiles, coarsely chopped (including seeds)",
        "1/4 cup chopped white onion",
        "3 garlic cloves, quartered",
        "3/4 teaspoon salt, or to taste",
        "1/2 cup water",
        "2 tablespoons vegetable oil",
        "3 tablespoons finely chopped fresh cilantro",
        "1 to 2 tablespoons vegetable oil",
        "12 (4-inch) corn tortillas (see cooks' note, below)",
        "1 cup shredded cooked chicken (from 1 chicken breast half)",
        "2 to 3 tablespoons crema or crème fraîche",
        "1/3 cup finely chopped white onion",
        "1/3 cup finely crumbled queso fresco (Mexican fresh cheese)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Chicken",
        "Onion",
        "Appetizer",
        "Fry",
        "Quick & Easy",
        "Cinco de Mayo",
        "Dinner",
        "Hot Pepper",
        "Tomatillo",
        "Cilantro",
        "Tortillas",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Soft Fried Tortillas with Tomatillo Salsa and Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/soft-fried-tortillas-with-tomatillo-salsa-and-chicken-109433"
}
