{
    "directions": [
        "In a large mixing bowl, combine 1 1/2 cups of the white sugar, molasses and  coffee.",
        "Combine the flour, baking soda, salt, ground nutmeg, ground cloves and ground ginger. Add the flour mixture to the molasses mixture and mix well. Cover and refrigerate dough for 2 hours.",
        "Preheat oven to 350 degrees F (175 degrees C). Spray baking sheets with non-stick cooking spray.",
        "Roll chilled dough on a floured surface to 1/4  inch thick. Cut with 3 or 4 inch sized cookie cutters. Place cookies on the prepared baking sheets.",
        "Bake at 350 degrees F (175 degrees C) for 8 to 10 minutes or until set. Let cookies cool on wire racks.",
        "To Make Frosting: Combine the remaining 1 1/2 cups white sugar, the water and vinegar in a heavy saucepan. Cover and bring to a boil. Uncover and cook over medium-high heat until a candy thermometer reads 234-240 degrees F (112-115 degrees C), softball stage. This should take about 5 to 10 minutes. Remove form the heat and stir in the marshmallows until smooth.",
        "In a clean bowl beat the egg whites until frothy. Gradually beat in the sugar/marshmallow mixture and continue beating, on high, for 7 to 8 minutes or until stiff peaks form. Frost the cooled cookies. Let the frosting harden before storing the cookies in an airtight container."
    ],
    "ingredients": [
        "1 1/2 cups white sugar",
        "1 cup molasses",
        "1/2 cup strong brewed coffee, room temperature",
        "5 cups all-purpose flour",
        "2 teaspoons baking soda",
        "3/4 teaspoon salt",
        "1 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground ginger",
        "1 1/2 cups white sugar",
        "1/2 cup water",
        "1 teaspoon distilled white vinegar",
        "1 cup miniature marshmallows",
        "2 egg whites"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Soft Ginger Cut-Outs",
    "url": "http://allrecipes.com/recipe/11189/soft-ginger-cut-outs/"
}
