{
    "directions": [
        "Combine chocolate and butter in medium microwave-safe bowl. Microwave in 10-second intervals until chocolate is almost melted; remove and stir until melted and smooth. Finely grind 1 teaspoon sugar and 3 star anise in spice mill or small coffee grinder. Transfer to small bowl; whisk in flour, cocoa, coarse salt, and baking powder.",
        "Beat remaining 1/4 cup sugar, eggs, honey, and grapefruit peel in large bowl until thick and smooth. Fold in chocolate, then dry ingredients. Cover bowl; chill batter until cold and firm, at least 45 minutes and up to 1 day.",
        "Preheat oven to 375°F. Line 3 large baking sheets with parchment paper. Drop batter by tablespoonfuls onto prepared sheets, spacing mounds 2 inches apart.",
        "Bake cookies, 1 sheet at a time, until dry-looking and tester comes out with moist crumbs still attached, about 10 minutes. Cool on sheet 3 minutes, then transfer to racks and cool completely. DO AHEAD: Can be made 1 day ahead. Store airtight between sheets of waxed paper.",
        "Star anise is a brown, star-shaped seedpod. It's available in the spice section of some supermarkets and at specialty"
    ],
    "ingredients": [
        "8 ounces bittersweet chocolate, finely chopped",
        "1/4 cup (1/2 stick) unsalted butter, diced",
        "1 teaspoon plus 1/4 cup sugar",
        "3 whole star anise*",
        "1/4 cup all purpose flour",
        "1 tablespoon unsweetened cocoa powder",
        "1/2 teaspoon coarse kosher salt",
        "1/4 teaspoon baking powder",
        "2 large eggs",
        "2 tablespoons honey",
        "2 teaspoons finely grated grapefruit peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Chocolate",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Grapefruit",
        "Shower",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Soft Chocolate Cookies with Grapefruit and Star Anise",
    "url": "http://www.epicurious.com/recipes/food/views/soft-chocolate-cookies-with-grapefruit-and-star-anise-351248"
}
