{
    "directions": [
        "Combine the raisins, sultanas, and currants in a bowl, add enough water to cover, and let them soak in the fridge for at least 5 hours or overnight. Drain and discard the water.",
        "Preheat the oven to 350°F. line a large cookie sheet or baking sheet with parchment paper.",
        "Put the butter and sugar in the bowl of a stand mixer fitted with the paddle attachment. (You can use a handheld electric mixer instead, if you fancy.) Mix on high speed until the mixture is light and fluffy, about 4 minutes. You’ll occasionally need to scrape down the butter and sugar that clings to the sides. Crack in one egg and beat for 30 seconds, then add the other egg and beat for 30 seconds more.",
        "Sift the flour, baking soda, cinnamon, and salt into a medium bowl and stir well. add to the egg mixture, along with the vanilla extract, scrape down the sides of the bowl, and mix at medium speed just until the ingredients are well mixed and the flour is evenly distributed. add the oats, raisins, sultanas, and currants and mix just until they’re evenly distributed. Cover the bowl with plastic wrap and pop it in the fridge to chill, at least an hour.",
        "Use your hands to divide the dough into 16 equal balls (about 2 1/2 tablespoons each) and place half on the lined sheet, leaving about 2 inches between them. Bake for about 20 minutes, rotating the pan after about 10 minutes, just until they go golden brown all over and firm at the edges and no longer feel sticky or gooey when you touch one with your finger. Let the cookies cool on a rack as you bake the second batch.",
        "Eat the cookies slightly warm, when they’re cakey, or when they’ve cooled completely."
    ],
    "ingredients": [
        "1/4 cup golden raisins",
        "1/4 cup dark sultanas or golden raisins",
        "1/4 cup dried currants",
        "1 1/4 sticks (10 tablespoons) unsalted butter, at room temperature",
        "1 cup packed light brown sugar",
        "2 large eggs",
        "1 cup all-purpose flour",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon ground cinnamon",
        "Large pinch of kosher salt",
        "2 teaspoons vanilla extract",
        "2 cups rolled oats",
        "A stand or handheld electric mixer",
        "Parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Bake",
        "Dessert",
        "Oat",
        "Raisin",
        "Oatmeal",
        "Cookies"
    ],
    "title": "Soft Oatmeal Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/soft-oatmeal-cookies"
}
