{
    "directions": [
        "Bring water to a boil and cook rice noodles according to package directions. Drain, rinse and cool (makes about 2 cups).",
        "Line up ingredients in small bowls before beginning to make rolls. Fill a large bowl or saucepan with very warm water. Place a rice paper round in the hot water. Soak for between 30 seconds and 1 minute, or until rice round is pliable and pattern on the round is barely visible. Remove and place on a clean, slightly damp kitchen towel.",
        "Place 2 basil leaves on the inner edge of the rice round, about 1-inch from the edge and leaving about 1-inch on each side. Top with approximately 1/4 cup cooked rice noodles. Place 2 shrimp halves on top. Top with about 2 tablespoons carrots, then 2 leaves of mint. Fold 1 piece of lettuce leaf and place on top of pile. Bring the edge over filling and tuck underneath. As you continue to roll, fold in the sides. Finish rolling, repeat with the other rolls, and reserve under a damp cloth or paper towel. When ready to serve, slice in half and serve, cut ends up, with dipping sauce.",
        "Dissolve sugar in warm water, combine with other ingredients, and chill until ready to use."
    ],
    "ingredients": [
        "2 ounces Vietnamese or Thai rice noodles",
        "6 rice paper rounds",
        "1/4 cup, or 12 fresh Thai basil leaves (or regular basil leaves), rinsed and dried",
        "6 medium shrimp, cooked and halved",
        "1/2 cup shredded carrot",
        "1/2 cup, or 12 whole large fresh mint leaves, rinsed and dried",
        "3 red-leaf lettuce leaves, leaves, spines removed, leaving 6 halves",
        "Vinegar Dipping Sauce, recipe follows",
        "1 tablespoon sugar",
        "2 teaspoons warm water",
        "1/4 cup rice vinegar",
        "1 teaspoon chili sauce (recommended: Sriracha)",
        "1 tablespoon lime juice",
        "1 teaspoon fish sauce or low-sodium soy sauce",
        "1 tablespoon finely shredded carrot",
        "1 scallion, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy Dinner",
        "Healthy",
        "Asian Appetizer",
        "Appetizer",
        "Asian",
        "American",
        "Noodles",
        "Carrot Recipes",
        "Vegetable",
        "Rice Recipes",
        "Grain Recipes",
        "Shellfish Recipes",
        "Shrimp",
        "Lettuce Recipes",
        "Low Sodium"
    ],
    "title": "Soft Asian Summer Rolls with Sweet and Savory Dipping Sauce",
    "url": "http://www.foodnetwork.com/recipes/ellie-krieger/soft-asian-summer-rolls-with-sweet-and-savory-dipping-sauce-recipe"
}
