{
    "directions": [
        "Mix all ingredients in small bowl. Refrigerate while making pasta.",
        "Whisk flour and salt in medium bowl; make shallow well in center. Add egg yolks, 6 tablespoons water, and oil to well. Using fork, whisk water, egg yolks, and oil. Gradually work in flour from around egg mixture to form crumbly mixture. Knead in bowl until dough comes together, adding more water by 1/2 teaspoonfuls if dry. Turn dough out onto lightly floured work surface and knead until smooth and elastic, about 5 minutes. Divide into 4 equal portions. Cover with plastic wrap; let rest on work surface 30 minutes.",
        "Line 2 baking sheets with parchment. Turn pasta machine to widest setting. Flatten 1 dough piece to rectangle (cover remaining pieces with plastic wrap). Run dough through machine 2 times. Fold uneven ends over to make straight edge. Adjust machine to next narrower setting. Run dough through machine 2 times, dusting lightly with flour if sticky. Cut dough strip in half crosswise for easier handling. Repeat running dough through machine 2 more times on each narrower setting until pasta is generous 1/16 inch thick (setting #2), dusting lightly with flour if sticky.",
        "Whisk 1 egg in small bowl for egg wash. Place dough strips on work surface. Cut each strip into three 4-inch squares, trimming as needed. Place 3 pasta squares on 1 prepared baking sheet. Place 1 rounded tablespoon ricotta filling in center of each of 3 squares, spreading filling to 2 1/2-inch circle. Make well in center of filling large enough to hold 1 egg yolk. Carefully break 1 egg open and separate yolk from white (reserve egg white for another use). Gently place egg yolk in well of filling. Brush edges of pasta dough with egg wash. Carefully place 1 pasta square atop egg yolk, pressing edges of pasta squares together to seal tightly, enclosing yolk and filling completely. Dust ravioli lightly with flour. Repeat procedure with remaining pasta, ricotta filling, yolks, and egg wash for a total of 8 ravioli. DO AHEAD:Ravioli can be made 4 hours ahead. Refrigerate uncovered.",
        "Pour 6 tablespoons water into large skillet and bring to boil over medium-high heat. Add butter and stir until melted and bubbling. Stir in truffle oil and sliced truffles. Season sauce to taste with salt and pepper. Remove from heat.",
        "Meanwhile, add enough water to large skillet to measure 1 1/2inches; sprinkle with salt. Bring water to boil. Working in 2 batches, gently slide ravioli into skillet, egg yolk side up; adjust heat to keep water below rolling boil and cook just until pasta is tender, being careful not to overcook egg yolks, about 3 minutes (do not turn ravioli over).",
        "With slotted spoon, transfer 2 ravioli to each of 4 plates. Spoon sauce over."
    ],
    "ingredients": [
        "1 cup whole-milk ricotta cheese",
        "2 large egg yolks",
        "1 teaspoon finely grated lemon peel",
        "1/4 teaspoon salt",
        "1/8 teaspoon (generous) ground black pepper",
        "1 3/4 cups all purpose flour",
        "1/4 teaspoon salt",
        "3 large egg yolks",
        "6 tablespoons (or more) water",
        "5 teaspoons olive oil",
        "9 large eggs",
        "6 tablespoons water",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 12 pieces",
        "1 tablespoon truffle oil*",
        "3 small or 2 medium black truffles, very thinly sliced",
        "*Truffle oil can be found at some supermarkets, specialty foods stores, and Italian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Dairy",
        "Egg",
        "Mushroom",
        "Pasta",
        "Ricotta"
    ],
    "title": "Soft Egg Ravioli",
    "url": "http://www.epicurious.com/recipes/food/views/soft-egg-ravioli-235852"
}
