{
    "directions": [
        "Preheat oven to 350°F.",
        "Dip each crab in milk and them lightly coat both sides with flour. Heat butter and oil together in a large, oven proof (no plastic handles) pan over medium heat. Add crabs and sauté until crispy and golden, about 4 minutes. Place pan in preheated oven and cook 3 more minutes. Transfer crabs to paper toweling to absorb oil. Set aside and keep warm.",
        "In a large bowl, combine shallots, basil, extra virgin olive oil, balsamic vinegar and lemon juice. After these ingredients are incorporated, add the tomatoes and season with salt and pepper. Mix well, cover with plastic and refrigerate until ready to serve.",
        "When ready to prepare dish, warm the vinaigrette in a sauce pan over high heat, removing from stove when it begins to simmer.",
        "Heat olive oil in a large skillet over medium heat. Add spinach and sauté 4 minutes, until wilted. Drain liquid.",
        "Place wilted spinach on one side of four individual dinner plates. Arrange two soft-shell crabs over each mound of spinach, overlapping one over the other. Spoon tomato vinaigrette over crabs and around the sides of the plate.",
        "<a name=\"note\"></a>",
        "Peel back the pointed part of the shell and scrape away the gills from each side. Using sharp scissors, cut off the head and carefully squeeze out the green bubble behind the eyes. Next, bend back the \"apron,\" the thin piece that folds under the crab. Twist the apron until it breaks off, removing the intestinal vein at the same time."
    ],
    "ingredients": [
        "8 soft shell crabs, cleaned (See note)",
        "1 cup milk",
        "flour for dusting",
        "2 tablespoons unsalted butter",
        "1 tablespoon olive oil",
        "1 cup red pear or cherry tomatoes (approximately 10-12 tomatoes), halved",
        "1 cup yellow pear or cherry tomatoes (approximately 10-12 tomatoes), halved",
        "1/2 cup red beefsteak tomato cut in 1-inch dice",
        "1/2 cup yellow beefsteak tomato cut in 1-inch dice",
        "1 shallot minced",
        "1/4 cup fresh basil leaves, cut julienne",
        "1/3-1/2 cup extra virgin olive oil, to taste",
        "1/4 cup balsamic vinegar",
        "1 teaspoon fresh lemon juice",
        "salt and freshly ground black pepper, to taste",
        "1 pound fresh spinach, rinsed well and stems trimmed",
        "1 tablespoon olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Shellfish",
        "Marinate",
        "Sauté",
        "High Fiber",
        "Seafood",
        "Crab",
        "Spinach",
        "Spring",
        "Summer"
    ],
    "title": "Soft-Shell Crabs with Wilted Spinach and Warm Tomato-Basil Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/soft-shell-crabs-with-wilted-spinach-and-warm-tomato-basil-vinaigrette-101649"
}
