{
    "directions": [
        "Combine 2 cups warm water (110 degrees F to 115 degrees F), the butter and brown sugar in the bowl of a stand mixer. Sprinkle the yeast on top and let stand until foamy, about 10 minutes. If the yeast does not foam, discard and try again with fresh yeast.",
        "Add 3 cups flour and 2 teaspoons salt to the yeast mixture. Using the dough hook, mix on low speed, then increase the speed to medium as the flour starts to incorporate. (Scrape down the side of the bowl as needed.) Mix in the remaining 3 cups flour on low speed, then increase the speed to medium and mix until the dough gathers around the hook and pulls away from the bowl.",
        "Turn the dough out onto a clean surface; knead until smooth, 5 minutes. Brush a large bowl with melted butter, add the dough and turn to coat. Cover with plastic wrap and let rise in a warm place until doubled in size, about 1 hour.",
        "Punch down the dough, then divide it in half. Divide each half into 6 even pieces with a knife; cover with plastic wrap. Line 3 baking sheets with parchment paper and coat with cooking spray.",
        "Tape a 24-inch-long piece of string to the countertop to use as a guide. Roll out a piece of dough on the countertop with your hands, starting in the middle and working your way out to the ends until you have a 24-inch-long rope. As you roll, occasionally lift the dough by the ends and slap the middle against the counter to stretch it.",
        "Lift the ends of the rope to make a U shape, then cross one end over the other twice to make a double twist in the middle. Fold down the ends and attach them to the bottom of the U, forming a pretzel shape. Transfer to one of the prepared baking sheets; repeat with the remaining dough, arranging 4 pretzels on each baking sheet. Cover loosely with plastic wrap and let stand at room temperature until slightly puffed, about 30 minutes.",
        "Position racks in the upper and lower thirds of the oven; preheat to 425 degrees F. Fill a wide pot with 10 cups water; add the baking soda and bring to a low simmer, whisking to dissolve. Use scissors to cut the parchment around each pretzel, leaving a 1-inch border. Slide the pretzels (on the parchment) off the baking sheets, then coat the baking sheets with cooking spray. Working in batches, carefully invert each pretzel into the water and use tongs to peel off the parchment. Simmer until the pretzels plump, about 45 seconds per side. Remove with a slotted spoon, letting the excess water drip off; arrange on the prepared baking sheets. Sprinkle with salt.",
        "Bake the pretzels until golden brown, rotating the baking sheets halfway through, 12 to 15 minutes. Brush with melted butter and serve with mustard.",
        "Photographs by Andrew Purcell"
    ],
    "ingredients": [
        "3 tablespoons unsalted butter, cubed and at room temperature, plus melted butter for brushing",
        "2 tablespoons packed dark brown sugar",
        "1 1/4-ounce packet active dry yeast (2 1/4 teaspoons)",
        "6 cups all-purpose flour",
        "2 teaspoons kosher salt, plus more for sprinkling",
        "Cooking spray",
        "2/3 cup baking soda",
        "Mustard, for dipping (optional)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Appetizer"
    ],
    "title": "Soft Pretzels",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/soft-pretzels"
}
