{
    "directions": [
        "Put oven rack in middle position and preheat oven to 450°F.",
        "Brush a 13- by 9-inch roasting pan with some of melted butter, then sprinkle shallot and zest in pan.",
        "Trim asparagus to about 7 inches long, then peel spears starting from 2 inches below tip of each.",
        "Arrange fish fillets, skinned sides up, on a work surface and season with salt and pepper. Lay 5 or 6 asparagus perpendicularly across 1 fillet and wrap fish around them to make a bundle. Repeat with remaining fillets and asparagus. Transfer bundles, seam sides down, to roasting pan and brush fish with remaining melted butter. Season with salt and pepper, then add water to pan. Cover pan tightly with foil and bake until fish is just cooked through and asparagus is crisp-tender, about 20 minutes.",
        "Boil tangerine juice with shallot in a 2-quart heavy saucepan over moderate heat until reduced to about 2 tablespoons, 4 to 5 minutes. Reduce heat to moderately low, then whisk in 1 tablespoon butter, whisking constantly. Add remaining butter, 1 tablespoon at a time, whisking constantly, adding each piece before previous one has completely melted, and lifting pan from heat occasionally to cool mixture. Remove from heat and stir in salt, cayenne, and lemon juice.",
        "Transfer fish with a slotted spatula to a platter and reserve pan juices. Cover fish with foil. Discard zest, then pour pan juices into a 10-inch skillet and boil over moderately high heat until reduced to about 2 tablespoons, about 2 minutes. Gradually whisk into beurre blanc.",
        "Blot any liquid accumulated on platter with paper towels, then spoon sauce over fish."
    ],
    "ingredients": [
        "1 1/2 tablespoons unsalted butter, melted",
        "2 tablespoons chopped shallot",
        "4 (2- by 1-inch) strips fresh tangerine zest",
        "1 lb medium asparagus",
        "4 (5- to 6-oz) skinless gray sole or flounder fillets",
        "1/2 cup water",
        "1/2 cup fresh tangerine juice",
        "1 tablespoon finely chopped shallot",
        "1 stick (1/2 cup) cold unsalted butter, cut into tablespoon pieces",
        "1/4 teaspoon salt",
        "cayenne",
        "1/2 teaspoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Vegetable",
        "Bake",
        "Passover",
        "Low/No Sugar",
        "Asparagus",
        "Spring",
        "Tangerine",
        "Gourmet"
    ],
    "title": "Sole-Wrapped Asparagus with Tangerine Beurre Blanc",
    "url": "http://www.epicurious.com/recipes/food/views/sole-wrapped-asparagus-with-tangerine-beurre-blanc-231802"
}
