{
    "directions": [
        "Bring 2 1/4 cups water to boil in medium saucepan. Add rice and bring to boil. Reduce heat to low, cover and cook until water is absorbed, about 20 minutes. Fluff with fork. Transfer to bowl and cool completely. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Heat 1 1/2 tablespoons vegetable oil in wok or heavy large skillet over high heat until hot but not smoking. Add eggs and cook until puffed around edge. Using spatula, push cooked egg toward back of pan while tipping pan forward, allowing uncooked egg to flow forward. Continue cooking until eggs are no longer runny but still soft and fluffy. Cut eggs into pieces with edge of spatula and transfer eggs to plate.",
        "Heat remaining 1 tablespoon vegetable oil in wok over high heat. Add slivered carrots and stir-fry 1 minute. Add sliced bok choy, sliced shiitake mushroom caps and slivered snow peas. Sprinkle with salt and pepper and stir-fry until vegetables just begin to soften, about 4 minutes. Add oriental sesame oil and heat mixture, then add cooked rice and stir-fry until heated through. Stir in eggs and sliced green onions. Season rice to taste with Szechuan Salt-Pepper and serve immediately."
    ],
    "ingredients": [
        "2 1/4 cups water",
        "1 1/2 cups long-grain white rice",
        "2 1/2 tablespoons vegetable oil",
        "4 eggs, beaten to blend",
        "2 carrots, peeled, thinly sliced on diagonal, then slivered",
        "3 cups thinly sliced bok choy stems and leaves",
        "4 ounces fresh shiitake mushrooms, stems removed, caps sliced",
        "1/4 pound snow peas, trimmed, slivered",
        "1 1/2 tablespoons oriental sesame oil",
        "3 green onions, sliced",
        "Szechuan Salt-Pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Egg",
        "Rice",
        "Vegetable",
        "Side",
        "Stir-Fry",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sophisticated Stir-Fried Rice",
    "url": "http://www.epicurious.com/recipes/food/views/sophisticated-stir-fried-rice-2009"
}
