{
    "directions": [
        "Line 9x5x2 3/4-inch metal loaf pan with 2 layers of plastic wrap, extending 3 inches over sides. Scoop raspberry sorbet into medium bowl and stir to soften; let stand at room temperature until sorbet is spreadable, stirring occasionally, about 10 minutes. Spread sorbet evenly in bottom of prepared loaf pan. Place loaf pan in freezer. Scoop lemon sorbet into another medium bowl; stir and let stand at room temperature until spreadable, stirring occasionally, about 10 minutes. Spoon lemon sorbet in large dollops atop raspberry sorbet, then spread in even layer. Return loaf pan to freezer. Repeat procedure with vanilla ice cream, then mango sorbet, and finally boysenberry sorbet. Fold plastic wrap overhang over terrine; cover with aluminum foil. Freeze terrine overnight. (Terrine can be made 4 days ahead. Keep frozen.)",
        "Stir blackberry jam in heavy medium saucepan over medium-low heat until melted. Stir in grated lemon peel and fresh lemon juice. Cool to room temperature. Stir in fresh blackberries, crushing some with fork to release juices. Refrigerate compote until cold, at least 2 hours and up to 1 day.",
        "Stir sliced fresh mint into blackberry compote. Invert terrine onto platter; peel off plastic wrap. Cut terrine into slices. Serve with blackberry compote."
    ],
    "ingredients": [
        "1 pint raspberry sorbet",
        "1 pint lemon sorbet",
        "1 pint vanilla ice cream",
        "1 pint mango sorbet",
        "1 pint boysenberry sorbet",
        "1/2 cup seedless blackberry jam",
        "2 teaspoons grated lemon peel",
        "1 teaspoon fresh lemon juice",
        "2 1/2-pint containers fresh blackberries",
        "1 tablespoon thinly sliced fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dairy",
        "Fruit",
        "Dessert",
        "Freeze/Chill",
        "Fourth of July",
        "Vegetarian",
        "Quick & Easy",
        "Backyard BBQ",
        "Frozen Dessert",
        "Blackberry",
        "Raspberry",
        "Mango",
        "Summer",
        "Party",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sorbet and Ice Cream Terrine with Blackberry Compote",
    "url": "http://www.epicurious.com/recipes/food/views/sorbet-and-ice-cream-terrine-with-blackberry-compote-108472"
}
