{
    "directions": [
        "Preheat oven to 325°F. Butter and flour springform pan. Combine 1/4 cup flour, 1/4 cup sugar, and 2 tablespoons butter in a small bowl. Using your fingertips, rub together until mixture is crumbly; set topping aside. Sift remaining 2 cups flour, baking soda, and next 5 ingredients into a large bowl. Using an electric mixer at low speed, beat 1 cup butter, 1 cup sugar, and sorghum in another large bowl, occasionally scraping down sides, until smooth, 2-3 minutes. Add eggs; beat until light and fluffy, 3-4 minutes. Beat in flour mixture in 3 additions, alternating with buttermilk in 2 additions, beginning and ending with dry ingredients. Pour batter into prepared pan.",
        "Bake cake until top looks just set, about 40 minutes.",
        "Immediately sprinkle topping over cake; bake until a tester comes out clean when inserted into center, 25-30 minutes longer. Transfer to a wire rack and let cake cool in pan. Remove pan sides.",
        "Cut into wedges; serve with ice cream."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons (2 1/4 sticks) unsalted butter, room temperature, divided, plus more for pan",
        "2 cups plus 1/4 cup all-purpose flour, divided, plus more for pan",
        "1 1/4 cups sugar, divided",
        "1 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "3/4 teaspoon kosher salt",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon ground nutmeg",
        "1/2 cup sorghum syrup",
        "2 large eggs",
        "1 cup buttermilk",
        "Rum raisin ice cream",
        "Special equipment:: A 9\"-diameter springform pan with 2 3/4\"-high sides"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dessert",
        "Bake",
        "Spice",
        "Party",
        "Potluck",
        "Buttermilk",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sorghum Spice Cake",
    "url": "http://www.epicurious.com/recipes/food/views/sorghum-spice-cake-388702"
}
