{
    "directions": [
        "Preheat the oven to 350°F. Butter a 9-inch pie plate. In a food processor, pulse the cookies and flour together until pulverized. Add the butter and process until the mixture resembles wet sand. Press the mixture into the bottom and up the sides of the prepared pie plate. Bake until lightly browned, 12 to 14 minutes. Let cool completely on a wire rack.",
        "Put the butter, brown sugar, and salt in a saucepan and cook over medium heat, stirring occasionally, until the sugar is melted, about 2 minutes. Whisk in the syrup, bourbon, and vanilla. In a bowl, whisk the eggs together. Temper the egg mixture: slowly whisk 1/2 cup of the warm butter-sugar mixture into the eggs.",
        "Pour the tempered egg mixture back into the saucepan with the butter-sugar mixture and reduce the heat to medium-low. Cook, stirring constantly, until the mixture is glossy, about 3 minutes. Remove from the heat and stir in the pecans.",
        "Pour the mixture into the crust and bake until the center feels set yet soft, 30 to 40 minutes. Let cool completely on a wire rack; this will take about 4 hours. Serve at room temperature."
    ],
    "ingredients": [
        "15 shortbread pecan sandies",
        "6 tablespoons all-purpose flour",
        "3 tablespoons unsalted butter, plus 1 tablespoon for buttering the pie plate",
        "6 tablespoons unsalted butter",
        "1/3 cup dark brown sugar",
        "1/2 teaspoon kosher salt",
        "3/4 cup sorghum syrup",
        "3 tablespoons bourbon",
        "1 1/2 teaspoons vanilla extract",
        "3 large eggs",
        "1 1/2 cups (6 ounces) toasted and chopped pecans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Pecan",
        "HarperCollins",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sorghum-Bourbon Pecan Pie",
    "url": "http://www.epicurious.com/recipes/food/views/sorghum-bourbon-pecan-pie-56390146"
}
