{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.",
        "Bring water and sorghum to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until sorghum is tender and liquid has been absorbed, 45 to 50 minutes.",
        "Combine Brussels sprouts and squash in a bowl; add jalapeno, sesame seeds, and 1 tablespoon olive oil; toss until evenly coated.",
        "Arrange radicchio and leek on the prepared baking sheet. Stir the squash mixture again and arrange on the baking sheet. Drizzle 1 tablespoon olive oil over radicchio and leek.",
        "Bake in the preheated oven until radicchio and leek are wilted and browned, about 10 minutes. Remove radicchio and leek from baking sheet and continue baking squash mixture until tender and browned, 5 to 10 minutes. Slice jalapeno into thin strips.",
        "Whisk sesame oil, brown miso, rice vinegar, toasted sesame oil, and ginger together in a bowl until dressing is smooth.",
        "Spoon sorghum into serving bowls. Arrange roasted vegetables on top and add black beans. Drizzle dressing over bowl."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/4463950.jpg",
    "ingredients": [
        "2 cups water",
        "1/2 cup whole grain sorghum",
        "1 cup Brussels sprouts, trimmed and halved",
        "1 cup cubed butternut squash",
        "1 jalapeno, halved lengthwise and seeded",
        "2 tablespoons sesame seeds",
        "2 tablespoons olive oil, divided",
        "1 head radicchio, cut into eighths",
        "1 leek, trimmed and chopped",
        "Miso Dressing:",
        "2 tablespoons sesame oil",
        "1 tablespoon brown miso",
        "1 tablespoon white rice vinegar",
        "1 tablespoon toasted sesame oil",
        "1 teaspoon grated fresh ginger",
        "1 cup cooked black beans"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sorghum Buddha Bowl",
    "url": "http://allrecipes.com/recipe/256916/sorghum-buddha-bowl/"
}