{
    "directions": [
        "Put oven rack in upper third of oven and preheat oven to 400°F. Butter bottom and side of an ovenproof 12-inch heavy nonstick skillet with 1 tablespoon melted butter.",
        "Soak raisins in hot water to cover in a bowl.",
        "Whisk together yolks, milk, vanilla, flour, and salt in a large bowl until combined well.",
        "Beat whites in another bowl with an electric mixer at high speed until they just hold soft peaks. Add granulated sugar, a little at a time, beating, and beat until whites just hold stiff peaks. Fold whites into yolk mixture gently but thoroughly. Drain raisins and fold half of drained raisins into batter.",
        "Pour batter into skillet and sprinkle with remaining raisins, then bake until firm and golden, 20 to 25 minutes.",
        "Slide pancake from skillet onto a cutting board and cut with a serrated knife into 1 1/2-inch pieces. Cool handle of skillet under cold running water, then heat half of remaining butter in skillet over moderately high heat until hot but not smoking. Sauté half of pancake pieces, turning gently, until lightly browned and crisp, then transfer to a platter and dust with confectioners sugar. Sauté remaining pancake pieces in remaining butter in same manner and dust with confectioners sugar."
    ],
    "ingredients": [
        "3/4 stick (6 tablespoons) unsalted butter, melted",
        "1 cup golden raisins (5 ounces)",
        "6 large eggs, separated",
        "1 1/2 cups whole milk",
        "1 teaspoon vanilla",
        "2 cups all-purpose flour",
        "Rounded 1/4 teaspoon salt",
        "6 tablespoons granulated sugar",
        "Confectioners sugar for dusting"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Breakfast",
        "Brunch",
        "Bake",
        "Kid-Friendly",
        "Raisin",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Soufflé Pancake",
    "url": "http://www.epicurious.com/recipes/food/views/souffle-pancake-108680"
}
