{
    "directions": [
        "Heat the olive oil in a large pot over medium heat.",
        "Add the bacon and let it render slowly in the olive oil, stirring every so often to keep it from sticking, for about 5 minutes, until it starts crisping up.",
        "Add the onions, leeks, and red pepper flakes. Turn the heat up to medium-high, mix the vegetables and the bacon together well, and let them cook for about 3 minutes, stirring every so often, until the onions and leeks have started to soften but the onions have not colored.",
        "Add the carrots, celery root, potatoes, Jerusalem artichokes, salt, pepper, chicken broth, and the herb packet. Mix everything together. Then turn the heat to high and let the soup cook at a low bubble for about half an hour, until the vegetables soften up (but before they get super-mushy).",
        "Add the kale, stir it into the soup, and cook it down for about 10 minutes, until it's soft and cooked all the way through. Pull out the herb packet.",
        "Serve the soup with some good bread on the side. I like to top each bowl with a drizzle of hazelnut or pumpkin-seed oil and a sprinkling of cheese."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "10 slices bacon, diced large (2 cups)",
        "1 large sweet onion, quartered and sliced (about 2 cups)",
        "2 large leeks, cut in half, cleaned, and roughly chopped (about 2 cups)",
        "1/4 teaspoon crushed red pepper flakes",
        "6 medium carrots, peeled and sliced (about 2 cups)",
        "1 large celery root, peeled, cut lengthwise into 6 pieces, and sliced thin (about 2 cups)",
        "2 2/3 pounds mixed potatoes (red, yellow, wax), washed but not peeled and sliced thin (about 2 cups)",
        "10 Jerusalem artichokes, peeled or scrubbed and sliced into thin rounds (about 2 cups)",
        "1 teaspoon salt",
        "1/2 teaspoon fresh-ground black pepper",
        "8 cups low-sodium chicken broth",
        "Herb packet: 3 dried bay leaves and 10 fresh thyme sprigs, tied together with string",
        "1 bunch kale, washed, stemmed, and torn (about 6 cups)",
        "Hazelnut or pumpkin-seed oil for drizzling",
        "2 tablespoons freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Leafy Green",
        "Potato",
        "Vegetable",
        "Appetizer",
        "Dinner",
        "Meat",
        "Bacon",
        "Kale",
        "Root Vegetable",
        "Carrot",
        "Jerusalem Artichoke",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Soup Doria",
    "url": "http://www.epicurious.com/recipes/food/views/soup-doria-369349"
}
