{
    "directions": [
        "1. Place the green beans, carrot and potatoes in a large saucepan. Add 8 cups water and 2 teaspoons sea salt, bring to a boil and cook, covered, until the carrots are nearly tender through, a bout 12 minutes. Add the zucchini, the fresh beans (if using), and cook until tender, about 15 minutes. Add the cooked dry beans (if using), and let cook until heated through, 3 to 4 minutes, then add the angel hair pasta and cook until it is al dente, 3 to 4 minutes. Remove the soup from the heat.",
        "2. While the soup is cooking prepared the pistou. Crush the garlic cloves with the salt in a mortar and pestle until they are a rough paste. Add the basil leaves and crush them with the mortar and pestle until they mix with the garlic into a rough paste. Slowly add the oil to the basil and garlic until you have a thick, deep green sauce.",
        "3. To serve, divide the soup among six warmed shallow soup bowls. Serve the soup with the pistou and the cheese alongside."
    ],
    "ingredients": [
        "12 ounces green beans, trimmed and cut in 1/4-inch rounds",
        "1 carrot, peeled and trimmed and diced",
        "2 small potatoes, peeled and cut into 1/4-inch cubes",
        "Sea salt",
        "1 large zucchini, trimmed and cut into 1/4-inch cubes",
        "1 cup fresh coco blanc, Jacob's cattle, or other shell beans (or dried beans) cooked until tender",
        "2 cups angel hair pasta",
        "Freshly ground black pepper",
        "3 cloves garlic, peeled and green germ removed",
        "1/4 teaspoon fine sea salt",
        "1-1/2 cups fresh basil leaves, gently packed",
        "1/3 cup extra virgin olive oil",
        "1 cup finely grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Garlic",
        "Pasta",
        "Potato",
        "Vegetarian",
        "Basil",
        "Green Bean",
        "Carrot",
        "Fall",
        "Winter"
    ],
    "title": "Soupe au Pistou",
    "url": "http://www.epicurious.com/recipes/food/views/soupe-au-pistou-102430"
}
