{
    "directions": [
        "For the cake: Preheat the oven to 350 degrees F. Grease and flour a 10-inch tube or Bundt pan.",
        "Use an electric mixer to cream the granulated sugar and butter together until fluffy. Add the eggs one at a time, beating well after each addition. Sift together the flour, baking powder and salt. Add the flour to the butter mixture in thirds, alternating each addition of flour with the addition of half the sour cream. Stir in the vanilla.",
        "For the streusel: In a separate bowl, combine the pecans, brown sugar and cinnamon.",
        "Pour one-third of the batter into the prepared pan. Sprinkle with half the streusel mixture. Pour another third of the batter into the pan and sprinkle with the remaining streusel mixture. Scrape the remaining batter into the pan and make smooth the top. Bake until a toothpick can be inserted in the center and comes out clean, about 1 hour. Allow the cake to cool in the pan for 10 minutes. Remove the cake from the pan and cool on a wire rack.",
        "For the glaze: When the cake is completely cooked, stir the confectioners' sugar, milk and vanilla extract together in a small bowl until smooth. Add more milk if the mixture is too thick. Drizzle over the cooled cake."
    ],
    "ingredients": [
        "2 sticks butter, at room temperature, plus more for greasing",
        "2 cups all-purpose flour, plus more for dusting",
        "2 cups granulated sugar",
        "2 large eggs",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 cup sour cream",
        "1 teaspoon vanilla extract",
        "1/2 cup finely chopped pecans",
        "1/2 cup light brown sugar, packed",
        "1 1/2 teaspoons ground cinnamon",
        "1 cup confectioners' sugar",
        "1 1/2 tablespoons milk, plus more if needed",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Coffee Cake",
        "Nut Recipes"
    ],
    "title": "Sour Cream Coffee Cake",
    "url": "http://www.foodnetwork.com/recipes/trisha-yearwood/sour-cream-coffee-cake"
}
