{
    "directions": [
        "Bring cherries (with any juices), 3/4 cup sugar, and cornstarch to a boil in a 2 1/2- to 3-quart heavy saucepan, stirring occasionally, then simmer 2 minutes. Transfer filling to a bowl and cool completely.",
        "While cherry filling cools, arrange 3 phyllo sheets in 1 layer on a work surface and let dry 15 minutes. Keeping 12 remaining sheets stacked, halve crosswise, then stack halves. Cover stack with a piece of plastic wrap and a dampened kitchen towel. Finely crumble 3 dried phyllo sheets into a bowl.",
        "Preheat oven to 400°F.",
        "Arrange 1 piece of phyllo on work surface with a short side nearest you (keep remaining sheets covered) and brush with some butter. Top with 3 more phyllo pieces, brushing each with butter.",
        "Sprinkle 2 tablespoons crumbled phyllo over lower third of buttered phyllo, leaving a 2-inch border along bottom and sides, then top with a rounded 1/3 cup filling. Fold bottom edge of phyllo up over filling and fold in sides to enclose filling completely, then roll up phyllo to form a strudel, about 4 1/2 by 2 1/2 inches. Transfer, seam side down, to a buttered baking sheet. Brush top with some butter, then sprinkle lightly with 1/4 teaspoon sugar. Cut 2 (1-inch) vents diagonally across top of strudel, about 1 1/2 inches apart, with a paring knife. Make 5 more strudels in same manner.",
        "Bake strudels in middle of oven until golden brown and crisp, 20 to 25 minutes. Transfer to a rack and cool 30 minutes.",
        "We used IFQ (Individually Quick Frozen) cherries from Friske Orchards (231-599-2604), in Charlevoix, Michigan."
    ],
    "ingredients": [
        "5 cups fresh or frozen (not thawed) pitted sour cherries (1 1/2 lb)*",
        "3/4 cup plus 1 1/2 teaspoons granulated sugar",
        "2 1/2 tablespoons cornstarch",
        "15 (17- by 12-inch) phyllo sheets, thawed if frozen",
        "1 stick (1/2 cup) unsalted butter, melted",
        "Garnish: confectioners sugar",
        "Accompaniment: vanilla ice cream or lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dessert",
        "Bake",
        "Summer",
        "Gourmet"
    ],
    "title": "Sour Cherry Strudels",
    "url": "http://www.epicurious.com/recipes/food/views/sour-cherry-strudels-106768"
}
