{
    "directions": [
        "Preheat oven to 350°F. Butter a 10- to 12-cup Bundt pan; dust with flour.",
        "In a medium bowl, combine brown sugar, chocolate chips, chopped pecans, and cinnamon, and set aside.",
        "Sift flour, baking powder, and baking soda into a medium bowl and set aside.",
        "Using an electric mixer, cream butter and sugar until completely blended. Beat in eggs and then sour cream until the mixture is creamy and smooth. Slowly add the sifted dry ingredients, making certain to scrape the sides of the bowl into the mixture. Stir in the cinnamon and vanilla. Mix until batter is well blended.",
        "Sprinkle whole pecans on the bottom of the prepared pan. Evenly distribute 1/4 cup of topping in the pan. Fold the remaining topping into the batter until mixed well. Pour the batter into the pan, spread evenly, and bake 35-40 minutes. To test that the cake is done, insert a tester (I use a toothpick) into the center. If the cake is done, it will come out clean, without any batter sticking to it.",
        "Cool the cake for at least 20 minutes in the pan. Once the cake has cooled, put a plate or serving piece you will use upside down on top of the cake pan, so that the face of the plate covers the open portion of the cake pan completely. Invert the plate and pan at the same time and place on a flat surface. Using pot holders, slowly raise the pan so that the cake stands upright on the serving plate. Sprinkle with powdered sugar to decorate."
    ],
    "ingredients": [
        "1 cup finely chopped pecans",
        "1/4 cup whole pecans",
        "1 12-ounce package of chocolate chips",
        "1/4 cup packed brown sugar",
        "2 teaspoons cinnamon",
        "2 cups flour",
        "1 cup sugar",
        "1/2 cup (1 stick) butter",
        "2 eggs",
        "1 cup sour cream",
        "2 teaspoons vanilla",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon cinnamon",
        "1/4 cup powdered sugar (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Rosh Hashanah/Yom Kippur",
        "Pecan",
        "Spring",
        "Shower",
        "Kosher",
        "Cinnamon",
        "Shavuot",
        "Party",
        "Potluck",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Sour Cream Chocolate-Chip Cake",
    "url": "http://www.epicurious.com/recipes/food/views/sour-cream-chocolate-chip-cake-108141"
}
