{
    "directions": [
        "In a large, non-metallic bowl, combine sourdough starter, water, flour and powdered milk.  Let ferment uncovered, for 2 to 3 hours in a warm place until bubbly and a clear sour milk odor develops.",
        "Preheat oven to 350 degrees F (175 degrees C). Coat a 9x13 inch pan with cooking spray and, using a small sieve or shaker, dust lightly with cocoa powder.",
        "In a separate large bowl, mix together sugar, oil, salt, vanilla, cinnamon and baking soda. Add eggs,  melted semi-sweet baking chocolate, and cranberry sauce.",
        "Combine the mixtures together and stir until well blended.",
        "Pour into a 9x13 inch baking pan. Bake in a preheated oven at 350 degrees F (175 degrees C)  for 30 to 35 minutes, or until knife inserted into center comes out clean. Cool at least 10 minutes before serving, excellent served slightly warm.",
        "Garnish by sifting powdered sugar onto a paper doily or just dollop spoonfuls of whole berry cranberry sauce on top of each serving of cake.",
        "This cake can also be baked in 2 - 8 inch round layer cake pans, baking time is decreased to 20 to 25 minutes or until knife inserted comes out clean. Another can of whole berry cranberry sauce can be spread generously between and on top of the unfrosted layered cake rounds for an impressive look during the holidays!"
    ],
    "ingredients": [
        "1/2 cup sourdough starter",
        "1 cup water",
        "1 1/2 cups all-purpose flour",
        "1/4 cup dry milk powder",
        "1 cup white sugar",
        "1/2 cup vegetable oil",
        "1/2 teaspoon salt",
        "1 teaspoon vanilla extract",
        "1 teaspoon ground cinnamon",
        "1 1/2 teaspoons baking soda",
        "2 eggs",
        "3 (1 ounce) squares semisweet chocolate",
        "1 (16 ounce) can whole cranberry sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sourdough Chocolate Cranberry Cake",
    "url": "http://allrecipes.com/recipe/7249/sourdough-chocolate-cranberry-cake/"
}
