{
    "directions": [
        "Preheat oven to 350°. Butter a shallow 3-quart baking dish and a sheet of foil. Place bread in a very large bowl.",
        "Heat 2 tablespoons oil in a small saucepan over medium heat. Add chestnuts, season with salt and pepper, and cook, stirring often, until chestnuts are golden and crisp, about 5 minutes. Transfer to bowl with bread with a slotted spoon.",
        "Heat remaining 1/4 cup oil in a large skillet over medium-high. Add sausage and cook, stirring occasionally and breaking into small pieces with a wooden spoon, until browned and cooked through, 8–10 minutes. Transfer to bowl with slotted spoon.",
        "Add onions, celery, and chiles to skillet, season with salt and pepper, and cook, stirring often, until onions are translucent and soft, 5–7 minutes. Add apple, garlic, and sage and cook, stirring occasionally, until onions are golden brown and apple is soft, about 5 minutes. Discard chiles. Add onion mixture to bowl.",
        "Add onions, celery, and chiles to skillet, season with salt and pepper, and cook, stirring often, until onions are translucent and soft, 5–7 minutes. Add apple, garlic, and sage and cook, stirring occasionally, until onions are golden brown and apple is soft, about 5 minutes. Discard chiles. Add onion mixture to bowl.",
        "Reduce heat to medium and cook Sherry in skillet, scraping up any browned bits, until almost all evaporated, about 1 minute. Add 1/2 cup butter; cook, stirring, until melted. Drizzle over bread mixture.",
        "Whisk eggs and 2 cups stock in a medium bowl; pour over bread mixture. Season with salt and pepper and toss, adding more stock 1/4-cupful at a time as needed (you may not use it all), until combined and bread is hydrated. Transfer to prepared dish and dot with remaining 1/4 cup butter.",
        "Cover with buttered foil; bake until a paring knife inserted into the center comes out hot, 30–35 minutes. Increase oven temperature to 450°. Uncover and bake until top is golden brown and crisp, 20–25 minutes. Let sit 10 minutes before serving.",
        "Do ahead: Stuffing can be assembled 1 day ahead. Cover and chill."
    ],
    "ingredients": [
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into pieces, divided, plus more",
        "10 cups coarsely torn sourdough bread, dried out overnight",
        "2 tablespoons plus 1/4 cup olive oil",
        "1/2 cup chopped roasted chestnuts",
        "Kosher salt, freshly ground pepper",
        "1 pound sweet Italian sausage, casings removed",
        "2 medium onions, chopped",
        "4 celery stalks, chopped",
        "2 chiles de árbol",
        "1 large Pink Lady apple, thinly sliced",
        "2 garlic cloves, finely chopped",
        "1/4 cup finely chopped fresh sage",
        "1/2 cup very dry Sherry",
        "2 large eggs",
        "3 cups chicken stock or low-sodium chicken broth, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Apple",
        "Sausage",
        "Celery"
    ],
    "title": "Sourdough, Italian Sausage, and Chestnut Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/sourdough-italian-sausage-and-chestnut-stuffing-51255150"
}
