{
    "directions": [
        "Preheat oven to 425°F. Whisk baking powder, salt, and 2 cups flour in a large bowl to combine. Using a pastry cutter or your fingers, work chilled butter into dry ingredients until mixture resembles coarse meal. Using a wooden spoon or fork, mix in sour cream and milk until a shaggy dough forms.",
        "Turn out dough onto a lightly floured surface and knead a few times just to bring together. Roll out until 1/4\" thick, then fold in half. Roll dough out again until 1/4\" thick, then fold in half again. Repeat once more, rolling out to a 3/4\"-thick round.",
        "Punch out biscuits as close together as possible with cutter. Pat scraps together and punch out more biscuits; repeat until you can't cut out any more (you should have 12 total). Transfer biscuits to a parchment-lined baking sheet, spacing 1\" apart, and bake, rotating sheet once, until golden brown and baked through, 10–12 minutes. Brush biscuits with melted butter.",
        "Dough can be made 1 day ahead. Cover and chill, or freeze up to 1 week.",
        "While biscuits are baking, cook sausage in a medium saucepan over medium heat, stirring occasionally, until cooked through and starting to brown, 5–8 minutes. Transfer to a small bowl with a slotted spoon.",
        "Add butter to drippings in pan and melt over medium. Whisk flour into butter mixture and cook, whisking constantly, until roux is very smooth and starting to bubble, about 2 minutes (don't let it color; this is a white gravy).",
        "Gradually add milk, whisking until incorporated. Reduce heat to mediumlow and cook gravy, still whisking, until thickened, 8–10 minutes. Stir in sausage; season with salt and pepper.",
        "Serve hot biscuits with gravy alongside for spooning over top."
    ],
    "ingredients": [
        "2 teaspoons baking powder",
        "1 teaspoon kosher salt",
        "2 cups all-purpose flour, plus more",
        "1/2 cup (1 stick) chilled unsalted butter, cut into pieces; plus",
        "2 tablespoons, melted",
        "1/2 cup sour cream",
        "1/2 cup whole milk",
        "8 ounces breakfast sausage links, chopped",
        "2 tablespoons unsalted butter",
        "1/4 cup all-purpose flour",
        "2 1/2 cups whole milk",
        "Kosher salt, freshly ground pepper",
        "A 2 1/4\"-diameter biscuit cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Bake",
        "Kid-Friendly",
        "Sausage"
    ],
    "title": "Sour Cream Biscuits With Sausage Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/sour-cream-biscuits-with-sausage-gravy-56390132"
}
