{
    "directions": [
        "Cut butter into 1/2-inch cubes.",
        "In a bowl with your fingertips or a pastry blender blend together flour, butter, and salt until most of mixture resembles coarse meal with remainder in small (roughly pea-size) lumps. Stir in sour cream with a fork just until incorporated. Drizzle 4 tablespoons ice water over mixture and gently stir just until incorporated. Test mixture by gently squeezing a small handful: When it has proper texture it should hold together without crumbling apart. If necessary, add enough remaining water, 1 tablespoon at a time, stirring until incorporated and testing, to give mixture proper texture. (If you overwork mixture or add too much water, pastry will be tough.)",
        "In a food processor pulse together flour, butter, and salt until most of mixture resembles coarse meal with remainder in small (roughly pea-size) lumps. Add sour cream and pulse just until incorporated. Drizzle 4 tablespoons water over mixture and pulse just until incorporated. Test mixture by gently squeezing a small handful: When it has proper texture it should hold together without crumbling apart. If necessary, add enough remaining water, 1 tablespoon at a time, pulsing until incorporated and testing, to give mixture proper texture. (If you overwork mixture or add too much water, pastry will be tough.)",
        "Turn mixture out onto a work surface and divide into 4 portions. With heel of hand smear each portion once in a forward motion to help distribute fat. Gather dough together and form it, rotating it on work surface, into a disk. Chill dough, wrapped in plastic wrap, until firm, at least 1 hour, and up to 1 day."
    ],
    "ingredients": [
        "2 1/2 sticks (1 1/4 cups) cold unsalted butter",
        "3 1/4 cups all-purpose flour",
        "1 teaspoon salt",
        "1 1/4 cups well-chilled sour cream",
        "4 to 6 tablespoons ice water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Dairy",
        "Winter",
        "Gourmet"
    ],
    "title": "Sour Cream Pastry Dough",
    "url": "http://www.epicurious.com/recipes/food/views/sour-cream-pastry-dough-14548"
}
