{
    "directions": [
        "In a small saucepan stir together the cherry jam, balsamic vinegar, and calvados. Simmer over low heat until the liquid reduces and thickens, about 10 minutes. Remove from heat and let stand until cooled completely.",
        "Put oven rack in middle position and preheat oven to 350°F. Invert bottom of springform pan (to make it easier to slide shortbread base off bottom), then lock on side of pan and line bottom with a round of parchment paper.",
        "Pulse hazelnuts with sugar in a food processor until nuts are finely chopped. Add flour, butter, cocoa, and salt and pulse just until a dough forms.",
        "Press dough evenly onto bottom of springform pan with your fingers. Prick all over with a fork, then bake until just dry to the touch, about 18 to 20 minutes. Transfer base in pan to a rack to cool completely, about 30 minutes. Remove side of pan and carefully slide out parchment from under shortbread, then reattach side of pan around shortbread base.",
        "Sprinkle gelatin over water in a 1- to 1 1/2-quart heavy saucepan and let stand until softened, about 5 minutes. Heat gelatin mixture over low heat, stirring, just until gelatin is melted, about 2 minutes. Whisk in chocolate hazelnut spread until combined and remove from heat.",
        "Whisk together mascarpone and chocolate hazelnut mixture in a large bowl. Beat together cream, cocoa powder, and sugar in another large bowl with an electric mixer at low speed until just combined, then increase speed to high and beat until cream just holds soft peaks. Whisk one third of whipped cream into mascarpone mixture to lighten, then fold in remaining whipped cream until well combined.",
        "Use a spoon or rubber spatula to spread the jam mixture evenly on top of shortbread, then spoon the mousse layer on top of the jam, gently smoothing top. Chill, covered, at least 3 hours.",
        "Bring cream to a simmer in a small heavy saucepan and remove from heat. Add chocolate and let stand 1 minute, then gently whisk until completely melted and smooth. Transfer ganache to a small bowl and cool, stirring occasionally, until slightly thickened but still pourable, about 20 minutes.",
        "Run a warm thin knife around inside of springform pan, then remove side. Slide cake off bottom of pan and transfer to a serving plate. Pour ganache onto top of cake and spread, allowing excess ganache to drip down sides."
    ],
    "ingredients": [
        "3/4 cup sour cherry jam or preserves",
        "1 tablespoon balsamic vinegar",
        "2 tablespoons calvados (or other type of brandy)",
        "2 tablespoons hazelnuts, toasted and skins rubbed off",
        "3 tablespoons sugar",
        "1/2 cup all-purpose flour",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "2 tablespoons unsweetened Dutch-process cocoa powder",
        "1/8 teaspoon salt",
        "1 teaspoon unflavored gelatin (from a 1/4-oz envelope)",
        "3 tablespoons cold water",
        "1/2 cup chocolate hazelnut spread such as Nutella (5 oz)",
        "1/2 cup mascarpone (1/4 lb)",
        "1 1/2 cups chilled heavy cream",
        "2 tablespoons unsweetened Dutch-process cocoa powder",
        "3 tablespoons sugar",
        "1/4 cup plus 1 tablespoon heavy cream",
        "3 1/2 oz fine-quality bittersweet chocolate (not unsweetened), chopped",
        "Special equipment: an 8-inch (20-cm) springform pan; parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Cookies",
        "Berry",
        "Chocolate",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Cherry",
        "Fall",
        "Edible Gift",
        "Hazelnut",
        "Jam or Jelly",
        "Gourmet",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Sour Cherry Chocolate Mousse Cake",
    "url": "http://www.epicurious.com/recipes/food/views/sour-cherry-chocolate-mousse-cake-234337"
}
