{
    "directions": [
        "In a bowl soak raisins in water to cover by 2 inches at least 8 hours and up to 1 day. Drain raisins in a sieve.",
        "On a lightly floured surface with a floured rolling pin roll out dough into a 14-inch round (about 1/8 inch thick) and fit into a 9-inch glass pie plate (1 quart). Trim dough, leaving a 1/2-inch overhang, and crimp edge decoratively. Chill shell until firm, about 30 minutes.",
        "Preheat oven to 425° F.",
        "Lightly prick bottom of shell all over with a fork and line shell with foil. Fill foil with pie weights or rice and bake shell in middle of oven 15 minutes. Carefully remove foil and weights or rice and bake shell until golden, about 8 minutes more. Cool shell in pan on a rack.",
        "Reduce temperature to 400° F.",
        "Separate eggs. Chill whites until ready to use. In a bowl whisk together yolks and sour cream and whisk in 1/2 cup sugar, flour, vanilla, cloves, nutmeg, salt, and raisins. Pour filling into shell and bake in middle of oven 10 minutes. Reduce temperature to 350° F. and bake pie 30 to 40 minutes more, or until filling is set.",
        "Remove pie from oven but keep temperature at 350° F. In another bowl with an electric mixer beat whites until they just hold soft peaks. Gradually add remaining 1/4 cup sugar, beating until meringue just holds stiff peaks. Spread meringue over warm pie, covering filling completely and making sure meringue touches shell all the way around.",
        "Bake pie in middle of oven until meringue is golden, about 10 minutes. Cool pie on rack and serve at room temperature."
    ],
    "ingredients": [
        "1 cup raisins",
        "Pastry dough",
        "Pie weights or raw rice for weighting shell",
        "2 large eggs",
        "1 cup sour cream",
        "3/4 cup sugar",
        "1 tablespoon all-purpose flour",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon freshly grated nutmeg",
        "1/8 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Dessert",
        "Bake",
        "Low Sodium",
        "Raisin",
        "Chill",
        "Sour Cream",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sour Cream Raisin Pie",
    "url": "http://www.epicurious.com/recipes/food/views/sour-cream-raisin-pie-14458"
}
