{
    "directions": [
        "Preheat the oven to 350 degrees F. Grease and flour a 10-inch tube pan.",
        "Cream the butter and sugar in the bowl of an electric mixer fitted with the paddle attachment for 4 to 5 minutes, until light. Add the eggs 1 at a time, then add the vanilla and sour cream. In a separate bowl, sift together the flour, baking powder, baking soda, and salt. With the mixer on low, add the flour mixture to the batter until just combined. Finish stirring with a spatula to be sure the batter is completely mixed.",
        "For the streusel, place the brown sugar, flour, cinnamon, salt, and butter in a bowl and pinch together with your fingers until it forms a crumble. Mix in the walnuts, if desired.",
        "Spoon half the batter into the pan and spread it out with a knife. Sprinkle with 3/4 cup streusel. Spoon the rest of the batter in the pan, spread it out, and scatter the remaining streusel on top. Bake for 50 to 60 minutes, until a cake tester comes out clean.",
        "Let cool on a wire rack for at least 30 minutes. Carefully transfer the cake, streusel side up, onto a serving plate. Whisk the confectioners' sugar and maple syrup together, adding a few drops of water if necessary, to make the glaze runny. Drizzle as much as you like over the cake with a fork or spoon."
    ],
    "ingredients": [
        "12 tablespoons (1 1/2 sticks) unsalted butter at room temperature",
        "1 1/2 cups granulated sugar",
        "3 extra-large eggs at room temperature",
        "1 1/2 teaspoons pure vanilla extract",
        "1 1/4 cups sour cream",
        "2 1/2 cups cake flour (not self-rising)",
        "2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon kosher salt",
        "1/4 cup light brown sugar, packed",
        "1/2 cup all-purpose flour",
        "1 1/2 teaspoons ground cinnamon",
        "1/4 teaspoon kosher salt",
        "3 tablespoons cold unsalted butter, cut into pieces",
        "3/4 cup chopped walnuts, optional",
        "1/2 cup confectioners' sugar",
        "2 tablespoons real maple syrup"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "American",
        "Cake",
        "Coffee Cake",
        "Sugar",
        "Dairy Recipes",
        "Egg Recipes",
        "Nut Recipes",
        "Brunch"
    ],
    "title": "Sour Cream Coffee Cake",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/sour-cream-coffee-cake-recipe"
}
