{
    "directions": [
        "Roll out dough on a lightly floured surface with a lightly floured rolling pin into a 13-inch round (1/8 inch thick), then fit into a 9-inch metal pie plate. Trim edge, leaving a 1/2-inch overhang, then fold overhang under and crimp edge decoratively. Chill shell 30 minutes.",
        "While shell chills, put oven rack in middle position and preheat oven to 400°F.",
        "Whisk together eggs, sour cream, vanilla, 1 cup sugar, 3 tablespoons flour, nutmeg, and salt in a bowl until smooth. Peel and core apples, then cut into wedges slightly less than 1/4 inch thick. Arrange apples in pie shell, then pour sour cream mixture evenly over them, coating all apples.",
        "Bake pie 15 minutes, then reduce oven temperature to 350°F and bake until filling is puffed and golden and apples are tender, 45 to 50 minutes.",
        "While pie bakes, stir together remaining 1/3 cup sugar, remaining 1/3 cup flour, cinnamon, and a pinch of salt in a bowl, then blend in butter with your fingertips until mixture forms small clumps.",
        "Remove pie from oven and increase oven temperature to 400°F. Crumble topping evenly over top and bake until sugar is melted, about 10 minutes. Cool pie on a rack at least 45 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "Pastry dough",
        "2 large eggs",
        "1 1/2 cups sour cream",
        "1 1/2 teaspoons vanilla",
        "1 1/3 cups sugar",
        "3 tablespoons plus 1/3 cup all-purpose flour",
        "1/4 teaspoon freshly grated nutmeg",
        "1/4 teaspoon salt",
        "1 pound Granny Smith apples",
        "1 teaspoon cinnamon",
        "1/2 stick (1/4 cup) cold unsalted butter, cut into 1/2-inch cubes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Apple",
        "Fall",
        "Cinnamon",
        "Sour Cream",
        "Nutmeg",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sour Cream Apple Pie",
    "url": "http://www.epicurious.com/recipes/food/views/sour-cream-apple-pie-230782"
}
