{
    "directions": [
        "Spray baking sheet with nonstick spray. Combine sugar, 1/4 cup water, and cream of tartar in heavy small saucepan. Stir over medium-low heat until sugar dissolves. Increase heat and boil without stirring until syrup is deep amber color, occasionally brushing down sides of pan with wet pastry brush, about 9 minutes. Add chopped pecans and swirl to blend. Pour out onto prepared baking sheet; spread evenly. Cool brittle completely. Cut 3 large pieces of brittle (each about 1 1/2 inches). Cut remaining brittle into 1/3-inch pieces. (Can be made 1 week ahead. Store airtight at room temperature.)",
        "Preheat oven to 350°F. Spray two 9-inch-diameter cake pans with 1 1/2-inch-high sides with nonstick spray. Line bottom of pans with waxed paper. Combine cake mix, eggs, sour cream, oil, vanilla extract, and almond extract in large bowl. Using electric mixer, beat mixture until well blended, about 3 minutes; fold in grated bittersweet chocolate. Divide batter equally between prepared pans.",
        "Bake cakes until brown on top and tester inserted into center comes out clean, about 30 minutes. Cool cakes in pans on racks 10 minutes. Cut around cakes to loosen; turn out onto racks. Peel off paper and cool cakes completely.",
        "Combine 1/2 cup brown sugar and 3 tablespoons water in heavy small saucepan. Stir over medium-low heat until sugar dissolves. Increase heat; boil until slightly thickened, about 3 minutes. Remove from heat; cool 5 minutes. Mix in cream. Beat 3 cups powdered sugar and butter in large bowl until well blended. Beat in brown sugar mixture. Beat in enough remaining powdered sugar to form frosting that is thick enough to spread.",
        "Place 1 cake layer, flat side up, on platter. Spread with 1 cup frosting. Sprinkle with 1/2 cup small brittle pieces; press into frosting. Top with second cake layer, flat side down. Spread remaining frosting over top and sides of cake. Stand large brittle pieces in center of cake. Arrange smaller brittle pieces in 1-inch-wide border around top edge of cake. (Can be made 1 day ahead. Cover with cake dome and refrigerate. Let stand at room temperature 1 hour before serving.)"
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "3/4 cup sugar",
        "1/4 cup water",
        "1/8 teaspoon cream of tartar",
        "3/4 cup pecan halves, toastedcoarsely chopped",
        "Nonstick vegetable oil spray",
        "1 18.25-ounce box yellow cake mix",
        "4 large eggs",
        "1 cup sour cream",
        "1/3 cup vegetable oil",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon almond extract",
        "2 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely grated",
        "1/2 cup (packed) dark brown sugar",
        "3 tablespoons water",
        "1/4 cup whipping cream",
        "6 cups (about) powdered sugar",
        "1 cup (2 sticks) unsalted butter, room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dairy",
        "Nut",
        "Dessert",
        "Bake",
        "Pecan",
        "Fall",
        "Winter",
        "Birthday",
        "Party",
        "Sour Cream",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sour Cream Layer Cake with Pecan Brittle",
    "url": "http://www.epicurious.com/recipes/food/views/sour-cream-layer-cake-with-pecan-brittle-106132"
}
