{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Brown the ground chuck in a large skillet. Drain the fat, and then add the tomato sauce, 1/2 teaspoon salt and plenty of freshly ground black pepper. Stir, and then simmer while you prepare the other ingredients.",
        "Cook the egg noodles until al dente. Drain and set aside.",
        "In a medium bowl, combine the sour cream and cottage cheese. Add plenty of freshly ground black pepper and a pinch of red pepper flakes. Add to the noodles and stir. Add the green onions and stir.",
        "To assemble, add half of the noodles to a baking dish. Top with half the meat mixture, and then sprinkle on half the grated Cheddar. Repeat with noodles, meat and then a final layer of cheese. Bake until all the cheese is melted, about 20 minutes.",
        "Serve with crusty French bread.",
        "To freeze: Assemble the Sour Cream Noodle Bake in a disposable aluminum oven-proof pan and seal the top of the container with the lid or heavy foil. Seal the edges to prevent freezer burn and place in the freezer.",
        "To cook from frozen: Place directly in a 375-degree F oven and bake, covered, for 45 minutes. Remove the lid and bake until lightly brown and bubbly, about 20 minutes more."
    ],
    "ingredients": [
        "1 1/4 pounds ground chuck",
        "One 15-ounce can tomato sauce",
        "1/2 teaspoon salt",
        "Freshly ground black pepper",
        "8 ounces egg noodles",
        "1/2 cup sour cream",
        "1 1/4 cups small curd cottage cheese",
        "Pinch red pepper flakes",
        "1/2 cup sliced green onions (less to taste)",
        "1 cup grated sharp Cheddar",
        "Crusty French bread, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheese",
        "Cheddar",
        "Egg Noodle Recipes",
        "Noodles",
        "Meat",
        "Main Dish Recipes",
        "Sauteing Recipes"
    ],
    "title": "Sour Cream Noodle Bake",
    "url": "http://www.foodnetwork.com/recipes/sour-cream-noodle-bake0"
}
