{
    "directions": [
        "Whisk brown sugar and cinnamon in medium bowl to blend. Add butter and rub in with fingertips until mixture holds together in small, moist clumps. Mix in pecans and chocolate chips. (Can be made up to 3 days ahead. Cover and refrigerate.)",
        "Preheat oven to 350°F. Butter and flour 13x9x2-inch metal baking pan. Sift flour, baking soda, and baking powder into medium bowl. Using electric mixer, beat sugar and butter in large bowl until blended and smooth. Beat in eggs 1 at a time, then orange peel and vanilla extract. Mix in flour mixture in 4 additions alternately with sour cream in 3 additions. Mix in orange juice. Spread half of batter in prepared pan. Sprinkle with half of streusel. Drop remaining batter over by heaping tablespoonfuls; carefully spread batter to make even layer. Sprinkle with remaining streusel.",
        "Bake cake 30 minutes. Lay sheet of foil loosely over pan to keep topping from browning too quickly. Continue baking until tester inserted into center of cake comes out clean, about 35 minutes longer. Remove foil. Cool cake in pan on rack 20 minutes. Dust with powdered sugar; serve warm or at room temperature. (Can be made 2 days ahead. Cool completely. Store airtight at room temperature.)"
    ],
    "ingredients": [
        "1 1/2 cups (packed) golden brown sugar",
        "1 tablespoon ground cinnamon",
        "6 tablespoons (3/4 stick) chilled salted butter, diced",
        "1 1/2 cups coarsely chopped pecans",
        "1 cup (6 ounces) semisweet chocolate chips",
        "3 cups all purpose flour",
        "1 1/2 teaspoons baking soda",
        "1 1/2 teaspoons baking powder",
        "1 1/3 cups sugar",
        "3/4 cup (1 1/2 sticks) salted butter, room temperature",
        "3 large eggs",
        "1 1/2 teaspoons grated orange peel",
        "1 1/2 teaspoons vanilla extract",
        "1 1/2 cups sour cream",
        "1/4 cup orange juice",
        "Powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Bake",
        "Orange",
        "Pecan",
        "Winter",
        "Sour Cream",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sour Cream-Orange Coffee Cake with Chocolate-Pecan Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/sour-cream-orange-coffee-cake-with-chocolate-pecan-streusel-106234"
}
