{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Generously butter a 9 inch Bundt  or tube pan. Sprinkle cinnamon sugar into the pan, and tilt to coat the buttered surface. Shake out the excess.",
        "In a medium bowl, stir together the cake flour, baking powder, baking soda and salt. Set aside.",
        "In a separate bowl, cream together 3/4 cup of butter and white sugar until light and fluffy. Beat in the eggs, one at a time, mixing well after each. Stir in the vanilla and sour cream, mixing just until blended. Gradually stir in the flour mixture until fully incorporated. Fold in the chopped pears using a rubber spatula.",
        "In a small bowl, stir together the brown sugar, cinnamon, ginger and pecans. Spoon 1/3 of the batter into the prepared pan. Sprinkle with 1/3 of the pecan mixture. Repeat layers two more times, ending with the pecan mixture on top.",
        "Bake for 50 to 60 minutes in the preheated oven, until the top of the cake springs back when lightly pressed, or a knife inserted into the crown comes out clean. Cool the cake in the pan for 15 minutes, then run a knife around the outside edge of the cake. Carefully invert onto a cooling rack. If the cake won't come out of the pan, tap it firmly with a knife on the bottom and sides of the pan. Set aside to cool completely.",
        "When cool, transfer the cake to a serving plate using two spatulas. Drizzle with the caramel ice cream topping before serving."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "2 tablespoons cinnamon sugar",
        "3 1/2 cups cake flour",
        "1 1/2 teaspoons baking powder",
        "1 1/2 teaspoons baking soda",
        "1/4 teaspoon salt",
        "3/4 cup butter, softened",
        "1 1/3 cups white sugar",
        "4 eggs",
        "2 teaspoons vanilla extract",
        "1 1/4 cups sour cream",
        "3 medium pears, cored and finely chopped",
        "3/4 cup packed light brown sugar",
        "1/4 teaspoon ground cinnamon",
        "1 teaspoon ground ginger",
        "1 cup chopped pecans",
        "1/2 cup caramel ice cream topping"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sour Cream Pear Cake",
    "url": "http://allrecipes.com/recipe/76183/sour-cream-pear-cake/"
}
