{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch round baking pans.",
        "Dissolve cocoa powder in boiling water in a bowl; set aside to cool completely.",
        "Beat white sugar and canola oil together in a bowl with an electric mixer until smooth; add eggs, one at time, beating well after each addition. Stir vanilla extract into creamed mixture.",
        "Sift flour, baking soda, baking powder, and salt together in a separate bowl. Mix flour mixture and sour cream alternately into the creamed mixture. Beat cocoa mixture into batter until incorporated. Pour batter into the prepared baking pans.",
        "Bake in the preheated oven until a toothpick inserted in the center of each cake comes out clean, 30 to 35 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack. Wrap cakes in plastic wrap and store in refrigerator.",
        "Beat butter in a bowl with an electric mixer until creamy and smooth; scrape down sides of bowl with a rubber spatula. Mix confectioners' sugar, 1/2 cup at a time, into the creamed butter until sugar is incorporated. Add salt and beat on medium-high until frosting is light and fluffy, about 5 minutes.",
        "Place one cake on a serving plate; spread 1/4 the frosting on the top of cake. Place second cake on the frosting layer; spread 1/4 the frosting on second cake. Place the third cake atop the second cake. Spread the remaining frosting on the top cake and around sides of entire layer cake."
    ],
    "ingredients": [
        "1 cup unsweetened cocoa powder",
        "1 cup boiling water",
        "2 1/2 cups white sugar",
        "1 cup canola oil",
        "4 eggs",
        "2 teaspoons vanilla extract",
        "3 cups all-purpose flour",
        "2 teaspoons baking soda",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 cup sour cream",
        "Frosting:",
        "2 cups unsalted butter, slightly softened",
        "2 cups confectioners' sugar",
        "1/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sour Cream Dark Chocolate Cake",
    "url": "http://allrecipes.com/recipe/230453/sour-cream-dark-chocolate-cake/"
}
