{
    "directions": [
        "Butter bottom of 9-inch tart pan with removable bottom. Finely grind flour, nuts, sugar, and salt in processor. Add 6 tablespoons butter. Using on/off turns, blend until coarse meal forms. Add egg yolk; blend until moist clumps form. Press dough over bottom and up sides of pan. Pierce crust with fork. Freeze until firm, about 30 minutes.",
        "Preheat oven to 400°F. Bake crust until golden, 13 to 14 minutes. Cool completely.",
        "Place water in very small cup. Sprinkle gelatin over. Let stand until gelatin softens, about 10 minutes.",
        "Whisk egg yolks, sugar, and cornstarch in medium bowl to blend. Place milk in medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring milk to simmer. Gradually whisk hot milk mixture into yolk mixture. Return to same saucepan. Stir over medium-high heat until custard thickens and boils, about 2 minutes. Remove from heat. Scrape in gelatin mixture and stir to dissolve. Let stand 5 minutes.",
        "Transfer custard to metal bowl. Discard vanilla bean. Set bowl over another bowl filled with ice and water; stir until cool but not set, about 15 minutes. Fold in sour cream. Spread filling evenly in crust. Chill tart until filling sets, at least 2 hours and up to 6 hours.",
        "Cut tart into wedges. Spoon plum compote over and serve."
    ],
    "ingredients": [
        "3/4 cup unbleached all purpose flour",
        "3/4 cup assorted nuts (such as walnuts, almonds, and hazelnuts), toasted, cooled",
        "1/4 cup sugar",
        "3/4 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, diced",
        "1 large egg yolk",
        "2 teaspoons water",
        "1/4 teaspoon unflavored gelatin",
        "3 large egg yolks",
        "1/4 cup sugar",
        "1 1/2 tablespoons cornstarch",
        "1 cup whole milk",
        "1/2 vanilla bean, split lengthwise",
        "1/2 cup sour cream",
        "Santa Rosa Plum Compote"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dessert",
        "Bake",
        "Picnic",
        "Kid-Friendly",
        "Plum",
        "Summer",
        "Anniversary",
        "Birthday",
        "Family Reunion",
        "Shower",
        "Chill",
        "Engagement Party",
        "Party",
        "Potluck",
        "Sour Cream",
        "Kidney Friendly",
        "Soy Free"
    ],
    "title": "Sour Cream Tart with Santa Rosa Plum Compote",
    "url": "http://www.epicurious.com/recipes/food/views/sour-cream-tart-with-santa-rosa-plum-compote-242998"
}
