{
    "directions": [
        "Prepare a sous vide immersion circulator for use according to the manufacturer’s instructions. Preheat the water to 147°F (64°C).",
        "Generously season the brisket with salt and pepper.",
        "In a large saucepan over medium heat, warm 1 Tbs. of the olive oil until just smoking. Add the garlic, tomato paste, paprika, cinnamon, demi-glace, dried bay leaf and thyme and cook, stirring constantly, for 1 minute. Increase the heat to medium-high, add the wine and boil for 5 minutes. Add the stock, honey, the 2 tsp. salt and the 1/4 tsp. pepper and simmer for 5 minutes. Remove from the heat and cool to room temperature.",
        "Place the brisket in a vacuum-sealable bag and pour in the stock mixture. Using a vacuum sealer, vacuum and seal the bag tight according to the manufacturer’s instructions; be sure you have a smooth, airtight seal. Carefully place the bag into the circulating water and cook for 72 hours.",
        "About 1 hour before the brisket is done, preheat an oven to 450°F (230°C).",
        "In a large bowl, toss the onions and carrots with 1 Tbs. of the olive oil, and season with salt and pepper. Transfer to a baking sheet and roast, stirring once halfway through, until the vegetables are tender, 20 to 25 minutes. Set aside.",
        "Carefully remove the bag from the circulating water. Remove the brisket from the bag, place on a paper towel-lined baking sheet and pat dry with paper towels. Strain the sauce into a bowl.",
        "In an essential pan or a large, deep sauté pan over medium-high heat, warm the remaining 1 Tbs. olive oil. Add the brisket and sear, turning once, until well browned, about 3 minutes per side. Transfer to a carving board. Pour off the excess fat from the pan, add the sauce and set over high heat. Simmer, stirring occasionally and skimming as needed, until the sauce is thickened, about 20 minutes, adding the onions and carrots during the last 5 minutes of cooking. Adjust the seasonings with salt and pepper.",
        "Cut the brisket across the grain into slices. Transfer to a large platter and spoon the vegetables over and around the meat. Drizzle some of the sauce over the meat and pour the rest into a bowl. Garnish the platter with fresh bay leaves. Serve immediately and pass the sauce at the table. Serves 10.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "1 flat-cut beef brisket, 4 1/2 to 5 lb. (2.25 to 2.5 kg)",
        "Kosher salt, to taste, plus 2 tsp.",
        "Freshly ground pepper, to taste, plus 1/4 tsp.",
        "3 Tbs. olive oil",
        "1 Tbs. minced garlic",
        "1 Tbs. tomato paste",
        "2 Tbs. Hungarian paprika",
        "1 tsp. ground cinnamon",
        "1 Tbs. beef demi-glace",
        "1 dried bay leaf",
        "2 tsp. chopped fresh thyme",
        "1 cup (8 fl. oz./250 ml) red wine",
        "2 cups (16 fl. oz./500 ml) beef stock",
        "1/4 cup (3 fl. oz./80 ml) honey",
        "2 lb. (1 kg) cipollini onions, peeled",
        "1 1/2 lb. (750 g) carrots, peeled and cut into large chunks",
        "Fresh bay leaves for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Sous Vide Beef Brisket with Honey and Spices",
    "url": "http://www.williams-sonoma.com/recipe/sous-vide-beef-with-honey-spices.html"
}
