{
    "directions": [
        "Heat water in a sous-vide water bath to 125 degrees F (52 degrees C).",
        "Season scallops with salt and pepper; place scallops in a sealable plastic bag, clustered together. Seal (on low pressure if using a vacuum sealer), removing as much air as possible without smashing scallops. Cook in preheated water bath for 30 minutes.",
        "Whisk soy sauce, balsamic vinegar, white sugar, lime juice, wasabi paste, and sesame oil together in a bowl. Slowly whisk in peanut oil until vinaigrette is smooth.",
        "Place white wine, mirin, ginger, and shallots in a skillet over medium heat; simmer until most of the liquid has evaporated, 4 to 5 minutes. Add cream; simmer until thickened, about 2 minutes more. Reduce heat to low; whisk in butter, 1 tablespoon at a time, until sauce is thickened and smooth, 3 to 5 minutes. Whisk in soy sauce.",
        "Strain sauce into a bowl; pour into whipping siphon and charge. Shake to combine.",
        "Heat olive oil in a large skillet over medium heat. Add mushrooms; cook and stir until soft and tender, about 5 minutes.",
        "Heat 1/4 cup vinaigrette to just boiling in a separate skillet. Add spinach; cook until just wilted, about 30 seconds. Remove from heat.",
        "Heat grapeseed oil in a large skillet over high heat. Remove scallops from plastic bag; pat dry with a paper towel. Cook until golden brown, 30 to 45 seconds per side.",
        "Spoon spinach and mushrooms onto serving platter. Spray some of the sauce onto the serving platter; top with scallops to serve."
    ],
    "ingredients": [
        "3/4 pound large bay scallops",
        "salt and ground black pepper to taste",
        "Vinaigrette:",
        "1/4 cup soy sauce",
        "1 1/2 teaspoons balsamic vinegar",
        "1 1/2 teaspoons white sugar",
        "1 teaspoon lime juice",
        "1 teaspoon wasabi paste",
        "1/2 teaspoon sesame oil",
        "1/4 cup peanut oil",
        "Soy Ginger Espuma Sauce:",
        "1/2 cup dry white wine",
        "1/4 cup mirin (Japanese sweet wine)",
        "1 tablespoon chopped fresh ginger",
        "1 tablespoon minced shallot",
        "2 tablespoons heavy whipping cream",
        "1/2 cup unsalted butter",
        "2 1/2 teaspoons soy sauce",
        "Mushroom and Spinach Side:",
        "2 tablespoons extra-virgin olive oil",
        "7 ounces sliced chanterelle mushrooms",
        "1 bunch spinach leaves",
        "2 tablespoons grapeseed oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sous-Vide Bay Scallops on Soy Ginger Espuma with Mushrooms and Spinach",
    "url": "http://allrecipes.com/recipe/245848/sous-vide-bay-scallops-on-soy-ginger/"
}
