{
    "directions": [
        "Place 2 cups of the flour, sugar, baking powder, baking soda and salt in the bowl of a mixer fitted with the paddle attachment. Mix on low until combined, then add the shortening and mix until worked in. Whisk together the buttermilk, egg and yolk, and vanilla in a small bowl and then add to the flour mixture and beat until smooth. Beat in remaining 1 cup flour until combined. Cover and refrigerate for at least 1 hour and up to 6 hours.",
        "Turn dough onto a floured surface and roll to 1/2-inch thickness. Using a 3-inch round cookie cutter, cut dough into rounds. Using a 1-inch cookie cutter, cut hole from center of each round. Gather scraps and re-roll dough, cutting additional doughnuts until dough is used up.",
        "Heat 5 inches of oil in a large pot to 350 degrees F. Add doughnuts, 3 at a time, and fry until golden on both sides, turning once, about 4 to 5 minutes total. Transfer to a plate lined with paper towels.",
        "When doughnuts have cooled, dip tops of doughnuts in the mixture and place on baking racks until the praline sets up slightly. Sprinkle nuts on top.",
        "Combine sugar, water, vanilla bean and seeds in a medium saucepan over high heat and cook until dark amber color. Remove from heat and slowly whisk in the cream, butter and salt. Return to the heat and whisk until smooth. Remove from the heat and whisk in the bourbon. Strain. Let cool until slightly thickened."
    ],
    "ingredients": [
        "3 cups all-purpose flour, divided, plus extra bench flour",
        "1 cup sugar",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon fine salt",
        "2 tablespoons vegetable shortening",
        "3/4 cups buttermilk",
        "1 large egg",
        "1 large egg yolk",
        "1 tablespoon vanilla extract",
        "Vegetable oil, for frying",
        "Bourbon Praline, recipe follows",
        "1/2 cup coarsely chopped pecans, toasted",
        "1 1/2 cups sugar",
        "1/2 cup water",
        "1/2 vanilla bean, seeds scraped",
        "1/2 cup heavy cream",
        "1 tablespoon unsalted butter",
        "1/4 teaspoon salt",
        "2 tablespoons bourbon"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Make Ahead",
        "Mixer Recipes",
        "American",
        "Southern Recipes",
        "Doughnut Recipes",
        "Egg Recipes",
        "Sugar",
        "Nut Recipes",
        "Dairy Recipes",
        "Buttermilk",
        "Dessert",
        "Brunch"
    ],
    "title": "Southern Buttermilk Bourbon Praline Doughnuts",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/southern-buttermilk-bourbon-praline-doughnuts-recipe"
}
