{
    "directions": [
        "In a bowl stir together the sour cream, the mayonnaise, the lime juice, and the chilies until the mixture is smooth and stir in the chicken, the tomatoes, the scallion, the chopped coriander, and salt and pepper to taste. The filling may be made 1 day in advance and kept covered and chilled.",
        "Make 12 crêpes (procedure follows) with the chili corn crêpe batter. Mound about 1/2 cup of the filling on half of each crêpe, fold the crêpe gently over the filling, and transfer them to a buttered baking sheet. Brush the top of each crêpe with the butter and bake the crêpe in a preheated 400°F. oven for 10 minutes, or until they are heated through. With a long spatula transfer the crêpes to serving plates and garnish them with the sour cream, the avocados slices, the coriander sprigs, and the lime slices.",
        "In a blender or food processor blend the flour, the cornmeal, the salt, the chili powder, the broth, the eggs, and the butter for 5 seconds. Turn off the motor, with a rubber spatula scrape down the sides of the container, and blend the batter for 20 seconds more. Transfer the batter to a bowl and let it stand, cover, for 1 hour. The batter may be made 1 day in advance and kept covered and chilled.",
        "Heat a crêpe pan or non-stick skillet measuring 6 to 7 inches across the bottom over moderate heat until it is hot. Brush the pan lightly with the butter, heat it until it is hot but not smoking, and remove it from the heat. Stir the batter, half fill a 1/4-cup measure with it, and pour the batter into the pan. Tilt and rotate the pan quickly to cover the bottom with a layer of batter and return any excess batter to bowl. Return the pan to the heat, loosen the edge of the crêpe with a spatula, and cook the crêpe for 1 minute, or until the top appears almost dry. Turn the crêpe, cook the other side lightly, and transfer the crêpe to a plate. Make crêpe with the remaining batter in the same manner, brushing the pan lightly with butter as necessary. The crêpes may be made 3 days in advance, kept stacked, wrapped in plastic wrap, and chilled."
    ],
    "ingredients": [
        "1 1/4 cups sour cream",
        "2/3 cup mayonnaise",
        "3 tablespoons fresh lime juice",
        "1 to 2 drained bottled pickled jalapeño chilies, or to taste, seeded and minced (wear rubber gloves)",
        "4 2/3 cups chopped cooked chicken",
        "4 plum tomatoes, seeded and chopped",
        "2 cups chopped scallion",
        "1/4 cup chopped coriander",
        "3/4 cup all-purpose flour",
        "1/3 cup yellow cornmeal",
        "1/2 teaspoon salt",
        "4 teaspoons chili powder",
        "3/4 cup plus 2 teaspoons chicken broth",
        "3 large eggs",
        "1 tablespoon unsalted butter, melted and cooled",
        "melted butter for brushing the crêpes",
        "sour cream, avocado slices, coriander sprigs, and lime slices for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Food Processor",
        "Chicken",
        "Bake",
        "Super Bowl",
        "Cornmeal",
        "Family Reunion",
        "Pan-Fry",
        "Jalapeño",
        "Sour Cream",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Southern California Crepes",
    "url": "http://www.epicurious.com/recipes/food/views/southern-california-crepes-11760"
}
