{
    "directions": [
        "Bring a large pot of water to a boil. Add the corn and let the water return to a boil. Cover the pot, turn off the heat, and leave the corn for 8 to 10 minutes. (If you're using an electric stove, take the pot off the burner.) Transfer the corn to a plate to let it cool. (Or cook the corn in the microwave.)",
        "In a large bowl, combine the red wine vinegar and garlic with the water. Add the bread and toss well with your hands. Set aside.",
        "In a large salad bowl, combine the onions, chili or pepper, cilantro, lime juice, chickpeas, avocado, tomatoes, cucumber, Jack cheese, and cheddar cheese. Scrape the corn kernels off the cob into the bowl, and add the cumin and chili powder. Toss well.",
        "Squeeze excess moisture from the bread, add it to the salad, and toss again. Drizzle the olive oil over the salad, and toss again. Cover and refrigerate for at least an hour. Toss thoroughly before serving."
    ],
    "ingredients": [
        "3 ears of corn",
        "2 teaspoons red wine vinegar",
        "1/4 teaspoon grated garlic",
        "1/2 cup water",
        "3 cups packed sourdough bread chunks, crusts removed",
        "1 cup chopped red onions",
        "1/2 cup chopped Anaheim chili or jalapeño pepper",
        "1/2 cup minced fresh cilantro",
        "1 tablespoon fresh lime juice",
        "2 cups cooked chickpeas, drained and rinsed",
        "1/2 avocado, chopped",
        "3 large firm ripe tomatoes, chopped, or 10 cherry tomatoes, halved",
        "1 cucumber, peeled and seeded",
        "1/3 cup grated Monterey Jack cheese",
        "1/3 cup grated cheddar cheese",
        "2 teaspoons ground cumin",
        "2 teaspoons chili powder",
        "1 tablespoon extra virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Tomato",
        "Vegetable",
        "Picnic",
        "Legume",
        "Chickpea",
        "Summer",
        "Chile Pepper"
    ],
    "title": "Southwest Panzanella",
    "url": "http://www.epicurious.com/recipes/food/views/southwest-panzanella-369129"
}
