{
    "directions": [
        "Whisk together lime juice, fish sauce, sugar (to taste), salt, and chile (to taste) in a large bowl until sugar is dissolved, then add oil in a slow stream, whisking until combined.",
        "Pull off and reserve flaps from squid bodies if attached. Cut squid bodies crosswise into 3/4-inch-thick rings and halve flaps lengthwise. If tentacle clusters are large, halve lengthwise and cut longer tentacles, if attached, crosswise into 2-inch pieces.",
        "Bring a 4- to 5-quart pot of salted water to a boil. Stir in squid and cook until it just turns opaque, about 30 seconds. Drain in a colander and rinse under cold running water to stop cooking. Drain well, then toss in a bowl with 2 tablespoons dressing (reserve remainder).",
        "Cut carrots and cucumber lengthwise into thin wide ribbons using a vegetable peeler.",
        "Toss together carrot and cucumber ribbons, lettuce, cilantro, mint, and scallions in a large bowl, then add squid and reserved dressing and toss again to coat. Sprinkle squid salad evenly with peanuts before serving."
    ],
    "ingredients": [
        "1/4 cup fresh lime juice",
        "2 1/2 tablespoons Asian fish sauce (preferably nam pla)",
        "1 1/2 to 2 tablespoons sugar",
        "1/2 teaspoon salt",
        "1 to 2 (1 1/2- to 2-inch-long) fresh Thai or serrano chiles, finely chopped, including seeds",
        "2 tablespoons vegetable oil",
        "1 1/2 lb medium squid (about 16), rinsed inside and out",
        "2 carrots, halved crosswise",
        "1 seedless cucumber (usually plastic-wrapped), halved crosswise",
        "1 (6 oz) head of Boston lettuce, torn into bite-size pieces (3 1/2 cups)",
        "1 cup loosely packed fresh cilantro leaves",
        "1 cup loosely packed fresh mint leaves",
        "4 scallions, thinly sliced diagonally",
        "1/2 cup coarsely chopped salted dry-roasted peanuts (2 oz)",
        "Accompaniment: lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fish",
        "Leafy Green",
        "Mint",
        "Peanut",
        "Squid",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Southeast Asian Squid Salad",
    "url": "http://www.epicurious.com/recipes/food/views/southeast-asian-squid-salad-235473"
}
