{
    "directions": [
        "Pat meat dry. Heat 1 tablespoon oil in an 8- to 10-quart heavy pot over medium-high heat until it shimmers, then brown meat in batches (do not crowd), about 5 minutes per batch. Transfer to a platter.",
        "Cook onion, ginger, white parts of scallions, garlic, and chile in remaining tablespoon oil in same pot over medium heat, stirring occasionally, until browned, about 12 minutes.",
        "Add water, soy sauce, star anise, cinnamon stick, and meat (with juices) and simmer, covered, until meat is tender but not falling apart, 2 to 21/2 hours.",
        "Transfer meat with tongs to a cutting board. Discard bones and membranes, then cut meat across the grain into 1/2-inch pieces.",
        "Strain broth through a sieve lined with a double layer of dampened paper towels set into a large saucepan. Discard solids. Skim off fat. Season broth with salt, then return meat to broth and reheat.",
        "Meanwhile, add noodles to a 4-quart pot of unsalted boiling water and let stand off heat, covered, until softened, 4 to 8 minutes. Drain and divide among large soup bowls. Add scallion greens and ladle in soup."
    ],
    "ingredients": [
        "3 pounds meaty beef short ribs",
        "3 pounds beef shank in 2 or 3 pieces",
        "2 tablespoons peanut or vegetable oil, divided",
        "1 large onion, sliced",
        "2 (1-inch) pieces peeled ginger, smashed",
        "1 bunch scallions, white parts smashed and greens chopped",
        "3 garlic cloves, smashed",
        "1 (4-inch-long) fresh red or green chile, stemmed and halved lengthwise",
        "2 quart water",
        "1/4 cup soy sauce",
        "4 whole star anise",
        "1 (4-inch) cinnamon stick",
        "14 ounces dried flat Asian rice noodles",
        "Accompaniments: mint sprigs; thinly sliced seedless cucumber; Sriracha and hoisin sauces; lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Soy",
        "Dinner",
        "Noodle",
        "Green Onion/Scallion",
        "Gourmet"
    ],
    "title": "Southeast Asian Beef and Rice-Noodle Soup",
    "url": "http://www.epicurious.com/recipes/food/views/southeast-asian-beef-and-rice-noodle-soup-351435"
}
