{
    "directions": [
        "Whisk first 5 ingredients and 1/2 cup cilantro in small bowl. Season dressing to taste with salt and pepper. Place chicken, corn, chilies and bell peppers on rimmed baking sheet. Brush 1/2 cup dressing over both sides of chicken and vegetables. Let stand 30 minutes.",
        "Bring 3 1/2 cups water and 1 teaspoon salt to boil in heavy large saucepan. Mix in rice. Cover, reduce heat to low and cook until rice is tender and water is absorbed, about 15 minutes. Remove from heat. Keep pan covered and let rice stand 5 minutes. Transfer rice to large bowl; fluff with fork. Pour 1/2 cup dressing over hot rice and toss; let cool.",
        "Prepare barbecue (medium heat). Grill chicken and vegetables until chicken is cooked through and vegetables are tender and slightly charred, about 6 minutes per side. Cut chicken, peppers and chilies into strips. Cut corn off cobs. Toss chicken and vegetables in medium bowl with enough dressing to coat; add to rice and toss again. Season to taste with salt and pepper. Divide salad among 6 plates. Sprinkle with remaining 1/4 cup cilantro and serve.",
        "*Chipotle chilies canned in a spicy tomato sauce, sometimes called adobo, are available at Latin American markets, specialty foods stores and some supermarkets.",
        "**Fresh green chilies, often called pasillas; available at Latin American markets and some supermarkets."
    ],
    "ingredients": [
        "3/4 cup olive oil",
        "4 green onions, sliced",
        "3 tablespoons fresh lime juice",
        "1 tablespoon minced canned chipotle chilies*",
        "1 tablespoon ground cumin",
        "3/4 cup chopped fresh cilantro",
        "4 skinless boneless chicken breast halves",
        "4 ears fresh corn, shucked",
        "2 poblano chilies,** quartered lengthwise, seeded",
        "2 red bell peppers, quartered lengthwise, seeded",
        "3 1/2 cups water",
        "1 teaspoon salt",
        "2 cups long-grain white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Rice",
        "Corn",
        "Hot Pepper",
        "Summer"
    ],
    "title": "Southwest Chicken Salad with Rice, Corn, and Chilies",
    "url": "http://www.epicurious.com/recipes/food/views/southwest-chicken-salad-with-rice-corn-and-chilies-105160"
}
