{
    "directions": [
        "Preheat oven to 450°F. Cut top 1/2\" off head of garlic; discard. Place garlic on a sheet of foil. Drizzle with oil; sprinkle with salt and pepper. Wrap in foil. Roast until tender, about 45 minutes. Let cool. Squeeze cloves from skins, keeping cloves intact.",
        "Stir cumin in a small dry skillet over medium heat until deep brown, 2-3 minutes. Let cool. Finely grind in a spice mill.",
        "Mix yogurt, cucumber, cilantro, mint, jalapeño, and 1/2 teaspoon lemon juice in a medium bowl. Stir in cumin. Season with salt, pepper, and more lemon juice, if desired.",
        "Rinse legumes; place in a medium bowl with rice. Add water to cover by 3\". Let legumes and rice soak at room temperature for 3-5 hours.",
        "Drain legumes and rice; transfer to a food processor. Add garlic, ginger, and jalapeño. Process until grainy paste forms (add 1-2 tablespoons water if necessary). Transfer to a large bowl; mix in tendrils and next 6 ingredients.",
        "Heat 1 tablespoon oil in a large nonstick skillet over medium-high heat. Spoon 4 scant 1/4-cupfuls of batter into skillet, flattening with the back of a measuring cup into 1/4\"-thick cakes. Reduce heat to medium; sauté until golden brown and cooked through, adding 1 more tablespoon oil when cakes are flipped, about 4-5 minutes per side. Repeat with remaining oil and batter. Divide raita among plates; top with a roasted garlic clove. Place 2 cakes on each plate."
    ],
    "ingredients": [
        "1 head of garlic",
        "1 tablespoon extra-virgin olive oil",
        "Kosher salt, freshly ground pepper",
        "1/4 teaspoon cumin seeds",
        "1 cup plain low-fat yogurt",
        "1/4 cup finely chopped peeled seeded cucumber",
        "1 teaspoon chopped fresh cilantro",
        "1 teaspoon chopped fresh mint",
        "1 teaspoon minced seeded jalapeño",
        "1/2 teaspoon (or more) fresh lemon juice",
        "1/2 cup mixed dried legumes (such as lentils and whole mung beans)",
        "1/4 cup basmati rice",
        "1 garlic clove, minced",
        "1 teaspoon chopped peeled fresh ginger",
        "1/2 jalapeño, seeded, minced",
        "1 cup leaves from pea tendrils, arugula, or spinach, chopped",
        "1/2 cup peas (from about 8 ounces peas in pods), chopped",
        "1/4 cup chopped fresh cilantro",
        "1/4 cup chopped scallions",
        "3 tablespoons chopped fresh mint",
        "1 teaspoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "4 tablespoons extra-virgin olive oil, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "South Indian Lentil Cakes with Raita",
    "url": "http://www.epicurious.com/recipes/food/views/south-indian-lentil-cakes-with-raita-367156"
}
