{
    "directions": [
        "Preheat the oven to 350 degrees F. Lightly oil and flour three 9 by 1 1/2-inch round cake pans.",
        "In a large bowl, sift together the flour, sugar, baking soda, salt, and cocoa powder. In another large bowl, whisk together the oil, buttermilk, eggs, food coloring, vinegar, and vanilla.",
        "Using a standing mixer, mix the dry ingredients into the wet ingredients until just combined and a smooth batter is formed.",
        "Divide the cake batter evenly among the prepared cake pans. Place the pans in the oven evenly spaced apart. Bake, rotating the pans halfway through the cooking, until the cake pulls away from the side of the pans, and a toothpick inserted in the center of the cakes comes out clean, about 30 minutes.",
        "Remove the cakes from the oven and run a knife around the edges to loosen them from the sides of the pans. One at a time, invert the cakes onto a plate and then re-invert them onto a cooling rack, rounded-sides up. Let cool completely.",
        "Frost the cake. Place 1 layer, rounded-side down, in the middle of a rotating cake stand. Using a palette knife or offset spatula spread some of the Cream Cheese Frosting over the top of the cake. (Spread enough frosting to make a 1/4 to 1/2-inch layer.) Carefully set another layer on top, rounded-side down, and repeat. Top with the remaining layer and cover the entire cake with the remaining frosting. Sprinkle the top with the pecans.",
        "In a standing mixer fitted with the paddle attachment, or with a hand-held electric mixer in a large bowl, mix the cream cheese, sugar, and butter on low speed until incorporated. Increase the speed to high, and mix until light and fluffy, about 5 minutes. (Occasionally turn the mixer off, and scrape the down the sides of the bowl with a rubber spatula.)",
        "Reduce the speed of the mixer to low. Add the vanilla, raise the speed to high and mix briefly until fluffy (scrape down the bowl occasionally). Store in the refrigerator until somewhat stiff, before using. May be stored in the refrigerator for 3 days.",
        "Chef: Sara Moulton;"
    ],
    "ingredients": [
        "Vegetable oil for the pans",
        "2 1/2 cups all-purpose flour",
        "1 1/2 cups sugar",
        "1 teaspoon baking soda",
        "1 teaspoon fine salt",
        "1 teaspoon cocoa powder",
        "1 1/2 cups vegetable oil",
        "1 cup buttermilk, at room temperature",
        "2 large eggs, at room temperature",
        "2 tablespoons red food coloring (1 ounce)",
        "1 teaspoon white distilled vinegar",
        "1 teaspoon vanilla extract",
        "Cream Cheese Frosting, recipe follows",
        "Crushed pecans, for garnish",
        "1 pound cream cheese, softened",
        "4 cups sifted confectioners' sugar",
        "2 sticks unsalted butter (1 cup), softened",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "American",
        "Southern Recipes",
        "Cake",
        "Red Velvet Cake",
        "Frosting Recipes",
        "Cheese",
        "Cream Cheese Recipes",
        "Chocolate",
        "Holiday"
    ],
    "title": "Southern Red Velvet Cake",
    "url": "http://www.foodnetwork.com/recipes/southern-red-velvet-cake-recipe"
}
