{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour three 10 inch round pans.",
        "Cream 1/2 cup of shortening, 1 1/2 cups of white sugar, eggs, 1 teaspoon of vanilla extract, and 1 teaspoon of butter flavored extract in a large bowl. Make a paste of cocoa and food coloring in a small bowl and add to shortening mixture. Pour in 2 1/2 cups flour alternately with the buttermilk, mixing until just incorporated. Mix 1 teaspoon of salt, baking soda, and vinegar in a small bowl, and while fizzing fold into the batter; mixing just enough to evenly combine. Pour the batter into prepared pan.",
        "Bake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 25 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
        "To make frosting: Cook 3 tablespoons of flour, 1/2 teaspoon of salt, and milk in a skillet over low heat, stirring constantly, until thick. Let cool completely. Cream butter, 1 cup sugar, and 1/2 cup shortening in a separate bowl. Stir in 2 teaspoons each of vanilla extract and butter flavored extract. Then add flour mixture to bowl and cream together. Frost cooled cake."
    ],
    "ingredients": [
        "1/2 cup shortening",
        "1 1/2 cups white sugar",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "1 teaspoon butter flavored extract",
        "3 tablespoons cocoa powder",
        "1/2 ounce red food coloring",
        "2 1/2 cups all-purpose flour",
        "1 cup buttermilk",
        "1 teaspoon salt",
        "1 teaspoon baking soda",
        "1 tablespoon distilled white vinegar",
        "3 tablespoons all-purpose flour",
        "1/2 teaspoon salt",
        "1 cup milk",
        "1/2 cup butter",
        "1 cup white sugar",
        "1/2 cup shortening",
        "2 teaspoons vanilla extract",
        "2 teaspoons butter flavored extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Southern Red Velvet Cake",
    "url": "http://allrecipes.com/recipe/88443/southern-red-velvet-cake/"
}
