{
    "directions": [
        "Preheat oven to 350°F. Separate heads of garlic into individual cloves (do not peel). Pierce each clove once with toothpick. Scatter garlic on baking sheet; roast until tender and beginning to brown, about 25 minutes. Cool 5 minutes. Peel garlic, cutting hard tip off each clove. Pack enough garlic into 1/2-cup measuring cup to fill (about 40 cloves); reserve any remaining garlic. Blend 1/2 cup garlic in processor to form course puree.",
        "Meanwhile, place chilies in small saucepan. Add enough water just to cover. Simmer over medium-low heat until chilies are soft and most of water evaporates, about 15 minutes. Add chili mixture, oil, cumin, and honey to garlic in processor. Puree until smooth. Season with salt and pepper. (Can be made 1 week ahead. Cover paste and garlic; chill.)",
        "Pat turkey dry. Season with salt and pepper. Slide hand under skin of turkey breast to loosen skin. Spread 1/2 cup garlic-paste over breast under skin. If stuffing turkey, spoon stuffing into main cavity. Rub 2 tablespoons paste all over outside of turkey. Reserve remaining paste for gravy. Tie legs together loosely to hold shape of turkey. Place on rack set in roasting pan. (Can be done 1 day ahead if turkey is not stuffed. Chill turkey and paste separately.)",
        "Position rack in lowest third of oven and preheat to 325°F. Heat 2 tablespoons oil in heavy large skillet over high heat. Add neck and giblets, turkey neck pieces and onion; sauté brown, about 15 minutes. Place contents of skillet around turkey in pan. Add celery, tomato, allspice and any reserved garlic to pan; pour in 2 cups broth. Roast turkey 1 hour 30 minutes. Tent turkey and entire pan loosely with heavy-duty foil. Continue to roast turkey until meat thermometer inserted into thickest part of thigh registers 180°F. or until juices run clear when thickest part of thigh is pierced with skewer, basting often with pan juices and 3 cups broth, about 1 hour 40 minutes longer for unstuffed turkey (about 2 hours 25 minutes longer for stuffed turkey). Place turkey on platter. Tent with foil; let stand at least 30 minutes. Reserve mixture in pan for gravy.",
        "Using tongs, remove turkey parts from pan; discard. Pour mixture in pan into sieve set over large bowl. Press on solids in sieve to release liquid. Spoon fat from pan juices; add enough broth to juices to measure 6 cups.",
        "Stir 1/2 cup reserved garlic-chili paste in heavy saucepan over medium-high heat until liquefied. Add flour and stir 1 minute (mixture will be very thick). Gradually add 6 cups broth mixture, whisking until smooth. Simmer until reduced to 4 1/2 cups, about 20 minutes. Season with cayenne, salt and pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "3 large heads garlic",
        "3 large dried ancho chilies, rinsed, stemmed, seeded, torn into pieces",
        "1/2 cup corn oil",
        "1 1/2 teaspoons ground cumin",
        "1/2 teaspoon honey",
        "1 17-to 18-pound turkey, neck and giblets reserved",
        "2 tablespoons corn oil",
        "1 1/2 pounds turkey neck or wings, cut into 1-inch pieces",
        "1 large onion, chopped",
        "3 celery stalks, chopped",
        "1 large tomato, chopped",
        "1 teaspoon whole allspice berries",
        "5 cups canned low-salt chicken broth",
        "2 cups (about) canned low-salt chicken broth",
        "6 tablespoons all purpose flour",
        "Cayenne pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Garlic",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Hot Pepper"
    ],
    "title": "Southwestern Turkey with Garlic-Ancho Chili Paste and Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/southwestern-turkey-with-garlic-ancho-chili-paste-and-gravy-803"
}
