{
    "directions": [
        "Thinly slice bottom 6 inches of lemongrass (1/4 cup), discarding remainder. Finely grind lemongrass, garlic, shallot, ginger, and chile with water and 2 teaspoons fish sauce in mini food processor, scraping down side frequently, until a paste forms.",
        "Mix paste and turkey with your hands until just combined (do not overmix) and form into 4 (3/4-inch-thick) patties (4 inches in diameter). Chill patties, covered with plastic wrap, 1 hour (to allow flavors to develop).",
        "Whisk together lime juice, oil, sugar, red-pepper flakes, 1/8 teaspoon salt, and remaining 2 teaspoons fish sauce until sugar is dissolved.",
        "Prepare grill for direct-heat cooking over medium-hot charcoal (medium heat for gas).",
        "Oil grill rack, then grill patties, covered only if using a gas grill, turning over once, until just cooked through, 10 to 12 minutes total.",
        "Whisk lime-juice sauce, then drizzle cut side of a bottom bun evenly with 1 tablespoon sauce. Top with a patty and 1/2 cup mixed herbs. Drizzle herbs with 1 tablespoon sauce and top with bun. Assemble 3 more burgers in same manner."
    ],
    "ingredients": [
        "2 fresh lemongrass stalks, root ends trimmed and 1 or 2 tough outer leaves discarded from each",
        "2 garlic cloves, chopped",
        "3 tablespoons chopped shallot",
        "1 tablespoon finely chopped peeled ginger",
        "1 (3-inch) fresh serrano or jalapeño chile, finely chopped, including seeds",
        "1 teaspoon water",
        "4 teaspoons Asian fish sauce, divided",
        "1 1/2 pounds ground turkey (dark meat only)",
        "1/4 cup fresh lime juice",
        "1/4 cup vegetable oil",
        "1/2 teaspoon sugar",
        "1/2 teaspoon dried hot red-pepper flakes",
        "4 kaiser rolls, split and grilled",
        "2 cups mixed fresh mint, basil, and cilantro leaves",
        "Equipment: a mini food processor"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Food Processor",
        "turkey",
        "Backyard BBQ",
        "Lunch",
        "Lime",
        "Basil",
        "Summer",
        "Grill/Barbecue",
        "Jalapeño",
        "Lemongrass",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Southeast Asian Turkey Burgers",
    "url": "http://www.epicurious.com/recipes/food/views/southeast-asian-turkey-burgers-239303"
}
