{
    "directions": [
        "Preheat oven to 325°F. Cut corn bread into 4 equal pieces. Crumble 3 pieces onto large baking sheet (reserve remaining piece for another use). Bake until slightly dry, about 20 minutes. Transfer to very large bowl.",
        "Melt butter in heavy large skillet over medium-high heat. Add onions, bell peppers, all chilies, sage and oregano and sauté until vegetables are tender, about 10 minutes. Transfer to bowl with corn bread. Mix in cilantro, corn chips and corn kernels. Season to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate.) Mix eggs into stuffing.",
        "Fill main turkey cavity with stuffing. Mix enough cream-style corn into remaining stuffing to moisten (about 1/2 to 3/4 cup cream-style corn, depending on amount of remaining stuffing). Spoon remaining stuffing into buttered baking dish. Cover with buttered foil. Bake stuffing in dish alongside turkey until heated through, about 40 minutes. Uncover and bake until top begins to brown, about 15 minutes.",
        "Preheat oven to 325°F. Butter 13x9x2-inch baking dish. Mix in 1 1/4 cups cream-style corn into stuffing. Transfer to prepared dish. Cover with buttered foil and bake until heated through, about 45 minutes. Uncover and bake until beginning to brown, about 20 minutes."
    ],
    "ingredients": [
        "Buttermilk Corn Bread",
        "6 tablespoons (3/4 stick) butter",
        "1 1/2 cups chopped onions",
        "1 1/2 cups chopped green bell peppers",
        "4 large poblano chilies, stemmed, seeded, chopped",
        "3 large jalapeño chilies, stemmed, seeded, chopped",
        "1/4 cup chopped fresh sage or 4 teaspoons dried rubbed sage",
        "1 1/2 tablespoons dried oregano",
        "3/4 cup chopped fresh cilantro",
        "1 1/2 cups crushed corn chips (such as Fritos)",
        "1 1/2 cups frozen corn kernels, thawed",
        "3 large eggs, beaten to blend",
        "1 1/4 cups (about) canned cream-style corn"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Pepper",
        "Side",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Corn",
        "Fall",
        "Winter",
        "Jalapeño",
        "Hominy/Cornmeal/Masa"
    ],
    "title": "Southwestern Corn Bread Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/southwestern-corn-bread-stuffing-5001"
}
