{
    "directions": [
        "Place bacon in a Dutch oven and cook over medium-high heat, turning occasionally, until evenly browned and slightly crisp, about 10 minutes. Drain bacon pieces on paper towels. Drain off all but 2 tablespoons bacon grease from pot.",
        "Melt butter in the pot with the remaining bacon grease over medium heat. Add onion, red bell pepper, and jalapeno. Sautee until just softened, 5 or 6 minutes. Add minced garlic and saute for 1 minute. Whisk in flour and stir until completely incorporated, about 2 minutes.",
        "Season with salt, pepper, cumin, chili powder, and cayenne pepper. Gradually whisk in Swanson(R) Unsalted Chicken Broth, stirring to prevent flour from clumping. Bring to a boil over medium-high heat. Add potatoes and green chilies; reduce heat to medium-low. Simmer until vegetables begin to soften, about 12 minutes",
        "Stir in frozen corn and chopped chicken. Add 1/2 cup of cooked bacon pieces. Add half and half; stir. Reduce heat to low; simmer very slowly until chicken and corn are heated through, 8 to 10 minutes. Remove pot from heat. Stir in 1 cup grated Cheddar cheese until cheese melts.",
        "Pour soup into bowls and garnish with reserved bacon, grated Cheddar cheese, cilantro, and green onions."
    ],
    "ingredients": [
        "10 slices bacon, cut into 1-inch pieces",
        "2 tablespoons butter",
        "1 cup diced yellow onion",
        "1 cup diced red bell pepper",
        "1 large jalapeno chile pepper, diced",
        "1 large clove garlic, minced",
        "1/4 cup all-purpose flour",
        "1 1/2 teaspoons kosher salt",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon chili powder",
        "1 pinch cayenne pepper",
        "5 cups Swanson® Unsalted Chicken Broth",
        "3 1/2 cups Yukon gold potatoes, 3/4-inch dice",
        "1 (4 ounce) can chopped green chiles, drained",
        "3 cups frozen corn",
        "3 cups chopped rotisserie chicken",
        "2 cups half-and-half",
        "1 cup grated sharp Cheddar cheese",
        "Garnishes:",
        "1/2 cup grated sharp Cheddar cheese",
        "1/4 cup chopped fresh cilantro leaves",
        "1/4 cup chopped green onion"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Southwestern Chicken and Corn Soup",
    "url": "http://allrecipes.com/recipe/245098/southwestern-chicken-and-corn-soup/"
}
