{
    "directions": [
        "Rub 1 tablespoon vegetable oil over chicken breast. In a medium saucepan over medium heat, cook chicken approximately 5 minutes per side, until meat is no longer pink and juices run clear. Remove from heat and set aside.",
        "Heat remaining 1 tablespoon vegetable oil in a medium saucepan over medium heat. Stir in green onion and red pepper. Cook and stir 5 minutes, until tender.",
        "Dice chicken and mix into the pan with onion and red pepper. Mix in corn, black beans, spinach, jalapeno peppers, parsley, cumin, chili powder, salt and cayenne pepper. Cook and stir 5 minutes, until well blended and tender. Remove from heat and stir in Monterey Jack cheese so that it melts.",
        "Wrap tortillas with a clean, lightly moist cloth. Microwave on high approximately 1 minute, or until hot and pliable.",
        "Spoon even amounts of the mixture into each tortilla. Fold ends of tortillas, then roll tightly around mixture. Secure with toothpicks. Arrange in a medium dish, cover with plastic, and place in the freezer. Freeze at least 4 hours.",
        "In a large, deep skillet, heat oil for deep frying to 375 degrees F (190 degrees C). Deep fry frozen, stuffed tortillas 10 minutes each, or until dark golden brown. Drain on paper towels before serving."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "1 skinless, boneless chicken breast half",
        "2 tablespoons minced green onion",
        "2 tablespoons minced red bell pepper",
        "1/3 cup frozen corn kernels",
        "1/4 cup black beans, rinsed and drained",
        "2 tablespoons frozen chopped spinach, thawed and drained",
        "2 tablespoons diced jalapeno peppers",
        "1/2 tablespoon minced fresh parsley",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon chili powder",
        "1/3 teaspoon salt",
        "1 pinch ground cayenne pepper",
        "3/4 cup shredded Monterey Jack cheese",
        "5 (6 inch) flour tortillas",
        "1 quart oil for deep frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Southwestern Egg Rolls",
    "url": "http://allrecipes.com/recipe/25502/southwestern-egg-rolls/"
}
