{
    "directions": [
        "Sauté chopped bacon in heavy large saucepan over medium heat until crisp, about 5 minutes. Increase heat to medium-high. Add shiitake mushrooms, onions, garlic, thyme, and oregano and sauté until onions are tender, about 5 minutes. Reduce heat to medium. Add flour and stir 1 minute. Stir in wine, scraping up browned bits from bottom of pan. Stir in chicken stock and parsley. Simmer until gravy thickens slightly, stirring occasionally, about 10 minutes. Season gravy to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and chill. Bring to simmer before using.)",
        "Preheat oven to 400°F. Mix flour, salt, black pepper, chili powder, paprika, dried mustard, and dried thyme in medium bowl to blend. Whisk eggs in another medium bowl to blend. Dredge chicken thighs in flour mixture, coat with egg, then dredge again in flour mixture. Transfer chicken to baking sheet.",
        "Add enough olive oil to heavy large skillet to come 1/4 inch up sides of pan. Heat oil over medium-high heat until very hot. Working in batches, fry chicken thighs until brown, about 2 minutes per side. Return chicken to baking sheet. Bake until chicken is cooked through, about 8 minutes.",
        "Spoon Garlicky Mashed Potatoes into center of 6 plates. Place 2 chicken thighs atop potatoes on each plate. Spoon gravy over chicken. Sprinkle with parsley and serve."
    ],
    "ingredients": [
        "1/4 cup coarsely chopped bacon",
        "2 cups chopped stemmed shiitake mushrooms",
        "1 3/4 cups chopped onions",
        "2 garlic cloves, minced",
        "1 teaspoon dried thyme",
        "1 teaspoon dried oregano",
        "3 tablespoons all purpose flour",
        "1/4 cup dry red wine",
        "3 cups chicken stock or canned low-salt chicken broth",
        "2 tablespoons chopped fresh Italian parsley",
        "2 cups all purpose flour",
        "1 tablespoon salt",
        "1 tablespoon ground black pepper",
        "1 tablespoon chili powder",
        "1 tablespoon paprika",
        "1 tablespoon dried mustard",
        "1 1/2 teaspoons dried thyme",
        "3 large eggs",
        "12 skinless boneless chicken thighs (about 2 2/3 pounds)",
        "Olive oil (for frying)",
        "Garlicky Mashed Potatoes",
        "Chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Fry",
        "Bacon",
        "Spring"
    ],
    "title": "Southern Fried Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/southern-fried-chicken-106321"
}
