{
    "directions": [
        "Cut the chicken into serving pieces. Trim the pieces of excess fat and season well with salt and pepper.",
        "Whisk together the buttermilk, mustard, and tarragon in a large bowl to make a marinade.",
        "Put the marinade and chicken pieces in a resealable plastic bag, close, and squeeze until coated evenly. Place in the refrigerator and marinate for at least 4 hours and up to 12 hours, turning occasionally.",
        "Preheat the oven to 300°F.",
        "Remove the chicken from the marinade, allowing any excess to drip off. Dredge in the flour.",
        "Pour the oil into a skillet to a depth of 1/2 inch. Heat over medium heat until it registers 350°F on a deep-frying thermometer. Add the legs and thighs to the hot oil, in batches as needed. Pan-fry until golden brown on the first side, 6—7 minutes, then turn and fry on the second side until golden, 7—8 minutes more. Place on a rack in a baking pan and put in the oven. Use a slotted spoon to remove browned bits from the oil and let the oil return to 350°F. Continue frying the breast pieces in the same way, then add to the pan in the oven. Bake until the chicken is opaque throughout and an instant-read thermometer inserted into the thickest parts registers 180°F for thigh and leg portions, about 25 minutes, and 170°F for breast portions, about 10 minutes.",
        "Meanwhile, make the gravy. Use the slotted spoon to remove any browned bits from the oil in the pan and pour off all but 2—3 tsp. Add the 2 tsp flour and cook, stirring frequently with a wooden spoon, to make a blond roux, 2 minutes. Add the milk to the roux, stirring well to remove all lumps. Cook over low heat, stirring and skimming as necessary, until thickened to a saucelike consistency, 5—10 minutes. Taste and season with salt and pepper. Strain the gravy and serve with the chicken."
    ],
    "ingredients": [
        "1 fryer chicken (2 1/2-3 1/2 lb)",
        "Salt and freshly ground pepper",
        "1 cup buttermilk",
        "1 Tbsp mustard",
        "2 tsp chopped fresh tarragon",
        "2 tsp all-purpose flour, plus more for dredging",
        "Vegetable oil for pan-frying",
        "1 cup whole milk, warmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Picnic",
        "Dinner",
        "Family Reunion",
        "Deep-Fry",
        "Party",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Southern Fried Chicken with Country Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/southern-fried-chicken-with-country-gravy-352491"
}
