{
    "directions": [
        "Bring 3 cups broth and bay leaf to boil in medium saucepan. Mix in wild rice; reduce heat to low, cover and cook 30 minutes. Mix in white rice. Cover; cook until both are tender and liquid is absorbed, about 20 minutes more. Transfer rice to large bowl. Discard bay leaf.",
        "Melt butter in heavy large Dutch oven over medium heat. Add ham, onions and celery and sauté until onions are tender, about 10 minutes. Add collard greens and marjoram and sauté until greens wilt, about 3 minutes. Add mixture to rice. Mix in cubed stuffing, pecans and nutmeg. Season to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate.) Mix eggs into stuffing.",
        "To bake stuffing in turkey: Fill main turkey cavity with stuffing. Mix enough chicken broth into remaining stuffing to moisten (about 1/2 to 3/4 cup broth, depending on amount of remaining stuffing). Spoon remaining stuffing into buttered baking dish. Cover with buttered aluminum foil. Bake stuffing in dish alongside turkey until heated through, about 30 minutes.",
        "To bake all stuffing in pan: Preheat oven to 375°F. Butter 13x9x2-inch baking dish. Mix 1 1/2 cups broth into stuffing. Transfer to prepared dish. Cover with buttered foil and bake until heated through, about 30 minutes."
    ],
    "ingredients": [
        "4 1/2 cups (about) canned low-salt chicken broth",
        "1 bay leaf",
        "3/4 cup wild rice",
        "3/4 cup long-grain white rice",
        "3 tablespoons butter",
        "2 cups chopped ham (about 3/4 pound)",
        "1 1/2 cups chopped onions",
        "1 1/2 cups chopped celery with leaves",
        "1 large bunch collard greens, sliced",
        "2 tablespoons chopped fresh marjoram or 2 teaspoons dried",
        "3 cups packaged cubed bread stuffing",
        "1 cup pecans, toasted, coarsely chopped",
        "1/4 teaspoon ground nutmeg",
        "3 eggs, beaten to blend"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Rice",
        "Side",
        "Bake",
        "Thanksgiving",
        "Ham",
        "Collard Greens",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Southern Rice Pilaf Stuffing with Ham, Pecans and Greens",
    "url": "http://www.epicurious.com/recipes/food/views/southern-rice-pilaf-stuffing-with-ham-pecans-and-greens-811"
}
