{
    "directions": [
        "Place beef pieces in a large resealable bag. Whisk 1/2 cup Swanson(R) Beef Broth, 2 tablespoons vegetable oil and fajita seasoning mix together in small bowl until mix dissolves; pour over beef. Seal bag and refrigerate 8 hours or overnight.",
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Arrange French fries in a single layer on a baking sheet; bake in preheated oven until golden brown, about 20 minutes (or according to package directions).",
        "While fries are baking, melt butter in a medium saucepan over medium heat. Whisk in flour and stir until smooth, about 2 minutes. Whisk in remaining 2 cups Swanson(R) Beef Broth and bring to a boil. Reduce heat and simmer until thickened, about 5 minutes, stirring occasionally.",
        "Heat 1 tablespoon vegetable oil in a large skillet over medium heat. Add onion and saute 2 minutes or until soft. Add bell pepper and saute an additional 3 minutes.",
        "Drain marinade from beef and discard. Add beef to skillet with vegetables. Saute to desired doneness, about 5 minutes.",
        "Place fries on a serving platter. Cover fries with beef mixture and cheese curds. Top with gravy and garnish with cilantro and chopped jalapenos."
    ],
    "ingredients": [
        "2 pounds beef skirt steak - cut across the grain into 1/4-inch strips and 2-inch pieces",
        "2 1/2 cups Swanson® Beef Broth, divided",
        "1 (1.4 ounce) package dry fajita seasoning",
        "3 tablespoons vegetable oil, divided",
        "1 (32 ounce) package frozen French fries",
        "4 tablespoons butter",
        "4 tablespoons all-purpose flour",
        "1 onion, sliced into thin strips",
        "1 green or red bell pepper, cut into thin strips",
        "8 ounces cheese curds",
        "Chopped cilantro (optional)",
        "1 fresh jalapeno pepper, seeded and chopped (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "South Meets North Fajita Poutine",
    "url": "http://allrecipes.com/recipe/245087/south-meets-north-fajita-poutine/"
}
