{
    "directions": [
        "Combine sugar, water, ginger, lemon zest, and lemon juice together in a saucepan; bring to a boil, reduce heat to medium, and cook for 10 minutes. Cool syrup to room temperature, transfer to a container, and refrigerate until flavors blend, 8 hours to overnight.",
        "Sift flour, baking powder, and salt together in a bowl. Rub the butter into the flour mixture with your fingertips until mixture has a cornmeal texture. Add the milk; mix until a smooth dough forms. Wrap the dough in plastic wrap and let it rest for 2 hours.",
        "Turn the dough out onto a lightly floured work surface and roll into a 5x14-inch rectangle about 1/4-inch thick. Cut the dough into twenty eight 1/2-inch wide strips. Twist pairs of strips together and pinch the ends together. Repeat for all of the strips. Cover strips with a clean cloth and let rest for 15 minutes.",
        "Heat about 2-inches of oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Place a wire rack over a baking sheet.",
        "Pour some of the cold syrup into a bowl and return remaining syrup to the refrigerator.",
        "Working in batches, fry koeksister twists in hot oil until twists swell and are golden brown, 2 to 5 minutes. Remove koeksisters from hot oil with a slotted spoon and immediately immerse in cold syrup for 10 seconds. Transfer soaked koeksisters to prepared wire rack to cool. Replenish cold syrup as necessary."
    ],
    "ingredients": [
        "Soaking Syrup:",
        "3 cups white sugar",
        "2 cups water",
        "3 1/4-inch-thick slices peeled fresh ginger",
        "1/2 lemon, zested in large strips",
        "1 teaspoon lemon juice",
        "Koeksisters:",
        "2 cups cake flour",
        "1 tablespoon baking powder",
        "1/4 teaspoon salt",
        "2 tablespoons cold unsalted butter, cut into chunks",
        "1/2 cup milk",
        "2 cups oil, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "South African Koeksisters",
    "url": "http://allrecipes.com/recipe/237503/south-african-koeksisters/"
}
