{
    "directions": [
        "Coarsely crumble buttermilk corn bread into very large bowl.",
        "Melt 4 tablespoons butter in large nonstick skillet over medium-high heat. Add ham and sauté 4 minutes. Add green onions and bell peppers; sauté 4 minutes. Mix in marjoram. Add to corn bread. Melt remaining 2 tablespoons butter in same skillet over medium-high heat. Add yams; cover and cook until crisp-tender, stirring occasionally, about 8 minutes. Add to corn bread and toss to combine. Whisk eggs, mustard, and allspice in bowl to blend. Add to stuffing; toss to combine.",
        "Loosely fill neck and main cavities of turkey with stuffing. Add enough broth to remaining stuffing to moisten slightly (1/4 to 3/4 cup, depending on amount of remaining stuffing). Generously butter baking dish. Spoon remaining stuffing into prepared dish. Cover with buttered foil, buttered side down. Bake stuffing in dish along side turkey until heated through, about 25 minutes. Uncover stuffing. Bake until top of stuffing is slightly crisp and golden, about 15 minutes longer.",
        "Preheat oven to 350°F. Generously butter 15x10x2-inch glass baking dish, depending on recipe. Add enough extra broth to stuffing to moisten (3/4 cup to 11/4 cups). Transfer stuffing to prepared dish. Cover with buttered foil, buttered side down. Bake until heated through, about 40 minutes. Uncover and bake until top is slightly crisp and golden, about 20 minutes longer."
    ],
    "ingredients": [
        "Buttermilk Corn Bread , 1 day old",
        "6 tablespoons (3/4 stick) butter",
        "1 1/4 pounds Black Forest ham, finely chopped",
        "3 bunches green onions, chopped",
        "1 1/2 cups coarsely chopped red bell peppers (about 2 small)",
        "1 tablespoon finely chopped fresh marjoram",
        "2 1/2 pounds yams (red-skinned sweet potatoes; about 3 medium), peeled, cut into 3/4-inch pieces",
        "3 large eggs",
        "3 tablespoons Dijon mustard",
        "1/4 teaspoon ground allspice",
        "Canned low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Ham",
        "Sweet Potato/Yam",
        "Fall",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Southern Corn Bread Stuffing with Smoked Ham and Yams",
    "url": "http://www.epicurious.com/recipes/food/views/southern-corn-bread-stuffing-with-smoked-ham-and-yams-105806"
}
