{
    "directions": [
        "Puree first 7 ingredients in processor until paste forms. Cook in large pot over medium heat until aromatic, stirring often, about 10 minutes. Add tomato paste. Cook until mixture starts to darken and brown, stirring often, about 5 minutes longer.",
        "Add broth, brown sugar, lime leaves, and cardamom. Simmer 10 minutes, stirring often and scraping up browned bits. DO AHEAD Can be made 2 days ahead. Cool, cover, and chill. Bring to simmer before continuing.",
        "Add sweet potatoes, russet potatoes, coconut, carrots, tomatoes, 1 teaspoon salt, and 1/4 teaspoon pepper to mixture in pot. Bring to boil, then reduce heat to medium low. Cover and simmer until vegetables are tender, stirring occasionally, about 25 minutes. Add spinach, if desired, and cook until wilted, about 3 minutes. Season with salt and pepper. Discard lime leaves and cardamom. Transfer curry to bowl; garnish with cilantro and serve."
    ],
    "ingredients": [
        "1 large onion, cut into 1-inch chunks (about 2 cups)",
        "3 large garlic cloves, peeled",
        "1 (2-inch-long 1-inch-diameter) piece peeled fresh ginger (about 2 ounces)",
        "3 tablespoons sunflower oil",
        "1 tablespoon garam masala*",
        "2 teaspoons ground cumin",
        "1/2 serrano chile, seeded, chopped",
        "2 tablespoons tomato paste",
        "3 cups vegetable broth",
        "2 teaspoons (packed) golden brown sugar",
        "2 kaffir lime leaves**",
        "2 whole green cardamom pods",
        "1 pound red-skinned sweet potatoes (yams), peeled, cut into 1-inch cubes",
        "12 ounces russet potatoes, peeled, cut into 1-inch cubes",
        "1 1/4 cups finely grated peeled fresh coconut (about 4 ounces; grated in processor)",
        "2 large carrots, peeled, cut into 1/2-inch rounds",
        "2 tomatoes, cored, chopped",
        "1 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "4 ounces baby spinach leaves (optional)",
        "2 tablespoons chopped fresh cilantro",
        "* An Indian spice mixture; available in the spice section of supermarkets and at Indian markets.",
        "** Leaves of the kaffir lime tree; sold frozen or sometimes fresh at Asian markets. If unavailable, substitute 1 tablespoon fresh lime juice and 1/2 teaspoon grated lime peel for each lime leaf."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Potato",
        "Tomato",
        "Vegetable",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Curry",
        "Spinach",
        "Carrot",
        "Sweet Potato/Yam",
        "Spring",
        "Summer",
        "Potluck",
        "Vegan",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "South Indian Vegetable Curry",
    "url": "http://www.epicurious.com/recipes/food/views/south-indian-vegetable-curry-242152"
}
