{
    "directions": [
        "Wash the chicken and pat dry. Put the pieces into a large nonreactive glass or stainless steel bowl and pour the lime juice over them. Sprinkle with the minced garlic, a large pinch of salt, and several liberal grindings of black pepper. Toss until the seasoning is uniformly distributed and set aside to marinate for at least 1 hour, refrigerated. (Or cover and marinate overnight in the refrigerator; remove from the refrigerator 30 minutes before you are ready to cook the chicken.)",
        "Place the corn flour in a paper or large plastic ziplock bag. Shake to coat the inside. Fit a wire cooling rack over a cookie sheet and place it in the center of the oven. Preheat the oven to 150°F (or Warm setting). Fill a deep cast-iron skillet, Dutch oven, or deep-fat fryer with enough lard or oil to come halfway up the sides, at least 2 inches deep. Over medium-high heat, bring the fat to 375°F (hot but not smoking).",
        "When the fat is hot, lift the chicken pieces a few at a time from their marinade, allowing the excess to flow back into the bowl. Drop them into the bag of corn flour, close the top, and shake until the chicken is well coated. Lift them out of the corn flour, shake off the excess, and slip them into the fat. Repeat until the pan is full without crowding. Fry, maintaining a temperature of 365°F, turning once, until the chicken is a rich golden brown and cooked through, 12 to 15 minutes.",
        "Lift the chicken from the fat, drain well, and transfer to the wire rack in the oven while you fry the remaining chicken. Serve hot, with hot sauce and lime wedges passed separately.",
        "Note: If you like, you can spice up the marinade with a few hot red pepper flakes or with a few shots of hot sauce. Other common additions to the marinade are minced fresh ginger (about 2 quarter-sized slices, minced fine), rum, sugar, and chopped cilantro."
    ],
    "ingredients": [
        "1 frying chicken, weighing no more than 3 pounds, cut up for frying Chinese-style, or 8 chicken thighs, chopped in half crosswise",
        "1/2 cup freshly squeezed lime juice",
        "2 garlic cloves, minced",
        "salt and freshly milled black pepper",
        "1 cup corn flour (very fine cornmeal — not cornstarch)",
        "lard or peanut or vegetable oil, for frying",
        "hot sauce",
        "2 limes, cut into wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fry",
        "Marinate",
        "Picnic",
        "Tailgating",
        "Family Reunion",
        "Deep-Fry"
    ],
    "title": "South American Fried Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/south-american-fried-chicken-101853"
}
