{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a baking dish.",
        "Place the bell and poblano peppers in the prepared baking dish. Cook in preheated oven until poblano pepper's skin becomes wrinkled, about 20 minutes. Remove the poblano pepper from the dish, and peel off the skin. Chop the poblano pepper into 1/4 inch pieces, and set aside.",
        "Combine the rice and water in a pan over medium heat, and bring to a boil. Reduce heat to low, cover, and simmer until water is absorbed, about 20 minutes. Remove from heat, and set aside.",
        "Place the onion in a skillet over medium heat; cook until translucent and soft, about 5 minutes. Stir in the ground beef; cook until crumbly and evenly browned. Drain the meat, and stir in the garlic, cumin, and oregano. Cook and stir until the garlic is fragrant, about 1 minute. Season with salt and pepper to taste. Stir the rice, enchilada sauce, and poblano pepper into the beef mixture, and mix thoroughly. Adjust the seasoning if desired.",
        "To make the cheese sauce, place the queso asadero in saucepan over medium heat and stir until melted and smooth.",
        "Lower oven heat to 350 degrees F (175 degrees C).",
        "Spoon the beef mixture into bell peppers until heaping full. Place any extra beef mixture into the center of the baking dish between the peppers. Drizzle cheese sauce over each pepper. Cover the baking dish with aluminum foil.",
        "Bake peppers in preheated oven until cheese sauce bubbles and filling is heated through, about 35 minutes."
    ],
    "ingredients": [
        "4 large red bell peppers, tops and seeds removed",
        "1 poblano pepper",
        "1 1/2 cups water",
        "1 cup uncooked white rice",
        "1 tablespoon vegetable oil",
        "1/2 cup chopped onion",
        "1 pound ground beef",
        "1 clove garlic, minced",
        "1 teaspoon ground cumin",
        "1 teaspoon dried oregano leaves",
        "1 (10 ounce) can red enchilada sauce",
        "salt and ground black pepper to taste",
        "1 cup shredded Asadero cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "South-of-the-Border Stuffed Peppers",
    "url": "http://allrecipes.com/recipe/142936/south-of-the-border-stuffed-peppers/"
}
