{
    "directions": [
        "Whisk first 4 ingredients in medium bowl in blend. Gradually whisk in oil. Season with salt and pepper. (Can be made 1 day ahead. Cover and refrigerate.",
        "Blanch corn in large pot of boiling salted water 2 minutes. Drain. Cool. Cut corn from cob. Transfer corn kernels to large bowl. Add tomatoes, jicama, onion and cilantro and mix. (Can be prepared 6 hours ahead. Cover and chill.)",
        "Combine first 4 ingredients in small bowl. Spread spice paste over both sides of steaks. Cover and refrigerate at least 2 hours or up to 6 hours.",
        "Prepare barbecue (medium-high heat). Grill steaks to desired doneness, about 5 minutes per side for medium-rare. Transfer steaks to cutting board and let stand 5 minutes.",
        "Meanwhile, add avocado and 2 tablespoons dressing to salsa and mix. Season to taste with salt and pepper. Place greens in large bowl and toss with enough dressing to coat. Divide greens equally among 6 plates. Fan some mango slices on 1 side of each salad. Top each salad with 1/2 cup salsa.",
        "Thinly steaks crosswise. Arrange atop greens. Serve, passing remaining dressing separately."
    ],
    "ingredients": [
        "1/4 cup fresh lime juice",
        "1/4 cup chopped fresh cilantro",
        "1 tablespoon chopped canned chipotle chilies in adobo sauce",
        "2 large garlic cloves, pressed",
        "1 cup olive oil",
        "2 ears fresh corn, husked",
        "4 plum tomatoes, seeded, chopped",
        "1 cup chopped peeled jicama",
        "1/2 cup chopped red onion",
        "1/4 cup chopped fresh cilantro",
        "1 1/2 tablespoons fresh lime juice",
        "1 tablespoon ground cumin",
        "1 tablespoon chili powder",
        "3 large garlic cloves, pressed",
        "2 pounds beef tenderloin steaks (1 inch thick)",
        "1 avocado, halved, peeled, pitted, diced",
        "10 cups mixed baby greens",
        "2 small mangoes, peeled, pitted, thinly sliced",
        "*Available at Latin American markets, specialty foods stores and in the Latin section of some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Beef",
        "Fruit",
        "Garlic",
        "Vegetable",
        "Marinate",
        "Mango",
        "Corn",
        "Summer"
    ],
    "title": "Southwestern Grilled Beef Salad with Corn Salsa and Chipotle Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/southwestern-grilled-beef-salad-with-corn-salsa-and-chipotle-dressing-2341"
}
