{
    "directions": [
        "Melt butter in heavy large skillet over medium-high heat. Add all chilies; sauté until beginning to soften, about 8 minutes. Stir in 1 package corn and green onions. Transfer to very large bowl. Mix in cilantro. Coarsely crumble corn bread into vegetable mixture; toss to blend.",
        "Blend second package of corn, eggs, sugar, salt, and pepper in processor to coarse puree. Stir mixture into stuffing.",
        "Loosely fill neck and main cavities of turkey with stuffing. Add enough broth to remaining stuffing to moisten slightly (1/4 to 3/4 cup, depending on amount of remaining stuffing). Generously butter baking dish. Spoon remaining stuffing into prepared dish. Cover with buttered foil, buttered side down. Bake stuffing in dish along side turkey until heated through, about 25 minutes. Uncover stuffing. Bake until top of stuffing is slightly crisp and golden, about 15 minutes longer.",
        "Preheat oven to 350°F. Generously butter 13x9x2-inch glass baking dish, depending on recipe. Transfer stuffing to prepared dish. Cover with buttered foil, buttered side down. Bake until heated through, about 40 minutes. Uncover and bake until top is slightly crisp and golden, about 20 minutes longer.",
        "Available at Latin American markets and many supermarkets."
    ],
    "ingredients": [
        "10 tablespoons unsalted butter",
        "1 1/4 cups chopped seeded fresh Anaheim chilies* (8 ounces)",
        "1 1/4 cups chopped seeded fresh poblano chilies * (8 ounces)",
        "3 large jalapeño chilies, seeded, chopped",
        "2 1-pound packages frozen petite yellow corn kernels, thawed",
        "1 1/4 cups chopped green onions",
        "2/3 cup chopped fresh cilantro",
        "Buttermilk Corn Bread , 1 day old",
        "4 large eggs",
        "1/4 cup sugar",
        "2 1/4 teaspoons salt",
        "1/2 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Thanksgiving",
        "Corn",
        "Hot Pepper",
        "Fall",
        "Jalapeño",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Southwest Corn Bread Stuffing with Corn and Green Chilies",
    "url": "http://www.epicurious.com/recipes/food/views/southwest-corn-bread-stuffing-with-corn-and-green-chilies-105807"
}
