{
    "directions": [
        "Mix first 7 ingredients in large shallow baking dish. Add chicken and turn to coat. Cover and refrigerate at least 4 hours or overnight, turning chicken occasionally.",
        "Prepare barbecue (medium heat). Preheat oven to 350°F. Wrap tortillas tightly in foil and place in oven. Heat 3 tablespoons oil in heavy large skillet over medium-high heat. Add peppers, onion and garlic and sauté until tender, about 4 minutes. Season to taste with salt and pepper. Keep warm in oven.",
        "Remove chicken from marinade and grill until golden brown and almost cooked through, about 3 minutes per side. Layer 1/4 cup cheese, 1 chili, then another 1/4 cup cheese onto each breast half. Grill until chicken is cooked through and cheese melts, about 3 minutes.",
        "Arrange 1 chicken breast on each tortilla. Top each with 1/4 of sautéed pepper mixture. Wrap tightly. Place tortilla, seam side down, in center of each plate. Garnish burritos with cilantro and serve, passing salsa separately."
    ],
    "ingredients": [
        "1/2 cup fresh lime juice",
        "1/3 cup vegetable oil",
        "1/3 cup tequila",
        "4 garlic cloves, minced",
        "1 1/2 teaspoons ground cumin",
        "1 teaspoon dried oregano, crumbled",
        "1/2 teaspoon dried crushed red pepper",
        "4 large boneless skinless chicken breast halves (about 1 1/4 pounds)",
        "4 10-inch flour tortillas",
        "3 tablespoons vegetable oil",
        "1 red bell pepper, thinly sliced",
        "1 yellow bell pepper, thinly sliced",
        "1 red onion, sliced",
        "1 garlic clove, minced",
        "2 cups shredded Monterey Jack cheese (about 8 ounces)",
        "4 canned whole green chilies (about 1 4-ounce can)",
        "Fresh cilantro",
        "Purchased salsa"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Chicken",
        "Pepper",
        "Marinate",
        "Sauté",
        "Kid-Friendly",
        "Backyard BBQ",
        "Grill",
        "Grill/Barbecue",
        "California"
    ],
    "title": "Southwestern-Style Chicken Burritos",
    "url": "http://www.epicurious.com/recipes/food/views/southwestern-style-chicken-burritos-1742"
}
