{
    "directions": [
        "Bring medium pot of water to boil. Fill medium bowl with cold water and place on work surface close to pot. Cut shallow X through skin at bottom of tomatoes. Working in batches, add tomatoes to boiling water and cook 30 seconds to blanch. Using slotted spoon, transfer each batch of tomatoes to cold water to cool quickly",
        "Using small sharp knife as aid and starting at X on bottom, pull skin off tomatoes. Using same knife, make neat sone-shaped incision around core at stem end of each tomato; remove cores. Cut tomatoes in half crosswise; squeeze out seeds. Cut tomatoes into small dice and place in large bowl. Season with salt.",
        "Heat oil in heavy medium skillet over high heat. Add garlic and sauté just until fragrant, about 30 seconds. Pour garlic oil over tomatoes and toss to blend. Mix in cilantro, onion, lime juice, chilies, tomato paste and chili powder. (Can be prepared 2 hours ahead. Let stand at room temperature.)",
        "Cook fusilli in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain fusilli well. Add fusilli and half of cheese to tomato sauce; toss to blend. Season pasta to taste with salt and pepper. Transfer past to large shallow serving bowl. Sprinkle with remaining cheese. Garnish with chopped cilantro and serve."
    ],
    "ingredients": [
        "2 3/4 pounds plum tomatoes",
        "1/3 cup olive oil",
        "2 tablespoons plus 2 teaspoons minced garlic",
        "2/3 cup chopped fresh cilantro",
        "1/3 cup chopped red onion",
        "2 tablespoons plus 2 teaspoons fresh lime juice",
        "4 teaspoons minced serrano or jalapeño chilies",
        "4 teaspoons tomato paste",
        "2 3/4 teaspoons chili powder",
        "12 ounces fusilli or other corkscrew pasta",
        "1 1/3 cups (about 6 ounces) crumbled feta cheese",
        "1/4 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pasta",
        "Tomato",
        "Vegetable",
        "Appetizer",
        "Father's Day",
        "Summer",
        "Potluck",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Southwest Fusilli with Tomatoes, Garlic and Chilies",
    "url": "http://www.epicurious.com/recipes/food/views/southwest-fusilli-with-tomatoes-garlic-and-chilies-100961"
}
