{
    "directions": [
        "For the egg rolls: Preheat the oven to 425 degrees F. Spray a rimmed baking sheet generously with cooking spray.",
        "In a large bowl, combine the cheese, corn, beans, spinach, chiles, scallions, cumin, chili powder, cayenne and salt. Stir together, making sure to break up the clumps of spinach.",
        "Have a small bowl of water ready for moistening your fingers.",
        "Lay one egg roll wrapper out on a work surface and moisten the edges with your finger. Scoop 1/4 cup of the filling into the center of the wrapper; mound into a 1-inch wide log arranged diagonally across the wrapper, with about an inch of space to the corners. Fold the corners over the filling, gently pressing down on either side to secure the fold. Then, starting at one of the unfolded corners, gently but firmly roll up the egg roll. Place on the prepared baking sheet and repeat until all of the filling has been used.",
        "Brush the tops and sides of the egg rolls generously with beaten egg. Bake until golden brown all over, 15 to 20 minutes.",
        "For the salsa: Meanwhile, pulse the tomatoes, garlic and jalapeno in a food processor until the tomatoes are almost smooth. Add the scallions, cilantro, lime juice and salt; pulse just to combine.",
        "Serve the egg rolls with the salsa on the side, for dipping."
    ],
    "ingredients": [
        "Nonstick cooking spray",
        "2 1/2 cups shredded Mexican blend cheese",
        "2 cups frozen corn, thawed",
        "One 15-ounce can black beans, rinsed and drained",
        "One 10-ounce package frozen chopped spinach, thawed and squeezed dry",
        "One 4-ounce can diced green chiles, drained",
        "4 scallions, chopped",
        "1 teaspoon ground cumin",
        "1/2 teaspoon chili powder",
        "1/4 teaspoon cayenne pepper",
        "1 1/2 teaspoons kosher salt",
        "One 16-ounce package egg roll wrappers",
        "1 egg, slightly beaten",
        "5 plum tomatoes, quartered",
        "1 small clove garlic, minced",
        "1/2 jalapeno, seeded and finely chopped",
        "3 scallions, white and light green parts only, finely chopped",
        "1 cup loosely packed cilantro leaves and stems, finely chopped",
        "Juice of 1/2 lime",
        "2 teaspoons kosher salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheese",
        "Corn Recipes",
        "Vegetable",
        "Beans and Legumes",
        "Appetizer"
    ],
    "title": "Southwestern Egg Rolls with Salsa Dipping Sauce",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/southwestern-egg-rolls-with-salsa-dipping-sauce"
}
