{
    "directions": [
        "Mix first 7 ingredients in small bowl. Rub spice blend over brisket. Wrap brisket in plastic; refrigerate at least 2 hours and up to 24 hours.",
        "Remove top rack from barbecue. Prepare barbecue (low heat). Light briquettes in chimney; pour onto 1 side of lower grill rack (you'll need to light more briquettes in chimney to replenish 2 or 3 more times during grilling). Drain 2 cups wood chips. Scatter 2 cups wood chips over coals. Return grill rack to barbecue. Heat barbecue to 300°F.",
        "Remove top rack from barbecue. Prepare barbecue (low heat). If using 2-burner grill, light 1 burner. If using 3-burner grill, do not light center burner. Drain 2 cups wood chips. Stack 2 mini loaf pans (one inside the other); fill with 1 cup wood chips. Stack remaining loaf pans; fill with 1 cup wood chips. Place pans over flame (if using 3-burner grill, place both pans on 1 lit side). Return rack to barbecue. Heat barbecue to 300°F. (If temperature rises too high on 3-burner grill, turn off burner without chips.)",
        "Unwrap brisket and arrange fat side up in 11 3/4 x 8 1/2 x 1 1/4-inch aluminum pan; place pan over unlit part of barbecue. Cover barbecue. Cook brisket until instant-read thermometer inserted into center registers 160°F, adjusting vents or adding more charcoal as needed (if using charcoal grill) or adjusting gas levels (if using gas grill) to maintain temperature inside barbecue grill at 250°F, about 31/2 hours. Baste brisket occasionally with pan juices and add more drained wood chips as needed.",
        "Remove pan with brisket. Discard pan and juices. Wrap brisket tightly in 2 wide sheets of heavy-duty foil. Place in clean 11 3/4 x 8 1/2 x 1 1/4-inch aluminum pan. Return to grill over unlit side, maintaining temperature inside grill at 250°F, until instant-read thermometer inserted into thickest part of center of brisket registers 190°F, about 1 1/2 hours longer. Transfer brisket in pan to rimmed baking sheet. Let rest at least 1 hour and up to 2 hours.",
        "Carefully unwrap brisket, saving any juices in foil. Transfer juices to small pitcher. Place brisket on work surface. Thinly slice brisket across grain; transfer to platter. Brush brisket with some of juices. Serve with any remaining juices and Ancho Chile Sauce.",
        "* Available in the spice section of many supermarkets and at Latin markets."
    ],
    "ingredients": [
        "4 teaspoons coarse kosher salt",
        "1 tablespoon (packed) golden brown sugar",
        "2 teaspoons ancho chile powder*",
        "1 teaspoon paprika",
        "1 teaspoon ground cumin",
        "1 teaspoon granulated garlic",
        "1 teaspoon coarsely ground black pepper",
        "1 5-to 5 1/2-pound flat-cut (also called first-cut) brisket with 1/4- to 1/2-inch layer of fat on 1 side",
        "4 cups hickory or oak wood chips, soaked in water 1 hour",
        "4 disposable 6 x 3 3/4 x 2-inch mini aluminum loaf pans (for wood chips, if using gas grill)",
        "2 11 3/4 x 8 1/2x1 1/4-inch disposable aluminum pans (for brisket)",
        "Heavy-duty aluminum foil",
        "Ancho Chile Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Backyard BBQ",
        "Dinner",
        "Brisket",
        "Spice",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Southwestern Barbecued Brisket with Ancho Chile Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/southwestern-barbecued-brisket-with-ancho-chile-sauce-242727"
}
