{
    "directions": [
        "Melt the butter in a large pot over medium heat. Stir in the onion, and cook until the onion has softened and turned translucent, about 5 minutes. Place the chicken breasts into the pot, skin-side-down. Pour in the chicken broth, and enough water to just cover the breasts. Bring to a simmer over high heat, then reduce heat to medium-low, cover, and simmer until the chicken begins to fall off the bone, about 1 hour. Once cooked, remove the chicken breasts from the pot. Remove and discard the skin and bone; allow the meat to cool, then tear apart into bite sized chunks.",
        "While the chicken breast are simmering, prepare the dumpling dough by whisking the flour, baking powder, and 1 1/2 teaspoons of salt together in a mixing bowl. Work the vegetable shortening in with your fingers until the mixture resembles coarse cornmeal. Make a well in the middle and pour in the milk. Stir together until a stiff dough forms. Turn out onto a floured surface, and knead until smooth. Form the dough into 12 pieces, and set aside.",
        "After you've shredded the chicken, stir the cream of chicken soup, 2 cups water, salt, pepper, and shredded chicken back into the pot. Return to a simmer over medium-high heat. Drop the dumplings into the simmering broth one at a time to keep them from sticking together. Cover, reduce heat to medium-low, and simmer until the dumplings have puffed and are no longer doughy in the center, 10 to 20 minutes."
    ],
    "ingredients": [
        "2 tablespoons butter",
        "1 onion, diced",
        "3 large bone-in chicken breast halves with skin",
        "1 (32 ounce) can chicken broth",
        "3 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1 1/2 teaspoons salt",
        "1/3 cup vegetable shortening, plus",
        "2 tablespoons vegetable shortening",
        "3/4 cup milk",
        "1 (10.75 ounce) can condensed cream of chicken soup",
        "2 cups water",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Southern Chicken and Dumplings",
    "url": "http://allrecipes.com/recipe/218560/southern-chicken-and-dumplings/"
}
