{
    "directions": [
        "Air-dry the chicken in the refrigerator for 30 minutes. Rub the dark soy sauce all over the chicken and air-dry for another hour.",
        "Heat the oil in a wok or large saucepan to 300°F/150°C, or until a cube of bread browns in 1 1/2 minutes. Carefully add the chicken and use a slotted spoon to gently roll it in the hot oil for 3–4 minutes until the skin is golden. Carefully remove the chicken from the oil and drain in a colander.",
        "Pour out most of the oil, leaving about 2 tablespoons in the wok. Add the light soy sauce, rock sugar, star anise, ginger, and 3 cups (25 fl oz/ 750 ml) water. Bring to a boil over high heat, reduce to low heat, and simmer. Put the chicken, breast side down, into the wok and cook for 18 minutes, basting with the sauce as it cooks. Turn the chicken over, cook for another 18 minutes, and baste occasionally. Turn chicken again with the breast facing down and cook for another 5 minutes, or until cooked through.",
        "Carefully transfer the chicken to a colander to drain and set aside to cool. Cut into pieces.",
        "Heat the sauce in the wok over high heat and boil for 3–4 minutes until reduced to 1/2 cup (4 fl oz/ 120 ml). Pour the sauce over the chicken, then serve with rice."
    ],
    "ingredients": [
        "1 (3 1/4-lb/1.5-kg) whole chicken",
        "1 tablespoon dark soy sauce",
        "2 cups (16 fl oz/475 ml) vegetable oil",
        "1/2 cup (4 fl oz/120 ml) light soy sauce",
        "4 oz/120 g rock sugar",
        "2 star anise",
        "3/4 oz/20 g ginger (about 1-inch/2.5-cm-length piece), sliced",
        "Steamed rice, to serve"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soy Sauce",
        "Soy",
        "Ginger",
        "Anise",
        "Dinner",
        "Braise",
        "Lunar New Year",
        "Chicken"
    ],
    "title": "Soy Sauce Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/soy-sauce-chicken"
}
