{
    "directions": [
        "Mix sesame seeds, chives, Aleppo-style pepper, and lemon zest in a small bowl to combine; season with salt.",
        "Combine brown sugar, mirin, soy sauce, and vinegar in a small saucepan. Transfer 1/4 cup mixture to a large resealable plastic bag. Working one at a time, slice chicken thighs in half lengthwise. Add to bag with marinade and massage marinade into chicken. Chill at least 2 hours or up to 12 hours.",
        "Meanwhile, bring remaining marinade to a simmer over medium-high heat and cook until reduced by half and slightly thickened (just shy of syrupy), 8–10 minutes. Remove glaze from heat.",
        "Prepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Oil grates. Thread chicken onto 6–8 skewers, folding and piling onto itself to form a compact shape. Season lightly with salt and grill over direct heat, turning every minute or so, until browned and beginning to char in spots, about 4 minutes. Move to cooler side of grill and continue to grill, basting lightly with glaze and turning every 30 seconds or so, until cooked through and coated with glaze, about 5 minutes longer. Serve chicken topped with sesame-citrus sprinkle.",
        "Glaze can be made 12 hours ahead. Let cool; cover and chill. Bring to room temperature before using."
    ],
    "ingredients": [
        "2 tablespoons toasted white and/or black sesame seeds",
        "1 tablespoon thinly sliced chives",
        "1 teaspoon Aleppo-style pepper or other mild red pepper flakes",
        "1/2 teaspoon finely grated lemon zest",
        "Kosher salt",
        "1/3 cup (packed) light brown sugar",
        "1/3 cup mirin (sweet Japanese rice wine)",
        "1/3 cup soy sauce",
        "1/4 cup unseasoned rice vinegar",
        "1 1/4 pounds skinless, boneless chicken thighs",
        "Vegetable oil (for grill)",
        "Kosher salt",
        "8 (8–12-inch-long) metal skewers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Skewer",
        "Grill",
        "Sesame",
        "Citrus",
        "Soy Sauce",
        "Chile",
        "Dinner",
        "Summer",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Soy-Basted Chicken Kebabs With Sesame-Citrus Sprinkle",
    "url": "http://www.epicurious.com/recipes/food/views/soy-sauce-chicken-kebabs-with-sesame-lemon-sprinkle"
}
