{
    "directions": [
        "Heat 1 teaspoon of the oil in a skillet over medium-low heat. Add the onion and sauté for about 2 minutes, or until wilted and slightly aromatic but not browned. Add 1 tablespoon of the saké and deglaze the pan, scraping up any browned bits. Remove the pan from the heat and allow the onion to cool to room temperature.",
        "In a bowl, combine the beef, panko, and egg. Add the miso and the cooled onion and knead with your hands to ensure even distribution. The Japanese will often gather the meat mixture, lift it, and throw it back with force into the bowl, repeating this action 4 or 5 times — a bit like baseball practice. Although the mixture will be fairly soft, the pitching ensures the meat mass will hold together. Divide the meat mixture into 4 equal portions, and shape each portion into an oval patty about 4 inches long, 2 1/2 inches wide, and 3/4 inch thick.",
        "Add the remaining 1 teaspoon oil to the same skillet you used to sauté the onion and place over medium heat. When hot, add the patties and sear on the first side until browned, about 1 minute. Flip and sear the second side, pressing to flatten. The surface may crack a bit, but this is of no concern. Lower the heat, add the remaining 1 tablespoon saké, cover, and cook for 5 to 6 minutes for medium-rare. To check for doneness, press the meat with your fingertip or the back of a spoon. It should feel fairly firm. Then, poke a patty with a toothpick. The juices should run slightly pink. For a well-done burger, cook, covered, for 8 to 10 minutes. When pressed, the meat will feel very firm and juices will run clear.",
        "In a small bowl, combine the sugar and hot water and stir to dissolve the sugar. Add the soy sauce and stir again to mix thoroughly. Return the skillet to high heat and pour the soy mixture into it, scraping the bowl with a rubber spatula to make sure all the sugar is added. Shake the skillet to coat the beef patties, and flip them once after a minute to make sure they are evenly glazed.",
        "Serve the burgers hot, spooning any extra sauce on top."
    ],
    "ingredients": [
        "2 teaspoons canola or other mild vegetable oil",
        "1 small yellow onion, finely minced",
        "2 tablespoons saké",
        "1 1/4 pounds ground round",
        "1/2 cup panko or 2 slices day-old white bread, lightly toasted and crumbled",
        "2 tablespoons beaten egg",
        "2 teaspoons dark miso, preferably Sendai miso",
        "2 tablespoons sugar",
        "1 tablespoon hot water",
        "3 tablespoons soy sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Egg",
        "Onion",
        "Sauté",
        "Lunch",
        "Summer",
        "Soy Sauce",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Soy-Glazed Beef Burger",
    "url": "http://www.epicurious.com/recipes/food/views/soy-glazed-beef-burger-234986"
}
