{
    "directions": [
        "Rinse fish and pat dry. Mix green onions, ginger, 1 tablespoon rice wine, 1 tablespoon oil, and soy sauce in 11x7x2-inch glass baking dish. Add fish and turn to coat. Let marinate 1 hour at room temperature.",
        "Bring first 6 ingredients to boil in heavy small saucepan, stirring to dissolve sugar. Reduce heat to medium and simmer until sauce is slightly thickened and reduced to 1/3 cup, about 4 minutes. Remove star anise sauce from heat and cool.",
        "Remove fish from marinade and place on several layers of paper towels to drain; reserve marinade. Pat fish dry. Heat 14-inch-diameter flat-bottomed wok over high heat until drop of water added to wok evaporates on contact. Add remaining 1 tablespoon oil to wok, then fish pieces, spreading evenly. Cover and cook 30 seconds. Uncover and loosen fish pieces with metal spatula. Reduce heat to medium and cook 1 minute. Turn fish pieces over; cook 1 minute. Add remaining 2 tablespoons rice wine and reserved marinade from fish. Cover and cook 1 minute. Remove wok from heat; let fish stand covered until just opaque in center, about 1 minute. Using metal spatula, transfer fish and sauce from wok to plate. Drizzle with some of star anise sauce. Refrigerate until cold. DO AHEAD Can be made 6 hours ahead. Cover fish and keep chilled. Cover remaining star anise sauce and let stand at room temperature.",
        "Spoon additional star anise sauce over fish; sprinkle with green onions and serve cold or at room temperature."
    ],
    "ingredients": [
        "1 1/2 pounds 3/4-inch-thick hake or pollack fillets, cut into 2x3- or 2x4-inch pieces",
        "1/2 cup chopped green onions",
        "3 tablespoons minced peeled fresh ginger",
        "3 tablespoons Shaoxing wine (Chinese rice wine) or dry Sherry, divided",
        "2 tablespoons peanut oil or vegetable oil, divided",
        "1 tablespoon soy sauce",
        "3 tablespoons sugar",
        "2 tablespoons soy sauce",
        "2 tablespoons Asian sesame oil",
        "2 tablespoons Shaoxing wine (Chinese rice wine) or dry Sherry",
        "1 tablespoon dark soy sauce",
        "1 whole star anise",
        "1/4 cup chopped green onions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Wok",
        "Fish",
        "Ginger",
        "Onion",
        "Soy",
        "Appetizer",
        "Marinate",
        "Dinner",
        "Sherry",
        "Soy Sauce",
        "Pescatarian",
        "Dairy Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Soy-Marinated Fish",
    "url": "http://www.epicurious.com/recipes/food/views/soy-marinated-fish-238273"
}
