{
    "directions": [
        "Bring a large pot of lightly salted water to a boil over high heat. Add the pasta and cook until just tender, about 9 minutes, or according to the package instructions.",
        "Meanwhile, prepare the chard and kale: Tear the leaves from their tough ribs and stems, discarding the ribs and stems. Stack the leaves and fold or roll up and slice them thinly. Transfer the greens to a colander and rinse under cold running water, then drain well.",
        "In a large fry pan over medium-high heat, warm 2 Tbs. of the olive oil. Add the garlic and red pepper flakes and cook, stirring constantly, until the garlic is fragrant but not browned, about 1 minute. Add the greens and stir to coat evenly with the oil. (If they don’t all fit at once, add in handfuls after allowing the first batch to wilt.) Cook, stirring occasionally, until the greens are tender, about 5 minutes, adding a few tablespoons of the pasta cooking water to the pan if needed to prevent sticking.",
        "Drain the pasta and return it to the warm pot. Add the cooked greens, cheese, the 1/4 tsp. salt and the remaining 2 Tbs. olive oil and stir to mix well. Divide evenly among pasta plates or bowls and serve immediately. Pass lemon wedges at the table. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Healthy in a Hurry",
        ", by Karen Ansel, MS, RD and Charity Ferreira (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "Sea salt, to taste, plus 1/4 tsp.",
        "12 oz. whole-wheat spaghetti or linguini",
        "1 bunch (about 1/2 lb.) red or green chard",
        "1 bunch (about 1/2 lb.) dinosaur (lacinato) kale",
        "4 Tbs. olive oil",
        "4 garlic cloves, pressed or minced",
        "1/4 tsp. red pepper flakes",
        "1/4 cup grated Parmigiano-Reggiano cheese",
        "Lemon wedges for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Spaghetti with Garlicky Greens",
    "url": "http://www.williams-sonoma.com/recipe/spaghetti-with-garlicky-greens.html"
}
