{
    "directions": [
        "In a large kettle bring wine and water to a boil. Add lobsters and cook, covered, 3 minutes. (They will be partially cooked.) Transfer lobsters with tongs to a large bowl and boil cooking liquid until reduced to about 1/3 cup.",
        "Twist off claws and with flat side of a heavy knife crack claws on one side. Cut off tails and cut each tail crosswise into 4 pieces, cutting through shell and discarding dark intestinal vein. Halve body sections and discard head sacs. Reserve tomalley and any roe if desired. Lobsters may be prepared up to this point 4 hours ahead and chilled, covered.",
        "In a 6-quart kettle bring 5 quarts salted water to a boil for spaghetti.",
        "In a 5-quart heavy kettle bring tomato sauce, lobster cooking liquid, and reserved tomalley and roe if using to a simmer, whisking. Add claws and bodies and simmer, covered, 5 minutes, or until claw meat is just cooked through. Transfer claws with tongs to large bowl and keep warm, covered.",
        "Add tail pieces to sauce and simmer, covered, 3 to 4 minutes, or until just cooked through. Transfer tail pieces with tongs to bowl and keep warm, covered. Remove and discard lobster bodies.",
        "Add mussels to sauce and simmer, covered, 3 to 8 minutes, checking mussels every minute or so and transferring as opened with tongs to bowl. Keep mussels warm, covered. (Discard any mussels that are unopened after 8 minutes.) Season sauce with salt and pepper and keep warm, covered.",
        "While seafood is cooking, cook spaghetti in boiling water until al dente and drain in a colander. Add spaghetti, lobster, and mussels to sauce and heat over moderate heat until heated through, stirring and tossing mixture until spaghetti is coated well with sauce.",
        "Transfer spaghetti and seafood to a large platter and sprinkle with parsley."
    ],
    "ingredients": [
        "1 cup dry white wine",
        "1 cup water",
        "two 1 1/2-pound live lobsters",
        "1 pound spaghetti",
        "4 cups spicy tomato sauce",
        "1 pound mussels (preferably cultivated), scrubbed well and beards pulled  off",
        "2 tablespoons minced fresh parsley leaves (wash and dry before mincing)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Shellfish",
        "Tomato",
        "Lobster",
        "Mussel",
        "White Wine",
        "Simmer",
        "Gourmet"
    ],
    "title": "Spaghetti with Lobster and Mussels",
    "url": "http://www.epicurious.com/recipes/food/views/spaghetti-with-lobster-and-mussels-13621"
}
