{
    "directions": [
        "Fill a 6-quart pasta pot three fourths full with salted water and bring to a boil for pasta.",
        "Tear bread into pieces and in a blender or food processor pulse to make coarse crumbs. Finely chop onion. Mince garlic. Rinse anchovies and pat dry. In a sieve rinse and drain peppers and olives. Cut peppers into 1‚-inch-long strips and quarter olives.",
        "In a deep 12-inch heavy skillet heat 2 tablespoons oil over moderate heat until hot but not smoking and stir in bread crumbs. Toast bread crumbs, stirring constantly, until golden and crisp, about 2 minutes, and transfer to a plate to cool. Wipe skillet clean.",
        "In skillet heat remaining 4 tablespoons oil over moderately high heat until hot but not smoking and cook onion, stirring, until golden brown on edges. Remove skillet from heat and add garlic and anchovies. Cook mixture over moderately low heat, stirring until fillets are dissolved, about 2 minutes. Carefully pour wine down side of skillet and simmer, stirring occasionally, until liquid is reduced to about 2 tablespoons. Remove skillet from heat and stir in peppers, olives, and 1/4 cup parsley.",
        "Cook pasta in boiling water, stirring occasionally, until al dente and ladle out and reserve 1 cup pasta water. Drain pasta in a colander and add to sauce with 1/2 cup reserved pasta water and salt and pepper to taste. Heat mixture over low heat, gently tossing (and adding more pasta water as needed if mixture becomes dry), until just heated through. Sprinkle pasta with remaining 1/4 cup parsley and some bread crumbs and serve remaining bread crumbs on the side."
    ],
    "ingredients": [
        "1 pound dried spaghetti or linguine",
        "3 slices firm white sandwich bread",
        "1 onion",
        "3 large garlic cloves",
        "8 to 10 bottled or canned flat anchovy fillets",
        "a 12-ounce jar roasted red peppers",
        "a 2 1/4-ounce jar pitted green olives (about 3/4 cup)",
        "6 tablespoons olive oil",
        "1 cup dry white wine",
        "1/2 cup chopped fresh flat-leafed parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Pasta",
        "Dinner",
        "Summer",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spaghetti with Anchovies, Olives, and Toasted Bread Crumbs",
    "url": "http://www.epicurious.com/recipes/food/views/spaghetti-with-anchovies-olives-and-toasted-bread-crumbs-101772"
}
