{
    "directions": [
        "Preheat oven to 425 degrees F.",
        "Place a large pot of water on to boil for spaghetti. When it boils, add salt and pasta and cook to al dente.",
        "Mix beef and Worcestershire, egg, bread crumbs, cheese, garlic, salt and pepper. Roll meat into 1 1/2 inch medium-sized meatballs and place on nonstick cookie sheet or a cookie sheet greased with extra-virgin olive oil. Bake balls 10 to 12 minutes, until no longer pink.",
        "Heat a deep skillet or medium pot over moderate heat. Add oil, crushed pepper, garlic and finely chopped onion. Saute 5 to 7 minutes, until onion bits are soft. Add beef stock, crushed tomatoes, and herbs. Bring to a simmer and cook for about 10 minutes.",
        "Toss hot, drained pasta with a few ladles of the sauce and grated cheese. Turn meatballs in remaining sauce. Place pasta on dinner plates and top with meatballs and sauce and extra grated cheese. Serve with bread or garlic bread (and some good chianti!)"
    ],
    "ingredients": [
        "1 pound spaghetti",
        "Salt, for pasta water",
        "1 1/4 pounds ground sirloin",
        "2 teaspoons Worcestershire sauce, eyeball it",
        "1 egg, beaten",
        "1/2 cup Italian bread crumbs, a couple of handfuls",
        "1/4 cup grated Parmesan, Parmigiano-Reggiano or Romano cheese",
        "2 cloves garlic, chopped",
        "Salt and pepper",
        "2 tablespoons extra-virgin olive oil, 2 turns of the pan",
        "1/2 teaspoon crushed red pepper flakes",
        "4 cloves garlic, crushed or chopped",
        "1 small onion, finely chopped",
        "1 cup beef stock, available on soup aisle in market in small paper boxes",
        "1 (28-ounce) can crushed tomatoes",
        "A handful chopped flat-leaf parsley",
        "10 leaves fresh basil leaves, torn or thinly sliced",
        "Grated cheese, such as Parmigiano-Reggiano or Romano, for passing at table",
        "Crusty bread or garlic bread, for passing at the table"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian Meatball",
        "Italian",
        "Meatballs",
        "Pasta Recipes",
        "Tomato",
        "Vegetable",
        "Spaghetti",
        "Cheese",
        "Meat",
        "Main Dish Recipes",
        "Sauteing Recipes",
        "Kid-Friendly"
    ],
    "title": "Spaghetti and Meatballs",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/spaghetti-and-meatballs-recipe"
}
