{
    "directions": [
        "For the meatballs: Preheat the oven to 425 degrees F.",
        "Combine the bread with the milk in a large bowl. Let soften for about 1 minute, then mash to a paste with a fork. Add the beef, pork, egg, Worcestershire, granulated garlic, granulated onion, 2 tablespoons pecorino, 2 teaspoons salt and 1/2 teaspoon pepper. Mix until well blended. Form into twelve 2-inch balls (about 1/4 cup each) and place on a plate or tray.",
        "Heat the olive oil in a large skillet over medium heat. Sear the meatballs on all sides until a crust forms, about 2 minutes per side. Transfer to a baking dish.",
        "Bake until cooked through, 20 to 25 minutes.",
        "For the pasta and sauce: In a large pot, cook the spaghetti according to package directions. Drain and set aside.",
        "To a pan over medium heat, add the olive oil, tomatoes, broth, butter, and basil and parsley. Simmer until the tomatoes are soft, 4 to 5 minutes. Add the pecorino to help thicken the sauce, and season with a pinch of salt and pepper. Stir in the cooked pasta and top with the meatballs. Garnish with some more pecorino and basil-parsley mix."
    ],
    "ingredients": [
        "2 slices soft white bread, torn into pieces",
        "1/2 cup milk",
        "1 pound ground beef",
        "8 ounces ground pork",
        "1 egg, lightly beaten",
        "1 teaspoon Worcestershire sauce",
        "2 teaspoons granulated garlic",
        "2 teaspoons granulated onion",
        "2 tablespoons grated pecorino, plus 1/2 cup for topping",
        "Kosher salt and ground black pepper",
        "1/4 cup olive oil",
        "8 ounces spaghetti",
        "1/4 cup extra-virgin olive oil",
        "2 cups chopped fresh tomatoes",
        "1 cup chicken broth",
        "1 stick (8 tablespoons) butter",
        "1/4 cup chopped fresh basil and parsley mix, plus for garnish",
        "1 cup grated pecorino, plus for garnish",
        "Kosher salt and ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Meatballs",
        "Pasta Recipes",
        "Meat",
        "Spaghetti",
        "Main Dish Recipes"
    ],
    "title": "Spaghetti and Meatballs",
    "url": "http://www.foodnetwork.com/recipes/nancy-fuller/spaghetti-and-meatballs"
}
