{
    "directions": [
        "Cook spaghetti in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain. Transfer pasta to large wide bowl.",
        "Meanwhile, melt 2 tablespoons butter with oil in heavy large skillet over medium heat. Add shallots; sauté 1 minute. Add shiitake mushrooms; sprinkle with salt and pepper. Sauté shiitake mixture until soft, about 6 minutes. Add lemon juice; cook 1 minute. Add broth and lemon peel. Bring to boil, then reduce to medium and simmer until liquid is reduced by half, about 6 minutes. Add asparagus to mushroom mixture; simmer until asparagus turns bright green, about 2 minutes. Add chives and remaining 2 tablespoons butter and stir until butter melts. Season sauce to taste with salt and pepper.",
        "Pour sauce over pasta; toss to coat. Top with shaved Asiago and serve.",
        "*Available at some supermarkets, and at Italian markets and specialty food stores."
    ],
    "ingredients": [
        "12 ounces spaghetti",
        "4 tablespoons butter, divided",
        "2 tablespoons extra-virgin olive oil",
        "1/2 cup thinly sliced shallots (about 4)",
        "1 pound fresh shiitake mushrooms, stemmed, sliced",
        "6 tablespoons fresh lemon juice",
        "1 3/4 cups vegetable broth",
        "1 tablespoon grated lemon peel",
        "1 pound asparagus, tough ends trimmed, cut crosswise in thirds",
        "1/4 cup chopped fresh chives",
        "4 ounces shaved Asiago cheese*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Citrus",
        "Mushroom",
        "Pasta",
        "Sauté",
        "Vegetarian",
        "Quick & Easy",
        "High Fiber",
        "Asparagus",
        "Spring",
        "Chive",
        "Shallot"
    ],
    "title": "Spaghetti with Asparagus, Shiitake Mushrooms, Lemon, and Chives",
    "url": "http://www.epicurious.com/recipes/food/views/spaghetti-with-asparagus-shiitake-mushrooms-lemon-and-chives-234432"
}
