{
    "directions": [
        "Rinse kale. Drain; transfer to bowl with some water still clinging.",
        "Heat 2 tablespoons olive oil in heavy large pot over medium heat. Add chopped onion and cook until soft and translucent, stirring occasionally, about 6 minutes. Add sliced garlic and sprinkle with salt; cook until onion is golden brown, stirring occasionally, about 5 minutes. Add kale and remaining 1 tablespoon olive oil and toss until wilted, about 3 minutes. Cover pot and reduce heat to medium-low. Continue cooking until kale is very tender, stirring occasionally and adding water by teaspoonfuls if dry, about 20 minutes.",
        "Meanwhile, cook spaghetti in medium pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain, reserving 1/4 cup cooking liquid. Add cooked spaghetti to kale mixture in pot. Add lemon juice and 2 tablespoons reserved cooking liquid; toss to combine, adding more liquid by tablespoonfuls if dry. Sprinkle spaghetti with grated Parmesan cheese and serve."
    ],
    "ingredients": [
        "1 pound lacinato kale (about 2 bunches), large center ribs and stems removed, cut crosswise into 1/2-inch slices",
        "3 tablespoons olive oil, divided",
        "1 medium onion, finely chopped (about 1 1/2 cups)",
        "8 large garlic cloves, thinly sliced",
        "1/2 pound spaghetti",
        "2 teaspoons fresh lemon juice",
        "Finely grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Pasta",
        "Appetizer",
        "Sauté",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Parmesan",
        "Kale",
        "Fall",
        "Low Cholesterol",
        "Lemon Juice",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spaghetti with Braised Kale",
    "url": "http://www.epicurious.com/recipes/food/views/spaghetti-with-braised-kale-355213"
}
