{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Cut ends off spaghetti squash; pierce skin in several places with a sharp knife. Transfer to a glass baking dish.",
        "Bake in the preheated oven until interior can be easily pierced with a fork, about 1 hour. Cool until easily handled, at least 20 minutes. Cut in half. Scoop out seeds and discard. Scrape flesh into strands with a fork.",
        "Heat olive oil in a slow cooker on High. Add onion, green onions, and garlic; cook and stir in the open cooker until tender, about 10 minutes. Stir in apple and butter. Add sausage; cook and stir for 5 minutes.",
        "Pour chicken stock and white cooking wine into the slow cooker. Cook until heated through, about 20 minutes. Stir in potatoes; cook, covered, on Low for 20 minutes.",
        "Stir spaghetti squash strands and spinach into the slow cooker. Mix in heavy cream, Parmesan cheese, salt, hot sauce, thyme, pepper, sage, and red pepper flakes. Cover and cook on Low until flavors combine, about 8 hours."
    ],
    "ingredients": [
        "1 (2 pound) spaghetti squash",
        "1/4 cup olive oil",
        "1/2 sweet onion, chopped",
        "6 green onions, white parts only, chopped",
        "4 cloves garlic, chopped",
        "1 Granny Smith apple, peeled and chopped",
        "1/4 cup butter",
        "14 ounces Polish sausage, sliced",
        "6 cups no-salt-added chicken stock",
        "1/2 cup white cooking wine",
        "2 potatoes, peeled and diced",
        "1/2 (5 ounce) package frozen cut spinach",
        "1/2 cup heavy whipping cream",
        "1/4 cup grated Parmesan cheese",
        "2 teaspoons sea salt",
        "1 teaspoon hot sauce (such as Cholula®)",
        "1/2 teaspoon ground thyme",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon ground sage",
        "1/4 teaspoon red pepper flakes"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spaghetti Squash and Polish Sausage Slow Cooker Soup",
    "url": "http://allrecipes.com/recipe/255395/spaghetti-squash-and-polish-sausage-s/"
}
