{
    "directions": [
        "Heat oil in heavy large saucepan over medium-high heat. Add garlic and sauté 1 minute. Add crushed tomatoes, diced tomatoes with juices and sugar. Simmer over medium heat for 15 minutes, stirring occasionally. Add stock and wine. Simmer uncovered until reduced to 5 cups, about 20 minutes. Remove from heat. Whisk in butter. Season with salt and pepper. (Can be made 2 days ahead. Cool. Cover and chill.)",
        "Preheat oven to 375°F. Combine beef, breadcrumbs, chilies, 1/4 cup tomato sauce, pine nuts, onion, bell pepper, egg, tomato paste, garlic, salt, pepper, fennel and thyme in large bowl; mix well. Using 1 heaping tablespoon for each, form mixture into balls; transfer to 2 baking sheets. Bake until cooked through, about 15 minutes.",
        "Bring tomato sauce to simmer. Add meatballs and simmer 1 minute.",
        "Meanwhile, cook spaghetti in large pot of boiling salted water until tender but still firm to bite. Drain well, reserving 1 cup cooking liquid. Transfer cooked spaghetti to large serving bowl. Add tomato sauce and meatballs and toss to coat. Add reserved cooking liquid to spaghetti by tablespoonfuls to moisten if necessary. Serve, passing Parmesan separately."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "3 garlic cloves, chopped",
        "1 28-ounce can crushed tomatoes",
        "2 14 1/2-ounce cans diced tomatoes in juice",
        "Pinch of sugar",
        "2/3 cup chicken stock or canned low-salt chicken broth",
        "1/3 cup red wine",
        "1 tablespoon butter",
        "1 pound lean ground beef",
        "1/3 cup fresh breadcrumbs made from white bread",
        "1/4 cup diced canned mild green chilies",
        "1/4 cup pine nuts, toasted",
        "1/4 cup chopped onion",
        "1/4 cup chopped green bell pepper",
        "1 large egg, beaten to blend",
        "1 tablespoon tomato paste",
        "2 garlic cloves, minced",
        "1 teaspoon salt",
        "1 teaspoon pepper",
        "1/2 teaspoon fennel seeds",
        "1/4 teaspoon dried thyme",
        "20 ounces (1 1/4 pounds) spaghetti",
        "Freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Dairy",
        "Nut",
        "Pasta",
        "Pepper",
        "Tomato",
        "Dinner",
        "Parmesan",
        "Meat",
        "Ground Beef",
        "Pine Nut",
        "Fall",
        "Winter",
        "Party",
        "Noodle"
    ],
    "title": "Spaghetti with Green Chili-Pine Nut Meatballs",
    "url": "http://www.epicurious.com/recipes/food/views/spaghetti-with-green-chili-pine-nut-meatballs-103903"
}
