{
    "directions": [
        "Bring a large pot of salted water to a boil. Meanwhile, strip kale leaves from ribs and stems, then tear leaves crosswise into 2\"–3\" pieces. Cook kale in boiling water until bright green and slightly softened, about 2 minutes. Using tongs, transfer kale to a colander and rinse under cold water, tossing; squeeze out excess liquid from leaves. Keep water at a boil (you’ll use it for the pasta).",
        "Whack garlic with the side of a chef’s knife to crush; peel off skins. Heat 1/4 cup oil in a large heavy pot over medium. Cook garlic, stirring occasionally, until sizzling, about 3 minutes. Season very generously with black pepper and cook, smashing with a wooden spoon, until cloves break into rough pieces, soften, and look golden. Add kale to pot and cook, stirring often, until darkened in color and very tender, about 8 minutes (garlic will break into even smaller pieces). Season with kosher salt and pepper.",
        "Meanwhile, cook pasta, stirring occasionally, until very al dente (2–3 minutes less than package directions).",
        "Using tongs, add pasta to kale; splash in about 1 cup pasta cooking liquid. Cook, tossing and adding more pasta cooking liquid as needed, until sauce lightly coats pasta, about 2 minutes.",
        "Serve pasta topped with Parmesan, red pepper flakes, sea salt, and more black pepper."
    ],
    "ingredients": [
        "Kosher salt",
        "3 large or 4 smaller bunches kale, any type (about 1 1/2 pounds)",
        "5 garlic cloves",
        "1/4 cup olive oil, plus more for drizzling",
        "Freshly ground black pepper",
        "12 ounces spaghetti, thick spaghetti, bucatini, or other long strand pasta",
        "Parmesan and crushed red pepper flakes (for serving)",
        "Flaky sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Kale",
        "Garlic",
        "Dinner",
        "Quick & Easy",
        "Quick and Healthy"
    ],
    "title": "Spaghetti Aglio e Olio With Lots of Kale",
    "url": "http://www.epicurious.com/recipes/food/views/spaghetti-aglio-e-olio-with-lots-of-kale"
}
