{
    "directions": [
        "Cook the ground beef in a large pot over high heat, stirring quickly and constantly until completely browned 7 to 10 minutes. Stir the onion into the beef; cook and stir until the onion begins to turn translucent, about 5 minutes more. Drain excess grease from meat mixture. Add the mushroom to the mixture; allow to cook until it begins to soften, 1 to 2 minutes. Pour the diced tomatoes and tomato soup into the pot, stir, reduce heat to medium, and bring the mixture to a simmer.",
        "Add the Worcestershire sauce, garlic and herb seasoning blend, lemon juice, garlic, chili powder, Cajun seasoning, basil, vanilla extract, black pepper, and salt to the mixture, stirring each into the mixture before adding the next. Reduce heat to low and allow the mixture to simmer for 30 minutes.",
        "Bring a large pot of lightly salted water to a rolling boil. Add the spaghetti and olive oil to the pot and cook the pasta at a boil until cooked through yet firm to the bite, about 12 minutes. Drain. Top with the Bolognese sauce to serve."
    ],
    "ingredients": [
        "2 pounds lean ground beef",
        "1 large white onion, diced",
        "1 large portobello mushroom, diced, or more to taste",
        "2 (14.5 ounce) cans petite diced tomatoes",
        "3 (10 ounce) cans condensed tomato soup",
        "1/2 cup Worcestershire sauce",
        "1 1/2 tablespoons garlic and herb seasoning blend (such as Mrs. Dash®)",
        "1 tablespoon lemon juice",
        "1 tablespoon minced garlic",
        "1/4 cup chili powder (optional)",
        "3 tablespoons Cajun seasoning (optional)",
        "1/2 teaspoon dried basil",
        "1/4 teaspoon vanilla extract",
        "1/4 teaspoon black pepper",
        "1/2 teaspoon salt",
        "1 (16 ounce) package spaghetti",
        "1 1/2 tablespoons extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spaghetti Bolognese",
    "url": "http://allrecipes.com/recipe/217377/spaghetti-bolognese/"
}
