{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Spray a 9x13-inch baking dish and squash lightly with olive oil cooking spray. Place squash, cut-side down, in the baking dish.",
        "Bake squash in the preheated oven until easily pierced with a knife, about 30 minutes. Remove from oven and let cool until easily handled.",
        "Reduce oven temperature to 350 degrees F (175 degrees C).",
        "Cook ground beef and onion in a large skillet over medium heat until meat is cooked through and no longer pink, about 5 minutes. Drain. Stir in both cans diced tomatoes with green chiles, spinach, applesauce, red bell pepper, tomato paste, garlic salt, basil, oregano, and black pepper; mix well. Remove from heat.",
        "Use a fork to scrape insides of squash into spaghetti strands. Lightly grease baking dish again and place squash strands on the bottom. Pour the beef mixture over the squash. Pour beaten eggs on top and mix well to combine.",
        "Bake in the preheated oven, uncovered, until firm and golden on top, about 1 hour."
    ],
    "ingredients": [
        "1 spaghetti squash, cut in half lengthwise and seeded",
        "olive oil cooking spray",
        "1 pound lean ground beef",
        "1/2 cup diced red onion",
        "1 (10 ounce) can diced tomatoes and green chiles (such as RO*TEL® Mild)",
        "1 (10 ounce) can diced tomatoes with green chiles (such as RO*TEL® Original), drained",
        "1 cup chopped baby spinach",
        "1/2 cup unsweetened applesauce",
        "1/2 cup diced red bell pepper",
        "2 tablespoons tomato paste",
        "1 teaspoon garlic salt",
        "1 teaspoon dried basil",
        "1 teaspoon dried oregano",
        "1/2 teaspoon ground black pepper",
        "3 eggs, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spaghetti Squash Pie (Gluten Free and Dairy Free)",
    "url": "http://allrecipes.com/recipe/245545/spaghetti-squash-pie-gluten-free-and/"
}
