{
    "directions": [
        "Place a large nonstick fry pan over medium-high heat. Add the pancetta and sauté until beginning to brown, about 3 minutes. Add the shallot and stir for 2 minutes. Add the wine and boil, stirring to scrape up the browned bits, until reduced by half, about 30 seconds. Remove the pan from the heat.",
        "Bring a large pot three-fourths full of salted water to a boil over high heat. Add the pasta, stir well and cook for 5 minutes. Add the kale and cook until the pasta is al dente, about 5 minutes more.",
        "Meanwhile, in a small bowl, beat the eggs with a fork. Mix in both cheeses and a generous amount of pepper.",
        "Remove 1/2 cup (4 fl. oz./125 ml) of the pasta cooking water and reserve. Drain the pasta. Reheat the pancetta mixture briefly, then remove from the heat. Add the pasta and kale to the fry pan. Gradually whisk 1/4 cup (2 fl. oz./60 ml) of the reserved pasta cooking water into the egg mixture. Add the egg mixture to the fry pan and stir until it coats the pasta and is creamy, not wet and runny. If the egg mixture does not become creamy, set the pan over very low heat and stir constantly just until it becomes creamy, watching carefully (do not boil). Immediately remove the pan from the heat. Mix in enough of the remaining 1/4 cup pasta cooking liquid to form a silky texture.",
        "Divide the pasta between 2 warmed bowls and serve immediately. Serves 2; can be doubled.",
        "Quick tips:",
        "To prevent overcooking, which will cause curdling, take the fry pan off the heat before mixing in the egg mixture. Then, only if necessary, cook over very low heat and stir constantly just until the eggs start to thicken.",
        "Adapted from Williams-Sonoma",
        "Weeknight Fresh & Fast,",
        "by Kristine Kidd (Williams-Sonoma, 2011)."
    ],
    "ingredients": [
        "3 oz. (90 g), pancetta, chopped",
        "1 large shallot, minced",
        "1/4 cup (2 fl. oz./60 ml) dry white wine",
        "Salt, to taste",
        "6 to 8 oz. (185 to 250 g) dried spaghetti, preferably multigrain",
        "1 bunch black kale or other hearty greens, chopped",
        "2 eggs",
        "1/2 cup (2 oz./60 g) grated Parmigiano-Reggiano cheese",
        "1/4 cup (1 oz./30 g) grated Romano cheese",
        "Freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Spaghetti Carbonara with Black Kale",
    "url": "http://www.williams-sonoma.com/recipe/spaghetti-carbonara-with-black-kale.html"
}
