{
    "directions": [
        "Cook pasta in a large pot ofboiling salted water until barely al dente.",
        "While pasta is cooking, stir together bread crumbs, 1 tablespoon olive oil, and 1/4 teaspoon salt in a bowl until combined well. Transfer to a 12-inch heavy skillet and cook over moderate heat, stirring, until golden, 3 to 5 minutes, then return to bowl.",
        "Heat 2 tablespoons butter and remaining 2 tablespoons oil in skillet over moderately high heat until foam subsides, then sauté mushrooms, stirring, until golden, about 4 minutes. Add zest and garlic and sauté, stirring, until mushrooms exude liquid, about 3 minutes. Add Worcestershire sauce and lemon juice and cook until most of liquid is evaporated, about 2 minutes. Stir in thyme, pepper, and remaining 3/4 teaspoon salt.",
        "Reserve 1 cup pasta cooking water, then drain pasta in a colander.",
        "Transfer mushrooms to pasta pot, then add 1/2 cup reserved cooking water and bring to a boil. Stir in parsley and remaining 2 tablespoons butter. Return pasta to pot and add cheese, tossing to combine. If pasta seems dry, moisten with more cooking water.",
        "Serve pasta sprinkled with bread crumbs and additional cheese."
    ],
    "ingredients": [
        "1 lb spaghetti",
        "1 cup coarse fresh bread crumbs (from 2 slices firm white sandwich bread)",
        "3 tablespoons olive oil",
        "1 teaspoon salt",
        "1/2 stick (1/4 cup) unsalted butter",
        "1 1/2 lb cremini mushrooms, trimmed and cut into 1/4-inch-thick slices (6 cups)",
        "1 teaspoon freshly grated lemon zest",
        "3 garlic cloves, chopped (1 tablespoon)",
        "1 teaspoon Worcestershire sauce",
        "2 tablespoons fresh lemon juice",
        "1 teaspoon minced fresh thyme",
        "1/2 teaspoon black pepper",
        "2 tablespoons minced fresh parsley",
        "1 oz finely grated Parmigiano-Reggiano (1/2 cup) plus additional for serving",
        "Garnish: lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Herb",
        "Mushroom",
        "Pasta",
        "Sauté",
        "Vegetarian",
        "Quick & Easy",
        "Winter",
        "Boil",
        "Gourmet"
    ],
    "title": "Spaghetti with Cremini Mushrooms, Lemon, and Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/spaghetti-with-cremini-mushrooms-lemon-and-thyme-109024"
}
