{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Coat large baking dish with cooking spray.",
        "Place spaghetti squash cut-side down in prepared baking dish.",
        "Bake in preheated oven until spaghetti squash is tender when pierced with a fork, about 45 minutes. Turn squash over and bake for another 5 minutes. Remove spaghetti squash from oven. Scrape the strands from the skin and place into a large bowl.",
        "Heat 1 tablespoon of olive oil in a large skillet over medium heat. Add Italian sausage and cook, stirring occasionally, until sausage is brown and crumbly, 5 to 8 minutes. Remove sausage.",
        "Return skillet to heat; add 1 tablespoon olive oil, spring onions, and garlic, cook and stir until onions are softened, about 5 minutes. Add zucchini, red peppers, and Italian seasoning and continue to cook and stir until the vegetables are soft, about 5 minutes.",
        "Stir spaghetti squash and feta cheese into vegetable mixture; cook and stir until cheese melts, about 3 minutes. Stir sausage into vegetable mixture; season with salt and lemon pepper. Sprinkle tomato and parsley on top to serve."
    ],
    "ingredients": [
        "cooking spray",
        "1 spaghetti squash, halved lengthwise and seeded",
        "2 tablespoons olive oil, divided",
        "3 (4 ounce) Italian sausage links, casings removed",
        "2 spring onions, finely chopped",
        "3 cloves garlic, minced",
        "1 zucchini, diced",
        "1 red bell pepper, seeded and diced",
        "1 tablespoon Italian seasoning",
        "4 ounces crumbled feta cheese, or more to taste",
        "sea salt to taste",
        "1 pinch lemon pepper, or to taste",
        "1 small tomato, finely chopped",
        "1 tablespoon chopped fresh parsley, or as desired (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spaghetti Squash Mediterranean-Style",
    "url": "http://allrecipes.com/recipe/228544/spaghetti-squash-mediterranean-style/"
}
