{
    "directions": [
        "Heat butter and 2 tablespoons oil in a large heavy pot over medium-low heat. Add garlic and red pepper flakes and cook, stirring often, until beginning to brown, about 2 minutes. Add tomatoes with juices, crushing tomatoes lightly with your hands. Increase heat to medium-high. Cook, stirring often, until sauce thickens, 10-15 minutes.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, reserving 1 1/2 cups pasta cooking liquid.",
        "Add beans and wine to sauce. Cook, stirring often, until wine has almost evaporated, about 4 minutes. Add mussels and 1/4 cup pasta cooking liquid. Cover; cook, stirring occasionally, until mussels open, about 4 minutes (discard any that do not open).",
        "Add pasta and 1/4 cup pasta cooking liquid to mussels and stir to coat. Reduce heat to medium and continue stirring, adding more cooking liquid as needed, until sauce coats pasta. Divide among bowls. Drizzle with oil; garnish with parsley."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) unsalted butter",
        "4 tablespoons olive oil, divided, plus more for drizzling",
        "4 garlic cloves, chopped",
        "1/2 teaspoons crushed red pepper flakes",
        "1 28-ounce can whole peeled tomatoes",
        "1 pound spaghetti",
        "Kosher salt",
        "1 15-ounce can cannellini (white kidney) beans, rinsed",
        "1 cup dry white wine",
        "2 pounds mussels, scrubbed, debearded",
        "1/4 cup chopped flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Pasta",
        "Shellfish",
        "Tomato",
        "Dinner",
        "Seafood",
        "Mussel",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spaghetti With Mussels and White Beans",
    "url": "http://www.epicurious.com/recipes/food/views/spaghetti-with-mussels-and-white-beans-51143820"
}
