{
    "directions": [
        "Rub coarse salt and coriander into pork belly. Cover and chill at least 4 hours and up to 2 days.",
        "Preheat oven to 275°F. Place pork belly in large ovenproof saucepan. Add onion, next 5 ingredients, 2 tablespoons wine, and chicken broth. Bring to boil, cover, and transfer to oven. Cook until pork is very tender when pierced with fork, turning every 30 minutes, about 2 hours 15 minutes. Cool slightly. Cover and chill at least 1 day and up to 2 days.",
        "Discard any solidified fat on surface of pork belly mixture. Remove pork from cooking liquid, scraping any gelatinous mixture back into saucepan. Rewarm mixture in saucepan just until melted. Strain liquid into measuring cup. Add white wine if necessary to measure 1/2 cup. Cut rind and all but 1/4-inch layer of fat from pork belly. Slice pork crosswise into 1/2-inch slices, then cut slices crosswise into 1/2-inch-thick strips.",
        "Heat oil in heavy large skillet over medium-high heat. Add pork belly and cook until browned on all sides, stirring often, about 7 minutes. Add garlic and sauté 1 minute. Add pork cooking liquid and 1/4 cup wine. Bring to boil, then cover and keep warm.",
        "Cook spaghetti in large pot of boiling salted water until almost tender but still firm to bite, stirring occasionally. Add peas; cook 1 minute longer.",
        "Meanwhile, whisk eggs in large bowl. Add 1/4 cup Parmesan cheese, Pecorino Romano cheese, and parsley; set aside.",
        "Drain pasta, reserving 1 cup cooking liquid. Whisk 1/4 cup hot cooking liquid into egg mixture. Add pasta; toss to coat. Add mixture to skillet with pork and toss, adding more cooking liquid by tablespoonfuls if dry. Season generously with black pepper. Divide among bowls and serve, passing remaining 1/4 cup Parmesan cheese alongside."
    ],
    "ingredients": [
        "1/2 teaspoon coarse kosher salt",
        "1/2 teaspoon coriander seeds, crushed",
        "1 pound fresh pork belly",
        "1 small onion, quartered",
        "1 small carrot, peeled, quartered",
        "1/2 celery stalk, cut into 2-inch pieces",
        "2 garlic cloves, peeled, smashed",
        "1 bay leaf",
        "1/4 teaspoon whole black peppercorns",
        "2 tablespoons (or more) dry white wine",
        "1/2 cup low-salt chicken broth",
        "2 tablespoons olive oil",
        "1 garlic clove, minced",
        "1/4 cup dry white wine",
        "1 pound spaghetti",
        "1 1/2 cups fresh shelled peas (from about 1 1/2 pounds peas in pods) or 1 1/2 cups frozen petite peas, thawed",
        "2 large eggs",
        "1/2 cup grated Parmesan cheese, divided",
        "1/4 cup grated Pecorino Romano cheese",
        "1/4 cup chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Garlic",
        "Herb",
        "Onion",
        "Pasta",
        "Pork",
        "Vegetable",
        "Dinner",
        "Lunch",
        "Spring",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spaghetti Carbonara with Pork Belly and Fresh Peas",
    "url": "http://www.epicurious.com/recipes/food/views/spaghetti-carbonara-with-pork-belly-and-fresh-peas-237910"
}
