{
    "directions": [
        "Mix beef, grated onion, quinoa, milk, 2 cloves minced garlic, egg, 2 tablespoons basil, 2 tablespoons oregano, 1 teaspoon red pepper flakes, salt, and black pepper together in a bowl until evenly combined. Form mixture into 1 1/2-inch meatballs.",
        "Heat 1 tablespoon olive oil in a large skillet over medium-high heat. Working in batches, cook meatballs in hot oil until browned on all sides, 5 to 10 minutes.",
        "Fill a large pot with 2 to 3 inches of cold water, 1 teaspoon olive oil, and a pinch of salt. Place spaghetti squash, cut side down, into pot. Cover the pot with a lid and place over high heat; cook until squash is tender, about 20 minutes. Drain and shred squash into \"noodles\" by scraping out the flesh with a fork.",
        "Heat 2 tablespoons olive oil in a large, deep skillet over medium-high heat. Saute chopped onion, 2 cloves minced garlic, and 1 teaspoon red pepper flakes in hot oil until soft and translucent, 5 to 7 minutes. Stir mushrooms, green bell pepper, zucchini, and olives into onion mixture; saute until slightly softened, 3 to 5 minutes. Add tomatoes, 2 tablespoons basil, 2 tablespoons oregano, and honey; bring to a simmer.",
        "Gently stir meatballs into tomato mixture, return to a simmer, and cook, stirring occasionally, until meatballs are heated through and vegetables are tender, 20 to 30 minutes. Divide squash \"noodles\" between serving bowls and ladle sauce and meatballs over the top."
    ],
    "ingredients": [
        "Meatballs:",
        "1 pound lean ground beef",
        "1 onion, grated",
        "1/2 cup cooked quinoa",
        "1/4 cup milk",
        "2 cloves garlic, minced",
        "1 egg, beaten",
        "2 tablespoons chopped fresh basil",
        "2 tablespoons chopped fresh oregano",
        "1 teaspoon red pepper flakes",
        "salt and ground black pepper to taste",
        "1 tablespoon olive oil",
        "Pasta:",
        "1 teaspoon olive oil, or to taste",
        "salt to taste",
        "1 large spaghetti squash, halved and seeded",
        "Sauce:",
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1 teaspoon red pepper flakes",
        "1 cup sliced fresh mushrooms",
        "1 small green bell pepper, chopped",
        "1/2 zucchini, sliced",
        "1 (4 ounce) can sliced black olives",
        "1 (14.5 ounce) can crushed tomatoes",
        "2 tablespoons chopped fresh basil",
        "2 tablespoons chopped fresh oregano",
        "1 tablespoon honey"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spaghetti and Meatballs Paleo-Style",
    "url": "http://allrecipes.com/recipe/239862/spaghetti-and-meatballs-paleo-style/"
}
