{
    "directions": [
        "Heat oil in heavy large saucepan over medium heat. Add carrot, bell pepper, onion and garlic and saut´ until tender, about 10 minutes. Add crushed tomatoes with puree, stewed tomatoes with juices, wine, dried red pepper and oregano. Bring to simmer. Cook sausage in heavy medium skillet over medium-high heat until cooked through, breaking up with back of spoon, about 5 minutes. Using slotted spoon, transfer sausage to sauce. Reserve dripping in skillet. Cover sauce partially and simmer 1 1/2 hours, stirring occasionally.",
        "Add mushrooms and zucchini to skillet with drippings; saut´ over medium-high heat until tender, about 5 minutes. Stir into sauce. Simmer uncovered until sauce is thick, about 20 minutes. Add sugar and vinegar. Season with salt, pepper and more dried red pepper, if desired. (Can be made 1 day ahead. Cover; chill. Bring to simmer before using.)",
        "Cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain. Transfer pasta to large bowl. Toss pasta with enough sauce to coat. Sprinkle with parsley. Serve, passing Parmesan and remaining sauce separately."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 carrot, grated",
        "1 red bell pepper, seeded, chopped",
        "1/2 onion, chopped",
        "4 garlic cloves, chopped",
        "1 28-ounce can crushed tomatoes with added puree",
        "1 14 1/2-ounce can Italian-style stewed tomatoes",
        "1/2 cup dry red wine",
        "1 1/4 teaspoons (or more) dried crushed red pepper",
        "2 teaspoons dried oregano",
        "1/2 pound hot Italian sausage, casings removed",
        "4 ounces mushrooms, sliced",
        "2 zucchini, chopped",
        "Generous pinch of sugar",
        "Dash of balsamic vinegar",
        "1 1/2 pounds spaghettini or other pasta",
        "Chopped fresh parsley",
        "Freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Pork",
        "Tomato",
        "Vegetable",
        "Sausage",
        "Fall",
        "California"
    ],
    "title": "Spaghettini with Spicy Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spaghettini-with-spicy-tomato-sauce-1057"
}
