{
    "directions": [
        "Prepare barbecue (medium heat). Arrange vegetables on baking sheets. Brush with oil; sprinkle with salt and pepper. Grill peppers, skin side down and without turning, until blackened and blistered, moving occasionally for even cooking, about 10 minutes. Enclose in plastic bag. Let stand until skins loosen, about 30 minutes. Grill eggplants and zucchini until charred and tender, turning and rearranging for even browning, 5 to 6 minutes. Place on foillined baking sheet. Peel peppers. Transfer to sheet with eggplants and zucchini.",
        "Heat 3 tablespoons olive oil in medium skillet over medium heat. Add garlic and crushed red pepper; stir until fragrant, about 30 seconds. Add breadcrumbs; stir until golden, about 3 minutes. Season breadcrumb picada to taste with salt; scrape into small bowl.",
        "Place vinegar in another small bowl; whisk in 3 tablespoons oil. Mix in parsley and oregano. Season to taste with salt.",
        "Arrange vegetables on platter. Spoon herb dressing over; sprinkle with breadcrumbs."
    ],
    "ingredients": [
        "3 large red bell peppers (about 1 1/2 pounds), stemmed, seeded, quartered",
        "4 large Japanese eggplants (about 1 1/4 pounds), trimmed, cut lengthwise into 3 slices",
        "4 medium green or yellow zucchini (preferably 2 of each; about 1 pound), trimmed, cut lengthwise into 1/3-inch-thick slices",
        "Extra-virgin olive oil (for grilling)",
        "6 tablespoons extra-virgin olive oil, divided",
        "2 garlic cloves, finely chopped",
        "1/2 teaspoon dried crushed red pepper",
        "1/2 cup panko (Japanese breadcrumbs)*",
        "2 tablespoons Sherry wine vinegar",
        "1/4 cup chopped fresh Italian parsley",
        "2 tablespoons chopped fresh oregano",
        "*Available in the Asian foods section of some supermarkets and at Asian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Pepper",
        "Vegetable",
        "Side",
        "Vegetarian",
        "Backyard BBQ",
        "Eggplant",
        "Bell Pepper",
        "Squash",
        "Zucchini",
        "Summer",
        "Grill/Barbecue",
        "Vegan",
        "Yellow Squash",
        "Pescatarian",
        "Dairy Free",
        "Kosher"
    ],
    "title": "Spanish-Style Grilled Vegetables with Breadcrumb Picada",
    "url": "http://www.epicurious.com/recipes/food/views/spanish-style-grilled-vegetables-with-breadcrumb-picada-238806"
}
