{
    "directions": [
        "Bring a large kettle or pot of water to a boil. Season the chicken and sausage with 2 teaspoons salt, 1 teaspoon pepper and the marjoram. Heat the olive oil in a heavy-bottomed pot over high heat. Add the chicken and sausage and brown on all sides, about 5 minutes. Transfer to a plate with a slotted spoon.",
        "Add the onions, garlic, bay leaves and tomato puree to the pot. Reduce the heat and cook, stirring, until the oil turns deep red and the onions are tender, 6 to 8 minutes. If the onions are sticking, add a splash of water and scrape the bottom of the pan with a wooden spoon.",
        "Add the spaghetti to the onion mixture and stir-fry until golden, about 6 minutes. Add the chicken and sausage and enough boiling water to cover the pasta by 1/2 inch. Simmer, stirring once or twice, until the pasta is al dente and the sauce thickens, about 10 minutes. Season with salt and pepper and garnish with cheese, if desired.",
        "Photograph by Antonis Achilleos"
    ],
    "ingredients": [
        "3/4 pound skinless, boneless chicken thighs, cut into 1/2-inch chunks",
        "1/2 pound sweet or hot Italian sausage, cut into 1/2-inch chunks",
        "Kosher salt and freshly ground pepper",
        "1 teaspoon dried marjoram or oregano",
        "1/3 cup extra-virgin olive oil",
        "2 medium onions, diced",
        "3 cloves garlic, chopped",
        "2 bay leaves",
        "3/4 cup tomato puree",
        "12 ounces spaghetti, broken into 3-inch pieces",
        "Grated manchego or parmesan cheese, for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Healthy",
        "European Recipes",
        "Spanish",
        "Sausage Recipes",
        "Noodles",
        "Sauteing Recipes"
    ],
    "title": "Spanish-Style Noodles with Chicken and Sausage",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/spanish-style-noodles-with-chicken-and-sausage-recipe"
}
