{
    "directions": [
        "Preheat oven to 350°F.",
        "Pat oxtails dry and sprinkle with salt and pepper. Heat oil in pot over moderately high heat until hot but not smoking, then brown oxtails in batches without crowding, turning occasionally, about 5 minutes per batch. Transfer as browned to a bowl. Pour off all but 1 tablespoon fat from pot.",
        "Remove and discard casing from chorizo, then finely chop sausage in food processor.",
        "Cook chorizo, onion, carrots, garlic, and bay leaf in fat in pot over moderate heat, stirring occasionally, until onion is softened, 6 to 7 minutes. Add paprika and cook, stirring, 1 minute. Add wine and bring to a boil, stirring and scraping up any brown bits. Add oxtails with any juices accumulated in bowl and chopped tomatoes (liquid should come about halfway up sides of meat) and bring to a boil.",
        "Cover pot and braise oxtails in lower third of oven, turning once or twice, until very tender, 3 to 3 1/2 hours. Skim fat from sauce, then stir in parsley, cilantro, vinegar, and salt and pepper to taste."
    ],
    "ingredients": [
        "6 lb (2- to 3-inch-pieces) meaty oxtails",
        "1 1/2 teaspoons salt",
        "1 teaspoon black pepper",
        "1 1/2 tablespoons extra-virgin olive oil",
        "1/4 lb mild Spanish chorizo (spicy cured pork sausage)",
        "1 large onion, coarsely chopped",
        "4 medium carrots, coarsely chopped",
        "4 garlic cloves, chopped",
        "1 Turkish or 1/2 California bay leaf",
        "1/2 teaspoon sweet or hot Spanish smoked paprika",
        "1 cup dry white wine",
        "1 (28- to 32-oz) can whole tomatoes in purée, coarsely chopped (including purée) in a food processor",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "2 tablespoons chopped fresh cilantro",
        "1 tablespoon Sherry vinegar or red-wine vinegar",
        "Special equipment: an 8- to 9-quart heavy pot"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pork",
        "Tomato",
        "Braise",
        "Sausage",
        "Carrot",
        "Winter",
        "Gourmet"
    ],
    "title": "Spanish-Style Oxtails Braised with Chorizo",
    "url": "http://www.epicurious.com/recipes/food/views/spanish-style-oxtails-braised-with-chorizo-107590"
}
