{
    "directions": [
        "Preheat oven to 350°F. Sprinkle pork shanks and pig's foot, if using, with salt and pepper. Heat oil in heavy wide pot over medium-high heat. Working in batches, sauté shanks and foot until brown, about 12 minutes per batch; transfer to baking sheet. Add carrots, onion, garlic, and thyme to pot. Sauté until onion softens, about 5 minutes. Add coarsely chopped tomatoes with juice, broth, Sherry, chiles, tomato paste, chili powder, paprika, cumin, and coriander. Bring to boil, scraping up browned bits from pan bottom.",
        "Return shanks and foot, if using, to pot. Place smoked ham shanks in pot, arranging all in single layer. Return to boil. Cover pot and place in oven. Braise until pork shanks are tender, about 1 hour 40 minutes.",
        "Tilt pot; carefully spoon off all fat. Simmer pork uncovered over medium heat until sauce thickens to desired consistency, about 8 minutes. Season with salt and pepper. DO AHEAD: Pork can be made 1 day ahead. Cool about 30 minutes. Chill uncovered until cold, then cover and keep chilled. Rewarm over medium heat before continuing.",
        "Heat oil in medium skillet over medium-low heat. Add beans, garlic, and saffron. Sauté until heated through, about 5 minutes. Mix in chopped prosciutto. Sprinkle beans with salt and pepper. Mix parsley, almonds, and orange peel in small bowl for gremolata.",
        "Place 1 pork shank on each of 6 plates. Spoon sauce around. Spoon garbanzo beans around shanks. Sprinkle with some of gremolata. Drape prosciutto strips over shanks. Serve, passing remaining gremolata."
    ],
    "ingredients": [
        "6 2 1/2-inch-thick pork shank pieces",
        "1/2 pig's foot (optional)",
        "2 tablespoons extra-virgin olive oil",
        "2 large carrots, chopped",
        "1 large onion, chopped",
        "5 large garlic cloves, chopped",
        "1 tablespoon chopped fresh thyme",
        "1 28-ounce can plum tomatoes in juice, tomatoes coarsely chopped",
        "2 cups low-salt chicken broth",
        "1 cup medium-dry Sherry",
        "3 dried ancho chiles,* halved, stemmed, seeded",
        "2 tablespoons tomato paste",
        "1 tablespoon chili powder",
        "1 tablespoon Spanish sweet paprika (pimentn dulce) or Hungarian sweet paprika",
        "2 teaspoons ground cumin",
        "1 teaspoon ground coriander",
        "1 1/4 pounds smoked ham shanks",
        "2 tablespoons extra-virgin olive oil",
        "2 15 1/2-ounce cans garbanzo beans (chickpeas), drained",
        "1 large garlic clove, minced",
        "Large pinch of saffron threads",
        "2 thin prosciutto slices, finely chopped",
        "1/4 cup finely chopped fresh Italian parsley",
        "1/4 cup chopped toasted almonds",
        "1 tablespoon grated orange peel",
        "4 thin prosciutto slices, torn into strips (for garnish)",
        "*Dried ancho chiles are available at some supermarkets, specialty foods stores, and Latin markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Citrus",
        "Garlic",
        "Herb",
        "Onion",
        "Pepper",
        "Pork",
        "Tomato",
        "Vegetable",
        "Braise"
    ],
    "title": "Spanish Pork Braise",
    "url": "http://www.epicurious.com/recipes/food/views/spanish-pork-braise-235849"
}
