{
    "directions": [
        "1. In a large skillet over medium-high heat, arrange the onion and potatoes in a flat layer and cover with 1/2 cup olive oil. Cook the vegetables, gently stirring occasionally, until the potatoes are tender but not browned, 7 to 9 minutes.",
        "2. Drain the cooked vegetables in a colander set over a bowl until cooled. (The oil collected in the bowl can be used later in the recipe or for another preparation.)",
        "3. Place a medium nonstick skillet over medium-high heat and add the remaining 1/4 cup olive oil. In a large bowl, beat the eggs with a pinch of salt. Add the potato mixture to the skillet in a flat layer and then pour the eggs over top. Cook the eggs, pressing the edges into the center as they begin to cook. Once the omelet is set enough, gently shake the pan to keep it from sticking on the bottom. Continue cooking until almost completely set, 6 to 8 minutes. Slide the omelet out onto a large dinner plate and invert it back into the pan to finish cooking the other side, 2 to 3 minutes more.",
        "4. Slide the finished omelet onto a large serving plate and let stand 10 minutes before slicing. Serve warm or at room temperature with Romesco sauce.",
        "1. Preheat the oven to 350°F. Arrange the almonds, hazelnuts, bread, and garlic in a single layer on a baking sheet. Toast until ingredients are aromatic and lightly browned, 7 to 9 minutes. Set aside to cool. Set the oven to broil.",
        "2. Place the peppers and tomatoes cut-side down onto an oiled baking sheet. Broil until the skins of the vegetables are evenly charred and the flesh is tender, 8 to 10 minutes. Immediately transfer the vegetables to a bowl, cover with plastic wrap, and let cool enough to handle. Peel and discard the skins from the vegetables and transfer the flesh to the jar of a blender.",
        "3. Add the cooled nuts, bread, and garlic to the blender along with the vinegar, parsley, paprika, olive oil, and salt and pepper to taste. Blend until smooth, adjusting the consistency as needed with olive oil to create a pourable sauce, and serve."
    ],
    "ingredients": [
        "1 large Spanish onion, thinly sliced",
        "4 medium russet potatoes, peeled, sliced 1/8-inch thick",
        "3/4 cup extra virgin olive oil",
        "8 large eggs",
        "Kosher salt",
        "1 cup almonds, skins removed",
        "1 cup hazelnuts, skins removed",
        "1 slice white bread",
        "5 to 6 garlic cloves, peeled",
        "1 large red bell pepper, halved and seeded",
        "2 plum tomatoes, halved",
        "1 tablespoon sherry vinegar",
        "2 tablespoons flat-leaf parsley, chopped",
        "1/2 teaspoon smoked Spanish paprika",
        "1/4 cup extra virgin olive oil, plus more if needed",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Garlic",
        "Nut",
        "Potato",
        "Tomato",
        "Appetizer",
        "Sauté",
        "Almond",
        "Bell Pepper",
        "Hazelnut",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spanish Potato Omelet (Tortilla de Papa Espanola) with Romesco Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spanish-potato-omelet-tortilla-de-papa-espanola-with-romesco-sauce-51121800"
}
