{
    "directions": [
        "Rinse the shrimp and pat them dry. Sprinkle the shrimp on both sides with the salt and let them stand between layers of paper towel for 10 minutes. In a large heavy skillet cook the garlic in the oil over moderate heat, stirring, until it is golden and transfer it with a slotted spoon to a small bowl. Add the ham and the red pepper flakes to the skillet and cook the mixture, stirring, for 3 to 5 minutes, or until the ham deepens in color. Add the bell pepper and cook the mixture, stirring, until the bell pepper is softened. Add the shrimp and sauté the mixture over moderately high heat, turning the shrimp, for 3 minutes. Add the Sherry and the garlic and simmer the mixture, stirring and turning the shrimp occasionally, until the shrimp are just cooked through. Transfer the shrimp mixture to a heated serving dish, sprinkle it with the parsley, and serve it with the bread."
    ],
    "ingredients": [
        "2 pounds large shrimp (about 28), shelled, leaving the tail and the first joint of the shell intact, and deveined",
        "1 1/2 teaspoons salt",
        "8 garlic cloves, sliced thin lengthwise",
        "1/2 cup olive oil",
        "1/4 pound thick-sliced cooked ham, chopped",
        "1/4 teaspoon dried hot red pepper flakes",
        "1 red bell pepper, chopped",
        "1/3 cup Oloroso Sherry",
        "minced fresh parsley leaves for garnish if desired",
        "slices of crusty bread as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Appetizer",
        "Cocktail Party",
        "Ham",
        "Shrimp",
        "Bell Pepper",
        "Sherry",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spanish-Style Garlic Shrimp with Ham and Bell Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/spanish-style-garlic-shrimp-with-ham-and-bell-peppers-11650"
}
