{
    "directions": [
        "Combine garlic, buttermilk, Aleppo-style pepper, cumin, coriander, 1 tsp. paprika, 1 tsp. salt, and 1/2 tsp. black pepper in a large resealable plastic bag. Add chicken and toss to coat, then chill at least 4 hours and up to overnight.",
        "Whisk flour, cayenne, and remaining 3 Tbsp. paprika in a medium shallow bowl.",
        "Fit a large heavy pot with deep-fry thermometer. Pour in oil to a depth of 2\"; heat over medium-high until thermometer registers 350°F. Reduce heat to medium and raise or lower as needed to maintain a temperature of 350°F. Working in batches, remove chicken from marinade, shaking off excess, and dredge in flour mixture. Fry chicken, turning once, until golden brown and cooked through, about 3 minutes per batch. Transfer to a paper towel-lined rimmed baking sheet; season with salt.",
        "Heat a grill pan over medium. Brush avocado with oil; season with remaining 1/4 tsp. salt and 1/4 tsp. pepper. Grill, turning occasionally, until lightly charred, about 3 minutes per side. Transfer chicken to a platter and arrange avocado alongside; serve with spicy mayonnaise, if desired."
    ],
    "ingredients": [
        "3 garlic cloves, smashed",
        "4 cups buttermilk",
        "1 teaspoon Aleppo-style pepper or 3/4 teaspoon crushed red pepper flakes",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground coriander",
        "3 tablespoons plus 1 teaspoon smoked paprika, divided",
        "1 1/4 teaspoons kosher salt, divided, plus more",
        "3/4 teaspoon freshly ground black pepper, divided",
        "3 pounds boneless, skinless chicken thighs, cut into 1/2\"-thick strips",
        "2 cups all-purpose flour",
        "2 teaspoons cayenne pepper",
        "2–3 quarts vegetable oil (for frying), plus more for brushing",
        "2 firm, ripe California avocados, cut into quarters, skin removed",
        "Spicy mayonnaise or combine equal parts romesco and mayonnaise (for serving; optional)",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Los Angeles",
        "Chicken",
        "Fry",
        "Suzanne Goin",
        "Deep-Fry",
        "Cumin",
        "Coriander",
        "Buttermilk",
        "Paprika"
    ],
    "title": "Spanish-Style Fried Chicken With Grilled Avocado",
    "url": "http://www.epicurious.com/recipes/food/views/spanish-style-fried-chicken-with-grilled-avocado"
}
