{
    "directions": [
        "Preheat oven to 375 degrees. Cut off tops of peppers and remove seeds and ribs, reserving tops. Discard stems and dice reserved tops. Set aside. In a large saucepan of boiling water blanch the peppers to 3 to 4 minutes, or until they are slightly soft. Drain, refresh, and pat dry. Cut off a thin slice from the bottom of each pepper so that it stands straight. In a nonstick skillet set over moderate heat, warm 1 tablespoon olive oil until it is hot, add the onion and reserved diced pepper and cook, stirring occasionally, for 3 to 5 minutes, or until vegetables are softened. Add the garlic, curry powder and ginger and cook, stirring 2 minutes more. Transfer mixture to a large bowl. Add the remaining ingredients, except the bread crumbs and lemon, to the bowl and gently stir to combine well. Stuff the peppers with the filling and arrange them in a shallow baking pan. Sprinkle tops of peppers with the bread crumbs and drizzle each with a little olive oil. Bake the peppers for 40 to 45 minutes, or until stuffing is completely cooked. Transfer peppers to a serving platter and sprinkle with lemon juice or serve with lemon wedges."
    ],
    "ingredients": [
        "6 green, red or yellow bell peppers, or a combination",
        "1 tablespoon olive oil, plus additional for drizzling tops of peppers",
        "1 onion, minced",
        "2 large garlic cloves, minced or to taste",
        "1 teaspoon hot Madras curry powder, or to taste",
        "1 teaspoon ground ginger",
        "3 cups cooked long grain rice, preferably basmati",
        "1 pound ground veal",
        "10-ounce package frozen peas, cooked according to package directions",
        "3 firm, ripe tomatoes, diced",
        "1 tablespoon minced fresh oregano. or 1 teaspoon dried oregano, crumbled",
        "3 tablespoons minced fresh cilantro, or to taste",
        "Salt, to taste",
        "Cayenne pepper, to taste (optional)",
        "3 tablespoons fresh or dry bread crumbs",
        "Lemon juice or wedges"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "European Recipes",
        "Spanish",
        "Rice Recipes",
        "Bell Peppers",
        "Vegetable",
        "Meat",
        "Veal",
        "Main Dish Recipes"
    ],
    "title": "Spanish Stuffed Bell Peppers",
    "url": "http://www.foodnetwork.com/recipes/spanish-stuffed-bell-peppers-recipe"
}
