{
    "directions": [
        "Melt 1 tablespoon butter in a 12-inch heavy skillet over moderate heat, then cook spinach, stirring, until wilted and tender, about 4 minutes. Remove from heat and cool, about 10 minutes. Squeeze handfuls of spinach to remove as much liquid as possible, then coarsely chop. Transfer to a bowl and stir in feta, nutmeg, 1/2 teaspoon salt, and 1/2 teaspoon pepper.",
        "Preheat oven to 375°F.",
        "Melt remaining 1 stick butter in a small saucepan, then cool.",
        "Cover phyllo stack with 2 overlapping sheets of plastic wrap and then a dampened kitchen towel.",
        "Take 1 phyllo sheet from stack and arrange on a work surface with a long side nearest you (keeping remaining sheets covered) and brush with some butter. Top with another phyllo sheet and brush with more butter. Cut buttered phyllo stack crosswise into 6 (roughly 12- by 2 3/4-inch) strips.",
        "Put a heaping teaspoon of filling near 1 corner of a strip on end nearest you, then fold corner of phyllo over to enclose filling and form a triangle. Continue folding strip (like a flag), maintaining triangle shape. Put triangle, seam side down, on a large baking sheet and brush top with butter. Make more triangles in same manner, using all of phyllo.",
        "Bake triangles in middle of oven until golden brown, 20 to 25 minutes, then transfer to a rack to cool slightly."
    ],
    "ingredients": [
        "1 stick (1/2 cup) plus 1 tablespoon unsalted butter",
        "1 lb baby spinach",
        "1/2 lb feta, crumbled (scant 2 cups)",
        "1/2 teaspoon freshly grated nutmeg",
        "10 (17- by 12-inch) phyllo sheets, thawed if frozen"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Leafy Green",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Phyllo/Puff Pastry Dough",
        "Pastry",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spanakopita",
    "url": "http://www.epicurious.com/recipes/food/views/spanakopita-107344"
}
