{
    "directions": [
        "Squeeze juice from 1 lemon half into a bowl of cold water. Cut off and discard stems of 1 whole artichoke and cut off top 1 1/2 inches of leaves. Bend back outer leaves until they snap off close to base and discard several more layers of leaves in same manner until exposed leaves are pale green at top and yellow at base. Trim dark green fibrous parts from base and sides with a sharp paring knife, then quarter artichoke lengthwise. Rub cut surfaces with other lemon half, and drop artichoke into water. Trim remaining artichokes in same manner.",
        "Bring a large pot of salted water to a boil and simmer fresh artichokes until just tender, 10 to 12 minutes. (Do not cook thawed artichokes.) Transfer with a slotted spoon to paper towels to drain. When cool enough to handle, scoop out choke with a spoon.",
        "Cook beans in same pot of boiling salted water until crisp-tender, about 4 minutes. Drain in a colander, then rinse under cold running water to stop cooking. Pat dry.",
        "Cook clams and mussels in wine in a large heavy pot over moderately high heat, covered, stirring occasionally, 4 to 10 minutes, checking shellfish frequently after 4 minutes and transferring to a bowl as they open (mussels will open before clams). Discard any unopened mussels after 8 minutes and any unopened clams after 10 minutes. Keep warm, covered. Pour shellfish cooking liquid through a fine sieve lined with a paper towel into a large glass measure and add enough water to make 2 cups.",
        "Pat chicken dry and season with salt and pepper. Heat 1 1/2 tablespoons oil in paella pan over moderately high heat until hot but not smoking, then brown chicken well all over, about 15 minutes. Transfer with slotted spoon to a plate.",
        "Preheat oven to 400°F.",
        "Cook onion in 1 1/2 tablespoons oil in pan over moderate heat, stirring, until softened, about 6 minutes. Add garlic and paprika and cook until fragrant, about 2 minutes. Add rice and cook, stirring, 1 minute, then stir in tomatoes.",
        "Add seafood cooking liquid, chicken broth, and chicken with juices and bring to a boil over high heat. Boil, gently stirring and frequently rotating pan, until rice has absorbed most of liquid and spoon leaves a path exposing bottom of pan when pulled through rice, about 15 minutes.",
        "Remove pan from heat and tuck clams and mussels into rice. Bake riz in middle of oven, uncovered, until a crust forms around edge of pan, liquid is absorbed, and chicken is cooked through, about 10 minutes.",
        "While riz is baking, heat remaining tablespoon oil in a large nonstick skillet over moderately high heat until hot but not smoking, then saut\u2029 bell peppers until crisp-tender, about 5 minutes. Add green beans and artichokes (cooked fresh or thawed) and sauté just until heated through. Season with salt and pepper.",
        "Tuck vegetables into riz and let stand 10 minutes before serving."
    ],
    "ingredients": [
        "1 lemon, halved",
        "3 medium artichokes or 1 (10-ounce) box frozen artichoke hearts, thawed",
        "pound green beans, trimmed and cut into 3-inch pieces",
        "1 1/2 dozen littleneck clams (1 1/2 to 2 inches in diameter), scrubbed",
        "1 1/2 dozen mussels (preferably cultivated), scrubbed and beards removed",
        "1/2 cup dry white wine",
        "1 (3- to 3 1/2-pound) chicken, cut into 12 pieces",
        "4 tablespoons olive oil",
        "1 large onion, chopped",
        "2 garlic cloves, minced",
        "2 tablespoons paprika (preferably Spanish)",
        "2 cups medium-grain rice",
        "1 (14 1/2-ounce) can diced tomatoes, drained",
        "1 3/4 cups chicken broth",
        "2 red bell peppers, cut into 1/4-inch-thick strips",
        "Special equipment: a 15 3/4- by 2 3/4-inch paella pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Rice",
        "Tomato",
        "Bake",
        "Clam",
        "Mussel",
        "Spice",
        "Artichoke",
        "Green Bean",
        "Bell Pepper",
        "White Wine",
        "Gourmet"
    ],
    "title": "Spanish-Style Rice with Chicken and Seafood (Riz à la Valencienne)",
    "url": "http://www.epicurious.com/recipes/food/views/spanish-style-rice-with-chicken-and-seafood-riz-a-la-valencienne-104789"
}
