{
    "directions": [
        "Place the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels. Crumble bacon when cool enough to handle.",
        "Heat vegetable oil in a large soup pot over medium heat and brown tri tip in the hot oil, working in 4 batches, until beef is browned and no longer pink inside, about 5 minutes per batch. Return all cooked beef to pot and stir sweet onion, garlic, jalapeno peppers, chili powder, cumin, and paprika into meat; cook and stir until onion is translucent, about 5 minutes.",
        "Pour tomatoes, beer, tequila, oregano, salt, and black pepper into mixture, scraping up and dissolving any browned bits of food on the bottom of the pot. Stir reserved bacon, beef stock, chipotle peppers, and steak sauce  into the mixture; bring to a boil.",
        "Reduce heat to low and stir in Mexican-style corn and green bell pepper. Cover and simmer chili, stirring occasionally, until thickened and meat is very tender, about 3 hours."
    ],
    "ingredients": [
        "8 slices bacon",
        "1/4 cup vegetable oil",
        "3 pounds beef tri tip, cut into 1/2-inch cubes",
        "1 large sweet onion, chopped",
        "6 cloves garlic, crushed",
        "3 jalapeno peppers, diced",
        "6 tablespoons chili powder",
        "1 tablespoon ground cumin",
        "1 tablespoon smoked paprika",
        "2 (14.5 ounce) cans diced tomatoes",
        "1 (12 fluid ounce) can or bottle dark beer (such as Shiner Bock®)",
        "2 fluid ounces tequila",
        "2 tablespoons dried oregano",
        "2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "4 cups beef stock",
        "4 chipotle peppers in adobo sauce, chopped",
        "1/2 cup steak sauce",
        "1 (11 ounce) can Mexican-style corn, drained",
        "1 green bell pepper, diced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spartan Tri Tip Chili",
    "url": "http://allrecipes.com/recipe/230778/spartan-tri-tip-chili/"
}
