{
    "directions": [
        "Whisk first 6 ingredients in a medium bowl; set aside. Using an electric mixer at medium speed, beat butter in a medium bowl until smooth, about 2 minutes. Add both sugars and molasses; continue to beat until mixture is smooth and creamy, about 3 minutes. Beat in egg and vanilla; mix for 2 minutes. Reduce speed to low; add dry ingredients and mix to blend well.",
        "Scrape dough from bowl and divide into thirds. Using your palms, roll each piece of dough into an 8\" log. Wrap logs tightly in plastic or parchment paper and freeze for at least 3 hours. (For neater edges, remove logs from freezer after 1 hour and roll on counter.) DO AHEAD: Dough can be made up to 2 months ahead. Keep frozen.",
        "Arrange racks in top and bottom thirds of oven; preheat to 375°F. Line 3 baking sheets with parchment paper or silicone baking mats.",
        "Whisk egg white in a small bowl to loosen; lightly brush all over 1 log. Sprinkle with (or roll in) sanding sugar. Using a long, slender knife, slice off a sliver of dough from each end of log to make ends flat. Cut log into 1/4\"-thick rounds. Transfer to 1 baking sheet, spacing 1/2\" apart; place in freezer while you cut the next log. (The cookies hold their shape better if you bake when dough is cold.) Repeat with remaining dough.",
        "Bake 2 sheets of cookies, rotating the sheets from top to bottom and front to back after 6 minutes, until tops are golden brown and centers are almost firm, 11-13 minutes. Transfer cookies to wire racks and let cool. Repeat with third sheet of cookies. DO AHEAD: Cookies can be baked 2 days ahead. Store airtight at room temperature.",
        "Mix powdered sugar and 7 teaspoons cold water in a large mixing bowl (glaze will be very thick). Spoon about 1/2 teaspoon glaze onto each button (alternatively, fill a resealable plastic bag with glaze and cut a small hole in 1 corner; pipe glaze in an even circle around edges of cookies, then fill). Decorate with sprinkles, colored sugar, or dragées, if desired. Let stand on rack at room temperature for at least 30 minutes for glaze to set. DO AHEAD: Cookies can be made 5 days ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1 tablespoon ground cinnamon",
        "3/4 teaspoon ground ginger",
        "1/2 teaspoon fine sea salt",
        "1/2 teaspoon freshly grated nutmeg",
        "1/8 teaspoon ground cloves",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup (packed) light brown sugar",
        "1/4 cup sugar",
        "2 tablespoons mild-flavored (light) molasses",
        "1 large egg, room temperature",
        "1 teaspoon vanilla extract",
        "1 large egg white",
        "Sanding or other decorative sugar",
        "2 cups powdered sugar, sifted",
        "Sprinkles, colored sanding sugar, or dragées (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Dessert",
        "Bake",
        "Christmas",
        "Spice",
        "Cinnamon",
        "Clove",
        "Molasses",
        "Nutmeg",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Speculoos Buttons",
    "url": "http://www.epicurious.com/recipes/food/views/speculoos-buttons-51135050"
}
