{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Season pork roast with salt and pepper to taste, then place on a rack in an open roasting pan, rib ends down.",
        "Bake at 375 degrees F (190 degrees C) for 2 hours. Roast will be only partially cooked.",
        "Meanwhile, in a medium bowl, combine cranberries and sugar and mix well; set aside. Melt butter or margarine in a large skillet over medium heat. Add onions and celery and saute until tender, about 10 minutes. Add cranberry mixture, 2 teaspoons salt, 1/4 teaspoon ground black pepper, bread cubes, apples, apple juice, egg and poultry seasoning. Toss well.",
        "After the two hours, remove roast from oven. Turn rib ends up and fill cavity with cranberry/apple stuffing. Insert meat thermometer between two ribs in the thickest part of the meat, making sure that end of thermometer does not touch any bone.",
        "Return stuffed roast to oven and continue roasting at 375 degrees F (190 degrees C) for about 1 1/2 hours, or until internal temperature of meat reaches 175 degrees F (80 degrees C). (Note: If stuffing becomes too brown, cover it with aluminum foil.)",
        "To Serve: Place roast on warm platter and let stand for 15 minutes for easier carving. Slice between ribs to carve, and serve with stuffing."
    ],
    "ingredients": [
        "7 pounds crown pork roast",
        "2 cups chopped cranberries",
        "1/2 cup white sugar",
        "1/2 cup butter",
        "2 onions, chopped",
        "2 cups chopped celery",
        "2 teaspoons salt",
        "1/4 teaspoon ground black pepper",
        "8 cups white bread cubes",
        "2 apple - peeled, cored, and chopped",
        "1/2 cup apple juice",
        "1 egg",
        "1 teaspoon poultry seasoning"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Special Occasion Stuffed Crown Pork Roast",
    "url": "http://allrecipes.com/recipe/15306/special-occasion-stuffed-crown-pork-r/"
}
