{
    "directions": [
        "Toss first 5 ingredients in large roasting pan. Mix butter, sage, and garlic in small bowl. Place chicken in center of vegetables. Using fingertips, loosen skin from breast. Spread 1 tablespoon sage butter under skin. Rub 1 tablespoon sage butter over entire chicken. Dot vegetables with remaining sage butter. Sprinkle 1 teaspoon salt over vegetables and chicken. DO AHEAD: Can be made 4 hours ahead. Cover and chill.",
        "Preheat oven to 400°F. Roast chicken and vegetables 15 minutes. Reduce oven temperature to 375°F; continue roasting until instant-read thermometer inserted into chicken thigh registers 165°F and vegetables are tender, stirring vegetables once, about 1 hour.",
        "Place greens and shallot on large deep platter. Spoon 3 tablespoons fat from juices in pan and drizzle over greens; toss to coat. Season with salt and pepper. Using slotted spoon, transfer roasted vegetables to platter, placing atop greens. Tilt chicken, allowing juices to flow from cavity into pan. Transfer chicken to work surface. Cut into serving pieces and arrange with vegetables atop greens.",
        "Add wine and 1/4 cup water to roasting pan. Bring to boil over medium-high heat, stirring to scrape up browned bits. Simmer until slightly reduced, about 3 minutes. Season sauce to taste with salt and pepper. Transfer to small pitcher. Serve chicken, passing pan juices alongside."
    ],
    "ingredients": [
        "1 12-ounce unpeeled russet potato, well scrubbed, cut into 1-inch cubes",
        "1 12-ounce yam (red-skinned sweet potato), peeled, cut into 1 1/2-inch cubes",
        "2 large carrots, peeled, halved lengthwise, cut crosswise into 1 1/2-inch pieces",
        "3 medium parsnips, peeled, cut into 1 1/2-inch pieces",
        "1 1/2 tablespoons extra-virgin olive oil",
        "3 tablespoons unsalted butter, room temperature",
        "2 tablespoons finely chopped fresh sage",
        "1 garlic clove, pressed",
        "1 4-pound organic chicken",
        "1 teaspoon coarse kosher salt",
        "8 cups coarsely torn red or green mustard greens",
        "1 shallot, minced",
        "1/2 cup dry white wine",
        "1/4 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Chicken",
        "Potato",
        "Roast",
        "High Fiber",
        "Dinner",
        "Parsnip",
        "Sweet Potato/Yam",
        "Winter",
        "Family Reunion",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Special Sunday Roast Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/special-sunday-roast-chicken-351257"
}
