{
    "directions": [
        "Preheat oven to 350°F. Pour 3 tablespoons of oil into a small bowl. Run the bunch of thyme under a hot tap for 3 seconds to reawaken it, then shake dry and strip the leaves into the oil. Peel the garlic, then finely slice it with the chile and add to the bowl. Finely grate in the lemon zest, add a pinch of sea salt and black pepper, and mix together. Lay the cherry tomatoes in a 12–x 16-inch baking dish. Rub the flavored oil all over the ricotta and place in the center of the dish, then gently rub the remaining oil over the tomatoes. Add a splash of water to the dish, place in the oven, and roast for 45 minutes, then remove. With 10 minutes to go, cook the spaghetti in a pan of boiling salted water according to the package instructions.",
        "Lift the ricotta out of the baking dish, then shake the tomatoes off the vines, discarding the stalks. Add half a cup of pasta water to the dish and gently shake to loosen all the sticky goodness from the base. Drain the spaghetti and toss straight into the dish with a squeeze of lemon juice, season to perfection, then break that beautiful ricotta over the top. Sprinkle over the arugula, toss together well, then serve. My missus likes this with a little drizzle of balsamic too."
    ],
    "ingredients": [
        "Olive oil",
        "1/2 bunch of fresh thyme (1/2 ounces)",
        "4 cloves of garlic",
        "1/2-1 fresh red chile",
        "1 lemon",
        "1 pound mixed-color cherry tomatoes, on the vine",
        "8 ounces best-quality ricotta salata cheese",
        "11 ounces dried spelt spaghetti",
        "4 handfuls of arugula",
        "Optional: balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Arugula",
        "Tomato",
        "Healthy",
        "HarperCollins"
    ],
    "title": "Spelt Spaghetti, Vine Tomatoes & Baked Ricotta",
    "url": "http://www.epicurious.com/recipes/food/views/spelt-spaghetti-vine-tomatoes-and-baked-ricotta"
}
