{
    "directions": [
        "Whisk garlic, almond butter, 2 tablespoons lemon juice, 2 tablespoons oil, and 2 tablespoons water in a small bowl until smooth; season with salt and pepper. Set sauce aside.",
        "Using your hands, gently mix lamb, onion, parsley, coriander, cumin, 2 tablespoons oil, 1 teaspoon salt, and 1/2 teaspoon pepper in a large bowl just to combine. Form into twelve 3/4\"-thick patties.",
        "Heat a dry large skillet, preferably cast iron, over medium heat. Working in 2 batches, cook patties, pressing slightly to flatten, until browned on the outside but still pink in the center, about 4 minutes per side. Transfer to wire rack set inside a rimmed baking sheet; let rest 5 minutes.",
        "Meanwhile, toss cabbage, cucumber, radishes, and remaining 2 tablespoons lemon juice and 2 tablespoons oil in a medium bowl; season with salt and pepper.",
        "Serve lamb patties with pita bread, salad, herbs, and reserved sauce."
    ],
    "ingredients": [
        "2 garlic cloves, finely grated",
        "1/4 cup almond butter",
        "4 tablespoons fresh lemon juice, divided",
        "6 tablespoons olive oil, divided",
        "1 teaspoon kosher salt, plus more",
        "1/2 teaspoon freshly ground black pepper, plus more",
        "1 pound ground lamb, preferably shoulder",
        "1/2 medium onion, finely chopped",
        "1/4 cup chopped fresh parsley",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon ground cumin",
        "1/4 small head of red cabbage, thinly sliced",
        "1/4 English hothouse cucumber, halved lengthwise, thinly sliced",
        "2 radishes, thinly sliced",
        "4 pita bread or flatbreads",
        "Mixed tender herb leaves (such as cilantro and mint; for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Garlic",
        "Ground Lamb",
        "Cabbage"
    ],
    "title": "Spiced Lamb Patties with Nutty Garlic Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-lamb-patties-with-nutty-garlic-sauce-51255480"
}
