{
    "directions": [
        "Preheat oven to 350°F. Butter and flour two 9-inch-diameter cake pans with 2-inch-high sides. Combine first 6 ingredients in large bowl. Whisk apple butter, buttermilk, oil, eggs, molasses and raisins in medium bowl to blend. Stir apple butter mixture into dry ingredients. Divide batter between prepared pans. Bake until tester inserted into center of cakes comes out clean, about 25 minutes. Transfer cakes to racks and cool 20 minutes. Run small sharp knife around pan sides to loosen cakes. Turn cakes onto parchment-lined racks and cool completely.",
        "Beat cream cheese and sugar in medium bowl until smooth. Add molasses, butter and vanilla and beat just until smooth. Place 1 cake layer on plate. Spread 1 1/2 cups frosting over. Top with second cake layer. Spread remaining frosting decoratively over top and sides of cake. Refrigerate while preparing caramel.",
        "Stir sugar and cream in heavy small saucepan over medium heat until sugar dissolves. Boil and stir 1 minute. Let stand until very thick but still pourable, about 5 minutes. Drizzle caramel over cake. Press nuts onto sides of cake. (Can be made 1 day ahead. Cover with cake dome; chill. Bring to room temperature before serving.)"
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "1 1/4 cups sugar",
        "1 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon salt",
        "1 cup apple butter",
        "3/4 cup buttermilk",
        "1/2 cup vegetable oil",
        "3 large eggs",
        "2 tablespoons unsulfured (light) molasses",
        "1 cup golden raisins",
        "1 1/2 pounds cream cheese, room temperature",
        "2 cups powdered sugar",
        "2 tablespoons unsulfured (light) molasses",
        "1/4 cup (1/2 stick) unsalted butter, room temperature",
        "1 tablespoon vanilla extract",
        "1/4 cup firmly packed dark brown sugar",
        "1 tablespoon whipping cream",
        "1 1/2 cups chopped toasted walnuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Raisin",
        "Walnut",
        "Spice",
        "Fall",
        "Molasses",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spice Cake with Molasses Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/spice-cake-with-molasses-cream-cheese-frosting-2652"
}
