{
    "directions": [
        "Stir first 4 ingredients in heavy medium saucepan over medium-low heat until sugar dissolves. Cover and simmer until prunes are very soft, about 15 minutes. Uncover and simmer over low heat until mixture is reduced to 3/4 cup, about 4 minutes. Add Calvados and spices; mash prunes in pan into thick jam-like spread. (Can be prepared 1 week ahead. Cover with plastic and refrigerate.)",
        "Melt butter in heavy medium nonstick skillet over medium heat. Add sugar and cook until sugar melts and turns deep amber, stirring occasionally, about 3 minutes. Add apples and cook until just tender and browned, shifting and turning apples occasionally, about 12 minutes. Remove from heat. Cool in skillet.",
        "Roll pastry out on lightly floured surface to thin 13x13-inch square. Using 4-inch-round cookie cutter, cut out 8 rounds. Transfer rounds to parchment-lined heavy large baking sheet. Using fork, pierce pastry rounds all over, leaving 1/3-inch border around edge.Chill pastry until firm, about 15 minutes.",
        "Spread 1 slightly rounded tablespoon of sugarplum mixture evenly over center of each round, leaving 1/3-inch border. Slice each apple quarter into 5 thin wedges. Fan out 10 apple slices atop sugarplum mixture on each round, forming rosette. Reserve any juices in small bowl. (Can be prepared 1 day ahead. Cover tartlets and any juices separately and refrigerate.)",
        "Whisk yolks, 2/3 cup sugar, and Calvados in medium bowl. Set bowl over pan of gently boiling water. Whisk constantly until mixture thickens and candy thermometer registers 165°F, about 5 minutes. Cool, stirring occasionally. Whip cream until soft peaks form. Fold cooled egg mixture into whipped cream. Cover and refrigerate. (Calvados cream can be prepared 1 day ahead. Keep refrigerated.)",
        "Position rack in upper third of oven and preheat to 400°F. Drizzle each tartlet with reserved juices and sprinkle with 1/2 teaspoon sugar. Bake until crust is deep golden brown, about 18 minutes. Serve warm or at room temperature with Calvados cream."
    ],
    "ingredients": [
        "1/2 cup (packed) pitted prunes",
        "1/2 cup (packed) golden brown sugar",
        "1/2 cup water",
        "2 tablespoons unsalted butter",
        "2 tablespoons Calvados",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground cardamom",
        "1/8 teaspoon ground cloves",
        "1/4 cup butter",
        "1/4 cup sugar",
        "4 medium Granny Smith apples (about 2 pounds), peeled, quartered, cored",
        "1 sheet (preferably all-butter) frozen puff pastry (half of 17.3-ounce package), thawed",
        "8 large egg yolks",
        "2/3 cup plus 4 teaspoons sugar",
        "2/3 cup Calvados",
        "1 cup chilled whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Prune",
        "Apple",
        "Brandy",
        "Fall",
        "Winter",
        "Calvados",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Sugarplum and Caramelized Apple Tartlets with Calvados Cream",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-sugarplum-and-caramelized-apple-tartlets-with-calvados-cream-231328"
}
