{
    "directions": [
        "Whisk together milk, cornstarch, spices, and 1 tablespoon granulated sugar in a small heavy saucepan. Bring to a boil over medium heat, whisking, then simmer, whisking, 2 minutes.",
        "Remove from heat and whisk in pumpkin. Transfer to a large bowl and cool to room temperature.",
        "Preheat oven to 400°F with rack in lower third. Butter ramekins and coat with granulated sugar, knocking out excess, then put in a large shallow baking pan.",
        "Beat egg whites with salt in another large bowl using an electric mixer until they hold soft peaks. Add remaining 3/4 cup granulated sugar a little at a time, beating, then beat until whites hold stiff, glossy peaks, 1 to 2 minutes more.",
        "Fold one third of whites into cooled pumpkin mixture to lighten, then fold in remaining whites gently but thoroughly. Divide mixture among ramekins, mounding it.",
        "Bake soufflés until puffed and golden, 18 to 20 minutes. Dust with confectioners sugar and serve immediately."
    ],
    "ingredients": [
        "1/2 cup whole milk",
        "1 tablespoon cornstarch",
        "1/4 teaspoon grated nutmeg",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon ground allspice",
        "Pinch of ground cloves",
        "3/4 cup plus 1 tablespoon granulated sugar, divided, plus additional for coating ramekins",
        "3/4 cup canned pure pumpkin (from a 15-oz can, not pie filling)",
        "10 large egg whites",
        "1/4 teaspoon salt",
        "Equipment: 8 (6-ounce) ramekins",
        "Garnish: confectioners sugar",
        "Accompaniments: bourbon molasses sauce ; unsweetened whipped cream",
        "1 unsweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Quick & Easy",
        "Pumpkin",
        "Fall",
        "Winter",
        "Cinnamon",
        "Christmas Eve",
        "Molasses",
        "Ramekin",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced-Pumpkin Soufflés with Bourbon and Molasses Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-pumpkin-souffles-with-bourbon-and-molasses-sauce-350576"
}
