{
    "directions": [
        "Stir together water and tomato paste in a 2 1/2- to 3-quart heavy saucepan until smooth, then stir in remaining sauce ingredients. Bring mixture to a boil, stirring, then reduce heat and briskly simmer, stirring occasionally, until sauce is reduced to 2 1/4 cups, 50 to 60 minutes. Stir frequently toward end of cooking to prevent sticking. Reserve 1 cup sauce for serving.",
        "Prepare grill for indirect-heat grilling over medium-hot charcoal (medium-high heat for gas grills; see Grilling Procedure ).",
        "Pat chicken dry (do not season with salt and pepper). Lightly oil grill rack and place chicken, skin side down, on area with no coals underneath (over turned-off burner if using gas). Grill, covered, turning once, until chicken registers 165°F, 22 to 25 minutes. (Chicken may appear pale; no cause for worry.)",
        "Brush generously all over with some of sauce, then move chicken directly over coals (turned-on burners if using gas). Grill chicken, covered, turning and moving to area with no coals or heat underneath if flare-ups occur, until browned, 3 to 5 minutes more. (Add more charcoal during grilling if necessary to maintain heat.)",
        "Serve chicken with reserved sauce."
    ],
    "ingredients": [
        "1 cup water",
        "1/4 cup plus 2 tablespoons tomato paste (from a 6-ounce can)",
        "1 cup soy sauce",
        "1 cup distilled white vinegar",
        "3/4 cup sugar",
        "3/4 cup minced onion (about 1 medium)",
        "1/3 cup minced serrano or jalapeño chiles with seeds",
        "1/4 cup minced garlic (about 9 large cloves)",
        "6 large chicken drumsticks (about 1 1/2 pounds)",
        "6 large chicken thighs (about 2 pounds), trimmed of any excess fat and skin",
        "Lime wedges for serving",
        "Special equipment: Instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Backyard BBQ",
        "Dinner",
        "Vinegar",
        "Hot Pepper",
        "Grill",
        "Grill/Barbecue",
        "Chile Pepper",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Spicy Sweet-and-Sour Grilled Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-sweet-and-sour-grilled-chicken-51137440"
}
