{
    "directions": [
        "Whisk 1 tablespoon soy sauce, 1 tablespoon Sherry, 1 teaspoon sesame oil, and 1 teaspoon sugar in medium bowl. Add chicken; marinade 20 to 30 minutes.",
        "Whisk remaining 1 tablespoon soy sauce, 1 tablespoon Sherry, 2 teaspoons sesame oil, and 1 teaspoon sugar in small bowl and reserve.",
        "Heat 2 tablespoons peanut oil in large nonstick skillet over high heat. Add white parts of onions and chiles; stir 30 seconds. Add chicken; stir-fry just until cooked through, about 3 minutes. Transfer chicken mixture to bowl. Add 1 tablespoon peanut oil to same skillet; heat over high heat. Add greens by large handfuls; stir just until beginning to wilt before adding more. Sauté just until tender, 1 to 6 minutes, depending on type of greens. Return chicken to skillet. Add reserved soy sauce mixture; stir until heated through, about 1 minute. Season with salt and pepper. Transfer to serving bowl; sprinkle with green parts of onions and peanuts."
    ],
    "ingredients": [
        "2 tablespoons soy sauce, divided",
        "2 tablespoons dry Sherry, divided",
        "3 teaspoons Asian sesame oil, divided",
        "2 teaspoons golden brown sugar, divided",
        "1 1/4 pounds skinless boneless chicken breast halves, cut crosswise into 1/3-inch-wide strips",
        "3 tablespoons peanut oil, divided",
        "4 green onions, white parts and green parts chopped separately",
        "2 teaspoons chopped seeded serrano chiles",
        "1 large bunch greens (such as spinach, mustard greens, kale, or broccoli rabe; about 1 pound), thick stems removed, spinach left whole, other greens cut into 1-inch strips (about 10 cups packed)",
        "1/4 cup chopped roasted salted peanuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Marinate",
        "Stir-Fry",
        "Low Carb",
        "Kid-Friendly",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Peanut",
        "Kale",
        "Spinach",
        "Spring",
        "Summer",
        "Poker/Game Night",
        "Healthy",
        "Mustard Greens",
        "Potluck"
    ],
    "title": "Spicy Stir Fried Chicken and Greens with Peanuts",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-stir-fried-chicken-and-greens-with-peanuts-241891"
}
