{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 7x11 inch baking dish. In a saucepan bring 1 cup water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.",
        "Cut the head and tentacles from the body of the squid. Reserve and chop the tentacles. Remove the quill and peel the colored skin from the body. Rinse under cold water and set aside.",
        "In small bowl combine the rice, raisins and pine nuts.",
        "Saute 1 chopped onion and 3 cloves garlic with 2 tablespoons olive oil in a medium skillet. Cook until soft. Add the chopped squid tentacles, and the rice mixture. Stir well and remove from the heat. Season to taste with salt and pepper.",
        "In a large skillet saute the onion and 4 cloves garlic until soft. Stir in the red pepper flakes and oregano. Add the tomatoes with juice, anchovy paste and wine. Stir and cook over medium heat until slightly thickened. Season to taste with salt and pepper.",
        "Stuff the squid with the rice mixture and seal ends with wooden picks. Place squid in the prepared baking dish. Pour tomato sauce over all and bake at 350 degrees F (175 degrees C) for 1 hour."
    ],
    "ingredients": [
        "1 cup water",
        "1/2 cup uncooked white rice",
        "3 squid",
        "1/4 cup raisins",
        "1/4 cup pine nuts",
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "3 cloves crushed garlic",
        "salt and pepper to taste",
        "2 tablespoons olive oil",
        "2 (14.5 ounce) cans stewed tomatoes",
        "1 onion, chopped",
        "4 cloves crushed garlic",
        "2 teaspoons crushed red pepper flakes",
        "2 teaspoons dried oregano",
        "3 teaspoons anchovy paste",
        "1/2 cup white wine",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Stuffed Squid",
    "url": "http://allrecipes.com/recipe/12794/spicy-stuffed-squid/"
}
