{
    "directions": [
        "Blend tahini, rice vinegar, soy sauce, 2 tablespoons olive oil, chile-garlic sauce, turmeric, and 2 tablespoons water together in a large bowl with a fork. Add water as needed to get the dressing to a hummus-like consistency; set aside.",
        "Soak arame seaweed in a pot of lukewarm water for 10 minutes. Place the pot over medium heat and bring the water to a boil; reduce heat to low and simmer the seaweed for 10 minutes. Drain the seaweed.",
        "Bring a pot of lightly salted water to a boil. Cook soba noodles at a boil until tender yet firm to the bite, 5 to 7 minutes.",
        "Drain the noodles; set aside.",
        "Heat 1 tablespoon olive oil in a large skillet over medium heat. Cook and stir garlic in the olive oil until fragrant, about 1 minute.",
        "Stir ginger and drained seaweed with the garlic; cook and stir 1 minute more.",
        "Add kale to the skillet; cook and stir until the kale is coated slightly, about 1 minute more. Reduce heat to low, place a cover on the skillet, and simmer together until the kale wilts, 5 to 10 minutes.",
        "Toss the drained soba noodles in the tahini sauce until coated. Fold the drained seaweed and the kale mixture into the noodles and sauce and toss to coat. Divide among two or four bowls, and serve."
    ],
    "ingredients": [
        "3/4 cup tahini",
        "3 tablespoons rice vinegar",
        "2 tablespoons soy sauce",
        "2 tablespoons olive oil",
        "1/2 teaspoon chile-garlic sauce (such as Sriracha®)",
        "1/2 teaspoon ground turmeric",
        "2 tablespoons water, or more as needed",
        "1 (1.76 ounce) packet arame seaweed",
        "1 (8 ounce) package dried soba noodles",
        "1 tablespoon olive oil",
        "2 cloves garlic, minced",
        "2 tablespoons minced fresh ginger, or to taste",
        "1 bunch kale, torn into bite-sized pieces"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Tahini Sauce with Kale, Sea Vegetables, and Soba Noodles",
    "url": "http://allrecipes.com/recipe/220174/spicy-tahini-sauce-with-kale-sea-veg/"
}
