{
    "directions": [
        "Combine coriander, 1 tsp. salt, and 1/4 tsp. pepper in a small bowl. Rub pork with spice mixture.",
        "Heat oil in a 12\" heavy skillet over medium-high until hot but not smoking. Reduce heat to medium and cook pork, turning occasionally, until meat is browned on all sides and an instant-read thermometer inserted diagonally into the center of each tenderloin registers 145°F, 20–25 minutes. Transfer pork with tongs to a cutting board (do not wipe out skillet) and let stand 10 minutes.",
        "Meanwhile, cook shallot and thyme in skillet, stirring, until softened and lightly golden, about 2 minutes. Add wine, vinegar, and sugar. Bring to simmer and cook, scraping up any browned bits and stirring frequently, until liquid is reduced by about half and shallots are tender, about 4 minutes. Stir in cherries, any accumulated juices, and 3/4 tsp. salt and cook 1 minute. Remove from heat, add butter, and swirl skillet to combine. Pluck out thyme sprigs, then season with salt and pepper. Slice pork and serve with sauce."
    ],
    "ingredients": [
        "1 teaspoon ground coriander",
        "Kosher salt, freshly ground black pepper",
        "2 pork tenderloins (about 2 pounds total)",
        "2 tablespoons olive oil",
        "1 large shallot, thinly sliced lengthwise (about 1 cup)",
        "10 sprigs thyme",
        "1 1/4 cups dry red wine",
        "1 tablespoon balsamic vinegar",
        "1 tablespoon sugar",
        "1 (10-ounce) package frozen dark sweet cherries, thawed, halved (about 2 cups)",
        "1 tablespoon cold unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork Tenderloin",
        "Dinner",
        "Kid-Friendly",
        "Quick and Healthy",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spiced Pork Tenderloin With Cherry-Thyme Pan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-pork-tenderloin-with-cherry-thyme-pan-sauce"
}
