{
    "directions": [
        "Combine the chiles, garlic, ginger, 1 teaspoon salt, 1/8 teaspoon turmeric, and 2 teaspoons vegetable oil in a food processor or mortar and pestle and process into a fine paste. (Add a tablespoon of water if you need more liquid.) Set aside.",
        "Place the potatoes in a saucepan with the water and bring to a boil over high heat. Reduce the heat to low, cover the pan, and cook the potatoes until they're soft and easily pierced with a fork, about 15 minutes. Reserve the cooking water.",
        "Mash the potatoes while they're still warm, using some of the cooking water to get a smooth consistency. Mix in 1 tablespoon green chile paste, chickpea flour, 2 1/2 teaspoons salt, 1 teaspoon turmeric, and mustard oil. Add enough reserved potato-cooking water as needed to make a soft dough. Taste the dough for heat level and seasoning (the dough will taste raw, but should be salty and spicy; the flavors will mellow slightly during cooking). Add more salt and chile paste if desired.",
        "Heat the cooking oil in a deep pan over medium-high heat. Use a potato ricer (or sev machine, if you have one) to press noodles into the oil. Fry until golden brown and crisp, about two minutes. Use a skimmer or slotted spoon to transfer the noodles to a paper towel-lined bowl. Repeat until all noodles are fried. Store in an airtight container for up to two weeks."
    ],
    "ingredients": [
        "For the Green Chile Paste:",
        "1/4 cup chopped fresh green chile peppers",
        "1 tablespoon coarsely chopped garlic",
        "2 tablespoons fresh ginger, peeled and coarsely chopped",
        "1 teaspoon salt",
        "1/8 teaspoon ground turmeric",
        "2 teaspoons vegetable oil",
        "For the Noodles:",
        "1 pound potatoes, peeled",
        "3 cups water",
        "3 1/2 cups chickpea flour",
        "2 1/2 teaspoons salt",
        "1 teaspoon ground turmeric",
        "2 tablespoons mustard oil",
        "vegetable oil for deep frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Potato Noodles (Bataka Sev)",
    "url": "http://allrecipes.com/recipe/213577/spicy-potato-noodles-bataka-sev/"
}
