{
    "directions": [
        "Place jalapeno peppers, tomatillos, yellow onion, garlic, and cumin in a blender; pour in enough water to cover the vegetables. Blend until liquified, about 1 minute.",
        "Heat 1/3 cup vegetable oil in a skillet over medium-high heat just until oil has begun to warm, about 30 seconds; pour the blended jalapeno mixture into the oil. Stir in chicken bouillon cubes and cilantro. Reduce heat to medium and cook sauce for 30 minutes, stirring occasionally. Remove green sauce from heat and allow to stand while you complete remaining steps.",
        "Heat 1 cup vegetable oil in a skillet over medium heat. Using a tongs, place each tortilla into the hot oil and fry for a few seconds on each side. Tortillas will be pliable; do not overcook.",
        "Immerse the fried tortilla into the green sauce to coat; place tortilla on a serving plate. Sprinkle tortilla with about 2 teaspoons shredded queso fresco cheese and roll into a thin enchilada. It's easiest if one person is frying tortillas while another person dips in sauce, fills with cheese, and rolls the tortillas.",
        "Place enchiladas onto serving plates; spoon with remaining green sauce and sprinkle with remaining queso fresco cheese. Spread shredded lettuce over the enchiladas and sprinkle with chopped red onion. Top servings with a tablespoon of sour cream."
    ],
    "ingredients": [
        "5 jalapeno peppers, stems removed",
        "3 fresh tomatillos, husks removed - stemmed and halved",
        "1/2 yellow onion",
        "2 cloves garlic",
        "1 1/2 teaspoons ground cumin",
        "water, or as needed to cover",
        "1/3 cup vegetable oil",
        "1 1/2 cubes chicken bouillon",
        "1 sprig fresh cilantro",
        "vegetable oil",
        "20 (6 inch) corn tortillas",
        "1 (12 ounce) package queso fresco (Mexican fresh cheese), shredded",
        "1/2 head lettuce, shredded",
        "1 small red onion, chopped",
        "5 tablespoons sour cream, or to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "SPICY Enchiladas Verdes de Queso",
    "url": "http://allrecipes.com/recipe/221434/spicy-enchiladas-verdes-de-queso/"
}
