{
    "directions": [
        "Place the shoepeg corn and fresh corn into a large pot with the wine and water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer 20 minutes.",
        "Meanwhile, heat the olive oil in a large skillet over medium heat. Stir in the onions, garlic, yellow bell pepper, red bell pepper, and jalapeno pepper. Cook and stir until the vegetables have softened and the onion has turned translucent, about 10 minutes.",
        "Stir the pepper mixture into the pot with the corn along with the soy milk, oregano, and chipotle salsa. Return the soup to a simmer over medium-high heat, then reduce the heat to medium-low, and simmer uncovered for 10 minutes. Dissolve the cornstarch in 1/3 cup of cool water, and stir into the simmering soup along with the honey, soy sauce, orange zest, and garlic powder. Simmer another 10 minutes to thicken the soup, stirring frequently. Remove from the heat and season to taste with salt and cracked pepper before serving."
    ],
    "ingredients": [
        "1 (16 ounce) package Frozen white shoepeg corn",
        "2 ears fresh corn, kernels cut from cob",
        "1 cup dry white wine (such as Pinot Grigio)",
        "2 cups water",
        "1 tablespoon olive oil",
        "1 red onion, diced",
        "2 cloves garlic, minced",
        "1 yellow bell pepper, diced",
        "1 red bell pepper, diced",
        "1/2 small jalapeno pepper, seeded and minced",
        "1 quart soy milk",
        "2 tablespoons chopped fresh oregano",
        "1/2 cup chipotle salsa",
        "3 tablespoons cornstarch",
        "1/3 cup cool water",
        "2 tablespoons honey",
        "1 tablespoon soy sauce",
        "1 teaspoon grated orange zest",
        "garlic powder, or to taste",
        "salt and cracked black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Corn Chowder",
    "url": "http://allrecipes.com/recipe/160631/spicy-corn-chowder/"
}
