{
    "directions": [
        "Cut the tomatoes in half crosswise and squeeze lightly to remove the seeds. With a serrated knife, dice the tomatoes and transfer to a strainer to drain. In a salad bowl, mix together the cucumber, greens, scallions, herbs, jalapeños, and capers. Add the tomatoes.",
        "To make the dressing, whisk together the olive oil, lemon juice, vinegar, lemon zest,and salt and pepper to taste. Pour over the salad and toss. Taste and adjust the seasoning. Refrigerate for 20 to 30 minutes to give the flavors time to meld. Sprinkle with sumac before serving if you like."
    ],
    "ingredients": [
        "3 medium ripe fresh red tomatoes",
        "1/2 English cucumber, quartered lengthwise and finely sliced",
        "1/2 cup tightly packed coarsely chopped purslane or arugula",
        "2 scallions, including most of the green, thinly sliced",
        "1 cup tightly packed coarsely chopped fresh flat-leaf parsley",
        "3 tablespoons chopped fresh mint leaves",
        "1 to 2 tablespoons chopped fresh thyme or savory",
        "2 to 4 jalapeño chiles, seeded and finely diced",
        "2 tablespoons capers, preferably salt-packed, rinsed well and drained (optional)",
        "3 tablespoons fruity extra virgin olive oil",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon balsamic vinegar",
        "2 teaspoons grated lemon zest",
        "Sea salt and freshly ground black pepper",
        "Pinch of sumac (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Tomato",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Vinegar",
        "Lemon",
        "Mint",
        "Meat",
        "Cucumber",
        "Arugula",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Thyme",
        "Jalapeño",
        "Parsley"
    ],
    "title": "Spicy Tomato, Pepper, Cucumber, Mint, and Parsley Salad",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-tomato-pepper-cucumber-mint-and-parsley-salad-355949"
}
