{
    "directions": [
        "Toast coriander, cumin, peppercorns, and cinnamon in small skillet over medium heat until fragrant, about 5 minutes. Transfer to bowl; cool. Grind spices to powder in spice grinder. Transfer spice powder to small bowl; mix in salt and paprika. Place turkey on rack set in large roasting pan; tuck wings under. Sprinkle 1 tablespoon spice mixture in main cavity of turkey and remaining spice mixture all over turkey skin; tie legs together to hold shape. Refrigerate uncovered overnight.",
        "Let turkey stand 1 hour at room temperature.",
        "Set rack at lowest position in oven and preheat to 450°F. Pour 1 1/2 cups turkey broth into pan with turkey. Reduce heat to 350°F; roast turkey 2 hours. Add 2 cups broth to pan. Roast 1 hour; pour 2 cups broth over turkey. Cover turkey loosely with foil. Continue roasting until thermometer inserted into thickest part of thigh registers 175°F, about 1 hour longer.",
        "Place reserved turkey neck, heart, and gizzard in medium saucepan; add 3 cups turkey broth. Cover and simmer 1 hour. Strain broth into 4-cup measuring cup; reserve neck, heart, and gizzard. Skim any fat from surface of giblet broth. Add enough turkey broth to giblet broth to measure 4 cups total. Remove meat from neck. Finely chop neck, heart, and gizzard.",
        "Transfer turkey to platter, tent loosely with foil and kitchen towel, and let stand 30 minutes (internal temperature of turkey will rise 5 to 10 degrees).",
        "Pour pan juices from roasting pan into large measuring cup. Spoon fat from surface. Transfer 4 tablespoons fat to medium saucepan (if needed, use some of reserved fat from turkey broth to measure 4 tablespoons total). Discard any excess fat.",
        "Place roasting pan over 2 burners set at medium-high heat. Add vermouth and Cognac to pan and bring to boil, scraping up browned bits. Add degreased pan juices and 1 cup giblet broth; bring to boil, scraping up browned bits.",
        "Heat reserved 4 tablespoons fat in saucepan over medium-low heat. Add flour, whisking until smooth. Whisk constantly until starting to brown, about 3 minutes. Gradually whisk in pan-juice mixture and 3 cups giblet broth. Simmer until gravy is thick enough to coat spoon, whisking occasionally, about 10 minutes. Mix in chopped neck, heart, and gizzard. Season with salt and pepper. Carve turkey and serve with gravy."
    ],
    "ingredients": [
        "2 tablespoons plus 1 teaspoon coriander seeds",
        "1 1/2 teaspoons cumin seeds",
        "1 1/2 teaspoons whole black peppercorns",
        "1 cinnamon stick, broken in half",
        "2 tablespoons coarse kosher salt",
        "1 1/2 tablespoons smoked sweet paprika (pimentón dulce)*",
        "1 (18- to 20-pound) turkey; neck, heart, and gizzard reserved for giblet broth",
        "5 1/2 cups turkey broth",
        "5 cups (about) turkey broth",
        "3/4 cup dry white vermouth",
        "2 tablespoons Cognac",
        "1/3 cup all purpose flour",
        "*Sweet paprika is available at some supermarkets, at specialty foods stores, and online from latienda.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Spice",
        "Cognac/Armagnac",
        "Fall",
        "Winter",
        "Chill"
    ],
    "title": "Spice-Rubbed Turkey with Cognac Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/spice-rubbed-turkey-with-cognac-gravy-236247"
}
