{
    "directions": [
        "Preheat oven to 425°F. Toast walnuts on a rimmed baking sheet until golden brown, about 5 minutes. Toss bell pepper, tomato, and garlic with oil on a clean rimmed baking sheet and roast until browned and softened, 20–25 minutes. Let cool.",
        "Remove skin from bell pepper, tomato, and garlic; discard. Purée walnuts, bell pepper, tomato, garlic, oil, vinegar, chipotle chile powder, parsley, and paprika in a food processor until smooth. Season sauce with salt and black pepper.",
        "Toast coriander seeds in a dry small skillet over medium heat, swirling pan often and adding cumin seeds during the last 30 seconds, until fragrant, about 2 minutes. Let cool, then finely grind in spice mill or with mortar and pestle.",
        "Pulse onion, cilantro, parsley, and 1 1/2 tsp. salt in a food processor until finely chopped. Transfer to a large kitchen towel. Gather ends of towel in each hand and twist over sink, wringing out as much liquid as possible. Mix onion mixture, spice mixture, egg yolk, paprika, black pepper, cayenne, and remaining 1 tsp. salt in a large bowl to combine. Gently fold lamb into spice mixture to evenly distribute (be careful not to overmix). Using a 1-oz. ice cream scoop or wet hands, form meat mixture into 1 1/2\" balls (you should have 16).",
        "Heat oil in a large skillet, preferably cast iron, over medium-high. Working in 2 batches, cook meatballs, turning occasionally, until browned all over and cooked through, 5–8 minutes. Transfer to a platter and serve with walnut romesco sauce."
    ],
    "ingredients": [
        "1/2 tablespoon chopped walnuts",
        "1 small red bell pepper, halved, seeds removed",
        "1 medium tomato, cored",
        "1 garlic clove, unpeeled",
        "1 tablespoon olive oil",
        "1 tablespoon sherry vinegar",
        "1/2 teaspoon chipotle chile powder or chili powder",
        "1 1/2 teaspoons finely chopped parsley",
        "1/2 teaspoon sweet paprika",
        "Kosher salt, freshly ground pepper",
        "1/2 teaspoon coriander seeds",
        "1 teaspoon cumin seeds",
        "1/2 medium onion, chopped",
        "1 cup (firmly packed) cilantro leaves with tender stems",
        "1 cup (firmly packed) parsley leaves with tender stems",
        "2 1/2 teaspoons kosher salt, divided",
        "1 large egg yolk",
        "1 1/2 teaspoons paprika",
        "1 teaspoon freshly ground black pepper",
        "1/8 teaspoon cayenne pepper",
        "1 pound ground lamb",
        "2 tablespoons olive oil",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Meatball",
        "Lamb",
        "Walnut",
        "Bell Pepper",
        "Tomato",
        "Cilantro",
        "Cumin",
        "Coriander",
        "Paprika",
        "Ground Lamb"
    ],
    "title": "Spiced Lamb Meatballs With Walnut Romesco",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-lamb-meatballs-with-walnut-romesco"
}
