{
    "directions": [
        "Heat grill to medium. Put orange juice in a medium saucepan and cook until reduced by half. Add the blackberries and cook for 2 minutes. Strain the mixture into a bowl. Place the blackberries in another bowl and set aside.",
        "Mix together all the spices and rub the skin side of the duck with some of the rub. Season breasts with salt and drizzle with oil. Grill, rub side down until a crust forms, 3 to 4 minutes. Turn the breasts over and continue cooking to medium doneness, brushing with some of the orange-blackberry glaze every minute or so. Transfer to a large platter.",
        "Brush the cut side of the peaches with oil and season with salt and pepper. Grill the peaches, cut side down until slightly charred about 2 minutes. Turn over and grill for another minute. Arrange cut side up around the duck, or on another platter. Spoon some goat cheese into the peach hollows, scatter the arugula and pecans over, and then some of the cooked blackberries. Serve the remaining berries with the duck and peaches, if desired."
    ],
    "ingredients": [
        "2 cups orange juice",
        "1 pint blackberries",
        "1 tablespoon dry mustard",
        "1 tablespoon sweet paprika",
        "1 teaspoon chili de arbol",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoons five-spice powder",
        "1/2 teaspoon ground coriander",
        "4 duck breasts, scored",
        "Salt and freshly ground black pepper",
        "Canola oil",
        "Ripe peaches, halved and pitted",
        "8 ounces goat cheese, cut into pieces, softened",
        "2 cups baby arugula",
        "1/2 cup coarsely chopped pecans, toasted"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Salad Recipes",
        "Duck Recipes",
        "Poultry Recipes",
        "Fruit",
        "Peach Recipes",
        "Blackberry",
        "Arugula",
        "Vegetable",
        "Cheese",
        "Nut Recipes",
        "Main Dish Recipes",
        "Lunch",
        "Summer",
        "Grilling"
    ],
    "title": "Spice Rubbed Grilled Duck Breast with Grilled Peach and Goat Cheese Salad",
    "url": "http://www.foodnetwork.com/recipes/spice-rubbed-grilled-duck-breast-with-grilled-peach-and-goat-cheese-salad-recipe"
}
