{
    "directions": [
        "Whisk first 3 ingredients in large bowl. Add lard and butter. Rub together with fingertips until mixture resembles coarse damp meal. Add 1/2 cup ice water and vinegar. Stir with fork until moist clumps form, adding more water by tablespoonfuls if dry. Gather dough into ball. Divide into 4 pieces; flatten into disks. Wrap each disk in plastic and chill at least 30 minutes and up to 3 days.",
        "Using spice grinder, finely grind first 4 ingredients. Transfer spice mixture to medium bowl; mix in sugar, flour, and salt. Divide pears between 2 large bowls; mix half of spice mixture and 2 tablespoons cream into each.",
        "Position rack in bottom third of oven and preheat to 400°F. Roll out 1 dough disk on lightly floured surface to 12-inch round. Transfer to 9-inch-diameter glass pie dish. Roll out second dough disk to 12-inch round. Mound 1 bowl of pear filling in crust. Brush overhang lightly with milk. Drape second crust over; press top and bottom overhangs together. Fold under, forming edge of pie. Crimp edge decoratively. Cut 3-inch X in center of top crust; brush with milk and sprinkle with raw sugar. Place on rimmed baking sheet. Repeat rolling and assembly with remaining dough disks and pear filling.",
        "Bake pies 40 minutes. Tent with foil to prevent overbrowning. Bake until crusts are golden brown, pears are tender, and juices are bubbling thickly, about 40 minutes longer. Cool completely. Serve with ice cream.",
        "*Brown star-shaped seedpods; available in the spice section of some supermarkets and at Asian markets and specialty foods stores."
    ],
    "ingredients": [
        "5 cups all purpose flour",
        "2 teaspoons salt",
        "2 teaspoons sugar",
        "8 ounces chilled lard, diced, frozen",
        "1 cup (2 sticks) chilled unsalted butter, cut into pieces",
        "1/2 cup (or more) ice water",
        "2 teaspoons apple cider vinegar",
        "16 whole cloves",
        "4 cinnamon sticks",
        "2 whole star anise*",
        "1/2 vanilla bean, chopped",
        "1 1/3 cups (packed) golden brown sugar",
        "6 tablespoons all purpose flour",
        "1/2 teaspoon salt",
        "9 pounds Bosc pears, peeled, halved, cored, each half cut into 4 slices",
        "4 tablespoons heavy whipping cream",
        "Milk",
        "Raw sugar",
        "Brandied-Prune Ice Cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pear",
        "Spice",
        "Fall",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spiced-Pear Pie",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-pear-pie-233184"
}
