{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line cupcake pans with paper liners.",
        "Combine flour, white sugar, baking soda, 1 teaspoon salt, 1 teaspoon cinnamon, cloves, and nutmeg in bowl; whisk to mix. In separate bowl, mix water, canola oil, vinegar, and 2 teaspoons vanilla extract. Pour liquids into dry mixture and stir until smooth. The batter will be very thin.",
        "Transfer batter into a measuring cup or pitcher; pour batter into prepared cupcake pans.",
        "Bake in preheated oven until tops spring back when gently pressed with a fingertip and a toothpick inserted in the center comes out clean, about 25 minutes. Allow cupcakes to cool completely on a wire rack.",
        "Beat cream cheese, butter, 2 teaspoons vanilla extract, 1/4 teaspoon salt, and 1/8 teaspoon cinnamon with an electric mixer until smooth. Gradually mix in confectioners' sugar until frosting is creamy and spreadable. Frost the cooled cupcakes.",
        "To decorate cupcakes, use black decorating gel to draw a small circle in the center of each cupcake. Draw a larger circle around the first, and continue making larger circles until the last circle is about 1/4 inch from the edge. There should be about 5 rings on each cupcake. Use a toothpick to draw about 8 lines radiating from the center of the cupcake to the edge, like spokes on a wheel, to make webs.",
        "Cut the licorice strings into pieces about 1 1/4 inch long for legs. Poke four licorice legs into both sides of each gumdrop. Use decorating gel to make eyes and a smiley mouth on each gumdrop. Place a gumdrop spider onto each cupcake in the center of the webs."
    ],
    "ingredients": [
        "Spice Cake:",
        "3 cups all-purpose flour",
        "2 cups white sugar",
        "2 teaspoons baking soda",
        "1 teaspoon salt",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground nutmeg",
        "2 cups water",
        "2/3 cup canola oil",
        "2 tablespoons distilled white vinegar",
        "2 teaspoons vanilla extract",
        "Cream Cheese Frosting:",
        "2 (3 ounce) packages cream cheese, softened",
        "1/2 cup butter, softened",
        "2 teaspoons vanilla extract",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground cinnamon",
        "5 cups sifted confectioners' sugar, or more as needed",
        "Decorations:",
        "1 (.68 oz. tube) black decorating gel",
        "24 large spiced gumdrops",
        "black shoestring licorice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spiced Spider Cupcakes",
    "url": "http://allrecipes.com/recipe/234135/spiced-spider-cupcakes/"
}
