{
    "directions": [
        "Whisk first 5 ingredients in medium bowl to blend. Add butter and shortening and rub in with fingertips until mixture resembles very coarse meal. Mix in 4 tablespoons ice water. Mix in more water by tablespoonfuls if dough is dry, tossing until moist clumps form. Gather dough into ball. Divide dough into 2 pieces, 1 slightly larger than the other. Flatten into disks; wrap and chill at least 2 hours and up to 2 days.",
        "Mix sugar, cornstarch, lemon juice and spices in large bowl. Bring medium saucepan of water to boil. Drop in 3 peaches at a time; blanch 1 minute. Transfer peaches to bowl of cold water. Using small sharp knife, peel 1 peach. Cut peach in half; discard pit and slice thinly. Stir peach slices into sugar mixture. Repeat with remaining peaches. Let filling stand until juices form, at least 30 minutes and up to 1 hour.",
        "Preheat oven to 375°F. Roll out larger dough disk on lightly floured surface to 13- to 14-inch round. Transfer to 9-inch-diameter deep-dish pie dish. Roll out smaller dough disk on lightly floured surface to 11-inch round. Using ruler as aid, cut dough into 1/2-inch-wide strips.",
        "Spoon filling into dough-lined dish. Arrange some of dough strips atop pie, spacing 3/4 inch apart. Form lattice by arranging more dough strips at right angle to first strips, spacing 3/4 inch apart. Trim overhang of bottom crust and lattice strips to 3/4 inch. Fold under and crimp edge decoratively.",
        "Bake pie until crust is golden and filling bubbles thickly, covering edge of crust with foil if browning too quickly, about 1 hour 20 minutes. Cool pie to room temperature before serving."
    ],
    "ingredients": [
        "2 1/2 cups all purpose flour",
        "1 tablespoon sugar",
        "2 teaspoons ground ginger",
        "2 teaspoons ground cinnamon",
        "1/2 teaspoon salt",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "1/2 cup chilled solid vegetable shortening, cut into pieces",
        "4 tablespoons (or more) ice water",
        "2/3 cup (packed) golden brown sugar",
        "1/4 cup cornstarch",
        "1 teaspoon fresh lemon juice",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground cinnamon",
        "3 pounds medium peaches"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Picnic",
        "Peach",
        "Spice",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Peach Pie with Lattice Crust",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-peach-pie-with-lattice-crust-103655"
}
