{
    "directions": [
        "Preheat oven to 300 degrees F. Place the ramekins in a deep oven-safe pan or dish. Set aside.",
        "In a small saucepan, heat the heavy cream, whole milk, vanilla bean and scrapings, cinnamon stick, cardamom pods, orange zest and ginger over medium heat. Cook until it comes to a simmer. Turn off heat and let it steep for 10 minutes.",
        "While the heavy cream is steeping, place the sugar and water in a medium saucepan with tall sides. Before turning on the heat, gently mix until the sugar turns the consistency of wet sand. Then cook the mixture, stirring occasionally, over medium-high heat until the sugar starts to melt and turns deep amber. Turn off the heat and slowly whisk in the warm heavy cream mixture.",
        "In a large bowl, whisk together egg yolks and salt. Slowly stir in the warm caramel mixture. Strain this custard through a fine sieve and discard spices.",
        "Pour the custard into the ramekins and fill the baking pan with boiling water to halfway up the sides of the ramekins. Be careful not to let the water enter inside the ramekin. Cover the baking pan with Reynolds Wrap®  Aluminum Foil and place inside the oven.",
        "Bake for 60-75 minutes until the center of the custard is set but still jiggles slightly. Remove from oven and let the ramekins sit in the pan until cool enough to handle. Dry the bottoms of the ramekins and refrigerate for at least 4 hours. Serve with whipped cream and chopped pistachios."
    ],
    "ingredients": [
        "8 ramekins (small baking dishes)",
        "3 cups heavy cream",
        "1 cup whole milk",
        "1 vanilla bean, split lengthwise and scraped",
        "1 cinnamon stick",
        "4 cardamom pods, cracked",
        "Zest of 1 orange",
        "2 teaspoons freshly grated gingerroot",
        "1 cup sugar",
        "2 tablespoons water",
        "10 egg yolks",
        "1/2 teaspoon kosher salt",
        "1 cup whipped cream",
        "1/4 cup chopped pistachios",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spiced Orange Caramel Custard",
    "url": "http://allrecipes.com/recipe/245244/spiced-orange-caramel-custard/"
}
