{
    "directions": [
        "Prepare grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Combine paprika, salt, black pepper, and cayenne in a small bowl.",
        "Working one at a time, place chickens on a work surface, skin side up. Using your palms, press firmly on breastbone to flatten breast. Season chickens all over with paprika mixture, patting to adhere.",
        "Grill chickens, skin side up, over direct heat, rotating occasionally and moving to cooler side of grill as needed to control flare-ups, until browned, 5–8 minutes. Turn skin side down and grill, rotating occasionally, until browned, 8–10 minutes. Turn chickens skin side up and move to indirect heat. Grill, rotating occasionally, until an instant-read thermometer inserted into the thickest part of thighs registers 165°, 50–60 minutes. Transfer to cutting boards and let rest 5 minutes.",
        "Meanwhile, drizzle bread on both sides with 1/4 cup oil total and grill over direct heat until toasted and lightly charred, about 4 minutes; transfer to a platter.",
        "Grill lemons, cut side down, over direct heat until lightly charred and juices start to caramelize, about 4 minutes.",
        "Place chickens on top of bread and scatter parsley over. Squeeze 2 or 3 lemon halves over; serve with remaining lemons.",
        "Chickens can be grilled 2 hours ahead; hold at room temperature. Grill over high to reheat, about 4 minutes, before finishing as directed above."
    ],
    "ingredients": [
        "1/4 cup hot smoked Spanish paprika",
        "1/4 cup kosher salt",
        "1/4 cup coarsely ground black pepper",
        "1 1/2 tablespoons cayenne pepper",
        "2 (3 1/2–4-pound) chickens, preferably organic, backbones removed",
        "1 loaf country-style bread, sliced lengthwise 1\" thick",
        "1/4 cup extra-virgin olive oil",
        "4 lemons, halved",
        "1/2 cup parsley leaves with tender stems"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Kid-Friendly",
        "Spring",
        "Summer",
        "Grill/Barbecue",
        "Healthy"
    ],
    "title": "Spicy Grilled Chicken with Lemon and Parsley",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-grilled-chicken-with-lemon-and-parsley-56389666"
}
