{
    "directions": [
        "Line small baking sheet (or large plate) with foil. Add enough hot water (125°F. to 130°F.) to 9-inch-diameter cake pan to measure depth of 1 inch. Place 6 ounces finely chopped milk chocolate in 3- to 4-cup glass bowl; place bowl in hot water. Let stand just until outer edges of chocolate melt. Stir until chocolate is partially melted (some soft pieces will remain). Transfer bowl to work surface and stir until chocolate is melted and smooth and instant-read thermometer registers no higher than 88°F. (barely lukewarm). If melted chocolate is warmer than 88°F., add 1-inch piece of milk chocolate and stir until temperature falls below 88°F. Remove any remaining piece of chocolate.",
        "Hold 1 leaf with heavily veined side up. Using pastry brush, carefully coat upper surface completely with chocolate. Using fingertips, wipe away any chocolate overflow from edges of leaf. Place leaf, chocolate side up, on prepared baking sheet. Repeat with 7 more leaves. Refrigerate coated leaves until chocolate is cold and set, about 10 minutes.",
        "Carefully peel lemon leaves off chocolate leaves; return chocolate leaves to baking sheet and refrigerate.",
        "Line another small baking sheet (or large plate) with foil. Melt 6 ounces white chocolate and make 8 white chocolate leaves, following technique and temperature guidelines for milk chocolate leaves.",
        "Line another small baking sheet (or large plate) with foil. Melt 6 ounces bittersweet chocolate and make 8 bittersweet chocolate leaves, following technique for milk chocolate leaves. (Chocolate leaves can be prepared 2 days ahead. Keep refrigerated.)",
        "Preheat oven to 350°F. Line bottoms of two 9-inch-diameter cake pans with 2-inch-high sides with waxed paper. Spray sides of pans with nonstick spray. Sift flour, baking powder, cinnamon, nutmeg, baking soda, salt and cloves into medium bowl; sift again. Place currants in small bowl. Add 1 tablespoon flour mixture and toss to coat; mix in walnuts.",
        "Using electric mixer, beat butter in large bowl until fluffy. Gradually beat in sugar. Beat in eggs 1 at a time. Beat in flour mixture in 3 additions alternately with milk in 2 additions. Beat in pumpkin. Fold in currant-walnut mixture. Divide batter equally between prepared pans (batter will be about 3/4 inch deep).",
        "Bake cakes until tester inserted into center comes out clean, about 25 minutes. Cool cakes in pans on racks 10 minutes. Turn cakes out onto racks; peel off waxed paper. Cool layers completely. (Can be prepared 1 day ahead. Wrap in foil and store at room temperature.)",
        "Beat butter, brown sugar, molasses, vanilla and orange peel in large bowl until fluffy. Beat in cream cheese. Sift powdered sugar over; beat to blend. (Frosted cake can be prepared up to 1 day ahead. Cover with cake dome and refrigerate. Let cake stand at room temperature 2 hours before continuing.)",
        "Place 1 cake layer, bottom side up, on platter. Spread with 1 1/2 cups frosting. Top with second cake layer, bottom side down. Spread remaining frosting smoothly over top and sides of cake.",
        "Arrange chocolate leaves decoratively on top and sides of cake. Serve immediately or let stand up to 2 hours."
    ],
    "ingredients": [
        "6 ounces imported milk chocolate (such as Lindt), finely chopped, plus one 1-inch piece of milk chocolate",
        "24 fresh lemon or camellia leaves, wiped clean with moist paper towels, patted dry",
        "6 ounces good-quality white chocolate (such as Lindt or Baker's), finely chopped, plus one 1-inch piece of white chocolate",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, finely chopped, plus one 1-inch piece of bittersweet chocolate",
        "Nonstick vegetable oil spray",
        "2 cups cake flour",
        "2 teaspoons baking powder",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground cloves",
        "1/2 cup dried currants",
        "1/2 cup chopped walnuts",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 1/2 cups (packed) golden brown sugar",
        "2 large eggs",
        "1/2 cup whole milk",
        "1 cup canned solid pack pumpkin",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "3/4 cup (packed) dark brown sugar",
        "3 tablespoons robust-flavored (dark) molasses",
        "1 tablespoon vanilla extract",
        "1 1/2 teaspoons grated orange peel",
        "2 8-ounce packages chilled cream cheese",
        "1/3 cup powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Cream Cheese",
        "Spice",
        "Pumpkin",
        "Fall",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Pumpkin Cake with Cream Cheese Frosting and Chocolate Leaves",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-pumpkin-cake-with-cream-cheese-frosting-and-chocolate-leaves-15548"
}
