{
    "directions": [
        "Bring mushrooms, sugar, 1/2 cup soy sauce, 1/2 cup vinegar, and 1 cup water to a simmer in a small saucepan over medium-high heat and cook, stirring occasionally, until sugar is dissolved, about 5 minutes. Transfer mushrooms to a medium bowl with a slotted spoon. Let brine cool, then pour over mushrooms. Cover and chill at least 1 hour.",
        "Meanwhile, rinse rice until water runs clear (this removes surface starch and keeps rice from getting gummy). Combine rice and 2 cups water in a medium saucepan, season with salt, and let sit 30 minutes.",
        "Bring rice to a boil. Reduce heat to low, cover, and cook until tender, 30–35 minutes (you can also use a rice cooker). Remove from heat and let sit, covered, 15 minutes; fluff with a fork. Keep warm.",
        "Soak wakame in 1/2 cup cold water in a small bowl until softened, 6–8 minutes. Drain and mix in a clean small bowl with black bean paste, honey, oil, remaining 5 tsp. soy sauce, and remaining 5 tsp. vinegar. Add tofu to spicy black bean shoyu, season with salt, and gently toss. Let sit 10 minutes to let flavors meld. Taste and season with more salt if needed.",
        "Divide rice among bowls and spoon tofu mixture on top of rice. Arrange drained pickled shiitake mushrooms, scallions, peanuts, and some tobiko, if using, around tofu mixture.",
        "Mushrooms can be pickled 5 days ahead. Keep chilled."
    ],
    "ingredients": [
        "6 ounces shiitake mushrooms, stems removed, caps thinly sliced",
        "1/3 cup sugar",
        "1/2 cup plus 5 teaspoons soy sauce",
        "1/2 cup plus 5 teaspoons unseasoned rice vinegar",
        "1 1/2 cups short-grain brown or white sushi rice",
        "Kosher salt",
        "2 tablespoons dried wakame (seaweed)",
        "5 teaspoons spicy black bean paste",
        "1 tablespoon honey",
        "1 1/2 teaspoons toasted sesame oil",
        "1 (14-ounce) package firm tofu, drained, patted dry, cut into 3/4-inch pieces",
        "3 scallions, thinly sliced on a diagonal",
        "1/4 cup coarsely chopped unsalted, roasted, skin-on peanuts",
        "Tobiko (for serving; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tofu",
        "Rice",
        "Vegetarian",
        "Mushroom",
        "Pickles",
        "Sesame Oil",
        "Peanut",
        "Dinner"
    ],
    "title": "Spicy Tofu With Pickled Shiitake Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-tofu-with-pickled-shiitake-mushrooms"
}
