{
    "directions": [
        "In small bowl, combine raisins and rum. Let stand until raisins plump, about 1 hour. Drain, discarding rum, and set aside.",
        "Position rack in middle of oven and preheat to 350°F. Lightly butter bundt pan, then dust with flour, knocking out excess.",
        "In large mixing bowl or bowl of electric mixer, sift together flour, baking powder, baking soda, allspice, cinnamon, nutmeg, cloves, and salt. Add brown and granulated sugars, butter, eggs, and vanilla. Using electric mixer, beat on high speed, scraping down sides of bowl with rubber spatula as needed, until batter is pale and smooth, about 3 minutes for handheld mixer or 2 minutes for standing mixer. Stir in apples, pecans, ginger, and raisins. Spoon into prepared pan and smooth top.",
        "Bake until wooden pick or skewer inserted in center of cake comes out clean and cake just shrinks from sides of pan, about 1 hour. Cool cake in pan on rack 10 minutes, then invert and unmold onto rack and cool completely. (Cake can be made up to 3 days ahead and stored at room temperature, wrapped tightly in plastic wrap.)",
        "Just before serving, sift confectioner's sugar over cake. Serve accompanied by eggnog."
    ],
    "ingredients": [
        "1/2 cup raisins or dried cranberries",
        "3 tablespoons Applejack, dark or golden rum, or warm water",
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1 teaspoon ground allspice",
        "1 teaspoon ground cinnamon",
        "1 teaspoon freshly grated nutmeg",
        "1/4 teaspoon ground cloves",
        "1/2 teaspoon salt",
        "1 cup (packed) light brown sugar, sifted",
        "1 cup granulated sugar",
        "1 cup (2 sticks) unsalted butter, softened",
        "3 large eggs",
        "1 teaspoon vanilla extract",
        "3 Golden Delicious apples, peeled, cored, and cut into 1/2-inch dice (about 4 cups)",
        "1 cup (4 ounces) pecans, coarsely chopped",
        "1/3 cup crystallized ginger, finely chopped",
        "Special Equipment: 10-inch bundt pan (3 1/4 inches deep; 3-qt capacity)",
        "Garnish: confectioner's sugar for dusting",
        "Accompaniment: 3 cups eggnog, chilled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Ginger",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cranberry",
        "Dried Fruit",
        "Raisin",
        "Apple",
        "Pecan",
        "Spice",
        "Fall",
        "Cinnamon",
        "Clove",
        "Nutmeg",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Apple Cake with Eggnog Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-apple-cake-with-eggnog-sauce-240450"
}
