{
    "directions": [
        "Chop the cilantro and parsley leaves together to a very fine mince. You should have 1 cup of minced herbs. Transfer to a saucepan.",
        "Crush the garlic with the sea salt in a mortar, or using the back of a spoon in a small bowl, to make a paste. Stir in the cumin, dried pepper, paprika, olive oil, and lemon juice. Add to the saucepan with the herbs and mix well.",
        "Have the fish steaks ready in a baking dish large enough to hold them all in one layer.",
        "Set the herb mixture over medium-low heat and warm until it is very hot, but not boiling. Taste and adjust the seasoning. When it is the way you want it, pour the warm marinade over the fish steaks. Cover with plastic and set aside for an hour or so.",
        "When you are ready to cook, preheat the oven to 350°F.",
        "Remove the plastic wrap and transfer the fish with their marinade to the oven. Bake for 20 to 30 minutes, or until the fish is done, basting every 5 minutes or so with the marinade.",
        "Serve immediately, spooning a little of the marinade over each serving."
    ],
    "ingredients": [
        "1 large bunch freshly cilantro",
        "1 large bunch flat-leaf parsley",
        "8 garlic cloves, crushed with the flat blade of a knife",
        "1 teaspoon sea salt, or more to taste",
        "1 tablespoon fresh ground cumin, or more to taste",
        "1 tablespoon very fragrant crushed dried red pepper, or more to taste",
        "1 tablespoon ground sweet red pepper paprika, or more to taste",
        "1/2 cup extra-virgin olive oil",
        "1/4 cup fresh lemon juice or white wine vinegar (lemon is better, I think)",
        "6 to 8 small salmon steaks, each weighing about 6 ounces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Bake",
        "Marinate",
        "Lemon",
        "Salmon",
        "Cilantro",
        "Parsley"
    ],
    "title": "Spiced Herb Marinade for Fish",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-herb-marinade-for-fish-107794"
}
