{
    "directions": [
        "Combine first 6 ingredients in medium bowl. Add cold water to cover, then drain. Place spices in large wok or skillet. Dry-roast over medium-low heat until dry and fragrant, stirring constantly, about 10 minutes. Transfer mixture to spice grinder. Add salt and mace; grind to fine powder. DO AHEAD: Spice mix can be made 1 week ahead. Store airtight at room temperature.",
        "Place chiles in small bowl; add cold water to cover. Let soak 30 minutes. Drain, reserving soaking liquid.",
        "Combine cilantro stems, onion, garlic, galangal, and lemongrass in large wok or skillet. Dry-roast over medium heat until slightly charred and fragrant, stirring often, about 10 minutes. Add 3/4 cup water. Cover wok and cook until galangal is tender, about 35 minutes; cool in wok.",
        "Scrape galangal mixture into processor. Add drained red chiles. Blend, adding enough reserved chile soaking liquid by tablespoonfuls to form smooth paste. Stir in spice mix. DO AHEAD: Can be made 1 week ahead. Transfer to bowl, cover, and chill.",
        "Preheat oven to 350°F. Char yellow chile directly over gas flame or in broiler until blackened on all sides. Enclose in paper bag 10 minutes. Peel, seed, and slice chile.",
        "Heat 3 tablespoons oil in large ovenproof pot over medium-high heat. Sprinkle beef with salt and pepper. Add to pot; sear until brown, about 2 minutes per side. Transfer beef to plate. Add coconut milk, cilantro stems, fish sauce, palm sugar, and lemongrass to same pot. Return beef to pot and bring to simmer. Cover and place pot in oven. Braise beef until tender enough to pull away from bone, about 2 1/2 hours. Transfer beef to plate and cool. Strain braising liquid from pot into bowl. Thinly slice meat.",
        "Heat remaining 1 tablespoon oil in heavy large skillet over medium-low heat. Add curry paste. Stir until heated and fragrant, about 5 minutes. Add 1 1/2 cups reserved braising liquid and bring to boil. Add roasted chile, tangerine juice, and crushed peanuts, then beef. Simmer until sauce coats beef, about 5 minutes. Season to taste with salt and pepper.",
        "Transfer beef curry to shallow bowl. Garnish with whole peanuts and cilantro leaves. Drizzle with coconut cream."
    ],
    "ingredients": [
        "3 whole cloves",
        "1 1/2 teaspoons coriander seeds",
        "1 1 1/2-inch piece cinnamon stick",
        "1 whole star anise",
        "1 teaspoon cumin seeds",
        "1/8 teaspoon cardamom seeds (from 2 whole green cardamom pods)",
        "1 teaspoon fleur de sel or coarse kosher salt",
        "1/2 teaspoon ground mace",
        "10 small dried red chiles (such as chiles de árbol), stemmed",
        "25 long fresh cilantro stems",
        "1 medium red onion, chopped",
        "6 garlic cloves, peeled",
        "1 1 1/2-inch piece fresh galangal or peeled fresh ginger, thinly sliced",
        "1 1/2 tablespoons chopped or grated lemongrass",
        "3/4 cup water",
        "1 long mild yellow chile (such as banana chile)",
        "4 tablespoons vegetable oil, divided",
        "2 1-pound pieces beef shank (each about 2 inches thick)",
        "6 cups unsweetened coconut milk",
        "25 long fresh cilantro stems",
        "1 1/2 cup fish sauce (such as nam pla or nuoc nam)",
        "1/3 cup palm sugar",
        "2 4-inch-long bottoms of lemongrass stalks",
        "1/4 cup fresh tangerine or tangelo juice",
        "1/3 cup salted roasted peanuts, crushed, plus",
        "1/3 cup whole salted roasted peanuts for garnish",
        "3/4 cup fresh cilantro leaves",
        "3 tablespoons coconut cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Wok",
        "Braise",
        "Stir-Fry",
        "High Fiber",
        "Dinner",
        "Beef Shank",
        "Curry",
        "Winter",
        "Party",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spicy Beef Curry",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-beef-curry-241882"
}
