{
    "directions": [
        "Select Sauté on high heat on the Instant Pot and add the oil.",
        "Once hot, add the onion and ginger and sauté for 2 minutes. Add the garlic, curry powder, and turmeric and cook, stirring, for 1 minute.",
        "Add the chicken and season with salt and pepper. Add the coconut milk and water. Secure the lid.",
        "Select Manual and cook for 13 minutes on high pressure.",
        "When cooking is complete, use a quick release. Transfer the chicken to a platter.",
        "Add the rice, chopped cilantro stems, and sugar and secure the lid. Select Manual and cook on high pressure for 4 minutes.",
        "Meanwhile, remove the skin and bones from the chicken and discard.",
        "When the rice is cooked, select Cancel and let naturally release for 10 minutes. Release any remaining steam.",
        "Add the chicken back to the pot and add the juice of half the lime. Stir and season with salt and pepper. Serve in bowls topped with cilantro leaves and lime wedges.",
        "To boost the nutritional value, use brown rice, adding an extra 1/4 cup water and cooking the rice for 22 minutes on high pressure with a 10-minute natural release."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "1 onion, cut into 1/4-inch slices",
        "1 (1-inch) piece ginger, peeled and cut into 1/4-inch slices",
        "3 medium garlic cloves, minced",
        "1 tablespoon curry powder",
        "1 teaspoon ground turmeric",
        "2 pounds bone-in, skin-on chicken thighs",
        "Kosher salt",
        "Freshly ground black pepper",
        "1 (14-ounce) can light coconut milk",
        "1/2 cup water",
        "1 1/3 cups jasmine rice, rinsed",
        "2 tablespoons cilantro leaves plus stems, stems and leaves divided",
        "1 1/2 teaspoons sugar",
        "1 lime, halved (one half cut into wedges, for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pressure Cooker",
        "Chicken",
        "Coconut",
        "Curry",
        "Rice",
        "Instant Pot"
    ],
    "title": "Spiced Coconut Chicken and Rice",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-coconut-chicken-and-rice"
}
