{
    "directions": [
        "Cut off the wing tips, reserving them for another use such as stock if desired, and halve the wings at the joint. Separate the \"drumstick,\" or first-joint, pieces (the thick ones) from the second-joint pieces. Beginning at the narrower end of each \"drumstick,\" with a sharp knife cut the tendons and, holding the exposed end of the bone with a kitchen towel, scrape the skin and meat down the bone as far as possible toward the thicker end to make a plump drumstick shape. Cut through the cartilage at one end of each second-joint piece, separating the bones, scrape the skin and meat down the large bone to make a plump drumstick shape, and pull out and discard the smaller bone. Arrange all of the \"drumsticks\" in a shallow dish, sprinkle them with the lemon juice and salt and pepper to taste, and let them marinate, covered and chilled, for 1 hour.",
        "In a bowl whisk together the flour, the salt, the paprika, the cumin, the pepper, the thyme, and the cayenne and make a well in the center. Add the beer and the oil in a stream, whisking, and whisk the batter until it is smooth. Let the batter stand at room temperature for 1 hour. Stir the batter before using it.",
        "In a large deep fryer or large deep kettle heat 2 inches of the oil to 375°F. on a deep-fat thermometer. Dip the chicken in the batter and fry it in the oil, 5 pieces at a time, turning it, for 3 minutes, or until it is cooked through and golden. Transfer the chicken with a slotted spoon as it is fried to paper towels to drain and make sure the oil returns to 375°F. before adding each new batch. Sprinkle the \"drumsticks\" with salt to taste, arrange them on a platter, and garnish the platter with the parsley sprigs."
    ],
    "ingredients": [
        "2 pounds chicken wings (about 10)",
        "2 tablespoons fresh lemon juice",
        "1 cup all-purpose flour",
        "2 teaspoons salt",
        "2 teaspoons paprika",
        "1 1/2 teaspoons ground cumin",
        "1 1/2 teaspoons pepper",
        "3/4 teaspoon dried thyme, crumbled",
        "1/2 teaspoon cayenne",
        "1 cup beer (not dark)",
        "1 tablespoon vegetables oil",
        "vegetable oil for deep-frying",
        "parsley sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Chicken",
        "Herb",
        "Appetizer",
        "Fry",
        "Marinate",
        "Super Bowl",
        "Spice",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spicy Fried Chicken Wing \"Drumsticks\"",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-fried-chicken-wing-drumsticks-11548"
}
