{
    "directions": [
        "Make filling: In a small saucepan of boiling water blanch peach 1 minute and drain. Peel and pit peach and slice thin. In a small bowl toss peach slices with sugar, mint, and lemon juice.",
        "Make shortcakes: Preheat oven to 425°F.",
        "In a small bowl whisk together flour, sugar, baking powder, cinnamon, and a pinch salt. Add cream and stir with a fork until mixture just forms a dough. Turn dough out onto a lightly floured surface and with floured hands pat into a 6- by 3-inch rectangle. With a sharp knife trim edges and halve dough crosswise to form two 3-inch squares.",
        "Arrange dough squares 2 inches apart on a lightly greased baking sheet and bake in middle of oven until golden, 12 to 15 minutes. (Squares will spread more than they will rise.) Transfer shortcakes to a rack and cool 10 minutes.",
        "Make whipped cream: In a small bowl with an egg beater or electric mixer beat cream with sugar until it just holds soft peaks and beat in vanilla.",
        "Split shortcakes with a serrated knife and put a bottom half on each of 2 plates. Top with peaches and any liquid, whipped cream, and shortcake tops."
    ],
    "ingredients": [
        "1 firm-ripe large peach",
        "1 tablespoon granulated sugar",
        "1 tablespoon finely chopped fresh mint leaves",
        "2 teaspoons fresh lemon juice",
        "1/2 cup all-purpose flour",
        "2 tablespoons firmly packed brown sugar",
        "1 teaspoon baking powder",
        "1/4 teaspoon cinnamon",
        "1/3 cup plus 1 tablespoon heavy cream",
        "1/4 cup well-chilled heavy cream",
        "1 teaspoon granulated sugar",
        "1/4 teaspoon vanilla"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fruit",
        "Dessert",
        "Bake",
        "Peach",
        "Mint",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Shortcakes with Minted Peaches",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-shortcakes-with-minted-peaches-12452"
}
