{
    "directions": [
        "For the brownies: Position an oven rack in the lower third of the oven. Preheat the oven to 350 degrees F. Spray a 9-by-13-inch ceramic or glass baking dish with vegetable oil cooking spray. Line the dish with a 15-inch-square piece of parchment paper, allowing the excess paper to overhang the sides. Spray the parchment paper with vegetable oil cooking spray.",
        "Blend together the brownie mix, eggs, vegetable oil, 1/4 cup water, cinnamon and cayenne pepper in a large bowl. Beat the mixture for 1 minute using an electric hand mixer on medium speed. Pour the batter into the prepared pan. Bake until a toothpick inserted about 1-inch from the edge of the baking dish comes out clean, 25 to 27 minutes. Transfer the pan to a wire rack to cool for 1 hour.",
        "For the buttercream: Place the cream and chocolate chips in a medium bowl over a pan of barely simmering water. Stir until the chocolate has melted and the mixture is smooth. Remove the bowl from the pan and refrigerate until thick, 20 minutes. Add the butter and cocoa powder and beat the mixture on high speed until light and fluffy, about 1 minute. Spread the buttercream over the cooled brownie layer. Dust with the cinnamon and refrigerate until firm, about 30 minutes.",
        "Lift the brownie layer from the pan, using the excess paper for handles. Run a thin spatula underneath the brownie layer to loosen it from the parchment paper. Cut into 24 brownies and serve.",
        "Cook's Note: The buttercream can be made ahead of time. Cover and refrigerate until ready to serve. Allow the buttercream to come to room temperature for 30 minutes then beat until smooth enough to spread."
    ],
    "ingredients": [
        "Vegetable oil cooking spray, for greasing pan",
        "One 21-ounce box brownie mix, such as Duncan Hines Chewy Fudge",
        "3 large eggs, at room temperature",
        "1/2 cup vegetable oil",
        "1 tablespoon ground cinnamon",
        "1/2 teaspoon cayenne pepper",
        "1/2 cup heavy cream, at room temperature",
        "1 cup semisweet chocolate chips, such as Ghiradelli",
        "1 stick unsalted butter, at room temperature, cut into 1/2-inch pieces",
        "2 tablespoons unsweetened cocoa powder",
        "Ground cinnamon, for dusting"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Baking",
        "Brownie",
        "Chocolate"
    ],
    "title": "Spicy Cinnamon-Chocolate Brownies",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/spicy-cinnamon-chocolate-brownies-recipe"
}
