{
    "directions": [
        "Preheat oven to 350°F.",
        "Pat lamb dry and sprinkle with pepper and 1 teaspoon salt. Heat 1 tablespoon oil in a 10-inch heavy skillet (preferably cast-iron) over moderately high heat until hot but not smoking, then brown lamb in 5 batches, turning occasionally, about 4 minutes per batch, adding more oil as needed. Transfer as browned to an ovenproof 6- to 7-quart wide heavy pot.",
        "Pour off all but 1 tablespoon fat from skillet, then cook onion and celery in remaining fat over moderate heat, stirring occasionally, until golden, about 3 minutes. Add garlic, cumin, and coriander and cook, stirring, 1 minute. Add 1 cup water and deglaze skillet by boiling, stirring and scraping up any brown bits, 1 minute, then pour mixture over lamb in pot.",
        "Pour juice from can of tomatoes into stew, then coarsely chop tomatoes and add to stew along with remaining cup water and remaining 1/2 teaspoon salt and bring to a boil (liquid should almost cover meat).",
        "Cover pot and braise lamb in middle of oven 1 1/2 hours. Stir in carrots and continue to braise until carrots and lamb are tender, 20 to 30 minutes. Transfer pot to top of stove and, working over moderately high heat, stir in spinach by handfuls to soften it. Cook, uncovered, stirring occasionally, until spinach is tender, 5 to 8 minutes. Season with salt and pepper."
    ],
    "ingredients": [
        "3 1/2 lb boneless lamb shoulder, trimmed and cut into 2-inch pieces",
        "1 teaspoon black pepper",
        "1 1/2 teaspoons salt",
        "1 to 3 tablespoons olive oil",
        "1 large onion, chopped",
        "1 celery rib, chopped",
        "3 garlic cloves, finely chopped",
        "4 teaspoons ground cumin",
        "2 teaspoons ground coriander",
        "2 cups water",
        "1 (14- to 16-oz) can whole tomatoes in juice",
        "6 medium carrots, cut crosswise into 2 1/2-inch pieces",
        "1 1/2 lb spinach, coarse stems discarded",
        "Accompaniments: matzo scallion pancakes and haroseth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Tomato",
        "Braise",
        "Passover",
        "Rosh Hashanah/Yom Kippur",
        "Spinach",
        "Carrot",
        "Kosher",
        "Gourmet"
    ],
    "title": "Spiced Braised Lamb with Carrots and Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-braised-lamb-with-carrots-and-spinach-107979"
}
