{
    "directions": [
        "Spread out couscous on a rimmed baking sheet. Bring stock, cinnamon stick, 2 star anise pods, 2 tsp. salt, 1/2 tsp. coriander seeds, and 1/2 tsp. cumin seeds to a simmer in a small saucepan over medium heat, stirring occasionally, until salt is dissolved, about 4 minutes. Let cool. Strain stock over couscous; discard solids. Let sit, stirring occasionally, until liquid is absorbed and grains begin to swell, 10–15 minutes. Rake and rub couscous with your hands until no clumps remain.",
        "Pour water into a large pot to come 1\" up sides. Add garlic, remaining 2 star anise pods, remaining 1/2 tsp. coriander seeds, and remaining 1/2 tsp. cumin seeds and bring to a gentle simmer. Transfer couscous to a steamer basket or a colander and set inside pot, making sure couscous is not touching water. The sides of the steamer basket should be in direct contact with the pot; this forces the steam up through the couscous instead of around the sides. (If there’s a gap between the steamer and the pot, fill it in with crumpled foil.) Steam, uncovered, gently tossing occasionally, until steam escapes through couscous, 15–20 minutes.",
        "Spread out couscous on a clean baking sheet, discarding any grains that may have stuck to steamer basket. Drizzle 1/4 cup cold water over couscous to moisten. Let cool slightly, then rub couscous to break up any clumps.",
        "Pour fresh water into pot to come 1\" up sides and steam couscous again, tossing occasionally, until tender and nearly tripled in size, 15–20 minutes.",
        "Meanwhile, melt butter in a small saucepan over medium, stirring often, and cook until it foams, then browns, 5–8 minutes.",
        "Transfer couscous back to rimmed baking sheet and toss with a slotted spoon to remove any remaining clumps. Drizzle with brown butter and toss to coat. Taste couscous and season with more salt if needed.",
        "Couscous can be steamed once 4 hours ahead. Store on baking sheet at room temperature. Steam the second time just before serving."
    ],
    "ingredients": [
        "3 cups medium-grind couscous (not instant)",
        "2 cups chicken or vegetable stock",
        "1 (3-inch) cinnamon stick",
        "4 star anise pods, divided",
        "2 teaspoons kosher salt, plus more",
        "1 teaspoon coriander seeds, divided",
        "1 teaspoon cumin seeds, divided",
        "2 garlic cloves, crushed",
        "6 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Couscous",
        "Side",
        "Cinnamon",
        "Anise",
        "Coriander",
        "Butter",
        "Vegetarian"
    ],
    "title": "Spiced and Steamed Couscous With Brown Butter",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-and-steamed-couscous-with-brown-butter"
}
