{
    "directions": [
        "Put oven rack in middle position and preheat oven to 400°F. Lightly oil a 9 1/2-inch (6-cup capacity) pie plate.",
        "Cook onion in 2 tablespoons oil in a deep 10-inch heavy skillet over moderate heat, stirring occasionally, until edges are golden, 3 to 4 minutes. Add garlic and cook, stirring, 1 minute. Add beef and cook, breaking up large lumps, until no longer pink, 4 to 5 minutes. Add sugar, spices, and 1 teaspoon salt and cook, stirring, 1 minute. Add tomatoes with juice and briskly simmer, stirring occasionally, until liquid is reduced to about 1/4 cup, 8 to 10 minutes.",
        "While beef simmers, whisk together cornmeal, flour, baking powder, and remaining 1/4 teaspoon salt in a medium bowl. Whisk together milk, egg, and remaining 2 tablespoons oil in a small bowl, then stir into cornmeal mixture until just combined. Fold in 1/2 cup cheese.",
        "Spoon cooked spiced beef into pie plate with a slotted spoon, reserving juices in skillet. Skim off and discard fat from juices if desired, then pour juices over beef in pie plate.",
        "Spoon 4 mounds of corn bread batter over beef, then sprinkle remaining 2 tablespoons cheese over batter. Bake until a wooden pick or skewer inserted into center of corn bread comes out clean, 15 to 25 minutes.",
        "Serve cobbler warm."
    ],
    "ingredients": [
        "1 medium onion, chopped",
        "4 tablespoons vegetable oil",
        "2 garlic cloves, finely chopped",
        "1 pound ground beef chuck",
        "1 teaspoon sugar",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon cayenne",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon black pepper",
        "3/4 teaspoon ground ginger",
        "1 1/4 teaspoons salt",
        "1 (14- to 15-ounce) can diced tomatoes in juice",
        "2/3 cup yellow cornmeal",
        "1/3 cup all-purpose flour",
        "1 teaspoon baking powder",
        "1/3 cup whole milk",
        "1 large egg",
        "2 ounces coarsely grated sharp Cheddar (1/2 cup plus 2 tablespoons)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Tomato",
        "Bake",
        "Kid-Friendly",
        "Quick & Easy",
        "Cheddar",
        "Ground Beef",
        "Cornmeal",
        "Spice",
        "Winter",
        "Cinnamon",
        "Gourmet"
    ],
    "title": "Spiced Beef Corn Bread Cobbler",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-beef-corn-bread-cobbler-236678"
}
