{
    "directions": [
        "Heat 3 tablespoons oil in heavy large pot over medium heat. Add onion; sauté 5 minutes. Add carrot, celery, and garlic; sauté 5 minutes. Add tomatoes with juices and 1 bottle clam juice and bring to boil. Reduce heat; simmer uncovered 10 minutes. Cover and simmer 10 minutes. Transfer mixture to processor. Blend to chunky puree; return to pot. Mix in 2 bottles clam juice to make tomato broth.",
        "Combine mussels, clams, and wine in another large pot. Cover and cook over high heat until mussels and clams open, about 8 minutes. Using tongs, transfer mussels and clams to bowl (discard any that do not open). Strain cooking liquid into tomato broth.",
        "Place couscous in large bowl. Bring 2 1/2 cups water, 3 cups tomato broth, and 1/4 cup oil to boil in medium saucepan. Mix into couscous. Cover; let stand until liquid is absorbed, about 10 minutes. Season with salt and pepper. Cover; let stand until ready to serve.",
        "Meanwhile, mix thyme and bay leaves into remaining tomato broth in pot and bring to boil over medium-high heat. Add fish. Cover and simmer 4 minutes. Add shrimp; cover and simmer until seafood is opaque in center, about 4 minutes. Turn off heat. Add reserved mussels and clams. Cover; let stand 2 minutes.",
        "Mound couscous on platter. Top with seafood. Spoon some tomato broth over to moisten. Sprinkle with parsley. Mix 3/4 cup tomato broth and hot chili paste in small dish. Serve couscous, passing chili mixture and remaining broth separately.",
        "Sambal oelek is available in Asian markets and some supermarkets."
    ],
    "ingredients": [
        "3 tablespoons plus 1/4 cup olive oil",
        "1 large onion, chopped",
        "1 carrot, thinly sliced",
        "1 celery stalk, thinly sliced",
        "4 large garlic cloves, chopped",
        "1 14 1/2-ounce can diced tomatoes in juice",
        "3 8-ounce bottles clam juice",
        "1 1/2 pounds mussels, scrubbed",
        "12 littleneck clams, scrubbed",
        "1 cup dry white wine",
        "3 1/2 cups plain couscous (20 ounces)",
        "1 1/2 teaspoons chopped fresh thyme",
        "3 small bay leaves",
        "2 pounds assorted fish fillets (such as halibut, cod and red snapper), cut into 1 1/2-inch pieces",
        "8 ounces uncooked shrimp, peeled, deveined",
        "Chopped fresh parsley",
        "1/3 cup hot chili paste (such as sambal oelek*)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Sauté",
        "Clam",
        "Mussel",
        "Shrimp",
        "Spring",
        "Couscous"
    ],
    "title": "Spicy Seafood Couscous",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-seafood-couscous-106471"
}
