{
    "directions": [
        "Combine hot pepper sauce, wine, shallot, lemon juice and vinegar in heavy medium saucepan. Boil over medium heat until reduced to 1/2 cup, about 15 minutes. Stir in 1/2 cup cream. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Bring 1/2 cup cream, 5 cups water, milk and butter to simmer in heavy medium saucepan. Gradually whisk in grits. Simmer until grits are very soft and thickened, stirring frequently, about 1 hour.",
        "Meanwhile, heat olive oil in heavy medium skillet over medium heat. Add sausage, both bell peppers, onion and garlic; sauté until vegetables are tender, about 8 minutes. Add shrimp, tomatoes, Cajun seasoning and Old Bay seasoning and sauté until shrimp are opaque in center, about 6 minutes. Season to taste with salt and pepper.",
        "Bring hot pepper-cream sauce to simmer. Spoon grits onto 6 plates, dividing equally. Spoon shrimp mixture over grits. Drizzle hot pepper-cream sauce over and serve.",
        "*Corn grits, also known as polenta, are available at Italian markets, natural foods stores and some supermarkets. If unavailable, substitute 2 cups regular yellow cornmeal, and cook about 30 minutes.",
        "**A smoked pork-and-beef sausage available at specialty foods stores. Smoked bratwurst, kielbasa or smoked Hungarian sausage can be substituted."
    ],
    "ingredients": [
        "1/3 cup green hot pepper sauce",
        "1/4 cup dry white wine",
        "1 shallot, chopped",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon rice vinegar",
        "1 cup whipping cream",
        "5 cups water",
        "3 cups whole milk",
        "1/4 cup (1/2 stick) unsalted butter",
        "2 cups corn grits*",
        "1/4 cup olive oil",
        "8 ounces smoked andouille sausage,** sliced",
        "1 red bell pepper, chopped",
        "1 yellow bell pepper, chopped",
        "1/2 cup minced onion",
        "4 garlic cloves, chopped",
        "30 uncooked large shrimp, peeled, deveined",
        "4 plum tomatoes, chopped",
        "1 teaspoon Cajun seasoning",
        "1 teaspoon Old Bay seasoning"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Shellfish",
        "Mardi Gras",
        "Sausage",
        "Cornmeal",
        "Shrimp",
        "Spice",
        "Bell Pepper",
        "Winter"
    ],
    "title": "Spicy Shrimp with Andouille Sausage on Grits",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-shrimp-with-andouille-sausage-on-grits-103619"
}
