{
    "directions": [
        "In small bowl, whisk together wasabi paste and 3 tablespoons olive oil. Rub wasabi marinade into tuna steaks, then cover with plastic (or place in resealable plastic bag) and refrigerate 30 minutes or up to 2 hours.",
        "Preheat oven to 350°F.",
        "Cut thin slice from stem end of each tomato and set tops aside.",
        "Bring large saucepan water to boil. Add tomato bottoms and boil, uncovered, until warm and starting to soften, about 1 minute. Drain.",
        "Using small spoon, scoop out and discard seeds and pulp from tomatoes. Sprinkle tomato cavities with 1/4 teaspoon salt and 1/4 teaspoon pepper. Set aside.",
        "Slice each pita bread crosswise into 2 round halves and transfer to baking sheet. Bake until crisp and starting to brown, about 10 minutes. Set aside.",
        "In large skillet or wok over moderate heat, heat sesame oil until hot but not smoking. Add ginger, bok choy, carrots, and celery, and sauté, stirring frequently, until vegetables just begin to wilt, about 3 minutes. Stir 1/2 teaspoon salt and 1/4 teaspoon pepper. Stuff hollowed tomatoes with sautéed vegetables and top with reserved tops.",
        "In large skillet over moderate heat, heat 1 tablespoon olive oil until hot but not smoking. Sprinkle tuna steaks on both sides with ½ teaspoon salt and 1/4 teaspoon pepper and sear until crusty and slightly browned but still pink in center, 1 to 2 minutes per side. Transfer to cutting board and slice, against grain, into 1/4-inch-thick slices.",
        "In large bowl, toss arugula with remaining 1 tablespoon olive oil, ½ teaspoon salt, and 1/4 teaspoon pepper.",
        "Divide pita halves among 4 plates and top with arugula. Fan tuna slices atop arugula and place stuffed tomato alongside each \"tart.\" Serve immediately."
    ],
    "ingredients": [
        "2 teaspoons wasabi paste",
        "5 tablespoons extra-virgin olive oil",
        "2 (8-ounce, 1-inch-thick) tuna steaks",
        "4 medium tomatoes",
        "1 3/4 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "2 pita breads, preferably whole-wheat",
        "2 tablespoons Asian (toasted) sesame oil",
        "1 (1-inch) piece fresh ginger, peeled and finely julienned",
        "2 bunches baby bok choy, cut crosswise into 2-inch pieces and julienned",
        "2 large carrots, peeled, cut crosswise into 2-inch pieces, and julienned",
        "2 stalks celery, cut crosswise into 2-inch pieces and julienned",
        "4 cups (loosely packed) baby arugula (about 4 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Tomato",
        "Dinner",
        "Lunch",
        "Wasabi",
        "Tuna",
        "Healthy"
    ],
    "title": "Spicy Tuna \"Tarts\" with Stuffed Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-tuna-tarts-with-stuffed-tomatoes-352830"
}
