{
    "directions": [
        "Fill a large pot with water and bring to a rolling boil; add the corn and boil 15 to 20 minutes. Remove the corn and allow to cool until cool enough to handle. Cut the corn off of the cob and place into a large mixing bowl; set aside.",
        "Place the tomatillos, cilantro, jalapeno, onion, garlic, salt, and 4 teaspoons of lime juice into a blender. Pulse until the vegetables have been finely chopped; set aside. Toss the avocado with 1 teaspoon of lime juice and mix with the corn, cabbage, black beans, and bell pepper.",
        "Preheat an outdoor grill for medium-high heat and lightly oil the grate. Season the chicken breasts with Cajun seasoning.",
        "Cook the chicken breasts on the preheated grill until no longer pink in the center and the juices run clear, about 6 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Set the breasts aside until cool enough to handle; cut into bite sized pieces.",
        "Divide the lettuce leaves onto 4 plates. Mound the avocado mixture on top of the lettuce, followed by the chicken. Sprinkle with cotija cheese and garnish with lime wedges to serve."
    ],
    "ingredients": [
        "2 ears corn",
        "1 pound tomatillos, husked",
        "1/2 bunch fresh cilantro leaves",
        "1/2 jalapeno chile pepper, chopped",
        "1/4 large white onion, chopped",
        "1 clove garlic, chopped",
        "salt, to taste",
        "4 teaspoons lime juice",
        "1 avocado - peeled, pitted and diced",
        "1 teaspoon lime juice",
        "1/4 medium head red cabbage, chopped",
        "1 (14.5 ounce) can black beans, rinsed and drained",
        "1 red bell pepper, chopped",
        "1 pound skinless, boneless chicken breast halves",
        "2 teaspoons Cajun seasoning, or to taste",
        "1 head green leaf lettuce",
        "1 cup crumbled cotija cheese",
        "1 lime, cut into wedges"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Southwest Chopped Salad with Salsa Verde",
    "url": "http://allrecipes.com/recipe/172627/spicy-southwest-chopped-salad-with-sa/"
}
