{
    "directions": [
        "Position rack in middle of oven and preheat to 325°F. Bring cider to a boil in a large saucepan over medium-high heat. Reduce heat to low, add butter, thyme, Aleppo, and 2 tsp. salt, and cook, stirring, until butter is melted. Let cool slightly.",
        "Place potatoes and parsnips in a large bowl. Pour cider mixture over and toss to coat. Stack a handful of slices about 3\" high, then place vertically in casserole dish. Using a measuring cup or small bowl, keep slices standing up as you go, working around the perimeter and then into the center, forming concentric circles. Continue arranging slices in pan until tightly packed (you may have some leftover). Pour in cider mixture to come halfway up sides of dish; discard remaining cider mixture. Sprinkle with remaining 2 tsp. salt and cover tightly with foil.",
        "Bake, covered, 1 hour. Remove foil and brush pan juices over tops of slices with a pastry brush. Increase oven temperature to 425°F and bake, uncovered, until golden brown on top, 35–40 minutes more.",
        "After first round of baking at 325°F, let cool, then chill for up to 2 days. Bring to room temperature, then bake, uncovered, at 425°F for 40–50 minutes."
    ],
    "ingredients": [
        "4 cups apple cider",
        "1/2 cup (1 stick) unsalted butter",
        "2 tablespoons thyme leaves",
        "1 tablespoon plus 2 teaspoons Aleppo pepper",
        "4 teaspoons kosher salt, divided",
        "6 1/2 pounds sweet potatoes (about 8 medium), peeled, sliced into 1/8\"-thick rounds",
        "2 pounds parsnips (about 3 extra-large), peeled, sliced into 1/8\"-thick rounds",
        "A 4-quart casserole dish or braiser, preferably round"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sweet Potato/Yam",
        "Parsnip",
        "Apple",
        "Thyme",
        "Thanksgiving",
        "Fall",
        "Herb",
        "Casserole/Gratin"
    ],
    "title": "Spiced Sweet Potato and Parsnip Tian",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-sweet-potato-and-parsnip-tian"
}
