{
    "directions": [
        "1. Combine the lemongrass, soy sauce, chilies, chili flakes, turmeric, sugar and salt in a bowl. Add the tofu cubes and turn to coat them evenly. Marinate for 30 minutes.",
        "2. Heat half of the oil in a 12-inch nonstick skillet over moderately high heat. Add the onion, shallot and garlic and stir until fragrant, about 1 minute. Reduce the heat to low and cook until the onions are soft, about 3 minutes. Transfer to a plate and keep warm.",
        "3. Wipe the pan clean and heat the remaining oil over moderate heat. Add the tofu mixture and, using chopstick or wooden spoons, turn so it cooks evenly, about 4 to 5 minutes. Add the onion mixture and cook, uncovered, for another 2 to 3 minutes. Add half the peanuts and all the pepper leaves.",
        "4. Remove from the heat and transfer to a serving plate. Garnish with the remaining peanuts and serve immediately with steamed rice."
    ],
    "ingredients": [
        "2 lemongrass stalks, outer layers peeled, bottom white part thinly sliced and finely chopped (about 1/4 cup)",
        "1 1/2 tablespoons soy sauce",
        "2 teaspoons chopped Thai bird chilies or another fresh chili",
        "1/2 teaspoon dried chili flakes",
        "1 teaspoon ground turmeric",
        "2 teaspoons sugar",
        "1/2 teaspoon salt",
        "12 ounces tofu, drained, patted dry and cut into 3/4-inch cubes",
        "4 tablespoons vegetable oil",
        "1/2 yellow onion, cut into 1/8-inch slices",
        "2 shallots, thinly sliced",
        "1 teaspoon minced garlic",
        "4 tablespoons chopped roasted peanuts",
        "10 la lot, or pepper leaves, shredded, or 2/3 cup loosely packed Asian basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Marinate",
        "Stir-Fry",
        "Vegetarian",
        "Lunar New Year",
        "Peanut",
        "Tofu",
        "Hot Pepper",
        "Lemongrass"
    ],
    "title": "Spicy Lemongrass Tofu",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-lemongrass-tofu-233844"
}
