{
    "directions": [
        "Heat 4 tablespoons oil in heavy large skillet over medium-high heat. Add chopped onions and stir to coat. Season with salt. Sauté 20 minutes, stirring occasionally. Reduce heat to medium and cook until onions are very soft, stirring frequently, about 10 minutes. Stir in sugar and cinnamon; sauté until onions are brown, about 5 minutes. (Cinnamon onions can be made 1 day ahead. Cover and refrigerate.)",
        "Coarsely puree quartered onion, lemon juice, cumin, ginger, and paprika in blender. Pour into heavy-duty resealable plastic bag. Add chicken; seal bag and turn to coat. Refrigerate chicken for at least 30 minutes and up to 1 hour.",
        "Heat 2 tablespoons oil in another large skillet over medium heat. Add chicken with marinade; cook until chicken is brown, about 3 minutes per side. Transfer to plate. Add tomatoes with juices and broth to skillet; boil until sauce thickens, about 6 minutes. Return chicken to skillet; spoon sauce over. Reduce heat, cover, and simmer until chicken is cooked through, about 15 minutes. Transfer chicken to plate and tent with foil. Boil sauce until slightly thickened, about 3 minutes. Stir in cilantro. Season to taste with salt and pepper.",
        "Rewarm cinnamon onions. Mound couscous on 4 plates. Top with chicken, sauce, and onions and serve."
    ],
    "ingredients": [
        "6 tablespoons olive oil",
        "6 cups chopped onions",
        "1 1/2 tablespoons (packed) golden brown sugar",
        "2 teaspoons ground cinnamon",
        "1 small onion, quartered",
        "1/4 cup fresh lemon juice",
        "1 teaspoon ground cumin",
        "3/4 teaspoon ground ginger",
        "1/2 teaspoon Hungarian sweet paprika",
        "4 skinless boneless chicken breast halves",
        "1 1/2 cups canned diced tomatoes, undrained",
        "1/2 cup low-salt chicken broth",
        "1/4 cup chopped fresh cilantro",
        "1 10-ounce package couscous, freshly cooked"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Onion",
        "Poultry",
        "Sauté",
        "Winter",
        "Cinnamon",
        "Simmer"
    ],
    "title": "Spiced Chicken Couscous with Cinnamon Onions",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-chicken-couscous-with-cinnamon-onions-107496"
}
