{
    "directions": [
        "Combine 1/4 cup water, cilantro, sliced jalapeño, lime juice and olive oil in blender. Blend until smooth. Season with salt and pepper. Season to taste with salt and pepper. Place chicken in shallow baking dish. Pour marinade over, coating completely. Cover and refrigerate 4 hours.",
        "Preheat broiler. Remove chicken from marinade; discard marinade. Broil chicken until cooked through, about 3 minutes per side. Set chicken aside. Lightly brush both sides of onion and eggplant slices with vegetable oil. Sprinkle both sides with salt and pepper. Broil vegetables until tender and golden, about 2 minutes per side.",
        "Preheat oven to 450°F. Lightly brush 4 tortillas with vegetable oil. Place tortillas, oil side down, on baking sheet. Combine grated Monterey Jack and cheddar cheeses in small bowl. Sprinkle 1/4 cup cheese mixture over each tortilla. Place chicken atop cheese, dividing equally. Place 1 onion slice and 1 eggplant slice atop each. Top each eggplant slice with 1 tortilla. Lightly brush tops of tortillas with oil. (Can be prepared 6 hours ahead. Cover and refrigerate.)",
        "Bake quesadillas until tortillas are slightly crisp and cheese melts, about 10 minutes. Cut quesadillas into quarters. Serve with sour cream."
    ],
    "ingredients": [
        "1/4 cup water",
        "2 tablespoons chopped fresh cilantro",
        "1 jalapeño chili, sliced",
        "1 tablespoon fresh lime juice",
        "1 tablespoon olive oil",
        "8 ounces chicken tenders",
        "4 1/4-inch-thick slices red onion",
        "4 1/4-inch-thick crosswise slices eggplant",
        "Vegetable oil",
        "8 6-inch-diameter flour tortillas",
        "1/2 cup grated Monterey Jack cheese",
        "1/2 cup grated sharp cheddar cheese",
        "Sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Chicken",
        "Onion",
        "Appetizer",
        "Bake",
        "Broil",
        "Cheddar",
        "Eggplant",
        "Chill",
        "Tortillas",
        "Monterey Jack",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spicy Chicken, Eggplant and Red Onion Quesadillas",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-chicken-eggplant-and-red-onion-quesadillas-4263"
}
