{
    "directions": [
        "Preheat broiler. Stir first 3 ingredients in a small dry skillet over medium heat until aromatic and slightly darker in color, about 2 minutes. Let cool; transfer to spice mill. Place chile on a baking sheet and broil, watching closely to prevent burning, just until it begins to puff up, about 1 minute. Cut chile in half; discard seeds and stem. Add chile (or ground chipotle chiles) to spice mill with toasted seeds; finely grind together.",
        "Meanwhile, place potato in a small saucepan; add cold water to cover. Bring to a boil; reduce heat and simmer until just cooked through, about 10 minutes. Finely grate potato into a large bowl.",
        "Add chile mixture, ground lamb, and next 4 ingredients to bowl; mix with your hands until well combined. Form mixture into tablespoon-size (1\"-diameter) meatballs.",
        "Heat oil in a large nonstick skillet over medium heat. Cook meatballs, turning occasionally, until golden all over but still pink in center, about 6 minutes (meatballs will finish cooking on pizza)."
    ],
    "ingredients": [
        "1/2 teaspoon caraway seeds",
        "1/2 teaspoon coriander seeds",
        "1/2 teaspoon cumin seeds",
        "1 whole 2\" dried chipotle chile or 2 teaspoons ground chipotle chiles",
        "1 small (2 1/2\"-3\"-diameter) potato, peeled",
        "1 pound ground lamb",
        "1 tablespoon (heaping) minced scallion (white part only)",
        "1 1/2 teaspoons finely grated Pecorino",
        "1 teaspoon kosher salt",
        "1/2 teaspoon finely grated peeled ginger",
        "2 tablespoons extra-virgin olive oil",
        "Ingredient info: Chipotle chiles (dried, smoked jalapeños) are available at specialty foods stores and Latin markets.",
        "Special equipment: A spice mill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Side",
        "Dinner",
        "Meat",
        "Ground Lamb",
        "Spice",
        "Winter",
        "Pan-Fry",
        "Chile Pepper",
        "Sugar Conscious",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Spiced Lamb Meatballs",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-lamb-meatballs-394714"
}
