{
    "directions": [
        "To make the noodles, dust a baking sheet with bread flour; set aside. Bring a large pot two-thirds full of water to a boil.",
        "In a bowl, whisk together the 2 cups (10 oz./315 g) bread flour, salt and baking soda. Place in the hopper of the Philips pasta maker fitted with the spaghetti noodle die. Turn the machine on automatic 500 gram mode and slowly add the water into the liquid feeding slot on top of the lid. Once the dough has stopped mixing and has started extruding, use the included pasta cutter to cut the noodles into 12-inch (30-cm) lengths, transferring the noodles to the prepared baking sheet as they are cut.",
        "Transfer the noodles to the boiling water and cook, stirring occasionally, until the noodles are not quite al dente, 2 1/2 to 3 minutes. Drain the noodles, rinse under cold running water and drain again. Transfer the noodles to a bowl, add the oil and toss to coat the noodles with the oil to prevent them from sticking to each other. Set aside.",
        "In a small bowl, whisk together the lime juice, honey, fish sauce and chili paste until thoroughly combined and the honey is dissolved. Set aside.",
        "In a large fry pan over medium-high heat, warm the canola oil. Add the garlic, lemongrass and chile and sauté until fragrant, about 30 seconds. Add the ground beef and cook, stirring occasionally and breaking up any lumps with the back of a wooden spoon, until browned, about 6 minutes. Stir in the red onion and the lime juice mixture. Add the noodles and cook, tossing, until the ingredients are combined and the noodles are just heated through, 1 to 2 minutes. Garnish with the cilantro, basil and green onions and serve immediately. Serves 6.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "2 cups (10 oz./315 g) bread flour, plus more for dusting",
        "3/4 tsp. table salt",
        "1 tsp. baking soda",
        "1/2 cup (4 fl. oz./125 ml) water",
        "1 Tbs. canola oil",
        "1/3 cup (3 fl. oz./80 ml) plus 2 Tbs. lime juice",
        "3 Tbs. honey",
        "3 Tbs. fish sauce",
        "2 1/2 tsp. Asian chili paste",
        "2 Tbs. canola oil",
        "1 1/2 tsp. minced garlic",
        "2 tsp. minced lemongrass, tender white portion only",
        "1 Thai or serrano chile, seeded and minced",
        "1 1/2 lb. (750 g) ground beef",
        "1/2 red onion, thinly sliced",
        "Fresh cilantro leaves for garnish",
        "Fresh basil leaves for garnish",
        "Chopped green onions, white and light green portions, for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Spicy Beef with Noodles",
    "url": "http://www.williams-sonoma.com/recipe/spicy-beef-with-noodles.html"
}
