{
    "directions": [
        "Blend flour, sugar and salt in processor. Add butter and lard; cut in using on/off turns until fat is reduced to pea-size pieces, about 25 turns. Using on/off turns, blend in 3/4 cup buttermilk until dough just comes together in moist clumps, adding more buttermilk if dough is dry. Gather dough into ball. Divide into 2 pieces, 1 slightly larger than the other. Flatten each into disk. Wrap disks in plastic; chill at least 1 hour or overnight.",
        "Mix 3/4 cup sugar and next 4 ingredients in large bowl. Cook peaches in pot of boiling water 30 seconds. Transfer to bowl of cold water; cool. Peel, halve and pit peaches. Slice peaches into bowl with sugar mixture; toss to coat. Let filling stand until juices form, stirring often, about 20 minutes.",
        "Place 1 rack in center and 1 rack at lowest position in oven; preheat to 400°F. Roll out larger dough disk on floured surface to 12- to 13-inch round. Transfer dough to 9-inch-diameter glass pie dish. Trim overhang to 3/4 inch. Mound filling in dish; dot with butter. Roll out second disk on floured surface to 12-inch round. Gently roll up dough onto rolling pin; drape dough over filling. Pinch overhang and edge of top crust together. Fold edge under. Cut several slits in top crust. Crimp edge. Brush pie with beaten egg; sprinkle with 1 tablespoon sugar.",
        "Place pie on center rack in oven. Bake 50 minutes. Place baking sheet on lowest rack to catch drippings. Continue to bake pie until crust is brown and juices bubble thickly through slits, covering very loosely with foil if top browns too quickly, about 20 minutes. Cool on rack 1 hour. Serve warm or at room temperature."
    ],
    "ingredients": [
        "2 1/2 cups all purpose flour",
        "5 teaspoons sugar",
        "1/2 teaspoon salt",
        "6 tablespoons chilled unsalted butter, cut into 1/2-inch pieces",
        "1/4 cup frozen lard or solid vegetable shortening, cut into 1/2-inch pieces",
        "3/4 cup plus 2 tablespoons (about) chilled buttermilk",
        "3/4 cup plus 1 tablespoon sugar",
        "1/4 cup all purpose flour",
        "1 1/2 teaspoons fresh lemon juice",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground cardamom",
        "3 3/4 to 4 pounds ripe peaches",
        "2 tablespoons unsalted butter, cut into small pieces",
        "1 egg, beaten to blend (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fruit",
        "Dessert",
        "Bake",
        "Picnic",
        "Peach",
        "Summer",
        "Potluck",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spiced Peach Pie with Buttermilk Crust",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-peach-pie-with-buttermilk-crust-101947"
}
