{
    "directions": [
        "For the noodles: Bring a pot of water to a boil. Cook the spaghetti in the boiling water according to the package instructions. Drain, then drizzle with some sesame oil and a little soy sauce in a large bowl and toss.",
        "For the stir-fry: While the noodles are cooking, mix together the soy sauce, sherry, brown sugar, cornstarch, sriracha and ginger in a bowl. Set aside.",
        "Heat the peanut oil in a large skillet over medium-high heat. Add the onion and bell peppers and cook, stirring, for 2 to 3 minutes. Add the garlic and cook for 30 seconds to 1 minute more, stirring continuously. Add the zucchini and stir it around, cooking it for 2 minutes more. Add the baby corn and broccoli and cook for a couple of minutes.",
        "While the veggies are still firm, pour in the sauce. Stir the veggies in the sauce and cook until the sauce is very thick, 1 to 2 minutes more. If it needs to be a little saucier, pour in 1/4 to 1/2 cup hot water and splash in a little more soy sauce.",
        "Serve the stir-fry over the noodles with a sprinkling of sesame seeds and some slice green onions."
    ],
    "ingredients": [
        "1 pound thin spaghetti",
        "Sesame oil, for drizzling",
        "Low-sodium soy sauce, for drizzling",
        "1/2 cup low-sodium soy sauce, plus more if needed",
        "2 tablespoons sherry or low-sodium vegetable broth",
        "2 tablespoons packed brown sugar",
        "2 tablespoons cornstarch",
        "2 tablespoons sriracha (more or less to taste)",
        "1 tablespoon minced fresh ginger",
        "3 tablespoons peanut oil",
        "1 yellow onion, cut into large chunks",
        "1 red bell pepper, cut into large chunks",
        "1 yellow bell pepper, cut into large chunks",
        "2 cloves garlic, minced",
        "2 medium zucchini, cut into large wedges",
        "One 15-ounce can baby corn, drained, corn halved crosswise",
        "1 head broccoli, cut into florets",
        "Sesame seeds, for serving",
        "2 green onions, sliced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Noodles",
        "Vegetable",
        "Main Dish Recipes",
        "Stir-Frying Recipes"
    ],
    "title": "Spicy Veggie Stir-Fry",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/spicy-veggie-stir-fry"
}
