{
    "directions": [
        "Prepare barbecue (medium heat). Whisk sour cream and chipotle chiles in small bowl; season with salt. Whisk brown sugar and next 5 ingredients in another small bowl to blend for spice rub.",
        "Place zucchini and bell pepper on rimmed baking sheet. Drizzle with canola oil; toss to coat. Sprinkle spice rub over both sides of vegetables and chicken.",
        "Place chicken and vegetables on barbecue. Grill until vegetables are tender and browned in spots and chicken is cooked through, turning occasionally, about 5 minutes. Transfer to work surface; cut chicken crosswise into 1/2-inch-thick strips. Cut vegetables crosswise into 3/4-inch pieces. Place chicken and vegetables in large bowl; toss to blend.",
        "Place chicken and vegetables, chipotle cream, tortillas, slaw, and lime wedges on table. Allow guests to assemble their own soft tacos.",
        "*Chipotle chiles canned in a spicy tomato sauce, which is sometimes called adobo, are available at some supermarkets, at Latin markets, and at specialty foods stores.",
        "**Available at specialty foods stores and from tienda.com."
    ],
    "ingredients": [
        "1 1/2 cups sour cream",
        "1 tablespoon chopped canned chipotle chiles* (about 2)",
        "2 tablespoons (packed) golden brown sugar",
        "1 tablespoon smoked hot Spanish paprika (Pimentón de la Vera)**",
        "2 1/4 teaspoons chili powder",
        "1 1/2 teaspoons coarse kosher salt",
        "1 1/2 teaspoons garlic powder",
        "1 1/2 teaspoons onion powder",
        "2 small zucchini, quartered lengthwise",
        "1 red bell pepper, seeded, cut lengthwise into 3/4-inch-thick strips",
        "2 tablespoons canola oil",
        "1 pound skinless boneless chicken breast halves, each halved horizontally",
        "12 5- to 6-inch-diameter corn tortillas, warmed",
        "Cilantro Slaw",
        "2 limes, each cut into 6 wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Quick & Easy",
        "High Fiber",
        "Lime",
        "Hot Pepper",
        "Zucchini",
        "Summer",
        "Grill/Barbecue",
        "Sour Cream",
        "Tortillas"
    ],
    "title": "Spice-Rubbed Chicken and Vegetable Tacos with Cilantro Slaw and Chipotle Cream",
    "url": "http://www.epicurious.com/recipes/food/views/spice-rubbed-chicken-and-vegetable-tacos-with-cilantro-slaw-and-chipotle-cream-235158"
}
