{
    "directions": [
        "Mix 2 cups water (or amount needed to cover the zucchini) and pickling lime together in a nonreactive bowl. Place the zucchini slices in a large (at least 1-gallon) glass jar or large crock, and pour the lime mixture over the zucchini. The solution should completely cover the zucchini. Cover the jar with plastic wrap, and allow to stand for 24 hours. Drain the zucchini slices in a colander in the sink; thoroughly wash the glass jar. Rinse the zucchini slices very well under running water to rinse away all the lime, and place the slices back into the jar. Cover with fresh cool water, allow to stand for 2 to 3 hours, and drain away the water. Rinse again.",
        "Place the zucchini slices into a large pot, and stir in 1 cup vinegar, the alum, food coloring, and 2 more cups water (or enough water to cover the zucchini slices). Bring to a boil over medium heat, reduce heat to low, and simmer the zucchini slices for 2 hours. Drain the zucchini slices, and discard the liquid.",
        "Place the zucchini slices back into the glass jar. Mix together 1 cup of vinegar, 3 more cups of water, the sugar, cinnamon sticks, and red hot candies in a saucepan over medium heat. Bring to a boil, and stir until the sugar and candies dissolve. Pour the syrup over the zucchini slices. Allow the zucchini to stand covered for 24 hours. Drain, and reserve the syrup. Bring the syrup to a full rolling boil in a saucepan over medium heat.",
        "Sterilize the canning jars and lids in boiling water for at least 5 minutes. Pack the zucchini slices into the hot, sterilized jars, and pour the hot syrup into the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 20 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/250x250/651428.jpg",
    "ingredients": [
        "2 cups water, or amount to cover",
        "1 cup pickling lime (calcium hydroxide)",
        "4 cups zucchini, sliced",
        "1 cup distilled white vinegar",
        "3/4 teaspoon alum",
        "1 fluid ounce bottle of red food coloring",
        "2 cups water, or amount to cover",
        "1 cup distilled white vinegar",
        "3 cups water, or amount to cover",
        "5 cups white sugar",
        "4 cinnamon sticks",
        "1/2 cup cinnamon red hot candies",
        "8 half-pint canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Mock Apple Rings",
    "url": "http://allrecipes.com/recipe/215521/spicy-mock-apple-rings/"
}