{
    "directions": [
        "Wash the prawns, remove the heads, shells, and black veins, and retain the heads. Set the cleaned prawns aside.  Place the prawn heads in a large saucepan or soup pot with the water, bring to a boil, and boil over high heat to reduce the stock and concentrate the flavor, about 15 minutes. Strain out the prawn heads and discard.",
        "Heat the vegetable oil in a large skillet over medium heat; cook and stir the garlic, lemon grass, lime leaves, shallots, galangal, and red chilies until the shallots are translucent and the seasonings are fragrant, about 3 minutes. Stir in the chili paste, cook and stir for 1 minute, and add the chicken breast and lime juice. Stir well to evenly mix in the chili paste, and let the mixture simmer for 5 minutes. Pour the seasoned chicken-lime juice mixture into the prawn stock, and bring to a boil over medium-low heat.",
        "When the soup begins to boil, stir in the squid rings, baby corn, straw mushrooms, cleaned prawns, and tomatoes. Turn the heat to low, stir in the coconut milk, and let the soup simmer until the prawns are pink and opaque, about 5 minutes. Add salt to taste, and serve."
    ],
    "ingredients": [
        "2 pounds tiger prawns with heads and shells",
        "4 cups water",
        "2 tablespoons vegetable oil",
        "1 tablespoon minced garlic",
        "2 stalks fresh lemon grass, tough outer leaves removed and and white part slightly crushed",
        "5 lime leaves",
        "5 shallots, thinly sliced",
        "5 slices galangal",
        "10 chile padi (bird's eye chiles), thinly sliced",
        "1 tablespoon Asian red chili paste",
        "1 skinless, boneless chicken breast half - cut into cubes",
        "1/4 cup lime juice",
        "2 large squid, cleaned and sliced into rings",
        "1/2 (15 ounce) can baby corn, drained",
        "1/2 (6 ounce) can whole straw mushrooms, drained",
        "3 fresh tomatoes, quartered",
        "1/2 cup coconut milk",
        "salt to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Devil's Tom Yum Soup",
    "url": "http://allrecipes.com/recipe/70363/spicy-devils-tom-yum-soup/"
}
