{
    "directions": [
        "Preheat oven to 300°F.",
        "Wrap blacan tightly in a piece of foil and roast in middle of oven 10 minutes. Unwrap and cool. Discard tough outer leaves of lemongrass and trim root ends. Thinly slice lower 6 inches of stalks. Fold upper stalks into thirds and tie into a bundle with kitchen string. In 2 batches, purée blacan, sliced lemongrass, and remaining spice paste ingredients in a mini food processor until almost smooth.",
        "Soak bean-curd puffs in hot water in a bowl, weighted with another bowl of water to keep puffs immersed, 20 minutes. Squeeze as much water as possible from puffs and halve diagonally. While puffs soak, simmer chicken in stock in a saucepan, turning occasionally, until just cooked through, 12 to 15 minutes, and cool chicken in a bowl. Pour stock through a fine sieve into another bowl. Discard chicken skin and bones and shred or slice chicken. Blanch bean sprouts in a pot of boiling water 15 seconds and drain well.",
        "Heat oil in a 6- to 7-quart heavy pot over moderate heat until hot but not smoking and stir in spice paste. (Oil should be hot enough for spice paste to sizzle when added.) Cook, stirring constantly, until spice paste begins to stick to bottom of pot, 8 to 10 minutes. (Oil will separate out, and mixture will appear curdled. Paste will reduce and turn a shade darker; do not let brown.) Add coconut milk, sugar, stock, and lemongrass bundle and bring to a simmer, stirring. Stir in puffs and gently simmer 20 minutes. Stir in shrimp and simmer until just cooked through, 1 to 2 minutes. Stir in chicken and salt to taste.",
        "While laksa simmers, bring a large pot of water to a boil for noodles. If using fresh noodles, cook 1 minute and drain well, rinsing briefly under water if sticking occurs. If using dried noodles, cook according to package directions. Divide noodles, bean sprouts, shrimp, chicken, and puffs among 4 deep bowls and ladle laksa broth over."
    ],
    "ingredients": [
        "11/2 teaspoons blacan (shrimp paste)",
        "2 thick or 3 thin stalks fresh lemongrass",
        "11/2 tablespoons chopped peeled fresh or frozen galangal",
        "1 tablespoon chopped peeled fresh ginger",
        "1 tablespoon chopped peeled fresh or frozen turmeric or 1 teaspoon turmeric powder",
        "1 medium onion, chopped",
        "6 fresh hot red chiles (such as Thai or serrano), seeded if desired and chopped",
        "2 garlic cloves, chopped",
        "5 candlenuts (do not eat raw) or macadamia nuts, chopped",
        "2 tablespoons water",
        "6 fried bean-curd puffs",
        "2 chicken breast halves with skin and bones",
        "31/2 cups chicken stock (preferably homemade)",
        "6 oz fresh bean sprouts (21/2 cups), threadlike tails discarded",
        "1/2 cup olive or vegetable oil",
        "14-oz can well-shaken unsweetened coconut milk",
        "1 tablespoon sugar",
        "1/2 lb medium shrimp, shelled and deveined",
        "1 lb fresh round (not flat) rice noodles or wheat noodles or 1/2 lb dried egg noodles",
        "Garnish: fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Garlic",
        "Ginger",
        "Pepper",
        "Breakfast",
        "Coconut",
        "Shrimp",
        "Spring",
        "Lemongrass",
        "Gourmet",
        "Dairy Free",
        "Peanut Free"
    ],
    "title": "Spicy Noodle Soup",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-noodle-soup-103188"
}
