{
    "directions": [
        "Preheat broiler. Line baking sheet with heavy-duty foil. Place tomatoes close together on prepared sheet. Broil close to heat source until blackened in spots, turning once with tongs, about 2 minutes per side. Transfer tomatoes to plate and cool. Place onion halves close together on same sheet. Broil until surfaces are charred, turning once with tongs, about 4 minutes per side. Set aside and cool.",
        "Heat cast-iron skillet over medium-high heat 2 minutes. Using tongs, place cinnamon strip, peppercorns, garlic cloves, and jalapeño chili in hot skillet, preferably cast iron. Toast until fragrant and charred, turning and stirring occasionally, about 2 minutes for cinnamon and peppercorns and 8 minutes for garlic and jalapeño. Transfer all to plate. Place tortilla halves in same hot skillet. Toast until browned in spots and crisp, pressing often with spatula, about 3 minutes per side. Transfer tortillas to plate; cool, then break into very small pieces.",
        "After the charred tomatoes have cooled, peel, halve crosswise, and spoon out the seeds. Cut away most of charred surface from broiled onions and then chop. Peel garlic cloves. Stem, quarter, seed and devein jalapeño chili. Place tomatoes, onions, garlic, jalapeño chili, and chipotle chilies in processor. Finely grind cinnamon, peppercorns, and toasted tortillas in spice mill or coffee grinder; add to processor. Blend soup base until smooth, about 5 minutes.",
        "Heat oil in heavy large pot over medium-high heat 2 minutes. Add soup base from processor, oregano, and cumin. Cook (sear) until base thickens enough to leave path when spoon is drawn through, stirring occasionally, about 10 minutes. Add 5 cups water, squash, potatoes, and 1 teaspoon salt; bring soup to boil. Reduce heat to medium, cover, and simmer until vegetables are almost tender, about 15 minutes. Add garbanzo beans with liquid, green beans, and corn. Cover; simmer until all vegetables are tender, about 5 minutes longer. Mix in cilantro; season with pepper and more salt, if desired.",
        "Toast tortillas directly over gas flame or electric burner until browned in spots but still soft, about 40 seconds per side. Wrap in foil; keep warm.",
        "Ladle soup into bowls. Serve with lime wedges and warm tortillas.",
        "Chipotle chilies canned in a spicy tomato sauce, sometimes called adobo, are sold at Latin American markets, specialty foods stores and some supermarkets."
    ],
    "ingredients": [
        "2 pounds large plum tomatoes (about 10)",
        "2 medium onions (about 14 ounces), peeled, halved",
        "1 1/2x3-inch strip from Mexican cinnamon stick or 1 1/2-inch piece regular cinnamon stick",
        "6 whole black peppercorns",
        "4 large garlic cloves, unpeeled",
        "1 large jalapeño chili",
        "2 5 1/2-inch corn tortillas, cut in half",
        "2 teaspoons chopped canned chipotle chilies*",
        "3 tablespoons olive oil",
        "1 1/4 teaspoons dried oregano",
        "1 teaspoon ground cumin",
        "5 cups water",
        "1 1 1/2-pound butternut squash, peeled, halved, seeded, cut into 1/2- to 3/4-inch cubes",
        "3/4 pound red-skinned potatoes, peeled, cut into 1/2- to 3/4-inch cubes",
        "1 teaspoon (or more) salt",
        "1 15- to 16-ounce can garbanzo beans (chickpeas), undrained",
        "1/4 pound green beans, trimmed, cut into 1-inch pieces",
        "1 cup corn kernels, cut from 1 large ear (step 3) or frozen",
        "1/3 cup (packed) chopped fresh cilantro",
        "Additional 5 1/2-inch corn tortillas",
        "Lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Tomato",
        "Vegetable",
        "Broil",
        "Vegetarian",
        "Spring",
        "Jalapeño",
        "Tortillas"
    ],
    "title": "Spicy Roasted Vegetable Soup with Toasted Tortillas",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-roasted-vegetable-soup-with-toasted-tortillas-106297"
}
