{
    "directions": [
        "Peel pears. Using a 1/2 tsp. measuring spoon or small melon baller, scoop upward from bottom of pears 1 1/2–2\" to remove core and seeds; discard. Combine pears, wine, brown sugar, butter, cinnamon, vanilla, and 3 cups water in a large, heavy pot. Cut a round of parchment to fit just inside pot and cover pears.",
        "Bring to a boil, then reduce heat and simmer, turning pears occasionally to coat with liquid, until pears are very tender but not falling apart, 20–25 minutes. Using a slotted spoon, transfer pears to a large bowl and cover with parchment round.",
        "Bring poaching liquid to a boil, then cook over medium heat until reduced to the consistency of thick syrup, 12–15 minutes (you should have 1/2 cup). Transfer 5 pears to a medium bowl, reserving remaining pears for cake, and pour syrup over. Cover with parchment and let cool, or chill overnight.",
        "Preheat oven to 350°F. Grease cake pan with butter and line bottom with parchment paper.",
        "Toast hazelnuts on a rimmed baking sheet, tossing occasionally, until golden brown, 6–8 minutes.",
        "Meanwhile, mix flour, baking powder, baking soda, cinnamon,  cloves, nutmeg, and salt in a medium bowl.",
        "Pulse 1/2 cup dry ingredients and 3/4 cup hazelnuts in a food processor until hazelnuts are chopped into a fine flour; reserve remaining hazelnuts. Transfer chopped hazelnuts to bowl with dry ingredients.",
        "Wipe out food processor bowl and add 5 poached pears. Pulse until smooth. Transfer 2 cups to a small bowl; discard leftover purée.",
        "Beat brown sugar, granulated sugar, vanilla, and 3/4 cup butter on medium-high speed in a stand mixer fitted with the paddle attachment until light and fluffy, 3–5 minutes. Scrape down bowl and add eggs, one at a time, beating well after each addition.",
        "Add half of pear purée and beat on low speed. Add half of flour mixture and beat on low to incorporate. Beat in remaining pear purée and flour mixture until combined. Pour into prepared pan; smooth top. Set pan on a rimmed baking sheet and bake cake, rotating sheet halfway through, until center is set and a tester inserted into the center comes out clean, about 1 hour, 15 minutes. Transfer pan to a wire rack and let cool.",
        "Turn chilled pears in liquid to coat, then transfer liquid (about 1/2 cup) to a small saucepan. Add chocolate and 3/4 cup cream and cook over medium-low heat, stirring, just until chocolate is melted. Whisk to combine, then transfer to a medium bowl. Chill, stirring occasionally so chocolate doesn't set, until room temperature, about 10 minutes.",
        "Remove cake from pan, trim top with a serrated knife if domed, and invert onto a 12\" platter. Remove parchment. Using a toothpick, poke holes all over top of cake. Using a pastry brush, brush top with 1/4 cup chocolate sauce.",
        "Meanwhile, coarsely chop remaining 1/4 cup toasted hazelnuts. Whip remaining 3/4 cup cream to medium-soft peaks in stand mixer fitted with the whisk attachment.",
        "Top cake with whipped cream, pears, and hazelnuts. Drizzle chocolate sauce over pears. Serve remaining chocolate sauce alongside.",
        "Cake and pears can be made 2 days ahead; cover in separate containers and chill."
    ],
    "ingredients": [
        "10 ripe but firm Bosc pears (about 3 3/4 pounds)",
        "2 cups dry white wine",
        "1/2 cup light brown sugar",
        "2 tablespoons unsalted butter, cubed",
        "1 teaspoon ground cinnamon",
        "1 teaspoon vanilla extract",
        "3/4 cup (1 1/2 sticks) butter, softened, plus more for pan",
        "1 cup blanched hazelnuts",
        "2 3/4 cups all-purpose flour",
        "2 1/4 teaspoons baking powder",
        "1 1/2 teaspoons baking soda",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon kosher salt",
        "1 1/4 cups light brown sugar",
        "1/3 cup granulated sugar",
        "3/4 teaspoon vanilla extract",
        "3 large eggs",
        "3 ounces dark chocolate, coarsely chopped",
        "1 1/2 cups heavy cream, divided",
        "A 9\" cake pan (preferably springform)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Christmas",
        "Pear",
        "Cake",
        "Hazelnut",
        "Chocolate",
        "Spice",
        "Cinnamon",
        "Wine",
        "Bake",
        "Christmas Eve",
        "Winter"
    ],
    "title": "Spiced Hazelnut-Pear Cake With Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-hazelnut-pear-cake-with-chocolate-sauce"
}
