{
    "directions": [
        "Toast first 4 ingredients in medium skillet over medium heat until fragrant, about 2 minutes. Transfer to mortar or spice grinder; grind to coarse powder. Transfer to small bowl; stir in salt. Arrange duck legs on rimmed baking sheet; sprinkle spice mixture over all sides. Refrigerate uncovered overnight.",
        "Preheat oven to 300°F. Pat duck gently to remove moisture, removing as little spice mixture as possible. Heat heavy large skillet over medium-high heat. Working in batches, cook duck, skin side down, until skin is crisp and brown, about 7 minutes. Turn duck legs and cook until brown, about 3 minutes longer, draining fat from skillet between batches. Transfer duck legs to roasting pan, skin side up. Pour fat from skillet. Remove skillet from heat; add brandy. Bring to boil over medium-high heat, scraping up browned bits. Add wine. Boil until liquid is reduced by half, about 3 minutes. Add broth; bring to boil. Pour mixture over duck in pan. Tuck onion wedges, garlic cloves, lemon peel, and bay leaves between duck legs. Scatter carrots and olives over. Cover with foil. Braise duck in oven 1 hour. Turn legs over; allow vegetables to fall into broth. Cover; braise until duck is tender and meat is falling from bones, about 1 hour longer. DO AHEAD Can be made 1 day ahead. Cool slightly. Cover and chill. Rewarm in 350°F oven 20 minutes.",
        "Preheat broiler. Transfer 6 duck legs, skin-side up, to rimmed baking sheet. Tent with foil (cover and chill remaining 4 legs for leftovers). Transfer vegetables and olives from sauce to bowl; cover to keep warm. Spoon fat from sauce in roasting pan. Transfer remaining sauce to large skillet. Simmer sauce over medium-high heat until reduced to 1 cup, about 10 minutes. Season with salt and pepper, and honey, if desired. Keep warm.",
        "Meanwhile, place duck legs under broiler until skin is crisp, about 4 minutes, watching carefully to prevent burning. Transfer to serving platter, spoon vegetable mixture around duck legs, drizzle sauce over, and serve."
    ],
    "ingredients": [
        "1 tablespoon coriander seeds",
        "1 teaspoon fennel seeds",
        "1 teaspoon cumin seeds",
        "1/2 teaspoon whole black peppercorns",
        "4 teaspoons coarse kosher salt",
        "10 whole duck leg-thigh pieces (about 7 3/4 pounds), trimmed of excess skin and fat",
        "1/4 cup brandy",
        "1 cup dry white wine",
        "1 1/2 cups low-salt chicken broth",
        "2 medium onions, halved, cut into 1/2-inch thick wedges",
        "6 garlic cloves, peeled",
        "3 (3x1/2-inch) strips lemon peel (yellow part only)",
        "2 bay leaves",
        "3 carrots, peeled, halved lengthwise, cut crosswise into 1-inch pieces",
        "1 cup picholine* or other brine-cured green olives",
        "2 teaspoons honey (optional)",
        "*A medium-size, firm brine-cured green olive; can be found at the deli counter of some supermarkets and at specialty foods stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Garlic",
        "Olive",
        "Onion",
        "Braise",
        "Broil",
        "Dinner",
        "Spice",
        "Brandy",
        "Carrot",
        "White Wine",
        "Winter",
        "Coriander",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spice-Rubbed Duck Legs Braised with Green Olives and Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/spice-rubbed-duck-legs-braised-with-green-olives-and-carrots-237063"
}
