{
    "directions": [
        "Stir cumin seeds, coriander seeds, and black peppercorns in small dry skillet over medium heat until aromatic, about 2 minutes. Finely grind spice mixture in spice grinder or mini processor. Mix ground spices, shallot, olive oil, salt, and garlic in small bowl until paste forms. Rub pork on all sides with spice paste. Cover and chill at least 3 hours or overnight.",
        "Tear 4 corn husks lengthwise into strips 1/2 to 3/4 inch wide. Place 1 pork tenderloin log in center of each remaining corn husk. Wrap corn husks around pork and tie center and ends of each with corn husk strips as for tamales, enclosing pork completely. Place pork bundles on rack on baking sheet. (Can be prepared 1 day ahead. Cover with damp kitchen towel, then foil, and refrigerate.)",
        "Preheat oven to 350°F. Bake pork bundles uncovered until instant-read thermometer inserted into thickest part of each piece registers 150°F, 35 to 45 minutes, depending on thickness of pork.",
        "Place 1 pork bundle on each of 8 plates. Remove husk strip from 1 end of each; fold corn husk back slightly, exposing some of meat. Spoon Cranberry-Avocado Salsa alongside and serve."
    ],
    "ingredients": [
        "2 teaspoons cumin seeds",
        "2 teaspoons coriander seeds",
        "2 teaspoons whole black peppercorns",
        "1 large shallot, minced",
        "2 tablespoons olive oil",
        "1 teaspoon salt",
        "1 garlic clove, minced",
        "3 1/2 pounds pork tenderloins, trimmed, cut crosswise into 8 equal logs",
        "12 dried corn husks, soaked in warm water 1 hour, drained, patted dry",
        "Cranberry-Avocado Salsa"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Bake",
        "Christmas",
        "Pork Tenderloin",
        "Winter",
        "Coriander"
    ],
    "title": "Spice-Rubbed Pork Tenderloins in Corn Husks with Cranberry-Avocado Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/spice-rubbed-pork-tenderloins-in-corn-husks-with-cranberry-avocado-salsa-107490"
}
