{
    "directions": [
        "Place beans in large saucepan. Add enough water to cover by 2 inches. Let beans soak overnight.",
        "Drain beans. Return to saucepan. Add onion halves, bay leaf, and oregano. Add enough cold water to cover by 2 inches. Bring to boil, reduce heat to low, and simmer uncovered until beans are very tender, stirring occasionally, 1 1/2 to 2 hours (depending on age of beans). Drain beans, reserving cooking liquid. Discard onion halves and bay leaf.",
        "Heat oil in heavy large deep nonstick skillet over medium heat. Add chorizo and cook until brown, breaking up with back of spoon, 4 to 5 minutes. Using slotted spoon, transfer chorizo to small bowl. Add chopped onion to drippings in skillet. Cook until soft and golden brown, stirring often, about 10 minutes. Add 2 tablespoons cilantro, garlic, jalapeño, and cumin; stir 1 minute. Add beans, 3/4 cup reserved cooking liquid, and chorizo to onion mixture. Stir to distribute evenly. Simmer over medium-low heat until heated through and flavors are blended, 3 to 4 minutes. Season to taste with salt and pepper.DO AHEAD: Can be made 1 day ahead. Chill uncovered until cool, then cover and keep chilled. Rewarm over medium heat before serving.",
        "Whisk all ingredients in small bowl to blend. Season to taste with salt. DO AHEAD: Can be made 1 day ahead. Cover and chill. Rewhisk before serving.",
        "Transfer beans to large bowl. Garnish with chipotle cream and chopped cilantro."
    ],
    "ingredients": [
        "1 1/2 cups dried black beans (about 10 ounces)",
        "2 peeled onions; 1 halved, 1 chopped (about 2 cups)",
        "1 bay leaf",
        "1 teaspoon dried oregano (preferably Mexican)",
        "2 tablespoons olive oil",
        "2 links fresh chorizo sausage (6 to 7 ounces casings removed)",
        "2 tablespoons finely chopped fresh cilantro plus additional for garnish",
        "2 garlic cloves, minced",
        "2 teaspoons minced seeded jalape&entilde;o chile",
        "1/2 teaspoon ground cumin",
        "1/2 cup sour cream",
        "1 1/4 teaspoons chipotle-flavored hot pepper sauce",
        "1 teaspoon fresh lime juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Bean",
        "Side",
        "Cinco de Mayo",
        "Dinner",
        "Sausage",
        "Party",
        "Potluck",
        "Simmer",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Spicy Black Beans with Chorizo and Chipotle Cream",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-black-beans-with-chorizo-and-chipotle-cream-353420"
}
