{
    "directions": [
        "In a 7- to 8-gallon kettle bring 5 gallons water to a boil.",
        "While water is coming to a boil, in a deep sink rinse crabs in 2 or 3 changes of water. (Do not fill sink too full or crabs may crawl out.)",
        "Add Zatarain's crab boil or 5 tablespoons Old Bay seasoning, cayenne, salt, lemons, and onions to boiling water and boil 5 minutes. Add potatoes and garlic and boil until tender, about 15 minutes. Transfer potatoes and garlic with a large sieve to a large platter and keep warm, covered with foil. Add corn to boiling water and cook until tender, about 5 minutes. Transfer corn with tongs to platter and keep warm, covered with foil.",
        "Return water to a boil. Transfer about 6 crabs carefully with long tongs to sieve, holding them down in sieve with tongs, and turn crabs out into boiling water. Add remaining crabs in same manner. Return water to a boil and cook crabs until just cooked through, about 10 minutes. (To determine doneness, remove a claw and crack it with the handle of a dinner knife. Use Knife to extract meat from claw.) Transfer crabs with sieve to another large platter and sprinkle with 1 tablespoon Old Bay seasoning.",
        "Return water to boil and cook shrimp until just cooked through, about 2 minutes. Transfer shrimp with sieve to large platter with crabs and sprinkle with remaining tablespoon Old Bay seasoning.",
        "Serve crabs, shrimp, and vegetables with horseradish cocktail sauce and French bread."
    ],
    "ingredients": [
        "24 live blue crabs",
        "two 3-ounce packets Zatarain's crab boil or 5 tablespoons Old Bay  seasoning",
        "1 tablespoon cayenne",
        "1/2 cup table salt",
        "3 lemons, quartered",
        "2 onions, halved",
        "1 1/2 pounds small potatoes (about 2 inches in diameter)",
        "2 heads of garlic (not separated into cloves)",
        "6 ears of corn, shucked",
        "2 tablespoons Old Bay Seasoning*, or to taste, for sprinkling over  boiled seafood",
        "2 pounds large shrimp (about 30, preferably with heads)",
        "Accompaniments:Horseradish Cocktail Sauce and French  bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Potato",
        "Crab",
        "Shrimp",
        "Corn",
        "Summer",
        "Boil",
        "Gourmet"
    ],
    "title": "Spicy Boiled Crabs, Shrimp, Potatoes, Corn, and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-boiled-crabs-shrimp-potatoes-corn-and-garlic-12397"
}
