{
    "directions": [
        "Heat oil in a large pot over medium-high heat. Cook beef shank, oxtail pieces, and ginger in hot oil, turning occasionally, until browned, 3 to 5 minutes per side. Add star anise, fennel seed, coriander seed, cloves, cinnamon stick, and cardamom pod to the pot and saute until fragrant, about 30 seconds.",
        "Stir water, onion, garlic, white sugar, and bay leaf into beef mixture; bring to a boil, reduce heat to low, and simmer until broth is flavorful and meat is falling off the bone, 5 to 6 hours. Remove meat and reserve. Strain broth into a pot; discard strained spices and vegetables.",
        "Chop beef shank meat and add to broth in pot; stir in fish sauce and soy sauce. Bring broth to a simmer and reduce heat to low to keep warm.",
        "Place rice noodles in a large bowl and cover with hot water. Set aside until noodles are softened, about 5 minutes. Drain and rinse in cold water.",
        "Place a handful of bean sprouts in the bottom of a large soup bowl. Top with a large handful of prepared rice noodles and drop a few jalapeno slices over noodles. Ladle beef broth into bowl to cover noodles."
    ],
    "ingredients": [
        "Broth:",
        "1 tablespoon vegetable oil",
        "2 thick slices beef shank",
        "2 pounds beef oxtail, cut into pieces",
        "1 (6 inch) piece fresh ginger, sliced",
        "6 whole star anise",
        "1 teaspoon fennel seed",
        "1 teaspoon whole coriander seeds",
        "2 whole cloves",
        "1 cinnamon stick",
        "1 cardamom pod",
        "3 quarts water",
        "1 onion, halved",
        "6 cloves garlic",
        "2 tablespoons white sugar",
        "1 bay leaf",
        "2 tablespoons fish sauce",
        "1 tablespoon soy sauce",
        "1 (16 ounce) package fresh rice noodles",
        "1 cup fresh bean sprouts, or to taste",
        "1 fresh jalapeno pepper, sliced into rings, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Vietnamese Beef Noodle Soup",
    "url": "http://allrecipes.com/recipe/238808/spicy-vietnamese-beef-noodle-soup/"
}
