{
    "directions": [
        "Blend all spices to powder in grinder or mill. Transfer spice rub to small bowl.",
        "Heat oil in heavy large pot over medium-high heat. Add bones; saut&é until brown, about 10 minutes. Add celery, onion, garlic, ginger and bay leaves. Reduce heat to medium; saut&é until celery is tender, about 5 minutes. Mix in tomatoes and 2 tablespoons spice rub; stir 2 minutes. Add broth, wine and mint. Bring to boil. Reduce heat to medium-low; cover and simmer 1§ hours. Strain into medium saucepan, pressing hard on solids in sieve. Spoon fat off top of broth; reserve fat for use with lamb. Boil broth until reduced to 1§ cups, about 25 minutes. Season sauce to taste with salt and pepper; set aside.",
        "Brush each lamb rack with some of reserved lamb fat. Sprinkle each rack with salt and pepper; rub each with 1 tablespoon spice rub. Place on rimmed baking sheet. Let stand at room temperature 2 hours. (Sauce and lamb can be prepared 1 day ahead. Cover separately; chill. Bring lamb to room temperature before continuing.) Preheat oven to 400°F Heat large skillet over high heat. Sear 1 lamb rack on all sides until brown, about 8 minutes. Return to baking sheet. Repeat with remaining lamb racks. Roast lamb until thermometer inserted into center registers 125°F for rare, about 25 minutes.",
        "Rewarm sauce. Cut lamb between bones into chops. Divide lamb among 6 plates. Spoon sauce over lamb."
    ],
    "ingredients": [
        "2 tablespoons whole coriander seeds",
        "4 teaspoons black peppercorns",
        "2 teaspoons cumin seeds",
        "12 whole cloves",
        "1 teaspoon ground turmeric",
        "3/4 teaspoon cardamom seeds (from whole green pods)",
        "3 tablespoons vegetable oil",
        "2 pounds meaty lamb neck bones",
        "2 celery stalks, chopped",
        "1 cup chopped onion",
        "8 large garlic cloves, chopped",
        "2 tablespoons chopped peeled fresh ginger",
        "3 small bay leaves, crumbled",
        "2 large plum tomatoes, chopped",
        "5 cups canned low-salt chicken broth",
        "1/2 cup dry white wine",
        "1/4 cup chopped fresh mint",
        "3 1 1/4-pound lamb racks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Tomato",
        "Roast",
        "Mint",
        "Winter",
        "Party",
        "Coriander"
    ],
    "title": "Spice-Crusted Rack of Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/spice-crusted-rack-of-lamb-102863"
}
