{
    "directions": [
        "Flatten each steak to a 3/4-inch thickness between 2 pieces of plastic wrap. In a heavy-duty sealable plastic bag or between 2 sheets of wax paper crush the peppercorns and the allspice berries coarse with the bottom of a heavy skillet. Press the peppercorn mixture into both sides of the steaks and chill the steaks, covered with plastic wrap, for at least 2 hours or overnight.",
        "In each of 2 heavy skillets heat 1/2 tablespoon of the butter and 1 1/2 tablespoons of the oil over moderately high heat until the foam subsides and in the fat sauté the steaks, seasoned with salt, for 3 to 4 minutes on each side, or until they are just springy to the touch for rare meat. Transfer the steaks with a slotted spatula to a platter and keep them warm, covered loosely. Pour off the fat remaining in the skillets, to each skillet add 1 tablespoon of the remaining butter and half the minced white scallion, and cook the scallion over moderate heat, stirring, until it is softened. Deglaze each skillet with 1/2 cup of the wine, scrapping up any brown bits clinging to the skillet, and pour the wine mixture form one skillet into the other. Boil the wine mixture until it is reduced to a glaze, remove the skillet from the heat, and whisk in the remaining 8 tablespoons butter, 1 tablespoon at a time, adding each new piece just before the previous one has melted completely. Whisk in the scallion green and salt and black pepper to taste. Divide the red-cabbage confit among 8 dinner plates, arrange a venison steak over each serving, and spoon some of the sauce over each steak."
    ],
    "ingredients": [
        "a 3 1/2- to 4-pound boneless loin of venison,* trimmed and cut crosswise into eight 4- to 6-ounce steaks, reserving any remaining for another use",
        "2 tablespoons black peppercorns",
        "2 tablespoons Szechwan peppercorns (available at Oriental markets, specialty foods, shops, and some supermarkets)",
        "2 tablespoons dried allspice berries",
        "1 stick (1/2 cup) plus 3 tablespoons unsalted butter, softened",
        "3 tablespoons vegetable oil",
        "1/2 cup minced white part of scallion plus 1/3 cup thinly sliced scallion green",
        "1 cup dry red wine",
        "red-cabbage confit as an accompaniment",
        "*available at many butcher shops, specialty foods shops, and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauté",
        "Venison",
        "Gourmet"
    ],
    "title": "Spiced Venison Steaks with Red-Cabbage Confit and Red-Wine Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-venison-steaks-with-red-cabbage-confit-and-red-wine-sauce-13198"
}
