{
    "directions": [
        "Cover figs, apricots, and prunes with water in a 3-quart saucepan and simmer, covered, 20 minutes. Drain in a sieve. Reserve 2 cups fruit, then thread remainder onto 4 skewers.",
        "Preheat oven to 425°F.",
        "Crack allspice and peppercorns using a mortar and pestle (or spread spices on a kitchen towel and crack with bottom of a heavy skillet), then stir into butter.",
        "Discard neck, giblets, and any loose fat from goose. Using pliers, pull out any remaining quills. Prick skin all over with remaining skewer (especially thighs and breast), holding skewer nearly parallel to skin to avoid puncturing meat. Fold neck skin under body and fasten with skewer. Season goose well with salt inside and out. Put onions and reserved 2 cups fruit in cavity and tie legs together loosely with string. Rub skin all over with spiced butter.",
        "Put goose on rack in roasting pan and roast in middle of oven 30 minutes. Reduce oven temperature to 325°F and continue to roast, basting goose and skimming off and reserving excess fat (for roasted potatoes ) with bulb baster every 30 minutes, 1 hour more.",
        "Arrange skewers with fruit on rack around goose (if rack is too small to fit all skewers, tuck some into wings). Continue to roast goose, basting and skimming and reserving fat in same manner, until an instant-read thermometer inserted into fleshy part of a thigh (do not touch bone) registers 170°F and several fruits from bottom of cavity speared on thermometer register 160–165°F, about 1 hour more (juices will be slightly pink when thigh is pierced; temperature will rise to 175°F as goose stands).",
        "Remove fruit from skewers and transfer to a bowl. Keep warm, covered. Transfer goose with 2 large spatulas to a cutting board and let stand, loosely covered with foil, 30 minutes.",
        "Pour off fat from roasting pan. Straddle pan across 2 burners, then add shallots and sauté over moderately high heat, stirring, until golden, about 3 minutes. Add Armagnac and deglaze pan by boiling and scraping up brown bits. Add demiglace and jam and briskly simmer, whisking, until jam is incorporated and sauce is slightly thickened, about 3 minutes. Pour sauce through a sieve if desired and keep warm, covered.",
        "Discard onions from cavity of goose and add fruit from cavity to fruit in bowl, then keep warm, covered. Carve goose, cutting breast into 1/4-inch-thick slices. Serve fruit and sauce on the side."
    ],
    "ingredients": [
        "8 oz dried figs (preferably Calmyrna; 1 1/3 cups), stems discarded",
        "8 oz dried apricots (1 1/4 cups)",
        "8 oz pitted prunes (1 1/4 cups)",
        "1 tablespoon whole allspice",
        "1 tablespoon mixed peppercorns (black, white, green, and pink)",
        "1/2 stick (1/4 cup) unsalted butter, melted",
        "1 (12-lb) goose, wing tips removed",
        "2 medium onions, quartered",
        "1/3 cup finely chopped shallots (2 large)",
        "2/3 cup Armagnac",
        "2 cups veal demiglace",
        "2 tablespoons apricot jam or preserves",
        "Special equipment: 5 (8-inch) metal or wooden skewers; small pliers; kitchen string; an adjustable V-rack; a large flameproof roasting pan at least 2 inches deep (not nonstick); a metal bulb baster (not plastic)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "Roast",
        "Christmas",
        "Dinner",
        "Dried Fruit",
        "Goose",
        "Cognac/Armagnac",
        "Winter",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spiced Roast Goose with Dried-Fruit Pan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-roast-goose-with-dried-fruit-pan-sauce-105910"
}
