{
    "directions": [
        "Purée all sauce ingredients in a blender until smooth.",
        "Toast pitas on rack of a gas burner over high heat, turning with tongs, until heated through but still pliable (pitas may puff), about 1 minute, then wrap in foil to keep warm. (Alternatively, wrap untoasted pitas in foil and warm in a preheated 300°F oven or toaster oven.)",
        "Heat 1 tablespoon oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté half of onions, stirring occasionally, until browned but still crisp, 4 to 5 minutes. Transfer to a large plate. Sauté remaining onions in 1 tablespoon oil in same manner and transfer to plate (reserve skillet).",
        "Stir together coriander, cumin, salt, and pepper in a bowl. Pat beef dry and toss with spices. Heat 1 tablespoon oil in skillet over moderately high heat, then sauté half of beef, stirring, until browned but still pink inside, 1 to 1 1/2 minutes. Transfer beef to plate with onions, then sauté remaining beef in remaining tablespoon oil in same manner.",
        "Halve pitas and fill with beef and onions. Serve sauce on the side."
    ],
    "ingredients": [
        "3 cups loosely packed fresh flat-leaf parsley leaves (from 2 bunches)",
        "2 tablespoons cider vinegar",
        "2 tablespoons water",
        "1 tablespoon chopped shallot",
        "1 teaspoon sugar",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/4 cup olive oil",
        "4 (6-inch) pita loaves with pockets",
        "1/4 cup olive oil or vegetable oil",
        "1 pound white onions, quartered lengthwise, then cut lengthwise into 1/4-inch-wide wedges",
        "3/4 teaspoon ground coriander",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 pound sliced stir-fry beef (top round) or 1/3-inch-thick top round steaks, cut into 1/3-inch-wide strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Beef",
        "Herb",
        "Onion",
        "Sauté",
        "Quick & Easy",
        "Gourmet"
    ],
    "title": "Spiced Beef and Onion Pitas with Parsley Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-beef-and-onion-pitas-with-parsley-sauce-231362"
}
