{
    "directions": [
        "Place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, 10 to 15 minutes. Drain and allow to steam dry for a minute or two. Place the potatoes into a large bowl, and chill in the refrigerator until cold, about 1 hour.",
        "While the potatoes are boiling, place the eggs into a saucepan in a single layer and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Once the water is boiling, remove from the heat and let the eggs stand in the hot water for 15 minutes. Pour out the hot water, then cool the eggs under cold running water in the sink. Peel once cold. Chop the eggs, and place into the bowl with the potatoes.",
        "Preheat oven to 425 degrees F (220 degrees C). Cut the bell peppers in half, and remove the seeds, core, and stems. Place the bell peppers onto a baking sheet, cut sides down. Cut the onion in half, and place it onto the baking sheet, cut sides down.",
        "Roast the peppers and onion in the preheated oven until the skin of the vegetables has charred in places, about 25 minutes. Remove any large pieces of burned skin, and chop the peppers and onions. Transfer into the bowl with the potatoes and eggs.",
        "In a bowl, stir together the mayonnaise, horseradish mustard, chipotle peppers, adobo sauce, dill, garlic, cumin, and salt and pepper until thoroughly combined. Pour the dressing over the potato mixture, and lightly toss until the potatoes, eggs, and vegetables are thoroughly coated with dressing. Chill before serving."
    ],
    "ingredients": [
        "3 pounds russet potatoes, peeled and cubed",
        "4 eggs",
        "2 red bell peppers",
        "2 green bell peppers",
        "1 red onion",
        "2 cups reduced-fat mayonnaise",
        "1/2 cup horseradish mustard",
        "4 chipotle peppers in adobo sauce, chopped",
        "1/4 cup adobo sauce from chipotle peppers",
        "8 sprigs fresh dill, chopped",
        "1 clove garlic, minced, or to taste",
        "1 pinch ground cumin, or to taste",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Dill Potato Salad",
    "url": "http://allrecipes.com/recipe/215695/spicy-dill-potato-salad/"
}
