{
    "directions": [
        "About 30 minutes before smoking, make the dry rub. Combine all rub ingredients in small bowl; mix well.  Generously coat both sides of ribs with rub.  Set aside at room temperature for 30 minutes.",
        "Meanwhile, make the sauce.  Whisk together all ingredients in large saucepan; bring to a boil over medium-high heat.  Reduce heat and simmer 20 minutes until thickened, stirring occasionally.",
        "Heat charcoal or gas grill for indirect cooking at 275 degrees F. Add drained wood chips, if using.",
        "Place the ribs, meaty side up, over a drip pan and cook for 2 hours, spraying with apple juice every 30 minutes. Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.",
        "Remove ribs from grill.  Place each rack on double stack of large aluminum foil.  Drizzle maple syrup and butter on each rack; sprinkle with brown sugar and spray with apple juice; wrap each rack tightly with foil.",
        "Return wrapped ribs to the grill and cook for 1 1/2 to 2 hours more over indirect heat, until very tender.  Add more coals as needed to maintain temperature for a charcoal grill.",
        "Remove ribs from grill and unwrap.  Place ribs over direct heat on grill and brush with barbecue sauce.  Cook for about 5 minutes, until the sauce is set. Turn ribs and repeat with more sauce.",
        "Serve ribs with remaining barbecue sauce."
    ],
    "ingredients": [
        "2 racks Smithfield® Extra Tender Pork Back Ribs, membrane removed",
        "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional)",
        "1 cup apple juice, in a spray bottle",
        "Rub:",
        "1/3 cup kosher salt",
        "1/4 cup light brown sugar",
        "1 tablespoon paprika",
        "1 teaspoon chipotle chile powder",
        "1 teaspoon fresh cracked black pepper",
        "1 teaspoon cayenne pepper",
        "1 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "1/2 teaspoon ground coriander",
        "Sauce:",
        "3 cups ketchup",
        "1 cup dark brown sugar",
        "3/4 cup distilled white vinegar",
        "1/4 cup water",
        "2 tablespoons molasses",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon chili powder",
        "2 teaspoons smoked paprika",
        "1 teaspoon onion powder",
        "1 teaspoon garlic powder",
        "1 teaspoon chipotle chile powder",
        "1/2 teaspoon black pepper",
        "1/2 cup maple syrup",
        "1/2 cup unsalted butter, melted",
        "1/4 cup light brown sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Smoked Back Ribs with Maple Glaze",
    "url": "http://allrecipes.com/recipe/242381/spicy-smoked-back-ribs-with-maple-gla/"
}
