{
    "directions": [
        "Pre-heat oven to 400°F.",
        "Using spice or coffee grinder, grind cumin to semi-fine powder, then transfer to small bowl. Whisk in cocoa powder, coffee, and pepper.",
        "Rub exposed lamb bones with 1 tablespoon canola oil, then wrap each bone in foil, covering bones completely and leaving meat uncovered. Sprinkle both sides of uncovered lamb with kosher salt, then rub with spice mixture.",
        "In heavy, 12-inch oven-safe sauté pan over high heat, heat remaining 2 tablespoons canola oil until hot but not smoking. Sear rack, meat side down, moving occasionally to prevent sticking, until deep golden brown and crust forms, about 2 minutes. Flip to sear underside in same manner, about 2 minutes, then sear bottom of rack in same manner, 2 minutes more.",
        "Flip rack back to meat side up, then transfer pan to oven and roast 7 minutes. Add butter, garlic, and thyme to pan and continue roasting until thermometer inserted 2 inches into thickest part of lamb (do not touch bone) registers 130°F (for medium rare), 7 to 8 minutes more. Tilt pan to collect juices and spoon those over meat. Transfer lamb to rack with pan or plate underneath to catch juices and let rest 10 to 15 minutes.",
        "In small bowl, whisk together blood orange juice, shallot, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Gradually add olive oil and whisk vigorously to combine. (Vinaigrette can be prepared ahead and refrigerated, covered, up to 2 days. Whisk thoroughly before using.)",
        "Divide avocado between two plates, fanning out slices over half of plate. Top with arugula and drizzle with vinaigrette. Top with blood orange segments and sprinkle with remaining 1/4 teaspoon salt and 1/4 teaspoon pepper.",
        "Remove foil from lamb bones. Slice rack into 4 double chops and transfer to plates alongside salad. Serve immediately."
    ],
    "ingredients": [
        "1 heaping tablespoon whole cumin seeds",
        "1 tablespoon unsweetened cocoa powder",
        "1 tablespoon mild-roast coffee, finely ground",
        "1/2 teaspoon freshly ground black pepper",
        "1 (8-bone; 24-to 26-ounce) rack of lamb",
        "3 tablespoons canola oil",
        "1 1/2 teaspoons kosher salt",
        "2 tablespoons unsalted butter",
        "2 garlic cloves, peeled and smashed with back of knife",
        "3 sprigs fresh thyme",
        "Juice of 1 blood orange (about 1/4 cup)",
        "1 tablespoon shallot, minced (from 1 small shallot)",
        "3/4 teaspoon flaky sea salt",
        "1/2 teaspoon freshly ground black pepper",
        "2 tablespoons extra-virgin olive oil",
        "1 firm but ripe Haas avocado, peeled and cut into 1/4-inch-thick slices",
        "2 cups (1 ounce) loosely packed baby arugula leaves",
        "1 blood orange, peeled, segmented, and seeded",
        "Special equipment: heavy-duty aluminum foil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Marinate",
        "Sauté",
        "Valentine's Day",
        "Dinner",
        "Avocado",
        "Arugula",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spice-Coated Rack of Lamb for Two with Arugula, Avocado, and Blood Orange Salad",
    "url": "http://www.epicurious.com/recipes/food/views/spice-coated-rack-of-lamb-for-two-with-arugula-avocado-and-blood-orange-salad-351234"
}
