{
    "directions": [
        "Rinse rice in a sieve under cold water, then shake well to drain and transfer to a 1 1/2-to 2-quart heavy saucepan. Add water (1 1/2 cups), sugar, 1 cup coconut milk, and 3/4 teaspoon salt. Bring to a boil, partially covered, then reduce heat to low and cover completely. Cook 20 minutes, then remove from heat and let stand, covered, 5 minutes.",
        "While rice cooks, trim Broccolini, discarding 1/4 inch from bottom, then cut diagonally into 1-inch lengths. Toss shrimp with Sriracha sauce and remaining 3/4 teaspoon salt in a bowl.",
        "Stir together cornstarch, 1/4 cup chicken broth, and remaining 1/2 cup coconut milk in another bowl until cornstarch is completely dissolved.",
        "Heat a 12- to 14-inch well-seasoned flat-bottomed wok or a 12-inch heavy skillet over high heat until it just begins to smoke, then add oil, swirling to coat. Add Broccolini and stir-fry until bright green, then add remaining 1/4 cup chicken broth and stir-fry until liquid is evaporated, about 3 minutes. Add shrimp mixture and cook, stirring frequently, 2 minutes. Stir cornstarch mixture, then pour it down side of wok and boil, stirring, until sauce is slightly thickened and shrimp are just cooked through, about 3 minutes more. Fluff rice with a fork and serve with shrimp immediately."
    ],
    "ingredients": [
        "1 1/2 cups long-grain white rice",
        "1 1/2 cups water",
        "1 teaspoon sugar",
        "1 1/2 cups well-stirred unsweetened coconut milk (not low-fat; from a 13 1/2- to 14-oz can)",
        "1 1/2 teaspoons salt",
        "1 lb Broccolini",
        "2 lb peeled and deveined large shrimp (raw; 20 to 25 per lb)",
        "2 1/2 tablespoons Sriracha sauce",
        "2 teaspoons cornstarch",
        "1/2 cup reduced-sodium chicken broth",
        "1 tablespoon vegetable oil",
        "Accompaniment: lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Citrus",
        "Rice",
        "Vegetable",
        "Stir-Fry",
        "Quick & Easy",
        "Summer",
        "Gourmet"
    ],
    "title": "Spicy Wok Shrimp with Coconut Rice",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-wok-shrimp-with-coconut-rice-1222183"
}
