{
    "directions": [
        "Fill a large pot with salted water and bring to boil over high heat. Fill a large bowl with ice water.",
        "Add the rabe to the boiling water and cook until bright green, about 2 minutes. Drain and submerge in bowl of ice water until cool, about 2 minutes. Drain and set aside.",
        "In a large skillet over medium heat, add the olive oil. Add the garlic, red pepper flakes, and anchovies, stirring and breaking up the anchovies with a wooden spoon. Cook until garlic is fragrant and light golden in color, 1 minute.",
        "Add the rabe to the pan with any residual water. Cook, tossing occasionally, until the mixture starts to wilt, about 2 minutes. Add the salt and pepper and cook until rabe is crisp tender, about 3 minutes more.",
        "Remove from heat and stir in lemon juice. Taste and adjust seasoning. Spoon onto plates or a platter and top with parmesan and pine nuts."
    ],
    "ingredients": [
        "2 pounds broccoli rabe (about 2 bunches) trimmed and sliced into 2-inch pieces",
        "3 tablespoons olive oil",
        "4 garlic cloves, thinly sliced crosswise",
        "1/2 to 3/4 teaspoon red pepper flakes",
        "4 oil-packed anchovy fillets",
        "1 teaspoon kosher salt, plus more for blanching",
        "1/4 teaspoon freshly ground black pepper",
        "2 tablespoons lemon juice",
        "1 ounce parmesan, shaved in strips using a peeler (1/2 cup curls)",
        "1/4 cup toasted pine nuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Side",
        "Parmesan",
        "Pine Nut",
        "Broccoli Rabe",
        "Anchovy",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spicy Broccoli Rabe with Parmesan and Pine Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-broccoli-rabe-with-parmesan-and-pine-nuts-51243810"
}
