{
    "directions": [
        "Heat oil in a medium skillet over medium-high. Season lamb with salt and pepper and arrange in pan in an even patty about 1/4\" thick. Cook, pressing occasionally to help meat make contact with pan, until underside is browned and very crisp, about 5 minutes. Carefully turn, pouring off excess fat (reserve), and cook until other side is crisp, about 5 minutes.",
        "Break up lamb into small pieces. Mix in garlic, red pepper flakes, and cumin. Cook, stirring occasionally, until spices are fragrant and lamb is cooked through but still juicy, about 2 minutes. Transfer lamb mixture to a bowl with a slotted spoon.",
        "Place lentils and 2 tablespoons of reserved fat in same skillet, season with salt and pepper, and cook, tossing occasionally, until lentils start to brown and crisp, 5–8 minutes. Return lamb to skillet and toss to combine and warm through. Remove from heat and stir in cucumber, cilantro, and parsley.",
        "Spoon yogurt onto plates and top with lamb mixture, then some more cilantro and parsley. Serve with flatbread and lemon wedges."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "1/2 pound ground lamb",
        "Kosher salt, freshly ground pepper",
        "2 garlic cloves, thinly sliced",
        "1 teaspoon crushed red pepper flakes",
        "1/2 teaspoon cumin seeds",
        "1 1/2 cups cooked brown or French green lentils (from 1 cup dried)",
        "1/2 English hothouse cucumber, chopped",
        "1/2 cup chopped fresh cilantro, plus leaves for serving",
        "1/4 cup chopped fresh parsley, plus leaves for serving",
        "3/4 cup plain whole-milk Greek yogurt",
        "Flatbread and lemon wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Quick & Easy",
        "Yogurt",
        "Dinner",
        "Lunch",
        "Ground Lamb",
        "Lentil",
        "Healthy",
        "Low Cholesterol",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Spicy Lamb and Lentils With Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-lamb-and-lentils-with-herbs-51264050"
}
