{
    "directions": [
        "Cut steak with grain into 1 1/2- to 2-inch-wide strips. Cut each strip across grain into 1/4-inch-thick slices. Put slices into a medium bowl with soy sauce, cornstarch, rice wine, garlic, ginger, 1/4 teaspoon salt, sugar, and 1 teaspoon oil and stir with a fork. 3Stir together ketchup, hoisin, and chile garlic sauce in a small bowl.",
        "Heat wok over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Pour 2 teaspoons oil down side of wok, then swirl oil, tilting wok to coat sides. Add beef, spreading pieces in 1 layer on bottom and sides as quickly as possible. Cook, undisturbed, letting beef begin to brown, 1 minute, then stir-fry until meat is just browned on all sides but still pink in center, about 1 minute. Transfer meat and any juices to a plate.",
        "Pour remaining 2 teaspoons oil down side of unwashed wok over high heat, then swirl oil, tilting wok to coat sides. Add bell pepper, scallions, and remaining 1/4 teaspoon salt. Stir-fry 30 seconds, then add reserved beef with any juices and ketchup mixture. Stir-fry until combined well and sauce thickens slightly, about 30 seconds, then transfer to a platter."
    ],
    "ingredients": [
        "1 (1/2-lb) piece flank steak, well trimmed",
        "2 teaspoons soy sauce",
        "1 1/2 teaspoons cornstarch",
        "1 1/2 teaspoons Chinese rice wine (preferably Shaoxing) or medium-dry Sherry",
        "1 teaspoon finely grated peeled garlic (use a rasp grater)",
        "1 teaspoon finely grated fresh ginger (use a rasp grater)",
        "1/2 teaspoon salt",
        "1/4 teaspoon sugar",
        "5 teaspoons vegetable oil",
        "1 tablespoon ketchup",
        "1 tablespoon hoisin sauce",
        "2 to 3 teaspoons chile garlic sauce, such as Vietnamese Tuong Ot Toi",
        "1 large red bell pepper, cut lengthwise into 1/4-inch-wide strips (1 1/2 cups)",
        "2 scallions, halved lengthwise and cut into 1-inch pieces (1/2 cup)",
        "Special equipment: a rasp grater; a well-seasoned 14-inch flat-bottomed wok",
        "Accompaniment: steamed white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Wok",
        "Beef",
        "Garlic",
        "Ginger",
        "Vegetable",
        "Stir-Fry",
        "Quick & Easy",
        "Steak",
        "Bell Pepper",
        "Spring",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Spicy Beef with Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-beef-with-peppers-231180"
}
