{
    "directions": [
        "Heat peanut oil in heavy large pot over medium-high heat. Add chicken; sauté until brown, about 4 minutes per side. Transfer to bowl. Add mushrooms, 1 1/2 cups green onions, garlic and ginger to pot. Sauté until mushrooms are tender, about 5 minutes. Return chicken to pot. Add chicken broth, hoisin sauce and star anise. Bring to boil. Reduce heat, cover and simmer until chicken is cooked through, about 20 minutes.",
        "Remove chicken from pot; cool slightly. Remove skin and bones from chicken and discard. Cut meat crosswise into 1/2-inch-wide strips.",
        "Meanwhile, boil mixture in pot until reduced to 2 1/2 cups, about 20 minutes. Stir in cabbage and chili sauce. Boil until cabbage is tender, about 4 minutes. Return chicken to pot; simmer until heated through, about 2 minutes. Transfer to bowl. Discard star anise. Sprinkle with remaining 1/2 cup green onions."
    ],
    "ingredients": [
        "1 tablespoon peanut oil",
        "4 chicken breast halves with skin and bones",
        "12 ounces fresh shiitake mushrooms, stemmed, caps quartered",
        "2 cups chopped green onions",
        "2 tablespoons minced garlic",
        "1 tablespoon minced peeled fresh ginger",
        "2 14 1/2-ounce cans low-salt chicken broth",
        "1/2 cup hoisin sauce",
        "4 whole star anise",
        "4 cups 3/4-inch-wide strips Napa cabbage (about 1/2 small head)",
        "1 tablespoon hot chili sauce (such as sambal olek or sriracha)*",
        "*Available at Asian markets and in the Asian foods section of some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Mushroom",
        "Onion",
        "Braise",
        "Sauté",
        "Lunar New Year",
        "Hot Pepper",
        "Anise",
        "Cabbage"
    ],
    "title": "Spicy Braised Chicken with Mushrooms and Star Anise",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-braised-chicken-with-mushrooms-and-star-anise-5892"
}
