{
    "directions": [
        "Whisk extra-virgin olive oil, 2 teaspoons vinegar, and 2 chopped green onions in small bowl. Season with salt and pepper.",
        "Toss shrimp with lime juice in bowl. Let stand 30 minutes. Bring clam juice and annatto powder to boil in small saucepan, stirring to dissolve. Cover and set aside.",
        "Heat 1/4 cup olive oil in heavy large skillet over medium-high heat. Add shrimp with any juices to pan; sprinkle with salt and sauté until just opaque in center, about 3 minutes. Transfer to plate. Add onion, green pepper, and garlic to pan; sauté 2 minutes. Add tomatoes, cilantro, chile, and 1 chopped green onion to pan. Reduce heat to medium and sauté until vegetables are almost tender, about 3 minutes. Add 1 tablespoon vinegar and rice; stir 2 minutes. Add clam juice mixture. Boil rice mixture 1 minute. Reduce heat to low, cover, and cook until rice is tender and broth is absorbed, about 20 minutes. Season with salt and pepper. Stir in shrimp. Cover and cook until shrimp are heated through, about 1 minute. Transfer to bowl. Sprinkle with 1 chopped green onion. Serve with dressing.",
        "*Available in the spice section of some supermarkets, at Latin markets, and from wholespice.com."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "2 teaspoons plus 1 tablespoon balsamic vinegar",
        "4 green onions, chopped, divided",
        "1 pound uncooked medium shrimp, peeled, deveined",
        "1 tablespoon fresh lime juice",
        "2 1/2 cups bottled clam juice",
        "1/2 teaspoon annatto powder*",
        "1/4 cup olive oil",
        "1 cup chopped onion",
        "1/2 green bell pepper, seeded, chopped",
        "1 garlic clove, chopped",
        "2 plum tomatoes, seeded, chopped",
        "2 tablespoons chopped fresh cilantro",
        "1/2 to 1 whole Scotch bonnet chile or habanero chile, seeded, chopped",
        "1 cup medium-grain white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Rice",
        "Tomato",
        "Sauté",
        "Low Cal",
        "Shrimp",
        "Hot Pepper",
        "Summer"
    ],
    "title": "Spicy Rice with Shrimp and Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-rice-with-shrimp-and-peppers-234800"
}
