{
    "directions": [
        "Whisk 4 tablespoons oil, lime juice, mint, and coriander in medium bowl. Season dressing with salt and pepper.",
        "Heat remaining 2 tablespoons oil in large nonstick skillet over medium-high heat. Sprinkle chicken with salt and pepper. Add to skillet and sauté until brown on bottom, about 5 minutes. Turn chicken over. Reduce heat to medium-low; cover and cook until just cooked through, about 5 minutes. Transfer to platter.",
        "Return skillet to medium-high heat. Add bell peppers, poblano chile, and onion to same skillet; sprinkle vegetables with salt and pepper. Toss until tender and just beginning to color, 4 to 5 minutes. Cover and cook 1 minute. Mix in 2 tablespoons dressing. Mound vegetables atop chicken. Drizzle with remaining dressing and serve.",
        "*Often called a pasilla; available at some supermarkets and at speciality food stores and latin markets."
    ],
    "ingredients": [
        "6 tablespoons olive oil, divided",
        "2 tablespoons fresh lime juice",
        "2 tablespoons chopped fresh mint",
        "1/2 teaspoon ground coriander",
        "4 skinless boneless chicken breast halves (5 to 6 ounces each)",
        "2 bell peppers (preferably 1 red and 1 yellow), cored, seeded, sliced into 1/4-inch-wide strips",
        "1 large fresh poblano chile,* cored, seeded, thinly sliced",
        "1/2 medium red onion, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Tomato",
        "Sauté",
        "Quick & Easy",
        "Low Cal",
        "Dinner",
        "Lime",
        "Mint",
        "Bell Pepper",
        "Healthy",
        "Chile Pepper",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spicy Chicken Peperonata with Lime and Mint Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-chicken-peperonata-with-lime-and-mint-dressing-353769"
}
