{
    "directions": [
        "Place chicken in a large glass or ceramic bowl. Whisk soy sauce, 1 tablespoon lime juice, honey, jalapeno pepper, and garlic together in another bowl until marinade is smooth. Pour marinade over chicken and turn to coat completely. Cover the bowl with plastic wrap and refrigerate 12 hours to overnight, turning occasionally.",
        "Remove chicken from marinade and shake off excess. Pour marinade into a small saucepan; bring to a boil, reduce heat to medium-low, and simmer for 5 minutes.",
        "Mash avocado in a bowl. Stir in tomato, minced onion, 1 tablespoon lime juice, cilantro, and hot pepper sauce until guacamole is well-combined.",
        "Preheat an outdoor grill for medium-high heat and lightly oil the grate.",
        "Cook chicken on preheated grill, basting with marinade and turning often, until no longer pink in the center and the juices run clear, 7 to 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Transfer chicken to a plate and cover with aluminum foil to rest, about 5 minutes. Slice chicken across the grain into thin strips.",
        "Heat oil in a large nonstick skillet over medium-high heat. Saute sliced onion and red bell pepper in hot oil until tender, about 10 minutes.",
        "Wrap tortillas in a damp paper towel and microwave on high until softened 1 to 3 minutes. Place strips of chicken down the center of each tortilla and top with shredded lettuce, sauteed onion and red bell peppers, and guacamole. Wrap each tortilla tightly around filling."
    ],
    "ingredients": [
        "1 pound skinless, boneless chicken breast halves",
        "Marinade:",
        "2 tablespoons soy sauce",
        "1 tablespoon lime juice",
        "1 tablespoon honey",
        "1/2 small jalapeno pepper, seeded and minced",
        "1 clove garlic, minced",
        "Guacamole:",
        "1 avocado, peeled and pitted",
        "1 tomato, peeled and chopped",
        "1/2 cup minced onion",
        "1 tablespoon lime juice",
        "1 tablespoon chopped fresh cilantro",
        "1 dash hot pepper sauce",
        "2 teaspoons canola oil",
        "1 onion, thinly sliced",
        "1/2 red bell pepper, thinly sliced",
        "8 (12 inch) flour tortillas",
        "1 cup shredded lettuce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Chicken Fajitas",
    "url": "http://allrecipes.com/recipe/241099/spicy-chicken-fajitas/"
}
