{
    "directions": [
        "Whisk all ingredients in small bowl. Season with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover; chill. Bring to room temperature before using.",
        "Combine all ingredients in bowl of heavy-duty mixer fitted with dough hook. Beat at low speed until dough forms and comes away from sides of bowl, about 2 minutes. Scrape dough off hook. Cover bowl with plastic wrap. Let dough rest 30 minutes.",
        "Clean and reattach dough hook. Beat dough at medium speed 3 minutes. Scrape dough on hook into bowl. Cover bowl with plastic and towel. Let dough rise until light and slightly puffed, about 1 hour. Gently knead dough to deflate. Using floured hands, divide sticky dough into 4 equal pieces. Shape each into ball; place on plastic-lined baking sheet. Cover and chill at least 45 minutes. DO AHEAD: Can be made 8 hours ahead. Keep chilled. Bring to room temperature before using.",
        "Cut pear halves vertically into very scant 1/4-inch-thick slices. Brush both sides with oil, then sprinkle with Espelette pepper. Arrange on sheet of foil. If using pizza stone, place in oven. (Alternatively, place heavy large baking sheet, upside down, in oven.) Preheat oven to 500°F for at least 45 minutes.",
        "Stretch and roll each dough ball to 9-inch round on lightly floured work surface. Place 1 dough round on floured pizza peel or rimless baking sheet. Brush dough with oil; sprinkle with sea salt and Espelette pepper. Scatter 1/4 of arugula over. Drizzle lightly with oil. Top with pear slices and 1/4 of cheese.",
        "Slide flatbread onto hot pizza stone or baking sheet. Bake until crust is golden brown and crisp and cheese is melted, rotating occasionally, 10 to 11 minutes. Repeat with remaining flatbreads. Transfer flatbreads to plates. Drizzle with mustard cream and serve."
    ],
    "ingredients": [
        "6 tablespoons heavy whipping cream",
        "3 tablespoons whole grain Dijon mustard",
        "1 1/2 tablespoons Dijon mustard",
        "1 tablespoon fresh lemon juice",
        "1/2 teaspoon honey or agave syrup",
        "2 1/4 cups bread flour",
        "1 cup plus 7 tablespoons warm water (115°F to 120°F)",
        "3/4 cup all purpose flour",
        "1/3 cup whole wheat flour",
        "2 tablespoons olive oil",
        "2 teaspoons fine sea salt",
        "1/2 teaspoon honey",
        "1/4 teaspoon quick-rising active dry yeast",
        "2 firm but ripe Bosc pears, halved lengthwise, cored",
        "Olive oil",
        "Coarsely ground piment d'Espelette, Aleppo pepper, or cayenne pepper",
        "Fine sea salt",
        "5 cups baby arugula (about 4 ounces)",
        "8 ounces coarsely crumbled blue goat cheese (such as Bleuet or FireFly Farms Black and Blue)",
        "Special equipment: pizza stone"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mustard",
        "Bake",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Goat Cheese",
        "Pear",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Pear Flatbreads with Goat Cheese and Mustard Cream",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-pear-flatbreads-with-goat-cheese-and-mustard-cream-354834"
}
