{
    "directions": [
        "In a large heavy saucepan cook the onion, the garlic, the jalapeños, the coriander, and the cumin in the butter over moderately low heat, stirring, until the onion is softened, stir in the flour, and cook the mixture, stirring, for 3 minutes. Add the milk in a stream, whisking, bring the liquid to a boil, whisking, and whisk in the tomatoes. Simmer the mixture for 2 minutes and add the cayenne and salt and pepper to taste.",
        "In a kettle of boiling salted water cook the macaroni for 6 to 7 minutes, or until it is barely al dente, drain it well, and in a large bowl combine it with the tomato mixture. Stir in the Monterey Jack and the Cheddar and transfer the mixture to a buttered 13- to 14- by 9-inch shallow baking dish or 3-quart gratin dish. In a bowl stir together the bread crumbs and the Parmesan, sprinkle the mixture evenly over the macaroni mixture, and bake the macaroni and cheese in the middle of a preheated 375°F. oven for 20 to 25 minutes, or until it is golden and bubbling."
    ],
    "ingredients": [
        "1 1/2 cups finely chopped onion",
        "2 large garlic cloves, minced",
        "1 1/2 tablespoons minced pickled jalapeño chilies, or to taste",
        "1 teaspoon ground coriander",
        "1 1/2 teaspoons ground cumin",
        "1/4 cup unsalted butter",
        "1/4 cup all-purpose flour",
        "4 cups milk",
        "a 28-ounce can plum tomatoes, the juice discarded and the tomatoes chopped and drained well",
        "cayenne to taste if desired",
        "1 pound elbow macaroni",
        "1 1/2 cups coarsely grated Monterey Jack (about 6 ounces)",
        "1 1/2 cups coarsely grated extra-sharp Cheddar (about 6 ounces)",
        "1 1/2 cups fresh bread crumbs",
        "1 1/3 cups freshly grated Parmesan (about 1/4 pound)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Back to School",
        "Cheddar",
        "Monterey Jack",
        "Gourmet"
    ],
    "title": "Spicy Macaroni and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-macaroni-and-cheese-12786"
}
