{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Butter and flour three 9-inch-diameter cake pans with 11/2-inch-high sides. Line bottom of each cake pan with waxed paper; butter and flour waxed paper.",
        "Using electric mixer, cream butter in large bowl. Gradually beat in sugar until smooth. Beat in egg yolks 1 at a time. Blend in melted chocolate. Slowly mix in pecans, vanilla, and spices. Gently fold in flour in 4 batches (batter will be very thick and dense).",
        "Using electric mixer fitted with clean dry beaters, beat egg whites with salt and cream of tartar in another large bowl until medium peaks form. Gently fold 1/4 of whites into batter to lighten, then fold in remaining whites. Divide batter among prepared pans, spreading evenly. Bake until toothpick inserted into center of cake comes out clean, 35 to 40 minutes. Run knife around sides of each cake. Let stand 10 minutes. Invert cakes onto racks. Cool to room temperature.",
        "Cakes can be made up to 2 weeks ahead. Wrap tightly and freeze.",
        "Stir sugar and corn syrup in heavy medium saucepan over medium heat until sugar dissolves. Increase heat and boil 1 minute. Meanwhile, using electric mixer, beat egg yolks in medium bowl until pale and thick. Gradually beat in hot sugar syrup; continue beating until mixture is completely cool, about 5 minutes. Beat in butter 1 piece at a time, incorporating each piece completely before adding next. Blend in melted chocolate, then rum. (If buttercream looks broken or curdled, place bowl with buttercream over medium heat on stove burner and whisk 5 to 10 seconds to warm mixture slightly, then remove from heat and beat mixture again on medium speed. Repeat warming and beating as many times as needed until buttercream is smooth.)",
        "Reserve 1/2 cup buttercream. Set 1 cake layer, flat side up, on rack; spread with half of remaining buttercream. Top with second cake layer; spread with remaining buttercream. Top with third cake layer; use reserved 1/2 cup buttercream to fill in seam where cake layers meet. Freeze cake until buttercream is firm, about 2 hours.",
        "Stir all ingredients in top of double boiler over gently simmering water until mixture is smooth. Remove from over water. Stir until glaze is thickened, about 5 minutes (do not allow glaze to set).",
        "Pour 3/4 of glaze over top of cake. Carefully and quickly tilt cake back and forth so glaze coats sides; smooth sides with spatula, adding some of remaining glaze where necessary. Chill cake until glaze is set.",
        "Melt white chocolate in top of double boiler over gently simmering water; stir until smooth. Stir in 1/4 cup corn syrup. Pour onto baking sheet. Chill until firm, 30 to 40 minutes. Transfer white chocolate to work surface and knead several minutes. Shape white chocolate dough into ball. Wrap in plastic. Let white chocolate dough stand at room temperature 1 hour.",
        "Repeat with bittersweet chocolate and remaining 1/4 cup corn syrup.",
        "Cut white chocolate dough into 4 pieces. Flatten 1 piece into rectangle. Turn pasta machine to widest setting. Run chocolate through 3 times, folding into thirds before each run. Adjust machine to next narrower setting. Run chocolate through machine without folding. If chocolate is more than 1/16 inch thick, run through next narrower setting. Lay chocolate piece on rimless baking sheet. Repeat flattening, folding, and rolling with remaining chocolate pieces. Repeat process with bittersweet chocolate dough.",
        "Cut four 8x1-inch strips from rolled white chocolate dough and four 8x1/2-inch strips from rolled bittersweet chocolate dough. Center bittersweet chocolate strips atop white chocolate strips to form 4 ribbons. Run 1 ribbon from base of cake to center. Arrange remaining 3 chocolate ribbons equidistant from each other in same fashion so ribbons meet in center.",
        "Cut ten 6 1/2x1-inch strips from rolled white chocolate dough and ten 61/2x1/2-inch strips from rolled bittersweet chocolate dough. Center bittersweet chocolate strips atop white chocolate strips to form 10 ribbons. Cut ends off 2 ribbons on diagonal. Starting at center, drape ribbons over top and sides of cake to form trailers. To form loops for bows, fold remaining 8 ribbons in half, layered side out. Cut ends into V shapes. Arrange ribbon halves with V shapes at center of cake to form bow.",
        "Cut one 3x1-inch strip of white chocolate and one 3x1/2-inch strip of bittersweet chocolate. Center bittersweet chocolate strip atop white chocolate strip. Fold in ends of chocolate strips and pinch to resemble knot; place in center of bow. Carefully transfer cake to serving platter or cake stand.",
        "Cake can be prepared up to 1 day ahead. Cover and refrigerate. Bring cake to room temperature before serving."
    ],
    "ingredients": [
        "1 1/2 cups (3 sticks) butter, room temperature",
        "2 cups sugar",
        "8 eggs, separated, room temperature",
        "10 ounces bittersweet or semisweet chocolate (do not exceed 61% cacao), melted, lukewarm",
        "1 1/2 cups finely chopped pecans",
        "2 teaspoons vanilla",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cloves",
        "1 teaspoon freshly grated nutmeg",
        "1 1/3 cups unbleached all purpose flour, sifted (measured, then sifted)",
        "Pinch of salt",
        "Pinch of cream of tartar",
        "3/4 cup sugar",
        "1/2 cup light corn syrup",
        "4 jumbo egg yolks",
        "1 1/2 cups (3 sticks) butter, cut into small pieces, room temperature",
        "6 ounces bittersweet or semisweet chocolate (do not exceed 61% cacao), melted and cooled (but still pourable)",
        "1/4 cup dark rum",
        "12 ounces bittersweet or semisweet chocolate (do not exceed 61% cacao), chopped",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into 12 pieces",
        "2 tablespoons honey",
        "3/4 teaspoon instant espresso powder or instant coffee powder",
        "7 ounces high-quality white chocolate (such as Lindt or Perugina), chopped",
        "1/2 cup light corn syrup, divided",
        "7 ounces bittersweet or semisweet chocolate (do not exceed 61% cacao), broken into pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Birthday",
        "Christmas",
        "Chocolate",
        "Pecan",
        "Spice",
        "Cinnamon",
        "Clove",
        "Nutmeg"
    ],
    "title": "Spiced Chocolate Torte Wrapped in Chocolate Ribbons",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-chocolate-torte-wrapped-in-chocolate-ribbons"
}
