{
    "directions": [
        "Mash garlic with flat side of knife. Place garlic in medium bowl. Add buttermilk, cumin, salt, pepper and cayenne and whisk to blend. Place chicken pieces in 13x9-inch glass baking dish. Pour buttermilk mixture over; turn chicken to coat. Cover and chill at least 8 hours or overnight, turning occasionally.",
        "Place rack over baking sheet. Remove chicken from marinade and set on rack. Let drain 10 minutes.",
        "Mix flour, salt, pepper, cumin and cayenne pepper in large bowl. Toss chicken pieces in batches in flour mixture, turning to coat; shake off excess. Toss each piece again in flour mixture; shake off excess. Transfer chicken to rack on baking sheet. Let stand at least 15 minutes and up to 45 minutes.",
        "Preheat oven to low. Line baking sheet with paper towels. Pour oil into heavy large skillet to depth of 3/4 inch. Heat oil over high heat to 375°F. or until small cube of fresh bread sizzles instantly when added. Add chicken thigh and leg pieces to skillet. Adjust heat so that temperature remains between 340°F. and 350°F. or until small cube of bread sizzles slowly when added. Fry until chicken is golden brown and cooked through, turning chicken occasionally, about 16 minutes. Using tongs, transfer chicken to paper towel-lined baking sheet. Place baking sheet with chicken in oven to keep warm.",
        "Reheat oil to 375°F. Add breast and wing pieces to skillet. Adjust heat so that temperature remains between 340°F. and 350°F. and fry chicken until cooked through and golden brown, turning occasionally with tongs, about 10 minutes. Using tongs, transfer chicken to prepared sheet and drain.",
        "Transfer chicken to platter. Sprinkle with cilantro. Garnish with lime wedges and serve."
    ],
    "ingredients": [
        "6 medium garlic cloves",
        "2 cups buttermilk",
        "1 1/4 teaspoons ground cumin",
        "1/2 teaspoon salt",
        "1/2 teaspoon pepper",
        "1/4 teaspoon cayenne pepper",
        "1 3 1/2-pound fryer, cut into 8 pieces",
        "1 1/2 cups unbleached all purpose flour",
        "1 3/4 teaspoons salt",
        "1 1/2 teaspoons pepper",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon cayenne pepper",
        "Safflower oil (for deep frying)",
        "Chopped fresh cilantro",
        "Lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Spice",
        "Pan-Fry"
    ],
    "title": "Spicy Fried Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-fried-chicken-2089"
}
