{
    "directions": [
        "Arrange carrots on large rimmed baking sheet. Whisk 2 tablespoons water and all remaining ingredients in small bowl; pour over carrots and toss to coat. Cover tightly with heavy-duty foil. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Toss to coat before continuing.",
        "Preheat oven to 400°F. Roast carrot mixture covered until just tender, about 30 minutes.",
        "Meanwhile, arrange pork tenderloins on another rimmed baking sheet. Stir oregano, cumin, chile powder, smoked paprika, and 1 teaspoon coarse salt in small bowl; rub mixture all over tenderloins. Heat oil in heavy large nonstick skillet over medium-high heat. Add pork to skillet and cook until browned on all sides, about 5 minutes. Return to rimmed baking sheet.",
        "Remove foil from carrots. Nestle pork among carrots on baking sheet, arranging carrots in single layer around pork. Roast uncovered until instant-read thermometer inserted into center of pork registers 145°F, stirring carrots occasionally if beginning to caramelize, about 18 minutes. Let rest 5 to 10 minutes.",
        "Transfer pork to work surface. Cut crosswise into 1/2-inch-thick slices. Arrange carrots on platter. Top with pork slices, drizzling any pan juices over.",
        "Available in the spice section of many supermarkets and at Latin markets.",
        "** Sometimes labeled Pimentón Dulce or Pimentón de La Vera Dulce; available at some supermarkets, at specialty foods stores, and from tienda.com."
    ],
    "ingredients": [
        "2 pounds baby carrots, peeled, trimmed, leaving 1/2 inch of green tops attached",
        "2 tablespoons water",
        "1 tablespoon extra-virgin olive oil",
        "1 tablespoon butter, diced",
        "2 garlic cloves, thinly sliced",
        "1 small jalapeño (preferably red), seeded, coarsely chopped",
        "1 teaspoon honey",
        "1/2 teaspoon ancho chile powder*",
        "1/2 teaspoon ground cumin",
        "1/4 teaspoon coarse kosher salt",
        "2 1-to 1 1/4-pound pork tenderloins",
        "2 teaspoons dried oregano",
        "2 teaspoons ground cumin",
        "1 teaspoon ancho chile powder",
        "1 teaspoon smoked paprika**",
        "1 teaspoon coarse kosher salt",
        "1 tablespoon extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Low Cal",
        "High Fiber",
        "Father's Day",
        "Dinner",
        "Pork Tenderloin",
        "Carrot",
        "Spring",
        "Healthy",
        "Jalapeño",
        "Cumin",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spice-Rubbed Pork Tenderloin With Roasted Baby Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/spice-rubbed-pork-tenderloin-with-roasted-baby-carrots-352090"
}
