{
    "directions": [
        "Put oven rack in middle position and preheat oven to 450°F.",
        "Heat 1 inch oil in a 4- to 5-quart heavy pot over high heat until it registers 375°F on thermometer.",
        "While oil heats, pat steaks dry, then rub all over with spice rub (and salt if necessary). Heat 1 tablespoon oil in a 12-inch ovenproof heavy skillet over moderately high heat until hot but not smoking, then sear steaks, turning over once with tongs, until well browned, about 5 minutes total. Transfer skillet to oven and roast 10 minutes for medium-rare.",
        "Check oil while searing steaks, and when it registers 375°F, begin frying french fries in 2 batches (add fries carefully; they may have ice crystals, which could cause spattering), stirring occasionally, until golden and crisp, 4 to 5 minutes per batch. Transfer fries with a slotted spoon to paper towels to drain and season with salt and pepper while hot. Return oil to 375°F between batches.",
        "Turn off heat under pot, then add garlic and fry until pale golden, 30 seconds to 1 minute, and transfer with slotted spoon to paper towels. Toss fries with garlic in a large bowl.",
        "Transfer steak to a cutting board and let stand 5 minutes. Slice steak and serve with fries."
    ],
    "ingredients": [
        "About 3 cups vegetable oil",
        "2 (1 1/4-inch-thick) boneless top loin (New York strip) steaks (about 1 lb each)",
        "3 1/8 teaspoons spice rub for beef",
        "1 (1-lb) package frozen french fries",
        "2 large garlic cloves, thinly sliced lengthwise",
        "Special equipment: a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Potato",
        "Fry",
        "Sauté",
        "Quick & Easy",
        "Steak",
        "Gourmet"
    ],
    "title": "Spice-Rubbed Steak with Quick Garlic Fries",
    "url": "http://www.epicurious.com/recipes/food/views/spice-rubbed-steak-with-quick-garlic-fries-234266"
}
