{
    "directions": [
        "Stir together Sherry, cornstarch, and 1 tablespoon soy sauce, then stir in sesame oil. Add pork, stirring to coat well, and let stand 10 minutes.",
        "Stir together sugar and remaining 2 tablespoons soy sauce.",
        "Heat a wok or large nonstick skillet over high heat until a bead of water dropped on cooking surface evaporates immediately. Add 1 1/2 tablespoons peanut oil, swirling wok to coat evenly, then stir-fry 1 teaspoon ginger, 1 teaspoon garlic, and 1/4 teaspoon pepper flakes until fragrant, about 5 seconds. Add bell pepper and stir-fry 2 minutes. Add snow peas and cashews and stir-fry until snow peas are crisp-tender, 1 to 2 minutes. Transfer vegetables to a bowl.",
        "Heat remaining 1 1/2 tablespoons peanut oil in wok until just smoking, then stir-fry remaining ginger, garlic, and pepper flakes until fragrant, about 5 seconds. Add pork and stir-fry, separating strips, until browned and barely cooked through, 2 to 3 minutes. Add vegetables and sweetened soy sauce, then stir-fry until vegetables are just heated through, about 1 minute more."
    ],
    "ingredients": [
        "1 tablespoon medium-dry Sherry",
        "2 teaspoons cornstarch",
        "3 tablespoons soy sauce",
        "2 teaspoons Asian sesame oil",
        "3/4 lb boneless pork loin, thinly sliced, then cut into 2- by 1/4-inch strips",
        "1 teaspoon sugar",
        "3 tablespoons peanut oil",
        "2 teaspoons minced peeled fresh ginger",
        "2 teaspoons minced garlic",
        "1/2 teaspoon dried hot red pepper flakes",
        "1 large red bell pepper, cut into 1/4-inch-thick strips",
        "1/2 lb snow peas, trimmed",
        "1 cup salted roasted cashews",
        "Accompaniment: rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Ginger",
        "Nut",
        "Pepper",
        "Pork",
        "Vegetable",
        "Stir-Fry",
        "Dinner",
        "Cashew",
        "Bell Pepper",
        "Summer",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Spicy Pork and Cashew Stir-Fry with Snow Peas and Red Pepper",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-pork-and-cashew-stir-fry-with-snow-peas-and-red-pepper-104637"
}
