{
    "directions": [
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the rotini, and return to a boil. Cook uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 6 minutes. Drain well in a colander set in the sink.",
        "Place a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Add the broccoli rabe, recover, and steam until just tender, about 2 minutes depending on thickness.",
        "Place the Italian sausage into a large skillet over medium heat, and cook until browned and no longer pink inside, about 5 minutes. Remove sausage from pan and set aside; drain excess grease, leaving about 1 tablespoon of sausage drippings in the pan. Sprinkle in the garlic, and cook until it starts to brown, about 1 minute; stir in half the broccoli rabe. Cook and stir until the rabe has wilted, and add the remaining rabe and the diced tomatoes. Cook until all the rabe is tender, about 5 minutes; sprinkle with salt and black pepper.",
        "Return the sausage to the skillet, and cook just until the meat is hot; sprinkle with Parmesan cheese, crushed red pepper flakes, and a drizzle of olive oil. Serve over hot rotini."
    ],
    "ingredients": [
        "8 ounces whole wheat rotini pasta",
        "3 bunches broccoli rabe, trimmed",
        "4 (4 ounce) links hot Italian sausage, cut into 1 inch pieces",
        "1 tablespoon sausage drippings",
        "2 garlic cloves, chopped",
        "1 (14.5 ounce) can diced tomatoes",
        "salt and ground black pepper to taste",
        "1/2 cup grated Parmesan cheese",
        "1/4 teaspoon crushed red pepper flakes",
        "1 teaspoon olive oil, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Sausage Broccoli Rabe Parmesan",
    "url": "http://allrecipes.com/recipe/218054/spicy-sausage-broccoli-rabe-parmesan/"
}
