{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Line a large baking sheet with aluminum foil.",
        "Place squash in a large bowl; drizzle with olive oil and toss to coat. Spread the squash in a single layer on prepared baking sheet. Season with salt and pepper.",
        "Roast squash in prepared oven for 20 minutes; turn. Continue roasting until softened, 10 to 20 minutes more.",
        "Place the chopped bacon into a heavy pot and cook over medium-high heat, stirring occasionally, until brown and crisp, about 8 minutes. Remove bacon with a slotted spoon and transfer to a paper towel-lined plate to drain. Reserve the bacon drippings.",
        "Place the pot over medium heat; add the onion, pears, garlic, rosemary, and thyme and cook in the bacon drippings until onions and pears are soft, 3 to 5 minutes. Add the roasted squash and cook another 5 minutes. Add Swanson(R) Chicken Broth, nutmeg, cinnamon, and chipotle pepper; simmer on medium-low until ingredients are very soft and flavors have combined, about 10 minutes.",
        "Puree the soup in a blender or food processor in small batches.",
        "Ladle soup into serving bowls and garnish with crumbled bacon and a generous dollop of sour cream. Enjoy!"
    ],
    "ingredients": [
        "1 (3 pound) butternut squash - peeled, seeded, and cubed",
        "salt and ground black pepper to taste",
        "1 tablespoon olive oil",
        "8 strips maple-flavored bacon, chopped",
        "1 large white onion, chopped",
        "2 red pears - peeled, seeded, and chopped",
        "2 cloves fresh garlic, minced",
        "1 tablespoon chopped fresh rosemary",
        "1 teaspoon dried thyme",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground dried chipotle pepper",
        "3 cups Swanson® Chicken Broth",
        "sour cream for garnish (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Roasted Butternut Squash, Pear, and Bacon Soup",
    "url": "http://allrecipes.com/recipe/244658/spicy-roasted-butternut-squash-pear/"
}
