{
    "directions": [
        "With a mortar and pestle or in an electric spice grinder grind cuminseed, cinnamon stick pieces, and cloves and in a small bowl mix with paprika, cayenne, and salt to taste. In a non-aluminum container large enough to hold chickens stir together garlic paste, zest, lemon juice, oil, and 2 tablespoons spice mixture (reserving remainder) to make marinade.",
        "Rinse chickens and pat dry with paper towels. Put chickens in container and rub with marinade to coat. Marinate chickens, covered and chilled, at least 2 hours or overnight.",
        "Preheat oven to 450°F.",
        "Put half of chickens in each of 2 large roasting pans. Brush chickens with any marinade left in container and season chickens with salt. If using poussins, truss and arrange breast sides up (they should fit without touching). If using chicken quarter, arrange skin sides up.",
        "Sprinkle chickens with reserved spice mixture.",
        "Roast chickens in upper and lower thirds of oven 20 minutes. In a small saucepan melt butter. Brush chickens with butter and sprinkle with chopped parsley. Switch pans between upper and lower racks and roast chickens 20 to 30 minutes more, or until a meat thermometer inserted in fleshy part of a thigh register 175°F. and juices run clear when thigh is pierced with a skewer.",
        "Serve chickens warm or at room temperature and garnish with parsley sprigs."
    ],
    "ingredients": [
        "2 tablespoons cuminseed",
        "a 3-inch cinnamon stick, broken into pieces",
        "10 whole cloves",
        "1/4 cup paprika",
        "3/4 teaspoon cayenne",
        "twelve 3/4-pound poussins (baby chickens) or three 3-pound chickens, quartered",
        "3 garlic cloves, chopped and mashed to a paste with 1 teaspoon salt",
        "1 tablespoon freshly grated lemon zest",
        "2 tablespoons fresh lemon juice",
        "2 tablespoons olive oil",
        "1/2 stick (1/4 cup) unsalted butter",
        "2 tablespoons chopped fresh parsley leaves",
        "Garnish: parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Appetizer",
        "Marinate",
        "Roast",
        "Lemon",
        "Chill",
        "Cinnamon",
        "Clove",
        "Gourmet"
    ],
    "title": "Spiced Poussins",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-poussins-10177"
}
