{
    "directions": [
        "Roll out 1 pie crust disk on floured surface to 13 1/2-inch round. Transfer to 9-inch glass pie dish. Trim overhang to 1 inch. Refrigerate crust while preparing filling.",
        "Position rack in center of oven; preheat to 375°F. Place foil-lined baking sheet in bottom of oven to catch any spills. Mix 3 tablespoons sugar and 1/4 teaspoon cinnamon in small bowl; set aside. Whisk 1 cup sugar, 1 1/2 teaspoons cinnamon, and next 6 ingredients in large bowl. Scrape in seeds from vanilla bean. Add plums and toss to coat. Spoon filling into crust, mounding slightly in center.",
        "Roll out second pie crust disk on floured surface to 13 1/2-inch round. Drape crust over filling; trim overhang to 1 inch. Press top and bottom crust edges together. Fold edges under; crimp. Using sharp knife, cut four 2-inch-long slits in center of top crust to allow steam to escape. Brush crust (but not edges) with cream. Sprinkle reserved cinnamon sugar over crust.",
        "Bake pie 30 minutes. Tent pie loosely with foil to prevent overbrowning. Continue to bake until filling bubbles thickly through slits, about 1 hour longer. Cool completely on rack."
    ],
    "ingredients": [
        "2 Tender Pie Crust dough disks",
        "3 tablespoons plus 1 cup sugar",
        "1 3/4 teaspoons ground cinnamon, divided",
        "2 tablespoons cornstarch",
        "2 teaspoons (packed) finely grated orange peel",
        "3/4 teaspoon ground cardamom",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon ground cloves",
        "1/4 teaspoon salt",
        "1/2 vanilla bean, split lengthwise",
        "2 1/2 pounds plums, halved, pitted, each half cut into 4 wedges",
        "2 tablespoons whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fruit",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Mother's Day",
        "Back to School",
        "Plum",
        "Vanilla",
        "Fall",
        "Summer",
        "Clove",
        "Nutmeg",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Plum Pie",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-plum-pie-232397"
}
