{
    "directions": [
        "Bring celery root and milk to boil in heavy large saucepan over high heat. Reduce heat and simmer uncovered until celery root is very tender, about 20 minutes. Using slotted spoon, transfer celery root to processor. Add 1/2 cup hot milk. Puree until very smooth. Blend in butter and lemon juice. Season with salt and white pepper. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Sauté bacon in medium saucepan over medium-high heat until crisp, about 3 minutes. Add carrots, shallots, and rosemary; sauté until shallots begin to soften, about 1 minute. Add lentils and 3 cups water; bring to boil. Reduce heat and simmer uncovered until lentils are tender and liquid has nearly evaporated, about 35 minutes. Stir in butter. Season with salt and pepper. (Can be made 1 day ahead. Cover and chill.)",
        "Preheat oven to 400°F. Whisk first 4 ingredients in bowl. Sprinkle pork with salt and pepper. Heat oil in large ovenproof skillet over medium heat. Add pork; sauté until brown on all sides, about 6 minutes total. Brush pork with honey mixture. Transfer skillet to oven; roast pork 10 minutes. Turn pork over and brush with honey mixture. Roast until thermometer inserted into center of pork registers 145°F, about 10 minutes longer. Transfer pork to work surface; tent with foil (temperature will increase 5 degrees).",
        "Add broth and remaining honey mixture to same skillet. Boil over high heat until sauce is reduced to 3/4 cup, about 5 minutes. Strain sauce into small bowl. Return sauce to skillet. Whisk in butter. Season with salt and pepper.",
        "Rewarm celery root puree and lentils. Cut pork crosswise into 1/2-inch-thick slices. Place 1/2 cup celery root puree in center of each of 6 plates. Using back of spoon, make indentation in puree. Spoon 1/2 cup lentils into indentation on each plate. Arrange pork slices atop lentils and drizzle with sauce."
    ],
    "ingredients": [
        "2 pounds celery root (celeriac), peeled, cut into 2-inch cubes",
        "5 cups whole milk",
        "2 tablespoons (1/4 stick) butter",
        "1 teaspoon fresh lemon juice",
        "Ground white pepper",
        "3 bacon slices, chopped",
        "1/4 cup 1/8-inch cubes peeled carrots",
        "1/4 cup chopped shallots",
        "1/4 teaspoon minced fresh rosemary",
        "1 1/2 cups dried lentils",
        "3 cups water",
        "1 teaspoon butter",
        "1/2 cup honey",
        "6 tablespoons red wine vinegar",
        "1 tablespoon curry powder",
        "1 1/2 teaspoons cayenne pepper",
        "2 1/2 pounds pork tenderloins",
        "1 tablespoon olive oil",
        "3/4 cup low-salt chicken broth",
        "1 tablespoon cold butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Roast",
        "Sauté",
        "Vinegar",
        "Rosemary",
        "Bacon",
        "Curry",
        "Celery",
        "Lentil",
        "Fall",
        "Honey"
    ],
    "title": "Spiced Pork with Celery Root Purée and Lentils",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-pork-with-celery-root-puree-and-lentils-108575"
}
