{
    "directions": [
        "In a cheesecloth-lined sieve set over a bowl drain yogurt, chilled, 1 hour. Discard liquid.",
        "Wearing rubber gloves, seed and devein jalapeños, reserving 1/4 teaspoon seeds. Cut chilies into pieces and in a blender purée with reserved chili seeds, coriander, fennel, and cumin seeds, and water until smooth.",
        "Thinly slice shallots. In a skillet heat oil over moderate heat until hot but not smoking and cook shallots, stirring occasionally, until golden. With a slotted spoon transfer shallots to paper towels to drain and season with salt. In oil remaining in skillet cook chili purée, stirring frequently, until liquid evaporates, about 3 minutes, and cool completely.",
        "Chop separately mint, parsley, and peanuts and in a bowl stir together with yogurt, chili purée, lime zest and juice, and salt and pepper to taste. Dip may be made 2 days ahead and chilled, covered. Chill shallots separately in an airtight container.",
        "Top dip with shallots and serve with chips and vegetables."
    ],
    "ingredients": [
        "2 cups plain yogurt",
        "4 fresh jalapeño chilies",
        "1 1/2 tablespoons coriander seeds",
        "2 teaspoons fennel seeds",
        "1 teaspoon cumin seeds",
        "1/4 cup water",
        "2 shallots",
        "3 tablespoons vegetable oil",
        "1/2 cup fresh mint leaves",
        "1/2 cup fresh flat-leafed parsley leaves",
        "1/4 cup dry-roasted peanuts",
        "1 teaspoon finely grated fresh lime zest",
        "1 tablespoon fresh lime juice",
        "potato chips",
        "assorted raw vegetables such as cherry tomatoes, trimmed radishes, cucumber spears, celery sticks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Blender",
        "Cocktail Party",
        "Vegetarian",
        "Quick & Easy",
        "Yogurt",
        "Lime",
        "Mint",
        "Peanut",
        "Spice",
        "Summer",
        "Jalapeño",
        "Parsley",
        "Gourmet"
    ],
    "title": "Spicy Yogurt Dip with Chips and Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-yogurt-dip-with-chips-and-vegetables-14158"
}
