{
    "directions": [
        "Line a baking sheet with parchment paper. Mix sugar and spices in a small bowl. Unfold pastry on a lightly floured work surface into a 14x10\" rectangle, rolling out if needed. Brush lightly with butter. Sprinkle 1/4 cup spiced sugar over. Cut in half lengthwise.",
        "Fold both long sides of 1 pastry strip so that outer edges meet in the center of strip. Brush with more butter; sprinkle with 2 tablespoons spiced sugar. Fold in half lengthwise, forming a 14\"-long log about 1\" wide. Repeat with remaining pastry strip.",
        "Place logs on prepared baking sheet, cover with plastic wrap, and chill until firm, about 30 minutes. DO AHEAD: Palmier dough can be prepared 2 weeks ahead. Store airtight in freezer. Thaw overnight in refrigerator before continuing.",
        "Preheat oven to 425°F. Line 2 baking sheets with parchment paper. Cut each log crosswise into 1/4\" slices. Lay slices flat on prepared baking sheets, spacing 1\" apart.",
        "Bake palmiers until golden on bottom, about 8 minutes. Using a thin metal spatula, turn palmiers over. Brush lightly with butter; sprinkle with more spiced sugar. Bake until sugar is bubbly and pastry is golden brown, about 15 minutes longer. Transfer palmiers to a wire rack; let cool. DO AHEAD: Palmiers can be made 2 days ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "1/2 cup sugar",
        "4 teaspoons ground cinnamon",
        "1 tablespoon ground cardamom",
        "2 teaspoons ground allspice",
        "1 teaspoon ground cloves",
        "1 14-ounce package frozen puff pastry (such as Dufour), thawed",
        "All-purpose flour (for dusting)",
        "3 tablespoons unsalted butter, melted, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Christmas",
        "Vegetarian",
        "New Year's Eve",
        "Spice",
        "Fall",
        "Winter",
        "Cinnamon",
        "Clove",
        "Christmas Eve",
        "Phyllo/Puff Pastry Dough",
        "Cardamom",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Palmiers",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-palmiers-51134460"
}
