{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x14-inch baking dish.",
        "Mix flour, garlic powder, mustard, paprika, cayenne pepper, celery salt, ground ginger, oregano, basil, salt, and pepper together in a shallow dish.",
        "Dredge pork chops in the flour mixture to coat. Reserve remaining flour mixture.",
        "Heat olive oil in a skillet over medium heat. Cook pork chops in hot oil until browned, 3 to 5 minutes per side. Transfer pork chops to prepared baking dish, reserving any drippings in the skillet.",
        "Stir sherry, water, and brown sugar together until sugar dissolves; pour over pork chops.",
        "Bake in preheated oven until tender and no longer pink in the center, 40 to 45 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Move pork chops to a plate and cover with aluminum foil to keep warm. Pour liquid from baking dish into the skillet with reserved drippings.",
        "Place skillet with drippings mixture to medium-low heat. Stir cream into the drippings. Cook and stir, gradually integrating reserved flour mixture, until the mixture begins to thicken. Serve as a gravy for the pork chops."
    ],
    "ingredients": [
        "1/2 cup all-purpose flour",
        "1 teaspoon garlic powder",
        "1 teaspoon ground mustard",
        "1 teaspoon paprika",
        "1/2 teaspoon cayenne pepper",
        "1/4 teaspoon celery salt",
        "1/4 teaspoon ground ginger",
        "1/8 teaspoon dried oregano",
        "1/8 teaspoon dried basil",
        "1/8 teaspoon salt",
        "1 pinch ground black pepper",
        "2 (1-inch thick) bone-in pork loin chops",
        "1 1/2 teaspoons vegetable oil",
        "3/4 cup dry sherry",
        "3/4 cup water",
        "2 tablespoons packed brown sugar",
        "1/4 cup heavy whipping cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spiced Pork Chops II",
    "url": "http://allrecipes.com/recipe/229521/spiced-pork-chops-ii/"
}
