{
    "directions": [
        "Combine 1/2 cup pistachios and 1/3 cup sugar in processor and blend until pistachios are chopped. DO AHEAD Can be made 3 days ahead. Store airtight at room temperature.",
        "Blend flour, sugar, and salt in processor. Add butter; pulse until mixture resembles coarse meal. Add 2 tablespoons ice water; pulse until mixture begins to clump, adding more ice water by teaspoonfuls if dry. Gather into ball; flatten into disk. Wrap in plastic and chill overnight. DO AHEAD Can be made 2 days ahead. Keep chilled. Soften slightly at room temperature before rolling out.",
        "Roll out dough on lightly floured surface to 13-inch round. Transfer to 9-inch-diameter tart pan with removable bottom. Trim overhang to 3/4 inch. Fold in and press, forming double-thick sides and pressing up 1/4 inch above pan sides. Pierce all over with fork. Chill 30 minutes, then freeze 15 minutes.",
        "Position rack in center of oven and preheat to 400°F. Bake crust until golden, piercing with fork if crust bubbles, about 30 minutes. Cool on rack. DO AHEAD Can be made 1 day ahead. Cover with foil; store at room temperature.",
        "Combine first 7 ingredients in large skillet; bring to boil, stirring until sugar dissolves. Add pears; bring to boil. Reduce heat to medium-low; cover and simmer until pears are tender when pierced with knife, turning occasionally, 15 to 20 minutes depending on ripeness. Using slotted spoon, transfer pears to 13x9x2-inch glass baking dish in single layer. Add cranberries to liquid in skillet; simmer until berries begin to soften but remain intact, about 4 minutes. Using slotted spoon, transfer cranberries to plate in single layer. Cover; chill at least 3 hours. Boil poaching liquid in skillet until reduced to 1 1/4 cups, stirring often, about 10 minutes. DO AHEAD Pears, cranberries, and syrup can be made 1 day ahead. Cover separately; chill. Bring syrup to room temperature; whisk before using.",
        "Drain pears on paper towels 10 minutes. Brush bottom of crust with 2 tablespoons poaching syrup; sprinkle pistachio sugar over. Starting at outer edges of crust, arrange pears closely in starburst pattern with stem ends toward center. Arrange remaining pears in center. Brush pears lightly with some of syrup. Toss cranberries with 1 tablespoon syrup; scatter over pears. Sprinkle with 1 tablespoon chopped pistachios. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature.",
        "Serve tart with vanilla ice cream."
    ],
    "ingredients": [
        "1/2 cup unsalted natural pistachios",
        "1/3 cup sugar",
        "1 1/2 cups all purpose flour",
        "3 tablespoons powdered sugar",
        "1/2 teaspoon salt",
        "10 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "2 tablespoons (or more) ice water",
        "3 cups dry red wine",
        "1 3/4 cups sugar",
        "1 1/2 cups water",
        "3 tablespoons fresh lemon juice",
        "1 teaspoon (packed) finely grated lemon peel",
        "6 whole cloves",
        "1 cinnamon stick, broken in half",
        "4 large slightly underripe Bosc pears (about 2 1/2 pounds), peeled, halved, cored, each half cut into 3 long wedges",
        "1 cup fresh or frozen cranberries",
        "1 tablespoon chopped unsalted natural pistachios",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Berry",
        "Citrus",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Poach",
        "Christmas",
        "Cranberry",
        "Pear",
        "Fall",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Cranberry-Pear Tart",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-cranberry-pear-tart-236595"
}
