{
    "directions": [
        "Lightly brush tuna steaks with some additional oil and season with salt. Crush fennel seeds and peppercorns coarse in a mortar with a pestle and press onto both sides of tuna steaks. Let tuna steaks stand on a plate 10 minutes.",
        "In a heavy non-stick skillet sauté fennel bulb in 1 1/2 tablespoons oil over moderately high heat, stirring, until golden. Add bell pepper and garlic and sauté 1 minute. Add water and simmer vegetables, covered, 10 minutes, or until fennel is tender. Remove lid and, if necessary, boil mixture until liquid is nearly evaporated. Add lemon juice and salt and pepper to taste and keep warm.",
        "While fennel mixture is cooking, brush a heavy skillet, preferably cast-iron, with some additional oil and heat over moderately high heat until hot but not smoking. Sauté tuna steaks 2 minutes on each side, or until barely pink in center, for medium meat. Transfer tuna steaks to plates and spoon fennel-pepper mixture over and around them."
    ],
    "ingredients": [
        "two 6-ounce tuna steaks, each 1 inch thick",
        "1 1/2 tablespoons olive oil plus additional oil for brushing",
        "1 tablespoon fennel seeds",
        "1 1/2 teaspoons black peppercorns",
        "1 medium fennel bulb (sometimes called anise, about 1 pound), trimmed and cut into 1/4-inch crosswise slices",
        "1 medium red bell pepper, quartered and cut into 1/4-inch slices",
        "2 large garlic cloves, sliced thin",
        "1/2 cup water",
        "1 tablespoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauté",
        "Quick & Easy",
        "Low Cal",
        "Low/No Sugar",
        "Wheat/Gluten-Free",
        "Tuna",
        "Fennel",
        "Bell Pepper",
        "Gourmet"
    ],
    "title": "Spiced Tuna Steaks with Fennel and Red Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-tuna-steaks-with-fennel-and-red-peppers-10499"
}
