{
    "directions": [
        "Preheat the oven to 400°F with 1 rack on the bottom rung and 1 rack in the center of oven. Place 1 rimmed baking sheet on the bottom rack to preheat.",
        "In the bowl of a food processor, pulse 1 1/4 cups flour, sugar, and salt. Add butter and shortening and pulse until coarse, pea-sized crumbs form, about 10 seconds. With the machine running, add 2 tablespoons ice water and process until the dough just holds together, about 30 seconds. Squeeze a small amount of dough between your fingers: If it is very crumbly, add pulse in more ice water, 1 tablespoon at a time (2 tablespoons maximum). Do not over process.",
        "Turn dough out onto a lightly floured surface and push together into a rough ball. Knead a few times to combine, then flatten into a disc with smooth edges (no cracks), cover with plastic wrap, and refrigerate at least 1 hour or overnight.",
        "Meanwhile, cut the squash in half horizontally. Scoop out and discard the seeds. Place the squash, cut-side down, on a rimmed baking sheet and add a splash of water to the pan. Bake in center of oven until the squash flesh is easily pierced with a knife, about 1 hour. Remove from the oven, and allow to cool. Reduce the oven to 375°F.",
        "Meanwhile, roll out the dough into a 13-inch round on a lightly floured surface. Roll the dough loosely around the rolling pin then unfurl it into the 9-inch pie pan. Lightly press it into the pan. Leave 1 inch of dough hanging over the edge, trimming any excess dough. Tuck the dough under itself, then crimp the edge as desired. Chill at least 30 minutes.",
        "In a medium bowl, whisk together the flour, sugar, cinnamon, salt, and baking powder to combine. Add the butter and massage with your fingertips until the mixture becomes clumpy and moist. Add the pumpkin seeds and mix until incorporated. Chill at least 30 minutes.",
        "When the squash is cool enough to handle, scoop out enough flesh to measure 2 1/4 cups and place in a blender. (Discard the skins and reserve extra squash flesh for another use.) Add cream, sugar, molasses, eggs, vanilla, ginger, cinnamon, nutmeg, and salt to the blender. Puree until filling is smooth and creamy.",
        "Pour the filling into the unbaked pie shell (do not overfill) and smooth the top with a rubber spatula. Sprinkle the top with the crumble mixture. Place on preheated rimmed baking sheet on bottom rung of oven. After 30 minutes, rotate baking sheet and move to center rung of oven. Bake until the filling is set and the crumble topping is golden brown, 25 to 35 minutes more. (Cover the crust edge with foil or a pie shield if it starts to brown too much.) Transfer pie to a wire rack and cool completely, about 3 hours. Pie will keep up to 2 days, loosely covered with foil, at room temperature."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour, plus more for rolling",
        "2 1/4 teaspoons granulated sugar",
        "1/2 teaspoon kosher salt",
        "1/2 stick (4 tablespoons) unsalted butter, cut into pieces and frozen for 15 minutes",
        "1/4 cup solid vegetable shortening, cut into pieces and refrigerated for 15 minutes",
        "One 2 1/2-pound kabocha squash",
        "1 1/4 cups heavy cream",
        "1/2 cup packed light brown sugar",
        "2 tablespoons molasses",
        "3 large egg yolks plus 1 whole egg, room temperature",
        "1 teaspoon vanilla extract",
        "3/4 teaspoon ground ginger",
        "3/4 teaspoon ground cinnamon",
        "1/4 teaspoon nutmeg",
        "1/2 teaspoon salt",
        "1/2 cup all-purpose flour",
        "1/3 cup light brown sugar",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon kosher salt",
        "1/8 teaspoon baking powder",
        "3/4 stick (6 tablespoons) unsalted butter, cut into small pieces",
        "1/2 cup shelled, roughly chopped, and toasted pumpkin seeds (pepitas)",
        "9-inch pie pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Thanksgiving",
        "Squash",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Kabocha Squash Pie With Pumpkin-Seed Crumble",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-kabocha-squash-pie-with-pumpkin-seed-crumble-51257280"
}
