{
    "directions": [
        "For the shrimp: In a large bowl, combine the shrimp with the soy sauce, Ginger-Garlic Paste, sambal and cornstarch. Mix well to coat the shrimp. Cover and refrigerate for 15 minutes.",
        "For the egg crepes: In a bowl, whisk together the eggs, soy sauce and 1/4 teaspoon water. Set a medium nonstick skillet over medium-low heat and coat it lightly with peanut oil. Pour in half the egg mixture and swirl the pan so the egg coats the bottom. Cook over low heat until firm, then carefully turn with a spatula and finish cooking on the other side, about 45 seconds per side. Transfer the egg crepe to a plate to cool. Repeat with remaining egg mixture. When the crepes are cool enough to handle, stack, roll and slice them into thin julienne strips. Set aside until ready to use.",
        "For the fried rice: Set a large wok or large nonstick skillet over high heat and swirl in 1 tablespoon of the peanut oil. Add the marinated shrimp and stir fry until slightly pink, about 2 minutes. Transfer the shrimp to a plate and set aside. Reduce the heat to medium and add the remaining 2 tablespoons peanut oil. Add the onions, celery and Ginger-Garlic Paste and stir fry until softened and fragrant, about 3 minutes. Add the sesame oil and the rice and stir fry until hot and a little crispy, about 2 minutes, breaking up the rice with a wooden spoon as you go. Fold in the peas, edamame, pineapple and bean sprouts and continue to stir fry until the vegetables heated through, about 2 minutes more. Stir in the soy sauce and sambal. Fold in the cooked shrimp and the sliced egg crepe. Transfer to a serving platter and garnish with chopped scallions.",
        "Pulse the garlic and ginger in a food processor. With the processor running, stream in the canola oil and process to a paste. (You'll need 3 tablespoons of the paste for the above recipe. Refrigerate remaining paste for up to a week.)"
    ],
    "ingredients": [
        "1 pound medium (21/25 count) shrimp, shells and tails removed, deveined, halved lengthwise, then crosswise",
        "2 tablespoons Ginger-Garlic Paste, recipe follows",
        "2 teaspoons sambal oelek (Asian chile-garlic sauce)",
        "1/2 cup soy sauce",
        "1 teaspoon cornstarch",
        "3 large eggs",
        "1 teaspoon soy sauce",
        "Peanut oil",
        "3 tablespoons peanut oil",
        "1/2 medium yellow onion, diced",
        "1/4 cup finely diced celery",
        "1 tablespoon Ginger-Garlic Paste, recipe follows",
        "2 tablespoons toasted sesame oil",
        "4 cups cold cooked white rice",
        "1/2 cup frozen peas, thawed",
        "1/2 cup frozen shelled edamame, thawed",
        "1 cup diced fresh pineapple",
        "1 cup bean sprouts",
        "1/4 cup soy sauce",
        "2 tablespoons sambal oelek",
        "3 scallions, chopped",
        "1/2 cup garlic cloves, peeled",
        "1/2 cup fresh ginger, broken into broken pieces",
        "2 tablespoons canola oil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Spicy Shrimp",
        "Shellfish Recipes",
        "Shrimp",
        "Wok Recipes",
        "Fried Rice",
        "Fruit",
        "Pineapples",
        "Rice Recipes",
        "Main Dish Recipes",
        "Stir-Frying Recipes"
    ],
    "title": "Spicy Shrimp and Pineapple Fried Rice",
    "url": "http://www.foodnetwork.com/recipes/guy-fieri/spicy-shrimp-and-pineapple-fried-rice"
}
