{
    "directions": [
        "Preheat oven to 350°F. Butter and flour 9-inch-diameter springform pan with 2 3/4-inch-high sides. Sift first 7 ingredients into small bowl. Using electric mixer, beat butter in large bowl until fluffy. Add brown sugar and beat until well blended. Beat in egg yolks. Beat in flour mixture in 3 additions alternately with sour cream in 2 additions. Using clean dry beaters, beat egg whites in medium bowl until stiff but not dry; fold into batter in 2 additions. Transfer batter to prepared pan.",
        "Bake cake until top is golden and tester inserted into center comes out clean, about 45 minutes. Cool cake 10 minutes. Cut around pan sides; release pan sides. Cool cake completely on rack.",
        "Mix berries and sugar in bowl. Mash fruit coarsely with fork. Let stand 20 minutes and up to 1 hour.",
        "Beat cream cheese and butter in large bowl until fluffy. Beat in sugar, then sour cream and vanilla.",
        "Cut cake horizontally into 3 equal layers. Place bottom layer, cut side up, on platter. Spread 1 cup frosting over. Spread half of filling (about 3/4 cup) over frosting, leaving 1/4-inch plain border at edge. Top with second cake layer and 1 cup frosting, then remaining filling. Top with third cake layer, cut side down. Spread remaining frosting over top and sides of cake. Refrigerate until frosting sets, about 1 hour. (Can be made 1 day ahead. Cover loosely; keep chilled until 1 hour before serving.) Garnish cake with 1/2 pint berries."
    ],
    "ingredients": [
        "2 cups cake flour",
        "2 teaspoons ground cinnamon",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon ground nutmeg",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 1/2 cups (packed) golden brown sugar",
        "3 large eggs, separated",
        "1 cup sour cream",
        "3 1/2-pint baskets blackberries",
        "1/4 cup sugar",
        "1 1/2 8-ounce packages cream cheese, room temperature",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "5 cups powdered sugar (about 1 1/4 pounds)",
        "2 tablespoons sour cream",
        "1 teaspoon vanilla extract",
        "1 1/2-pint basket blackberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Blackberry",
        "Spice",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spice Cake with Blackberry Filling and Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/spice-cake-with-blackberry-filling-and-cream-cheese-frosting-105326"
}
