{
    "directions": [
        "Mix flour, sugar and salt in processor. Add shortening and butter. Using on/off turns, process until mixture resembles coarse meal. Transfer flour mixture to large bowl. Combine 7 tablespoons ice water and 2 1/2 teaspoons vinegar in small bowl; pour over flour mixture. Stir with fork until moist clumps form, adding more water by teaspoonfuls if needed. Gather dough into ball; divide into 2 pieces. Flatten each into disk. Wrap each separately in plastic; chill 20 minutes.",
        "Preheat oven to 400°F. Mix all ingredients in large bowl; toss. Roll out 1 dough disk on lightly floured surface to 13-inch round. Transfer to 9-inch-diameter deep-dish glass pie dish. Trim overhang to 1 inch. Spoon filling into dough-lined dish. Roll out second dough disk on lightly floured surface to 13-inch round. With star cookie cutter, cut out several stars from center of crust. Fold crust in half and transfer to top of filling. Unfold crust. Press top and bottom crust edges together to seal. Crimp edges decoratively. Place cutout stars around edge of crust.",
        "Bake pie until apples are tender and juices are bubbling thickly, covering edges with foil if browning too quickly, about 1 hour 45 minutes. Cool on rack 1 hour. (Can be made 8 hours ahead. Let stand on rack.) Serve with ice cream."
    ],
    "ingredients": [
        "3 cups all purpose flour",
        "2 tablespoons sugar",
        "1 1/4 teaspoons salt",
        "3/4 cup chilled solid vegetable shortening, diced",
        "9 tablespoons chilled unsalted butter, diced",
        "7 tablespoons (about) ice water",
        "2 1/2 teaspoons apple cider vinegar",
        "4 pounds Granny Smith apples, peeled, cored, cut into 1/2-inch cubes",
        "3/4 cup sugar",
        "1/2 cup golden raisins",
        "3 tablespoons all purpose flour",
        "2 tablespoons minced crystallized ginger",
        "2 tablespoons (packed) dark brown sugar",
        "2 teaspoons ground cinnamon",
        "1/4 cup (1/2 stick) unsalted butter, melted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Dried Fruit",
        "Raisin",
        "Apple",
        "Spice",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Apple Pie with Raisins",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-apple-pie-with-raisins-104530"
}
