{
    "directions": [
        "1. Season the fillets on both sides with salt and pepper to taste. Grind the fennel seeds coarsely in a coffee or spice grinder, and mix them with the rosemary and orange zest. Press this mixture into the top (nonskin side) of each fillet. Let sit, refrigerated and covered, for up to 24 hours.",
        "2. When you're ready to cook, preheat the oven to 450°F. Preheat a large nonstick skillet over medium-high heat for 3 or 4 minutes. Add the oil or butter and, when it shimmers, place the fillets, coated side down, in the pan. Cook about 1 minute, or until the spice mixture forms a nicely browned crust.",
        "3. Turn the fillets and cook about a minute more, then transfer to the oven. Cook about 4 minutes for rare salmon, 5 to 6 minutes for medium-rare, and 8 minutes for well done.",
        "Seed-Rubbed Salmon: Combine 2 tablespoons raw, shelled pumpkin seeds (pepitas) and 2 tablespoons (roughly) dried porcini pieces in a coffee or spice grinder and grind to a coarse powder. Press some of the mixtue into the top (nonskin side) of each of the fillets and cook as above.",
        "Spice-Rubbed Salmon. Combine 1 tablespoon coriander seeds or ground coriander, 1/4 teaspoon whole or ground cloves, 1 1/2 teaspoons cumin seeds or ground cumin, and 1 teaspoon freshly grated nutmeg. Press some of the mixture into the top (nonskin) side of each of the fillets and cook as above.",
        "This technique will work with nearly any spice, herb, or other rub you can think of. Try curry powder; minced lemon zest and parsley; minced lime zest and cilantro; or ground nuts and shallots.",
        "Substitute whole or clarified butter, peanut oil, or a neutral oil such as grapeseed or canola for the olive oil."
    ],
    "ingredients": [
        "Four 6-ounce skinned salmon fillets",
        "Salt and freshly ground black pepper",
        "1 tablespoon fennel seeds",
        "1 tablespoon minced fresh rosemary",
        "1 tablespoon minced orange zest",
        "2 tablespoons olive oil or butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Roast",
        "Sauté",
        "Quick & Easy",
        "Orange",
        "Rosemary",
        "Salmon",
        "Spice",
        "Healthy"
    ],
    "title": "Spice-Rubbed Salmon",
    "url": "http://www.epicurious.com/recipes/food/views/spice-rubbed-salmon-103470"
}
