{
    "directions": [
        "Heat heavy large pot over medium heat. Add chile pieces; toast until aromatic and lighter in color around edges, pressing with potato masher or back of fork and turning pieces, about 2 minutes. Set aside one 2-inch piece of chile for garnish; transfer remaining pieces to medium bowl. Cover chiles in bowl with hot water; soak until soft, about 30 minutes.",
        "In same large pot, heat 1 1/2 tablespoons oil over medium-high heat. Add onion rings and garlic. Sauté until brown, about 4 minutes. Transfer to processor, leaving oil in pot. Add bread slice to pot; cook until golden, about 30 seconds per side. Transfer bread to processor (reserve pot). Add tomatoes to processor. Puree mixture until smooth. Transfer tomato puree to small bowl (do not clean processor).",
        "Drain ancho chiles and place in processor. Add 1/2 cup broth and 2 chipotle chiles. Puree until smooth.",
        "Add 1 tablespoon oil to reserved pot. Heat over medium-high heat. Add ancho chile puree; cook until puree thickens and darkens, stirring often, about 1 1/2 minutes. Add tomato puree. Simmer until thick, stirring often, about 4 minutes. Whisk in pumpkin and 3 cups broth. Bring to boil. Reduce heat to medium-low. Simmer until mole thickens and reduces to 3 1/3 cups, about 30 minutes. Whisk in cream and sugar. Season to taste with salt.",
        "Puree 2 tablespoons oil and 2 chipotle chiles in small processor or force through sieve to make thick glaze. Transfer to bowl. (Mole and glaze can be made 3 days ahead. Cover separately and chill.)",
        "Prepare barbecue (medium-high heat). Rewarm mole. Spread chipotle glaze thinly over both sides of chicken breasts. Sprinkle chicken generously with salt. Grill until cooked through, about 5 minutes per side. Transfer chicken to plates. Spoon mole over each. Crumble reserved ancho chile piece; sprinkle over chicken. Garnish with cilantro sprigs and lime.",
        "*Dried ancho chiles and chipotle chiles canned in a spicy tomato sauce, sometimes called adobo, are available at Latin American markets, specialty foods stores, and some supermarkets."
    ],
    "ingredients": [
        "2 dried ancho chiles,* stemmed, seeded, torn into large pieces",
        "4 1/2 tablespoons vegetable oil",
        "1 3-inch-diameter slice white onion (1/2 inch thick), separated into rings",
        "2 garlic cloves, peeled",
        "1 5x3x1/2-inch-thick slice country white bread, crust trimmed",
        "3/4 cup drained canned diced tomatoes",
        "3 1/2 cups low-salt chicken broth",
        "4 canned chipotle chiles*",
        "1 cup canned pure pumpkin",
        "1/3 cup whipping cream",
        "2 teaspoons dark brown sugar",
        "8 skinless boneless chicken breast halves",
        "Fresh cilantro sprigs",
        "Lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Chicken",
        "Tomato",
        "Backyard BBQ",
        "Hot Pepper",
        "Pumpkin",
        "Summer",
        "Grill",
        "Grill/Barbecue"
    ],
    "title": "Spicy Grilled Chicken with Creamy Pumpkin Mole Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-grilled-chicken-with-creamy-pumpkin-mole-sauce-108581"
}
