{
    "directions": [
        "1. Heat the oil over medium-high heat in a large pot or Dutch oven. Cook the sausage until browned, about 5 minutes. Sprinkle the flour over the sausage and cook, stirring, until lightly toasted and the meat is well coated, about 2 minutes. Add the Cajun seasoning, garlic, peppers and onions and continue to cook until the vegetables are softened, 5 minutes. Add the clam juice, tomatoes and 4 cups water, scraping up any browned bits from the bottom of the pot, and increase the heat to bring to a simmer.",
        "2. Lower the heat slightly and simmer until the stew is thickened and the flavors are melded, about 30 minutes. Gently stir in the fish and shrimp. Cook, making sure the stew is not bubbling vigorously, stirring once or twice, until the shrimp and fish have just turned opaque, about 5 minutes. Remove from the heat and stir in the parsley. Season with salt and serve over rice."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "8 ounces smoked andouille sausage, diced (1 1/2 cups)",
        "1/4 cup all-purpose flour",
        "1 teaspoon Cajun seasoning",
        "3 cloves garlic, finely chopped",
        "2 bell peppers, red and/or green, chopped (about 2 1/2 cups)",
        "1 onion, chopped (about 1 1/2 cups)",
        "One 8-ounce bottle clam juice",
        "One 15-ounce can diced tomatoes",
        "1 pound firm white fish, such as halibut, grouper or black sea bass, cut into 1 1/2-inch pieces",
        "1 pound peeled and deveined large shrimp (21 to 25 shrimp)",
        "2 tablespoons chopped fresh parsley leaves",
        "Kosher salt",
        "Cooked white rice, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Shrimp Recipes",
        "Easy Recipes",
        "Shellfish Recipes",
        "Shrimp",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Spicy Shrimp",
        "American",
        "Cajun",
        "Stew Recipes",
        "Fish",
        "Andouille Sausage",
        "Sausage Recipes"
    ],
    "title": "Spicy Cajun Seafood Stew",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/spicy-cajun-seafood-stew-recipe"
}
