{
    "directions": [
        "Heat oil in a small saucepan over medium heat. Cook onion, stirring occasionally, until beginning to brown, 5–8 minutes. Add ketchup, dates, and beer; bring to a boil, reduce heat, and simmer, stirring occasionally and adding water as needed to prevent burning, until thick and slightly darkened, 20–25 minutes.",
        "Remove pan from heat and stir in vinegar. Let mixture cool slightly. Purée in a blender, thinning with water if needed, until smooth; season with salt and pepper. Let cool.",
        "DO AHEAD: Date ketchup can be made 5 days ahead. Cover and chill.",
        "Using your hands, gently mix onion, garlic, lamb, beef, parsley, and baharat in a large bowl; season with salt and pepper. Form scant 1/4-cupfuls of lamb mixture into twelve 2\"-diameter patties.",
        "Heat oil in a large skillet over mediumhigh heat. Place patties in skillet and immediately reduce heat to medium. Cook about 3 minutes per side for medium-rare. Serve patties on buns with date ketchup, lettuce, caramelized onions, and feta."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1/2 small red onion, finely chopped",
        "1 cup ketchup",
        "1 cup Medjool dates, pitted, chopped",
        "1/2 cup pale lager",
        "2 tablespoons apple cider vinegar",
        "Kosher salt, freshly ground pepper",
        "1/2 small red onion, finely chopped",
        "2 garlic cloves, finely chopped",
        "1 pound ground lamb",
        "8 ounces ground beef",
        "1/4 cup finely chopped fresh flat-leaf parsley",
        "1 tablespoon baharat (spice blend)",
        "Kosher salt, freshly ground pepper",
        "1 tablespoon vegetable oil",
        "12 slider buns, split, toasted",
        "Bibb lettuce, caramelized onions, and sliced feta (for serving)",
        "Baharat is available at Middle Eastern markets and online."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Lamb",
        "Brunch",
        "Kid-Friendly",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Ohio"
    ],
    "title": "Spiced Sliders with Date Ketchup",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-sliders-with-date-ketchup-51234020"
}
