{
    "directions": [
        "Whisk the cornstarch with 2 tablespoons rice wine in a medium bowl; add the beef, season with salt and pepper and toss to coat. Set aside for 15 minutes.",
        "Mix the remaining 1 tablespoon rice wine, the oyster sauce and sesame oil in a large bowl; set the bowl near the stove.",
        "Heat a wok or large nonstick skillet over high heat until very hot, about 1 minute. Add 3 tablespoons peanut oil, then the ginger, garlic and chiles; stir-fry until fragrant, about 1 minute. Add the beef and cook, stirring or shaking the skillet occasionally, 1 to 2 minutes. Transfer the beef with a slotted spoon to the sauce mixture and toss.",
        "If the pan is dry, add 1 tablespoon peanut oil, then add the onion and stir-fry until just soft, about 2 minutes. Add the bok choy and sugar; stir-fry until just wilted, 1 to 2 minutes. Return the beef and any juices to the pan and stir to combine. Serve over the rice.",
        "Photograph by Antonis Achilleos"
    ],
    "ingredients": [
        "1 tablespoon cornstarch",
        "3 tablespoons Chinese Shaoxing rice wine, dry sherry or white vermouth",
        "1 pound beef sirloin, thinly sliced against the grain into strips",
        "Kosher salt and freshly ground pepper",
        "2 tablespoons oyster sauce",
        "2 teaspoons toasted sesame oil",
        "3 to 4 tablespoons peanut oil",
        "1 1-inch piece fresh ginger, thinly sliced",
        "2 cloves garlic, smashed",
        "5 to 7 dried red chiles, halved",
        "1 small onion, thinly sliced",
        "8 heads baby bok choy, halved",
        "Pinch of sugar",
        "Cooked rice, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Healthy Dinner",
        "Healthy",
        "Healthy Lunch",
        "Beef",
        "Meat",
        "Rice Recipes",
        "High Fiber",
        "Gluten Free",
        "Diabetes-Friendly",
        "Low Calorie",
        "Stir-Frying Recipes"
    ],
    "title": "Spicy Beef Stir-Fry",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/spicy-beef-stir-fry-recipe"
}
