{
    "directions": [
        "Thinly slice onion and garlic. Peel sweet potatoes and cut lengthwise into 1/8-inch -thick slices. Diagonally cut potato slices into thin strips and diagonally halve snow peas. Cut water chestnuts crosswise into 1/8-inch-thick slices and season with salt and pepper. Diagonally cut scallions into thin slices. In a small bowl stir together broth, hoisin sauce, brandy, and cornstarch until combined well.",
        "Heat a wok or large heavy skillet over high heat until a bead of water dropped on cooking surface evaporates immediately. Add 2 tablespoons peanut oil, swirling wok or skillet to coat evenly, and heat until hot but not smoking. Add onion and stir-fry until softened. Add garlic and stir-fry until fragrant, about 30 seconds. Add sweet potatoes and stir-fry until just tender, 6 to 8 minutes. Add snow peas and water chestnuts and stir-fry until snow peas are crisp-tender, about 2 minutes. Transfer vegetables to a large bowl.",
        "Add 1 tablespoon peanut oil to wok or skillet and heat unrig just smoking. Stir-fry half of beef until browned and transfer to bowl. Add remaining tablespoon peanut oil and stir-fry remaining beef in same manner, transferring to bowl.",
        "Add broth mixture to wok or skillet and bring to a boil, stirring constantly. Simmer broth mixture 1 minute. Return beef-vegetable mixture with scallions to wok or skillet and stir-fry until combined and heated through. Season stir-fry with salt and pepper and stir in sesame oil.",
        "Serve stir-fry over rice, garnished with scallions."
    ],
    "ingredients": [
        "1 medium red onion",
        "3 garlic cloves",
        "1 pound sweet potatoes (about 2 large)",
        "3/4 pound snow peas",
        "1/2 cup drained rinsed canned whole water chestnuts (from an 8-ounce can)",
        "1 pound boneless beef sirloin",
        "4 scallions",
        "3/4 cup chicken broth",
        "1/4 cup hoisin sauce",
        "2 tablespoons brandy",
        "1 tablespoon cornstarch",
        "4 tablespoons peanut oil",
        "2 teaspoons Asian sesame oil",
        "Accompaniment:Cooked Rice",
        "Garnish: sliced scallions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Potato",
        "Vegetable",
        "Stir-Fry",
        "Quick & Easy",
        "Fall",
        "Gourmet"
    ],
    "title": "Spicy Beef and Sweet-Potato Stir-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-beef-and-sweet-potato-stir-fry-14503"
}
