{
    "directions": [
        "Into a medium bowl, sift together the flour, cocoa powder, cinnamon, ginger, allspice, baking soda, and salt.",
        "In the bowl of an electric mixer fitted with the paddle attachment, beat together the butter, muscovado sugar, and vanilla extract on medium-high speed for about 4 minutes, or until the mixture is noticeably lighter in color, transforming from a dark, gritty-looking mixture to something fluffier and latte-like in color. Beat in the egg until completely absorbed. Beat in the molasses until well blended.",
        "Reduce the mixer speed to low and gradually stir in the dry ingredients. Mix until well blended and even in color. Cover the bowl and refrigerate the dough for about 2 hours.",
        "When you’re ready to bake, position the racks to the upper and lower thirds of the oven and preheat the oven to 350°F. Line 2 baking sheets with parchment paper or silicone baking mats.",
        "To form the cookies, pour the turbinado sugar onto a plate. Using a small ice cream scoop with a capacity of about 1 tablespoon, portion the dough into balls. Roll the dough balls in the turbinado sugar, coating them completely. Place on the prepared baking sheets, evenly spacing them with 1 dozen cookies per sheet. Repeat with the balance of the dough.",
        "Bake the cookies until they are set on the edges, but still very soft in the centers, about 10 minutes. Quickly pull the sheets from the oven (close the oven door so as to not let all the heat escape!). Using deft thumbs, a spoon with a very deep well (like a melon baller), or a thick-handled wooden spoon, make a deep indentation in the center of each cookie. Return to the oven to finish baking, about 5 minutes more. Let the cookies cool on the pans set over wire racks. If the indentations have become shallow, press them down again while the cookies are warm.",
        "Place the chocolate and butter in a heatproof bowl. Melt in the microwave with 30-second bursts of high heat, stirring well after each interval. Stir in the molasses. Transfer the ganache to a small zip-top bag and work it toward the corner of the bag. Snip off a tiny bit at the corner. Fill each cookie with ganache. Let the cookies set at room temperature until the ganache is firm, about 1 hour.",
        "Store the cookies in an airtight container at room temperature for up to 5 days."
    ],
    "ingredients": [
        "1 1/2 cups plus 2 tablespoons (5 1/8 ounces/144 grams) unbleached all-purpose flour, spooned and leveled",
        "6 tablespoons (1 1/4 ounces/36 grams) unsweetened natural cocoa powder",
        "3/4 teaspoon ground cinnamon",
        "1/2 teaspoon ground ginger",
        "1/8 teaspoon allspice",
        "3/4 teaspoon baking soda",
        "1/2 teaspoon fine sea salt",
        "10 tablespoons (5 ounces/142 grams) unsalted butter, at room temperature",
        "1/2 cup (4 ounces/113 grams) firmly packed dark muscovado sugar",
        "1 teaspoon pure vanilla extract",
        "1 large egg",
        "1/4 cup (3 ounces/84 grams) unsulphured molasses",
        "1/2 cup (3 1/2 ounces/100 grams) turbinado sugar, for coating the cookies",
        "2 ounces (57 grams) bittersweet chocolate (60% to 70% cacao)",
        "2 tablespoons (1 ounce/28 grams) unsalted butter, cut into small pieces",
        "1/2 teaspoon unsulphured molasses"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Cookies",
        "Chocolate",
        "Spice",
        "Cinnamon",
        "Valentine's Day",
        "Bake"
    ],
    "title": "Spiced Chocolate Molasses Buttons",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-chocolate-molasses-buttons"
}
