{
    "directions": [
        "Heat oil in heavy large saucepan over medium heat. Add next 4 ingredients; stir until fragrant, about 1 minute. Reduce heat to medium-low. Stir in curry paste, curry powder, and chili paste. Add 1/2 cup coconut milk (scooped from thick liquid at top of can). Stir until thick and fragrant, about 2 minutes. Add remaining coconut milk, broth, fish sauce, and sugar; bring broth to boil. Keep warm. DO AHEAD: Can be made 1 day ahead. Refrigerate until cold, then cover and keep chilled.",
        "Cook snow peas in large pot of boiling salted water until bright green, about 20 seconds. Using strainer, remove peas from pot; rinse under cold water to cool. Place peas in medium bowl. Bring water in same pot back to boil. Add sweet potato and cook until tender, about 7 minutes. Using strainer, remove sweet potato from pot and rinse under cold water to cool. Place in small bowl. Bring water in same pot back to boil and cook noodles until just tender but still firm to bite, about 6 minutes. Drain; rinse under cold water to cool. Transfer to microwave-safe bowl. DO AHEAD: Can be made 1 hour ahead. Let stand at room temperature.",
        "Bring broth to simmer. Add chicken; simmer until chicken is cooked through, about 10 minutes. Add sweet potato; stir to heat through, about 1 minute. Heat noodles in microwave in 30-second intervals to rewarm. Cut noodles with scissors if too long. Divide noodles among bowls. Divide snow peas and hot soup among bowls. Scatter red onion, green onions, cilantro, and chiles over soup. Garnish with lime wedges and serve.",
        "*Available at some supermarkets, at specialty foods stores and Asian markets, and online from adrianascaravan.com."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "3 tablespoons chopped shallots",
        "3 garlic cloves, chopped",
        "2 tablespoons minced lemongrass* (from bottom 4 inches of about 3 stalks, tough outer leaves discarded)",
        "2 tablespoons minced peeled fresh ginger",
        "2 tablespoons Thai yellow curry paste*",
        "2 tablespoons curry powder",
        "1 teaspoon hot chili paste (such as sambal oelek)*",
        "2 13.5- to 14-ounce cans unsweetened coconut milk,* divided",
        "5 cups low-salt chicken broth",
        "2 1/2 tablespoons fish sauce (such as nam pla or nuoc nam)*",
        "2 teaspoons sugar",
        "3 cups snow peas, trimmed",
        "2 cups 1/2-inch cubes peeled red-skinned sweet potato (yam; from about 1 large)",
        "1 pound dried rice vermicelli noodles or rice stick noodles*",
        "3/4 pound skinless boneless chicken thighs, thinly sliced",
        "1/2 cup thinly sliced red onion",
        "1/4 cup thinly sliced green onions",
        "1/4 cup chopped fresh cilantro",
        "3 red Thai bird chiles or 2 red jalapeño chiles, thinly sliced with seeds",
        "1 lime, cut into 6 wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "High Fiber",
        "Curry",
        "Sweet Potato/Yam",
        "Winter",
        "Noodle"
    ],
    "title": "Spicy Curry Noodle Soup with Chicken and Sweet Potato",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-curry-noodle-soup-with-chicken-and-sweet-potato-241112"
}
