{
    "directions": [
        "Wash the goose thoroughly and pat dry with paper towels. Let the goose sit at room temperature for about 30 minutes. Meanwhile, mix together the allspice, 1/2 teaspoon cinnamon, salt and pepper in a small bowl and set aside to make a spice rub.",
        "Remove any lumps of visible fat from the cavity of the goose, and render the goose fat in a skillet over medium heat until the fat is liquid and the remaining bits are crisp and brown, about 15 minutes.  Reserve 3 tablespoons of goose fat and save the rest for another use, or discard.",
        "Working in batches if necessary, fry the sliced apples in the reserved goose fat in a large skillet over medium heat until the apple slices are browned, about 10 minutes per batch.  Remove the browned apple slices to a large mixing bowl, let cool slightly, and sprinkle with the Calvados and 2 teaspoons of  cinnamon.  Mix lightly to combine.",
        "With the point of a sharp knife, prick the entire skin of the goose, being careful not to cut into the meat. Rub the exterior of the goose well with the spice rub, massaging the spices into the skin.",
        "Preheat an oven to 400 degrees F (200 degrees C).",
        "Spoon the apple stuffing lightly into the cavity of the goose, and lay it on a large sheet of aluminum foil big enough to wrap over the entire goose.  Wrap the goose in the foil, seal the edges, and make a 1/2-inch hole in the bottom of the foil packet to allow the fat from the goose to drain.  Place the bird breast side up, on a rack set into a large baking pan, and roast the goose in the preheated oven until no longer pink at the bone and the juices run clear, about an hour and a half. Peel the foil back from the breast meat and roast for another 45 minutes until the skin browns, basting once or twice to prevent burning. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C).",
        "Remove the goose from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area  10 to 15 minutes before serving."
    ],
    "ingredients": [
        "1 (12 pound) goose, thawed if purchased frozen",
        "1/4 teaspoon ground allspice",
        "1/2 teaspoon ground cinnamon",
        "salt and black pepper to taste",
        "8 apples, peeled, cored and sliced",
        "1/2 cup Calvados (apple brandy)",
        "2 teaspoons ground cinnamon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spicy Roast Goose with Apple Stuffing",
    "url": "http://allrecipes.com/recipe/181025/spicy-roast-goose-with-apple-stuffing/"
}
