{
    "directions": [
        "Preheat oven to 350°F.",
        "Coat garlic lightly with vegetable oil and wrap in foil. Bake garlic 30 minutes, or until soft.",
        "In a dry small heavy skillet toast coriander and cumin seeds over moderately high heat, stirring, until fragrant and several shades darker. In an electric coffee/spice grinder grind seeds to powder.",
        "Chop onions and in a 6-quart heavy kettle cook in 2 tablespoons oil over moderate heat, stirring, until softened. Reserve about one third onions in a small bowl. Wearing rubber gloves, slice jalapeño and chop roasted poblanos (abut 1 cup). Remove kernels from ears of corn (about 2 cups), reserving cobs. To onions in kettle add jalapeño and 1 cup corn kernels and cook over moderate heat, stirring, 2 minutes. Add ground spices, 1/2 cup poblanos, and salt and pepper to taste and cook, stirring, 2 minutes. Cut reserved corn cobs into thirds and add with broth to corn mixture. Simmer soup, uncovered, 30 minutes.",
        "In a small heavy skillet sauté remaining kernels in remaining teaspoon oil over moderately high heat, stirring, just until tender.",
        "Discard corn cobs from soup. Squeeze garlic pulp from skins and stir with cream into soup. Pour soup through a sieve into a bowl and in a blender purée solids with just enough liquid to make smooth.",
        "Tie long coriander sprigs in a bunch with kitchen string. Transfer purée and remaining liquid to kettle with tied coriander and lime juice and cook over moderate heat, stirring occasionally, just until heated through. Chop roasted bell pepper. To soup add bell pepper, remaining poblanos, reserved onions, and sautéed corn and cook over moderate heat, stirring, until heated through. Discard tied coriander.",
        "Serve soup garnished with coriander."
    ],
    "ingredients": [
        "3 large garlic cloves, unpeeled",
        "vegetable oil for coating garlic",
        "1/4 teaspoon coriander seeds",
        "1/4 teaspoon cumin seeds",
        "3 medium sweet onions such as Vidalia, Walla Walla, or Maui",
        "2 tablespoons plus 1 teaspoon peanut or vegetable oil",
        "1/2 fresh jalapeño chili",
        "2 fresh poblano chilies,roasted and peeled",
        "3 ears corn",
        "6 cups chicken broth",
        "1 cup heavy cream",
        "12 long fresh coriander sprigs",
        "2 to 3 tablespoons fresh lime juice, or to taste",
        "1 red bell pepper,roasted and peeled",
        "Garnish: 8 short fresh coriander sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Blender",
        "Garlic",
        "Onion",
        "Pepper",
        "Bake",
        "Sauté",
        "Corn",
        "Cilantro",
        "Simmer",
        "Gourmet"
    ],
    "title": "Spicy Sweet Corn and Poblano Soup",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-sweet-corn-and-poblano-soup-14186"
}
