{
    "directions": [
        "Heat the oil in a large cast-iron skillet over high heat. Add the red onions and saute until beginning to brown, 1 minute. Add the butter; when almost all melted, add the potatoes, salt, oregano, coriander, cumin and pepper. Toss the potatoes to coat with fat and spices, then let them cook, pressing occasionally with a spatula, until very dark and crispy on the bottom, about 5 minutes.",
        "Meanwhile, whisk together the mustard, vinegar, 1 teaspoon honey and some salt and pepper in a medium bowl. Slowly whisk in the olive oil to make a thick dressing. Taste and add honey or salt and pepper as needed.",
        "When the potatoes have developed a nice dark crust, use the spatula to turn them over in chunks, pressing them again into the bottom of the pan to toast slightly. Scatter the scallions and cilantro on top and toss a bit to combine. Drizzle with some of the dressing. Transfer the hash browns to a serving platter. Serve with the remaining dressing on the side."
    ],
    "ingredients": [
        "2 tablespoons canola oil",
        "1/2 red onion, finely diced",
        "4 tablespoons (1/2 stick) butter",
        "5 russet potatoes, peeled, parboiled, and diced",
        "1 tablespoon kosher salt, plus for the vinaigrette",
        "2 teaspoons dried Mexican oregano",
        "1/4 teaspoon ground coriander",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon freshly ground black pepper, plus for the vinaigrette",
        "3 tablespoons whole-grain Dijon mustard",
        "3 tablespoons red wine vinegar",
        "1 to 2 teaspoons honey",
        "3/4 cup olive oil",
        "4 scallions, chopped on the diagonal",
        "1/4 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Potato",
        "Vegetable",
        "Brunch"
    ],
    "title": "Spiced Mustard Hash Browns",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/spiced-mustard-hash-browns"
}
