{
    "directions": [
        "In a flameproof slow cooker insert over medium heat on the stove top, warm 2 Tbs. of the olive oil. Working in batches as necessary to avoid crowding, add the chicken and cook, turning occasionally, until lightly browned all over, about 8 minutes. Transfer the chicken to a platter.",
        "Add the remaining 6 Tbs. (3 oz./90 g) olive oil to the insert and heat for 2 minutes. Whisk in the flour and cook, stirring constantly with a wooden spoon, until dark brown, 3 to 4 minutes; watch carefully to prevent the roux from turning black and burning. Add the onion and bell pepper and cook, stirring occasionally, until softened, 8 to 10 minutes. Add the garlic and cook for 1 minute more.",
        "Stir in the okra, tomatoes, stock, bay leaves, paprika, oregano, chili powder, cayenne, thyme and salt and pepper to taste. Add the sausage and return the chicken to the insert. Transfer the insert to the slow cooker base and set to high. Cover and cook for 2 hours.",
        "Remove the chicken thighs from the insert. Let cool slightly, then, using two forks, shred the chicken into bite-size pieces and return to the slow cooker. Stir in the shrimp and continue cooking until the shrimp are opaque and cooked through, 2 to 3 minutes. Taste and adjust the seasoning with salt and pepper if necessary.",
        "To serve, spoon the rice into warmed bowls, ladle the gumbo on top and garnish with the parsley. Serve immediately, passing a bottle of hot sauce at the table. Serves 6 to 8."
    ],
    "ingredients": [
        "8 Tbs. (4 fl. oz./125 ml) olive oil",
        "1 1/2 lb. (750 g) boneless, skinless chicken thighs",
        "6 Tbs. (2 oz./60 g) all-purpose flour",
        "1 large yellow onion, diced",
        "1 green bell pepper, seeded and diced",
        "3 garlic cloves, minced",
        "1/2 lb. (250 g) fresh or frozen okra",
        "1 can (14 oz./440 g) diced tomatoes, drained",
        "5 cups (40 fl. oz./1.25 l) chicken stock",
        "2 bay leaves",
        "1 Tbs. sweet paprika",
        "1 tsp. dried oregano",
        "2 Tbs. chili powder",
        "1/2 tsp. cayenne pepper",
        "1 tsp. dried thyme",
        "Kosher and freshly ground black pepper",
        "1/2 lb. (250 g) andouille sausage, cut into 1-inch (12-mm) slices",
        "1 lb. (500 g) large shrimp, peeled and deveined",
        "Cooked white rice for serving",
        "2 Tbs. chopped fresh flat-leaf parsley",
        "Hot sauce such as Tabasco for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Spicy Slow Cooker Gumbo",
    "url": "http://www.williams-sonoma.com/recipe/spicy-slow-cooker-gumbo.html"
}
