{
    "directions": [
        "Combine first 3 ingredients in heavy medium saucepan. Cover and simmer over medium heat until chilies soften, about 12 minutes. Puree chili mixture in batches in blender.",
        "Stir chorizo in heavy large pot over medium-high heat until drippings come to simmer, breaking up meat with spoon. Transfer to fine strainer set over bowl. Let chorizo drain 10 minutes.",
        "Return 1/4 cup chorizo drippings to same pot and heat over medium-high heat (discard remaining drippings). Add onions, garlic, oregano and cumin. Sauté until onions begin to soften, about 5 minutes. Sprinkle lamb with salt and pepper; add to pot. Sauté until lamb is no longer pink outside, about 10 minutes. Add chili puree and drained chorizo. Bring chili to boil, stirring occasionally. Reduce heat to medium-low, cover and simmer 1 hour. Add hominy. Simmer uncovered until lamb is tender and liquid thickens, stirring occasionally, about 15 minutes. Season with salt and pepper. (Can be made 3 days ahead. Chill uncovered until cold, then cover and keep chilled. Rewarm before serving.)",
        "*Sold at Latin American markets and some supermarkets."
    ],
    "ingredients": [
        "2 1/4 cups canned low-salt chicken broth",
        "3 ounces dried ancho chilies (about 5 large),* stemmed, seeded, torn into pieces",
        "1 teaspoon cayenne pepper",
        "2 1-pound rolls beef or pork chorizo, casings removed",
        "2 cups coarsely chopped red onions",
        "12 large garlic cloves, chopped",
        "1 tablespoon dried leaf oregano",
        "1 tablespoon ground cumin",
        "3 1/4 pounds o-bone (round-bone) lamb shoulder chops, boned, cut into 3/4-inch cubes",
        "2 15-ounce cans golden hominy or pinto beans, rinsed, drained"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Beef",
        "Lamb",
        "Pepper",
        "Pork",
        "Sauté",
        "Super Bowl",
        "Sausage",
        "Hot Pepper",
        "Fall",
        "Winter",
        "Tailgating"
    ],
    "title": "Spicy Lamb and Chorizo Chili",
    "url": "http://www.epicurious.com/recipes/food/views/spicy-lamb-and-chorizo-chili-103006"
}
