{
    "directions": [
        "Preheat oven to 400°F. Whisk first 6 ingredients in medium bowl to blend. Add butter; rub in with fingertips until mixture resembles coarse meal. Add half and half; stir just until dough forms. Gather dough into ball with floured hands. Gently knead 8 times against side of bowl. Roll out dough on floured surface to 3/4-inch-thick round. Using 3-inch-diameter cookie cutter, cut out 5 biscuits; place on ungreased baking sheet. Gather dough and reroll as needed to make 1 more biscuit. Bake biscuits until pale golden and tester inserted into center comes out clean, about 15 minutes. Cool 20 minutes. (Biscuits can be made 8 hours ahead; cool completely and store in airtight container at room temperature.)",
        "Melt butter in large skillet over medium-high heat. Add plums and sugar. Cook until sugar dissolves and becomes syrupy and plums are just tender, stirring constantly, about 6 minutes. Remove from heat. Stir in cinnamon and ground ginger. Cool 5 minutes. (Can be made 4 hours ahead. Let stand at room temperature; rewarm before serving.)",
        "Using electric mixer, beat cream in medium bowl until soft peaks form. Add 2 teaspoons powdered sugar and beat to firm peaks. Fold in crystallized ginger.",
        "Cut biscuits in half; place bottom halves on 6 dessert plates. Top with warm plums, then cream. Cover with biscuit tops. Sift powdered sugar over."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "1/4 cup chopped crystallized ginger",
        "2 tablespoons sugar",
        "2 1/2 teaspoons baking powder",
        "1 teaspoon ground ginger",
        "3/4 teaspoon salt",
        "6 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "3/4 cup half and half",
        "1/4 cup (1/2 stick) unsalted butter",
        "2 pounds dark red or purple plums, halved, pitted, cut into 1/2-inch slices",
        "1/3 cup sugar",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground ginger",
        "1 cup chilled whipping cream",
        "2 teaspoons powdered sugar",
        "1/4 cup chopped crystallized ginger",
        "Additional powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Backyard BBQ",
        "Plum",
        "Spice",
        "Summer",
        "Party",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Plum Shortcakes",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-plum-shortcakes-108467"
}
