{
    "directions": [
        "Bring vinegar to a boil in a small saucepan. Add currants; set aside.",
        "Heat oil in a large skillet over mediumhigh. Cook onion, stirring occasionally, until browned and softened, about 5 minutes. Add garlic; season with salt and pepper. Cook, stirring, 1 minute. Add tomato paste, cumin, ginger, cardamom, and turmeric and cook until fragrant and sticky, about 1 minute. Add lamb and cook, breaking up with a spoon, until browned and cooked through, about 3 minutes. Stir in tomatoes, season with salt and pepper, and bring to a simmer. Stir in peas; cook until bright green, about 5 minutes. Drain reserved currants and add to lamb along with parsley. Let cool.",
        "Place a rack in middle of oven; preheat to 350°. Working with one at a time, roll out dough on a lightly floured surface to 12\" squares. Cut each into 4 squares; transfer to 2 parchment-lined baking sheets. Spoon filling onto one side of squares, leaving 1/2\" border. Brush edges with egg and fold dough over filling. Press to seal; crimp with a fork. Cut a few vents in tops; brush with egg.",
        "Bake until pies are golden brown, 30-35 minutes. Let cool slightly.",
        "Do ahead: Filling can be made 2 days ahead. Cover and chill."
    ],
    "ingredients": [
        "3 tablespoons white wine vinegar",
        "3 tablespoons dried currants",
        "2 tablespoons olive oil",
        "1 small onion, finely chopped",
        "1 small garlic clove, finely chopped",
        "Kosher salt, freshly ground pepper",
        "1 tablespoon tomato paste",
        "3/4 teaspoons ground cumin",
        "3/4 teaspoons ground ginger",
        "1/4 teaspoons ground cardamom",
        "1/4 teaspoons ground turmeric",
        "1/2 pound ground lamb",
        "1 cup canned crushed tomatoes",
        "1/3 cup frozen peas",
        "2 tablespoons chopped fresh parsley",
        "All-Butter Pie Dough",
        "All-purpose flour (for surface)",
        "1 large egg, beaten to blend"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Vegetable",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Spiced Lamb Hand Pies",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-lamb-hand-pies-51263680"
}
