{
    "directions": [
        "Position a rack in the center of the oven and preheat to 350°F. Butter two 9-inch diameter cake pans with 1 1/2-inch sides. Line the bottom of each pan with a circle of parchment paper. Butter the parchment paper. Sprinkle the pans with flour, tap the pans to evenly distribute the flour, and then shake off the excess flour. Set aside.",
        "To make the cake, in a large bowl, sift together the 2 cups flour, the granulated sugar, baking soda, cinnamon, salt, nutmeg, and cloves. In a medium bowl, combine the eggs, oil, and vanilla. In another medium bowl, combine the pumpkin purée, coconut, crushed pineapple, and currants.",
        "Add the egg mixture to the flour mixture and stir with a wooden spoon until just combined. Add the pumpkin mixture and stir just until combined. Divide the batter between the prepared pans, spreading it evenly. Bake for 35 to 40 minutes until a toothpick inserted into the center of a cake comes out clean. Transfer to wire racks and let cool in the pans for 15 minutes. Run a table knife around the edge of the pans to loosen the cakes. Invert the cakes onto the racks and peel off the parchment paper. Let cool completely before frosting the cakes.",
        "To make the frosting, in the bowl of an electric mixer fitted with the paddle attachment, beat the cream cheese on medium speed for about 3 minutes until smooth. Add the butter and beat for about 2 minutes until combined. Add the pumpkin purée and beat until incorporated, about 1 minute. Add the confectioners' sugar and vanilla and beat for about 3 minutes until fluffy.",
        "Place 1 cake layer on a cake plate or platter. Using an offset spatula, spread half of the frosting over the top of the first cake layer. Spread the frosting right to the edge of the top without frosting the sides of the cake. Carefully place the second cake on top, lining up the edges. Spread the remaining frosting over the top of the cake without frosting the sides. Swirl the frosting to decorate the top. Refrigerate the cake to set the frosting. Remove from the refrigerator 30 to 40 minutes before serving."
    ],
    "ingredients": [
        "Butter for coating cake pans, at room temperature",
        "2 cups all-purpose flour, plus extra for dusting the pan",
        "2 cups granulated sugar",
        "2 teaspoons baking soda",
        "2 teaspoons ground cinnamon",
        "1 teaspoon kosher or sea salt",
        "1/2 teaspoon freshly grated nutmeg",
        "1/4 teaspoon ground cloves",
        "3 large eggs, beaten",
        "1 cup canola or vegetable oil",
        "2 teaspoons pure vanilla extract",
        "1 1/4 cups canned unsweetened pumpkin purée",
        "1 cup lightly packed sweetened flaked coconut",
        "3/4 cup canned crushed pineapple (do not drain)",
        "1/3 cup dried currants",
        "2 packages (8 ounces each) cream cheese, at room temperature",
        "1 cup (2 sticks) unsalted butter, at room temperature",
        "2 tablespoons canned unsweetened pumpkin purée",
        "1 1/2 cups confectioners' sugar, sifted",
        "1 teaspoon pure vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cream Cheese",
        "Dried Fruit",
        "Coconut",
        "Pineapple",
        "Spice",
        "Pumpkin",
        "Cinnamon",
        "Butter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Pumpkin Layer Cake with Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-pumpkin-layer-cake-with-cream-cheese-frosting-355431"
}
