{
    "directions": [
        "Whisk the bread flour, salt, and yeast together in a mixing bowl until combined; set aside. Stir the honey, 3/4 cup water, and 1 1/2 tablespoons butter together in a mixing bowl until the honey has dissolved. Stir in half of the flour mixture until no dry spots remain. Stir in the remaining flour, a 1/2 cup at a time, mixing well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Transfer to a greased bowl, cover, and leave to rise in a warm place until doubled in bulk, 1 to 1 1/2 hours.",
        "Meanwhile, prepare the filling by melting 2 tablespoons of butter in a skillet over medium-low heat. Stir in the onion, garlic, ginger, coriander, cumin, cinnamon, and chili powder. Cook and stir until the onion has softened and turned translucent, 10 to 15 minutes. Stir in the raisins, coconut, and 2 tablespoons of water. Cover and cook 10 minutes longer; set aside.",
        "Preheat an oven to 450 degrees F (230 degrees C). Place a large baking sheet into the oven to preheat. Dust a second baking sheet heavily with flour.",
        "Punch down the dough and divide into 4 pieces. Roll each piece into an 8 inch round, then spoon the filling into the middle of the dough. Bring the edges of the dough over the filling, and pinch to seal. Carefully roll the dough out into 8-inch ovals and place onto the floured baking sheet. Cover with a towel and allow to rise for 15 minutes.",
        "Carefully transfer the naan onto the hot baking sheet in the preheated oven. Bake until the naan have puffed up and are golden, 10 to 12 minutes. Serve hot."
    ],
    "ingredients": [
        "2 cups bread flour",
        "1 teaspoon salt",
        "1/2 (.25 ounce) package instant yeast",
        "1 teaspoon honey",
        "3/4 cup water",
        "1 1/2 tablespoons melted butter",
        "2 tablespoons butter",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1 teaspoon minced fresh ginger root",
        "2 teaspoons ground coriander",
        "1 teaspoon ground cumin",
        "1 teaspoon ground cinnamon",
        "1 pinch chili powder",
        "3 tablespoons raisins",
        "1/4 cup flaked coconut",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spiced Naan",
    "url": "http://allrecipes.com/recipe/137637/spiced-naan/"
}
