{
    "directions": [
        "Preheat oven to 350°F. Coat a 9\" cake pan with nonstick spray and line bottom with a parchment paper round. Whisk flour, baking powder, baking soda, salt, cinnamon, ginger, and nutmeg in a large bowl to combine.",
        "Combine granulated sugar, brown sugar, oil, honey, egg, and egg yolk in another large bowl. Scrape in seeds from vanilla bean; discard pod. Using an electric mixer on medium speed, beat mixture until pale and thickened, about 4 minutes. Reduce speed to medium-low and gradually pour in orange juice and whey. Beat until frothy, about 2 minutes. Reduce speed to low and gradually add dry ingredients; beat just until smooth and homogenous (it will be thin, like pancake batter).",
        "Pour into prepared pan and bake until cake is golden brown and center springs back when gently pressed (a cake tester will not come out clean), 45–55 minutes. Transfer to a wire rack and let cool in pan, 20 minutes. Run a knife around edges of cake to loosen and invert onto rack; let cool completely.",
        "Cake can be baked 3 days ahead. Store tightly wrapped at room temperature.",
        "Using an electric mixer on medium-high speed, beat cream cheese and butter in a medium bowl until smooth. Add powdered sugar, lemon zest, and salt and scrape in seeds from vanilla bean; discard pod. Beat on low speed until mixture is very light and thickened, about 2 minutes; scrape down sides of bowl. With motor running, add coconut cream by the tablespoonful and beat until very soft peaks form (save coconut milk for another use).",
        "Pile frosting on top of cake and spread to edges (it's okay if it cascades over the sides). Decorate with bee pollen, fennel fronds, flowers, and berries, if desired."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 cups gluten-free all-purpose baking flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon kosher salt",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon ground ginger",
        "1/8 teaspoon freshly grated nutmeg",
        "2/3 cup granulated sugar",
        "1/4 cup (packed) light brown sugar",
        "1/2 cup vegetable oil",
        "1/2 cup honey",
        "1 large egg",
        "1 large egg yolk",
        "1/2 vanilla bean, split lengthwise",
        "1/2 cup fresh orange juice",
        "1/2 cup whey or buttermilk",
        "3 ounces cream cheese, room temperature",
        "3 tablespoons unsalted butter, room temperature",
        "1 cup powdered sugar",
        "1 teaspoon finely grated lemon zest",
        "Pinch of kosher salt",
        "1/2 vanilla bean, split lengthwise",
        "1 (13.5-ounce) can unsweetened coconut milk, cream separated from milk, room temperature",
        "Bee pollen, fennel fronds, edible flowers, and berries (for serving; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Wheat/Gluten-Free",
        "Cream Cheese",
        "Buttermilk",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spiced Honey Cake With Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/spiced-honey-cake-with-cream-cheese-frosting-56389999"
}
