{
    "directions": [
        "To make the dressing, in a small jar with a tight-fitting lid, combine the olive oil, vinegar, mustard, sugar, salt, and pepper to taste. Cover tightly and shake vigorously to blend. Taste and adjust the seasoning. Set aside.",
        "Place the onions in a medium bowl and cover with cold water. Let stand for 30 minutes. This crisps the onion and takes away the raw onion taste. Drain well and pat dry on paper towels.",
        "In a small bowl, toss the cranberries with 2 tablespoons of the dressing to soften them. Set aside for at least 20 minutes or until ready to serve the salad.",
        "To assemble the salad, place the spinach, onions, and pears in a large bowl. Give the remaining dressing a last-minute shake and pour over the salad. Toss to coat evenly. Arrange the salad in a large serving bowl or divide it evenly among 8 salad plates. Scatter the cranberries and hazelnuts over the top(s). Serve immediately.",
        "Try to buy shelled hazelnuts (also called filberts) with the brown, papery skins removed as well. To toast, spread the hazelnuts in a single layer on a rimmed baking sheet and place in a preheated 375°F oven. Toast for about 12 minutes until lightly browned. If the nuts still have the skins on, transfer them while they're hot to a clean kitchen towel. (Use a clean towel that is old or you don't mind washing with bleach, because the skins tend to discolor the fabric.) Rub the nuts to remove most of the skins (they never come completely off).",
        "You can substitute unsalted cashews for the hazelnuts. Toast cashews, as directed above for hazelnuts, for 8 to 10 minutes until lightly browned."
    ],
    "ingredients": [
        "1/2 cup extra-virgin olive oil",
        "2 tablespoons balsamic vinegar",
        "2 teaspoons whole-grain mustard",
        "1 teaspoon sugar",
        "1 teaspoon kosher or sea salt",
        "Freshly ground pepper",
        "1 cup thinly sliced red onion",
        "1/3 cup sweetened dried cranberries",
        "8 cups lightly packed fresh baby spinach leaves, stemmed if needed",
        "2 firm but ripe Bosc pears (do not peel), quartered lengthwise, cored, and cut into long, thin slices",
        "2/3 cup hazelnuts, toasted (see Cook's Notes) and chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Mustard",
        "Onion",
        "Appetizer",
        "Side",
        "Thanksgiving",
        "Vegetarian",
        "Dried Fruit",
        "Pear",
        "Spinach",
        "Fall",
        "Healthy",
        "Hazelnut",
        "Potluck",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spinach Salad with Bosc Pears, Cranberries, Red Onion, and Toasted Hazelnuts",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-salad-with-bosc-pears-cranberries-red-onion-and-toasted-hazelnuts-355430"
}
