{
    "directions": [
        "Place the chopped spinach in a bowl with a pinch of salt, and stir the spinach and salt for about 1 minute until the spinach begins to wilt and release its juice.",
        "In a separate bowl, combine the chopped onion with a pinch of salt, and stir for about 1 minute to wilt the onion. Add the wilted spinach, olive oil, sumac, pine nuts, lemon juice, and pepper, and stir to combine. Let the stuffing mixture rest for 5 minutes, and then drain off the liquid.",
        "Melt butter in a small saucepan over low heat, and set aside.",
        "Preheat an oven to 400 degrees F (200 degrees C). Line baking sheets with parchment paper.",
        "Place a phyllo sheet onto a flat surface, and brush it lightly with melted butter. Place a second sheet on top of the first sheet, and brush with melted butter. Cut each stack of 2 buttered sheets into 5 strips about 3 1/2 inches wide by 13 inches long. Cover strips waiting to be filled with a damp cloth while you fill and roll the triangles.",
        "To fold a triangle, place a tablespoon of filling centered at the top end of a phyllo dough strip, and fold the right corner across and down, to make a pointed, filled dough pocket at the top of the strip. Fold the pocket down one more turn, like folding a flag, to make a triangle shape. Continue to fold the triangle down and across the dough strip until you reach the end of the strip and you have a compact, filled triangle of dough. Repeat with the remaining filling and phyllo dough.",
        "Place the filled triangles onto the prepared baking sheets, and brush them with butter. Working in batches if necessary, bake in the preheated oven for 12 to 15 minutes per batch, until the triangles are golden brown."
    ],
    "ingredients": [
        "4 cups fresh spinach leaves, chopped",
        "1 pinch salt",
        "1 onion, finely chopped",
        "1 pinch salt",
        "2 tablespoons extra-virgin olive oil",
        "2 tablespoons ground sumac",
        "2 tablespoons pine nuts (optional)",
        "3 tablespoons fresh lemon juice",
        "1/2 teaspoon ground black pepper",
        "1 cup butter",
        "1 (16 ounce) package frozen phyllo dough, thawed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spinach Triangles (Fatayer Sabanegh)",
    "url": "http://allrecipes.com/recipe/186014/spinach-triangles-fatayer-sabanegh/"
}
