{
    "directions": [
        "Heat 1 tablespoon oil in a large heavy pot over medium heat. When oil begins to shimmer, add 1 garlic clove. Stir until beginning to turn golden brown, 1-2 minutes. Add spinach to pot. Toss to coat; season with salt and pepper. Cook until spinach is wilted but still bright green, 2-3 minutes. Transfer to a medium bowl; set aside. Wipe out pot.",
        "Heat 2 tablespoons oil in same pot over medium heat. When oil begins to shimmer, add onion and 3 garlic cloves. Cook, stirring often, until onion is softened, 3-4 minutes.",
        "Add cumin and paprika; stir until cumin is toasted and fragrant, 1-2 minutes. Add chickpeas and tomatoes; stir to coat. Cook until tomatoes start to caramelize and chickpeas begin to brown, 8-10 minutes. Add 3 cups broth; bring to a simmer, scraping up any browned bits from bottom of pan. Reduce heat to medium; simmer, occasionally mashing some chickpeas with the back of a spoon or a potato masher, until sauce is thickened, 15-20 minutes. Fold in spinach; simmer for flavors to meld, adding more broth by 1/4-cupfuls if too thick, 8ñ10 minutes.",
        "Pour oil into a large heavy skillet to a depth of 1/8\" (about 1/4 cup). Heat until oil begins to shimmer. Crack 2 eggs into hot oil, spacing apart. Using a large spoon, carefully baste whites (not yolks) with oil until whites are set and edges are crunchy, lacy, and golden brown, 2-3 minutes (do not turn). Season eggs with salt and pepper. Transfer to a plate and repeat with remaining 2 eggs.",
        "Spoon chickpea stew into bowls and top each with a fried egg."
    ],
    "ingredients": [
        "3 tablespoons olive oil, divided, plus more",
        "4 medium garlic cloves, thinly sliced, divided",
        "8 cups spinach, coarsely chopped",
        "Kosher salt, freshly ground pepper",
        "1 cup chopped onion",
        "1 teaspoon cumin seeds",
        "1/4 teaspoon smoked paprika",
        "2 15-ounce cans chickpeas, rinsed",
        "5 canned whole tomatoes, crushed",
        "3 cups (or more) vegetable broth",
        "4 large eggs",
        "Ingredient info: Smoked paprika is available at most supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Leafy Green",
        "Vegetable",
        "Brunch",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Spinach",
        "Legume",
        "Chickpea",
        "Healthy",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spinach with Chickpeas and Fried Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-with-chickpeas-and-fried-eggs-51117800"
}
