{
    "directions": [
        "Fill a saucepan with 1/2 inch of water, then add pumpkin pieces. Bring to a boil over high heat, then reduce heat to medium-low, cover, and steam until the pumpkin is very tender, 10 to 15 minutes. Drain pumpkin, then mash with 1 tablespoon butter, cinnamon; salt and pepper to taste, then set aside.",
        "Melt 2 tablespoons butter in a saucepan over medium heat. Whisk in flour and cook, stirring constantly, until the paste just begins to turn golden, about 2 minutes. Whisk in milk gradually so that no lumps form. Bring to a gentle boil. Add the bay leaves, and reduce heat to low or warm. Allow to gently cook for 10 to 15 minutes, stirring frequently, then remove from heat.",
        "Heat 1 tablespoon olive oil in a large skillet over medium heat. Stir in onion, fennel, and garlic; cook until the onion has softened and turned translucent, about 5 minutes. Add spinach and cook until wilted. Scrape mixture into a large bowl, and mix well with ricotta cheese and nutmeg.",
        "Using the same skillet, heat another 1 tablespoon olive oil over high heat. Brown ground beef in oil, mixing thoroughly to break into small pieces. Once browned, reduce heat to medium-low and pour off excess grease. Stir in tomato paste and tomato puree. Gently simmer until thickened, about 10 minutes.",
        "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13 inch lasagna dish.",
        "Line the bottom of the lasagna dish with 4 noodles, do not overlap. Spread the ricotta mixture evenly over noodles, then sprinkle with 1/3 of the Parmesan cheese. Place another 4 noodles on top of the ricotta, then spread with evenly with the mashed pumpkin.  Place the remaining 4 noodles on top of the pumpkin and top with the tomato sauce; sprinkle with another 1/3 of the Parmesan cheese. Stir the white sauce until smooth, then discard the bay leaves; pour the sauce over top of the lasagna. Sprinkle with remaining Parmesan cheese.",
        "Place lasagna dish onto a foil-lined baking sheet (to catch any spills). Bake in preheated oven until the noodles have softened, and the white sauce has turned bubbly and golden brown, about 30 minutes."
    ],
    "ingredients": [
        "1 pound peeled and seeded pumpkin, cut into pieces",
        "1 tablespoon butter, softened",
        "1 teaspoon ground cinnamon",
        "sea salt and ground black pepper to taste",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "1 cup milk",
        "2 bay leaves",
        "1 tablespoon olive oil",
        "1 onion, thinly sliced",
        "1 fennel bulb, thinly sliced",
        "4 cloves garlic, minced",
        "1 (10 ounce) bag baby spinach",
        "1 (16 ounce) container low-fat ricotta cheese",
        "1 1/2 teaspoons ground nutmeg",
        "1 tablespoon olive oil",
        "1/2 pound lean ground beef",
        "2 tablespoons tomato paste",
        "1 (14.25 ounce) can tomato puree",
        "12 dry lasagna noodles",
        "1/3 cup freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spinach, Ricotta and Pumpkin Lasagna",
    "url": "http://allrecipes.com/recipe/139289/spinach-ricotta-and-pumpkin-lasagna/"
}
