{
    "directions": [
        "Preheat the oven to 375 degrees F. Butter a 9-inch round casserole dish.",
        "Melt 3 tablespoons butter in a skillet over medium heat. Add the minced garlic and cook for a couple of minutes. Crank up the heat a bit and throw in the spinach. Stir the spinach around and cook for a couple of minutes until it wilts; season with salt and pepper. Transfer the spinach to a mesh strainer set over a bowl to drain. Set aside.",
        "Melt 2 tablespoons butter in the same skillet, throw in the quartered artichokes and cook over medium-high heat until the artichokes start to get a little color, about 3 minutes. Transfer the artichokes to the strainer with the spinach.",
        "In the same skillet or a different pot, melt the remaining 3 tablespoons butter and whisk in the flour until it makes a paste. Cook over medium-low heat for a minute or 2, then pour in the milk. Stir and cook until slightly thickened, about 3 minutes; splash in more milk if needed. Add the cream cheese, pepper Jack, feta, Parmesan and cayenne and stir until the cheeses are melted and the sauce is smooth. Chop the artichokes and spinach and add them to the sauce. Stir to combine.",
        "Pour the mixture into the prepared casserole dish. Top with extra grated pepper Jack and bake until the cheese is melted and bubbly, about 15 minutes. Serve with the Salted Pita Wedges.",
        "Preheat the oven to 375 degrees F.",
        "Cut the pita breads into 6 wedges each. Lay the wedges on a foil-lined baking sheet and brush both sides generously with the olive oil. Sprinkle both sides with salt, then bake until they're golden brown and crisp, 15 to 18 minutes."
    ],
    "ingredients": [
        "8 tablespoons (1 stick) butter, plus more for buttering the casserole dish",
        "1/4 cup minced garlic",
        "One 10-ounce bag fresh baby spinach",
        "Kosher salt and freshly ground black pepper",
        "Two 14-ounce cans artichoke hearts, rinsed, drained and quartered",
        "3 tablespoons all-purpose flour",
        "1 1/2 cups whole milk, plus more if needed",
        "One 8-ounce package cream cheese, softened",
        "3/4 cup grated pepper Jack cheese, plus more for topping",
        "1/2 cup crumbled feta",
        "1/2 cup grated Parmesan",
        "1/4 teaspoon cayenne",
        "Salted Pita Wedges, recipe follows, for serving",
        "6 pita breads",
        "1/2 cup olive oil",
        "1 tablespoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheese Dip",
        "Cheese",
        "Dip",
        "Artichoke Dip",
        "Artichoke",
        "Vegetable",
        "Artichoke Appetizer",
        "Appetizer",
        "Spinach Dip",
        "Spinach"
    ],
    "title": "Spinach Artichoke Dip",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/spinach-artichoke-dip"
}
