{
    "directions": [
        "In a large saute pan heat 1/4 cup of the olive oil. When almost smoking, add the mushrooms and season with salt and pepper. Cook until all the liquid has evaporated from the mushrooms, about 6 minutes. Add spinach and cook for 2 minutes. Remove from heat and place mixture into the bowl of a food processor. Pulse until you get a coarse texture. Place in bowl and stir in mascarpone and Parmesan cheese. Check for seasoning and set aside.",
        "Line up 3 wrappers on a cutting board. Brush with the egg and",
        "water mixture. Using a tablespoon, arrange 4 dollops of the filling on each wrapper ¿ 2 on the first row and 2 on the second ¿ 1-inch apart. Place another wrapper directly on top, pressing around the filling and sealing the edges. Using a fluted ravioli cutter, cut out squares of ravioli. Each filled wrapper will yield 4 raviolis, giving you a total of 12 ravioli. Place ravioli onto a floured baking sheet and keep covered with a linen towel.",
        "In a large pot, bring to a boil 4 quarts of salted and oiled water. Carefully add small batches of ravioli, about 3 to 4 at a time. This will prevent them from crowding in the pot and sticking together. Cook for 2 to 3 minutes. Using a spider strainer, carefully remove the ravioli and place on the plate. Tent with foil to keep warm and continue cooking remaining ravioli.",
        "In a saute pan, heat remaining 1/4 cup olive oil. When almost smoking, add chopped mushrooms and saute until soft and most of the liquid has evaporated, about 8 minutes. Carefully pour in tomato sauce and simmer for 5 minutes.",
        "Divide ravioli between 2 serving plates. Top with mushroom tomato sauce and sprinkle with Parmesan.",
        "In a large casserole pot, heat oil over medium high heat. Add onion and garlic and saute until soft and translucent, about 5 to 10 minutes. Add celery and carrots and season with salt and pepper. Saute until all the vegetables are soft, about 5 to 10 minutes. Add tomatoes and bay leaves and simmer uncovered on low heat for 1 hour or until thick. Remove bay leaves and check for seasoning. If sauce still tastes acidic, add unsalted butter, 1 tablespoon at a time to round out the flavors.",
        "Add 1/2 the tomato sauce into the bowl of a food processor. Process until smooth. Continue with remaining tomato sauce.",
        "If not using all the sauce, allow it to cool completely and pour 1 to 2 cup portions into freezer plastic bags. This will freeze up to 6 months."
    ],
    "ingredients": [
        "1/2 cup extra-virgin olive oil, 2 tablespoons for boiling water",
        "6 ounces button mushrooms, sliced",
        "1 (10-ounce) package frozen chopped spinach, thawed and squeezed dry",
        "1/4 cup mascarpone",
        "1/3 cup grated Parmesan, plus extra for garnishing",
        "6 egg roll wrappers (6 1/2 by 6 1/2-inch squares)",
        "2 large eggs, beaten with 1 teaspoon water",
        "1/2 cup mushroom (cremini, shiitake, button), finely chopped",
        "2 cups tomato sauce, recipe follows",
        "Salt and freshly ground black pepper",
        "1/2 cup extra-virgin olive oil",
        "1 small onion, chopped",
        "2 cloves garlic, chopped",
        "1 stalk celery, chopped",
        "1 carrot, chopped",
        "Sea salt and freshly ground black pepper",
        "2 (32-ounce) cans crushed tomatoes",
        "2 dried bay leaves",
        "4 tablespoons unsalted butter, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Skillet Recipes",
        "Food Processor",
        "European Recipes",
        "Italian",
        "Pasta Recipes",
        "Ravioli",
        "Holiday",
        "Celery",
        "Vegetable",
        "Mushroom",
        "Cheese",
        "Carrot Recipes",
        "Meat",
        "Tomato",
        "Spinach",
        "Recipes for Two"
    ],
    "title": "Spinach and Mushroom Ravioli",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/spinach-and-mushroom-ravioli-recipe2"
}
