{
    "directions": [
        "Preheat oven to 375°F.",
        "In a shallow baking pan toast pine nuts in middle of oven until golden, about 4 minutes, and cool. Finely chop onion and in a large heavy skillet cook in oil over moderately low heat, stirring, until softened. Squeeze spinach to remove as much liquid as possible and stir with salt into onion. Cook spinach mixture over moderate heat, stirring occasionally, until any liquid is evaporated, 1 to 2 minutes, and cool slightly. In a large bowl whisk eggs until combined and stir in spinach mixture, pine nuts, feta, and bread crumbs until combined well. Filling may be made 1 day ahead and chilled, covered. Bring filling to room temperature before proceeding.",
        "Stack phyllo sheets and cover with 2 overlapping sheets plastic wrap and then a dampened kitchen towel. In a small saucepan melt butter and cool slightly. Lightly brush a 10 1/2- by 7 1/2- by 1-inch rectangular tart pan with a removable fluted rim with butter.",
        "On a work surface lightly brush 1 phyllo sheet with butter. Sprinkle 1 tablespoon Parmesan evenly over buttered phyllo and repeat layering with 5 more phyllo sheets, butter, and 5 tablespoons Parmesan. Arrange last phyllo sheet on stack and lightly brush with butter. Transfer phyllo to tart pan, letting excess hang over edge, and spoon filling onto phyllo, spreading evenly. Fold edges of pastry over filling, leaving center uncovered , and lightly brush top of phyllo with butter. Sprinkle remaining 1/4 cup Parmesan over exposed filling and bake tart in middle of oven until golden, 25 to 30 minutes. Serve tart warm or at room temperature."
    ],
    "ingredients": [
        "1/2 cup pine nuts (about 3 ounces)",
        "1 medium onion",
        "1/3 cup olive oil",
        "two 10-ounce packages frozen chopped spinach, thawed",
        "1/2 teaspoon salt",
        "2 large eggs",
        "1/2 cup crumbled feta (about 3 ounces)",
        "1 tablespoon fine dry bread crumbs",
        "seven 17- by 12-inch phyllo sheets",
        "5 tablespoons unsalted butter",
        "6 tablespoons plus 1/4 cup freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Bake",
        "Vegetarian",
        "Lunch",
        "Feta",
        "Parmesan",
        "Pine Nut",
        "Spinach",
        "Healthy",
        "Phyllo/Puff Pastry Dough",
        "Gourmet"
    ],
    "title": "Spinach, Feta, and Pine-Nut Phyllo Tart",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-feta-and-pine-nut-phyllo-tart-15723"
}
