{
    "directions": [
        "Cook spinach according to package instructions and drain well. Cool spinach completely and squeeze dry by handfuls.",
        "In a saucepan bring broth and water to a simmer and keep at a bare simmer.",
        "In a large saucepan cook onion in oil over moderately low heat, stirring, until softened. Stir in rice, stirring until each grain is coated with oil. Add wine or vermouth and cook, covered, over moderately high heat, stirring, until wine is absorbed. Add about 3/4 cup simmering broth and cook over moderately high heat, stirring constantly, until broth is absorbed. Continue adding broth, about 3/4 cup at a time, cooking, stirring constantly and letting each addition be absorbed before adding the next, until about half of broth has been added. Reduce heat to moderate if necessary to keep risotto at a strong simmer. Continue adding broth in the same manner until rice is tender and creamy looking but still al dente, about 18 minutes.",
        "Stir spinach and Pernod into rice and add salt and pepper to taste. Remove pan from heat and stir in 1/4 cup Parmesan. Serve risotto with remaining 1/4 cup Parmesan."
    ],
    "ingredients": [
        "a 10-ounce package frozen chopped spinach",
        "3 cups chicken broth",
        "1 cup water",
        "1 cup finely chopped onion",
        "2 tablespoons olive oil",
        "1 cup long-grain rice",
        "1/3 cup dry white wine or dry vermouth",
        "1 teaspoon Pernod if desired",
        "1/2 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Vegetable",
        "Side",
        "High Fiber",
        "Parmesan",
        "Spinach",
        "White Wine",
        "Healthy",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spinach Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-risotto-10057"
}
