{
    "directions": [
        "1. Heat the oil in a large skillet over medium-low heat. Add the onion and a pinch of salt. Cover and simmer, stirring occasionally, 6 minutes. Add the leek, season with more salt and the pepper, and continue to cook, stirring occasionally, until the vegetables are very soft and translucent, about 8 minutes. Transfer to a bowl and set in an ice bath to cool.",
        "2. Meanwhile, preheat oven to 325°F.",
        "3. Generously coat an 8-inch round nonstick springform pan with butter and chill.",
        "4. Sift together the flour and baking powder in a medium bowl; set aside.",
        "5. Combine the yogurt, feta, onion-and-leek mixture, spinach, and dill in a large bowl. Add the eggs and stir to combine. Using a rubber spatula, gently stir in the flour mixture and season with more salt and pepper. Pour into the prepared pan, gently tapping the sides to level the top.",
        "6. Bake for 30 minutes. Increase heat to 425°F and bake until golden brown and set in the center, about 10 minutes more.",
        "7. Transfer to a wire rack and cool for 10 minutes before unmolding.",
        "8. Cut into wedges and serve."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil",
        "1 large Spanish onion, peeled and finely diced",
        "Coarse salt",
        "1 leek (white part only), washed well and thinly sliced crosswise",
        "Freshly ground pepper",
        "1 tablespoon unsalted butter, at room temperature",
        "1 cup all-purpose flour",
        "3/4 teaspoon baking powder",
        "7 ounces Greek yogurt",
        "11 ounces feta cheese, crumbled",
        "1 cup sautéed spinach, squeezed very dry and chopped",
        "1/4 cup chopped fresh dill",
        "3 large eggs, at room temperature, beaten"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Onion",
        "Breakfast",
        "Brunch",
        "Bake",
        "Kid-Friendly",
        "Quick & Easy",
        "Yogurt",
        "Lunch",
        "Feta",
        "Leek",
        "Spinach",
        "Dill",
        "Cookie",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spinach, Leek, and Cheese Pie",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-leek-and-cheese-pie-239023"
}
