{
    "directions": [
        "Heat the olive oil in a large pan set over medium heat. Add the onion and jalapeño and cook, stirring occasionally, until softened, 6 to 8 minutes. Add the garlic, coriander, cinnamon, and salt, and cook, stirring, until fragrant, 1 to 2 minutes​.",
        "Add the spinach and lemon juice to the pan, turn the heat to low, cover, and cook, tossing occasionally with tongs, until the spinach is very soft, 7 to 10 minutes. (If the spinach does not fit all at once in the pan, add a little at a time, adding more as the spinach in the pan wilts.) Uncover and evenly spread the mixture across the bottom of the pan. Use the back of the spoon to make four to six shallow indentations​ in the surface of the greens mixture to hold the eggs while they cook.",
        "Break the eggs into small cups and gently slide them into the indentations. Raise the heat to medium, cover the pan , and cook until the whites are set but the yolks are still a bit runny, 4 to 5 minutes. Remove the pan​ from the heat. Drizzle a little more olive oil on top and sprinkle with pepper, feta, and cilantro. Serve hot, directly from the pan."
    ],
    "ingredients": [
        "3 tablespoons extra-virgin olive oil, plus more for drizzling",
        "1 large yellow onion, finely chopped",
        "1 small jalapeño, seeded and finely chopped",
        "4 garlic cloves, finely chopped",
        "1/4 teaspoon ground coriander",
        "1/4 teaspoon ground cinnamon",
        "1 teaspoon kosher salt",
        "10 ounces (280 g) baby spinach",
        "2 teaspoons fresh lemon juice",
        "4–6 eggs",
        "Freshly ground black pepper",
        "Feta cheese and roughly chopped fresh cilantro, for sprinkling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Spinach",
        "Feta",
        "Breakfast",
        "Brunch",
        "Coriander",
        "Jalapeño",
        "Cilantro",
        "Egg",
        "cookbooks",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spinach Shakshuka",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-shakshuka"
}
