{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Heat olive oil in medium-sized pan. Cook and stir onions and green onions until soft. Add tomatoes; cook and stir another 2 to 3 minutes. Add spinach and cook until wilted. Season with salt and pepper. Remove from heat.",
        "Season both sides of chicken breasts with salt and pepper. Place half of spinach mixture on each chicken breast. Carefully roll up and place in baking dish, seam side down. Sprinkle with paprika. Bake in preheated oven until no longer pink in the center and the juices run clear, about 35 to 40 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
        "Let chicken rest for 5 minutes. Top with gravy.",
        "Mix flour, 1/2 teaspoon salt, 1/4 teaspoon black pepper, garlic powder, and onion powder together in a small bowl. Whisk in Lactaid(R) milk until well blended and smooth.",
        "Place chicken broth and 1/4 cup Lactaid milk in a saucepan. Bring to a boil. Slowly add flour mixture to saucepan and continue to stir and simmer until thickened, 3 to 4 minutes."
    ],
    "ingredients": [
        "2 boneless, skinless chicken breast halves, pounded to 1/2-inch thickness",
        "Salt and black pepper to taste",
        "2 teaspoons paprika, or to taste",
        "Stuffing:",
        "1 tablespoon extra-virgin olive oil",
        "1/4 cup chopped onion",
        "2 tablespoons sliced green onions, green part only",
        "2 small roma (plum) tomatoes, chopped",
        "5 ounces baby spinach leaves",
        "Salt and black pepper to taste",
        "Gravy:",
        "6 tablespoons all-purpose flour",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon onion powder",
        "1 1/4 cups chicken broth",
        "3/4 cup LACTAID® Whole Milk, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spinach Stuffed Chicken and Gravy",
    "url": "http://allrecipes.com/recipe/253156/spinach-stuffed-chicken-and-gravy/"
}
