{
    "directions": [
        "Preheat oven to 425°F.",
        "In a bowl with a pastry blender or in a small food processor blend together flour, butter, shortening, and a pinch salt until mixture resembles meal. Add water and toss until incorporated, adding additional water if necessary to form a dough. Pat dough onto bottom and one half inch up sides of a 7 1/2-inch tart pan with removable fluted rim or a 9-inch pie plate and bake shell in bottom third of oven until set and pale golden, about 7 minutes.",
        "While shell is baking, in a large skillet sauté bell pepper in oil over moderately high heat, stirring, 1 minute. Add spinach and sauté, stirring, until wilted and tender, about 1 minute. Remove skillet from heat and season spinach mixture with salt and pepper. In a small bowl whisk together eggs and cream.",
        "Sprinkle feta over bottom of shell and arrange spinach mixture on top. Pour cream mixture over spinach and bake quiche on a baking sheet in middle of oven 15 minutes. Reduce temperature to 350°F. and bake until set, about 10 minutes."
    ],
    "ingredients": [
        "1/3 cup plus 3 tablespoons all-purpose flour",
        "3 tablespoons cold unsalted butter",
        "1 tablespoon cold vegetable shortening",
        "1 1/2 tablespoons ice water plus additional if necessary",
        "N/A water",
        "1/3 cup sliced red bell pepper",
        "1 tablespoon olive oil",
        "2 cups packed fresh spinach leaves, trimmed and washed thoroughly (about 5 ounces)",
        "2 large eggs",
        "1/3 cup heavy cream or milk",
        "1/3 cup crumbled feta cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Brunch",
        "Side",
        "Bake",
        "Vegetarian",
        "Feta",
        "Spinach",
        "Bell Pepper",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spinach, Red Pepper, and Feta Quiche",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-red-pepper-and-feta-quiche-11515"
}
