{
    "directions": [
        "Using your hands, squeeze spinach until dry, forcing out as much water as possible (too much water will make for a soggy filling; you should have about 2/3 cup well-drained spinach). Mix spinach and next 5 ingredients in a medium bowl. Season to taste with salt and pepper. In a small bowl, beat 1 egg to blend; fold into spinach mixture.",
        "Cut puff pastry into 3 equal strips. Reserve 1 strip for another use. Cut each remaining strip into 3 squares for a total of 6. Place a square in each muffin cup, pressing into bottom and up sides and leaving corners pointing up. Divide filling among cups. Fold pastry over filling, pressing corners together to meet in center. DO AHEAD: Spinach puffs can be assembled 3 hours ahead. Cover puffs and chill.",
        "Preheat oven to 400°F. Beat remaining egg to blend in a small bowl. Brush pastry with egg wash (this will give the pastry a nice sheen). Bake until pastry is golden brown and puffed, about 25 minutes. Transfer to a wire rack; let puffs cool in pan for 10 minutes. Run a sharp paring knife around pan edges to loosen; turn out puffs onto rack to cool slightly before serving."
    ],
    "ingredients": [
        "1 10-ounce package frozen chopped spinach, thawed",
        "1/2 cup crumbled feta",
        "1/4 cup minced onion",
        "1 tablespoon olive oil",
        "1 teaspoon chopped dill",
        "1 teaspoon minced garlic",
        "Kosher salt and freshly ground black pepper",
        "freshly ground black pepper",
        "2 large eggs",
        "1 sheet frozen puff pastry (from a 17.3-ounces package), thawed, rolled out to a 12\" square, kept chilled",
        "Special equipment: A standard 6-cup muffin pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Quick & Easy",
        "Dinner",
        "Feta",
        "Spinach",
        "Phyllo/Puff Pastry Dough",
        "Wedding",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spinach Puffs",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-puffs-51122450"
}
