{
    "directions": [
        "Cook spinach according to package instructions. Drain in a colander, then refresh under cold running water to stop the cooking, and drain well again. Transfer spinach to a clean kitchen towel (not terry cloth) twisting the ends together, and squeeze as much liquid as possible from the spinach. Transfer spinach to a large bowl.",
        "Cook scallions with 1/4 teaspoon salt in olive oil in a 9- to 10-inch non-stick skillet over medium heat, stirring, until softened, 2 to 3 minutes. Add sorrel and cook, stirring and adding 1 tablespoon water if sorrel is dry, until wilted, about 1 minute (sorrel will turn khaki gray almost immediately when heated). Add sorrel mixture to spinach and stir well.",
        "Stir in yolk, then feta, nutmeg, dill, and salt and pepper to taste and combine mixture well.",
        "Preheat oven to 375°F. Line a large rimmed baking sheet with parchment paper.",
        "Cover phyllo stack with 2 overlapping sheets of plastic wrap and then a dampened kitchen towel.",
        "Take 1 phyllo sheet from stack and arrange on a work surface with a long side nearest you (keeping remaining sheets covered) and brush all over with some butter. Cut buttered phyllo stack lengthwise into 4 strips, each about 3-inches wide and 17- inches long.",
        "Put a heaping teaspoon of filling near 1 corner of a strip on end nearest you, then fold corner of phyllo over to enclose filling and form a triangle. Continue folding strip (like a flag), maintaining triangle shape. Brush triangle all over with butter. Put triangle, seam side down, on parchment-lined sheet. Make more triangles in same manner, using all of phyllo.",
        "For best results, freeze spanakopita until firm, about 20 minutes.",
        "Bake triangles in middle of oven until golden brown, 20 to 25 minutes, then transfer to a rack to cool slightly."
    ],
    "ingredients": [
        "1 (10-oz) package frozen chopped spinach",
        "1 cup chopped scallions",
        "Salt",
        "1 tablespoon olive oil",
        "1/4 pound fresh sorrel leaves, chopped (2 packed cups)",
        "1 egg yolk, lightly beaten",
        "8 ounces feta, crumbled (1 cup)",
        "1/4 teaspoon ground nutmeg",
        "3 tablespoons chopped fresh dill, or to taste",
        "Freshly ground black pepper",
        "10 (17- by 12-inch) sheets phyllo, thawed if frozen",
        "1 1/2 sticks (3/4 cup) unsalted butter, melted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Feta",
        "Spinach",
        "Phyllo/Puff Pastry Dough",
        "Green Onion/Scallion",
        "Oscars"
    ],
    "title": "Spinach and Sorrel Spanakopita",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-and-sorrel-spanakopita-51240810"
}
