{
    "directions": [
        "In a small sauté pan over medium-high heat, warm the 2 tsp. olive oil. Add the pancetta and cook, stirring occasionally, until browned and crisp, about 4 minutes. Pour into a fine-mesh sieve set over a small heatproof bowl, capturing the fat, and set aside.",
        "In a small bowl, whisk together the vinegar, thyme and sugar until the sugar dissolves.",
        "Return the sauté pan to medium-high heat (it will still be filmed with fat). Add the shallot and sauté until soft but not browned, about 1 minute. Add the vinegar mixture, bring to a boil and boil for 1 minute, scraping up the browned bits with a wooden spoon. Remove from the heat. Add a few grinds of pepper and 1 1/2 Tbs. of the reserved pancetta fat to the pan, supplementing with olive oil if needed. Whisk until well blended to make a vinaigrette. Taste and adjust the seasoning with salt and pepper, then cover to keep warm.",
        "Pour water to a depth of 3 inches into a large sauté pan, add a pinch of salt and bring to a simmer over medium heat. Crack each egg into a small ramekin and carefully slip the eggs into the water. Adjust the heat so that the water barely simmers. Poach the eggs for 3 to 5 minutes, then remove them from the water with a slotted spoon and place on a paper towel-lined plate.",
        "In a bowl, toss the spinach with a pinch of salt and a few grinds of pepper. Whisk the warm vinaigrette to recombine, then drizzle about half of it over the spinach and toss well. Taste and adjust the seasoning with salt and pepper.",
        "Divide the dressed spinach evenly between 2 plates and top each serving with a poached egg. Drizzle each egg with some of the remaining vinaigrette and season lightly with salt and pepper. Scatter the cooked pancetta over the salads and serve immediately. Serves 2.",
        "Adapted from Williams-Sonoma",
        "Two in the Kitchen",
        ", by Christie Dufault & Jordan Mackay (Weldon Owen, 2012)."
    ],
    "ingredients": [
        "2 tsp. extra-virgin olive oil, plus more as needed",
        "2 oz. pancetta, cut into 1/4-inch cubes",
        "3 Tbs. red wine vinegar",
        "1 tsp. fresh thyme leaves",
        "Pinch of sugar",
        "1 shallot, minced",
        "Coarse salt and freshly ground pepper, to taste",
        "2 eggs",
        "5 oz. baby spinach"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Spinach Salad with Poached Eggs and Pancetta",
    "url": "http://www.williams-sonoma.com/recipe/spinach-salad-with-poached-eggs-and-pancetta.html"
}
