{
    "directions": [
        "Trim and tie lamb. Season lamb with salt and pepper and in a sealable plastic bag combine lamb, 2 tablespoons oil, and 1 tablespoon basil, turning lamb to coat evenly. Marinate lamb, covered and chilled, 4 hours.",
        "Cut roasted peppers into thin 2-inch long strips and in a bowl combine with vinegar and 2 tablespoons oil. Chill peppers, covered, until assembling salad.",
        "In another bowl coarsely crumble goat cheese and gently stir together with 2 tablespoons oil and 1 tablespoon basil. Chill goat cheese, covered, until assembling salad.",
        "In a blender blend remaining 1/4 cup oil, remaining tablespoon basil, and salt and pepper to taste until smooth. Transfer basil oil to a small bowl. Chill basil oil, covered, while preparing lamb. Bring basil oil to room temperature before assembling salad.",
        "Preheat oven to 450°F.",
        "Heat an ovenproof heavy skillet (preferably cast-iron) over moderately high heat until hot and brown lamb on all sides. Put skillet in middle of oven and roast lamb about 10 minutes, or until a meat thermometer registers 140°F. for medium-rare. Cool lamb. Chill lamb, covered, at least 2 hours and up to 1 day. Cut lamb into thin slices.",
        "Discard coarse stems from spinach and arrange leaves around edges of 4 large plates. Scatter come peppers evenly over spinach and mound some goat cheese in center of each plate. Arrange lamb slices around goat cheese and drizzle salads with basil oil."
    ],
    "ingredients": [
        "a 1 1/2-pound boneless lamb loin",
        "1/2 cup plus 2 tablespoons extra-virgin olive oil",
        "3 tablespoons finely chopped fresh basil leaves",
        "3 red bell peppers,roasted and peeled",
        "2 tablespoons aged red-wine vinegar",
        "10 ounces soft mild goat cheese",
        "1 bunch spinach (about 6 cups packed)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Blender",
        "Lamb",
        "Marinate",
        "Roast",
        "Goat Cheese",
        "Basil",
        "Spinach",
        "Bell Pepper",
        "Summer",
        "Chill",
        "Gourmet"
    ],
    "title": "Spinach Salad with Lamb and Basil",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-salad-with-lamb-and-basil-14187"
}
