{
    "directions": [
        "Remove the stems from the spinach and wash, drain and pat dry thoroughly. Place into a large mixing bowl and set aside.",
        "Place the eggs into an electric kettle and cover with cold water by at least 1-inch. Turn the kettle on. Once the water comes to a boil, the kettle will turn itself off. Leave the eggs in the water for 15 minutes. Remove and peel off the shell. Slice each egg into 8 pieces and set aside.",
        "While the eggs are cooking, fry the bacon and remove to a paper towel to drain, reserving 3 tablespoons of the rendered fat. Crumble the bacon and set aside.",
        "Transfer the fat to a small saucepan set over low heat and whisk in the red wine vinegar, sugar and Dijon mustard. Season with a small pinch each of kosher salt and black pepper.",
        "Add the mushrooms and the sliced onion to the spinach and toss. Add the dressing and bacon and toss to combine. Divide the spinach between 4 plates or bowls and evenly divide the egg among them. Season with pepper, as desired. Serve immediately."
    ],
    "ingredients": [
        "8 ounces young spinach",
        "2 large eggs",
        "8 pieces thick-sliced bacon, chopped",
        "3 tablespoons red wine vinegar",
        "1 teaspoon sugar",
        "1/2 teaspoon Dijon mustard",
        "Kosher salt and freshly ground black pepper",
        "4 large white mushrooms, sliced",
        "3 ounces red onion (1 small), very thinly sliced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Appetizer",
        "Appetizer",
        "Easy Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Mushroom Salad",
        "Mushroom",
        "Salad Recipes",
        "Vegetable",
        "Spinach Salad",
        "Spinach",
        "Meat",
        "Bacon Recipes",
        "Egg Recipes",
        "Onion Recipes"
    ],
    "title": "Spinach Salad with Warm Bacon Dressing",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/spinach-salad-with-warm-bacon-dressing-recipe"
}
