{
    "directions": [
        "In a heavy saucepan cover lentils with water by 2 inches and simmer until just tender but not falling apart, about 15 minutes. Drain lentils well in a sieve. Rinse lentils under cold running water to stop cooking and drain well. In a bowl toss lentils with 2 tablespoons vinegar and salt and pepper to taste. (Lentils may be made 2 days ahead and chilled, covered. Bring lentils to room temperature before proceeding.)",
        "In a skillet cook bacon over moderate heat until crisp and with tongs transfer to paper towels to drain. Crumble bacon.",
        "In cleaned saucepan heat 2 tablespoons oil over moderate heat until hot but not smoking and cook shallot, stirring, until golden brown. Stir in water, cherries, sugar, and remaining 5 tablespoons vinegar and simmer, stirring occasionally, until liquid is reduced by about half, about 10 minutes. Reduce heat to low and whisk in remaining 2 tablespoons oil in a slow stream until emulsified. Season vinaigrette with salt and pepper.",
        "Add half of vinaigrette to lentils and toss well. In another bowl toss spinach with half of lentil mixture, half of bacon, half of cheese, remaining vinaigrette, and salt and pepper to taste.",
        "Divide remaining lentil mixture among 6 plates and top with spinach mixture. Sprinkle salads with remaining bacon and cheese."
    ],
    "ingredients": [
        "3/4 cup green lentils",
        "7 tablespoons red-wine vinegar",
        "8 bacon slices (about 6 ounces)",
        "1/4 cup olive oil",
        "1/3 cup finely chopped shallot",
        "1/4 cup water",
        "1/2 cup dried unsweetened tart cherries (about 3 ounces)",
        "2 tablespoons sugar",
        "3 1/2 cups baby or regular spinach leaves",
        "1/3 cup blue cheese (about 2 ounces), preferably Oregon Blue"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Blue Cheese",
        "Cherry",
        "Bacon",
        "Spinach",
        "Lentil",
        "Simmer",
        "Gourmet"
    ],
    "title": "Spinach and Lentil Salad with Oregon Blue Cheese and Tart Cherry Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-and-lentil-salad-with-oregon-blue-cheese-and-tart-cherry-vinaigrette-14472"
}
