{
    "directions": [
        "Blend together flour, butter, and salt in a bowl with your fingertips or a pastry blender until mixture resembles coarse meal, with remainder in small (pea-size) lumps. Drizzle 6 tablespoons ice water over mixture and gently stir with a fork until incorporated.",
        "Test mixture by gently squeezing a small handful: It should hold together. If not, add more water, 1 tablespoon at a time, stirring after each addition until incorporated. (Do not overwork.)",
        "Turn dough out onto a work surface and divide into 2 portions. With heel of your hand, smear each portion once in a forward motion to distribute fat. Form each portion of dough into a disk. Wrap separately in plastic wrap and chill until firm (1 hour) or up to 1 day.",
        "Squeeze spinach, 1 handful at a time, to extract as much moisture as possible.",
        "Cook half of ham, overlapping slices, in 1/4 tablespoon butter in a 12-inch heavy skillet over moderate heat, turning, until golden. Transfer to a plate and cook remaining ham in 1/4 tablespoon more butter in same manner.",
        "Cook onions in remaining 1 1/2 tablespoons butter in same skillet over moderately low heat, stirring, until softened. Add flour and cook, stirring, 2 minutes. Remove from heat, then stir in mustard and cool completely.",
        "Preheat oven to 400°F.",
        "Roll out 1 piece chilled dough into a 13-inch round on a lightly floured surface and fit into a 9-inch pie plate. Spread half of onions evenly in pie shell and season with pepper. Scatter half of spinach and then half of carrots on top and season with pepper. Top with half of ham and half of cheese, pressing down to compress layers. Repeat layering with remaining filling ingredients, seasoning with pepper.",
        "Roll out remaining dough into an 11-inch round on floured surface and place on top of pie. Trim edges of top and bottom crusts, leaving a 1/2-inch overhang, then seal edges and crimp.",
        "Beat egg and brush some over top crust. Cut several steam vents in center.",
        "Bake pie on a baking sheet in middle of oven until top is golden and pie is steaming, 50 to 55 minutes. Cool 15 minutes before serving."
    ],
    "ingredients": [
        "2 1/4 cups all-purpose flour",
        "1 1/2 sticks (3/4 cup) cold unsalted butter, cut into 1/2-inch pieces",
        "1 teaspoon salt",
        "6 to 8 tablespoons ice water",
        "2 (10-ounce) boxes frozen chopped spinach, thawed",
        "3/4 pound thinly sliced boiled ham",
        "2 tablespoons unsalted butter",
        "2 onions, thinly sliced",
        "2 tablespoons all-purpose flour",
        "3 tablespoons coarse-grained mustard",
        "3 carrots, coarsely grated",
        "3/4 lb coarsely grated Swiss cheese",
        "1 large egg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mustard",
        "Pork",
        "Vegetable",
        "Bake",
        "Ham",
        "Spinach",
        "Carrot",
        "Swiss Cheese",
        "Gourmet"
    ],
    "title": "Spinach, Ham, and Cheese Pie (Pye of Several Things)",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-ham-and-cheese-pie-pye-of-several-things-104247"
}
