{
    "directions": [
        "Place frozen chopped spinach in microwave-safe bowl with water. Cook in microwave until hot, 6 to 7 minutes; cool until easily handled. Squeeze spinach to extract liquid. Combine spinach, Parmesan cheese, olive oil, parsley, garlic, basil, 1/4 teaspoon salt, and pepper in the bowl of a food processor; puree until smooth.",
        "Place each chicken breast between 2 pieces of plastic wrap; pound each breast using a meat mallet until flattened. Remove plastic wrap; sprinkle breasts with salt and pepper. Spread spinach mixture on each breast, top with Monterey Jack cheese strips, roll chicken, and secure with toothpicks. Dip each chicken roll in melted butter; coat thoroughly with bread crumbs. Place chicken rolls side by side in an 8-inch microwave-safe baking dish with seam-side down. Cover dish with plastic wrap, leaving 1/2 inch of one side uncovered to vent steam.",
        "Cook chicken rolls in microwave until juices run clear and chicken is firm to the touch, 10 to 12 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
    ],
    "ingredients": [
        "Spinach Pesto Sauce:",
        "1 (10 ounce) package frozen chopped spinach",
        "1 tablespoon water",
        "2/3 cup grated Parmesan cheese",
        "1/2 cup olive oil",
        "1/3 cup chopped fresh parsley",
        "2 cloves garlic, minced",
        "1 tablespoon basil",
        "1/4 teaspoon salt, or more to taste",
        "ground black pepper to taste",
        "Chicken Breasts:",
        "4 skinless, boneless chicken breasts",
        "salt and ground black pepper to taste",
        "4 slices Monterey Jack cheese, cut into strips",
        "1/4 cup melted butter",
        "1/4 cup seasoned bread crumbs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spinach Pesto Chicken Rolls",
    "url": "http://allrecipes.com/recipe/245796/spinach-pesto-chicken-rolls/"
}
