{
    "directions": [
        "Preheat the oven to 400 degrees F. Butter the inside of a 6 to 8-cup souffle dish (6 1/2 to 7 1/2 inches in diameter by 3 1/2 inches deep) and sprinkle evenly with Parmesan.",
        "Melt the butter in a small saucepan over low heat. With a wooden spoon, stir in the flour and cook, stirring constantly, for 2 minutes. Off the heat, whisk in the hot milk, the nutmeg, cayenne, 1/2 teaspoon salt and 1/4 teaspoon pepper. Cook over low heat, whisking constantly, for 1 minute, until smooth and thick.",
        "Off the heat, while still hot, whisk in the egg yolks, one at a time. Stir in the Cheddar, 1/4 cup of Parmesan and the spinach and transfer to a large mixing bowl.",
        "Put the egg whites, cream of tartar, and a pinch of salt in the bowl of an electric mixer fitted with the whisk attachment. Beat on low speed for 1 minute, on medium speed for 1 minute, then finally on high speed until they form firm, glossy peaks.",
        "Whisk one quarter of the egg whites into the cheese sauce to lighten and then fold in the rest. Pour into the souffle dish, then smooth the top. Draw a large circle on top with the spatula to help the souffle rise evenly, and place in the middle of the oven. Turn the temperature down to 375 degrees F. Bake for 30 to 35 minutes (don't peek!) until puffed and brown. Serve immediately."
    ],
    "ingredients": [
        "3 tablespoons unsalted butter, plus extra for greasing the dish",
        "1/4 cup finely grated Parmesan cheese, plus extra for sprinkling",
        "3 tablespoons all-purpose flour",
        "1 cup scalded milk",
        "1/4 teaspoon of nutmeg",
        "Pinch of cayenne pepper",
        "Kosher salt and freshly ground black pepper",
        "4 extra-large egg yolks, at room-temperature",
        "1/2 cup grated aged Cheddar cheese, lightly packed",
        "1 package frozen chopped spinach, defrosted and squeezed dry",
        "5 extra-large egg whites, at room temperature",
        "1/8 teaspoon cream of tartar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheddar",
        "Cheese",
        "Spinach",
        "Vegetable"
    ],
    "title": "Spinach and Cheddar Souffle",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/spinach-and-cheddar-souffle-recipe"
}
