{
    "directions": [
        "1. Preheat the oven to 375°F. Butter a 6-cup soufflé dish or gratin dish and dust it with a few tablespoons of the Parmesan cheese.",
        "2. Put the garlic, cream, and thyme in a small saucepan over low heat. Bring slowly to a boil, then turn off the heat, cover, and let steep for 15 minutes.",
        "3. Wash the spinach well, then wilt it in a skillet with the water clinging to the leaves. Tip it into a colander, press out the moisture, then finely chop.",
        "4. Melt the 4 tablespoons butter in a saucepan, stir in the flour, and cook for 1 minute while stirring. Whisk in the milk and stir until it thickens. Add 1 teaspoon salt, then stir in the goat cheese and remaining Parmesan. Turn off the heat and stir in the egg yolks, spinach, and the garlic-cream mixture. Season with pepper.",
        "5. Whisk the egg whites with a pinch of salt until they form firm peaks that are just a bit on the soft side. Fold the whites and base together. Scrape the batter into the prepared dish and bake until golden brown and set, about 25 minutes for a gratin dish, 30 minutes if using a soufflé dish."
    ],
    "ingredients": [
        "3/4 to 1 cup minced green garlic, about 5 small heads",
        "1 cup cream or half-and-half",
        "1 thyme sprig",
        "4 tablespoons unsalted butter, plus extra for the dish",
        "1/2 cup freshly grated Parmesan cheese",
        "1 bunch spinach, stems removed, or 12 to 16 ounces loose, young spinach leaves",
        "4 tablespoons all-purpose flour",
        "1 1/3 cups milk",
        "sea salt and freshly ground pepper",
        "1 scant cup (about 4 ounces) mild goat cheese",
        "4 egg yolks",
        "6 egg whites"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Garlic",
        "Side",
        "Bake",
        "Vegetarian",
        "Goat Cheese",
        "Parmesan",
        "Spinach",
        "Boil",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spinach and Green Garlic Soufflé",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-and-green-garlic-souffle-355946"
}
