{
    "directions": [
        "In a fry pan over medium-high heat, warm the olive oil. Add the bacon and cook, stirring occasionally, until crisp and browned, about 8 minutes. Add the shallot to the pan and cook, stirring constantly, for 30 seconds. Using a spoon, transfer the bacon and shallots to a paper towel–lined plate to drain, leaving the bacon fat in the pan.",
        "Add the spinach to the same fry pan over medium-high heat and sauté until the spinach is just wilted, about 2 minutes. Transfer the spinach to a bowl. Let cool to room temperature, then stir in the bacon and shallots and the cheese.",
        "Preheat an electric panini press on the “sear” setting according to the manufacturer’s instructions.",
        "Using a flat meat pounder, pound each chicken breast half until flattened to an even thickness of about 1/4 inch (6 mm). Season the chicken on both sides with salt and pepper. Place half of the cheese and bacon mixture on top of one of the chicken breasts, spreading it evenly. Starting at one of the narrow ends of the chicken, gently roll the chicken around the cheese and bacon mixture, securing the roll closed with kitchen twine. Repeat with remaining chicken breast and the remaining cheese and bacon mixture.",
        "Place the stuffed chicken breasts on the preheated panini press, close the lid and cook until the chicken is lightly browned and cooked through, about 10 minutes.",
        "Transfer the chicken breasts to a platter and cover loosely with aluminum foil. Let rest for 5 minutes. Cut each chicken breast on the diagonal into thick slices and serve immediately. Serves 4.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "1 tsp. olive oil",
        "4 oz. (125 g) thick-cut bacon, cut into 1/4-inch (6-mm) dice",
        "1 shallot, minced",
        "4 cups (4 oz./125 g) lightly packed baby spinach leaves",
        "1 1/2 cups (8 oz./180 g) shredded Monterey jack cheese",
        "2 boneless, skinless chicken breast halves, each about 8 oz. (250 g)",
        "Kosher salt and freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Spinach- and Cheese-Stuffed Chicken Breasts",
    "url": "http://www.williams-sonoma.com/recipe/spinach-and-cheese-stuffed-chicken-breasts.html"
}
