{
    "directions": [
        "In a large bowl, beat together cream cheese and 2/3 cup butter.  Mix in 2 cups flour, a teaspoon baking powder, 1/2 teaspoon salt, and 1/4 teaspoon baking soda; beat well.  Divide dough into two balls; wrap in plastic wrap.  Chill 30 to 60 minutes or until pastry is easy to handle.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Heat spinach in large frying pan over medium-low heat; drain.  Squeeze out excess liquid; set aside.",
        "In a large frying pan, melt the 2 tablespoons butter.  Stir in mushrooms and onion.  Cook and stir over medium heat for 3 minutes or until onion is tender.  Mix in spinach, remaining 1 tablespoon flour, oregano, salt, lemon juice and garlic powder.  Cook and stir until mixture thickens.  Stir in Parmesan cheese.  Set aside to cool.",
        "On floured surface, roll a pastry ball into a 12x7-inch rectangle.  Spread with half the spinach mixture to within 1/2 inch of edges.  Starting with a short side, roll up dough and filling, jelly-roll style.  Moisten edges with water; pinch to seal.  Repeat with remaining pastry.  Cover; chill 1 hour. Slice logs into 1/2-inch thick slices.  Place on ungreased baking sheets.",
        "Bake 20 minutes or until golden.  Remove to wire racks; cool."
    ],
    "ingredients": [
        "1 (8 ounce) package cream cheese, softened",
        "2/3 cup butter, softened",
        "2 cups all-purpose flour",
        "1 tablespoon all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/4 teaspoon baking soda",
        "1 (10 ounce) package frozen chopped spinach",
        "2 tablespoons butter",
        "2 1/2 cups chopped mushrooms",
        "1 cup chopped onion",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon salt",
        "1/2 teaspoon lemon juice",
        "1/8 teaspoon garlic powder",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spinach and Mushroom Pinwheels",
    "url": "http://allrecipes.com/recipe/14843/spinach-and-mushroom-pinwheels/"
}
