{
    "directions": [
        "Heat oven to 375°F. In a large sauté pan over medium heat, heat oil. Add onions and garlic; toss to coat. Add 1 cup stock; cover and reduce heat; simmer until onions are soft, 20 minutes. Reserve 1/2 cup liquid. Add scallions, oregano, salt and pepper to onion mixture; increase heat to medium and cook, stirring, until liquid evaporates, 20 minutes. Cook noodles as directed on package; drain and blot dry. Cook spinach as directed on package; drain, squeeze dry, and season with salt and pepper. In a small saucepan over medium heat, melt butter. Add flour; stir until roux is brown, 2 to 3 minutes. Add remaining 1/2 cup stock to reserved liquid; whisk into roux until thick, 5 minutes. In a bowl, beat egg; stir in ricotta and zest. Coat a 9\" x 13\" pan with cooking spray; spread half of stock-roux mixture on bottom. Line pan with 3 noodles; layer on half of onion and ricotta mixtures, half of spinach and 1/3 cup Parmesan. Repeat layer with 3 noodles, remaining onion and ricotta mixtures and spinach, and 1/3 cup Parmesan. Top with remaining 3 noodles, half of stock-roux mixture and 1/3 cup grated Parmesan. Cover with foil; bake until light brown, 50 minutes. Reduce heat to 325°F; remove foil and bake 15 minutes more. Let lasagna sit 15 minutes; serve."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "6 large onions (2 white, 2 red, 2 yellow), halved and thinly sliced",
        "6 cloves garlic, chopped",
        "1 1/2 cups lowfat chicken or vegetable stock, divided",
        "6 scallions, thinly sliced",
        "1 tablespoon dried oregano",
        "2 teaspoons salt (preferably sea salt), plus more to season",
        "1 teaspoon freshly ground black pepper, plus more to season",
        "9 whole-wheat lasagna noodles",
        "2 packages (9 ounces each) frozen spinach",
        "1 tablespoon salted butter",
        "1 tablespoon all-purpose flour",
        "1 egg",
        "2 cups part-skim ricotta",
        "Grated zest of 1/2 lemon",
        "Olive oil cooking spray",
        "1 cup grated Parmesan, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Bake",
        "Dinner",
        "Parmesan",
        "Spinach",
        "Healthy",
        "Self",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Spinach Lasagna",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-lasagna-394790"
}
