{
    "directions": [
        "In a heavy skillet cook the onion in 1/4 cup of the oil over moderately low heat, stirring occasionally, until it is golden, add the spinach, and cook the mixture, stirring, until it is combined well. Remove the skillet from the heat, stir in the Feta and the dill, and let the filling cool.",
        "Lay 1 sheet of the phyllo with a long side facing you on a work surface and brush it lightly with some of the remaining 1/4 cup oil. Lay another sheet and brush it lightly with some of the remaining oil. With a sharp knife cut the sheets lengthwise into thirds and cut each length crosswise into fifths, making 15 sections, each approximately 4 x 3 1/2 inches. Put a level teaspoon of the filling in the center of each phyllo section. Working with 1 section at a time gather the corners of th phyllo over the filling and twist the phyllo gently. Transfer the pastries to an oiled jelly-roll pan and make pastries with the remaining phyllo, oil, and filling, in the same manner. Bake the pastries in the lower third of a preheated 375°F. oven for 25 minutes, or until they are golden. The pastries may be baked 1 day in advance and kept covered loosely with plastic wrap and chilled. Reheat the pastries in a 375°F. oven for 10 minutes, or until they are heated through."
    ],
    "ingredients": [
        "1 1/2 cups finely chopped onion",
        "1/2 cup olive oil",
        "two 10-ounce packages frozen spinach, cooked, drained, squeezed dry by handfulls, and chopped",
        "2 cups grated Feta (about 1/2 pound)",
        "2 teaspoons dried dill",
        "four 16- x 12-inch sheets of phyllo, stacked between 2 sheets of wax paper and covered with a dampened kitchen towel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Bake",
        "Cocktail Party",
        "Feta",
        "Spinach",
        "Shower",
        "Engagement Party",
        "Phyllo/Puff Pastry Dough",
        "Gourmet"
    ],
    "title": "Spinach, Feta, and Phyllo Purses",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-feta-and-phyllo-purses-101576"
}
