{
    "directions": [
        "In a large saucepan, combine sweet potato, squash, and carrots. Pour in enough water to cover vegetables. Cook over low heat until very tender, about 40 minutes. Drain and mash. Allow to cool.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 12 inch pie pan.",
        "To mashed squash mixture, add 2 eggs, butter or margarine, olive oil, 1/2 teaspoon salt, brown sugar, curry powder, cumin, cinnamon, and nutmeg. Puree mixture in blender or food processor.",
        "In food processor or blender, combine spinach, 2 eggs, 1/2 teaspoon salt, pepper, and half and half. Puree until smooth. Stir in 2 tablespoons bread crumbs. If mixture is still liquidy, add more bread crumbs. Pour spinach mixture into pie pan, flattening with a spoon.",
        "Gently pour squash mixture on top of spinach layer. Flatten partially with a spoon, but leave a few waves. Do not spread squash mixture all the way to edges of pan; allow spinach mixture to 'peek' through edges. Using a spoon, gently stir the two mixtures to create a marbled effect. Do not overmix.",
        "Bake in preheated oven for 30 minutes, until set in center."
    ],
    "ingredients": [
        "1 large sweet potato, peeled and diced",
        "1 butternut squash, peeled and chopped",
        "2 carrots, chopped",
        "2 eggs, beaten",
        "2 tablespoons butter, melted",
        "2 tablespoons olive oil",
        "1/2 teaspoon salt",
        "3 tablespoons brown sugar",
        "1/2 teaspoon curry powder",
        "1/4 teaspoon ground cumin",
        "1/2 teaspoon ground cinnamon",
        "1 pinch ground nutmeg",
        "1 (16 ounce) package frozen chopped spinach, thawed and drained",
        "2 eggs",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/2 cup half-and-half cream",
        "2 tablespoons bread crumbs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spinach Pumpkin Swirl Quiche",
    "url": "http://allrecipes.com/recipe/15955/spinach-pumpkin-swirl-quiche/"
}
