{
    "directions": [
        "Heat oven to 375°F. In a large skillet coated with cooking spray, cook shallots over medium-low heat, stirring, 3 minutes. Add shiitakes; stir until soft, 5 minutes. Add spinach and 1/2 chopped garlic; stir about 3 minutes. Season with salt and pepper. Remove from heat. Whisk milk and flour in a small saucepan over medium-low heat. Bring to a boil, then reduce heat to a simmer, whisking, 5 minutes. Whisk egg yolks, one at a time, into milk-flour mixture; whisk in cheeses and mustard. Season with salt and pepper. Fold spinach mixture into egg mixture. Beat egg whites in a bowl until firm peaks form. Stir 1/4 whites into spinach mixture; fold in remaining whites. Coat a 1 1/2-quart soufflé dish with cooking spray. Spoon mixture into dish. Bake until puffed and golden, 30 minutes. In a medium skillet coated with cooking spray, cook remaining chopped garlic, stirring, until lightly golden. Stir in tomatoes; cook 3 to 4 minutes. Stir in basil, thyme and vinegar; season with salt and pepper. Spoon soufflé onto plates; top with tomatoes.",
        "1 cup cubed roasted butternut squash per person. Toss squash with 2 teaspoon olive oil; season with salt and pepper. Bake at 400°F until tender, 30 minutes."
    ],
    "ingredients": [
        "1/2 cup chopped shallots",
        "1 cup sliced shiitakes",
        "1 cup chopped spinach, blanched and squeezed",
        "4 large cloves garlic, chopped",
        "1 cup skim milk",
        "3 tablespoons flour",
        "2 whole eggs, separated",
        "1/3 cup grated smoked Gouda",
        "1/4 cup grated Pecorino Romano",
        "1 teaspoon Dijon mustard",
        "2 egg whites",
        "2 pints cherry tomatoes, halved",
        "1/2 cup chopped fresh basil (or parsley)",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon red wine vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Brunch",
        "Dinner",
        "Spinach",
        "Healthy",
        "Self",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spinach, Mushroom and Gouda Souffle",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-mushroom-and-gouda-souffle-363769"
}
