{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C), and grease and flour two 9 inch round pans.",
        "Sift together the flour, baking soda, baking powder, 1/2 teaspoon salt, and 3/4 cup cocoa.",
        "In a large bowl, mix together the white sugar, oil, and 2 eggs.  Add the milk and 2 1/2 teaspoons vanilla; mix well.  Mix in the sifted ingredients, and then add the hot coffee.  Pour the thin batter into the pans.",
        "Bake for 30 minutes. Remove the pans from the oven.  Cover immediately with a piece of foil, and then a towel. Cool for 10 minutes.  Remove the cakes from the pan.  Place on a wire rack, and cover again with the foil and towel (the steam created by covering makes these cakes extra moist).  Cool completely.",
        "To Make Filling:  In a small bowl, cream the peanut butter, 1/4  cup plus 2 tablespoons confectioners' sugar, and 1 teaspoon butter or margarine.  Beat well.  Stir in 3 tablespoons cream and 2 teaspoons vanilla.  Set filling aside until cakes cool.",
        "To Make Frosting:  In a mixing bowl, combine 4 cups confectioners' sugar, 4 tablespoons butter or margarine, 1/3 cup plus 2 tablespoons cocoa, egg white, 2 teaspoons vanilla, pinch of salt, and 5 tablespoons cream.  Beat with mixer on high until frosting is very creamy, about 2 minutes.  Fill and frost the cooled cake."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "2 teaspoons baking soda",
        "1/2 teaspoon salt",
        "3/4 cup unsweetened cocoa powder",
        "2 cups white sugar",
        "2 eggs",
        "1/2 cup vegetable oil",
        "1 cup milk",
        "2 1/2 teaspoons vanilla extract",
        "1 cup strong, hot, brewed coffee",
        "1 cup smooth peanut butter",
        "1 teaspoon butter, softened",
        "1/3 cup confectioners' sugar",
        "2 teaspoons vanilla extract",
        "3 tablespoons heavy cream",
        "4 cups confectioners' sugar",
        "4 tablespoons unsalted butter",
        "1/2 cup unsweetened cocoa powder",
        "1 egg white",
        "2 teaspoons vanilla extract",
        "1 pinch salt",
        "5 tablespoons heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spintz Cake",
    "url": "http://allrecipes.com/recipe/7617/spintz-cake/"
}
