{
    "directions": [
        "Heat 1 teaspoon oil in heavy large skillet over medium heat. Add bell pepper and sauté until crisp-tender, about 8 minutes. Transfer pepper to small bowl.",
        "Heat same skillet over high heat. Add spinach and sauté 2 minutes. Reduce heat to medium and sauté until spinach is tender, about 2 minutes longer. Cool in skillet. Transfer spinach to work surface; chop spinach. Set aside.",
        "Heat 1 teaspoon oil in same skillet over medium heat. Add garlic and sauté until fragrant, about 30 seconds. Add prosciutto and sauté 30 seconds. Add chopped spinach. Sauté 2 minutes. Season to taste with salt and pepper. Remove from heat. Mix in cream.",
        "Preheat broiler. Arrange bread slices on large baking sheet. Broil until lightly toasted. Turn bread slices over. Brush top of bread slices with remaining 2 tablespoons oil. Broil until lightly toasted. Cool. (Components can be made 8 hours ahead. Cover spinach mixture and bell pepper strips separately; refrigerate. Store toasts airtight at room temperature.) Spoon generous 1 tablespoon spinach mixture atop each toast. Arrange bell pepper strips atop toasts. Sprinkle with Parmesan cheese. Broil crostini until cheese bubbles and spinach mixture is hot, about 2 minutes. Transfer crostini to plate and serve."
    ],
    "ingredients": [
        "2 teaspoons plus 2 tablespoons olive oil",
        "1/2 red bell pepper, cut into matchstick-size strips",
        "1 10-ounce package fresh spinach, stemmed",
        "1 teaspoon minced garlic",
        "1/4 cup chopped prosciutto",
        "1 tablespoon whipping cream",
        "12 1/2-inch-thick slices cut from French bread baguette",
        "6 tablespoons freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Broil",
        "Sauté",
        "Cocktail Party",
        "Spinach",
        "Bell Pepper",
        "Winter",
        "Prosciutto"
    ],
    "title": "Spinach, Prosciutto and Red Bell Pepper Crostini",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-prosciutto-and-red-bell-pepper-crostini-15663"
}
