{
    "directions": [
        "Have ready a large bowl of ice and cold water. Stir together dashi, mirin, and soy sauce in a large shallow bowl.",
        "Leaving stems attached, divide spinach into 2 piles. Stack spinach leaves and line up bottoms of stems, then tie each pile into a bundle with kitchen string 1/2 inch from ends of stems. Blanch spinach bundles in a large saucepan of boiling salted water 1 minute and transfer to ice water. When spinach is cool, gently squeeze excess water from bundles and transfer to dashi mixture. Marinate at room temperature, turning occasionally, 3 hours.",
        "Stir together cornstarch and water in a glass measure. Add eggs, sake, and sugar and beat with a fork just until blended. If mixture is frothy, let stand until foam subsides. Heat oil in a 12-inch nonstick skillet over moderate heat, swirling skillet to coat, and wipe out excess with paper towels. Pour slightly more than 1/3 cup egg mixture into skillet, swirling to cover evenly, and discard remainder. When edges of egg begin to dry, remove skillet from heat and let stand 20 seconds. Carefully turn egg sheet over (Japanese cooks pick it up by gently working a single chopstick under egg sheet across skillet and lifting it, draped over the chopstick). Cook other side 30 seconds and invert egg sheet onto a work surface.",
        "When egg sheet is cool enough to handle, arrange on a sushi mat, lining up an edge of sheet with near edge of mat. (If you're not using a sushi mat, keep egg sheet on work surface.) Gently squeeze excess marinade from spinach bundles and trim stem ends to remove string. Keeping bundles intact, arrange spinach horizontally across lower third of egg sheet, with stems of 1 bundle on left and stems of the other on right. Beginning with side nearest to you, roll egg sheet up and over spinach tightly, squeezing mat around roll to tighten, and continue to roll up egg sheet. Trim ends of roll and cut crosswise into 8 pieces."
    ],
    "ingredients": [
        "1 cup [dashi](/recipes/food/views/103413)",
        "1 tablespoon mirin (sweet rice wine)",
        "1 teaspoon soy sauce",
        "3/4 pound tender spinach (about 1 bunch)",
        "1/2 teaspoon cornstarch",
        "1/2 tablespoon water",
        "2 large eggs",
        "1 1/2 teaspoons sake",
        "1/2 teaspoon sugar",
        "2 teaspoons vegetable oil",
        "Special equipment: slatted bamboo sushi mat (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Leafy Green",
        "Brunch",
        "Marinate",
        "Vegetarian",
        "Lunch",
        "Spinach",
        "Sake",
        "Pan-Fry",
        "Healthy",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Spinach and Omelet Roll",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-and-omelet-roll-103383"
}
