{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Heat a large pot over medium heat. Cook and stir ground beef in the hot pot with garlic, oregano, and basil until beef is completely browned, 5 to 10 minutes. Stir spaghetti sauce and spinach into ground beef mixture; simmer until heated through, about 5 minutes.",
        "Stir ricotta cheese, 8 ounces mozzarella cheese, parsley, Parmesan cheese, salt, and black pepper together in a bowl.",
        "Spread a small amount of sauce in the bottom of a 9x13-inch pan. Arrange lasagna noodles in a single layer over the sauce. Spread another layer of sauce over the top and arrange another layer of lasagna noodles over sauce. Spread 1/2 the remaining sauce and 1/2 the cheese mixture over the top. Repeat layers, finishing with sauce. Cover pan with aluminum foil.",
        "Bake in the preheated oven for 55 minutes, remove aluminum foil, sprinkle lasagna with 1/2 cup mozzarella cheese, and bake until noodles are cooked through and sauce is bubbling, about 15 minutes. Cool for 10 minutes before serving."
    ],
    "ingredients": [
        "1 tablespoon extra virgin olive oil",
        "1/2 onion, chopped",
        "1/2 pound lean ground beef",
        "2 cloves garlic, minced",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon dried basil",
        "1 (45 ounce) jar spaghetti sauce",
        "1 (10 ounce) package frozen chopped spinach, thawed and drained",
        "2 cups fat-free ricotta cheese",
        "1 (8 ounce) package shredded part-skim mozzarella cheese",
        "1/2 cup dried parsley",
        "1/4 cup grated Parmesan cheese",
        "1 teaspoon salt",
        "1/8 teaspoon black pepper",
        "10 lasagna noodles, or more as needed",
        "1/2 cup shredded part-skim mozzarella cheese, or to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spinach and Beef Lasagna",
    "url": "http://allrecipes.com/recipe/234750/spinach-and-beef-lasagna/"
}
