{
    "directions": [
        "1. Dice the tofu into pieces about the size of a sugar cube or a little smaller. Bring 6 cups water to a boil, add 1 teaspoon salt and lower the heat to a simmer. Add the tofu, turn off the heat, and leave for 4 or 5 minutes. Pour into a colander to drain. (If you've used soft tofu, remove it with a slotted spoon.) Set aside.",
        "2. Steam the spinach until wilted, then remove it to a cutting board and chop. When cool enough to handle, squeeze out the excess water.",
        "3. Put the chiles, ginger, garlic, and onion in a food processor, and process until finely chopped. Heat the ghee or butter in a nonstick skillet, add the onion mixture and cook over medium heat, stirring frequently, for 5 minutes.",
        "4. Add 1 teaspoon salt, the cumin, nutmeg, cayenne, and 1 cup water.Simmer for 5 minutes, then return the mixture to the food processor, add the spinach, and puree.",
        "5. Return the mixture to the skillet, add the half-and-half and the tofu, and simmer for about 5 minutes. Turn off the heat and stir in the yogurt. Serve over basmati rice."
    ],
    "ingredients": [
        "1 carton firm or soft tofu",
        "Salt",
        "1 large bunch spinach, stems discarded, leaves well washed",
        "1 jalapeño chile, seeded and coarsely chopped",
        "1 serrano chile, coarsely chopped",
        "1-inch knob ginger, peeled and diced",
        "3 garlic cloves, coarsely chopped",
        "1 cup diced onion",
        "2 tablespoons ghee, butter, or vegetable oil",
        "1 1/2 teaspoons ground cumin",
        "1/8 teaspoon nutmeg, plus a pinch",
        "1/8 teaspoon cayenne pepper",
        "1/2 cup half-and-half",
        "1/3 cup yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Food Processor",
        "Garlic",
        "Ginger",
        "Onion",
        "Rice",
        "Soy",
        "Vegetable",
        "Side",
        "Vegetarian",
        "Quick & Easy",
        "Yogurt",
        "Dinner",
        "Lunch",
        "Tofu",
        "Spinach",
        "Healthy",
        "Nutmeg",
        "Butter",
        "Cumin",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spinach and Tofu Paneer",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-and-tofu-paneer-355880"
}
