{
    "directions": [
        "Place the bun tops, top down, in a buttered, 13- x 9-inch casserole dish. Set aside the bun bottoms.",
        "In a large skillet, melt butter over medium-high heat, until sizzling.",
        "Add onion and saute until they're just softening. Add mushroom slices and stir, reducing heat to medium. Cook for about 5 minutes.",
        "Stir in herbs, garlic, paprika and salt and pepper to taste, then add spinach and cook another 3 minutes, stirring to wilt the spinach. Remove from heat.",
        "Spoon half the vegetable mixture evenly over the bun tops in the casserole dish. Scatter half the bacon and cheese evenly on top.",
        "Place the bun bottoms, with cut side up, in the casserole to form the top layer.",
        "Spoon the rest of the vegetable mixture, bacon and cheese over the top layer of buns.",
        "In a bowl, stir together eggs and milk until blended.",
        "Pour the mixture evenly over the casserole. Using a spatula, press down firmly on each of the buns to submerge in the liquid. Cover tightly with plastic wrap and refrigerate 8 hours or overnight.",
        "In the morning, let casserole sit at room temperature for about 30 minutes.",
        "Preheat oven to 350 degrees. Bake for 35 to 40 minutes or until firm at the center and a toothpick inserted comes away clean. Serve warm."
    ],
    "ingredients": [
        "6 Ball Park® Hamburger Buns",
        "2 tablespoons butter, or more if needed",
        "1 cup chopped yellow onion",
        "2 cups sliced mushrooms",
        "3 teaspoons dried Italian herbs",
        "2 teaspoons garlic granules",
        "2 teaspoons sweet paprika",
        "salt and pepper to taste",
        "3 cups coarsely chopped fresh spinach",
        "6 slices bacon - cooked, drained, and chopped",
        "1 1/2 cups shredded Cheddar-Monterey Jack cheese blend",
        "6 eggs, beaten",
        "2 cups milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spinach-Mushroom Brunch Casserole",
    "url": "http://allrecipes.com/recipe/256913/spinach-mushroom-brunch-casserole/"
}
