{
    "directions": [
        "Line 2 baking sheets with paper towels. In a kettle of boiling salted water blanch spinach in small batches 2 seconds and transfer with tongs to paper towels, laying it flat, to drain.",
        "In a saucepan bring 4 cups of water to a boil with lentils. Simmer lentils, covered 15 minutes and add salt to taste. Simmer lentils, covered, until just tender, 3 to 5 minutes more, and drain well. Transfer lentils to a bowl.",
        "While lentils are cooking, in a heavy skillet cook onion in 1 tablespoon oil over moderate heat, stirring, until softened, about 5 minutes. Stir in lentils, vinegar, and salt and pepper to taste.",
        "Cook lentil mixture, stirring, until just heated through and keep warm.",
        "In a bowl whisk together yogurt and garlic paste. Peel cucumber and remove any seeds. Cut cucumber into 1-inch pieces and in a blender blend until smooth. Whisk cucumber into yogurt mixture with salt and pepper to taste and let sauce come to room temperature.",
        "Preheat oven to 400°F. and lightly oil a shallow baking pan.",
        "Pat flounder fillets dry and season with salt and pepper. Divide spinach among fillets, overlapping leaves to cover each fillet completely on one side, and transfer fillets, spinach sides down, to oiled pan. Sprinkle top of fillets with half of mint and wrap with remaining spinach, overlapping leaves until fillets are completely covered. Brush tops of fillets with remaining 2 tablespoons oil and bake fillets in middle of oven until cooked through, about 10 minutes.",
        "Stir remaining mint into sauce and stir feta into lentil mixture.",
        "Divide lentil mixture among 6 plates and top with fillets. Spoon some of sauce onto each plate and garnish fillets with mint sprigs."
    ],
    "ingredients": [
        "1 1/2 pounds fresh spinach (about 2 medium bunches), stems discarded and leaves washed, rinsed thoroughly, and drained",
        "1 cup dried lentils, picked over",
        "1 small red onion, chopped (about 1 cup)",
        "3 tablespoons olive oil",
        "1 tablespoon red-wine vinegar",
        "1 cup plain yogurt",
        "2 garlic cloves, minced and mashed to a paste with 1/4 teaspoon salt",
        "1/2 large seedless cucumber (about 3/4 pound)",
        "six 6- to 7- ounce flounder fillets",
        "1/2 cup loosely packed fresh mint leaves (about 1 bunch), chopped",
        "1/2 cup crumbled feta cheese (about 2 ounces)",
        "Garnish: mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Fish",
        "Bake",
        "Yogurt",
        "High Fiber",
        "Feta",
        "Mint",
        "Cucumber",
        "Spinach",
        "Lentil",
        "Healthy",
        "Gourmet"
    ],
    "title": "Spinach-Wrapped Flounder and Warm Lentil Salad with Cucumber Yogurt Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-wrapped-flounder-and-warm-lentil-salad-with-cucumber-yogurt-sauce-10070"
}
