{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.",
        "Slice off the top portion of the garlic head to expose each clove. Place garlic head on a baking sheet. Drizzle olive oil over garlic and season with salt and pepper.",
        "Roast garlic in the preheated oven until tender and fragrant, about 40 minutes. Cool garlic until easily handled. Remove garlic cloves from the peels.",
        "Place spinach in a bowl. Pour enough hot water over spinach to cover; set aside until wilted. Drain and squeeze liquid from spinach.",
        "Mix ricotta cheese, 1 cup mozzarella cheese, Parmesan-Romano cheese blend, egg, and Italian seasoning together in a bowl.",
        "Bring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain.",
        "Heat butter in a saucepan over medium heat until melted. Stir cream and milk into melted butter until thickened, about 5 minutes. Stir Neufchatel cheese into cream mixture until melted, 2 to 3 minutes. Add roasted garlic cloves, garlic salt, red pepper flakes, salt, and pepper; stir well. Stir 1/2 cup mozzarella cheese into cream mixture; cook until cheese sauce is smooth, 2 to 3 minutes. Stir egg yolks into cheese sauce until fully incorporated. Remove saucepan from heat.",
        "Arrange 4 lasagna noodles in the bottom of the prepared baking dish. Layer 1/2 of the carrots, 1/2 of the artichoke hearts, 1/2 of the ricotta mixture, 1/2 of the spinach, 1/2 of the alfredo sauce, 4 lasagna noodles, respectively, over the lasagna noodles. Repeat layering with remaining ingredients, ending with a layer of lasagna noodles topped with 2 cups mozzarella cheese. Cover dish loosely with aluminum foil.",
        "Bake in the preheated oven for 45 minutes. Remove foil and continue baking until cheese is bubbling and lightly browned, about 15 minutes more. Remove lasagna from oven and let rest for 5 minutes before slicing."
    ],
    "ingredients": [
        "1 large head garlic",
        "1 tablespoon olive oil",
        "salt and ground black pepper to taste",
        "1 (10 ounce) bag baby spinach",
        "hot water to cover",
        "Ricotta Mixture:",
        "1 (32 ounce) container ricotta cheese",
        "1 cup shredded mozzarella cheese",
        "1/4 cup grated Parmesan-Romano cheese blend",
        "1 egg",
        "1 tablespoon Italian seasoning",
        "12 lasagna noodles",
        "Alfredo Sauce:",
        "6 tablespoons butter",
        "1 cup heavy whipping cream",
        "1/2 cup milk",
        "4 ounces Neufchatel cheese",
        "1 teaspoon garlic salt",
        "1 teaspoon red pepper flakes",
        "1/2 cup shredded mozzarella cheese",
        "2 egg yolks",
        "1 cup shredded carrots",
        "1 (16 ounce) can artichoke hearts, drained and chopped",
        "2 cups shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spinach, Artichoke, and Carrot White Lasagna",
    "url": "http://allrecipes.com/recipe/238165/spinach-artichoke-and-carrot-white/"
}
