{
    "directions": [
        "Cook carrots in a saucepan of boiling salted water until barely tender, 6 to 8 minutes, then drain (carrots will continue to cook as they cool). When cool, cut each section lengthwise into 3 pieces.",
        "Cook bacon in a skillet over moderate heat, stirring, until crisp, then transfer with a slotted spoon to paper towels to drain, reserving fat. Stir together bacon, bread crumbs, parsley, garlic, oregano, salt, pepper, clove, nutmeg, and 2 tablespoons fat in a bowl until combined well.",
        "Put steak on 2 overlapping sheets of plastic wrap (each about 2 feet long) with a short side of steak nearest you. Holding a sharp knife parallel to work surface and beginning on a long side, butterfly steak by cutting it almost in half horizontally (not all the way through), then open it like a book.",
        "Turn steak so a long side is nearest you, then arrange spinach evenly over steak, leaving a 1-inch border along edge farthest from you. Top spinach with carrot pieces, arranging them parallel to long side and spacing them evenly, then sprinkle evenly with bread crumb mixture.",
        "Beginning with side nearest you and using plastic wrap as an aid, roll up steak, gently pressing on filling (do not roll too tightly or filling will slip out from ends), then tie steak crosswise with string at 3/4-inch intervals. Season with salt and pepper.",
        "Open vents on bottom of grill and on lid. Light a heaping chimneyful of charcoal and pour it evenly over 1 side of bottom rack (you will have a double or triple layer of charcoal).",
        "When charcoal turns grayish white (15 to 20 minutes from lighting) and you can hold your hand 5 inches above top rack for 3 to 4 seconds, sear steak on all sides on lightly oiled rack over coals until well browned, 8 to 10 minutes.",
        "Move steak to side of grill with no coals underneath and cook, covered with lid, turning once, until an instant-read thermometer inserted diagonally 2 inches into thickest part of steak registers 125°F, 15 to 20 minutes total.",
        "Preheat all burners on high, then adjust heat to moderately high. Sear steak on all sides on lightly oiled rack over flames until well browned, 8 to 10 minutes.",
        "Turn off burner directly below steak and cook, covered with lid, turning once, until an instant-read thermometer inserted diagonally 2 inches into thickest part of steak registers 125°F, 25 to 30 minutes total.",
        "Transfer steak to a cutting board and let stand, covered loosely with foil, 20 minutes. Beef will continue to cook as it stands, reaching 130°F (medium-rare). Discard string, being careful not to unroll steak, and cut steak into 1/2-inch-thick slices with a sharp knife.",
        "Available at hardware stores and some specialty foods shops."
    ],
    "ingredients": [
        "4 medium carrots, cut crosswise into thirds",
        "6 bacon slices, cut crosswise into 1/2-inch pieces",
        "1 cup fine fresh bread crumbs",
        "1/4 cup finely chopped fresh flat-leaf parsley",
        "2 garlic cloves, minced",
        "1 teaspoon finely chopped fresh oregano",
        "2 teaspoons kosher salt",
        "1/2 teaspoon black pepper",
        "1/8 teaspoon ground clove",
        "1/8 teaspoon freshly grated nutmeg",
        "1 (2 1/2-lb) flank steak, trimmed",
        "1/2 lb spinach, stems discarded",
        "Special equipment: kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Vegetable",
        "Quick & Easy",
        "Bacon",
        "Spinach",
        "Carrot",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Spinach and Carrot Stuffed Flank Steak",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-and-carrot-stuffed-flank-steak-106568"
}
