{
    "directions": [
        "in a 9- to 10-inch heavy skillet cook garlic and onion in oil over moderately low heat, stirring, until onion is softened. Add tomatoes with reserved juice, wine, and salt and pepper to taste and simmer, uncovered, stirring occasionally, until thickened, 20 to 25 minutes.",
        "In a small saucepan combine spinach with 1/2 cup water and simmer, covered, breaking up with a fork occasionally, 5 to 7 minutes. Drain spinach in a colander and rinse under cold water to cool. Squeeze spinach in a small handfuls until as dry as possible and chop fine.",
        "In a 5-quart saucepan bring 4 quarts salted water to a boil for cooking gnocchi. Set broiler rack about 4 inches form heat and preheat broiler.",
        "In a bowl stir together spinach, ricotta, 1/3 cup Parmesan, yolk, 2 tablespoons flour, nutmeg, and salt and pepper to taste until combined well (mixture will be very soft). With well-floured hands form rounded tablespoons of mixture into logs about 2 inches long and 1 inch in diameter (about 18) and transfer gnocchi as formed to a sheet of wax paper.",
        "Working in 2 batches, carefully transfer gnocchi with a spatula to boiling water and cook until they rise to surface, about 2 minutes. Transfer gnocchi as cooked with a slotted spoon to a buttered shallow baking dish large enough to hold them in one layer and sprinkle with remaining 1/3 cup Parmesan. Broil gnocchi until very hot and cheese is melted, 3 to 5 minutes.",
        "Serve gnocchi with tomato sauce."
    ],
    "ingredients": [
        "1 garlic clove, minced",
        "1/3 cup finely chopped onion",
        "1 tablespoon olive oil",
        "a 14- to 16-ounce can whole tomatoes, drained, reserving juice, and chopped",
        "1/4 cup dry red wine",
        "a 10-ounce package frozen chopped spinach",
        "1 cup whole-milk ricotta",
        "2/3 cup freshly grated Parmesan",
        "1 large egg yolk",
        "2 tablespoons all-purpose flour plus additional for forming gnocchi",
        "freshly grated nutmeg to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pasta",
        "Tomato",
        "Appetizer",
        "Quick & Easy",
        "Parmesan",
        "Ricotta",
        "Spinach",
        "Red Wine",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spinach Ricotta Gnocchi with Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/spinach-ricotta-gnocchi-with-tomato-sauce-11369"
}
