{
    "directions": [
        "Soak sun-dried tomatoes in a bowl of hot water until softened, about 20 minutes. Drain.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Line a baking sheet with parchment paper.",
        "Rub the caps of the portobello mushrooms with 2 tablespoons olive oil, or as needed; arrange mushrooms gill sides up on the prepared baking sheet. Season mushrooms with oregano, sea salt, and black pepper.",
        "Bake mushrooms in the preheated oven until tender, 8 to 10 minutes.",
        "Place the mushroom stems, sun-dried tomatoes, red bell pepper, and garlic cloves in a food processor; pulse until finely chopped.",
        "Heat 1 tablespoon olive oil in a large skillet over medium-high heat. Cook and stir sun-dried tomato mixture in the hot oil until fragrant, about 2 minutes.",
        "Stir spinach into the skillet; cover, reduce heat to medium-low, and cook until spinach is wilted, about 3 minutes more, stirring occasionally. Drain excess liquid from skillet.",
        "Spoon spinach mixture over baked mushroom caps.",
        "Divide diced avocado atop stuff mushrooms and sprinkle with Parmesan cheese to serve."
    ],
    "ingredients": [
        "6 sun-dried tomatoes",
        "4 large portobello mushrooms, stems reserved and gills removed",
        "extra-virgin olive oil, or as needed",
        "1 tablespoon chopped fresh oregano",
        "sea salt to taste",
        "ground black pepper to taste",
        "1 large red bell pepper, cut into 1-inch pieces",
        "2 cloves garlic, coarsely chopped",
        "1 tablespoon extra-virgin olive oil",
        "2 (10 ounce) bags fresh spinach leaves",
        "3 large avocados - peeled, pitted, and diced",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Spinach Stuffed Portobello Mushrooms with Avocado",
    "url": "http://allrecipes.com/recipe/220815/spinach-stuffed-portobello-mushrooms/"
}
