{
    "directions": [
        "Cream 7 oz of butter. Chop the herbs (3/4 of the parsley, 3/4 of the chervil, the sprig of tarragon) and mix with the creamed butter. Keep just the tips of the remaining parsley and chervil.",
        "Clean the white mushrooms and dice (quite small), bake them slowly in butter, and add to the herbed butter along with the finely sliced shallots. Season with pepper and salt.",
        "Lift the skin slightly from the chicken, without tearing it, and spread the herbed butter underneath. Be careful afterwards to ensure that the skin covers the meat so that it does not dry out during cooking.",
        "If you do not have a spit you can cook the chicken in the oven at 350#&176;F for about 1 1/4 hours. When the chicken is 3/4 cooked, deglaze with chicken juices.",
        "When cooked, sieve the cooking juices and add the chervil and parsley. This will be used later on.",
        "Peel and wash about 8 white onions; remove the top of the onions (about 1/4 of onion if it is small or 1/3 if it is large, these lids will be used later on), and empty the middle of the onions with a spoon (keep two or three layers of onion).",
        "Dice the other onions finely with the spooned out interiors. Sweat the onions in olive oil until they are lightly golden, adding salt and pepper. Cut the celery stick into very small pieces, and crush the grilled pine nuts with a knife (you can grill them in the grill or oven).",
        "Away from the heat mix the sweated onions, diced celery, pine nuts, ricotta, the salted pork fat, sage, parmesan, chopped parsley, salt, and pepper.",
        "Stuff the onions (replace the tops on the onions before cooking) and put them on a baking sheet, drizzle with olive oil and cook in the over preheated to 356°F for near 1/2 hour. Be careful not to burn them, if you think there is a risk of burning cover them with kitchen foil. Baste the onions regularly in their juices as this will make them really tasty and fondant (slightly melted). When the onions are cooked, coat them with chicken juices, add freshly ground pepper and serve.",
        "Cut the top off 8 tomatoes (about 1/3 of the tomato) and keep the stalk part to use as a cover on the stuffed tomatoes. Salt and pepper the interior of the tomatoes and leave upside down on a baking sheet to drain out excess water. This will give you a more solid tomato and it will avoid excess liquids in the stuffing.",
        "Remove the skin from the remaining tomatoes (leave them a few seconds in boiling water); cut into quarters and remove the insides.",
        "Chop the tomato confit into roughly diced sized pieces.",
        "In a cast iron pot, heat the olive oil with the unpeeled garlic cloves, add the peeled and emptied tomatoes, rosemary sprig, salt, and pepper and leave to cook in a hot oven (390°F) until you obtain a fondant marmalade appearance.",
        "Once the marmalade is cooked and cooled, remove the garlic cloves, thyme, and rosemary, then add the finely chopped white onions and sweat with olive oil.",
        "Mix together the chopped tomatoes confit, parsley, grated parmesan, and chopped basil. Drizzle with a little olive oil, and check the seasoning, you may have to add a little salt and pepper.",
        "Stuff the tomatoes with both mixtures and cover with the tomato stalk tops, then place them in a gratin dish and sprinkle with olive oil. Place in an oven, preheated to 350°F, for half an hour. Sprinkle regularly with olive oil and the roasted chicken juices.",
        "Serve the tomatoes and onions on the plate, carve the chicken and coat with the jus. Add a little freshly ground pepper and drizzle with chives cut lengthwise.",
        "You can add other vegetables, such as artichokes cooked whole (cooked barigoule style) then stuffed with olive tapenade, braised with the tomatoes in the oven with the chicken juices.",
        "A few croutons rubbed with garlic and pan-fried are perfect to finish the dish."
    ],
    "ingredients": [
        "1 chicken (cleaned), 4 1/2 pounds",
        "10 1/2 ounces butter",
        "1 shallot",
        "7 ounces white mushrooms",
        "1 bunch of Italian parsley",
        "1 bunch of chervil",
        "sprig of tarragon",
        "Chives",
        "1 head of garlic",
        "4 cups of chicken juices",
        "Salt and freshly ground pepper",
        "12 white onions (average size)",
        "1 tablespoon of ricotta",
        "1 tablespoon of parmesan",
        "1 tablespoon of chopped Italian parsley",
        "1 small stick of celery",
        "2 tablespoons of grilled pine nuts",
        "1 tablespoon of salted pork fat",
        "2 tablespoons of roasted chicken juices",
        "A little chopped sage",
        "Olive oil",
        "Salt & white pepper",
        "16 ripe tomatoes",
        "20 tomato quarters confit (remove the pips and interior)",
        "4 white onions (not too big)",
        "1 tablespoon of chopped parsley",
        "1 tablespoon of ground basil",
        "1 tablespoon of grated parmesan",
        "2 tablespoons of chicken juices",
        "4 cloves of garlic (unpeeled)",
        "1 sprig of thyme",
        "1 sprig of rosemary",
        "Olive oil",
        "Salt & pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Chicken",
        "Herb",
        "Mushroom",
        "Onion",
        "Tomato",
        "Bake",
        "Roast",
        "Dinner",
        "Fall",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Spit-Roasted Chicken with Herbs Under the Skin, Garden Vegetables, Toasted Country Bread, and Roasti",
    "url": "http://www.epicurious.com/recipes/food/views/spit-roasted-chicken-with-herbs-under-the-skin-garden-vegetables-toasted-country-bread-and-roasti-105878"
}
