{
    "directions": [
        "Butter bowl or ramekins, then dust with flour, knocking out excess. On parchment paper, trace circle slightly larger than diameter of bowl (or 8 circles slightly larger than ramekins). Cut out.",
        "Fill large, shallow, wide saucepan with 1 inch water. Add flat steamer or equally sized cookie cutters to create steaming platform just above water level.",
        "In bowl of stand mixer fitted with paddle attachment, beat together butter and 1 1/4 cups sugar until pale and fluffy, 4 to 5 minutes. Add eggs 1 at a time, beating well after each addition and scraping down sides of bowl periodically. Beat in vanilla.",
        "Sift flour into medium bowl. Gradually beat flour into egg mixture just until combined. Add 3 tablespoons milk and beat until smooth, about 30 seconds. Add raisins and beat just until combined.",
        "Transfer batter to prepared bowl or ramekins, smoothing top. Top bowl or ramekins with parchment paper circle(s), gently pressing on paper to make contact with batter.",
        "Over moderately high heat, bring water in steamer to simmer. Transfer bowl or ramekins to steamer, cover pan tightly, lower heat to moderate, and steam, adding more boiling water to pan if necessary, until pudding is set, about 2 hours for bowl or 1 hour for ramekins.",
        "Meanwhile, make custard sauce: In large bowl, whisk together custard powder, remaining 2 tablespoons sugar, and 2 tablespoons milk to form paste. In medium saucepan over moderate heat, bring remaining 2 cups plus 6 tablespoons milk to simmer. Whisking constantly, gradually add hot milk to custard paste. Return mixture to saucepan and cook, whisking constantly, until sauce thickens, 1 to 2 minutes. Remove from heat and keep warm.",
        "Transfer pudding bowl or ramekins to rack and cool 5 minutes. Run paring knife around inside rim of bowl or ramekins and invert pudding(s) onto plate(s). Serve warm with custard sauce."
    ],
    "ingredients": [
        "9 tablespoons (1 stick plus 1 tablespoon) unsalted butter",
        "1 1/4 cups plus 2 tablespoons sugar",
        "4 large eggs",
        "1 teaspoon vanilla extract",
        "2 3/4 cups self-rising flour",
        "2 cups plus 11 tablespoons whole milk",
        "1 cup golden raisins",
        "1/4 cup custard powder, such as Bird's brand*",
        "Special equipment: large ceramic heatproof bowl or 8 (8-ounce) ramekins, parchment paper",
        "*Available online and from suppliers of British products."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Raisin",
        "Ramekin",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Spotted Dick",
    "url": "http://www.epicurious.com/recipes/food/views/spotted-dick-350956"
}
