{
    "directions": [
        "In a large skillet, heat 1 tablespoon oil and 1/2 tablespoon butter over moderately high heat until foam subsides and sauté shallots, stirring, until tender, about 2 minutes. With a slotted spoon transfer shallots to a bowl. In fat remaining in skillet, sauté snap peas with salt to taste, stirring occasionally, until crisp-tender and add in shallots.",
        "In skillet, heat remaining tablespoon oil and 1/2 tablespoon butter over moderately high heat until foam subsides and sauté asparagus with salt to taste, stirring occasionally, until crisp-tender. Add fava or lima beans and sauté, stirring occasionally, 2 minutes. Add zest, lemon juice, snap peas and shallots, and salt and pepper to taste and sauté, stirring, until just heated through."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 tablespoon unsalted butter",
        "4 shallots, cut crosswise into thin slices",
        "1 pound sugar snap peas, trimmed",
        "1 pound asparagus, trimmed and cut diagonally into 1/2-inch slices",
        "3 pounds fresh fava beans, shelled, blanched in boiling water 1 minute, and outer skins removed, or 1 pound frozen Fordhook lima beans, blanched and, if desired, skinned in same manner",
        "two 3-inch strips lemon zest removed with a vegetable peeler and cut crosswise into julienne strips",
        "2 teaspoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Vegetable",
        "Side",
        "Sauté",
        "Vegetarian",
        "Quick & Easy",
        "Lemon",
        "Asparagus",
        "Spring",
        "Healthy",
        "Shallot",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spring Vegetables with Shallots and Lemon",
    "url": "http://www.epicurious.com/recipes/food/views/spring-vegetables-with-shallots-and-lemon-10234"
}
