{
    "directions": [
        "If using fresh fava beans, cook in a large saucepan of boiling salted water 1 minute. Drain; transfer to a bowl of ice water and let cool. Peel favas and transfer to a small bowl.",
        "Bring a large skillet of salted water to a bare simmer over medium-low heat. Add vinegar. Crack 1 egg into a small bowl, then slide into simmering water. Repeat with 2 more eggs. Cook until whites are cooked but yolks are runny, about 3 minutes. Using a slotted spoon, carefully transfer eggs to a bowl of ice water. Repeat with remaining 3 eggs.",
        "Bring broth to a simmer in a large saucepan over medium heat. Reduce heat to low; cover and keep warm.",
        "Meanwhile, melt 1 tablespoon butter in a large, wide heavy pot over medium heat. Add mushrooms and cook, stirring often, until tender, about 5 minutes. Using a slotted spoon, transfer to bowl with favas.",
        "Heat oil and remaining 1 tablespoon butter in same pot over medium heat. Add leeks, fennel, and garlic. Cook, stirring often, until vegetables are softened, about 4 minutes.",
        "Add rice and stir to coat, about 2 minutes. Add wine and cook, stirring occasionally, until evaporated, about 4 minutes. Add 1 cup broth. Cook, stirring often (no need to stir constantly), until broth is almost absorbed. Add remaining broth by cupfuls, allowing broth to be absorbed before adding more, stirring often, until rice is tender but still firm to the bite and mixture is creamy, about 20 minutes total.",
        "Add spinach, crème fraîche, 1 1/2 cups grated Pecorino, 1/4 cup chives, and reserved fava beans and mushrooms to risotto. Cook, stirring occasionally, until spinach is wilted and cheese is melted, about 2 minutes. Season risotto with salt.",
        "A few minutes before risotto is done, reheat poached eggs in a large skillet of simmering water, about 1 minute. Divide risotto among bowls and top with eggs, shaved Pecorino, chives, and pepper."
    ],
    "ingredients": [
        "2 cups shelled fresh (or frozen, thawed) fava beans or peas (from about 2 pounds pods)",
        "Kosher salt",
        "1 tablespoon distilled white vinegar",
        "6 large eggs",
        "8 cups low-sodium chicken broth",
        "2 tablespoons unsalted butter, divided",
        "1/4 pound chanterelles or crimini (baby bella) mushrooms, halved or quartered if large",
        "2 tablespoons olive oil",
        "2 large leeks, whites and pale greens only, chopped",
        "1 fennel bulb, chopped",
        "4 garlic cloves, finely chopped",
        "2 cups arborio rice",
        "1 cup dry white wine",
        "1 bunch flat-leaf spinach, trimmed, leaves torn",
        "2 tablespoons crème fraîche or sour cream",
        "1 1/2 cups finely grated Pecorino or Parmesan (about 3 ounces) plus more for shaving",
        "1/4 cup chopped fresh chives plus more for serving",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Cheese",
        "Egg",
        "Mushroom",
        "Rice",
        "Dinner",
        "Fennel",
        "White Wine",
        "Spring",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Spring Vegetable Risotto with Poached Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/spring-vegetable-risotto-with-poached-eggs-51154950"
}
