{
    "directions": [
        "Combine 1 cup Dashi, sugar and 3 teaspoons mirin in medium saucepan. Bring to simmer over medium-low heat. Add carrot strips; cook until crisp-tender, about 2 minutes. Using slotted spoon, transfer carrot strips to bowl. Add bamboo shoots, mushrooms and soy sauce to cooking liquid. Cook until liquid is almost evaporated, about 5 minutes. Add carrot strips. Cool mixture completely.",
        "Whisk egg, salt and 1 teaspoon mirin in small bowl to blend. Spray 9-inch-diameter nonstick skillet with nonstick spray. Heat skillet over medium-low heat. Pour egg mixture into skillet, swirling skillet to coat bottom evenly. Cook until bottom of egg mixture is set but not brown, about 45 seconds. Turn egg pancake over. Cook until egg pancake is set on bottom, about 20 seconds. Transfer to paper towel. Cool completely.",
        "Roll up egg pancake, then cut crosswise into very thin strips. Toss with fingers to fluff egg strips.",
        "Cook asparagus in medium saucepan of boiling salted water until crisp-tender, about 3 minutes. Drain. Cool asparagus in bowl of ice water. Drain well.",
        "Toss Sushi Rice, carrot mixture and asparagus in large bowl. (Egg strips and rice mixture can be made 2 hours ahead. Cover separately and let stand at cool room temperature. Do not refrigerate.)",
        "Line 6 bowls with lettuce leaves. Spoon rice mixture into leaves, mounding slightly. Garnish rice with egg strips, shrimp and pickled ginger and serve."
    ],
    "ingredients": [
        "1 cup Dashi",
        "1 tablespoon sugar",
        "4 teaspoons mirin (sweet Japanese rice wine)",
        "1 carrot, peeled, cut into matchstick-size strips",
        "1/2 cup canned sliced bamboo shoots, cut into matchstick-size strips",
        "2 large dried shiitake mushrooms, soaked in hot water 30 minutes, drained, stems trimmed, caps thinly sliced",
        "2 teaspoons reduced-sodium soy sauce",
        "1 large egg",
        "Pinch of salt",
        "Nonstick vegetable oil spray",
        "6 asparagus spears, trimmed, cut into 1 3/4-inch pieces",
        "Sushi Rice",
        "6 butter lettuce leaves",
        "12 cooked large shrimp, peeled",
        "1/4 cup shredded red pickled ginger (beni shoga)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Ginger",
        "Mushroom",
        "Rice",
        "Shellfish",
        "Vegetable",
        "Shrimp",
        "Asparagus",
        "Spring",
        "Healthy"
    ],
    "title": "Springtime Sushi Nests",
    "url": "http://www.epicurious.com/recipes/food/views/springtime-sushi-nests-103256"
}
