{
    "directions": [
        "Preheat the oven to 325°F. With a serrated knife remove the crust from the bread, discarding it, and cut the bread into 3/4-inch cubes. In a shallow baking pan arrange the bread cubes in one layer, bake them in the middle of the oven, stirring occasionally, for 10 to 15 minutes, or until they are golden, and transfer the croutons to a large bowl. In a skillet cook the garlic in the oil over moderately low heat, stirring, until it is golden and with a slotted spoon discard the garlic. Drizzle the oil over the croutons, tossing to coat them well, and sprinkle the croutons with salt to taste.",
        "In a kettle cook the onions in the butter and the oil over moderate heat, stirring occasionally, for 25 to 30 minutes, or until they are soft and pale golden, add the garlic, and cook the mixture for 3 minutes. Stir in the vermouth and boil the mixture until most of the liquid is evaporated. Add the broth, the bitters, and salt and pepper to taste and simmer the soup for 5 minutes. The soup may be made up to this point 2 days in advance, kept covered and chilled, and reheated. Stir in the scallion.",
        "Serve the soup topped with the croutons."
    ],
    "ingredients": [
        "1 loaf of Italian bread",
        "4 garlic cloves, sliced",
        "1/3 cup olive oil",
        "2 pounds large onions (preferably white), chopped fine",
        "3 tablespoons unsalted butter",
        "2 tablespoons vegetables oil",
        "4 large garlic cloves, minced",
        "3/4 cup dry vermouth or dry white wine",
        "7 cups chicken broth",
        "1 1/2 tablespoons Angostura bitters",
        "3 cups finely chopped scallion (about 3 bunches)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bitters",
        "Garlic",
        "Onion",
        "White Wine",
        "Spring",
        "Gourmet"
    ],
    "title": "Spring Onion Soup with Garlic Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/spring-onion-soup-with-garlic-croutons-11691"
}
