{
    "directions": [
        "In a sauté pan over medium heat, warm 2 Tbs. of the olive oil. Add the shallots and cook, stirring occasionally, until softened, 3 to 5 minutes. Add the garlic and cook, stirring, for 1 minute. Transfer the shallot mixture to a Vitamix blender and add the peas, stock and mint leaves. Slowly bring the Vitamix up to full speed and blend until the soup is hot, about 6 minutes. Season the soup with salt and pepper.",
        "Meanwhile, preheat an electric panini press on the “panini” setting according to the manufacturer’s instructions. Place the bread on a work surface and brush with the remaining 2 Tbs. olive oil. Turn 4 of the slices over and spread each with 1/2 Tbs. mustard. Top with the ham and cheese, dividing evenly. Cover with the remaining bread slices, oiled side up.",
        "Place 2 of the sandwiches on the preheated panini press, close the lid, and cook until the bread is crisp and the cheese is melted, about 4 minutes. Transfer the sandwiches to a cutting board and cut in half. Repeat with the remaining sandwiches.",
        "Pour the soup into bowls and garnish with crème fraîche and slivered mint. Serve the sandwiches alongside. Serves 4.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "4 Tbs. olive oil",
        "2 shallots, thinly sliced",
        "1 garlic clove, minced",
        "1 lb. fresh or frozen peas, blanched",
        "2 cups vegetable stock",
        "20 large fresh mint leaves, plus slivered mint for garnish",
        "Kosher salt and freshly ground pepper, to taste",
        "8 slices country-style bread, each 1/2 inch thick",
        "2 Tbs. Dijon mustard",
        "8 oz. thinly sliced Black Forest ham",
        "5 oz. grated Gruyère cheese",
        "Crème fraîche for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pea Soup with Grilled Ham and Cheese",
    "url": "http://www.williams-sonoma.com/recipe/spring-pea-soup-ham-cheese.html"
}
