{
    "directions": [
        "Heat oil in a large skillet over medium-high. Cook onions, leeks, and celery, stirring often, until soft but not browned, 6–8 minutes. Season with salt.",
        "Preheat oven to 350°F. Toast pistachios on a rimmed baking sheet, tossing once, until golden brown, 6–8 minutes. Let cool; crush using a small saucepan (you want a mix of sizes).",
        "Pulse garlic, basil, parsley, and 1/3 cup oil in a food processor until a coarse purée forms. Transfer to a medium bowl and mix with Parmesan, lemon zest, crushed nuts, and remaining 1/3 cup oil; season with salt and pepper.",
        "Heat oil in a medium pot over medium-high. Cook thyme, bay leaf, and 1/2 cup soffritto, stirring often, until fragrant, about 2 minutes. (Reserve remaining soffritto for another use.) Add stock and bring to a boil. Reduce heat to a simmer and add sugar snap peas; cook until crisp-tender, about 4 minutes. Add kale, beans, and peas and cook until kale is wilted and peas are tender, about 3 minutes. Taste and adjust seasoning with salt and black pepper.",
        "Serve soup, topped with some Parmesan and red pepper flakes, with toast and pesto.",
        "Soffritto can be made 3 days ahead. Let cool; cover and chill, or freeze up to 1 month."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "2 medium onions, finely chopped",
        "3 medium leeks, white and pale-green parts only, finely chopped",
        "3 celery stalks, finely chopped",
        "Kosher salt",
        "2 tablespoons raw pistachios",
        "1 garlic clove, chopped",
        "1 cup (packed) basil leaves",
        "1 cup (packed) parsley leaves with tender stems",
        "2/3 cup olive oil, divided",
        "1/2 cup finely grated Parmesan",
        "1/2 teaspoon finely grated lemon zest",
        "Kosher salt, freshly ground pepper",
        "1 tablespoon olive oil",
        "4 sprigs thyme",
        "1 bay leaf",
        "4 cups low-sodium chicken stock or water",
        "6 ounces sugar snap peas, trimmed, sliced in half crosswise",
        "1/2 bunch small Tuscan kale, ribs and stems removed, leaves torn",
        "1 (14.5-ounce) can cannellini (white kidney) beans, rinsed",
        "1 cup shelled fresh peas (from about 1 pound pods) or frozen peas, thawed",
        "Kosher salt, freshly ground pepper",
        "Thinly shaved Parmesan and crushed red pepper flakes (for serving)",
        "4 3/4-inch-thick slices country-style bread, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Soup/Stew",
        "Spring",
        "Pistachio",
        "Basil",
        "Sugar Snap Pea",
        "Kale",
        "Parmesan",
        "Dinner",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Spring Minestrone Verde with Pistachio Pesto",
    "url": "http://www.epicurious.com/recipes/food/views/spring-minestrone-soup-with-pistachio-pesto"
}
