{
    "directions": [
        "If using dried morels, soak in warm water to cover 30 minutes. Agitate fresh or dried morels in water to dislodge grit, then lift from water, squeezing out excess, and pat dry with paper towels. Whether using fresh or dried, leave small morels whole and halve or quarter larger ones.",
        "Cook beans in a 4-quart saucepan of boiling salted water 3 minutes, then transfer with a slotted spoon or skimmer to a colander and rinse under cold water. Peel skins from beans with your fingers. (Keep water simmering, covered.)",
        "Heat 2 tablespoons butter in a 12-inch nonstick skillet over moderately high heat until foam subsides, then sauté morels, stirring, until tender, about 4 minutes. Season with salt and pepper. Remove from heat and let stand, covered.",
        "Return water in saucepan to a boil, then cook asparagus, sugar snaps, and scallions until crisp-tender, 1 1/2 to 2 minutes. Add beans and immediately drain well in colander. Add vegetables and remaining 2 tablespoons butter to morels and toss to combine. Stir in mint and salt and pepper to taste and serve immediately."
    ],
    "ingredients": [
        "1/2 lb fresh or 2 oz dried morel mushrooms (preferably small)",
        "2 lb fresh fava beans, shelled (2 cups)",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1 1/2 lb thin asparagus, cut diagonally into 1 1/2-inch pieces",
        "1 lb sugar snap peas, trimmed",
        "4 bunches scallions (white and pale green parts only), trimmed and cut into 2 1/2-inch lengths",
        "2 tablespoons chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Mushroom",
        "Onion",
        "Side",
        "Sauté",
        "Quick & Easy",
        "Mint",
        "Asparagus",
        "Spring",
        "Sugar Snap Pea",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spring Vegetable Sauté",
    "url": "http://www.epicurious.com/recipes/food/views/spring-vegetable-saute-107991"
}
