{
    "directions": [
        "Line a baking sheet with a kitchen towel. Fill a medium bowl with water; add lemon juice. If using baby artichokes, working one at a time, cut away tough outer leaves until only pale-yellow leaves remain. Cut 1/2\" off tops; trim stems. Halve artichokes lengthwise, if desired, then remove choke with a spoon. Place in lemon water as you finish. If using globe artichokes, remove stems and all leaves. Scrape out chokes with a spoon; cut each artichoke heart into 4 quarters and add to lemon water.",
        "Cook fava beans in a large pot of boiling salted water until just tender, about 2 minutes. Using a slotted spoon, transfer to a bowl of ice water; let cool. Peel and discard outer skins; transfer to prepared baking sheet (if using edamame, boil for only 1 minute; no peeling needed). Repeat cooking process with asparagus and artichokes, returning water to a boil between batches and cooling in ice water before transferring to prepared baking sheet, 3-4 minutes for asparagus and 5-6 minutes for artichokes (1-2 minutes if frozen).",
        "Heat 2 tablespoons oil and butter in a large skillet over medium heat; add onion and sauté until translucent, about 5 minutes. Increase heat to medium-high. Add vegetables and cook, stirring occasionally, just until heated through, about 5 minutes. Season to taste with salt, pepper, and more lemon juice, if desired.",
        "Transfer vegetables to a serving bowl. Drizzle with oil; garnish with mint and zest."
    ],
    "ingredients": [
        "Zest and juice from 1 lemon plus more juice for seasoning",
        "2 pounds baby artichokes, 6 globe artichokes, or 1 pound frozen artichoke hearts, thawed",
        "2 pounds fava beans, shelled (about 1 cup), or 1 cup frozen edamame (soybeans), thawed",
        "Kosher salt",
        "1 pound asparagus (about 1 large bunch), cut on a diagonal into 2\" pieces",
        "2 tablespoons extra-virgin olive oil plus more for drizzling",
        "1 tablespoon unsalted butter",
        "1 medium red onion, finely chopped",
        "Freshly ground black pepper",
        "2 tablespoons thinly sliced fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Onion",
        "Side",
        "Sauté",
        "Easter",
        "Passover",
        "Vegetarian",
        "High Fiber",
        "Artichoke",
        "Asparagus",
        "Spring",
        "Healthy",
        "Low Cholesterol",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Spring Vegetable Sauté",
    "url": "http://www.epicurious.com/recipes/food/views/spring-vegetable-saute-395478"
}
