{
    "directions": [
        "Heat the olive oil and butter in a medium saucepan over medium heat. Add the leeks and fennel and saute for 5 to 7 minutes, until tender. Add the rice and stir for a minute to coat with the vegetables, oil, and butter. Add the white wine and simmer over low heat, stirring constantly, until most of the wine has been absorbed. Add the chicken stock, 2 ladles at a time, stirring almost constantly and waiting for the stock to be absorbed before adding more. This process should take 25 to 30 minutes.",
        "Meanwhile, cut the asparagus diagonally in 1-inch lengths and discard the tough ends. Blanch in boiling salted water for 4 to 5 minutes, until al dente. Drain and cool immediately in ice water. (If using fresh peas, blanch them in boiling water for a few minutes until the starchiness is gone.)",
        "When the risotto has been cooking for 15 minutes, drain the asparagus and add it to the risotto with the peas, artichokes, lemon zest, 1 tablespoon salt, and 1 1/2 teaspoons pepper. Continue cooking and adding stock, stirring almost constantly, until the rice is tender but still firm.",
        "When the risotto is done, turn off the heat and stir in the mascarpone, Parmesan cheese, lemon juice and chives. Serve hot with a sprinkling of chives and more Parmesan cheese."
    ],
    "ingredients": [
        "1 1/2 tablespoons good olive oil",
        "1 1/2 tablespoons unsalted butter",
        "3 cups chopped leeks, white and light green parts (2 leeks)",
        "1 cup chopped fennel",
        "1 1/2 cups Arborio rice",
        "2/3 cup dry white wine",
        "4 to 5 cups simmering chicken (or vegetable) stock or preferably homemade",
        "1 pound thin asparagus",
        "10 ounces frozen peas, defrosted, or 1 1/2 cups shelled fresh peas",
        "8 ounces frozen artichoke hearts, defrosted",
        "1 tablespoon freshly grated lemon zest (2 lemons)",
        "Kosher salt and freshly ground black pepper",
        "1/3 cup mascarpone cheese, preferably Italian",
        "1/2 cup freshly grated Parmesan cheese, plus extra for serving",
        "2 tablespoons freshly squeezed lemon juice",
        "3 tablespoons minced fresh chives, plus extra for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Risotto Recipes",
        "Artichoke",
        "Vegetable",
        "Asparagus",
        "Rice Recipes",
        "Cheese",
        "Leek Recipes"
    ],
    "title": "Spring Green Risotto With Artichokes",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/spring-green-risotto-with-artichokes-recipe"
}
