{
    "directions": [
        "Chop white and pale-green parts of leeks and wash well in a bowl of cold water. Lift leeks from water with a slotted spoon and transfer to a colander to drain. Trim fennel stalks flush with bulb and remove any discolored areas of bulb. Halve bulb lengthwise and cut each half crosswise into 1/2-inch-thick slices, discarding cores. Halve or quarter larger morels lengthwise, leaving smaller ones whole.",
        "Cook turnips in a 6-quart heavy pot of salted boiling water until crisp-tender, about 2 minutes. Transfer turnips with slotted spoon to a large bowl of ice water to stop cooking. (Keep water boiling.) Boil carrots until crisp-tender, about 3 minutes, and transfer with slotted spoon to ice water. Boil fava beans until crisp-tender, about 2‚ minutes, and transfer with slotted spoon to ice water. Gently boil potatoes until almost tender, about 15 minutes, and drain in colander. Rinse under cold running water. Drain blanched vegetables and gently peel outer skins from fava beans. Halve potatoes.",
        "Cook shallots, leeks, and salt and pepper to taste in 3 tablespoons butter in pot over moderately low heat, stirring, until softened. Add broth, zest, and 1/4 cup herbs and simmer, covered, 10 minutes. Pour mixture through a fine sieve into a bowl, pressing on solids. Discard solids and reserve broth.",
        "Cook morels in remaining 3 tablespoons butter in cleaned pot over moderate heat, stirring, until softened, about 3 minutes. Add wine and simmer until reduced to about 1 tablespoon, about 3 minutes. Add fennel, asparagus, bell peppers, and reserved broth, then simmer, covered, until vegetables are crisp-tender, about 4 minutes. Gently stir in blanched vegetables and simmer until all vegetables are just tender, about 4 minutes.",
        "Serve ragout sprinkled with remaining 1/4 cup herbs."
    ],
    "ingredients": [
        "1 pound leeks",
        "1pound fennel bulb (sometimes called anise)",
        "1/4 pound fresh morels",
        "1 pound baby turnips, trimmed and halved",
        "1 pound baby carrots, trimmed",
        "2 pound fresh fava beans, shelled (1 cup)",
        "1 pound mixed fingerling or other small boiling potatoes",
        "2 shallots",
        "3/4 stick (6 tablespoons) unsalted butter",
        "3 cups chicken broth",
        "1 1/2 tablespoons freshly grated lemon zest",
        "1/2 cup chopped mixed fresh tarragon, chives, and flat-leaf parsley",
        "1/4 cup dry white wine",
        "3/4 pound asparagus, trimmed and cut diagonally into 2-inch pieces",
        "2 yellow bell peppers, coarsely chopped",
        "Accompaniments: crusty bread and parmesan shavings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Vegetable",
        "Stew",
        "Vegetarian",
        "High Fiber",
        "Asparagus",
        "Fennel",
        "Leek",
        "White Wine",
        "Spring",
        "Healthy",
        "Tarragon",
        "Gourmet"
    ],
    "title": "Spring Vegetable Ragoût",
    "url": "http://www.epicurious.com/recipes/food/views/spring-vegetable-ragout-103321"
}
