{
    "directions": [
        "To make the beans, soak the dried beans in water to cover for 4 hours. Drain.",
        "In a large saucepan, combine 8 cups water with the beans, the lemon half, garlic, thyme, and salt. Bring to a simmer and cook for 45 to 50 minutes, or until al dente.",
        "To prepare the lamb, combine the olive oil, rosemary, and garlic in a shallow dish; add the lamb tenderloins, and marinate for 3 to 6 hours, depending on how much time you have and how much flavor you want the meat to absorb.",
        "To make the beans, soak the dried beans in water to cover for 4 hours. Drain.",
        "To make the salad, over an open flame, roast the bell pepper until all sides are properly charred, but not completely burnt.",
        "Place the pepper in a bowl and cover with plastic wrap for 5 minutes. (This will steam the pepper, making it easier to remove the skin.) Remove the skin and seeds from the pepper,then julienne and set aside.",
        "Bring a pot of salted water to a boil on the stove. Peel off the outer artichoke leaves until you reach a layer where they are almost yellow. Blanch the artichokes for 7 minutes, then let them cool down a bit before cutting each one in half. Coat them with extra virgin olive oil and season with salt and pepper.",
        "Preheat the grill to medium-high. Remove the lamb from the marinade, removing any pieces of garlic or rosemary because they will burn on the grill. Season the lamb with salt and pepper. Grill the lamb for 4 to 5 minutes, or until medium-rare,turning them a few times. Grill the artichokes at the same time, turning them a few times, until you get grill marks on all sides, about 3 minutes. Let the lamb rest for 2 to 3 minutes, then slice. Place the beans, bell pepper slices, frisée, and artichokes in a bowl with the tapenade. Toss gently and season with salt and pepper. Place the sliced lamb on top and serve."
    ],
    "ingredients": [
        "1 pound dried flageolet beans",
        "1/2 lemon",
        "1/2 cup chopped fresh garlic",
        "10 sprigs thyme",
        "2 teaspoons kosher salt",
        "1/4 cup extra virgin olive oil",
        "2 sprigs rosemary, chopped",
        "2 tablespoons chopped fresh garlic",
        "8 spring lamb tenderloins",
        "1/2 cup extra virgin olive oil",
        "1 tablespoon chopped spring garlic",
        "1/4 cup pitted and chopped kalamata olives",
        "Salt and freshly ground black pepper",
        "1 red bell pepper",
        "8 baby artichokes",
        "Extra virgin olive oil",
        "2 ounces frisée",
        "Salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Lamb",
        "Vegetable",
        "Marinate",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Meat",
        "Legume",
        "Grill/Barbecue",
        "Boil",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Spring Lamb with Grilled Baby Artichokes – Mr. Bean",
    "url": "http://www.epicurious.com/recipes/food/views/spring-lamb-with-grilled-baby-artichokes-mr-bean-363469"
}
