{
    "directions": [
        "1. Combine the pork with 1 teaspoon of the cornstarch and the soy sauce. Set aside.",
        "2. Combine the baby shrimp with the wine. Set aside.",
        "3. Heat the 2 tablespoons of oil in a wok or skillet and cook the pork mixture, stirring until the pork loses its raw color.",
        "4. Add the bamboo shoots and shredded carrots and salt to taste. Add 1/4 cup of the chicken broth, stirring and cooking quickly.",
        "5. Blend 2 remaining teaspoons of cornstarch with the leftover 1/4 cup of chicken broth and stir into the cooked filling. Add the baby shrimp, bean sprouts, and Chinese celery cabbage and cook, stirring briefly, for approximately 1 minute. Immediately remove the filling from the heat. Turn into a colander to let the filling cool and drain.",
        "6. Stack the spring roll skins on a clean work area and cover with a damp cloth.",
        "7. Lay one skin on a flat surface, one corner facing down, and spoon 2 tablespoons of filling about 2-inches from the bottom corner. Shape the filling horizontally into a long sausage shape.",
        "8. Fold the bottom corner over the filling and roll upwards one turn so the filling is completely encased. Moisten the left and right corners of the triangle with beaten egg, fold in the corners, and press down firmly to seal, creating an envelope.",
        "9. Moisten the top corner of the skin with beaten egg and give one more turn, sealing the cylinder. Set aside and repeat with the remainder of the filling and skins.",
        "10. Heat the oil for deep-frying in a wok or deep fryer until almost smoking (approximately 375°). Add 5 spring rolls at a time, turn and fry until crisp and golden brown, approximately 2 minutes.",
        "11. Remove the spring rolls with a slotted spoon and drain on several paper towels. Repeat with remaining spring rolls and serve immediately."
    ],
    "ingredients": [
        "1/2 lb. minced pork",
        "3 teaspoons cornstarch",
        "1 teaspoon dark soy sauce",
        "8 oz. baby shrimp",
        "1 teaspoon Shao Hsing wine or white wine",
        "2 tablespoons vegetable or corn oil",
        "1/2 cup shredded bamboo shoots",
        "8 oz. shredded carrots",
        "1/2 cup chicken broth",
        "1/2 lb. fresh bean sprouts",
        "2 cups finely shredded chopped Chinese celery cabbage or Napa cabbage",
        "20 square spring roll skins (available in Chinese supermarkets — ask for Shanghai spring roll skins)",
        "1 beaten egg for sealing",
        "1 quart vegetable, corn, or peanut oil for deep frying"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Fry",
        "Cocktail Party",
        "Super Bowl",
        "Shrimp",
        "Carrot",
        "Poker/Game Night",
        "Deep-Fry",
        "Cabbage",
        "Party",
        "Soy Sauce",
        "Sugar Conscious",
        "Dairy Free",
        "Tree Nut Free"
    ],
    "title": "Spring Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/spring-rolls-104619"
}
