{
    "directions": [
        "Preheat the oven to 400 degrees F. Melt 2 tablespoons butter in a large ovenproof skillet over medium-high heat. Add the onion and thyme and cook, stirring, until the onion softens, about 5 minutes.",
        "Meanwhile, combine the butternut and kabocha squash in a large microwave-safe bowl with 1 cup water. Cover with plastic wrap and microwave until the squash is just tender, about 5 minutes. Drain and add the squash to the skillet along with the garlic, mace, 1 teaspoon salt and a few grinds of pepper. Cook, stirring, about 3 minutes. Add the broth and cook until it is mostly absorbed, about 5 more minutes. Stir in the heavy cream and cook until slightly thickened, 2 minutes.",
        "Melt the remaining 1 tablespoon butter in the microwave and toss with the breadcrumbs, parmesan and parsley; season with salt and pepper. Sprinkle over the squash, then top with the gruyere. Transfer the skillet to the oven and bake until golden, about 30 minutes. Let rest 5 minutes before serving.",
        "How to break down butternut squash:",
        "Cut about 1 inch off the bottom end with a chef's knife. Scoop out the seeds.",
        "Hold the squash against your body and remove the skin with a vegetable peeler; chop.",
        "How to break down kabocha squash:",
        "Quarter the squash with a chef's knife, then scoop out the seeds.",
        "Put each quarter flat-side down and cut off the skin with a paring knife; chop the squash.",
        "Photograph by David Malosh"
    ],
    "ingredients": [
        "3 tablespoons unsalted butter",
        "1 medium onion, chopped",
        "1 tablespoon chopped fresh thyme",
        "1 small butternut squash, peeled and cut into 1/2-inch cubes",
        "1 small kabocha squash, peeled and cut into 1/2-inch cubes",
        "2 cloves garlic, minced",
        "1/4 teaspoon ground mace",
        "Kosher salt and freshly ground pepper",
        "1 cup low-sodium chicken or vegetable broth",
        "1/2 cup heavy cream",
        "1/4 cup breadcrumbs",
        "2 tablespoons grated parmesan cheese",
        "2 tablespoons chopped fresh parsley",
        "1/2 cup grated gruyere cheese (about 2 ounces)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Squash",
        "Vegetable"
    ],
    "title": "Squash Gratin",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/squash-gratin"
}
