{
    "directions": [
        "Preheat oven to 400°F.",
        "Brush cut sides of squash with 1/2 teaspoon oil and arrange, cut sides down, in a shallow baking pan. Prick sweet potatoes all over with a fork and roast with squash until very tender, about 50 minutes for squash and about 1 1/4 hours for sweet potatoes.",
        "Cool vegetables and scoop flesh from squash into a bowl. Peel sweet potatoes and add to squash.",
        "Cook onion in remaining 2 1/2 teaspoons oil with salt to taste in a 6-quart heavy pot over moderately high heat, stirring occasionally, until golden brown, about 10 minutes. Stir in squash and sweet potato, leek, ginger, and 8 cups stock and simmer, uncovered, stirring occasionally, 30 minutes.",
        "Purée in batches in a blender (use caution when blending hot liquids), transferring to a clean pot. Bring to a simmer and, if too thick, add more stock. Season with salt and white pepper. Finish with lemon juice and, if desired, honey.",
        "Serve soup drizzled with some chipotle sauce or swirl sauce in to make a pattern."
    ],
    "ingredients": [
        "3 lb butternut squash (1 large), halved lengthwise and seeds discarded",
        "1 tablespoon olive oil",
        "2 lb sweet potatoes (2 large)",
        "1 large onion, chopped",
        "White part of 1 leek, chopped",
        "2 teaspoons chopped peeled fresh ginger",
        "8 to 10 cups light vegetable stock or broth",
        "White pepper to taste",
        "2 to 3 tablespoons fresh lemon juice, or to taste",
        "1 tablespoon honey (optional)",
        "Chipotle sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Vegetable",
        "Sauté",
        "Squash",
        "Butternut Squash",
        "Sweet Potato/Yam",
        "Fall",
        "Gourmet"
    ],
    "title": "Squash and Sweet-Potato Soup with Chipotle Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/squash-and-sweet-potato-soup-with-chipotle-sauce-102561"
}
