{
    "directions": [
        "Heat olive oil and butter in a skillet over medium heat. Stir in garlic and ginger; cook and stir until fragrant, about 3 minutes. Stir in kohlrabi, and season with salt and pepper. Cook and stir until kohrabi has softened, 3 to 4 minutes. Toss in yellow squash and continue to cook until squash is tender for 4 more minutes. Stir in the green onion, spinach, and nutmeg. Add more salt and pepper, as needed. Cook until the spinach has wilted, about 1 minutes. Set mixture aside to cool.",
        "Preheat an oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper. Beat the egg with water in a small bowl; set aside.",
        "Roll out the pie crust by running a rolling pin over it once or twice. Cut out about 16 6-inch circles using a large cookie cutter or cereal bowl. Fill the center of each circle with about 1 tablespoon of the kohlrabi mixture. Brush the edges of the pastry with water, then fold the dough in half. Crimp the edge of the dough with a fork to seal, and place on the prepared baking sheet. Repeat with the remaining pastry and vegetable filling. Prick each empanada with a fork, then brush with the egg wash.",
        "Bake in the preheated oven until golden brown and flaky, 5 to 7 minutes. Serve hot from the oven."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "1 tablespoon butter",
        "3 cloves garlic, minced",
        "1 (1 inch) piece fresh ginger, minced",
        "2 kohlrabi bulbs, peeled and cubed",
        "salt and pepper to taste",
        "1 large yellow squash, cubed",
        "2 green onions, chopped",
        "1/2 cup chopped fresh spinach",
        "1 pinch ground nutmeg",
        "1 egg",
        "1 teaspoon water",
        "1 (15 ounce) package pastry for a 9 inch double crust pie"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Squash and Kohlrabi Empanadas",
    "url": "http://allrecipes.com/recipe/214911/squash-and-kohlrabi-empanadas/"
}
