{
    "directions": [
        "Preheat the oven to 400 degrees F. Soak the lasagna noodles in warm water.",
        "Heat the oil in a large skillet over medium heat. Add the garlic, onions and salt and pepper. Cook, stirring occasionally, until the vegetables are tender and browned, about 10 minutes. If the mixture becomes too dry, add a tablespoon or two of water.",
        "Meanwhile, stir together 1/2 cup of the milk and the cornstarch in a small bowl until smooth. Heat the remaining 3 1/2 cups milk in a large saucepan until bubbling. Stir the cornstarch mixture into the milk and bring to a boil. Simmer, stirring, until the milk thickens to the consistency of a thin batter, about 5 minutes. Stir in the onion mixture, spinach, parsley and nutmeg, and cook until the spinach wilts. Season with salt and pepper. Remove from the heat.",
        "Drain the noodles. Spread 1 cup of the spinach mixture over the bottom of a 13- by 9- by 2-inch glass or ceramic baking dish. Arrange 3 lasagna noodles over the spinach. Arrange half of the squash over the noodles, overlapping slightly, and sprinkle with one-third of the mozzarella. Spoon 1 cup spinach mixture over the cheese, and top with 3 noodles, the remaining squash and another third of the mozzarella. Top with 1 cup spinach mixture, followed by the last 3 noodles and the remaining 1 cup spinach mixture. Cover tightly with foil; reserve the remaining mozzarella.",
        "Bake for 40 minutes. Uncover and sprinkle the remaining mozzarella over the top. Bake until bubbling and the squash is tender, about 15 minutes. Let stand at least 10 minutes before serving."
    ],
    "ingredients": [
        "9 no-boil lasagna noodles",
        "1 tablespoon extra-virgin olive oil",
        "3 cloves garlic, finely chopped",
        "1 large onion, finely chopped",
        "Kosher salt and freshly ground black pepper",
        "4 cups lowfat (1-percent) milk",
        "1/4 cup cornstarch",
        "Two 5-ounce packages baby spinach",
        "1/2 cup fresh flat-leaf parsley leaves, finely chopped, plus more, for garnish",
        "1/4 teaspoon freshly grated nutmeg",
        "1 butternut squash (about 2 1/2 pounds), peeled, seeded, halved lengthwise and cut into 1/4-inch-thick half-moons",
        "2 cups shredded part-skim mozzarella"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Vegetarian",
        "Healthy",
        "Lasagna Recipes",
        "Butternut Squash",
        "Vegetable",
        "Spinach",
        "Main Dish Recipes",
        "High Fiber",
        "Low Calorie",
        "Low-Fat",
        "Heart-Healthy",
        "Low-Cholesterol"
    ],
    "title": "Squash and Spinach Lasagna",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/squash-and-spinach-lasagna-recipe"
}
