{
    "directions": [
        "Heat avocado oil in a deep skillet over medium heat; cook and stir minced garlic until fragrant, about 1 minute. Stir in squid and a pinch of salt. Pour 2 cups water and 1 cup wine over squid, ensuring squid is fully submerged. Cover skillet and bring liquid to a boil; reduce heat and simmer until squid is tender, about 40 minutes.",
        "Bring 8 cups generously salted water to a boil in a pot. Cook squid ink pasta at a boil until tender yet firm to the bite, about 11 minutes. Drain, reserving pasta water.",
        "Remove squid from skillet and place in a bowl. Add shallot and scallions to skillet; cook and stir in the remaining liquid for about 3 minutes. Stir in butter, a splash of white wine, lemon juice, basil, paprika, dried roasted garlic, Parisian herb blend, salt, and pepper. Slowly pour in cream until sauce reaches desired color and consistency.",
        "Mix squid into the sauce and cook until sauce reduces and thickens, about 5 minutes. Add some of the reserved pasta water if sauce gets too thick. Add pasta to sauce; toss to coat lightly with sauce."
    ],
    "ingredients": [
        "1 tablespoon avocado oil, or as needed",
        "2 teaspoons minced garlic",
        "5 squid, cleaned and cut into 1/2-inch rings",
        "salt and ground black pepper to taste",
        "10 cups water, divided",
        "1 cup white wine",
        "1 (16 ounce) package uncooked black squid ink pasta",
        "1 shallot, chopped",
        "2 scallions, sliced diagonally",
        "2 tablespoons butter",
        "1 splash white wine",
        "1 teaspoon lemon juice, or to taste",
        "1/4 teaspoon dried basil",
        "1/4 teaspoon sweet paprika",
        "1/4 teaspoon dried roasted garlic",
        "1/4 teaspoon Parisian herb blend",
        "1 pint heavy whipping cream, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Squid Ink Pasta with Calamari",
    "url": "http://allrecipes.com/recipe/257029/squid-ink-pasta-with-calamari/"
}
