{
    "directions": [
        "Pat squid dry, then cut bodies lengthwise into 1/4-inch-wide strips and quarter tentacles lengthwise. Season with salt and pepper.",
        "Heat 1 teaspoon oil in a 12-inch nonstick skillet over high heat until hot but not smoking, then cook oregano, rosemary, red pepper flakes, and 1 teaspoon garlic, stirring, until fragrant, about 30 seconds. Add squid strips and tentacles and sauté, stirring constantly, until opaque and curled, about 1 minute. (Do not overcook, or squid will toughen.) Transfer to a sieve set over a bowl to catch juices squid releases.",
        "Combine squid juices from bowl with fish stock in a saucepan and bring to a simmer. Season with salt and keep at a bare simmer.",
        "Heat remaining 2 teaspoons oil in a large heavy saucepan over moderate heat until hot but not smoking, then cook remaining garlic, stirring frequently, until pale golden, 2 to 3 minutes. Stir in rice and cook, stirring constantly, until rice is translucent, 4 to 5 minutes. Add wine and cook, stirring constantly, until absorbed. Stir in 1 cup simmering broth mixture and cook at a strong simmer, stirring frequently, until broth is absorbed. Continue cooking at a strong simmer and adding broth, 1/2 cup at a time, stirring frequently and letting each addition be absorbed before adding the next, until rice is tender but still al dente and creamy looking, 18 to 20 minutes total. (There may be broth left over.)",
        "Stir in squid and parsley and cook just until heated through, about 1 minute. Add lemon juice and salt and pepper to taste."
    ],
    "ingredients": [
        "1 lb cleaned squid",
        "1 tablespoon olive oil",
        "2 teaspoons chopped fresh oregano, or to taste",
        "1/2 teaspoon chopped fresh rosemary",
        "Pinch of dried hot red pepper flakes",
        "4 garlic cloves, minced",
        "5 1/2 cups fish stock, or 2 (8-oz) bottles",
        "clam juice mixed with 3 cups water",
        "1 1/4 cups Arborio rice (8 oz)",
        "1 cup dry white wine",
        "3/4 cup fresh flat-leaf parsley",
        "1 teaspoon fresh lemon juice, or to taste",
        "Accompaniment: lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Pasta",
        "Rice",
        "Sauté",
        "Squid",
        "Gourmet"
    ],
    "title": "Squid Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/squid-risotto-102566"
}
