{
    "directions": [
        "Pulse yolk, garlic, and lemon juice in a food processor to combine. With the motor running, drizzle in oil, drop by drop at first, then increasing to a slow, steady stream; process until aioli is thick and light. Season with salt.",
        "Whisk egg whites and a pinch of salt in a medium bowl until soft peaks form.",
        "Whisk flour in a large bowl to remove lumps. Create a well in the center and gradually add club soda, whisking from the center outward to incorporate and blend, until batter is the consistency of heavy cream (you may have some club soda left over). Fold egg whites into batter; cover and chill 30 minutes.",
        "Fit a large heavy pot with thermometer; pour in oil to 4\" up sides and heat over medium-high until thermometer registers 350°F. Working in 3 batches and returning oil to 350°F after each, dip squid into batter, letting excess drip back into bowl. Fry, turning occasionally to brown evenly and separating pieces as needed, until golden and crisp, about 2 minutes (squid may spatter in oil, so be careful). Using a spider or slotted spoon, transfer to a paper towel–lined wire rack; season with salt.",
        "Working in 2 batches for each, repeat process with lemon rounds, then zucchini blossoms. Serve fritto misto with aioli and lemon wedges.",
        "Aioli can be made 1 day ahead. Cover and chill."
    ],
    "ingredients": [
        "1 large egg yolk",
        "1 garlic clove, finely grated",
        "2 tablespoons fresh lemon juice",
        "1/2 cup olive oil",
        "Kosher salt",
        "2 large egg whites, room temperature",
        "2 1/2 cups all-purpose flour",
        "2 1/2 cups club soda",
        "Vegetable oil (for frying; 6–8 cups)",
        "1 pound baby squid, cleaned, bodies and tentacles separated, patted dry",
        "1 lemon, sliced into very thin rounds, seeds removed, patted dry",
        "8 zucchini blossoms, stamen removed (stems left intact)",
        "Lemon wedges, for serving",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Seafood",
        "Squid",
        "Lemon",
        "Fry",
        "Dip",
        "Garlic",
        "Lemon Juice",
        "Appetizer",
        "Summer",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Squid, Lemon, and Zucchini Blossom Fritto Misto",
    "url": "http://www.epicurious.com/recipes/food/views/squid-lemon-and-zucchini-blossom-fritto-misto"
}
