{
    "directions": [
        "Toast sesame seeds until golden. Cut onion half lengthwise into thin slices. Cut bell peppers into 1-inch pieces. Mince garlic. Peel and quarter tomatoes. Seed quarters and halve lengthwise. Cut flaps and tentacles from squid sacs. Cut sacs into 1/4-inch-thick strips and crosswise into 1/4-inch-thick rings. Halve tentacles and flaps lengthwise if large. Pat squid dry with paper towels and season with salt and pepper.",
        "Heat a wok or large heavy skillet over high heat until a bead of water dropped on cooking surface evaporates immediately. Add 2 tablespoons peanut oil, swirling wok or skillet to coat evenly, and heat until hot but not smoking. Add onion and stir-fry until softened. Add peppers and stir-fry until crisp-tender, about 5 minutes. Add garlic and stir-fry until fragrant, about 30 seconds. Add tomatoes, soy sauce, and vinegar and simmer, stirring, 1 minute. Transfer mixture to a large bowl.",
        "Add 1 tablespoon peanut oil to wok or skillet and heat until just smoking. Stir-fry half of squid until just opaque, about 30 seconds, and transfer with juices to bowl of vegetables. Add remaining tablespoon peanut oil and stir-fry remaining squid, transferring to bowl. Return squid-vegetable mixture to wok or skillet and stir-fry until heated. Season stir-fry with salt and pepper and stir in sesame oil.",
        "Serve stir-fry over rice, sprinkled with sesame seeds and garnished with parsley."
    ],
    "ingredients": [
        "3 tablespoons sesame seeds",
        "1/2 large onion",
        "2 red bell peppers",
        "1 yellow bell pepper",
        "2 garlic cloves",
        "6 plum tomatoes",
        "1 pound cleaned small squid",
        "4 tablespoons peanut oil",
        "1/4 cup soy sauce",
        "3 tablespoons seasoned",
        "2 teaspoons Asian sesame oil",
        "Accompaniment: Cooked Rice",
        "Garnish: fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pepper",
        "Shellfish",
        "Tomato",
        "Stir-Fry",
        "Quick & Easy",
        "Fall",
        "Gourmet"
    ],
    "title": "Squid and Bell Pepper Stir-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/squid-and-bell-pepper-stir-fry-14489"
}
