{
    "directions": [
        "Heat 2 tablespoons oil in a large skillet over high. Working in 2 batches, season squid with salt and pepper and cook, stirring often, until cooked through, about 3 minutes (don't overcook or it'll get rubbery). Transfer to a small bowl.",
        "Reduce heat to medium-high and heat 2 tablespoons oil in skillet (no need to wipe out). Add fennel slices, season with salt and pepper, and cook, stirring occasionally, until golden brown and soft, 10–12 minutes (some nicely browned bits should be stuck to skillet). Add garlic, red pepper flakes, and half of lemon slices; cook, tossing occasionally, until garlic and lemon are soft, about 2 minutes.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, reserving 1 1/2 cups pasta cooking liquid.",
        "Add pasta to skillet along with 1 cup cooking liquid. Toss, scraping up any browned bits; season with salt and pepper. Cook, tossing and adding more cooking liquid as needed, until sauce coats pasta, about 3 minutes. Add squid and give it all another toss to combine.",
        "Toss parsley, fennel fronds, remaining lemon slices, and remaining 1 tablespoon oil in a small bowl; season with salt and pepper. Serve pasta topped with salad."
    ],
    "ingredients": [
        "5 tablespoons olive oil, divided",
        "1 pound squid (bodies and tentacles), bodies sliced 1/4\" thick",
        "Kosher salt, freshly ground pepper",
        "Freshly ground pepper",
        "1 large fennel bulb, thinly sliced lengthwise, plus 2 tablespoons fronds",
        "2 garlic cloves, thinly sliced",
        "3/4 teaspoon crushed red pepper flakes",
        "1/2 lemon, seeds removed, very thinly sliced, divided",
        "12 ounces linguine or fettuccine",
        "1/2 cup parsley leaves with tender stems"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Kid-Friendly",
        "Dinner",
        "Squid",
        "Fennel",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Squid and Fennel Pasta with Lemon and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/squid-and-fennel-pasta-with-lemon-and-herbs-56389530"
}
