{
    "directions": [
        "Peel and devein shrimp, saving heads and/or shells. Finely chop shrimp; set aside. Heat 1 tablespoon oil in a medium saucepan over medium-high and cook smashed garlic, stirring, until golden, about 1 minute. Add reserved shrimp heads and/or shells and cook, stirring, until bright pink, about 2 minutes. Add bay leaf and 2 cups water and bring to a boil. Reduce heat and simmer until stock is slightly reduced and flavorful, 8–10 minutes. Strain through a fine-mesh sieve into a large bowl; discard solids.",
        "Heat remaining 2 tablespoons oil in a large skillet over medium-high. Add sliced garlic and cook, stirring, until fragrant, about 1 minute. Remove skillet from heat and carefully add tomatoes and 1 cup stock (mixture may sputter). Return to heat and cook, stirring occasionally, until sauce is beginning to thicken, about 3 minutes. Add nduja, using a wooden spoon to work it into the sauce. Reduce heat and simmer, stirring occasionally, until flavors have melded, about 3 minutes. Stir in reserved shrimp and cook, stirring occasionally, until opaque, about 2 minutes.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente (pasta will still be opaque and very firm in the center). Drain pasta, reserving 1 1/2 cups pasta cooking liquid.",
        "Add pasta and 1 cup pasta cooking liquid to sauce and cook, tossing often and adding more cooking liquid to help finish cooking pasta, until pasta is al dente and sauce is thickened (but still saucy) and coats pasta, about 5 minutes. Add lemon juice and 1/4 cup parsley; toss. Taste and season with salt and pepper. Serve pasta topped with more parsley.",
        "Do ahead: Stock can be made 1 day ahead. Let cool; cover and chill. Wrap tightly and chill shrimp separately."
    ],
    "ingredients": [
        "1 pound large head-on or shell-on shrimp",
        "3 tablespoons olive oil, divided",
        "6 garlic cloves, divided, 2 smashed, 4 thinly sliced",
        "1 bay leaf",
        "1 cup tomato passata or puréed whole peeled tomatoes",
        "4 ounces nduja",
        "Kosher salt",
        "12 ounces squid ink linguini",
        "1/4 cup fresh lemon juice",
        "1/4 cup chopped fresh parsley, plus more for serving",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Shrimp",
        "Healthy",
        "Low Cholesterol",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Squid Ink Pasta with Shrimp, Nduja, and Tomato",
    "url": "http://www.epicurious.com/recipes/food/views/squid-ink-pasta-with-shrimp-nduja-and-tomato-51263900"
}
