{
    "directions": [
        "Place water, black beans, and quinoa in a small pot; bring to a simmer and cook until quinoa is tender, about 20 minutes. Place mixture into a bowl; mash with a fork.",
        "Heat 2 teaspoons olive oil in a small skillet over medium heat; stir in onion and saute until onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and dark brown, about 15 minutes.",
        "Stir onion, bread crumbs, chile-garlic sauce, flour, black pepper, and salt into quinoa mixture; stir in pepper jack cheese. Shape quinoa mixture into patties, place in freezer until firm, about 1 hour.",
        "Melt margarine in a microwave-safe shallow bowl in the microwave, about 15 seconds on High. Place crushed buttery crackers in a separate shallow bowl. Remove patties from freezer, dip into margarine to coat, and dredge in crushed crackers to coat evenly. Place quinoa patties on a small baking sheet; refrigerate for 1 hour.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Toss tomato slices and red pepper in a bowl with 1 teaspoon olive oil and thyme; place in a single layer on a baking sheet. Toss potato slices with remaining olive oil, garlic powder, and chili powder in a bowl; place potatoes on the baking sheet.",
        "Roast vegetables in the preheated oven until peppers and tomatoes are tender and potatoes are golden brown, about 10 minutes.",
        "Bake patties until heated through, turning once, about 20 minutes. Layer each patty with Emmentaler cheese, potato chips, Emmentaler cheese, roasted tomato, Emmentaler cheese, roasted red pepper, and Emmentaler cheese. Return patties to the oven; bake until cheese is melted, about 5 minutes. Serve on ciabatta rolls."
    ],
    "ingredients": [
        "2/3 cup water",
        "1/2 cup cooked black beans",
        "1/3 cup uncooked quinoa",
        "4 teaspoons extra-virgin olive oil, divided",
        "1/2 red onion, diced",
        "3/4 cup fine dry bread crumbs",
        "1/4 cup chile-garlic sauce (such as Sriracha)",
        "3 tablespoons all-purpose flour",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon salt",
        "1/2 cup shredded pepper jack cheese",
        "2 tablespoons margarine, or as needed",
        "3/4 cup crushed buttery round crackers",
        "1 tomato, sliced",
        "1/2 red bell pepper, chopped",
        "1 pinch dried thyme",
        "1 small red potato, thinly sliced",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon chili powder",
        "4 slices Emmentaler cheese, torn into 4 pieces",
        "4 ciabatta rolls, split and toasted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sriracha Quinoa Burger Melt",
    "url": "http://allrecipes.com/recipe/236682/sriracha-quinoa-burger-melt/"
}
