{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Beat cake mix and butter with an electric mixer on low speed in a bowl until crumbly, 3 to 5 minutes. Set aside 1 cup for topping.",
        "Press remaining crumb mixture into bottom of an ungreased 9x13 inch pan.",
        "Place in preheated oven and bake until edges begin to crisp, about 10 minutes. Remove from the oven and cool slightly.",
        "Beat cream cheese and frosting with an electric mixer on medium speed in a bowl until smooth, 3 to 5 minutes.",
        "Drop eggs one at a time into the cream cheese mixture and beat until blended, 2 to 3 minutes.",
        "Pour in 6 drops green food coloring, or more for a darker color; beat until color is blended, about 2 minutes.",
        "Beat in creme de menthe candy flavoring until thoroughly blended, about 2 minutes. Taste and add more flavoring if needed.",
        "Pour batter over the chocolate crust in the 9x13 pan.",
        "Sprinkle 1 cup reserved crumb mixture over cheesecake batter.",
        "Top with 1 cup chocolate and mint morsels; reserve remaining morsels for finishing touches.",
        "Place the pan in the preheated oven and bake until set, 42 to 45 minutes.",
        "Remove pan from oven and cool completely.",
        "Cover and refrigerate until chilled, at least 2 hours.",
        "Pour reserved chocolate and mint morsels into a small microwave-safe bowl. Microwave morsels in 45 second intervals; stir until completely melted and smooth.",
        "Pour melted chocolate into a resealable plastic bag.",
        "Clip a small bottom corner of the bag. Gently squeezing the bag, drizzle melted chocolate over the cooled cake through the clipped corner.",
        "Cut cake into bars to serve."
    ],
    "ingredients": [
        "1 (18.25 ounce) package chocolate fudge cake mix with pudding (such as Betty Crocker® Triple Chocolate Fudge cake mix)",
        "1/2 cup butter, softened",
        "3 (8 ounce) packages cream cheese, softened",
        "1 (16 ounce) container cream cheese flavored frosting (such as Betty Crocker® Rich and Creamy)",
        "3 eggs",
        "6 drops green food coloring, or as needed",
        "3 drops creme de menthe candy flavoring (such as Wilton®), or as needed",
        "1 (10 ounce) package dark chocolate and mint chips (such as Nestle® Toll House® Dark Chocolate and Mint Morsels)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "St. Patrick's Chocolate & Mint Cheesecake Bars",
    "url": "http://allrecipes.com/recipe/220321/st-patricks-chocolate-mint-cheese/"
}
