{
    "directions": [
        "Preheat broiler. Put tortillas in single layer on baking sheet. Brush with oil. Broil until toasted, about 3 minutes. Turn; set aside.",
        "Place squash in microwave-safe bowl. Sprinkle water over, cover with plastic wrap, and microwave until just tender, about 3 minutes; drain. Heat 1 tablespoon oil in large nonstick skillet over medium-high heat. Add onion and sauté until beginning to brown, about 3 minutes. Add squash; stir 1 minute. Season with salt and freshly ground black pepper. Spread out squash in even layer over 1 tortilla. Add 1 tablespoon oil to skillet. Add beans, 1/4 cup salsa, garlic, and chili powder. Using potato masher, crush until beans are coarsely mashed; season with salt and pepper. Stir in 1/4 cup salsa. Spread over second tortilla. Sprinkle cheese over third tortilla. Leave fourth tortilla plain.",
        "Broil tortillas until cheese melts and vegetables are browned in spots, about 3 minutes, watching to prevent burning. Transfer black bean tortilla to plate; sprinkle 1/4 cup chopped cilantro over. Top with cheese tortilla, squash tortilla, then plain tortilla. Cut into 4 wedges. Garnish with sour cream, salsa, and cilantro sprigs."
    ],
    "ingredients": [
        "4 8-inch-diameter flour tortillas",
        "1 8-ounce package peeled chopped butternut squash, cut into 1/2- to 3/4-inch cubes",
        "2 tablespoons vegetable oil, divided",
        "1 cup chopped white onion",
        "1 15-to 16-ounce can black beans, rinsed, drained",
        "1/2 cup salsa, divided",
        "2 garlic cloves, chopped",
        "1 teaspoon chili powder",
        "1 cup coarsely grated hot pepper",
        "Monterey jack cheese",
        "1/4 cup chopped fresh cilantro",
        "Sour cream",
        "Additional salsa",
        "Fresh cilantro sprigs (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Cheese",
        "Broil",
        "Sauté",
        "Super Bowl",
        "Vegetarian",
        "Kid-Friendly",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Butternut Squash",
        "Party",
        "Tortillas"
    ],
    "title": "Stacked Veggie Quesadilla",
    "url": "http://www.epicurious.com/recipes/food/views/stacked-veggie-quesadilla-363653"
}
