{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place zucchini, red bell pepper, and 1 onion sliced into rings into a bowl; stir in 1 cup water, vegetable oil, and dry fajita seasoning. (Mixture can be left to marinate 1 to 2 hours, if desired.) Drain vegetables.",
        "Heat vegetables in a large skillet over medium heat. Cook and stir until soft and slightly browned, about 10 minutes; transfer to a bowl and set aside.",
        "Place flour, nutritional yeast, salt, garlic powder, and dry mustard powder into a saucepan and whisk in 2 cups water until thoroughly combined.",
        "Place saucepan over medium heat and bring the mixture to a boil; reduce heat to low and simmer, whisking constantly until thick, about 5 minutes.",
        "Stir in margarine and remove sauce from heat.",
        "Pour 1/2 can of enchilada sauce into bottom of a 9x13-inch baking dish and spread the sauce out to cover the bottom. Top with 1/4 of the tortilla pieces, and spread 1/2 cup brown rice onto the tortillas.",
        "Spread 1/3 of the cooked vegetables over the brown rice.",
        "Spread 1 can of black beans over the vegetables; cover beans with 1/4 of the nutritional yeast sauce.",
        "Repeat the layers twice more.",
        "Make a final layer containing remaining 1/4 of the tortilla pieces, remaining nutritional yeast sauce, and remaining 1/2 can enchilada sauce.",
        "Bake casserole in the preheated oven until bubbling, 30 to 45 minutes; allow to stand for 10 minutes.",
        "Top casserole with optional black olives, avocado, tomato, jalapeno pepper, 2 tablespoons of chopped onion, salsa, and sour cream before serving."
    ],
    "ingredients": [
        "1/2 zucchini, cut into 1/4-inch slices",
        "1 cup red bell pepper slices",
        "1 onion, cut into 1/4-inch slices and separated into rings",
        "1 cup water",
        "1 teaspoon vegetable oil",
        "1 (1.27 ounce) packet dry fajita seasoning",
        "1/2 cup all-purpose flour",
        "1/2 cup nutritional yeast",
        "1 teaspoon salt",
        "1 1/2 teaspoons garlic powder",
        "1/2 teaspoon dry mustard powder",
        "2 cups water",
        "1/4 cup margarine",
        "2 (10 ounce) cans red enchilada sauce",
        "5 (9 inch) whole-wheat tortillas, torn into 1-inch pieces",
        "1 1/2 cups cooked brown rice",
        "3 (15 ounce) cans black beans, rinsed and drained",
        "1 tablespoon sliced black olives (optional)",
        "1/4 avocado - peeled, pitted and diced (optional)",
        "2 tablespoons chopped tomato (optional)",
        "1 jalapeno pepper, seeded and thinly sliced (optional)",
        "2 tablespoons chopped onion (optional)",
        "2 tablespoons prepared salsa (optional)",
        "2 tablespoons sour cream (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stacked Fajita Vegetable Enchilada Casserole",
    "url": "http://allrecipes.com/recipe/220393/stacked-fajita-vegetable-enchilada-ca/"
}
