{
    "directions": [
        "Char chiles directly over gas flame or in broiler until blackened all over. Enclose in paper bag; let stand 10 minutes. Peel and seed, then cut into 2x1/2-inch strips.",
        "Preheat oven to 375°F. Heat 2 tablespoons oil in medium skillet over medium heat. Add 1 tortilla to skillet; cook until slightly softened, about 15 seconds per side, turning with tongs. Transfer tortilla to paper towels to drain. Repeat with remaining tortillas, adding oil to skillet as needed.",
        "Spread 1/2 cup salsa over bottom of 8x8x2-inch glass baking dish. Arrange 4 tortillas over salsa, covering bottom of dish completely, overlapping slightly, and extending about 1 1/2 inches up sides of dish. Scatter 1 cup chicken over tortillas, then half of poblano strips. Spoon 1 1/2 cups salsa over, spreading evenly. Spoon 1/4 cup sour cream over in small dollops. Cover with 4 tortillas, overlapping slightly. Layer with remaining 1 cup chicken, remaining poblanos, 1 cup salsa, and 1/4 cup sour cream. Cover with remaining 4 tortillas, then 1 cup salsa, and remaining 1/4 cup sour cream. Sprinkle with cheese.",
        "Bake casserole until bubbling and cheese is lightly browned, about 35 minutes. Cut into 6 pieces; divide among plates. Sprinkle with cilantro. Spoon pickled red onions alongside; serve."
    ],
    "ingredients": [
        "2 poblano chiles* (8 ounces total)",
        "6 tablespoons vegetable oil, divided",
        "12 (5- to 6-inch-diameter) corn tortillas",
        "4 cups salsa verde , divided",
        "2 cups shredded roasted chicken, divided",
        "3/4 cup sour cream, stirred to loosen, divided",
        "6 ounces grated Emmenthal, Muenster, or Mexican Chihuahua cheese (about 1 1/2 cups packed)",
        "3 tablespoons chopped fresh cilantro",
        "Pickled red onions",
        "*Fresh green chiles; available at some supermarkets and at specialty foods stores and Latin markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Chicken",
        "Dairy",
        "Herb",
        "Pepper",
        "Vegetable",
        "Bake",
        "Cinco de Mayo",
        "Dinner"
    ],
    "title": "Stacked Chicken Enchiladas with Salsa Verde and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/stacked-chicken-enchiladas-with-salsa-verde-and-cheese-238505"
}
