{
    "directions": [
        "Position a rack in the lower third of an oven and preheat to 450°F. Oil a flameproof heavy roasting pan just large enough to hold the roast comfortably.",
        "Generously season all sides of the roast with salt and pepper. Place the roast, fat side up, in the prepared pan. Roast for 20 minutes, then reduce the oven temperature to 350°F. Continue roasting until an instant-read thermometer inserted into the center of the roast, away from the bone, registers 125° to 130°F for very rare to medium-rare, about 1 hour and 10 minutes more (for a total roasting time of 1 1⁄2 hours).",
        "Meanwhile, make the batter for the Yorkshire pudding: In a bowl, whisk together the eggs and milk. Whisk in the flour and salt. Pour into a small pitcher, cover and refrigerate.",
        "Transfer the roast to a carving board and cover loosely with aluminum foil. Let rest while baking the pudding.",
        "To make the pudding, increase the oven temperature to 450°F. Skim the surface fat from the drippings, reserving both the fat and the pan with the drippings. Spoon 2 Tbs. of the fat into a metal pie pan or baking pan and put the pan in the oven until it is very hot, about 4 minutes. Pour the batter into the hot pan. Bake on the lower rack until the pudding is golden and puffed, about 20 minutes, rotating once if puffing unevenly.",
        "Meanwhile, place the roasting pan with the drippings over medium heat. Pour in the wine and deglaze the pan, stirring to scrape up the browned bits. Cook until the liquid is reduced by half, about 5 minutes. Season with salt and pepper. Pour into a sauceboat.",
        "Just before the pudding is ready, slice the beef and arrange on a warmed platter. Serve with the pudding and sauce."
    ],
    "ingredients": [
        "1 standing beef rib roast, 6 to 6 1⁄2 lb.",
        "Salt and freshly ground pepper, to taste",
        "3 eggs",
        "1 cup milk",
        "1 cup all-purpose flour",
        "1⁄2 tsp. salt",
        "2 Tbs. fat from roasting pan",
        "3⁄4 cup dry red wine",
        "Salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Standing Rib Roast with Yorkshire Pudding",
    "url": "http://www.williams-sonoma.com/recipe/standing-rib-roast-with-yorkshire-pudding.html"
}
