{
    "directions": [
        "Preheat oven to 475°F.",
        "Make seasoning mixture:",
        "In a small bowl stir together seasoning mixture ingredients. Put roast, ribs side down, in center of a flameproof roasting pan, 18 by 12 by 2 inches, and rub oil on top and sides of beef so herbs will adhere. Reserve",
        "1 tablespoon seasoning mixture and rub remainder on top and sides of beef. Roast beef in lower third of oven 20 minutes.",
        "Peel potatoes and halve crosswise. Remove pan from oven and skim all but about 1/2 cup fat from pan with a bulb baster or spoon. Arrange potatoes around beef and turn with tongs to coat with fat. Season potatoes with salt and pepper. Reduce heat to 350°F. and roast beef and potatoes, turning potatoes occasionally to brown evenly, 1 1/2 hours, or until a meat thermometer inserted in fleshy part of beef registers 130°F. for medium-rare.",
        "While beef and potatoes are roasting, separate mushroom stems and caps. Slice caps 1/3-inch thick. In a food processor pulse stems until chopped coarse and in a small saucepan combine with broth and water. Simmer mixture 10 minutes. Pour mixture through a sieve into a bowl, pressing hard on solids, and discard solids.",
        "Transfer beef to a platter and let rest, covered loosely with foil, 20 to 30 minutes. Transfer potatoes to another platter and keep warm.",
        "With bulb baster or spoon skim all but about 1/4 cup fat from pan. In pan on top of stove sauté mushroom caps over moderately high heat, stirring, 2 minutes. Add reserved tablespoon seasoning mixture, mushroom liquid, and any juices from beef and boil 5 minutes. Stir in beurre manié and boil, stirring, about 3 minutes, or until thickened slightly.",
        "Serve beef with sauce and sprinkle potatoes with parsley."
    ],
    "ingredients": [
        "1 tablespoon chopped fresh rosemary leaves",
        "1 tablespoon chopped fresh thyme leaves",
        "2 garlic cloves, chopped",
        "1 1/2 teaspoons coarse salt",
        "1 teaspoon freshly ground black pepper",
        "a 3-rib standing beef rib roast (about 8 1/2 pounds), all but 1/4-inch layer  of fat removed",
        "1 tablespoon vegetable oil",
        "5 pounds russet (baking) potatoes (about 10)",
        "1 1/2 pounds Portobello mushrooms, wiped clean",
        "1 3/4 cups beef broth (a 15 1/2-ounce can)",
        "1 cup water",
        "a beurre manié made by kneading together 1 tablespoon softened  unsalted butter and 1 tablespoon all-purpose flour",
        "Garnish: chopped fresh flat-leafed parsley leaves (wash and dry before chopping)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Potato",
        "Roast",
        "Christmas",
        "Dinner",
        "Rosemary",
        "Beef Rib",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Standing Rib Roast with Potatoes and Portobello Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/standing-rib-roast-with-potatoes-and-portobello-mushrooms-13630"
}
