{
    "directions": [
        "Heat oil in large saucepan over medium heat. Add shallots and sauté until soft, about 3 minutes. Add garlic; stir 1 minute. Add 1/2 cup whiskey to saucepan. Using long match or lighter and standing back, carefully ignite mixture to burn off alcohol. When flame dies, add red wine and boil until mixture is reduced to 1 cup, about 16 minutes. Add 4 cups chicken broth and boil until mixture is reduced to 3 cups, about 15 minutes. Whisk cream and mustard in small bowl; add to saucepan and boil until sauce coats spoon and is reduced to 2 1/2 cups, about 13 minutes. DO AHEAD: Can be made 1 day ahead. Transfer to small bowl. Cover and chill.",
        "Position rack in bottom third of oven and preheat to 450°F. Place roasting rack in large roasting pan. Place roast on work surface with bones standing straight up. Using long sharp knife, cut between bones and meat to make 5-to 6-inch-deep crevice (do not cut so deep that bones come off). Pry bones away from meat gently, creating space, then fill space evenly with stuffing, packing firmly. Press bones in to compact stuffing slightly and tie bones back in place with 3 to 4 loops of kitchen string wrapped completely around roast to secure and keep stuffing in place.",
        "Combine garlic, oil, 3 tablespoons rosemary, 1 1/2 tablespoons coarse salt, 1 tablespoon ground black pepper, and crushed fennel seeds in small bowl. Rub garlic-rosemary mixture all over roast. Place rib roast, bones standing straight up, on rack in prepared roasting pan. Roast 20 minutes. Reduce oven temperature to 350°F. Roast 1 1/2 hours. Begin to check internal temperature of meat by inserting instantread thermometer into center of meat (not stuffing), straight down from top of roast; continue roasting until desired temperature is reached, about 125°F for rare and about 130°F for medium-rare, about 30 to 40 minutes longer. Transfer roast to platter; let rest at least 20 minutes and up to 45 minutes before carving. Reserve juices in roasting pan. Spoon off fat from top of juices; reserve for Yorkshire puddings, if desired, or discard if not using.",
        "Meanwhile, finish preparing gravy. Stir cracked peppercorns in small skillet over medium heat until fragrant, about 3 minutes. Place roasting pan with juices over 2 burners. Bring to boil; add 1 cup broth and 1/2 cup whiskey. Boil 2 minutes, scraping up browned bits in pan with wooden spoon.",
        "Strain pan juices into large saucepan; add gravy base. Boil until sauce coats spoon, about 4 minutes. Add toasted cracked peppercorns and remaining 2 teaspoons rosemary; simmer 1 minute. Season gravy to taste with salt.",
        "Present roast at table, then transfer roast to cutting board and cut into 1/4- to 1/2-inch-thick slices. Arrange meat slices and stuffing on platter. Serve with gravy and horseradish cream alongside."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1/2 cup finely chopped shallots (3 large)",
        "2 garlic cloves, minced",
        "1/2 cup Irish whiskey",
        "1 750-ml bottle dry red wine",
        "4 cups low-salt chicken broth",
        "1 cup heavy whipping cream",
        "2 tablespoons Dijon mustard",
        "1 4-bone standing rib-eye roast (about 9 1/2 to 10 pounds), chine bone removed, fat trimmed to 1/2 inch thick",
        "Spinach-Porcini Stuffing",
        "6 garlic cloves, finely chopped",
        "3 tablespoons olive oil",
        "3 tablespoons plus 2 teaspoons finely chopped fresh rosemary",
        "1 1/2 tablespoons coarse kosher salt",
        "1 tablespoon coarsely ground black pepper",
        "1 tablespoon fennel seeds, crushed",
        "2 teaspoons black peppercorns, coarsely cracked in mortar with pestle or in resealable plastic bag with mallet",
        "1 cup low-salt chicken broth",
        "1/2 cup Irish whiskey",
        "Horseradish Cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Roast",
        "Christmas",
        "Dinner",
        "Horseradish",
        "Meat",
        "Beef Rib",
        "Whiskey",
        "Christmas Eve",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Standing Rib Roast, Spinach-Porcini Stuffing, Irish Whiskey Gravy, and Horseradish Cream",
    "url": "http://www.epicurious.com/recipes/food/views/standing-rib-roast-spinach-porcini-stuffing-irish-whiskey-gravy-and-horseradish-cream-350767"
}
