{
    "directions": [
        "Place beef, fat side up, in large shallow roasting pan or on rimmed baking sheet. Sprinkle beef all over with salt and pepper. Spread mustard all over beef. Mix rosemary and thyme in small bowl; sprinkle over beef and press lightly to adhere. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Position rack just below center of oven and preheat to 450°F. Roast beef uncovered 15 minutes. Reduce oven temperature to 325°F. Roast beef 1 hour 30 minutes. Remove from oven. Spoon off all but 2 tablespoons drippings. Add carrots and shallots to pan. Turn vegetables to coat with drippings; sprinkle with salt and pepper. Roast beef and vegetables until thermometer inserted into center of beef registers 125°F for medium-rare, stirring vegetables occasionally, about 55 minutes longer. Transfer beef and vegetables to platter; tent loosely with foil to keep warm.",
        "Discard drippings from roasting pan. Place pan over 2 burners on stove top over medium heat. Add butter to pan and melt. Add flour; whisk until smooth and just beginning to color, about 5 minutes. Whisk in stock. Boil until sauce thickens slightly, whisking often, about 10 minutes. Season sauce to taste with salt and pepper. Serve beef with vegetables and sauce."
    ],
    "ingredients": [
        "1 9- to 9 1/2-pound standing beef rib roast (about 4 ribs), all but thin layer of fat trimmed",
        "1/4 cup Dijon mustard",
        "2 tablespoons chopped fresh rosemary",
        "2 tablespoons chopped fresh thyme",
        "32 fresh baby carrots, green tops trimmed to 1 inch, peeled",
        "16 large shallots, peeled",
        "3 tablespoons butter",
        "3 tablespoons all purpose flour",
        "3 1/2 cups Zinfandel Beef Stock"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Roast",
        "Christmas",
        "Rosemary",
        "Fall",
        "Winter",
        "Thyme"
    ],
    "title": "Standing Rib Roast with Rosemary-Thyme Crust",
    "url": "http://www.epicurious.com/recipes/food/views/standing-rib-roast-with-rosemary-thyme-crust-108954"
}
