{
    "directions": [
        "Combine the eggs, sugar, and honey in the bowl of an electric mixer. Beat with the whisk attachment on high speed until the mixture reaches a thick ribbon stage.",
        "Melt the chocolate and butter together in a heatproof bowl over simmering water. Cool slightly.",
        "Toss the almond flour, salt, and cocoa in a bowl until well combined. Add to the melted chocolate and mix until fully incorporated.",
        "Add a quarter of the whipped egg mixture to the chocolate to lighten. Stir until no egg is visible. Gently fold the rest of the egg mixture into the chocolate until well combined, being careful to maintain the aerated quality of the eggs.",
        "Chill until firm.",
        "Place a few tablespoons of sugar in a small bowl. Using the smallest cookie scooper available (I use one the size of a melon baller), scoop individual cookies, dip them in the sugar, and place on a parchment-lined sheet pan 1/2 inch apart. Freeze uncovered until very hard, about an hour.",
        "Preheat the oven to 350°F. Just before baking, dip each cookie in sugar again. Bake 10 minutes, turning after 5 minutes to ensure even baking. Cookies should be slightly cracked but the sugar should not be browned."
    ],
    "ingredients": [
        "2 large eggs",
        "2.4 ounces ( 1/4 cup plus one tablespoon) sugar, plus additional for dipping",
        "1 tablespoon honey",
        "8.2 ounces bittersweet chocolate (I use 2 whole bars plus 2 strips of bittersweet Lindt chocolate which comes in a 3.5 ounce bar and is available at most grocery stores)",
        "3 tablespoons butter",
        "2.6 ounces slivered almonds (about 5/8 cup sliver almonds measured before grinding) ground to a fine powder",
        "1/2 teaspoon salt",
        "2 teaspoons non-dutch processed cocoa powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Almond",
        "Chill",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Starry Starry Nights",
    "url": "http://www.epicurious.com/recipes/food/views/starry-starry-nights-358302"
}
