{
    "directions": [
        "1. Bring all fish broth ingredients except cod to a boil in a large skillet; reduce to a simmer. Add cod; simmer 7-8 minutes or until fish is cooked through. Gently remove cod to a plate with a slotted spoon; reserve.",
        "2. Prepare serving broth: Place olive oil in a heavy saucepan over low heat. Add ginger and garlic; cook over medium-low heat for 3 minutes. Add broth and cook, partially covered, for 10 minutes. Season with salt and pepper. Let steep, covered, 15 minutes longer. Strain the broth into another saucepan; set aside. Heat before serving.",
        "3. Arrange cod, pasta, tomatoes, and broccoli in a pinwheel fashion in each of 4 large bowls. Top each with 1 1/4 cups hot serving broth. Sprinkle with scallions. Place a lime slice in the center of each and garnish with parsley or basil. Serve immediately."
    ],
    "ingredients": [
        "1 1/4 cups defatted chicken broth",
        "1 1/2 cups water",
        "6 sprigs fresh cilantro",
        "1 teaspoon minced ginger",
        "2 cloves garlic, peeled and crushed",
        "3 black peppercorns and 1/2 teaspoon salt",
        "1 slice of lime",
        "1 pound cod, cut into 2-inch pieces",
        "1 tablespoon each olive oil, minced ginger and minced garlic",
        "5 cups defatted chicken broth",
        "Salt and pepper, to taste",
        "8 ounces angel-hair pasta, cooked",
        "2 ripe medium-sized tomatoes, seeded and cut into 8 pieces each",
        "1 head of broccoli (about 1 1/2 pounds), cut into florets and blanched",
        "4 scallions (3 inches of green left on), sliced on the diagonal, for garnish",
        "4 thin lime slices",
        "2 tablespoons chopped flat-leaf parsley or slivered basil, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Vegetable",
        "Poach",
        "Winter",
        "Parade"
    ],
    "title": "Star Fish",
    "url": "http://www.epicurious.com/recipes/food/views/star-fish-106697"
}
