{
    "directions": [
        "Mix half of the strawberries, 1/2 cup of sugar, and 1 envelope of gelatin in a bowl. Set aside at room temperature  to allow the juices to develop and the sugar and gelatin to dissolve, about 15 minutes. Heat in the microwave for 2 minutes on full power, or until gelatin has dissolved. Stir to blend in the gelatin and then mix in the remaining strawberries.",
        "In a separate bowl, mash 1 cup of the blue berries with the back of a fork. Stir in 1/2 cup of sugar, and 1 envelope of gelatin. Set aside at room temperature to allow the juices to develop and the sugar and gelatin to dissolve. Heat in the microwave for about 2 minutes to melt the gelatin, then stir to blend. Mix in the remaining blueberries.",
        "Cover the bottom and sides of a springform or a tall, removable bottom tube pan tightly with aluminum foil to keep the juices from seeping out.",
        "Pour all of the strawberry mixture into the bottom of the cake pan, cover completely with slices of angel food cake, tearing or cutting pieces to fit in a tight layer. Spread 1 container of whipped topping over the first cake layer. Make a second layer of angel food cake, like the first, and pour the blueberry mixture evenly over the top. Arrange the angel food cake in a third layer on top of the blueberries, spread the remaining container of whipped topping on top. Finish the dessert with a final layer of angel food cake.",
        "The layered cake will be higher than the edges of your pan. Carefully lay a large piece of aluminum foil over the cake and place a baking sheet on top. Invert the cake, press the cake firmly onto the baking sheet. Weigh down the mold, using pie weights or bags of dry beans or rice; refrigerate 8 hours, or overnight.",
        "Soak a kitchen towel in very hot water, wring out excess water, and wrap the towel around the cake pan; let stand for 1 minute. Remove the towel. Holding the pan and plate together, shake the cake back and forth to release it from the sides of the pan. Open the springform ring carefully, or pull back the sides of the tube pan. Do not force the cake to release. If it continues to stick, repeat the procedure with the hot towel."
    ],
    "ingredients": [
        "2 pints fresh strawberries, hulled and sliced",
        "1/2 cup white sugar",
        "1 (.25 ounce) envelope plain unflavored gelatin",
        "2 pints fresh blueberries",
        "1/2 cup white sugar",
        "1 (.25 ounce) envelope plain unflavored gelatin",
        "2 (10.75 ounce) loaves angel food cake, sliced 1 inch thick",
        "2 (8 ounce) tubs frozen whipped topping, thawed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stars and Stripes Grand Finale Cake",
    "url": "http://allrecipes.com/recipe/143162/stars-and-stripes-grand-finale-cake/"
}
