{
    "directions": [
        "Combine vinegar, water, 2 tablespoons sugar, fish sauce, and red pepper flakes in a glass, ceramic, or stainless steel bowl; stir until sugar is dissolved. Add carrots and daikon radish. Put a plate on top to weigh down vegetables and refrigerate for 4 hours or overnight.",
        "Combine soy sauce, 1 tablespoon sugar, and garlic in a shallow baking dish; stir until sugar is dissolved. Add steak, pressing down until steak is covered in marinade, and refrigerate for 4 hours or overnight.",
        "Heat a ridged grill pan over high heat; add oil. Remove steak from marinade and discard marinade. Grill steak until desired doneness is reached, 6 to 10 minutes per side. Transfer steak to a cutting board and cool. Slice across grain into 24 thin slices.",
        "Drain carrot and daikon radishes, reserving 1/2 cup pickling liquid.",
        "Fill a shallow bowl with warm water. Dip 1 rice paper sheet into water to soften, about 5 seconds. Transfer sheet to a work surface. Arrange 2 pieces of lettuce over the half of wrapper closest to you. Top each lettuce leaf half with 2 slices of steak. Add about 1/4 cup carrot and daikon pickles and a few cilantro sprigs. Starting with bottom edge, begin to roll up rice paper sheet tightly around filling. After 1 roll, fold in ends of rice paper like a burrito, then finish rolling. Repeat with remaining wrappers and filling. Diagonally cut rolls in half crosswise and arrange on a serving platter.",
        "Whisk peanut butter, reserved pickling liquid, and sriracha hot sauce together in a bowl; serve on the side with rolls."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=5775&h=3024&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2434078.jpg",
    "ingredients": [
        "1 ¼ cups seasoned rice vinegar",
        "½ cup water",
        "2 tablespoons white sugar",
        "1 tablespoon fish sauce",
        "¼ teaspoon red pepper flakes",
        "2 large carrots, peeled and cut into 3x1/8-inch matchstick strips",
        "½  daikon radish, peeled and cut into 3x1/8-inch matchstick strips",
        "3 tablespoons low-sodium soy sauce",
        "1 tablespoon white sugar",
        "2 teaspoons minced garlic",
        "1 pound flat iron steaks",
        "2 tablespoons vegetable oil, or as needed",
        "6  (8 1/2-inch) rice paper wrappers",
        "6  large soft-leaf lettuce leaves (such as Bibb or Boston)",
        "3 cups loosely packed fresh cilantro sprigs",
        "¼ cup peanut butter",
        "1 teaspoon Sriracha hot sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Steak Summer Rolls",
    "url": "http://allrecipes.com/recipe/241431/steak-summer-rolls/"
}