{
    "directions": [
        "1. Finely chop the green onion diagonally, reserving the green part for use during cooking the chicken. Soak in cold water for a few minutes to remove the bitterness of the onion, then drain and put aside to use later.",
        "2. On a chopping board, sprinkle the cucumbers with a few pinches of salt, rubbing it into the flesh, then rinse. This lessens the aroma of the cucumber and gives it a good green color. Hit the cucumbers with a pestle (if you don't have a pestle, use a bottle) and break it apart with your hands, to make uneven pieces.",
        "3. Pierce the chicken pieces with a skewer and place in a microwave-safe bowl. Add the salt, pepper, and oil and then place the green part of the green onion and the crushed ginger on top. Cover and microwave on medium for 4 minutes, or until cooked. Leave to cool. Keep the juice from the chicken to use in the sesame sauce.",
        "4. Shred the chicken with your hands and place in a serving dish. Mix in the cucumber and put the chopped green onion on top.",
        "5. Mix all the ingredients for the sesame sauce in a small bowl and pour over the chicken and cucumber."
    ],
    "ingredients": [
        "3-4 green onions",
        "salt and pepper",
        "2 small cucumbers",
        "10 oz. boneless chicken thighs with skin",
        "1 tablespoon sake",
        "1 teaspoon sesame oil",
        "small piece crushed ginger",
        "1/4 cup liquid made up from the juices of the cooked chicken (and water if necessary)",
        "4 tablespoons sesame paste",
        "2 tablespoons soy sauce",
        "2 tablespoons superfine sugar",
        "1/2 tablespoon rice vinegar",
        "2 teaspoons chili paste or to-ban-jan",
        "2 tablespoons roughly ground sesame seeds",
        "2 tablespoons finely shredded green onions",
        "2 teaspoons finely chopped ginger",
        "2 teaspoons finely chopped garlic"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Microwave",
        "Chicken",
        "Onion",
        "Appetizer",
        "Steam",
        "Cucumber",
        "Soy Sauce",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Steamed Chicken Salad with Sesame Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-chicken-salad-with-sesame-sauce-234541"
}
