{
    "directions": [
        "1. Pick through, clean, and wash the split peas. Put in a large saucepan. Add the turmeric and water and bring to a boil. Lower the heat and cook, partially covered, for 40 minutes at a low boil. Stir occasionally to make sure the peas don't burn; when the peas are very soft, turn off the heat. Beat with a whisk for a minute to puree the peas. In a separate bowl, measure the puree and add enough water to make 6 cups of brothy puree. Return the puree to the pan.",
        "2. Measure out the spices and place them right next to the stove in separate piles. Turn on the burner and bring the puree to a boil. Add the sambaar powder, the coriander, and the garlic and continue to boil the puree, partially covered, over medium heat for 8 to 10 minutes. Add the onions, radishes, tomatoes, fenugreek leaves (if you are using ground fenugreek seeds, do not add them now), and salt, and continue cooking at a low boil for an additional 10 minutes. Turn off the heat.",
        "3. Heat the oil in a small frying pan over medium heat. When it is hot, add the chili pods and fry until they turn dark (about 15-20 seconds). Lift the pan off the heat, add the mustard powder and fenugreek powder if you are using it, and immediately pour the contents of the pan over the sambaar (the split pea mixture). Stir to mix. Cover and let the dish rest a few minutes so all the flavors will have time to blend.",
        "To serve, bring the sambaar to a vigorous boil, stir in the lemon juice, and pour it into a soup tureen or serve individually in katoori (small bowls). Serve the dumplings, idlee, 2 per person, in soup plates. Spoon sambaar over the dumplings as desired."
    ],
    "ingredients": [
        "1 recipe Foamy White Steamed Rice and Bean Dumplings",
        "1 recipe Spicy Lentil and Radish Sauce (follows)",
        "1 1/2 cups yellow split peas (supermarket variety)",
        "1/4 teaspoon turmeric",
        "4 1/2 cups water",
        "1 tablespoon sambaar powder (see tips, below)",
        "1 tablespoon ground coriander",
        "1/2 teaspoon minced garlic",
        "2 medium-size onions, cut into 1/8-inch-thick slices",
        "2 cups thinly sliced icicle or daikon radish",
        "2 medium-size tomatoes (fresh or canned), pureed with skin or finely chopped",
        "1 tablespoon dry fenugreek leaves, powdered, or 1/3 teaspoon ground fenugreek seeds",
        "1 1/2 teaspoons coarse salt, or to taste",
        "2 tablespoons light sesame oil or light vegetable oil",
        "4 dry red chili pods",
        "1 teaspoon mustard powder",
        "1 tablespoon lemon juice or more, to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Vegetarian",
        "Diwali",
        "Lunch",
        "Spice",
        "Pea",
        "Radish",
        "Simmer",
        "Sugar Conscious",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Steamed Rice and Bean Dumplings in Spicy Lentil and Radish Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-rice-and-bean-dumplings-in-spicy-lentil-and-radish-sauce-230901"
}
