{
    "directions": [
        "Trim the steak of any surface fat. Cut the steak across the grain into slices 1/4 inch thick, then cut the slices into 2-inch lengths. Season with salt and pepper.",
        "Bring a large pot of salted water to a boil over high heat. Add the egg noodles and stir occasionally until the water returns to a boil. Cook according to the package directions until al dente.",
        "While the noodles are cooking, brown the steak. In a large frying pan, heat the oil over medium-high heat until it shimmers. Add the steak in batches and cook, stirring frequently, until lightly browned and still quite rare, about 1 1/2 minutes per batch, adding more oil to the pan as needed. Transfer the beef to a plate.",
        "When all the steak is cooked, add the mushrooms and 2 Tbs. of the butter to the frying pan and cook over medium-high heat, stirring frequently, until the mushrooms are lightly browned, about 6 minutes. Add the shallots and cook, stirring occasionally, until they soften, about 2 minutes. Remove from the heat and stir in the steak, sour cream, and the 1 Tbs. dill. Return to medium heat and simmer, stirring constantly, until the sour cream is heated through, about 1 minute. Do not allow to boil. Season with salt and pepper.",
        "When the noodles are ready, drain them and return to the cooking pot. Add the remaining 1 Tbs. butter and toss to coat. Divide the noodles among dinner plates and top each serving with the steak and sauce. Sprinkle with dill and serve. Serves 4.",
        "Variation: You can also make this dish with 1 1/2 lbs. thin veal cutlets, cut into strips 1/2 inch wide. Or try leftover steak. You’ll need about 2 cups of steak, cut into bite-sized cubes. Simply add it to the mushroom mixture along with the sour cream and heat through.",
        "Adapted from Williams-Sonoma",
        "Comfort Food,",
        "by Rick Rodgers (Oxmoor House, 2009)."
    ],
    "ingredients": [
        "1 1/2 lbs. beef sirloin steak",
        "Kosher salt and freshly ground pepper",
        "3/4 lb. wide egg noodles",
        "2 Tbs. canola oil, plus more as needed",
        "1 lb. button or cremini mushrooms, sliced",
        "3 Tbs. unsalted butter",
        "1/3 cup minced shallots",
        "1 1/2 cups sour cream, at room temperature",
        "1 Tbs. minced fresh dill, plus more for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Steak and Mushroom Stroganoff",
    "url": "http://www.williams-sonoma.com/recipe/steak-and-mushroom-stroganoff.html"
}
