{
    "directions": [
        "In a bowl whisk together the scallion, the soy sauce, the vinegar, the gingerroot, the vegetable oil, 1 tablespoon of the sesame oil, the sugar, the garlic paste, the red pepper flakes, and salt and pepper to taste. In a shallow dish arrange the scrod fillets in one layer, pour the soy sauce mixture over them, and let the fish marinate, covered and chilled, for 30 minutes.",
        "Put a bamboo steamer in a wok and add enough water to the wok to allow the bottom rim of the steamer to sit in the water but the tray to remain above it. (Alternatively, arrange a steamer rack in a wide deep kettle and add water to the kettle to reach just below the steamer rack.) Bring the water to a boil. Line the steamer with the cabbage or with a plate, such as a glass pie plate, at least 1 inch smaller in diameter than the steamer, arrange the fillets, folded into thirds, skinned sides up and seam sides down, on the cabbage, and pour the marinade evenly over them. Steam the fish, covered, over the boiling water for 8 to 12 minutes, or until it just flakes, and with oven mitts remove the steamer from the wok. Transfer the fillets carefully to a heated platter and drizzle them with the remaining 1 teaspoon sesame oil."
    ],
    "ingredients": [
        "1/2 cup thinly sliced scallion",
        "1/4 cup soy sauce",
        "2 tablespoons rice-wine vinegar (available at Oriental markets) or white-wine vinegar",
        "a 1 1/2-inch piece of peeled fresh gingerroot, cut into very fine julienne strips",
        "2 tablespoons vegetable oil",
        "1 tablespoon Oriental sesame oil plus 1 teaspoon for drizzling the fish",
        "2 teaspoons sugar",
        "2 garlic cloves, minced and mashed to a paste with a pinch of salt",
        "1/4 to 1/2 teaspoon dried hot red pepper flakes, or to taste",
        "six 6-ounce scrod fillets",
        "cabbage or romaine leaves for lining the steamer if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Fish",
        "Ginger",
        "Marinate",
        "Steam",
        "Chill",
        "Gourmet"
    ],
    "title": "Steamed Scrod Fillets Chinese Style",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-scrod-fillets-chinese-style-11939"
}
