{
    "directions": [
        "Rub steaks all over with 1 Tbsp. oil and season generously with salt. Heat 2 Tbsp. oil and 1 Tbsp. butter in a medium saucepan over medium-low. Cook shallot, stirring often, until golden brown, 10–15 minutes. Remove from heat and carefully add 1/4 cup cognac. Bring mixture to a simmer over medium-low heat and cook, stirring occasionally, until cognac is reduced by half, about 5 minutes. Stir in cream and black pepper and bring to a simmer. Cook, swirling occasionally, until cream is slightly thickened, about 5 minutes; let cool slightly.",
        "Transfer mixture to a blender and blend until smooth (or use an immersion blender directly in the pot). Add green peppercorns and pulse just to break up (do not blend completely). Return pepper sauce to saucepan; season with salt. Cover and set aside.",
        "Heat remaining 2 Tbsp. oil in a large cast-iron skillet over high. Add steaks and cook, occasionally lifting steaks to allow hot oil to flow underneath, until a brown crust forms underneath, about 4 minutes. Turn steaks and cook until crust forms on the other side and an instant-read thermometer inserted into the thickest part registers 125°F for medium-rare, about 4 minutes. Transfer steaks to a cutting board and let rest 10 minutes. Reserve skillet.",
        "Pour off all but 2 Tbsp. fat from skillet and return to medium-high heat. Place steaks, garlic, rosemary, and remaining 2 Tbsp. butter in skillet and cook, basting steaks with butter and turning halfway through, until butter is very fragrant and golden brown, about 1 minute. Increase heat to high. Lean safely away from pan, add remaining 2 Tbsp. cognac, and immediately tilt skillet toward flame to ignite cognac (if you have an electric stove or cognac doesn’t ignite, it’s okay). Cook, carefully shaking skillet, until flames die out, about 30 seconds. Transfer steaks back to cutting board and let rest 10 minutes.",
        "While the steaks are resting, reheat pepper sauce over medium-low heat, stirring constantly, until warmed through.",
        "Slice steak and spoon pepper sauce over top. Garnish with more rosemary sprigs if desired."
    ],
    "ingredients": [
        "2 (1 1/2-inch–thick) boneless rib eyes (about 14 ounces each)",
        "5 tablespoons grapeseed or vegetable oil, divided",
        "Kosher salt",
        "3 tablespoons unsalted butter, divided",
        "1 large shallot, finely chopped",
        "1/4 cup plus 2 tablespoons cognac",
        "1 cup heavy cream",
        "2 teaspoons coarsely ground black pepper",
        "1 tablespoon green peppercorns in brine",
        "4 garlic cloves, crushed",
        "4 small sprigs rosemary; plus more for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Steak",
        "Pepper",
        "Cognac/Armagnac",
        "Shallot",
        "Milk/Cream",
        "Garlic",
        "Rosemary",
        "New Year's Eve",
        "Dinner",
        "Wheat/Gluten-Free",
        "Valentine's Day"
    ],
    "title": "Steak au Poivre",
    "url": "http://www.epicurious.com/recipes/food/views/steak-au-poivre"
}
