{
    "directions": [
        "Soak shiitakes in boiling-hot water in a bowl until softened, about 30 minutes. Cut out and discard stems, then squeeze excess liquid from caps and discard soaking liquid.",
        "Hack each chicken thigh crosswise through bone into thirds with cleaver.",
        "Stir together soy sauce, rice wine, cornstarch, sesame oil, and salt in a large bowl until smooth, then add chicken, mushroom caps, scallions, and ginger and toss well to coat. Marinate at room temperature, stirring occasionally, 30 minutes.",
        "Put rack into wok and add enough water to reach just below it. (If using a steamer insert, use approximately 4 inches of water.) Cover wok (or skillet) and bring water to a boil. Transfer chicken mixture to pie plate and put in wok (or skillet), then steam, covered, stirring once, until chicken is just cooked through, about 25 minutes.",
        "While chicken is steaming, cook bok choy, uncovered, in a 4- to 6-quart pot of (unsalted) boiling water until just tender, 7 to 9 minutes, then drain in a colander.",
        "Carefully remove pie plate from wok. Arrange bok choy around edge of a large deep platter and spoon chicken and sauce in center.",
        "*Available at Asian markets, many supermarkets, and Uwajimaya (800-889-1928)."
    ],
    "ingredients": [
        "12 dried shiitake mushrooms* (1 to 1 1/4 oz)",
        "2 cups boiling-hot water",
        "2 1/2 lb skinless chicken thighs (bone-in)",
        "1/4 cup soy sauce",
        "2 tablespoons Chinese rice wine or medium-dry Sherry",
        "2 tablespoons cornstarch",
        "1 teaspoon Asian sesame oil",
        "1/2 teaspoon salt",
        "3 scallions, cut into 1-inch pieces",
        "1 tablespoon minced peeled fresh ginger",
        "1 1/2 lb baby bok choy (6 to 8), trimmed, halved lengthwise, and washed well",
        "Special equipment: a heavy cleaver; a 13- to 14-inch wok with a lid and a 9-inch round metal cooling rack or a deep 12-inch skillet fitted with a 12-inch steamer insert; a 9- to 9 1/2-inch (6-cup) deep-dish pie plate",
        "Accompaniment: steamed rice",
        "Garnish: thinly sliced scallion"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Steam",
        "Bok Choy",
        "Gourmet"
    ],
    "title": "Steamed Chicken with Black Mushrooms and Bok Choy",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-chicken-with-black-mushrooms-and-bok-choy-230450"
}
