{
    "directions": [
        "1. Remove the steaks from the refrigerator 20 minutes in advance. Prepare a cooling rack (or small overturned plate - over a large plate).",
        "2. Cover the steaks on both sides with crushed pepper. Pat it on firmly so that it sticks into the flesh. Salt the steaks on both sides. (Be sure to pepper and then salt, or the pepper will not stick to the steaks.)",
        "3. Heat the oil in a sauté pan over high heat. Add 1 teaspoon butter. Rotate the pan as the butter melts, and when it begins to foam, lower the heat to medium. Lay the steaks in the pan and cook for 4 minutes, rotating them in the pan and spooning the cooking juices over them. Flip them with tongs or a spatula and cook 4 minutes on the other side, rotating and basting as before. Stand the steaks on their sides, using tongs to help, and cook them 2 minutes on their edges. Remove the steaks to the cooling rack and tent them loosely with aluminum foil.",
        "4. Put a serving dish and a sauceboat to warm in the oven, turned to 150°F/80°C.",
        "5. Pour the wine into the sauté pan and bring to a boil, stirring and scraping the bottom of the pan with a wooden spatula until the wine is syrupy.",
        "6. Dice the rest of the butter, which should be well chilled. Add the veal stock to the pan and boil for 2 minutes. If you are using the crème fraîche, stir it in. Then stir in the diced butter bit by bit. Put this sauce through a fine strainer into the warmed sauceboat. If you are using the mustard, stir it in now. Taste for salt and pepper.",
        "7. Put the steaks on the warmed serving platter, coat them with sauce, and serve the rest of the sauce on the side."
    ],
    "ingredients": [
        "4 steaks, 1/2 pound (220 g.) each, from the fillet, rump,or sirloin, and without any kind of fatty wrapping",
        "Crushed pepper—black, gray, or green",
        "Salt",
        "2 tablespoons neutral oil",
        "4 tablespoons (60 g.) cold butter",
        "1/2 cup (10 cl.) dry white wine",
        "1/2 cup (10 cl.) brown veal stock (or from a bouillon cube)",
        "1 tablespoon crème fraîche (optional)",
        "1 tablespoon mustard (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Dinner",
        "Meat",
        "Steak",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Steak Au Poivre",
    "url": "http://www.epicurious.com/recipes/food/views/steak-au-poivre-355922"
}
