{
    "directions": [
        "Place turkey bacon in a skillet over medium to medium-high heat. Cook to desired crispness, turning occasionally, about 6 minutes. Remove from heat; let cool slightly. Chop bacon into small pieces.",
        "Mix Swanson(R) Chicken Stock, cream, lemon juice, minced garlic, and dill in a microwaveable bowl. Microwave on HIGH for 1 minute, 30 seconds.",
        "Place water in the bottom of a double boiler; water should not touch the bottom of the top pan. Bring water to a boil. Lightly beat egg yolks in the top of the double boiler. Cook, stirring until thickened and egg yolks are about double in volume, 3 to 5 minutes. Reduce heat to low.",
        "Gradually whisk in stock/cream mixture, whisking until completely combined. Mix thoroughly for another minute. Season with 1/4 teaspoon black pepper. Remove from heat and cover to keep sauce warm.",
        "Set a steamer basket insert into a large saucepan. Pour in Swanson(R) Chicken Broth to just below the bottom of the steamer; bring to a boil. Add green beans, season with 1/2 teaspoon black pepper and steam until crisp-tender, about 5 minutes. Discard leftover chicken broth or reserve for another use.",
        "Transfer beans to a serving dish; sprinkle with bacon crumbles. Top with hollandaise sauce and serve."
    ],
    "ingredients": [
        "5 slices turkey bacon",
        "1/4 cup Swanson® Unsalted Chicken Stock",
        "1/4 cup heavy whipping cream",
        "1 1/2 teaspoons fresh lemon juice",
        "3 cloves garlic, minced",
        "1 teaspoon dried dill weed",
        "6 egg yolks",
        "1/4 teaspoon fresh ground black pepper",
        "2 cups Swanson® Chicken Broth",
        "2 pounds fresh whole green beans, trimmed",
        "1/2 teaspoon fresh ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Steamed Fresh Green Beans with Garlic Dill Hollandaise Sauce",
    "url": "http://allrecipes.com/recipe/244815/steamed-fresh-green-beans-with-garlic/"
}
