{
    "directions": [
        "Sprinkle inside of each fish with salt. Using sharp cleaver or knife, make 4 diagonal slits on 1 side of each fish, spacing equally and cutting to the bone. Insert 1 slice of ginger, 1 slice of garlic and 1 cilantro leaf into each slit. Turn fish over. Make 4 diagonal slits on second side of each fish and insert remaining sliced ginger, sliced garlic and cilantro leaves. Arrange fish in 9-inch-diameter glass pie dish. (Can be made 6 hours ahead. Cover; refrigerate).",
        "Place a slice of ginger and garlic, then a whole cilantro leaf in each slit; they will add flavor to the fish during the steaming process. Hold back the flaps to insert the seasonings more easily.",
        "Pour enough water into wok or large pot to reach depth of 1 1/2 inches. Place bottom of 11- to 12-inch-diameter bamboo steamer over water in wok or open a steamer rack and place in pot. Place dish with fish in bamboo steamer (or on steamer rack). Curl tails if necessary to fit.",
        "The classic Chinese way to cook the fish is in a tiered bamboo steamer set over boiling water in a wok. Pour water to a depth of 1 1/2 inches into the wok.",
        "If you don't have a bamboo steamer or a wok, you can use a vegetable steamer rack set in a large pot. The pot should be large enough to allow steam to circulate around the glass pie dish that holds the fish.",
        "Sprinkle 1 tablespoon each of chopped cilantro, shallots, lemongrass and green onions into dish around fish. Combine broth and 1 tablespoon soy sauce in cup and pour into dish. Bring water to boil. Cover bamboo steamer (or pot). Steam fish until just opaque in center at bone, about 18 minutes.",
        "Before steaming, surround the fish with chopped shallots, lemongrass, green onions, and cilantro. Then pour a broth and soy sauce mixture into the dish to flavor the fish as it cooks.",
        "Meanwhile, combine sesame oil and vegetable oil in heavy medium skillet. Add chopped ginger and chopped garlic, then 2 tablespoons each of chopped cilantro, shallots, lemongrass and green onions. Stir over medium heat until oil is hot and seasonings are fragrant, about 3 minutes. Pour seasoned oil into small bowl; add remaining 2 tablespoons soy sauce.",
        "Using oven mitts as aid, transfer dish with fish to work surface. Using large spatula, transfer fish to platter. Spoon juices from dish over fish. Spoon some of seasoned oil over fish. Serve fish with rice; pass remaining seasoned oil.",
        "You may have to special-order whole fish from the supermarket or fish market.",
        "** Available at Southeast Asian markets and in the produce section of some supermarkets."
    ],
    "ingredients": [
        "2 16- to 18-ounce whole red snappers, cleaned, scaled",
        "16 very thin slices peeled fresh ginger plus 2 tablespoons, chopped",
        "16 very thin slices peeled garlic plus 2 tablespoons, chopped",
        "16 large fresh cilantro leaves plus 3 tablespoons, chopped",
        "3 tablespoons chopped shallots",
        "3 tablespoons chopped lemongrass**",
        "3 tablespoons chopped green onions",
        "1/2 cup canned low-salt chicken broth",
        "3 tablespoons soy sauce",
        "2 tablespoons oriental sesame oil",
        "2 tablespoons vegetable oil",
        "Cooked long-grain white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Steam",
        "Snapper",
        "Spring",
        "Lemongrass",
        "Sesame",
        "Soy Sauce"
    ],
    "title": "Steamed Whole Red Snapper with Asian Flavors",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-whole-red-snapper-with-asian-flavors-105459"
}
