{
    "directions": [
        "Rub the garlic cloves over the meat and the bone of the steaks. Sprinkle the steaks with salt and pepper. Place in the refrigerator and allow seasoning to permeate the meat, for about 1 hour. Remove from the refrigerator at least 20 minutes before grilling, allowing the meat to come to room temperature.",
        "Place a grill pan over high heat or prepare the barbecue (medium-high heat). Grill the steaks until cooked to desired doneness, turning once, about 5 minutes per side for rare, 7 minutes per side for medium-rare. The key to getting those great grill marks is to place the steak down and not move them. After you flip them, do not shift the steaks.",
        "Allow the steaks to rest for at least 10 minutes before slicing, otherwise all the juices will be run all over your cutting board. Run your knife along the bone and carve the meat off the bone. Slice the meat into 1-inch slices. Transfer the slices to a platter. Squeeze the lemon over the steaks. Drizzle with the oil and serve immediately with Grilled Vegetables.",
        "Place a grill pan over medium-high heat or prepare the barbecue (medium-high heat). Brush the vegetables with 1/4 cup of the oil to coat lightly. Sprinkle the vegetables with salt and pepper. Working in batches, grill the vegetables until tender and lightly charred all over, about 8 to 10 minutes for the bell peppers; 7 minutes for the yellow squash, zucchini, eggplant, and mushrooms; 4 minutes for the asparagus and green onions. Arrange the vegetables on a platter. The key to getting those great grill marks is to not shift the vegetables too frequently once they've been placed on the hot grill.",
        "Meanwhile, whisk the remaining 2 tablespoons of oil, balsamic vinegar, garlic, parsley, basil, and rosemary in a small bowl to blend. Add salt and pepper to taste. Drizzle the herb mixture over the vegetables. Serve the vegetables, warm or at room temperature."
    ],
    "ingredients": [
        "2 large garlic cloves, halved",
        "3 T-bone steaks (each about 1 1/2 pounds, and 1 1/2- to 1 3/4-inches thick)",
        "Kosher salt and freshly ground black pepper",
        "1 lemon, halved",
        "2 teaspoons olive oil",
        "Grilled Vegetables, recipe follows",
        "3 red bell peppers, seeded and halved",
        "3 yellow squash (about 1 pound total), sliced lengthwise into 1/2-inch-thick rectangles",
        "3 zucchini (about 12 ounces total), sliced lengthwise into 1/2-inch-thick rectangles",
        "3 Japanese eggplant (12 ounces total), sliced lengthwise into 1/2-inch-thick rectangles",
        "12 cremini mushrooms",
        "1 bunch (1 pound) asparagus, trimmed",
        "12 green onions, roots cut off",
        "1/4 cup plus 2 tablespoons olive oil",
        "Salt and freshly ground black pepper",
        "3 tablespoons balsamic vinegar",
        "2 garlic cloves, minced",
        "1 teaspoon chopped fresh Italian parsley leaves",
        "1 teaspoon chopped fresh basil leaves",
        "1/2 teaspoon finely chopped fresh rosemary leaves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Italian",
        "Steak",
        "Beef",
        "Meat",
        "Vegetable"
    ],
    "title": "Steak Florentine",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/steak-florentine-recipe"
}
