{
    "directions": [
        "Heat a dry large skillet, preferably cast iron, over medium-high. Using a sharp knife, lightly score steak on both sides in a crosshatch pattern. Season generously with salt and pepper, then rub all over with vegetable oil. Cook steak, turning once or twice to brown evenly, until medium-rare and lightly charred, 8−10 minutes. Transfer steak to a cutting board and let rest at least 15 minutes; reserve skillet.",
        "Meanwhile, place onion in a small bowl; cover with cold water. Set aside.",
        "Blend mustard and lemon juice in a blender to combine. With motor running, stream in 1/2 cup olive oil, then gradually add Parmesan. Stream in 1 Tbsp. cold water and blend until dressing is smooth and thick. Season with salt and pepper.",
        "Heat reserved skillet over medium. Drizzle cut sides of ciabatta with olive oil. Working with 1 half at a time, cook, cut side down, until golden brown and crisp, about 5 minutes each.",
        "Place bread, cut side up, on a platter and drizzle with one-third of dressing. Top with arugula; drain reserved onion and scatter over arugula. Season with salt and pepper and drizzle with half of remaining dressing. Thinly slice steak and arrange over dressed arugula. Drizzle with remaining dressing, season with more salt, then cut sandwiches crosswise into pieces."
    ],
    "ingredients": [
        "1 1/2 pounds flank steak",
        "Kosher salt, freshly ground pepper",
        "1 tablespoon vegetable oil",
        "1/2 small red onion, thinly sliced",
        "1/4 cup whole grain mustard",
        "3 tablespoons fresh lemon juice",
        "1/2 cup olive oil, plus more for bread",
        "1 1/2 ounces Parmesan, finely grated",
        "1 ciabatta loaf, halved lengthwise",
        "6 cups mature arugula leaves with tender stems"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Steak",
        "Arugula",
        "Onion",
        "Quick & Easy",
        "Parmesan",
        "Lunch",
        "Dinner",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Open-Face Steak Sandwich With Parmesan Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/steak-salad-sandwich-with-parmesan-dressing"
}
