{
    "directions": [
        "Measure the cold soy milk in a quart-size pitcher and season it with the mirin and soy sauce. Add the nigari mixture and stir gently to combine. Try not to create any foam as you stir.",
        "Choose between the autumn version and the spring version, then divide the mushrooms or the bamboo shoots and asparagus stalk among 4 to 6 heatproof 1-cup cups. Gently pour all but about 1 tablespoon of the soy-milk mixture into the cups, dividing it evenly. Leave the 1 tablespoon in the pitcher. Do not worry if some of the vegetables float to the surface, but do be careful not to incorporate air as you pour. Air bubbles will mar the final appearance of the dish, so bubbles on the surface of the soy milk should be lanced or dragged to the sides with the tip of a toothpick and removed.",
        "Add the chopped mitsuba or sliced asparagus tip to the soy milk reserved in the measuring pitcher and set aside.",
        "Place the filled cups in a flat-bottomed lidded steamer fitted with a cloth-protected lid. Set the steamer over medium heat. Once you hear the water boiling, turn down the heat to maintain a very fine flow of steam. Steam undisturbed for 8 to 12 minutes (the longer time for diced bamboo shoots or deeper cups). Carefully slide the lid to one side to check on progress. A bit of clear liquid should have formed at the edge of each cup. If there is none, insert a toothpick into the center of a custard. If the toothpick shows signs of loose soy milk residue, recover the steamer and cook for another 2 minutes. If it comes out clean, continue to the next step.",
        "Carefully arrange the soy milk-drenched mitsuba leaves or asparagus tips on the top of each custard. If you are skilled in using long chopsticks, this step will be easy to do and you will limit your exposure to the burning steam. If not, use tongs held with a pot holder to avoid burning your hands. Re-cover the steamer and steam for 2 to 3 minutes longer.",
        "Turn off the heat (if using an electric range, remove the steamer from the stove) and allow the custards to settle undisturbed for 2 to 3 minutes. Use caution when removing the lid of the steamer to avoid burns from trapped steam. Retrieve the custards with pot holders and/or tongs.",
        "If you have lids for the individual cups, cover the custards as you remove them from the steamer. If you do not have lids and need to hold the custards hot for a few minutes, set a piece of parchment paper over each custard, being careful to balance it on the rim of the cup, and then anchor it with a saucer or other small, flat plate. Using foil to keep the cups warm is not recommended, because condensation easily forms on the underside and drips onto the custards, pockmarking them. Serve as quickly as possible, with spoons.",
        "As you remove the cups, set them on a rack to cool, uncovered. When steam is no longer visible, use strips of paper towel or cotton-tipped sticks to blot up any liquid that may have pooled on the surface. Cover the custards snugly with clear plastic wrap, place in the refrigerator, and chill for at least 2 hours or up to 24 hours. When ready to serve, remove the plastic wrap and serve with spoons."
    ],
    "ingredients": [
        "2 cups cold soy milk, freshly extracted or purchased",
        "1 1/2 teaspoons mirin",
        "1 1/2 teaspoons light-colored soy sauce",
        "2 teaspoons nigari diluted with scant 1 tablespoon water",
        "1 cup mixed fresh mushrooms, such as matsutaké, maitaké, shiitaké, shiméji, and/or enoki, in any combination, trimmed and cut",
        "3 or 4 stalks mitsuba, roots trimmed, stalks and leaves cut into 1/2-inch lengths, or 2 teaspoons coarsely chopped flat-leaf parsley leaves",
        "1/2 cup diced or thinly slivered fresh boiled bamboo shoot",
        "1 asparagus spear, tip sliced in half vertically and stalk thinly sliced on the diagonal, and then tip and stalk blanched for 30 or 40 seconds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Steam",
        "Vegetarian",
        "Vegan",
        "Soy Sauce"
    ],
    "title": "Steamed Soy Milk Custard",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-soy-milk-custard-363170"
}
