{
    "directions": [
        "Divide clams between 2 large pots, pushing clams to one side of each pot. Divide sausages and potatoes between pots, placing both ingredients on the other side of pots. Add 1 cup water, 1/2 tablespoon oregano, 1/2 teaspoon crushed red pepper, then 1/4 cup Shallot Butter to each pot. Cover tightly and cook over high heat until clams open, about 8 minutes (discard any clams that do not open). Remove from heat. Using slotted spoon, transfer clams to large bowl, leaving sausages and potatoes in pots. Ladle some of cooking broth into small serving bowl. Serve clams as appetizer, offering broth alongside.",
        "Cook 3 lobsters at a time in large stockpot of boiling water, about 12 minutes for 1-pound lobsters and 20 minutes for 2-pound lobsters. Transfer lobsters to bowl.",
        "Meanwhile, set pots with sausages and potatoes over medium heat. Cover and continue to cook until potatoes begin to soften, about 12 minutes. Add corn to pots; cook until vegetables are tender and sausages are cooked through, about 10 minutes longer.",
        "Using heavy large knife, cut 2-pound lobsters in half lengthwise; keep 1-pound lobsters whole. Place lobsters, sausages, potatoes and corn on large platter. Pour remaining Shallot Butter into small bowl. Pour any broth from pots into another small bowl; serve alongside lobsters."
    ],
    "ingredients": [
        "6 dozen littleneck clams (about 9 pounds), scrubbed",
        "2 pounds sweet Italian turkey sausages",
        "6 medium-size white potatoes (about 2 pounds), unpeeled",
        "2 cups water",
        "1 tablespoon dried oregano",
        "1 teaspoon dried crushed red pepper",
        "Shallot Butter",
        "6 1-pound live lobsters or three 2-pound live lobsters",
        "6 ears corn, husked"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Steam",
        "Sausage",
        "Clam",
        "Lobster",
        "Corn",
        "Summer"
    ],
    "title": "Steamed Clams and Lobster with Shallot Butter, Corn, Sausages and Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-clams-and-lobster-with-shallot-butter-corn-sausages-and-potatoes-101948"
}
