{
    "directions": [
        "In a steamer set over boiling water steam the fiddleheads for 5 minutes, or until they are crisp-tender, transfer them with a slotted spoon to a bowl of ice and cold water to stop the cooking, and transfer them to paper towels to drain. In a small bowl whisk together the yogurt, the mayonnaise, the lemon juice, the mustard, the horseradish, the scallion, and salt and pepper to taste, whisking until the sauce is smooth, and serve the fiddleheads topped with the sauce.",
        "Snap off the crisp, bright green fiddlehead tops from ostrich ferns, leaving about 2 inches of stem attached. Rub off the dry brown casings by hand or put the fiddleheads in a wire salad basket and whirl the basket outdoors to remove the casings. Let the fiddleheads soak in a sink half full of cold water, changing the water several times to remove any grit or casing particles, and drain them. The fiddleheads keep, covered and chilled, for 1 week."
    ],
    "ingredients": [
        "1 pound fiddleheads (available seasonally at specialty produce markets  and some supermarkets), cleaned",
        "1/2 cup plain yogurt",
        "1/2 cup mayonnaise",
        "1 tablespoon fresh lemon juice, or to taste",
        "2 teaspoons Dijon-style mustard",
        "1 tablespoon drained bottled horseradish, or to taste",
        "3 tablespoons finely chopped scallion green"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Mustard",
        "Side",
        "Steam",
        "Vegetarian",
        "Quick & Easy",
        "Yogurt",
        "Horseradish",
        "Mayonnaise",
        "Spring",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Steamed Fiddleheads with Horseradish Scallion Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-fiddleheads-with-horseradish-scallion-sauce-11926"
}
