{
    "directions": [
        "Season the steak liberally with salt and pepper on both sides. Heat 1 tablespoon of olive oil in a medium saute pan over high heat until it's almost smoking, then sear the steak on each side for 1 minute. Reduce the heat to low and cook the steak for about 7 to 10 minutes, turning once, until very rare in the middle. Remove to a plate, cover tightly with aluminum foil, and allow to sit for 10 minutes. Slice the steak into strips.",
        "Using the same saute pan, heat 1 1/2 tablespoons of olive oil over medium heat. Add the onion and thyme and saute for 10 minutes, until the onions are brown and caramelized, stirring occasionally.",
        "To assemble the sandwiches, spread a tablespoon of Mustard Mayo on the bottom half of each bun. Place a layer the steak strips on top of the mayo, sprinkle with salt and pepper, and top with the caramelized onion rings. Place the baby arugula on top of the onion rings, and cover the sandwiches with the top half of the buns.",
        "Mustard Mayo:",
        "Whisk the ingredients together in a small bowl. Serve at room temperature.",
        "Yield: 1 cup"
    ],
    "ingredients": [
        "1 (12-ounce) 1-inch thick New York strip boneless beef top loin steak",
        "Kosher salt",
        "Freshly ground black pepper",
        "Olive oil",
        "2 yellow onions, sliced in rings",
        "1/2 teaspoon fresh thyme leaves",
        "1 recipe Mustard Mayo, recipe follows",
        "2 mini focaccia buns, sliced in 1/2",
        "1/2 cup baby arugula",
        "3/4 cup good mayonnaise",
        "1 tablespoon Dijon mustard",
        "1 tablespoon whole-grain mustard",
        "2 tablespoons sour cream",
        "1/8 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sandwich",
        "Arugula",
        "Vegetable",
        "Beef",
        "Meat",
        "Onion Recipes",
        "Main Dish Recipes",
        "Lunch",
        "Sauteing Recipes"
    ],
    "title": "Steak Sandwich",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/steak-sandwich-recipe"
}
