{
    "directions": [
        "Heat oil in a large skillet over medium-high. Add onions, season with salt and pepper, and cook, stirring occasionally, until onions are softened and starting to brown, about 10 minutes.",
        "Reduce heat to medium. Add tomato paste and cook, stirring, until warmed through, about 30 seconds. Add Worcestershire and vinegar, scraping up brown bits on bottom of pan. Stir in butter and brown sugar and continue to cook, adding water by the tablespoonful if skillet starts to dry out, until onions are completely softened and caramelized, 15–20 minutes more. Add 1 Tbsp. water and cook, scraping up brown bits, until incorporated, about 30 seconds. Let cool.",
        "Cook vinegar and shallot in a small skillet over medium-high heat, stirring occasionally, until vinegar has reduced and skillet is almost dry, about 3 minutes. Transfer to a small bowl and let cool slightly, about 5 minutes.",
        "Place butter and salt in a medium bowl. Using a fork, mash shallot mixture into butter until incorporated. Gently fold in tarragon or parsley. Chill until ready to use.",
        "Divide ground steak into 4 portions. Shape into 4\"-wide, 3/4\"-thick, loosely packed patties. Make a small indentation in the center with your thumb to help keep it flat as it grills. Chill until ready to use.",
        "Prepare a grill or grill pan for medium-high heat; generously oil grates. Generously season patties on both sides with salt and pepper. Grill, indented side down, until lightly charred on the bottom, 2–3 minutes. Flip, top with cheese, and continue to grill to desired doneness, 2–3 minutes more for medium-rare. Transfer burgers to a platter and let rest 5 minutes.",
        "Meanwhile, grill buns until toasted, about 30 seconds. Generously spread cut sides of bun with Herb Butter, if using. Top each bottom bun with lettuce, patty, and 3 Tbsp. caramelized onions, then close burgers.",
        "Onions can be made 5 days ahead; cover and chill. Butter can be made 3 days ahead; cover and chill. Bring both to room temperature before serving."
    ],
    "ingredients": [
        "2 tablespoons neutral vegetable oil, such as grapeseed",
        "2 medium onions, thinly sliced",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "2 tablespoons tomato paste",
        "3 tablespoons Worcestershire sauce",
        "2 tablespoons white wine vinegar",
        "2 tablespoons unsalted butter",
        "1 tablespoon light brown sugar",
        "1/4 cup white wine vinegar",
        "2 tablespoons finely chopped shallot (about 1 small shallot)",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/4 teaspoon kosher salt",
        "1 tablespoon finely chopped tarragon or parsley",
        "1 1/2 pounds dry-aged steak (such as rib-eye or New York strip; 20% fat), coarsely ground",
        "Neutral vegetable oil, such as grapeseed (for grill)",
        "Kosher salt, freshly ground black pepper",
        "4 slices white cheddar cheese",
        "4 brioche or other high-quality hamburger buns",
        "Romaine or green leaf lettuce (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Flaming Hot Summer",
        "Summer",
        "Hamburger",
        "Grill",
        "Backyard BBQ",
        "Dinner",
        "Onion",
        "Steak",
        "Tarragon",
        "Butter",
        "Cheese",
        "Cheddar",
        "Labor Day",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Steakburger With Tangy Caramelized Onions and Herb Butter",
    "url": "http://www.epicurious.com/recipes/food/views/steakburger-with-tangy-caramelized-onions-and-herb-butter"
}
