{
    "directions": [
        "In a kettle of boiling water blanch the cabbage for 1 minute, transfer it with tongs to a work surface, and let cool until it can just be handled. Cut the outermost cabbage leaf free at the core remove the leaf gently in one piece, being careful not to tear it, and remove 3 more leaves in the same manner. Arrange a leaf on each of 4 plates. Cut enough of the remaining cabbage into 1/8-inch-thick shreds to measure 2 cups packed loosely, reserving the rest for another use. In a steamer set over boiling water arrange in order the carrots, the turnips, the parsnips, and the shredded cabbage, steam the vegetables, covered, for 8 to 10 minutes, or until they are just tender, and in a heated bowl toss them with the butter, the vinegar, the minced dill, and salt and pepper to taste. Mound the vegetable mixture in the cabbage leaves and garnish it with the dill sprigs."
    ],
    "ingredients": [
        "1 small head of cabbage",
        "1 pound carrots, peeled and cut into fine julienne",
        "1 pound turnips, peeled and cut into fine julienne",
        "1 pound parsnips, peeled and cut into fine julienne",
        "2 tablespoons unsalted butter, softened",
        "2 tablespoons cider vinegar",
        "2 tablespoons minced fresh dill plus dill sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Steam",
        "Christmas",
        "Thanksgiving",
        "High Fiber",
        "Vinegar",
        "Carrot",
        "Parsnip",
        "Turnip",
        "Fall",
        "Healthy",
        "Cabbage",
        "Christmas Eve",
        "Dill",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Steamed Root Vegetables and Cabbage with Dill",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-root-vegetables-and-cabbage-with-dill-11587"
}
