{
    "directions": [
        "1. Rinse the fish in cold water and pat dry with paper towels. Season the fish inside and out with salt and pepper. Place the fish on a heatproof plate that is both large enough to accommodate it (a glass pie plate works well) and will also fit inside your steamer, bending the fish slightly if it is too long. Stuff half of the ginger inside the cavity of the fish and spread the remaining ginger on top of the fish.",
        "2. Pour water into a wok or stockpot and set a steamer in the wok or on the rim of the stockpot. Make sure the water does not touch the bottom of the steamer. Bring the water to a boil over high heat.",
        "3. Place the plate holding the fish in the steamer, cover, and steam for about 8 minutes, until the fish flakes easily when tested with the tip of a knife.",
        "4. While the fish is steaming, in a small bowl, stir together the soy sauce, wine, and 1 tablespoon of water. Set aside.",
        "5. When the fish is ready, carefully remove the plate from the steamer and pour off any accumulated liquid. Lay the scallion and cilantro along the top of the fish. In a small sauté pan, heat the oil over high heat until it is hot but not smoking. Remove the oil from the heat and pour it directly over the scallion and cilantro to \"cook\" them. Drizzle the soy mixture over the fish and serve immediately."
    ],
    "ingredients": [
        "1 (1 1/2-pound) whole white fish (such as sea bass, branzino, or flounder), cleaned with head and tail intact",
        "Kosher salt and freshly ground black pepper",
        "2 by 1/2-inch piece fresh ginger, peeled and finely julienned",
        "1/4 cup light soy sauce",
        "1 tablespoon rice wine",
        "1 scallion, white and light green parts only, julienned",
        "4 cilantro sprigs",
        "1/2 cup canola oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Ginger",
        "Steam",
        "Dinner",
        "Seafood",
        "Soy Sauce",
        "Green Onion/Scallion",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Steamed Whole Fish with Ginger, Scallions, and Soy",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-whole-fish-with-ginger-scallions-and-soy-51115200"
}
