{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Place steak cubes onto a plate and sprinkle with flour.",
        "Place lard and bacon into a large skillet over medium heat; heat until lard melts and bacon begins to sizzle. Stir floured steak cubes into bacon and hot lard and cook, stirring frequently, until steak and bacon are browned, 10 to 15 minutes.",
        "Transfer steak mixture to a large casserole dish.",
        "Cook and stir onion and mushrooms in the same skillet over medium heat until onions are lightly browned and mushrooms are tender, about 10 minutes. Transfer to casserole dish with steak mixture.",
        "Stir Irish stout beer, parsley, raisins, and brown sugar into steak mixture. Cover dish tightly with aluminum foil.",
        "Bake in the preheated oven, stirring occasionally, until gravy has thickened and steak is tender, about 2 1/2 hours.",
        "Remove casserole dish from oven and increase temperature to 400 degrees F (200 degrees C).",
        "Line a deep-dish 9-inch pie plate with a pie crust and bake in the preheated oven until crust is partially cooked and lightly browned, about 10 minutes.",
        "Spoon cooked steak filling into the partially-baked pie crust.",
        "Cover steak filling with second pie crust; pinch the top crust against the bottom crust to seal tightly.",
        "Bake pie until top crust is golden brown, 10 to 15 minutes."
    ],
    "ingredients": [
        "2 pounds round steak, cut into 1/2-inch cubes",
        "1 tablespoon all-purpose flour",
        "3 ounces lard",
        "8 slices bacon, finely chopped",
        "5 onions, minced",
        "1/4 pound fresh mushrooms, sliced (optional)",
        "1 (12 fluid ounce) bottle Irish stout beer (such as Guinness®)",
        "1 tablespoon chopped fresh parsley",
        "1 tablespoon raisins (optional)",
        "1 teaspoon brown sugar",
        "1 (15 ounce) package double-crust pie pastry, thawed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Steak and Irish Stout Pie",
    "url": "http://allrecipes.com/recipe/220515/steak-and-irish-stout-pie/"
}
