{
    "directions": [
        "Purée all ingredients except steak in a blender or a food processor until smooth. Trim strip of fat (sometimes called a fat cap) from meat. Cut fat into 1/4\"-1/2\" cubes; cut meat into approximately 1\" cubes. Place fat and meat in a large bowl. Add marinade and toss to coat; cover and chill overnight.",
        "Remove fat and meat from marinade, brushing off excess. Thread onto skewers, alternating meat with fat, so that pieces are touching but not pressed tightly together (which would slow down cooking). Leave at least 1\" of space at the ends of skewers for easy turning. Discard marinade; save excess fat for basting liquid.",
        "Combine all ingredients in a large bowl just before you begin grilling; stir occasionally.",
        "Mince any reserved leftover fat. Transfer to a small saucepan. Cook over medium-low heat until fat is heated through, about 3 minutes (fat will not melt completely). Add all ingredients and cook until just heated through; keep warm.",
        "Build a medium fire in a charcoal grill, or heat a gas grill to medium-high. Grill skewers, brushing with basting sauce and turning every 2 minutes, for 10 minutes. Stop basting and cook, turning every 2 minutes, until browned around edges and cooked through, about 6 minutes more. Serve with scallion dipping sauce on the side."
    ],
    "ingredients": [
        "1 cup canned unsweetened coconut milk",
        "1/4 cup fish sauce (such as nuoc nam or nam pla)",
        "2 tablespoons palm sugar or (packed) light brown sugar",
        "1 tablespoon fresh lime juice",
        "6 garlic cloves",
        "4 red or green Thai chiles, stemmed",
        "2 lemongrass stalks, bottom third only, tough outer layers removed",
        "1 1 1/2\" piece ginger, peeled",
        "2 pounds tri-tip, top sirloin cap steak, or rib eye, fat cap left on",
        "15 scallions, very thinly sliced",
        "1/4 cup fish sauce (such as nuoc nam or nam pla)",
        "3 tablespoons grapeseed oil",
        "2 tablespoons chinkiang (black) vinegar",
        "2 tablespoons toasted sesame seeds",
        "1/2 cup canned unsweetened coconut milk",
        "3 tablespoons fish sauce (such as nuoc nam or nam pla)",
        "1 1/2 tablespoons fresh lime juice",
        "2 garlic cloves, crushed",
        "Ingredient info: Chinkiang vinegar, also called black vinegar, an aged vinegar made from glutinous rice and malt, is available at Asian markets.",
        "Special equipment: Eight 8\" metal or bamboo skewers (soak bamboo skewers for 1 hour before using)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Marinate",
        "Dinner",
        "Steak",
        "Healthy",
        "Green Onion/Scallion",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Steak Skewers with Scallion Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/steak-skewers-with-scallion-dipping-sauce-51104370"
}
