{
    "directions": [
        "Mix garlic, butter, and herbs in a small bowl. Transfer to a resealable container (small jars work well). Seal and store until ready to use.",
        "Find 2 of the flattest rocks you can; they should be large enough to fit steaks and at least as thick (about 2\" thick is perfect). Place rocks in the center of a fire pit and build a campfire on and around them. Let fire burn until hot coals have covered the rocks (you can help this along by pushing coals on and around them), about 30 minutes.",
        "Using tongs or heatproof gloves, move rocks away from flames and place them on top of a bed of hot coals. Sprinkle a few drops of water on the rocks—the rocks are ready when the water sizzles and skips across their surface.",
        "Brush steaks with oil and season generously with salt and pepper (really make it rain). Brush any coals or ash from surface of rocks and place 1 steak on top of each. Cook steak until it easily releases from rocks, 6–12 minutes per side for medium-rare, depending on how hot the rocks are. Check for doneness by touch, using an instant-read thermometer (125°F for medium rare), or by cutting into steak to see the internal color.",
        "Transfer steak to a plate or cutting board and place a nob of Wild Herb Butter on top. Let rest for 5 minutes. Cut steak into thick slices and divide among plates, dotting slices with more butter.",
        "Butter can be made and chilled for up to 5 days, or stored at room temperature for up to 2 days."
    ],
    "ingredients": [
        "1 head of wild spring garlic (or 1 large garlic clove), finely chopped",
        "1/2 cup (1 stick) salted butter, room temperature",
        "2 tablespoons assorted wild or cultivated herbs (such as chives and/or parsley), finely chopped",
        "2 (1 1/2-pound) 1 1/2\"-thick boneless rib-eye or strip steaks",
        "Vegetable oil (for cooking)",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Kid-Friendly",
        "Dinner",
        "Steak",
        "Summer",
        "Grill/Barbecue",
        "Butter",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Steak On a Hot Rock with Wild Herb Butter",
    "url": "http://www.epicurious.com/recipes/food/views/steak-on-a-hot-rock-with-wild-herb-butter-56389757"
}
