{
    "directions": [
        "Heat small skillet over medium heat. Add fennel seeds and toast until aromatic and beginning to darken, about 2 minutes. Transfer seeds to processor. Add parsley, capers, shallot, garlic, tarragon, anchovy, and crushed red pepper to processor. Puree until coarse paste forms, scraping down sides occasionally. Transfer to medium bowl. Whisk in oil, cream, and vinegar. Season with salt and pepper. DO AHEAD Salsa verde can be made 2 hours ahead. Let stand at room temperature.",
        "Lay 1 artichoke on its side and cut off top third; cut off stem at base of artichoke. Using scissors, cut top 1/2 inch off each remaining leaf. Rub all cut surfaces with lemon, squeezing slightly to release juice. Repeat with remaining artichokes.",
        "Place rack on bottom of large pot. Add enough water just to touch rack. Bring to boil. Place artichokes on rack in pot. Reduce heat to medium, cover, and steam artichokes until tender, adding more water if necessary, about 30 minutes.",
        "Transfer 1 artichoke to each of 4 plates. Cool 10 minutes. Divide salsa verde among 4 small bowls and serve alongside artichokes."
    ],
    "ingredients": [
        "1/2 teaspoon fennel seeds",
        "1/2 cup fresh Italian parsley leaves",
        "2 tablespoons drained capers, rinsed",
        "3 tablespoons chopped shallot",
        "2 garlic cloves, coarsely chopped",
        "1 1/2 tablespoons fresh tarragon leaves",
        "1 anchovy fillet",
        "Pinch of dried crushed red pepper",
        "1/2 cup extra-virgin olive oil",
        "2 tablespoons whipping cream",
        "2 teaspoons Sherry wine vinegar",
        "4 medium globe artichokes",
        "1/2 lemon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dairy",
        "Fish",
        "Garlic",
        "Herb",
        "Onion",
        "Vegetable",
        "Appetizer",
        "Steam",
        "Spring",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Steamed Artichokes with Salsa Verde",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-artichokes-with-salsa-verde-237914"
}
