{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "Pat the tenderloin dry with paper towels and sprinkle all sides with a generous amount of salt and pepper – you should see the seasoning on the meat. Place a large skillet or roasting pan over medium-high flame, drizzle with the oil, and just when it begins to smoke lay the tenderloin in the hot pan. Brown on all sides until a crust forms and the meat is well-seared, about 7 minutes total. Toss the fresh thyme and rosemary on top of the tenderloin and transfer the whole thing to the oven; roast for 20 to 25 minutes for medium-rare.",
        "Remove the tenderloin to a cutting board to rest for 10 minutes before carving. Pour off the excess fat from the pan and put it back on the stove over medium-high heat. Add the shallots to the pan drippings, saute, stirring with a spoon to scrape up the flavors in the bottom. Take the pan off the heat and pour in the cognac (premeasure - never pour directly from the bottle!) Put the pan back on the heat and tilt it slightly over the burner to ignite the alcohol, or light with a kitchen lighter. The cognac will flame for a few seconds then go out as the alcohol burns off. Stir in the demi-glace and cream, simmer for about 1 minute to thicken the sauce so it coats a spoon. Finish the sauce by stirring in the mustard and peppercorns until incorporated. Taste and season with salt, if necessary.",
        "To serve: pile the watercress on a serving platter, cut the tenderloin into 1/2-inch thick slices and arrange it on top of the greens. Drizzle the sauce over the beef and garnish with chopped parsley. Serve the steak au poivre with pommes frites."
    ],
    "ingredients": [
        "1 (4-pound) beef tenderloin",
        "Kosher salt and coarsely ground black pepper",
        "2 tablespoons vegetable oil",
        "1 handful fresh thyme sprigs",
        "1 handful fresh rosemary sprigs",
        "2 shallots, finely chopped",
        "1/2 cup Cognac or brandy",
        "1/2 cup demi-glace or dark stock",
        "1/4 cup heavy cream",
        "1 tablespoon Dijon mustard",
        "2 tablespoons jarred green peppercorns, drained",
        "1/4 cup chopped fresh flat-leaf parsley",
        "1 bunch watercress, stems trimmed"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Skillet Recipes",
        "Steak",
        "Beef",
        "Meat",
        "Main Dish Recipes",
        "Holiday",
        "Roasting"
    ],
    "title": "Steak au Poivre",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/steak-au-poivre-recipe"
}
