{
    "directions": [
        "Remove the steaks from the refrigerator and let them rest at room temperature for 30 to 60 minutes. Preheat the oven to 400°F.",
        "In a large sauté pan, melt 1 tablespoon of the butter over medium heat and when hot, add the shallots and cook for 1 to 2 minutes or until soft. Add the spinach to the pan and cook for 3 to 4 minutes, stirring, or until the spinach just wilts. Do not let it get too limp. Remove the pan from the heat, cover to keep warm, and set aside.",
        "In a small sauté pan, heat the remaining 1/2 tablespoon butter over medium-low heat and cook the garlic for 2 to 3 minutes or until it begins to brown. Set aside.",
        "Lightly sprinkle the steaks with salt and pepper.",
        "In another large sauté pan, heat the olive oil over medium-high heat and when very hot, sear the steaks for about 2 minutes on each side. Transfer the steaks to a roasting pan and roast for 3 to 4 minutes or until barely medium-rare.",
        "Remove the steaks from the oven and turn on the broiler.Drain the liquid from the spinach and spread the spinach in a broiler pan. Set the steaks on top of the spinach and then top each steak with the garlic and butter. Sprinkle a tablespoon of cheese over each steak and broil for 1 to 2 minutes or until the cheese melts and is lightly browned. Let the steak rest for 5 to 10 minutes. Divide between 2 plates."
    ],
    "ingredients": [
        "Two 10-ounce round or butt steaks, each about 1 inch thick",
        "1 1/2 tablespoons unsalted butter",
        "1 tablespoon minced shallot (1 small shallot)",
        "1 pound fresh spinach, stemmed",
        "1 tablespoon minced garlic",
        "Kosher salt and freshly ground black pepper",
        "1 tablespoon olive oil",
        "2 tablespoons freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Cheese",
        "Dairy",
        "Vegetable",
        "Broil",
        "Sauté",
        "Valentine's Day",
        "Dinner",
        "Parmesan",
        "Meat",
        "Steak",
        "Spinach",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Steak Florentine",
    "url": "http://www.epicurious.com/recipes/food/views/steak-florentine-363339"
}
