{
    "directions": [
        "Pat steaks dry and cut 3 (1-inch-long) slits 1 inch apart across center cartilage (to keep meat from curling). Put meat between 2 sheets of plastic wrap and pound to 1/4 inch thick with flat side of a meat pounder or with a rolling pin. Discard plastic wrap and sprinkle steaks with 1 teaspoon salt and 1/2 teaspoon pepper (total).",
        "Heat 2 tablespoons oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then cook steaks in 2 batches, turning over once, until meat is just medium-rare, 2 minutes per batch. Transfer steaks to a platter as cooked and keep warm, loosely covered with foil. (Do not wipe skillet clean.)",
        "Add remaining 2 tablespoons oil to skillet and sauté onion and bell pepper over moderately high heat, stirring, until onion is golden, about 4 minutes. Add mushrooms and garlic and sauté, stirring, until mushrooms are golden, about 3 minutes. Add vermouth and cook until evaporated, about 1 minute. Add water and tomatoes with their juice, then reduce heat and simmer, covered, stirring occasionally, until tomatoes and onion are tender, about 5 minutes. Remove lid and cook until most of liquid is evaporated, about 5 minutes. Stir in remaining 1/2 teaspoon salt and 1/4 teaspoon pepper. Spoon vegetable sauce on top of steaks."
    ],
    "ingredients": [
        "4 (1/2-inch-thick) top blade beef chuck steaks (1 1/4 lb total)",
        "1 1/2 teaspoons salt",
        "3/4 teaspoon black pepper",
        "1/4 cup olive oil",
        "1 medium onion, thinly sliced",
        "1 yellow bell pepper, cut into 1/4-inch- wide strips",
        "6 oz white mushrooms, trimmed and thinly sliced",
        "3 garlic cloves, finely chopped",
        "3 tablespoons sweet vermouth",
        "3 tablespoons water",
        "1 (14- to 15-oz) can diced tomatoes in juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Onion",
        "Tomato",
        "Sauté",
        "Steak",
        "Gourmet"
    ],
    "title": "Steak Pizzaiola",
    "url": "http://www.epicurious.com/recipes/food/views/steak-pizzaiola-234265"
}
