{
    "directions": [
        "Preheat a broiler.",
        "To make the béarnaise sauce, in a small saucepan over medium-high heat, combine the vinegar, shallot and the 2 tsp. tarragon. Bring to a boil, reduce the heat to low and simmer until the vinegar is almost completely evaporated, 3 to 5 minutes. Remove from the heat and let cool slightly, then strain into a heatproof bowl. Add the water and egg yolks. Set the bowl over but not touching simmering water in a small saucepan and whisk until thick and pale yellow, about 3 minutes.",
        "Transfer the mixture to a blender and blend until smooth. Let cool for 1 minute. With the motor running, slowly pour in the clarified butter and blend until incorporated. Add the 1/2 tsp. lemon juice, or to taste, and the 1 Tbs. tarragon. Season with salt and white pepper and process to combine. Transfer the sauce to a double boiler and keep warm over very low heat.",
        "Lightly spread each cut side of the muffins with 1 tsp. of the butter. Broil until golden, 3 to 5 minutes. Turn off the broiler, cover the muffins with aluminum foil and keep warm in the oven.",
        "Meanwhile, in a large sauté pan over medium-high heat, melt the remaining 1 tsp. butter. Season the filets with salt and black pepper and cook until nicely browned, about 2 minutes per side for medium, or until done to your liking. Keep warm.",
        "Fill an egg-poaching pan with 1/2 inch water, set the pan over medium heat and bring to a simmer. Lightly coat the poaching cups with nonstick cooking spray and crack an egg into each cup. Cover and cook until the whites are firm and the yolks are glazed over but still soft, about 3 minutes, or until done to your liking. Transfer the eggs to a warmed plate and repeat with the remaining eggs.",
        "Place 2 muffin halves on each of 4 warmed individual plates. Top each muffin half with a filet, an egg and some of the béarnaise sauce. Serve immediately."
    ],
    "ingredients": [
        "1/2 cup white wine vinegar",
        "2 Tbs. minced shallot",
        "2 tsp. plus 1 Tbs. chopped fresh tarragon",
        "2 Tbs. water",
        "4 egg yolks",
        "1 cup clarified butter, warmed",
        "1/2 tsp. fresh lemon juice, plus more, to taste",
        "Salt and freshly ground white pepper, to taste",
        "4 English muffins, split",
        "3 Tbs. unsalted butter",
        "8 filets mignons, each about 2 oz. and 1/4 inch thick",
        "Salt and freshly ground black pepper, to taste",
        "8 eggs"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Steak and Eggs Benedict",
    "url": "http://www.williams-sonoma.com/recipe/steak-and-eggs-benedict.html"
}
