{
    "directions": [
        "Combine halved head of garlic, 2\" pieces of scallions, 1 tablespoon ginger, and 4 cups water in a pot large enough to fit a steamer basket. Squeeze lemon half over; add lemon to pot and bring to a boil. Simmer for 10 minutes. Transfer 1/4 cup liquid from pot to a small bowl; set aside for sauce. Add 2 cups water to pot and return to a boil.",
        "Set aside 1/4 cup sliced scallions and 1 tablespoon ginger. Line steamer basket with parchment paper. Scatter half of sliced garlic, half of remaining sliced scallions, and half of remaining ginger on top of parchment, spreading evenly. Coat fish with oil, season with salt, and place skin side down in steamer. Scatter remaining garlic, scallions, and ginger over fish. Set steamer over pot, cover, and steam until fish is just cooked through, 12-18 minutes, depending on thickness of fish.",
        "Meanwhile, stir reserved scallions, reserved ginger, soy sauce, sliced chiles, and chopped cilantro into reserved steaming liquid to make sauce.",
        "Transfer fish to a platter. Drizzle with sauce."
    ],
    "ingredients": [
        "1 head of garlic, 3 cloves sliced, remaining head halved crosswise",
        "6 scallions, trimmed, 2 cut into 2\" pieces, 4 thinly sliced",
        "1 5\" piece peeled fresh ginger, cut into matchstick-size pieces",
        "1/2 lemon",
        "4 4-ounce black cod fillets, skin on",
        "1 tablespoon vegetable oil",
        "Kosher salt",
        "2 tablespoons reduced-sodium soy sauce",
        "2 green Thai chiles or 1 serrano chile, thinly sliced",
        "1 tablespoon chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Steam",
        "Low Carb",
        "Low Fat",
        "Mother's Day",
        "Dinner",
        "Seafood",
        "Cod",
        "Healthy",
        "Soy Sauce",
        "Chile Pepper",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Steamed Black Cod with Soy-Chile Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-black-cod-with-soy-chile-sauce-366702"
}
