{
    "directions": [
        "Combine 1 tablespoon hot water and saffron in medium bowl. Let stand 5 minutes. Whisk in mayonnaise and garlic. Season to taste with salt. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Heat 2 tablespoons olive oil in heavy large pot over medium heat. Add celery root, leek, carrots, chopped celery and 4 tablespoons parsley. Stir to coat. Cover pot and cook until vegetables are tender, stirring occasionally, about 15 minutes. Add garlic and sauté 1 minute. Add mussels, wine and Pernod. Increase heat to high. Cover and cook until mussels open, stirring occasionally, about 6 minutes (discard any mussels that do not open). Remove from heat. Season cooking liquid to taste with salt and pepper.",
        "Whisk 1/2 cup cooking liquid into aioli to make thin sauce. Ladle mussels and remaining cooking liquid into 6 bowls. Drizzle each serving with some aioli. Sprinkle with remaining 2 tablespoons parsley. Serve mussels, passing re-maining aioli separately."
    ],
    "ingredients": [
        "1 tablespoon hot water",
        "Pinch of saffron threads, crumbled",
        "2/3 cup low-fat mayonnaise",
        "2 garlic cloves, minced",
        "2 tablespoons olive oil",
        "1 large celery root, peeled, finely chopped (about 2 1/2 cups)",
        "1 large leek (white and pale green parts only), thinly sliced",
        "2 carrots, peeled, finely chopped",
        "2 celery stalks, finely chopped",
        "6 tablespoons finely chopped fresh parsley",
        "4 garlic cloves, minced",
        "4 1/2 pounds mussels, scrubbed, debearded",
        "1 1/2 cups dry white wine",
        "1/3 cup Pernod or other anise-flavored liqueur"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Appetizer",
        "Steam",
        "Low Fat",
        "Mussel",
        "Saffron",
        "Pernod",
        "Celery",
        "Leek",
        "Carrot",
        "White Wine",
        "Winter",
        "Parsley",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Steamed Mussels with Pernod, Celery Root and Saffron Aïoli",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-mussels-with-pernod-celery-root-and-saffron-aioli-100530"
}
