{
    "directions": [
        "With a vegetable peeler remove three 3-by-1/2-inch strips orange zest. Cut remaining peel and pith from orange with a sharp knife and discard. Cut out fruit sections from between membranes, discarding membranes, and finely chop enough fruit to measure 1/3 cup, reserving remaining fruit for another use.",
        "In a large saucepan cook garlic paste, shallots, chopped fennel, and fennel seeds in butter over moderate heat, stirring, until chopped fennel is softened, about 5 minutes. Stir in wine and zest and boil 1 minute. Add broth and return to a boil. Add mussels and cook, covered with a tight-fitting lid, over high heat, checking them every minute, 3 to 8 minutes, transferring them as they open with a slotted spoon to a serving bowl. (Discard any mussels that are unopened after 8 minutes.)",
        "Stir into broth chopped orange, parsley, and salt and pepper to taste and spoon over mussels."
    ],
    "ingredients": [
        "1 navel orange",
        "2 large garlic cloves, minced and mashed to a paste with 1/2 teaspoon salt",
        "2 shallots, chopped fine (about 1/3 cup)",
        "1/2 cup finely chopped fennel bulb (sometimes called anise)",
        "1 teaspoon fennel seeds",
        "2 tablespoons unsalted butter",
        "1/4 cup dry white wine",
        "1/2 cup chicken broth",
        "1 pound mussels (preferably cultivated), scrubbed well and beards pulled off",
        "1 tablespoon chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Shellfish",
        "Steam",
        "Cocktail Party",
        "Quick & Easy",
        "Wheat/Gluten-Free",
        "Orange",
        "Mussel",
        "Fennel",
        "White Wine",
        "Summer",
        "Gourmet"
    ],
    "title": "Steamed Mussels with Orange, Fennel, and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-mussels-with-orange-fennel-and-garlic-12646"
}
