{
    "directions": [
        "Whisk crème fraîche and egg yolks in medium bowl to blend. Melt butter in heavy medium skillet over medium heat. Add shallots and sauté until soft, about 3 minutes. Remove skillet from heat. Add Cognac and ignite with match. Let flames burn out; whisk in lemon juice and saffron. Set both mixtures aside.",
        "Place mussels in heavy large pot; pour in wine. Bring to boil over medium-high heat. Cover pot and cook until mussels open, about 6 minutes. Remove from heat. Using tongs, transfer mussels to baking sheet (discard any mussels that do not open). Remove top half of each mussel shell; divide mussels in bottom shells among 4 bowls. Tent with foil.",
        "Strain mussel cooking liquid from pot through sieve lined with damp paper towel into skillet with shallot mixture. Boil over medium-high heat until reduced to 1 cup, about 3 minutes. Very slowly whisk hot liquid into crème fraîche mixture; return to same skillet. Stir over low heat just until sauce thickens enough to coat spoon, about 2 minutes. Remove from heat; season sauce with salt and pepper. Spoon sauce over mussels. Garnish with chives.",
        "Sold at some supermarkets. If unavailable, heat 1 cup whipping cream to lukewarm (85°F). Remove from heat and mix in 2 tablespoons buttermilk. Cover and let stand in warm draft-free area until slightly thickened, 24 to 48 hours, depending on temperature of room. Refrigerate until ready to use."
    ],
    "ingredients": [
        "1/2 cup crème fraîche*",
        "2 large egg yolks",
        "1 1/2 tablespoons butter",
        "2 large shallots, finely chopped",
        "2 tablespoons Cognac or brandy",
        "3 tablespoons fresh lemon juice",
        "1 generous pinch of saffron threads",
        "40 mussels, scrubbed, debearded",
        "1 cup dry white wine",
        "Fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Steam",
        "Lemon",
        "Mussel",
        "Saffron",
        "Brandy",
        "White Wine"
    ],
    "title": "Steamed Mussels with Lemon-Saffron Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-mussels-with-lemon-saffron-sauce-107133"
}
