{
    "directions": [
        "Pierce the steak with a fork about 12 times and place in a resealable plastic bag with 2 tablespoons of the vinegar, 1 teaspoon of the olive oil, Worcestershire, garlic, 1/4 teaspoon salt and 1/4 teaspoon pepper. Seal the bag, shake to coat the meat and marinate for at least 4 hours or up until the day before cooking.",
        "Cook the bulgur according to package directions, draining off any excess water, and cool to room temperature. Toss with the cucumber, parsley, olives and 1/2 of the baby arugula. Drizzle with the remaining 1 tablespoon vinegar and 1 tablespoon oil. Season with salt and pepper and set aside.",
        "Remove the steak from the marinade and pat dry. Season with 1/4 teaspoon salt. Prepare a grill for direct and indirect heat or heat a grill pan over medium-high and medium-low heat. Mist both sides of the onion slices with nonstick cooking spray and sprinkle with salt and pepper. Place the onions on the indirect-heat part of the grill and the meat on the direct-heat part of the grill. Grill the onions, turning occasionally, until tender, about 15 minutes. Grill the meat, turning once, until the internal temperature registers 125 degrees F, 8 to 10 minutes per side. Let the steak rest, tented with foil, 15 minutes and then thinly slice against the grain.",
        "Divide the remaining arugula among 6 dinner plates and top with the bulgur salad, 1 grilled onion round, and the sliced steak."
    ],
    "ingredients": [
        "1 1/2 pounds flank steak",
        "3 tablespoons red wine vinegar",
        "4 teaspoons olive oil",
        "1 teaspoon Worcestershire sauce",
        "2 cloves garlic, smashed",
        "Kosher salt and freshly ground black pepper",
        "1/2 cup bulgur wheat",
        "1/2 seedless cucumber, chopped",
        "1/2 cup whole parsley leaves",
        "1/4 cup pitted kalamata olives, halved",
        "One 6-ounce bag baby arugula",
        "Nonstick cooking spray",
        "1 medium red onion, cut into 6 thick slices"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Steak Salad",
        "Salad Recipes",
        "Steak",
        "Healthy",
        "Beef",
        "Meat",
        "Grain Recipes",
        "Low-Fat",
        "Low Sodium",
        "Low Calorie",
        "Low-Carb",
        "Low-Cholesterol",
        "Heart-Healthy",
        "Diabetes-Friendly"
    ],
    "title": "Steak and Tabbouleh Salad",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/steak-and-tabbouleh-salad-recipe"
}
