{
    "directions": [
        "Place the steak between two sheets of heavy plastic (resalable freezer bags work well) on a solid, level surface. Firmly pound the beef with the smooth side of a meat mallet to a thickness of 1/8 inch. Combine the olive oil, 2 tablespoons of cilantro, cumin, oregano, 1 pinch of cayenne in a large glass or ceramic bowl; season to taste with salt and pepper. Add the beef and toss to evenly coat. Cover the bowl with plastic wrap, and marinate in the refrigerator for 30 minutes.",
        "Mix yogurt and mayonnaise in a separate bowl. Stir in 1 pinch of cayenne pepper, dill weed, 2 tablespoons of cilantro, lime juice, and salt. Cover the bowl with plastic wrap and refrigerate until ready to serve. Combine 1 1/4 cup of cilantro and onion in a bowl. Set aside.",
        "Heat a large skillet over medium-high heat and stir in the steak. Cook and stir until the beef is evenly browned. Drain and discard any excess grease. Heat another skillet over medium heat. Place one tortilla in the skillet and sprinkle with cheese and cooked steak. Top with the onion mixture, then carefully fold the tortilla in half. Cook until lightly crisp on each side. Repeat with remaining tortillas. Serve with yogurt sauce on the side."
    ],
    "ingredients": [
        "1 pound top round steak, cut into small pieces",
        "2 tablespoons olive oil",
        "2 tablespoons chopped fresh cilantro",
        "1 teaspoon ground cumin",
        "1 tablespoon dried oregano",
        "1 pinch cayenne pepper, or to taste",
        "salt and ground black pepper to taste",
        "2 cups plain yogurt",
        "1/2 cup mayonnaise",
        "1 pinch cayenne pepper",
        "1 tablespoon dried dill weed",
        "2 tablespoons chopped fresh cilantro",
        "1 lime, juiced",
        "salt to taste",
        "1 1/4 cups chopped fresh cilantro",
        "1 onion, finely chopped",
        "8 (7 inch) flour tortillas",
        "1 cup shredded Mexican cheese blend"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Steak Tacos with Spicy Yogurt Sauce",
    "url": "http://allrecipes.com/recipe/213115/steak-tacos-with-spicy-yogurt-sauce/"
}
