{
    "directions": [
        "Heat olive oil in heavy medium pot over medium heat. Add 2 tablespoons garlic and sauté 1 minute. Add tomatoes with their juices, whole onion, basil and 1 tablespoon oregano to pot. Reduce heat to medium-low and simmer sauce until reduced to 1 3/4 cups, about 1 hour. Remove onion and discard. Season sauce to taste with salt and pepper. Set aside.",
        "Melt butter in heavy large pot over medium-high heat. Add parsley, bay leaf, crushed red pepper, remaining 1 tablespoon garlic and 2 tablespoons oregano. Sauté until garlic is tender, about 1 minute. Stir in Sherry and tomato sauce. Add mussels and stir to coat. Cover and simmer until mussels open, about 5 minutes; discard any mussels that do not open. Using tongs, transfer mussels to large serving bowl. Season sauce to taste with salt and pepper. Ladle sauce over mussels and serve."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "3 tablespoons finely chopped garlic",
        "1 28-ounce can Italian-style tomatoes with juices, coarsely chopped",
        "1 small onion, peeled (about 6 ounces)",
        "3 tablespoons chopped fresh basil or 1 tablespoon dried",
        "3 tablespoons chopped fresh oregano or 3 teaspoons dried",
        "1/4 cup (1/2 stick) butter",
        "2 tablespoons chopped fresh parsley",
        "1 large bay leaf",
        "1/4 teaspoon dried crushed red pepper",
        "1 cup Sherry",
        "4 pounds mussels, scrubbed, debearded"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Shellfish",
        "Tomato",
        "Appetizer",
        "Steam",
        "Mussel",
        "Sherry",
        "Summer",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Steamed Mussels with Sherry, Tomatoes and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-mussels-with-sherry-tomatoes-and-garlic-4216"
}
