{
    "directions": [
        "Whisk garlic, vinegar, mirin, gochujang, and soy sauce in a medium bowl. Whisk in 1/2 cup oil; season with salt and pepper.",
        "Lightly score steak; season with salt and pepper. Place in a resealable plastic bag with half of dressing. Seal bag and turn to coat. Chill at least 1 hour. Set aside remaining dressing for serving.",
        "Very thinly slice a few sugar snap peas on a diagonal; set aside. Cook remaining peas in a large saucepan of boiling salted water until crisp-tender, about 2 minutes. Drain; transfer to a bowl of ice water and chill until cold, about 4 minutes. Drain, pat dry, and cut in half on a diagonal.",
        "Prepare grill for medium-high heat; lightly oil grates. Remove steak from marinade and grill, turning twice, until medium-rare and lightly charred, 8–10 minutes. Transfer to a cutting board and let rest 10 minutes before thinly slicing against the grain.",
        "Meanwhile, heat remaining 2 tablespoons oil in a small skillet over medium. Cook peanuts, tossing, until golden brown and shiny, about 3 minutes. Transfer to a small bowl with a slotted spoon and add gochugaru; season with salt. Let cool.",
        "Place peanuts in a resealable plastic bag and seal, pressing out air. Pound with a rolling pin to coarsely crush.",
        "Arrange lettuce on a platter; season with salt and pepper and drizzle with half of reserved dressing. Top with steak, cooked peas, cucumbers, and radishes. Drizzle with remaining dressing and top with peanuts, scallions, and raw peas."
    ],
    "ingredients": [
        "2 garlic cloves, finely grated",
        "1/3 cup unseasoned rice vinegar",
        "3 tablespoons mirin",
        "2 tablespoons gochujang (Korean hot pepper paste)",
        "2 tablespoons soy sauce",
        "1/2 cup plus 2 tablespoons olive oil; plus more for grilling",
        "Kosher salt, freshly ground pepper",
        "1-1 1/2 pound flank steak",
        "8 ounces sugar snap peas",
        "1/4 cup raw peanuts",
        "1 teaspoon gochugaru (Korean red pepper powder)",
        "1 head of butter lettuce, leaves separated",
        "2 Persian cucumbers, sliced 1/8\" thick",
        "2 ounces radishes, thinly sliced",
        "2 scallions, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Lunch",
        "Steak",
        "Cucumber",
        "Hot Pepper",
        "Radish",
        "Healthy",
        "Lettuce",
        "Sugar Conscious",
        "Dairy Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Steakhouse Salad with Red Chile Dressing and Peanuts",
    "url": "http://www.epicurious.com/recipes/food/views/steakhouse-salad-with-red-chile-dressing-and-peanuts-56389405"
}
