{
    "directions": [
        "Blend parsley, 3/4 cup olive oil, vinegar, oregano, cumin, 1 teaspoon salt, minced garlic, and crushed red pepper in processor until smooth. Place meat in large glass baking dish. Sprinkle with salt and pepper. Brush meat with 2 tablespoons chimichurri sauce. Cover steaks and remaining sauce separately and refrigerate at least 1 hour. (Can be made 1 day ahead. Keep refrigerated.)",
        "Preheat oven to 450°F. Place bread slices on large baking sheet. Brush with olive oil. Bake until just firm, about 5 minutes. Transfer to large platter.",
        "Preheat broiler. Transfer meat to rimmed baking sheet and broil until cooked to desired doneness, about 4 minutes per side for medium. Transfer to cutting board. Let stand 5 minutes. Cut each steak along grain in half. Cut each half crosswise against grain into 10 slices. Top each bread slice with 1 piece of meat. Spread each with some chimichurri sauce; place on platter. Spoon remaining sauce into small bowl and place in center of platter. Serve warm or let stand up to 2 hours at room temperature."
    ],
    "ingredients": [
        "1 cup packed fresh parsley",
        "3/4 cup olive oil",
        "3 tablespoons red wine vinegar",
        "2 tablespoons dried oregano",
        "2 teaspoons ground cumin",
        "1 teaspoon salt",
        "2 garlic cloves, minced",
        "1/2 teaspoon dried crushed red pepper",
        "2 1-pound pieces flank steak",
        "1 16-ounce thin French-bread baguette, cut into 40 slices",
        "Additional olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Appetizer",
        "Bake",
        "Broil",
        "Cocktail Party",
        "Summer",
        "Winter",
        "Parsley",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Steak and Chimichurri Toasts",
    "url": "http://www.epicurious.com/recipes/food/views/steak-and-chimichurri-toasts-105959"
}
