{
    "directions": [
        "Preheat oven to 450°F. Using fork, pierce sausages all over. Heat each of 2 large cast-iron skillets or other large ovenproof skillets over medium-high heat. Add half of sausages to each skillet and cook meat until browned, turning occasionally, about 5 minutes. Add half of onions, half of fennel, half of garlic, and half of dried crushed red pepper to each skillet. Add 1 cup white wine to each skillet and bring to boil. Cover and simmer until sausages and vegetables are cooked through, about 12 minutes. Add 1/2 cup wine, then 1/2 of mussels to each skillet; transfer skillets to oven and roast uncovered 5 minutes. Carefully remove skillets from oven; top each skillet with enough baguette slices to cover completely. Return skillets to oven; bake uncovered until mussels open and bread slices begin to brown, about 5 minutes longer (discard any mussels that do not open).",
        "Drizzle bread in each skillet with extra-virgin olive oil, then sprinkle with chopped parsley. Serve mussels and sausages directly from skillets."
    ],
    "ingredients": [
        "2 pounds sweet or hot Italian link sausages, divided",
        "2 large onions, sliced (about 6 cups), divided",
        "2 large fresh fennel bulbs, sliced (about 6 cups), divided",
        "6 garlic cloves, crushed, divided",
        "1 teaspoon dried crushed red pepper, divided",
        "3 cups dry white wine (about one 750-ml bottle), divided",
        "6 pounds mussels, scrubbed, debearded",
        "1 16-ounce crusty French or sourdough baguette, cut into 1/2-inch-thick slices, divided",
        "Extra-virgin olive oil (for drizzling)",
        "Chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "High Fiber",
        "Dinner",
        "Sausage",
        "Mussel",
        "Fennel",
        "White Wine",
        "Family Reunion",
        "Potluck",
        "Ramekin",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Steamed Mussels with Sausages and Fennel",
    "url": "http://www.epicurious.com/recipes/food/views/steamed-mussels-with-sausages-and-fennel-351276"
}
