{
    "directions": [
        "Korean hot pepper paste (gochu jang or kochujang) is made with pureed fermented soybeans (miso) and hot chiles. Kimchi is a spicy and pungent fermented vegetable mixture; this recipe calls for the version made with Napa cabbage. Both can be found at Korean markets and online at koamart.com.",
        "Whisk first 10 ingredients in bowl. Add steaks. Cover; chill overnight.",
        "Bring 2 cups water to boil in small saucepan. Add rice and 1 teaspoon salt. Return to boil; reduce heat to low, cover, and cook until water is absorbed, about 18 minutes.",
        "Meanwhile, prepare barbecue (medium-high heat). Grill steaks until slightly charred but still pink in center, about 3 minutes per side. Transfer to plate. Let stand 5 minutes.",
        "Heat 2 tablespoons oil in large skillet over medium heat. Add kimchi and vinegar. Stir until heated. Fold in rice. Season with salt and pepper. Keep warm.",
        "Heat 1 teaspoon oil in large nonstick skillet over medium heat. Crack eggs into skillet, being careful not to break yolk. Sprinkle with salt and pepper. Cook until whites are set, about 3 minutes.",
        "Divide kimchi rice among 4 plates. Slice steaks thinly across grain; arrange over rice. Top each with egg; sprinkle with green onions and serve.",
        "*Available in the Asian foods section of some supermarkets and at Japanese markets."
    ],
    "ingredients": [
        "1/4 cup mirin (sweet Japanese rice wine)*",
        "2 tablespoons finely grated cored peeled Granny Smith apple",
        "2 tablespoons soy sauce",
        "2 tablespoons light corn syrup",
        "1 1/2 tablespoons finely chopped green onion (white and pale green parts)",
        "1 tablespoon (scant) Korean hot pepper paste",
        "1 tablespoon (scant) minced peeled fresh ginger",
        "2 garlic cloves, minced",
        "1 1/2 teaspoons Asian sesame oil",
        "1 1/2 teaspoons unseasoned rice vinegar",
        "4 5-ounce pieces skirt steak",
        "2 cups water",
        "1 cup sushi rice (or other short-grain rice)",
        "1 teaspoon salt",
        "2 tablespoons plus 1 teaspoon canola oil",
        "1 1/2 cups Napa cabbage kimchi, coarsely chopped",
        "2 tablespoons unseasoned rice vinegar",
        "4 large eggs",
        "Chopped green onions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Rice",
        "Breakfast",
        "Marinate",
        "Steak",
        "Sake",
        "Grill/Barbecue",
        "Cabbage",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Steak and Eggs Korean Style",
    "url": "http://www.epicurious.com/recipes/food/views/steak-and-eggs-korean-style-239793"
}
