{
    "directions": [
        "Preheat oven to 350°F. Prick sweet potato all over with a fork; rub with 1 Tbsp. oil, then season with salt and pepper. Roast directly on oven rack until tender, 30–45 minutes. Let cool. Remove and discard skin; mash flesh with a fork. Set aside.",
        "Remove stem from mushroom; discard. Pulse cap in a food processor until finely chopped. Coarsely grate zucchini on the large holes of a box grater; gather up in a kitchen towel and squeeze out excess liquid.",
        "Heat 1 Tbsp. oil in a medium skillet over low. Cook shallot and red pepper flakes, stirring often, until shallot is soft, about 2 minutes. Add mushroom and zucchini and cook, stirring occasionally, until vegetables begin to release their liquid but have not taken on any color, about 2 minutes. Transfer to a large bowl; mix in quinoa and season with salt and pepper. Let cool.",
        "Add breadcrumbs, lemon juice, and about 1/4 cup reserved mashed sweet potato to quinoa mixture and mix well. Taste and adjust seasoning with salt and pepper if needed. If mixture is too loose, add more sweet potato to bind.",
        "Divide mixture into 4 portions and form into patties, pressing firmly together with your hands. Heat 2 Tbsp. oil in a medium skillet over medium and cook 2 patties until golden brown, about 2 minutes per side; season with salt and pepper. Repeat with remaining 2 Tbsp. oil and 2 patties.",
        "Build burgers with patties, toasted English muffins, guacamole, tomato chutney, and sprouts.",
        "Patties can be made 3 days ahead. Cover and chill."
    ],
    "ingredients": [
        "1 small sweet potato",
        "6 tablespoons olive oil, divided",
        "Kosher salt, freshly ground pepper",
        "1 portobello mushroom",
        "1/2 small zucchini",
        "1 small shallot, finely chopped",
        "1/4 teaspoons crushed red pepper flakes",
        "1 cup cooked quinoa (from about 1/2 cup uncooked)",
        "3/4 cup dried breadcrumbs",
        "1 1/2 teaspoons fresh lemon juice",
        "4 English muffins, split, toasted",
        "Guacamole, tomato chutney, and sprouts (for serving; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sweet Potato/Yam",
        "Mushroom",
        "Zucchini",
        "Shallot",
        "Quinoa",
        "Vegetarian",
        "Healthy",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Stellar Quinoa Burger",
    "url": "http://www.epicurious.com/recipes/food/views/stellar-quinoa-burger"
}
