{
    "directions": [
        "Rinse the turkey pieces and place them in a pot large enough to accommodate them. Cover with cold water and add the salt. Cover the pot and bring the contents to a boil over medium-high heat. Reduce the temperature to keep the broth at a low simmer for 1 hour. Periodically, skim any froth that rises to the surface.",
        "After an hour, remove the turkey pieces and set aside to cool. Raise the heat until the broth comes to a boil. Continue boiling, uncovered, until the liquid is reduced by half. (This will take about an hour.)",
        "When the broth is reduced, add the sliced onions, herbs, vinegar, butter, sugar, peppercorns, and cloves. Simmer for about 20 minutes, until the onions are soft. While the broth is simmering, cut the cooled turkey into serving pieces.",
        "Before serving, taste the broth and adjust the seasoning. Place the meat into the broth and \"let it take a walme or two,\" that is, let it simmer gently for just a minute. Pour the turkey and sauce into a serving bowl. Pass the \"sippets\" (toasted bread slices) to serve as a base for the turkey and to sop up the sauce."
    ],
    "ingredients": [
        "4 pounds turkey parts (thighs and legs work well for this recipe)",
        "1 teaspoon salt",
        "2 large onions, sliced into 1/4-inch rings",
        "Bundle of fresh herbs, tied (any combination of the following are appropriate: sage, thyme, parsley, marjoram, or savory), or 2 tablespoons dried",
        "1/3 cup red wine vinegar or cider vinegar",
        "2 tablespoons (1/4 stick) salted butter",
        "2 tablespoons sugar",
        "1 teaspoon black peppercorns",
        "1/4 teaspoon ground cloves",
        "6 to 8 (1-inch-thick) slices of hearty bread, cut in half and toasted or fried until browned"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "turkey",
        "Thanksgiving",
        "Vinegar",
        "Fall",
        "Simmer",
        "Boil"
    ],
    "title": "Stewed Turkey with Herbs and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/stewed-turkey-with-herbs-and-onions-235929"
}
