{
    "directions": [
        "Whisk together brown sugar, salt, and spices in a small bowl.",
        "Line a 17- by 12- by 1-inch heavy-duty baking pan with a double layer of foil, then oil foil.",
        "Pat ribs dry and arrange in baking pan. Rub ribs all over with spice mixture and marinate, meaty sides up, covered and chilled, 2 1/2 hours.",
        "Bring ribs to room temperature, about 30 minutes.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Cover pan tightly with foil; bake 1 1/4 hours. Remove foil.",
        "Cook onion, garlic, and ginger in oil in a 2-quart heavy saucepan over moderate heat, stirring occasionally, until softened, about 6 minutes. Add remaining ingredients and simmer, uncovered, stirring occasionally, 15 minutes.",
        "Purée sauce in 2 or 3 batches in a blender until smooth (use caution when blending hot liquids). Set aside 1 cup sauce for serving with ribs.",
        "Prepare grill for cooking over indirect heat with medium-hot charcoal (moderate heat for gas); see Grilling Procedureepi:recipelink.</epi:recipelink>",
        "To cook ribs using a charcoal grill: Lightly oil grill rack, then transfer ribs to area of rack with no coals underneath, reserving pan juices, and cook, covered with lid, basting generously with pan juices and sauce and turning over and rotating ribs every 10 minutes (keep ribs over indirect heat), until tender and browned, 30 to 40 minutes total. Transfer ribs to a cutting board and let stand 5 minutes before cutting into individual ribs.",
        "To cook ribs using a gas grill: Lightly oil grill rack, then transfer ribs to rack above shut-off burner, reserving pan juices. Grill, covered with lid, basting generously with pan juices and sauce and turning over and rotating ribs every 10 minutes (keep ribs over shut-off burner), until ribs are tender and browned, 30 to 40 minutes total. Transfer ribs to a cutting board and let stand 5 minutes before cutting into individual ribs."
    ],
    "ingredients": [
        "2 tablespoons packed dark brown sugar",
        "1 1/2 teaspoons salt",
        "2 tablespoons paprika (not hot)",
        "1 1/2 teaspoons chipotle chile powder",
        "1 1/2 teaspoons ground cumin",
        "1 teaspoon ground allspice",
        "1/2 teaspoon black pepper",
        "2 (2-lb) racks baby back ribs",
        "1 1/2 cups chopped onion (from 1 large)",
        "6 garlic cloves, finely chopped",
        "1 1/2 tablespoons finely chopped peeled fresh ginger",
        "2 tablespoons vegetable oil",
        "1 1/2 cups ketchup",
        "1/2 cup cider vinegar",
        "6 tablespoons soy sauce",
        "1/2 cup water",
        "1/4 cup packed dark brown sugar",
        "1 1/2 teaspoons salt",
        "3/4 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Ginger",
        "Onion",
        "Pork",
        "Bake",
        "Marinate",
        "Vinegar",
        "Summer",
        "Grill/Barbecue",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Sticky Spicy Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/sticky-spicy-ribs-234660"
}
