{
    "directions": [
        "Using electric mixer fitted with dough hook or paddle, mix first 6 ingredients in large bowl. Add water, butter and egg and mix until smooth dough forms, about 4 minutes. Transfer dough to greased bowl. Cover with plastic and clean towel. Let dough rise in warm draft-free area until doubled in volume, about 30 minutes.",
        "Butter 9x13-inch baking dish. Bring 1 cup brown sugar and 1/2 cup butter to boil in heavy small saucepan. Boil 1 minute. Remove from heat and stir in 1/2 cup walnuts. Pour into prepared dish. Punch dough down. Roll out on lightly floured surface to 15x9-inch rectangle. Spread dough evenly with remaining 1/2 cup butter. Sprinkle with remaining 1/2 cup brown sugar and 1 tablespoon cinnamon. Sprinkle with remaining 1/2 cup walnuts and raisins. Roll up jelly roll style, starting at one long side. Slice dough into 1-inch-thick rounds.",
        "Arrange dough slices cut side down in prepared dish, spacing evenly. Cover with plastic. Let rise in warm draft-free area until doubled, about 45 minutes.",
        "Preheat oven to 350°F. Bake rolls until golden brown, about 45 minutes. Let stand 5 minutes. Turn out onto platter. Cool slightly. Serve warm."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1 cup whole wheat flour",
        "1/4 cup firmly packed brown sugar",
        "1 envelope rapid-rise yeast",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground cinnamon",
        "3/4 cup warm water (125°F. to 130°F.)",
        "1/4 cup (1/2 stick) butter, melted",
        "1 egg",
        "1 1/2 cups firmly packed brown sugar",
        "1 cup (2 sticks) butter, room temperature",
        "1 cup chopped walnuts",
        "1 tablespoon ground cinnamon",
        "1/2 cup raisins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Mixer",
        "Breakfast",
        "Brunch",
        "Bake",
        "Walnut",
        "Cinnamon"
    ],
    "title": "Sticky Cinnamon Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/sticky-cinnamon-rolls-1603"
}
