{
    "directions": [
        "In a bowl wash rice well in several changes of cold water until water is clear. Soak rice in cold water to cover overnight.",
        "Drain rice well in a sieve. Set sieve over a large deep saucepan of simmering water (sieve should not touch water) and steam rice, covered with a kitchen towel and a lid, 30 to 40 minutes, or until tender (check water level in pan occasionally, adding more water if necessary).",
        "While rice is cooking, in a small saucepan bring 1 cup coconut milk to a boil with 1/3 cup sugar and salt, stirring until sugar is dissolved, and remove from heat. Keep mixture warm.",
        "Transfer cooked rice to a bowl and stir in coconut-milk mixture. Let rice stand, covered, 30 minutes, or until coconut-milk mixture is absorbed. Rice may be prepared up to this point 2 hours ahead and kept covered at room temperature.",
        "While rice is standing, in cleaned small pan slowly boil remaining 1/3 cup coconut milk with remaining 3 tablespoons sugar, stirring occasionally, 1 minute. Transfer sauce to a small bowl and chill until cool and thickened slightly.",
        "To serve, mold 1/4 cup servings of sticky rice on dessert plates. Drizzle desserts with sauce and sprinkle with sesame seeds. Divide mango slices among plates."
    ],
    "ingredients": [
        "1 1/2 cups glutinous (sweet) rice",
        "1 1/3 cups well-stirred canned unsweetened coconut milk",
        "1/3 cup plus 3 tablespoons sugar",
        "1/4 teaspoon salt",
        "1 tablespoon sesame seeds, toasted lightly",
        "1 large mango, peeled, pitted, and cut into thin slices (at least 24)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Rice",
        "Dessert",
        "Coconut",
        "Mango",
        "Gourmet",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sticky Rice with Mango",
    "url": "http://www.epicurious.com/recipes/food/views/sticky-rice-with-mango-12066"
}
