{
    "directions": [
        "Place the dates and baking soda in a bowl, and pour 1 cup boiling water over them. Let them sit for 1 hour, and then strain the dates (reserve the water). Purée them in a food processor, pour the liquid in, and pulse to combine.",
        "Preheat the oven to 350°F.",
        "Prepare a 9-inch springform pan by spreading butter on the inside surfaces, lining the bottom with parchment paper, and buttering the parchment.",
        "Sift the flour and baking powder together. Stir in the salt.",
        "In a stand mixer fitted with the paddle attachment, cream the butter and sugars at medium-high speed for 4 to 5 minutes, until light and fluffy. Add the eggs, and beat until fluffy again. Add the date purée and the flour mixture, alternating, to the butter mixture, and combine well.",
        "Pour the batter into the prepared pan. Bake for 35 minutes, until the pudding is dark brown. Immediately after removing the pudding from the oven, pour 1/2 cup of toffee sauce over the top. Let the pudding rest for 15 minutes before serving.",
        "While the pudding is baking, cut the stem and blossom ends from the blood oranges. Place the oranges cut-side down on a cutting board. Following the contour of the fruit with your knife, remove the peel and cottony white pith, working from top to bottom, and rotating the fruit as you go. Slice each orange into 8 to 10 pinwheels.",
        "Peel the tangerines, separate them into segments, and remove all the white veins, or pith. Slice the kumquats into pinwheels. Chill the fruit until you are ready to serve.",
        "Using a stand mixer fitted with the whisk attachment (or by hand), whip the cream and crème fraîche together to soft peaks.",
        "Slice six pieces of warm pudding (the pudding serves twelve) and place them on six dessert plates. Spoon the rest of the warm toffee sauce over the slices. On each plate, dollop a heaping tablespoon of the whipped crème fraîche next to each piece and arrange the citrus evenly over and around the pudding. Scatter the kumquats in a beautiful natural style."
    ],
    "ingredients": [
        "1/2 pound whole Medjool dates, pitted and chopped",
        "1 teaspoon baking soda",
        "8 tablespoons (1 stick) unsalted butter, softened, plus more for the pan",
        "1 3/4 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon kosher salt",
        "1 cup dark-brown sugar",
        "1/4 cup granulated sugar",
        "2 extra-large eggs",
        "1 recipe Toffee Sauce",
        "3 blood oranges",
        "2 tangerines",
        "6 kumquats",
        "1 cup heavy cream",
        "2 tablespoons crème fraîche"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Citrus",
        "Dessert",
        "Bake",
        "Orange",
        "Date",
        "Winter",
        "Tangerine",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sticky Toffee Pudding with Blood Orange, Tangerine, and Whipped Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/sticky-toffee-pudding-with-blood-orange-tangerine-and-whipped-creme-fraiche-51204810"
}
