{
    "directions": [
        "Arrange bread cubes in single layer on rimmed baking sheet. Let stand at room temperature to dry overnight.",
        "Butter 13x9x2-inch glass baking dish. Transfer bread cubes to prepared dish. Mix dates and almonds in medium bowl. Sprinkle date mixture over bread and toss to distribute evenly. Using electric mixer, beat eggs and egg yolks in large bowl until frothy. Add 1 cup sugar and beat until mixture thickens and is pale yellow, about 5 minutes. Add half and half, vanilla, and nutmeg; beat just until blended. (Bread mixture and custard can be prepared 2 hours ahead. Let bread mixture stand uncovered at room temperature. Chill custard; rewhisk before continuing.)",
        "Preheat oven to 375°F. Pour custard over bread mixture, then press lightly on bread with rubber spatula to submerge. Let stand 15 minutes, occasionally pressing lightly on bread to submerge.",
        "Bake bread pudding 25 minutes. Using large spoon, press bread down, allowing custard in dish to rise to surface. Spoon custard evenly over bread mixture. Continue to bake pudding until knife inserted into center of custard comes out clean, about 20 minutes longer.",
        "Remove bread pudding from oven and let stand 10 minutes. Sprinkle with powdered sugar. Serve warm with warm or chilled Amaretto Zabaglione."
    ],
    "ingredients": [
        "8 cups 1 1/2-inch cubes egg bread with crust (from one 16-ounce loaf)",
        "2 1/4 cups chopped pitted Medjool dates (about 12 ounces)",
        "1/2 cup sliced almonds",
        "6 large eggs",
        "2 large egg yolks",
        "1 cup baker's sugar (superfine sugar) or regular sugar",
        "3 1/2 cups half and half",
        "1 tablespoon vanilla extract",
        "1/4 teaspoon (generous) ground nutmeg",
        "Powdered sugar",
        "Amaretto Zabaglione"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Quick & Easy",
        "Date",
        "Almond",
        "Vanilla",
        "Amaretto",
        "Nutmeg",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sticky Date and Almond Bread Pudding with Amaretto Zabaglione",
    "url": "http://www.epicurious.com/recipes/food/views/sticky-date-and-almond-bread-pudding-with-amaretto-zabaglione-234166"
}
