{
    "directions": [
        "Preheat oven to 375°F. and butter and flour an 8-inch square baking pan (2 inches deep), knocking out excess flour.",
        "Coarsely chop dates and in a 1 1/2- to 2-quart saucepan simmer dates in water, uncovered, 5 minutes. Remove pan from heat and stir in baking soda. (Mixture will foam.) Let mixture stand 20 minutes.",
        "While mixture is standing, into a bowl sift together flour, baking powder, ginger, and salt. In a large bowl with an electric mixer beat together butter and sugar until light and fluffy. Beat in eggs 1 at a time, beating well after each addition. Add flour mixture in 3 batches, beating after each addition until just combined. Add date mixture and with a wooden spoon stir batter until just combined well.",
        "Pour batter into baking pan and set pan in a larger baking pan. Add enough hot water to larger pan to reach halfway up sides of smaller pan and bake in middle of oven until a tester comes out clean, 35 to 40 minutes. Remove smaller pan from water bath and cool pudding to warm on a rack.",
        "In a 1 1/2- to 2-quart heavy saucepan melt butter over moderate heat and add brown sugar. Bring mixture to a boil, stirring occasionally, and stir in cream and vanilla. Simmer sauce, stirring occasionally, until thickened slightly, about 5 minutes. Cool sauce to warm.",
        "Cut warm pudding into squares. Serve pudding with ice cream and warm sauce."
    ],
    "ingredients": [
        "1 3/4 cups packed pitted dates (about 10 ounces)",
        "2 cups water",
        "1 1/2 teaspoons baking soda",
        "2 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon salt",
        "3/4 stick (6 tablespoons) unsalted butter, softened",
        "1 cup granulated sugar",
        "3 large eggs",
        "1 3/4 sticks (3/4 cup plus 2 tablespoons) unsalted butter",
        "1 1/2 cups packed light brown sugar",
        "1 cup heavy cream",
        "1/2 teaspoon vanilla",
        "Accompaniment: vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Date",
        "Vanilla",
        "Fall",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sticky Date Pudding with Toffee Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/sticky-date-pudding-with-toffee-sauce-15100"
}
