{
    "directions": [
        "Preheat the oven to 350 degrees F. Butter a 9-by-13-inch baking dish.",
        "For the pudding: In a small saucepan, combine the dates, rum and 3/4 cup water. Bring the liquid to a boil, reduce to a simmer and simmer for 5 to 7 minutes. Remove the pan from the heat and add the vanilla extract. Let the liquid cool, and then puree the dates with their liquid in a food processor. Reserve.",
        "Sift together the flour, baking powder, cinnamon and salt.",
        "Combine the brown sugar and butter in a large mixing bowl using a handheld mixer on medium-high speed. Beat the butter and sugar together until they are a homogeneous mixture. Beat in the eggs one at a time. Gently mix in the flour mixture in thirds over a low speed. Stir in the date puree.",
        "Transfer the batter to the prepared baking dish and bake in the oven for 35 minutes.",
        "For the toffee sauce: Make this while the pudding is baking. Combine the butter, sugar, brandy and 1/4 cup water in a medium saucepan. Bring the mixture to a simmer, whisking frequently. Cook the sauce until it thickens to a sauce consistency, about 15 minutes.",
        "To finish the pudding: Remove the pudding from the oven and let cool for about 10 minutes. Using a skewer or chopstick, poke holes in the pudding about every inch or so.",
        "Pour half the toffee sauce over the cake and let it soak in for at least 20 minutes.",
        "Serve the pudding in a warm pool of the remaining sauce. Garnish with whipped cream if desired."
    ],
    "ingredients": [
        "1 1/2 cups brown sugar",
        "1/2 cup brandy",
        "Heavy cream, whipped, for topping, optional",
        "2 cups pitted dates",
        "3/4 cup dark spiced rum",
        "1 teaspoon vanilla extract",
        "3 1/2 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1/2 teaspoon ground cinnamon",
        "Pinch salt",
        "2 cups brown sugar",
        "1 stick butter, at room temperature, plus extra for baking dish",
        "3 eggs, separated",
        "3 sticks butter"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Baking",
        "Sauce Recipes",
        "Pudding Recipes",
        "Fruit",
        "Holiday"
    ],
    "title": "Sticky Toffee Pudding",
    "url": "http://www.foodnetwork.com/recipes/anne-burrell/sticky-toffee-pudding-recipe0"
}
