{
    "directions": [
        "Butter a 9 by 13-inch baking pan.",
        "Combine the sugar, butter, honey, orange juice and zest in a saucepan and bring to a boil; boil until slightly thickened. Pour the glaze into the prepared pan, and scatter the nuts over the top.",
        "Sprinkle yeast over warm milk with a pinch of the granulated sugar; set aside until foamy, about 5 minutes. Melt 1/4 cup butter and whisk into yeast with vanilla and egg yolk.",
        "Whisk the flour, 1/4 cup sugar, and salt in a large bowl. Stir in yeast mixture to make a sticky dough. Knead the dough on a floured work surface until soft and elastic, 6 to 8 minutes. (Dough will be soft and elastic, but not terribly sticky.) Shape into a ball, brush with a little melted butter and put into a large bowl. Cover with plastic wrap and let rise until doubled, about 1 hour.",
        "Knead the dough and reform into a ball. Return to the bowl, cover with buttered plastic wrap and refrigerate for 4 hours.",
        "Roll the dough into 10 by 18-inch rectangle with a long edge facing you. Spread soft butter over the surface. Whisk 1/3 cup sugar and cinnamon together, scatter over butter. Roll into a long tight cylinder; pinch long edge to seal. Cut into 1 1/2-inch rolls with string or dental floss. Evenly space the rolls in the pan. Cover and let rise, at room temperature, until doubled, about 1 1/2 hours.",
        "Preheat the oven to 350 degrees F.",
        "Bake until golden, 30 to 35 minutes. Rest at room temperature 10 minutes, unmold, and serve warm."
    ],
    "ingredients": [
        "Softened butter, for bowls and baking pan",
        "1 cup light muscavado sugar",
        "4 tablespoons unsalted butter",
        "1/3 cup honey",
        "1/4 cup freshly squeezed orange juice",
        "1 orange, zest finely grated",
        "1 cup sliced almonds, lightly toasted",
        "1 package yeast",
        "1 cup warm milk (about 110 degrees F)",
        "1/4 cup granulated sugar, plus a pinch",
        "1/4 cup unsalted butter",
        "1 1/2 teaspoon pure vanilla extract",
        "1 large egg yolk",
        "2 3/4 cups all-purpose flour",
        "1/4 cup sugar",
        "3/4 teaspoon salt",
        "For the filling:",
        "8 tablespoons softened butter",
        "1/3 granulated sugar",
        "1 tablespoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Bread",
        "Sugar",
        "Nut Recipes",
        "Dairy Recipes"
    ],
    "title": "Sticky Buns",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/sticky-buns-recipe"
}
