{
    "directions": [
        "Cover rice with cold water by 1 inch in a bowl and soak at least 4 and up to 12 hours.",
        "After rice has soaked at least 3 hours, fill wok with enough water for bottom rim of steamer (not rack) to rest in water, then bring to a boil.",
        "Put scallops and rice wine in a small heatproof bowl. Put bowl with scallops in bottom tier of steamer and steam, covered, until soft, about 2 hours. (Replenish water as necessary to keep bottom rim of steamer in water to prevent scorching.)",
        "When scallops have steamed for almost 1 hour, line bottom and side of top tier of steamer with several layers of cheesecloth, then set tier onto steamer in wok.",
        "Drain rice in a sieve and rinse well under cold running water, then spread rice in an even layer over cheesecloth in steamer (cheesecloth should not hang over edge of steamer) and steam, covered, sprinkling rice with a few drops of water occasionally, 1 hour. (Replenish water as necessary to keep bottom rim of steamer in water to prevent scorching.)",
        "Meanwhile, soak mushrooms in 2 cups boiling-hot water in a bowl (water should cover mushrooms), turning mushrooms over occasionally, until softened, about 30 minutes. Cut out and discard stems from mushrooms, then squeeze excess liquid from caps into bowl and thinly slice caps. Reserve 1/2 cup mushroom- soaking liquid and discard remainder.",
        "Remove top tier of steamer from wok and transfer rice from cheesecloth to a platter. Once rice has cooled, lightly wet your hands and break up large clumps.",
        "Using tongs, remove bowl containing scallops from bottom tier of steamer. Reserve water in wok.",
        "Reserve scallop-soaking liquid and shred scallops into \"threads\" with a fork or your fingers, discarding tough muscle on side (muscle will remain solid but scallop meat will shred easily).",
        "Bring water in wok to a boil, then arrange sausages on a heatproof plate and steam in steamer, covered, 5 minutes. When cool enough to handle, halve sausages lengthwise, then cut diagonally into 1/4-inch-thick slices.",
        "Cut scallions into 1/4-inch-thick slices, keeping pale green and white parts separate from dark green parts.",
        "Stir together oyster sauce, soy sauce, sugar, and salt in a bowl until sugar is dissolved.",
        "Pour off water from wok and dry. Heat wok over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Pour peanut oil down side of wok, then swirl oil, tilting wok to coat sides. Add mushrooms and pale green and white parts of scallions and stir-fry 1 minute. Add sausage and scallops and stir-fry 1 minute. Add rice and stir-fry, breaking up any clumps, 1 minute. Add scallop- and mushroom-soaking liquids along with oyster sauce mixture and stir-fry until rice is well coated and hot, about 2 minutes. Add sesame oil, then add pepper and remaining scallion greens and stir-fry until combined well."
    ],
    "ingredients": [
        "2 1/2 cups Chinese or Japanese short-grain sticky (\"sweet\") rice",
        "6 to 8 (1-inch-wide) large dried scallops",
        "1/2 cup Chinese rice wine such as Shaoxing or medium-dry Sherry",
        "12 to 15 Chinese dried black mushrooms",
        "4 links Cantonese sweet sausage",
        "2 bunches of scallions",
        "1/4 cup oyster sauce (preferably premium)",
        "2 tablespoons light soy sauce",
        "1 tablespoon sugar",
        "1 teaspoon kosher salt",
        "1/4 cup peanut oil",
        "2 tablespoons Asian sesame oil",
        "2 teaspoons black pepper",
        "Special equipment: a well-seasoned 14-inch wok, preferably flat-bottomed; a 10-inch bamboo steamer with 2 tiers; cheesecloth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Pork",
        "Rice",
        "Shellfish",
        "Side",
        "Steam",
        "Stir-Fry",
        "Sausage",
        "Scallop",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Tree Nut Free"
    ],
    "title": "Sticky Rice with Chinese Sausage and Dried Scallops",
    "url": "http://www.epicurious.com/recipes/food/views/sticky-rice-with-chinese-sausage-and-dried-scallops-231372"
}
