{
    "directions": [
        "Mix milk, yeast, and sugar in a standing electric mixer fitted with whisk attachment until combined well. Let stand until foamy, about 5 minutes.",
        "Add butter, eggs, salt, and 3 cups flour and beat until smooth. Fit mixer with dough-hook attachment and, with mixer on medium-high speed, gradually knead in remaining 3 1/2 cups flour, occasionally scraping down side of bowl with a rubber spatula, until dough is smooth and elastic, about 6 minutes.",
        "Transfer dough to a large oiled bowl, turning to coat, and cover with plastic wrap. Let dough rise in a warm place until almost doubled in bulk, about 1 1/2 hours.",
        "Stir together walnuts, sugars, and cinnamon.",
        "Punch down dough, then halve it. Pat each piece into a flat rectangle and cover 1 piece with plastic wrap. Roll out remaining dough on a lightly floured surface with a lightly floured rolling pin into a 17- by 13-inch rectangle (about 1/4 inch thick). Brush top with half of melted butter and sprinkle evenly with half of filling and raisins. Roll up, beginning with a short side, to form a 13-inch log and press seam to seal. Cut log crosswise into 6 pieces and arrange, cut sides up, in 2 rows of 3 buns in half of a buttered 13- by 9- by 2-inch metal baking pan. Make 6 more buns in same manner and let buns rise 30 minutes. Preheat oven to 350°F.",
        "Bake buns in middle of oven until golden brown, about 40 to 45 minutes.",
        "Beat together glaze ingredients with an electric mixer until smooth.",
        "Cool buns in pan on a rack 15 minutes, then spoon glaze evenly over warm buns."
    ],
    "ingredients": [
        "1 2/3 cups warm milk (105°F)",
        "4 1/2 teaspoons active dry yeast (2 packages, 1/4 ounces each)",
        "3 tablespoons granulated sugar",
        "1 stick unsalted butter, softened",
        "2 large eggs",
        "1 tablespoon salt",
        "6 1/2 cups all-purpose flour",
        "1 cup walnuts (4 ounces), finely chopped",
        "3/4 cup granulated sugar",
        "1/2 cup packed light brown sugar",
        "1 tablespoon cinnamon",
        "3 tablespoons unsalted butter, melted",
        "2 cups golden raisins",
        "2 ounces cream cheese, softened",
        "2 1/2 cups confectioners sugar, sifted",
        "3 tablespoons fresh orange juice",
        "1/2 teaspoon vanilla"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Nut",
        "Breakfast",
        "Brunch",
        "Bake",
        "Walnut",
        "Winter",
        "Gourmet"
    ],
    "title": "Sticky Buns",
    "url": "http://www.epicurious.com/recipes/food/views/sticky-buns-103064"
}
