{
    "directions": [
        "Roll half the dough into a 1/8-inch thick rectangle on a floured surface, fit it into a 14 x 4 1/2-inch rectangle flan form set on a baking sheet, and fold the edges inward, crimping them decoratively. Make another shell with the remaining dough in the same manner. (Alternatively, the shells may be made in two 9-inch tart pans with removable fluted rims.) Sprinkle the ground walnuts evenly in the pie shells and press them gently into the dough. Prick the bottoms of the shells lightly with a fork and chill the shells for 30 minutes. Line the shells with foil, fill the foil with the rice, and bake the shells in the lower third of a preheated 425°F. oven for 10 minutes. Remove the rice and foil carefully, bake the shells for 5 to 6 minutes more, or until they are golden, and let them cool on the baking sheets on the racks.",
        "In a saucepan combine the half-and-half and the Stilton, bring the liquid to a simmer, and stir the mixture and the eggs, divide the mixture between the shells, and bake the tarts in the middle of a preheated 375°F. oven for 30 to 35 minutes, or until a knife inserted in the custard 1/2 inch from the edge comes out clean. (The custard may not be fully set in the center but will continue to cook after the tarts are removed from the oven.)",
        "Let the tarts cool to room temperature and remove the flan forms carefully. Transfer the tarts to platters, garnish them with the walnut halves, and garnish the platters with the watercress. To serve the tarts halve them lengthwise and cut them crosswise into sevenths."
    ],
    "ingredients": [
        "2 recipes Cream Cheese Pastry Dough",
        "2/3 cup walnuts, ground, plus 14 lightly toasted walnut halves for garnish",
        "walnut halves",
        "raw rice for weighing the shells",
        "1 1/4 cups half-and-half",
        "6 ounces Stilton, crumbled",
        "3 large eggs",
        "watercress sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Nut",
        "Bake",
        "Cocktail Party",
        "Blue Cheese",
        "Walnut",
        "Shower",
        "Engagement Party",
        "Gourmet"
    ],
    "title": "Stilton Walnut Tarts",
    "url": "http://www.epicurious.com/recipes/food/views/stilton-walnut-tarts-101584"
}
