{
    "directions": [
        "Soak the black beans in the wine. Meanwhile, put a large, deep skillet over high heat. Add half the oil, swirl it around, and immediately add half the garlic and ginger. Cook for 15 seconds, stirring, then add the onion. Raise the heat to high and cook, stirring occasionally, until the onion becomes soft, about 5 minutes. Remove the onion.",
        "Still over high heat, add the remaining oil to the pan, then the remaining garlic and ginger. Stir, add the chicken, stir again, then let it sit for 1 minute before stirring again. Cook, stirring occasionally, until the chicken has lost its pink color, 3 to 5 minutes.",
        "Turn the heat down to medium, add the scallion, and toss. Return the onion to the pan and add the sugar if you’re using it and the soy sauce. Toss again, sprinkle with salt and pepper, then add the beans with their liquid and the stock. Raise the heat to high and cook, stir-ring and scraping the bottom of the pan, until the liquid is reduced slightly and you’ve scraped up all the bits of chicken, about a minute. Turn off the heat, drizzle on the sesame oil, garnish with scallion, and serve.",
        "You can throw almost anything you like into a stir-fry, but these are some of my favorites; some require a trip to an Asian market, but many will be in your pantry.",
        "1. Add 1 tablespoon or more of bottled hoisin, plum, oyster, or ground bean sauce with the soy sauce.",
        "2. Add 1/4 teaspoon or more Vietnamese-style chile paste, chile and black bean paste, or chile-garlic paste with the liquid.",
        "3. Add 1 teaspoon dark sesame oil with the soy sauce. A tablespoon or so of toasted sesame seeds is also good, alone or with the oil.",
        "4. Toss the chicken chunks with 1 tablespoon curry powder or five-spice powder.",
        "5. Toss in 1/2 to 1 cup raw or roasted cashews or peanuts when you return the vegetables to the pan.",
        "6. Omit the stock or water and add 1/2 to 1 cup coconut milk along with the soy sauce.",
        "7. Add 1 cup chopped fresh tomato when you return the vegetable to the pan.",
        "8. Replace half the soy sauce with nam pla (Thai fish sauce) or freshly squeezed lime juice or vinegar.",
        "9. Add 1 cup mung bean sprouts when you return the vegetables to the pan.",
        "10. Add 1/2 cup chopped shallot with the chicken.",
        "11. Use snow peas, mushrooms, or other quick-cooking vegetables, alone or in combination, in addition to or in place of other vegetables.",
        "12. Stir in 1/4 cup cooked grains (like barley, wheat berries, buckwheat, or quinoa) when you return the vegetables to the pan."
    ],
    "ingredients": [
        "2 tablespoons fermented black beans",
        "2 tablespoons rice wine, dry sherry, or white wine",
        "1/4 cup peanut or neutral oil, like grapeseed or corn",
        "2 tablespoons minced garlic",
        "1 tablespoon grated fresh ginger",
        "1 cup sliced onion",
        "1 pound boneless, skinless chicken breast or thighs, cut into 1/2- to 3/4-inch chunks or thin slices and blotted dry",
        "1/4 cup chopped scallion, plus more for garnish",
        "1 teaspoon sugar (optional)",
        "2 tablespoons soy sauce",
        "Salt and freshly ground black pepper",
        "1/4 cup chicken or vegetable stock, white wine, or water",
        "1 tablespoon dark sesame oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Stir-Fry",
        "Dinner",
        "Quick & Easy",
        "Quick and Healthy",
        "Chicken",
        "Bean",
        "Garlic",
        "Ginger",
        "Green Onion/Scallion",
        "Sesame Oil"
    ],
    "title": "Stir-Fried Chicken With Black Beans",
    "url": "http://www.epicurious.com/recipes/food/views/stir-fried-chicken-with-black-beans"
}
