{
    "directions": [
        "1. Mix the sauce ingredients together and set aside.",
        "2. Bring a pot of water to boil for the noodles and tofu. Reduce it to a simmer, add the cubed tofu and simmer gently for 4 minutes. Lift out the tofu with a strainer and set aside. Return the water to a boil, add the noodles and cook until tender-firm, following the package directions. Drain and rinse under cold water. Toss with 1 tablespoon of the oil and set aside.",
        "3. Set a wok or skillet over high heat. Add the remaining oil, swirl it around. When hot, add the ginger, garlic, chile, and baked tofu. Stir-fry around. When hot, add the ginger, garlic, chile, and baked tofu. Stir-fry for 1 minute, then add onion, mushrooms, broccoli, bell pepper, and carrots. Season with a few pinches of salt and stir-fry, rapidly tossing the vegetables in their pan, for 3 minutes.",
        "4. Now add the snow peas, scallions, and boiled tofu. Stir-fry for 1 minute more, then add the noodles and the sauce. Reduce the heat, toss so that everything is evenly mingled, then cover and cook until the noodles are heated through, a matter of just a few minutes. Turn onto a large platter and garnish with sprigs of cilantro."
    ],
    "ingredients": [
        "2 tablespoons soy sauce",
        "2 tablespoons tamari",
        "3 tablespoons hoisin or oyster sauce",
        "1/4 cup stock or water",
        "1 tablespoon rice wine or sherry",
        "2 teaspoons sugar",
        "1/4 cup coarsely chopped cilantro plus long, pretty sprigs for garnish",
        "One 8- to 10-ounce package Chinese wide-cut egg noodles",
        "1 carton firm tofu, drained and cut into large cubes",
        "2 1/2 tablespoons roasted peanut oil",
        "1 heaping tablespoon chopped ginger",
        "1 heaping tablespoon chopped garlic",
        "1 jalapeño chile, seeded and diced",
        "2 chunks baked tofu, thinly sliced",
        "1 onion, thinly sliced",
        "6 shiitake mushrooms, stems discarded, thinly sliced",
        "1 large broccoli, the head cut into florets, the stem peeled and sliced",
        "1 red or yellow bell pepper, cut into narrow strips, then halved",
        "2 carrots, peeled and thinly sliced",
        "Salt",
        "4 ounces snow peas, trimmed",
        "1 bunch scallions, including the firm greens, cut into 1-inch lengths"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Stir-Fry",
        "Dinner",
        "Tofu",
        "Broccoli",
        "Bell Pepper",
        "Noodle",
        "Dairy Free",
        "Tree Nut Free"
    ],
    "title": "Stir-Fried Noodles with Fresh and Baked Tofu",
    "url": "http://www.epicurious.com/recipes/food/views/stir-fried-noodles-with-fresh-and-baked-tofu-355881"
}
