{
    "directions": [
        "Trim off and discard any silver skin from pork (do not trim fat). Cut pork across grain into 1/4-inch-thick slices, then toss with 1 tablespoon soy sauce, 2 teaspoons cornstarch, and 1 tablespoon sugar in a bowl.",
        "Stir together vinegar, salt, remaining 1 1/2 tablespoons soy sauce, and remaining 1/2 tablespoon sugar in a small bowl.",
        "Stir together water and remaining 2 teaspoons cornstarch in a cup.",
        "Rinse cabbage in a large colander. Tap colander lightly, then transfer cabbage to a large bowl with water still clinging to leaves.",
        "Heat 1 tablespoon oil in a 12-inch nonstick skillet over high heat until hot but not smoking, then add pork in 1 layer as quickly as possible. Cook, undisturbed, until pork begins to brown, about 3 minutes, then turn over and cook, undisturbed, until browned but still pink in center, about 1 minute more. Transfer pork and any juices to a plate. Do not clean skillet.",
        "Heat remaining tablespoon oil in skillet over moderately high heat until hot but not smoking, then stir-fry garlic and ginger 30 seconds. Add half of cabbage and stir-fry over high heat until cabbage is wilted, 2 to 3 minutes. Stir in remaining cabbage (skillet will be very full), along with any water in bowl, and soy sauce mixture, then cook, covered, stirring occasionally, until all of cabbage is tender, 4 to 5 minutes.",
        "Add pork, along with any juices accumulated on plate, and bring to a boil. Stir cornstarch mixture, then pour into skillet and boil, stirring, until sauce is slightly thickened, about 1 minute. Season with salt, then serve sprinkled with cilantro."
    ],
    "ingredients": [
        "1 (1-lb) pork tenderloin",
        "2 1/2 tablespoons soy sauce",
        "4 teaspoons cornstarch",
        "1 1/2 tablespoons sugar",
        "2 tablespoons rice vinegar (not seasoned)",
        "1/2 teaspoon salt",
        "2 tablespoons water",
        "2 lb Napa cabbage, quartered lengthwise, cored, and cut crosswise into 1 1/2-inch pieces (10 cups)",
        "2 tablespoons vegetable oil",
        "1 tablespoon finely chopped garlic",
        "1 tablespoon finely chopped peeled fresh ginger",
        "1/4 cup loosely packed fresh cilantro leaves",
        "Accompaniment: rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Stir-Fry",
        "Quick & Easy",
        "Cabbage",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Stir-Fried Pork with Napa Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/stir-fried-pork-with-napa-cabbage-232797"
}
