{
    "directions": [
        "Combine the oil, yellow split peas, and mustard seeds, if using, in a large wok, kadai, or frying pan over medium-high heat. Cook, stirring, until the split peas turn golden brown. 1 to 2 minutes. (Cover if using mustard seeds—they pop and splatter—and cook until you hear them crackle.)",
        "Add the urad dal, chiles, curry leaves, if using, and cumin and cook uncovered, stirring, 1 more minute. (Stand back if using curry leaves; they spit when they hit the oil.)",
        "Add the asafoetida, if using, and 1/4 cup of the coconut and cook, stirring, 30 seconds. Add the beans and salt and cook, stirring, 5 minutes.",
        "Add the remaining 1/4 cup coconut, the saambhar or rasam powder, if using, and the water. Bring to a simmer, cover, and cook until the beans are tender, about 10 minutes.",
        "Uncover and cook, stirring often, until all of the water has evaporated, about 5 more minutes. Taste for salt and serve hot."
    ],
    "ingredients": [
        "3 tablespoons canola oil",
        "2 teaspoons yellow split peas",
        "1 tablespoon black mustard seeds (optional)",
        "1 teaspoon hulled black gram beans (urad dal; optional)",
        "3 whole dried red chiles",
        "8 fresh or 12 frozen curry leaves, torn into pieces (optional)",
        "1 teaspoon cumin seeds",
        "1/8 teaspoon asafoetida powder (optional)",
        "1/2 cup unsweetened shredded coconut",
        "3/4 pound green beans, both ends trimmed, beans cut on an angle into 1-inch pieces",
        "1 teaspoon salt, or to taste",
        "1/2 teaspoon saambhar powder or rasam powder (optional)",
        "1 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Side",
        "Vegetarian",
        "Vegan",
        "Wheat/Gluten-Free",
        "Green Bean",
        "Pea",
        "Coconut",
        "Chile Pepper",
        "Hot Pepper"
    ],
    "title": "Stir-Fried Green Beans With Coconut",
    "url": "http://www.epicurious.com/recipes/food/views/stir-fried-green-beans-with-coconut"
}
