{
    "directions": [
        "In a small bowl stir together the soy sauce, the sugar, and the salt, add the beef, and let it marinate for 20 minutes.",
        "In a small bowl dissolve the cornstarch in the soy sauce and stir in the Sherry, the broth, the sugar, and the sesame oil.",
        "Heat a wok or large heavy skillet over high heat until it is hot, add 2 tablespoons of the vegetable oil, and heat it until it just begins to smoke. Stir-fry the beef in the oil in batches for 1 minute, or until it is no longer pink, and transfer it as it is cooked with a slotted spoon to a plate. Add the remaining 1 tablespoon vegetable oil to the wok, heat it until it is hot but not smoking, and in the oil stir-fry the gingerroot, the garlic, and the chili for 30 seconds, or until the mixture is fragrant. Add the broccoli and stir-fry the mixture for 1 minute. Add 1/3 cup water and steam the broccoli, covered, for 1 1/2 to 2 minutes, or until it is crisp-tender. Stir the sauce, add it to the wok with the beef and any juices that have accumulated on the plate, and cook the mixture, stirring, for 2 minutes, or until the sauce is thickened and the beef is heated through. Transfer the mixture to a heated platter and serve it with the rice."
    ],
    "ingredients": [
        "2 teaspoons soy sauce",
        "1/4 teaspoon sugar",
        "1/4 teaspoon salt",
        "3/4 pound boneless sirloin, cut across the grain into 1/4-inch-thick slices",
        "1 tablespoon cornstarch",
        "1 tablespoon soy sauce",
        "1 tablespoon medium-dry Sherry or Scotch",
        "1/4 cup chicken or beef broth or water",
        "1 teaspoon sugar",
        "2 teaspoons Oriental sesame oil",
        "3 tablespoons vegetable oil",
        "1 tablespoon minced peeled fresh gingerroot",
        "1 tablespoon minced garlic",
        "a 4-inch fresh red chili, seeded and minced (wear rubber gloves) or 1/2 tablespoon dried hot red  pepper flakes",
        "1 pound broccoli, cut into flowerets and the stems peeled and cut into 1/2-inch-thick",
        "cooked rice as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Beef",
        "Garlic",
        "Ginger",
        "Marinate",
        "Stir-Fry",
        "Quick & Easy",
        "High Fiber",
        "Broccoli",
        "Gourmet"
    ],
    "title": "Stir-Fried Beef and Broccoli",
    "url": "http://www.epicurious.com/recipes/food/views/stir-fried-beef-and-broccoli-13212"
}
