{
    "directions": [
        "Using a sharp knife, cut the beef across the grain into thin slices, then cut the slices into matchsticks. In a bowl, whisk together the sesame oil, soy sauce, the 1/4 cup peanut oil and the ginger. Add the beef and stir to coat evenly. Cover and refrigerate, stirring occasionally, for at least 1 hour or up to 3 hours.",
        "Bring a large pot of water to a rapid boil over high heat. Add the salt and noodles, stir well and cook, stirring occasionally, until just tender, 5 to 7 minutes. Drain the noodles.",
        "Meanwhile, in a wok or large fry pan over medium-high heat, warm the 1 Tbs. peanut oil. Add the garlic and green onions and stir-fry until lightly colored, about 1 minute. Increase the heat to high, add the beef and its marinade and stir-fry until lightly browned, about 8 minutes. Add the cabbage and 1 1/2 cups of the broth and toss to combine. Cover, reduce the heat to medium-high and cook until the cabbage wilts, about 4 minutes.",
        "In a small bowl, whisk the cornstarch into the remaining 1/2 cup broth. Add the cornstarch mixture to the wok and stir and toss to incorporate. Add the snow peas and stir and toss to combine. Cover and cook until just tender, about 2 minutes. Take care not to overcook; the snow peas and cabbage should remain crisp.",
        "Add the noodles to the wok and stir and toss until well combined. Garnish with the sesame seeds and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "One Pot of the Day",
        ", by Kate McMillan (Weldon Owen, 2012)."
    ],
    "ingredients": [
        "1 lb. boneless beef sirloin or tenderloin, partially frozen",
        "1/4 cup toasted sesame oil",
        "1/4 cup soy sauce",
        "1/4 cup plus 1 Tbs. peanut oil",
        "2 Tbs. peeled and grated fresh ginger",
        "2 Tbs. salt",
        "3/4 lb. dried soba noodles",
        "2 large garlic cloves, minced",
        "4 green onions, including 3 inches of the green tops, thinly sliced on the diagonal",
        "1 head napa cabbage, about 2 lb., cored and shredded",
        "2 cups chicken or beef broth",
        "1 Tbs. cornstarch",
        "1/2 lb. snow peas, trimmed and halved crosswise",
        "1/4 cup sesame seeds, lightly toasted"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Stir-Fried Soba Noodles with Beef and Cabbage",
    "url": "http://www.williams-sonoma.com/recipe/stir-fried-soba-noodles-with-beef-and-cabbage.html"
}
