{
    "directions": [
        "In a small bowl stir together the water, 1 tablespoon of the vinegar, the soy sauce, the sesame oil, the sugar, and a pinch of salt. In a bowl toss the shrimp with the garlic paste and 1 teaspoon of the olive oil and let the shrimp marinate for 10 minutes. In a non-stick skillet heat 2 teaspoons of the remaining olive oil over moderately high heat until it is hot but not smoking and in it sauté the walnuts, stirring, for 30 seconds. Add the snow peas, sauté the mixture, stirring, for 45 seconds, or until the snow peas are crisp-tender, and transfer it to a bowl. In the skillet sauté the shrimp for 1 minute on each side, add the soy sauce mixture, and simmer the shrimp, covered, for 1 minute, or until they are cooked through. Add the shrimp mixture to the snow pea mixture. In a large bowl toss the endive, sliced thin crosswise, and the watercress with the remaining 1 tablespoon olive oil, the remaining 1 teaspoon vinegar, and salt and pepper to taste, divide the greens between 2 dinner plates, and top them with the shrimp mixture."
    ],
    "ingredients": [
        "1 tablespoon water",
        "1 tablespoon plus 1 teaspoon white-wine vinegar",
        "1 teaspoon soy sauce",
        "1/2 teaspoon Oriental sesame oil",
        "a pinch of sugar",
        "12 medium shrimp (about 1/2 pound), shelled",
        "1 garlic clove, minced and mashed to a paste with 1/2 teaspoon salt",
        "2 tablespoons olive oil",
        "3 tablespoons coarsely chopped walnuts",
        "1/4 pound snow peas, trimmed",
        "1 large Belgian endive",
        "3 cups watercress sprigs, coarse stems discarded"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Nut",
        "Shellfish",
        "Vegetable",
        "Stir-Fry",
        "Quick & Easy",
        "Walnut",
        "Shrimp",
        "Healthy",
        "Endive",
        "Watercress",
        "Gourmet"
    ],
    "title": "Stir-Fried Shrimp, Snow Pea, and Walnut Salad",
    "url": "http://www.epicurious.com/recipes/food/views/stir-fried-shrimp-snow-pea-and-walnut-salad-11911"
}
