{
    "directions": [
        "1. Carefully inspect the greens, discarding or trimming off any spoiled stems or leaves. Trim the bottom ends off and discard. Wash the greens in several changes of the coldest possible water; tepid water might cause them to wilt, and you want them to stay as alert and perky as possible before being cooked. (Note: Because bok choi and baby bok choi tend to have pockets full of sand in the nooks where the leaves meet the center stem, be certain to pull the leaves back slightly away from the stem when you're cleaning them. There are few things worse than a mouthful of sand when you want a mouthful of greens.)",
        "2. Cut the cleaned greens into pieces 2-1/2 to 3 inches long. If any of the stems are particularly wide — say, more than 1 inch — or are tough or sinewy-looking, cut them in half lengthwise. If you're using baby bok choi or baby Shanghai choi, you can either leave the heads whole or cut them in half lengthwise — it's up to you. Spin the greens dry in a salad dryer or set them aside to air-dry on a kitchen towel or paper towels; they needn't be bone dry — a little dampness won't matter.",
        "3. In a wok, 12-inch skillet, Dutch oven, or soup pot (any pot large and wide enough to comfortably hold the greens will do), heat the oil over medium-high heat. When it's hot but not smoking — it should appear shimmery — add the garlic, the salt, and, if using, the chiles. Sauté, stirring until the garlic just begins to lose its rawness, about 1 minute. (Try not to let the garlic turn golden or golden brown, which would give this dish an inappropriate roasted taste.)",
        "4. Add the greens. Raise the heat slightly and immediately begin to vigorously stir-fry the greens around the pot. Continue to vigorously stir-fry the greens until they just begin to go limp but the leaves remain a spring-green color and the stems are still crunchy-crisp, 3 to 4 minutes, depending on the type of greens. Taste for salt, adding only a pinch more if necessary (a little salt goes a long way with greens).",
        "5. Transfer the cooked greens to a large serving platter and serve promptly. Be careful not to pile the greens in a small bowl; since the greens will continue to cook for a minute or two after they're removed from the heat, a serving bowl that crowds them may cause them to overcook and become mushy."
    ],
    "ingredients": [
        "1 medium-size bunch (about 13 ounces) tender Asian greens, such as bok choi, baby bok choi, baby Shanghai choi, choi sum, baby kai lan, or water spinach",
        "3 tablespoons peanut oil",
        "4 cloves garlic, peeled, bruised until juicy with a flat side of knife, and coarsely chopped into 3 or 4 chunks",
        "1/4 teaspoon salt",
        "1 to 2 fresh red Holland chiles or other hot fresh red long chiles, such as Fresno or cayenne, stemmed and sliced on the diagonal into thin pieces (optional, but the chiles add appealing color and gentle heat; see Cook's Note, below)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Leafy Green",
        "Side",
        "Stir-Fry",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Hot Pepper",
        "Bok Choy",
        "Sugar Conscious",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Stir-Fried Asian Greens with Chiles and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/stir-fried-asian-greens-with-chiles-and-garlic-237115"
}
