{
    "directions": [
        "Combine both vinegars in a medium bowl. Add shallots and let sit, tossing occasionally, 1 hour. Drain and pat dry.",
        "Meanwhile, cook bacon in a large skillet over medium heat, stirring occasionally, until most of fat is rendered and bacon begins to brown, 5–7 minutes. Transfer to paper towels. Pour off fat; reserve for another use (scrambled eggs!). Wipe out skillet; reserve.",
        "Fit a medium pot with thermometer and pour in oil to come 2\" up sides of pot. Heat over medium-high until thermometer registers 300°F. Whisk flour and cornmeal in a shallow bowl. Dredge shallots in flour mixture, shaking off excess. Fry, tossing occasionally, until golden and crisp, about 3 minutes. Transfer to paper towels; season with salt.",
        "Heat reserved skillet over medium-high. Swirl remaining 1 Tbsp. oil in pan to coat (this keeps food from sticking); pour out excess. The oil should be shimmering—if it’s not hot enough, the asparagus will steam not caramelize. Add asparagus, season with salt, and cook, tossing, until almost cooked through, about 1 minute. Add bacon and 1 Tbsp. water; cook, tossing, until asparagus is cooked through, about 30 seconds. Add soy sauce; toss to coat. Serve topped with shallots."
    ],
    "ingredients": [
        "1/4 cup black vinegar",
        "1/4 cup sherry vinegar",
        "2 small shallots, thinly sliced into rings",
        "4 ounces slab bacon, cut into 1x1/4-inch pieces",
        "1 tablespoon vegetable oil, plus more for frying (about 3 cups)",
        "1/4 cup all-purpose flour",
        "1/4 cup fine-grind cornmeal",
        "Kosher salt",
        "1 pound asparagus, trimmed, thinly sliced on a diagonal",
        "1 tablespoon white soy sauce",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Asparagus",
        "Vinegar",
        "New York",
        "Shallot",
        "Soy Sauce",
        "Cornmeal",
        "Bacon"
    ],
    "title": "Stir-Fried Asparagus With Bacon and Crispy Shallots",
    "url": "http://www.epicurious.com/recipes/food/views/stir-fried-asparagus-with-bacon-and-crispy-shallots"
}
