{
    "directions": [
        "Combine chicken, 1 1/2 tablespoons lime juice, and crushed chipotles in large bowl. Sprinkle with salt and pepper; toss to blend. Let stand 10 minutes. Heat 4 teaspoons oil in large nonstick skillet over high heat. Add chicken mixture and sauté 3 minutes. Stir in green onions and broth; cover and cook 3 minutes. Uncover and stir until chicken is cooked through and most liquid evaporates, about 2 minutes longer. Stir in 1 1/2 tablespoons lime juice. Season to taste with salt and pepper. Transfer to bowl; cover to keep warm.",
        "Heat remaining 2 teaspoons oil in same skillet over high heat. Add radishes and sauté 1 minute. Stir in remaining 1 tablespoon lime juice. Season with salt and pepper. Add radishes and cilantro to bowl with chicken and toss to blend.",
        "Divide chicken mixture among 6 plates. Sprinkle with reserved sliced radish leaves. Garnish with lime wedges. Serve hot tortillas alongside.",
        "*Crushed chipotle chilies (dried smoked jalapeño chilies) are available in the spice section of some supermarkets."
    ],
    "ingredients": [
        "9 large skinless boneless chicken thighs, fat trimmed, chicken cut into 1/2-inch pieces",
        "4 tablespoons fresh lime juice",
        "1 1/2 teaspoons crushed chipotle chilies*",
        "6 teaspoons olive oil",
        "9 green onions (white and pale green parts only), thinly sliced",
        "1/2 cup canned low-salt chicken broth",
        "18 radishes, trimmed, halved, thinly sliced crosswise, and 20 radish leaves, thinly sliced, reserved",
        "2 tablespoons chopped fresh cilantro",
        "Lime wedges",
        "12 hot corn tortillas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Stir-Fry",
        "Super Bowl",
        "Lime",
        "Hot Pepper",
        "Radish",
        "Cilantro",
        "Tortillas"
    ],
    "title": "Stir-Fried Chicken with Radishes, Chipotles, and Lime",
    "url": "http://www.epicurious.com/recipes/food/views/stir-fried-chicken-with-radishes-chipotles-and-lime-104961"
}
