{
    "directions": [
        "Cut half of ginger into very fine matchsticks (less than 1/8 inch thick; about 1 tablespoon) and reserve. Grate remaining ginger and squeeze pulp with your fingers to yield 1 teaspoon liquid, then discard pulp.",
        "Remove any bruised or withered outer leaves from bok choy. Trim 1/8 inch from bottom of each bok choy, then cut each head into quarters. Wash bok choy in several changes of cold water and dry in a colander or salad spinner until dry to the touch.",
        "Whisk together ginger juice, chicken broth, rice wine, soy sauce, cornstarch, salt, and sugar in a small bowl until cornstarch is dissolved.",
        "Heat wok over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Pour oil down side of wok, then swirl oil, tilting wok to coat sides. Add ginger matchsticks and stir-fry 5 seconds. Add bok choy and stir-fry until leaves are bright green and just limp, 1 to 2 minutes. Stir broth mixture, then pour into wok and stir-fry until vegetables are crisp-tender and sauce is slightly thickened, about 1 minute. Remove from heat and drizzle with sesame oil, then stir to coat."
    ],
    "ingredients": [
        "1 (2-inch) piece ginger, peeled",
        "3/4 lb Shanghai bok choy or other baby bok choy (5 to 8 heads)",
        "1/4 cup reduced-sodium chicken broth",
        "1 teaspoon Chinese rice wine (preferably Shaoxing) or medium-dry Sherry",
        "1 teaspoon soy sauce",
        "1/2 teaspoon cornstarch",
        "1/2 teaspoon salt",
        "1/4 teaspoon sugar",
        "1 tablespoon vegetable oil",
        "1/2 teaspoon Asian sesame oil",
        "Special equipment: a rasp grater; a well-seasoned 14-inch flat-bottomed wok",
        "Accompaniment: steamed white rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Wok",
        "Ginger",
        "Leafy Green",
        "Vegetable",
        "Side",
        "Stir-Fry",
        "Quick & Easy",
        "Spring",
        "Bok Choy",
        "Soy Sauce",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Stir-Fried Shanghai Bok Choy with Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/stir-fried-shanghai-bok-choy-with-ginger-231200"
}
