{
    "directions": [
        "Cut the chicken breast halves across the grain on a slight diagonal into slices about 1/2 inch thick. Season with the 1 tsp. salt and the 1/4 tsp. pepper.",
        "Grate the zest from the lemon, then squeeze 2 Tbs. lemon juice. In a small nonreactive bowl, stir together the broth, fish sauce, sugar, lemon zest and lemon juice. In another small bowl, mix the cornstarch with the 1 Tbs. water.",
        "In a wok or very large fry pan over medium-high heat, warm 2 Tbs. of the oil until hot. Add the chicken and stir-fry until opaque throughout, about 3 minutes. Transfer to a platter.",
        "Return the pan to medium-high heat and warm the remaining 2 Tbs. oil until very hot but not smoking. Add the chopped green onions, the ginger and garlic and stir-fry until fragrant, about 15 seconds. Add the sugar snap peas and the 1/4 cup water, cover and cook, stirring occasionally, until the peas turn bright green, about 1 minute.",
        "Return the chicken to the pan and add the sliced green onions and the mint. Stir the broth mixture, add it to the pan and bring to a boil, stirring constantly. Stir the cornstarch mixture, stir it into the pan and cook until the sauce is slightly thickened, about 15 seconds. Adjust the seasonings with salt and pepper and serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "One Pot of the Day,",
        "by Kate McMillan (Weldon Owen, 2012)."
    ],
    "ingredients": [
        "2 boneless, skinless chicken breast halves, each about 6 oz.",
        "1 tsp. kosher salt, plus more, to taste",
        "1/4 tsp. freshly ground pepper, plus more, to taste",
        "1 lemon",
        "1 cup chicken broth",
        "2 Tbs. Asian fish sauce",
        "1 tsp. sugar",
        "1 tsp. cornstarch",
        "1 Tbs. plus 1/4 cup water",
        "4 Tbs. peanut or grapeseed oil",
        "2 green onions, white and light green portions chopped, green tops sliced",
        "1/2-inch piece fresh ginger, peeled and grated",
        "2 garlic cloves, minced",
        "1/2 lb. sugar snap peas, trimmed",
        "3 Tbs. coarsely chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Stir-Fried Chicken with Sugar Snap Peas and Lemon",
    "url": "http://www.williams-sonoma.com/recipe/stir-fried-chicken-with-sugar-snap-peas-and-lemon.html"
}
