{
    "directions": [
        "Combine shallots, star anise, if using, chile de árbol, and 3 tablespoons vegetable oil in a large wok or skillet and cook over medium-high heat, stirring often, until shallots are golden, about 5 minutes. Using a slotted spoon, transfer to a paper towel–lined plate; discard star anise and red chile. Season shallots with salt.",
        "Increase heat to high; cook shrimp, garlic, and ginger in wok, tossing, until shrimp are cooked through, about 3 minutes. Transfer to another plate.",
        "Heat 1 tablespoon vegetable oil in wok; add grains, pressing evenly against bottom and sides of wok. Cook until grains crackle, about 1 minute; toss and press against pan again. Cook until lightly toasted, about 4 minutes. Add shrimp, soy sauce, vinegar, and sesame oil. Cook, tossing, until liquid is absorbed, about 1 minute.",
        "Heat remaining 1 tablespoon vegetable oil in a medium nonstick skillet over medium-high heat. Fry eggs until whites are set but yolks are still runny, about 3 minutes. Top grains with eggs, crispy shallots, red chile, and herbs."
    ],
    "ingredients": [
        "4 shallots, thinly sliced",
        "2 star anise pods (optional)",
        "1/2 dried chile de árbol or 1/2 teaspoon crushed red pepper flakes",
        "5 tablespoons vegetable oil, divided",
        "Kosher salt",
        "12 ounces deveined peeled rock shrimp, or large shrimp, cut into 3/4\" pieces",
        "4 garlic cloves, finely chopped",
        "2 tablespoons chopped peeled ginger",
        "2 1/3–3 cups cooked grains (such as sorghum, semi-pearled farro, or barley)",
        "1 tablespoon soy sauce",
        "1 tablespoon unseasoned rice vinegar",
        "2 teaspoons toasted sesame oil",
        "4 large eggs",
        "1 red chile, with seeds, thinly sliced into rounds",
        "1 cup fresh cilantro, basil, and/or mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Shellfish",
        "Stir-Fry",
        "Dinner",
        "Seafood",
        "Shrimp",
        "Hot Pepper",
        "Chile Pepper",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Stir-Fried Grains with Shrimp and Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/stir-fried-grains-with-shrimp-and-eggs-51210040"
}
