{
    "directions": [
        "Put oven rack in lower third of oven and preheat oven to 375°F.",
        "Stir together brown sugar, paprika, curry powder, cumin, pepper, salt, and mustard in a small bowl until combined.",
        "Pat ribs dry and arrange in 1 layer in a shallow baking pan or a shallow dish, then generously coat all sides of ribs with spice mixture. Marinate, uncovered and chilled, 1 hour.",
        "Wash leeks in a bowl of cold water, agitating water, then lift out leeks and drain in a colander.",
        "Heat oil in pot over high heat until hot but not smoking and quickly brown ribs on all 3 meaty sides (but not bone side) without crowding, in batches if necessary, about 1 minute per side. Transfer meat to a large plate, then add leeks, carrots, celery, and bay leaves to pot and cook over moderately low heat, stirring occasionally, until vegetables begin to soften, about 3 minutes. Add garlic and cook, stirring, 1 minute.",
        "Add broth, beer, and tomatoes with their juice, then add ribs with any juices and remaining spices accumulated on plate and bring liquid to a boil, uncovered. Cover pot and transfer to oven, then braise until meat is very tender, 2 to 2 1/2 hours.",
        "Skim off excess fat from surface of sauce. Discard bay leaves."
    ],
    "ingredients": [
        "1/4 cup packed dark brown sugar",
        "1 tablespoon paprika (not hot)",
        "1 tablespoon curry powder (preferably Madras)",
        "2 teaspoons ground cumin",
        "2 teaspoons black pepper",
        "2 teaspoons salt",
        "1 teaspoon dry mustard",
        "4 to 4 1/4 lb beef short ribs, cut into 4-inch pieces",
        "4 medium leeks (white and pale green parts only), chopped (2 cups)",
        "3 tablespoons olive oil",
        "4 medium carrots, chopped (2 cups)",
        "3 celery ribs, chopped (1 1/2 cups)",
        "2 Turkish bay leaves or 1 California",
        "1/4 cup chopped garlic (5 to 6 large cloves)",
        "1 3/4 cups beef broth (14 oz)",
        "2 (12-oz) bottles stout such as Mackeson or Guinness",
        "2 (14- to 15-oz) cans diced tomatoes",
        "Special equipment: a wide 6-qt heavy nonreactive pot with a lid",
        "Accompaniment: buttered egg noodles tossed with chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Braise",
        "Beef Rib",
        "Winter",
        "Gourmet"
    ],
    "title": "Stout-Braised Short Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/stout-braised-short-ribs-231653"
}
