{
    "directions": [
        "Combine 4 cups blueberries, 1/2 cup white sugar, 1/2 teaspoon cinnamon, water, and lemon zest in a Dutch oven. Cook and stir over medium-high heat until mixture has thickened and has a jam-like texture, 10 to 12 minutes.",
        "Whisk lemon juice and cornstarch together in a small bowl until smooth; stir into blueberry mixture. Add remaining 4 cups blueberries to the blueberry mixture; cook and stir until blueberry mixture is heated through, about 1 minute. Remove pot from heat and cover to keep warm.",
        "Mix buttermilk, butter, and vanilla extract together in a measuring cup. Whisk flour, baking powder, baking soda, salt, and 6 tablespoons sugar together in a large bowl. Slowly stir buttermilk mixture into flour mixture until dough forms. Scoop dough using a small ice cream scoop or 2 large spoons and drop golf ball-sized dumplings atop blueberry mixture.",
        "Wrap lid of Dutch oven with a clean kitchen towel to absorb condensation during cooking. Cover pot with the towel-wrapped lid, keeping towel away from heat source.",
        "Simmer grunt until dumplings have doubled in size and a toothpick inserted in the center comes out clean, 16 to 22 minutes.",
        "Mix 1/2 teaspoon cinnamon and 2 tablespoons white sugar together in a small bowl; sprinkle over dumplings."
    ],
    "ingredients": [
        "Filling:",
        "8 cups fresh blueberries, divided",
        "1/2 cup white sugar",
        "1/2 teaspoon ground cinnamon",
        "2 tablespoons water",
        "1 teaspoon lemon zest",
        "1 tablespoon lemon juice",
        "1 teaspoon cornstarch",
        "Topping:",
        "3/4 cup buttermilk",
        "6 tablespoons unsalted butter, melted and cooled slightly",
        "1 teaspoon vanilla extract",
        "2 1/4 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "6 tablespoons white sugar",
        "1/2 teaspoon ground cinnamon",
        "2 tablespoons white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stove Top Blueberry Grunt",
    "url": "http://allrecipes.com/recipe/229581/stove-top-blueberry-grunt/"
}
