{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Line 14 cupcake cups with paper liners.",
        "To make strawberry puree, pulse frozen strawberries in blender or food processor until evenly chopped. Add 2 tablespoons water, honey, 1/2 teaspoon lemon zest, and sugar. Blend until smooth.",
        "Beat cake mix, 1 cup water, eggs, and vegetable oil in a large bowl with an electric mixer on low speed until moistened; increase mixer speed to medium and beat for 2 minutes. Beat lemon zest into batter. Fill prepared cupcake cups 2/3 full. Drop a spoonful of strawberry puree into the center of each portion of cupcake batter.",
        "Bake cupcakes in preheated oven until golden and the tops spring back when lightly pressed, 18 to 22 minutes. A toothpick inserted near the center should come out clean. Let cupcakes cool for at least 30 minutes.",
        "To make icing, place cream cheese and butter in a bowl and beat with an electric mixer until smooth. Mix in confectioners' sugar; blend in vanilla extract, lemon juice, and lemon zest. Refrigerate icing until cupcakes are cool enough to frost. Frost cooled cupcakes with icing."
    ],
    "ingredients": [
        "Strawberry Puree:",
        "1 cup frozen strawberries",
        "2 tablespoons water",
        "1 teaspoon honey",
        "1/2 teaspoon fresh lemon zest",
        "1 tablespoon white sugar",
        "Cupcake Batter:",
        "1 box strawberry cake mix (such as Betty Crocker®)",
        "1 cup water",
        "3 eggs",
        "1/2 cup vegetable oil",
        "1/2 teaspoon lemon zest",
        "Lemon Zest Cream Cheese Icing:",
        "1 (8 ounce) package cream cheese, softened",
        "1/4 cup unsalted butter at room temperature",
        "2 cups sifted confectioners' sugar",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon fresh lemon juice",
        "1/2 teaspoon lemon zest"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Strawberry Cupcakes with Lemon Zest Cream Cheese Icing",
    "url": "http://allrecipes.com/recipe/231109/strawberry-cupcakes-with-lemon-zest-c/"
}
