{
    "directions": [
        "1 To make the filling, rinse the strawberries. Select 4 or 5 of the best berries to use for decoration and refrigerate them. Hull and slice the remaining berries. Combine the sliced berries with the sugar, kirsch, and lemon juice in a bowl and refrigerate for 1 hour.",
        "2 Drain the berries, reserving the juice. In a medium bowl, whip the cream with the vanilla. Fold in the berries.",
        "3 To assemble, remove the paper from the bottom of the gênoise and place the layer right side up on a clean piece of paper. Moisten the layer with the reserved strawberry juices. Spread with the filling and roll it up, wrapping it tightly in the paper. Place the roll in the freezer on a baking sheet while you prepare the meringue.",
        "4 Preheat the oven to 400°F.",
        "5 Whisk the egg whites and sugar in the bowl of an eclectic mixer, place over a pan of simmering water, and whisk until the egg whites are hot and the sugar is dissolved. Attach to the mixer and beat with the whip attachment on medium speed until cooled.",
        "6 Place the cake roll on a baking sheet and cover with meringue, reserving a little meringue for decoration. Pipe several rosettes of meringue along the top. Dust the meringue with confectioners' sugar.",
        "7 Place the cake on the center rack in the oven to color the meringue, about 1 to 2 minutes; turn the pan several times so the meringue colors evenly. Cool, then chill the roll.",
        "8 Trim the ends of the cake on a diagonal. Slide the roulade onto a platter and decorate with the reserved strawberries."
    ],
    "ingredients": [
        "1 pint strawberries",
        "2 tablespoons sugar",
        "1 tablespoon kirsh",
        "2 teaspoons fresh lemon juice",
        "1 cup heavy whipping cream",
        "1 teaspoon vanilla extract",
        "1 plain Gênoise Sheet",
        "1/2 cup (about 4 large) egg whites",
        "2/3 cups sugar",
        "Confectioners' sugar for finishing"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Wedding",
        "Strawberry",
        "Summer",
        "Chill"
    ],
    "title": "Strawberry Roulade",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-roulade-353189"
}
