{
    "directions": [
        "Preheat oven to 325° F. and spray a heavy or non-stick baking sheet with cooking spray or line with parchment paper.",
        "Rub off loose skins from pistachios and in a food processor grind nuts with granulated sugar. In a bowl whisk together pistachio mixture, flour, and salt and whisk in whites, butter, and vanilla until combined well. Drop rounded teaspoons batter 5 inches apart onto baking sheet and with back of a spoon spread into 3 1/2- to 4-inch rounds. Bake wafers in middle of oven 8 minutes, or until golden.",
        "Working quickly, transfer hot wafers with a thin metal spatula to a rack to cool completely. (If wafers become too crisp to remove from baking sheet, return to oven 1 minute, or until heated through and pliable.) Make more wafers with remaining batter in same manner, spraying or re-lining sheet for each batch. Wafers may be made 2 days ahead and kept in an airtight container at room temperature. Makes 16 to 20 wafers.",
        "Into a chilled bowl scrape seeds of vanilla bean and add cream and granulated sugar. With a whisk or an electric mixer beat mixture until it holds stiff peaks. Whipped cream may be made 2 hours ahead and chilled, covered. Whisk cream briefly before using.",
        "Put a wafer in center of each of 4 plates. Spread about 2 tablespoons whipped cream on each wafer, leaving a 1/4-inch border, and top with half of strawberries. Put another wafer on top of strawberries and top in same manner with remaining cream and strawberries. Dust 4 wafers with confectioners' sugar and put on top of desserts. Garnish each mille-feuillantine with a strawberry and sprinkle plates with pistachios."
    ],
    "ingredients": [
        "1/2 cup shelled natural pistachios (about 2 1/2 ounces)",
        "1/2 cup granulated sugar",
        "1/4 cup all-purpose flour",
        "1/4 teaspoon salt",
        "2 large egg whites",
        "5 tablespoons unsalted butter, melted",
        "1/4 teaspoon vanilla",
        "1 vanilla bean, halved lengthwise",
        "1 cup chilled heavy cream",
        "3 tablespoons granulated sugar",
        "1 pound small strawberries (about 1 pint), trimmed",
        "confectioners' sugar for dusting",
        "Garnish: 4 small strawberries and chopped pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Berry",
        "Dairy",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Strawberry",
        "Pistachio",
        "Summer",
        "Pastry",
        "Gourmet"
    ],
    "title": "Strawberry Pistachio Mille-Feuillantines",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-pistachio-mille-feuillantines-14025"
}
