{
    "directions": [
        "Preheat oven to 350°F. Butter and flour two 9-inch-diameter cake pans with 2-inch-high sides. Line bottom of pans with parchment paper. Sift first 4 ingredients into medium bowl. Using electric mixer, beat butter and 1 cup sugar in large bowl until well blended. Beat in sour cream, orange juice, orange peel and vanilla. Add eggs 1 at a time, beating well after each addition. Add dry ingredients and beat until well blended. Divide batter between prepared pans; smooth tops. Bake cakes until light golden and tester inserted into center comes out clean, about 28 minutes. Cool cakes in pans on rack 30 minutes. Turn cakes out onto racks and cool completely. Meanwhile, hull and slice 1 basket strawberries. Place in medium bowl. Add preserves and 2 tablespoons sugar; toss to blend. Let stand at room temperature until juices form, about 2 hours. Place 1 cake layer, flat side up, on platter. Top with sliced berry mixture in even layer. Spread 1 cup Whipped Crme Fra‮che over berry mixture. Top with second cake layer, flat side down, pressing slightly. To make basket weave, spread 1* cups Whipped Crme Fra‮che over top and sides of cake; then follow directions in the box at right. Or to frost simply, spread all of Whipped Crme Fra‮che over top and sides of cake. (Can be made 8 hours ahead. Cover with cake dome and refrigerate.) Mound remaining whole berries in center of cake."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 cup plus 2 tablespoons sugar",
        "1 cup sour cream",
        "cup orange juice",
        "1§ teaspoons grated orange peel",
        "1 teaspoon vanilla extract",
        "2 large eggs",
        "2 12-ounce baskets strawberries",
        "1 cup strawberry preserves",
        "Whipped Crème Fraîche"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Strawberry",
        "Spring"
    ],
    "title": "Strawberry Basket Cake",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-basket-cake-101317"
}
