{
    "directions": [
        "Preheat oven to 325°F. Line baking sheet with parchment paper; spray parchment with nonstick spray. Toss almonds with corn syrup in small bowl, then add sugar and toss (sugar coating will resemble wet sand). Spread in single layer on baking sheet. Bake until golden, stirring occasionally, about 20 minutes. Cool slightly on baking sheet, then break up any large clusters of almonds. DO AHEAD: Can be made 1 day ahead. Store in airtight container at room temperature.",
        "Combine 1 cup sliced strawberries, 2 tablespoons sugar, and 3 tablespoons Prosecco in processor. Puree until smooth. Pour puree into strainer set over bowl and press on solids to extract as much liquid and pulp as possible; discard solids in strainer. Toss remaining 3 cups strawberries and remaining 2 tablespoons sugar in medium bowl; let stand at room temperature until juices form, tossing occasionally, about 30 minutes. Mix strawberry puree into sliced strawberries. DO AHEAD: Can be made 8 hours ahead. Cover and chill.",
        "Beat heavywhipping cream in medium bowl until peaks form; refrigerate until ready to use. Fill large bowl halfway with ice and cold water. Whisk egg yolks and sugar to blend in medium metal bowl; add 1/2 cup Prosecco and whisk to blend. Set bowl over saucepan of simmering water and whisk constantly and vigorously until mixture is thick and resembles softly beaten whipping cream, about 6 minutes. Set bowl with sabayon in bowl of ice and cold water and whisk until sabayon is cool, about 6 minutes. Fold in chilled whipped cream. DO AHEAD: Sabayon can be made 8 hours ahead. Cover and chill.",
        "Spoon 1/4 cup strawberry compote into each of 6 dessert glasses or bowls. Top each with 1 scoop strawberry sorbet; sprinkle each with 1 tablespoon sugared almonds. Repeat layering with 1/4 cup strawberry compote, 1 scoop sorbet, and 1 tablespoon sugared almonds. Top each with large spoonful of sabayon; sprinkle each with 1 tablespoon sugared almonds and serve."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 cup sliced almonds",
        "1 tablespoon light corn syrup",
        "2 tablespoons sugar",
        "4 cups sliced fresh strawberries (about 16 ounces), divided",
        "4 tablespoons sugar, divided",
        "3 tablespoons Prosecco or other sparkling wine",
        "1/2 cup chilled heavy whipping cream",
        "4 large egg yolks",
        "1/4 cup sugar",
        "1/2 cup Prosecco or other sparkling wine",
        "2 pints strawberry sorbet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Egg",
        "Dessert",
        "Bake",
        "Frozen Dessert",
        "Strawberry",
        "Almond",
        "Sparkling Wine",
        "Summer",
        "Chill",
        "Simmer",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Sundaes with Prosecco Sabayon",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-sundaes-with-prosecco-sabayon-242720"
}
