{
    "directions": [
        "Lightly brush muffin cups with coconut oil. Set aside. Pulse nuts in a food processor until coarsely ground. Add 3 tablespoons agave syrup, flour, ginger, salt, and 2 teaspoons coconut oil. Process until coarse dough forms. Gather into a ball. Press 1 heaping tablespoon dough firmly onto bottom and up sides of each muffin cup. Chill for 1 hour.",
        "Preheat oven to 350°F. Bake crusts until firm and golden around edges, 8-10 minutes. Let cool in pan on a wire rack for at least 10 minutes before removing. DO AHEAD: Can be made 1 day ahead. Let cool completely; store airtight at room temperature.",
        "Place strawberries, lemon juice, and remaining 2 tablespoons agave syrup in a medium bowl; scrape in vanilla seeds (save bean for another use). Stir well, crushing a few berries to release their juices.",
        "Using a spatula or butter knife, remove tart shells from pan and fill with strawberry mixture. Serve immediately."
    ],
    "ingredients": [
        "2 teaspoons coconut oil, melted, plus more for pan",
        "2 cups pecans, walnuts, or almonds",
        "5 tablespoons agave syrup (nectar), divided",
        "2 tablespoons whole wheat flour",
        "1 teaspoon ground ginger",
        "1/2 teaspoon fine sea salt",
        "1 pound fresh strawberries, hulled, sliced",
        "1 teaspoon fresh lemon juice",
        "1 vanilla bean, split length wise",
        "Special Equipment: A 12-cup muffin pan",
        "Ingredient info: Agave syrup and coconut oil are available at natural foods stores and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Nut",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Low Sodium",
        "Strawberry",
        "Summer",
        "Shower",
        "Healthy",
        "Low Cholesterol",
        "Engagement Party",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Tarts with Ginger-Nut Crust",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-tarts-with-ginger-nut-crust-395925"
}
