{
    "directions": [
        "Place rhubarb, strawberries, lemon juice, fruit pectin, and butter into a large kettle over medium heat. (Butter is optional but helps keep jam from getting too foamy). Stir the fruit mixture to help the juice start to form, and add sugar, about 1 cup at a time, stirring constantly until sugar is dissolved and the juice is starting to simmer. Turn up heat to medium-high, bring the mixture to a full rolling boil, and cook and stir for 1 minute. Skim off any foam that forms.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes. With a jelly funnel and a soup ladle, pack the jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 5 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. To help the jam set, don't move or touch the jars until cooled. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "4 1/4 cups diced rhubarb",
        "4 1/4 cups sliced fresh strawberries",
        "2 tablespoons lemon juice",
        "2 (1.75 ounce) packages powdered fruit pectin",
        "1/2 teaspoon butter (optional)",
        "10 cups white sugar",
        "12 half-pint canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Strawberry-Rhubarb Jam",
    "url": "http://allrecipes.com/recipe/214106/strawberry-rhubarb-jam/"
}
