{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Butter the bottom of two 8-inch cake pans. Then line them with parchment paper and butter and flour the lined pans.",
        "Cream the butter and sugar on high speed in the bowl of an electric mixer fitted with the paddle attachment until light and fluffy. On medium speed, add the eggs, 1 at a time, then the sour cream, zests, and vanilla, scraping down the bowl as needed. Mix well. Sift together the flour, cornstarch, salt, and baking soda. On low speed, slowly add the flour mixture to the butter mixture and combine just until smooth.",
        "Pour the batter evenly into the pans, smooth the tops, and bake in the center of the oven for 40 to 45 minutes, until a toothpick comes out clean. Let cool in the pans for 30 minutes, then remove to wire racks and let cool to room temperature. If using 1 cake, wrap the second well and freeze.",
        "To make the filling for one cake, whip the cream, sugar, and vanilla in a mixer fitted with the whisk attachment until firm. Slice one of the cakes in half with a long, sharp knife. Place the bottom slice of the cake on a serving platter, spread with 1/2 the whipped cream and scatter with sliced strawberries. Cover with the top slice of the cake and spread with the remaining cream. Decorate with strawberries."
    ],
    "ingredients": [
        "12 tablespoons (1 1/2 sticks) unsalted butter, at room temperature",
        "2 cups sugar",
        "4 extra-large eggs, at room temperature",
        "3/4 cup sour cream, at room temperature",
        "1/2 teaspoon grated lemon zest",
        "1/2 teaspoon grated orange zest",
        "1/2 teaspoon pure vanilla extract",
        "2 cups all-purpose flour",
        "1/4 cup cornstarch",
        "1/2 teaspoon kosher salt",
        "1 teaspoon baking soda",
        "1 cup (1/2 pint) heavy cream, chilled",
        "3 tablespoons sugar",
        "1/2 teaspoon pure vanilla extract",
        "1 pint fresh strawberries, hulled and sliced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fruit Dessert Recipes",
        "Dessert",
        "Fruit",
        "Baking",
        "Mixer Recipes",
        "Cake",
        "Strawberry",
        "Dairy Recipes",
        "Sugar",
        "Spring"
    ],
    "title": "Strawberry Country Cake",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/strawberry-country-cake-recipe"
}
