{
    "directions": [
        "Preheat oven to 375°F. Line bottom of two 9-inch-diameter cake pans with 1 1/2-inch-high sides with parchment paper. Using on/off turns, finely chop 1 cup pistachios with flour in processor. Using electric mixer, beat egg yolks with 1/3 cup sugar in large bowl until thick, about 4 minutes. Using clean dry beaters, beat egg whites in another large bowl until soft peaks form. Gradually beat in remaining 1/3 cup sugar, continuing to beat until whites are stiff and glossy. Fold half of whites into yolk mixture, then gently fold in half of pistachio mixture. Fold in remaining pistachio mixture, then remaining whites.",
        "Divide batter between prepared pans. Bake until tester inserted into center of cakes comes out clean, about 15 minutes. Cool cakes completely in pans on rack.",
        "Run knife around edge of each pan to loosen cakes. Invert cakes onto 9-inch-diameter cardboard rounds. Tap sharply on work surface, if necessary, to release cakes from pans. Peel off parchment.",
        "Stir 1/3 cup water and sugar in heavy small saucepan over medium heat until sugar dissolves. Add orange peel; simmer until translucent, about 12 minutes. Cool. Strain syrup into bowl; add orange juice and Grand Marnier and reserve. Finely chop orange peel.",
        "Blend ricotta cheese and powdered sugar in processor until very smooth, about 1 minute. Transfer to large bowl. Beat whipping cream and vanilla in medium bowl until firm peaks form. Fold cream mixture into ricotta mixture in 2 additions. Transfer 2 cups ricotta mixture to small bowl and reserve for frosting. Stir chopped chocolate and chopped orange peel into remaining ricotta mixture for filling. If necessary, chill frosting and filling until firm enough to spread.",
        "Place 1 cake layer on platter; brush with half of reserved orange syrup. Spread chocolate-ricotta filling evenly over. Top with second cake layer. Brush remaining orange syrup over. Spread ricotta frosting over top and sides of cake. Chill until frosting firms slightly, about 2 hours. Gently press toasted pistachios onto frosting around sides of cake. (Can be made 1 day ahead. Cover with cake dome; keep chilled.)",
        "Overlap strawberry slices in concentric circles atop cake. Stir jam in small saucepan over medium-low heat until melted. Brush melted jam over strawberries. (Can be made 1 hour ahead. Chill.)"
    ],
    "ingredients": [
        "1 cup shelled natural unsalted pistachios (about 4 3/4 ounces)",
        "1/2 cup sifted cake flour (sifted, then measured)",
        "4 large eggs, separated",
        "2/3 cup sugar",
        "1/3 cup water",
        "1/3 cup sugar",
        "1/3 cup 1x1/8-inch strips orange peel (orange part only)",
        "3 tablespoons orange juice",
        "2 tablespoons Grand Marnier or other orange liqueur",
        "1 15-ounce container whole-milk ricotta cheese",
        "3/4 cup powdered sugar",
        "1 cup chilled heavy whipping cream",
        "1 teaspoon vanilla extract",
        "3 tablespoons finely chopped bittersweet (not unsweetened) or semisweet chocolate",
        "2/3 cup shelled natural unsalted pistachios, lightly toasted, chopped",
        "2 pints strawberries, hulled, sliced",
        "1/4 cup seedless raspberry jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Bake",
        "Ricotta",
        "Strawberry",
        "Orange",
        "Pistachio",
        "Chill",
        "Jam or Jelly"
    ],
    "title": "Strawberry-Orange Ricotta Cake with Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-orange-ricotta-cake-with-pistachios-107948"
}
