{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Pat the beef dry with paper towels and season with salt and pepper. In a heavy 6-quart pot or Dutch oven, heat 2 tablespoons of oil over medium-high heat. Add the beef and cook until browned on all sides, about 12 minutes. Remove the beef and set aside.",
        "Reduce the heat to medium. Add the remaining oil and the onions. Cook, stirring frequently, until tender, about 8 minutes. Add the garlic and cook for 1 minute until aromatic. Add the wine and scrape up the brown bits that cling to the bottom of the pan with a wooden spoon. Stir in the broth and mushrooms. Return the beef to the pot and bring the liquid to a boil. Cover the pot and transfer to the oven. Cook until the beef is fork-tender, about 3 hours, turning the beef over halfway through and adding more beef broth, as needed.",
        "Transfer the beef to a cutting board. Tent with foil and let stand for 15 minutes. Meanwhile, spoon any excess fat off the top of the pan juices. Using an immersion blender, blend the pan juices and vegetables until smooth. Add the rosemary and thyme. Bring to sauce to a simmer and simmer for 5 minutes. Season with salt and pepper, to taste.",
        "Cut the beef into 1-inch pieces and place on a platter. Spoon some of the sauce over the meat and serve the remaining sauce on the side."
    ],
    "ingredients": [
        "1 (5-pound) boneless beef chuck roast",
        "Kosher salt and freshly ground black pepper",
        "1/4 cup olive oil, divided",
        "2 onions, chopped",
        "6 cloves garlic, crushed",
        "1 cup red wine, such as cabernet sauvignon or pinot noir",
        "1 (15-ounce) can low-sodium beef broth, plus extra, as needed",
        "1/2 ounce dried porcini mushrooms",
        "1 large sprig fresh rosemary, leaves removed and chopped",
        "6 sprigs fresh thyme, leaves removed and chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Sauce Recipes",
        "Roast Recipes",
        "Pot Roast",
        "Mushroom",
        "Vegetable",
        "Wine Recipes",
        "Beef",
        "Meat",
        "Onion Recipes",
        "Holiday",
        "Winter",
        "Roasting"
    ],
    "title": "Stracotto (Pot Roast) with Porcini Mushrooms",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/stracotto-pot-roast-with-porcini-mushrooms-recipe"
}
