{
    "directions": [
        "Blend cream cheese, powdered sugar and 5 tablespoons Marsala in processor until smooth. Mix in sour cream. Slice half of strawberries; cut all remaining strawberries in half.",
        "Combine boiling water, 2 tablespoons sugar and espresso powder in medium bowl; stir to dissolve. Mix in remaining 2 tablespoons Marsala. Dip 1 Champagne biscuit briefly into espresso mixture, turning to coat. Place flat side up in bottom of 8-inch square glass baking dish with 2-inch-high sides. Repeat with enough Champagne biscuits to cover bottom of baking dish, trimming biscuits to fit.",
        "Spread 2/3 of cream cheese mixture over Champagne biscuits. Cover with sliced strawberries. Dip more biscuits into espresso mixture and arrange atop sliced strawberries in dish, covering completely and trimming to fit. Spread remaining cream cheese mixture over. Sprinkle with grated chocolate. Arrange halved strawberries around edge of pan. Cover and refrigerate until set, at least 4 hours. (Can be prepared 1 day ahead.) Cut into squares and serve."
    ],
    "ingredients": [
        "1 1/2 8-ounce packages light cream cheese, room temperature",
        "3/4 cup powdered sugar",
        "7 tablespoons Marsala",
        "1/2 cup sour cream",
        "1 1-pint basket strawberries",
        "3/4 cup boiling water",
        "2 tablespoons sugar",
        "2 1/2 teaspoons instant espresso powder or instant coffee powder",
        "2 1/4 (about) 3.5-ounce packages Champagne biscuits (ladyfinger-style cookies)",
        "1 ounce bittersweet (not unsweetened) or semisweet chocolate, grated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Valentine's Day",
        "Cream Cheese",
        "Strawberry",
        "Spring",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Tiramisu",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-tiramisu-1731"
}
