{
    "directions": [
        "Puree 2 cups strawberries in processor until smooth. Pour puree through strainer, pressing with rubber spatula to extract as much puree as possible; reserve strained puree. Discard seeds in strainer.",
        "Whisk low-fat milk, whipping cream and sugar in heavy medium saucepan. Sprinkle gelatin over; let stand until gelatin softens, about 10 minutes. Whisk mixture constantly over very low heat just until gelatin dissolves and mixture is lukewarm, about 3 minutes (do not boil). Remove from heat. Whisk in pureed strawberries and vanilla extract. Divide mixture among six ‟-cup ramekins or custard cups. Refrigerate until panna cotta is set, at least 3 hours or overnight. Cover and refrigerate remaining 2 cups strawberry halves. Gently toss remaining 2 cups strawberry halves and honey in medium bowl to blend. Let stand at room temperature 30 minutes. Run small sharp knife between panna cotta and ramekins to loosen. Dip bottom of ramekins into bowl of hot water 30 seconds. Invert each panna cotta onto plate, shaking gently to unmold. Spoon strawberry-honey mixture over and serve."
    ],
    "ingredients": [
        "4 cups halved hulled strawberries (about 2 one-pint baskets)",
        "1 1/2 cups low-fat (1%) milk",
        "1/2 cup whipping cream",
        "1/3 cup sugar",
        "1 envelope unflavored gelatin",
        "1/2 teaspoon vanilla extract",
        "3 tablespoons honey"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Berry",
        "Dairy",
        "Fruit",
        "Dessert",
        "Strawberry",
        "Summer",
        "Chill",
        "Honey",
        "Ramekin",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Strawberry Panna Cotta with Strawberries and Honey",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-panna-cotta-with-strawberries-and-honey-103528"
}
