{
    "directions": [
        "In a food processor pulse almonds with granulated sugar until chopped fine. Add confectioners' sugar, flour, cornstarch, cinnamon, zest, and salt and pulse until combined well. Add butter and pulse until combined. Add whole egg and yolk and pulse until dough just holds together. Divide dough into fourths and form into disks (dough will be sticky). Chill disks, wrapped in plastic wrap, at least 2 hours and up to 3 days.",
        "Preheat oven to 325° F.",
        "Roll out 1 dough disk (keeping remaining disks chilled) between sheets of wax paper into a 1/4-inch-thick round (10 to 11 inches in diameter) and freeze between wax paper on a tray until very firm, about 10 minutes. Roll out and freeze remaining 3 dough disks in same manner.",
        "Remove top sheet of paper from 1 round and with a 3 1/2-inch heart-shaped cutter cut out hearts, chilling scraps. (If dough becomes too soft to work with at any time, freeze on wax paper until very firm.) With a 1-inch heart-shaped cutter cut and lift out centers (making 2 additional decorative heart cutouts in some cookies) from half of large hearts.",
        "Arrange whole hearts and cut-out hearts 1/2 inch apart on baking sheets and bake in batches in middle of oven 12 to 15 minutes, or until edges are pale golden. Cool cookies on baking sheets 5 minutes. (Cookies will continue to firm up as they cool.) With a spatula carefully transfer cookies to racks to cool completely. Make more cookies with remaining 3 dough rounds and scraps in same manner.",
        "On a work surface arrange whole hearts, bottoms down. Drop 1 teaspoon of either jam on each cookie, spreading almost to edges, and top with cut-out hearts. Spoon some remaining jam into centers. Cookies may be made 4 days ahead and chilled between layers of wax paper in an airtight container. Bring cookies to room temperature before serving."
    ],
    "ingredients": [
        "1 1/2 cups blanched almonds, toasted and cooled",
        "3 tablespoons granulated sugar",
        "1 cup confectioners' sugar",
        "2 1/4 cups all-purpose flour",
        "1/2 cup cornstarch",
        "1/2 teaspoon cinnamon",
        "3/4 teaspoon freshly grated lemon zest",
        "3/4 teaspoon salt",
        "2 1/4 sticks (1 cup plus 2 tablespoons) cold unsalted butter, cut into pieces",
        "1 large whole egg",
        "1 large egg yolk",
        "2/3 cup apricot jam, heated, strained, and cooled",
        "2/3 cup strawberry jam, heated, strained, and cooled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Food Processor",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Valentine's Day",
        "Kid-Friendly",
        "Strawberry",
        "Apricot",
        "Almond",
        "Gourmet"
    ],
    "title": "Strawberry and Apricot Linzertorte Hearts",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-and-apricot-linzertorte-hearts-13245"
}
