{
    "directions": [
        "Sift flour, sugar, and salt. Add eggs, one at a time, and mix until no lumps remain (you may use an electric mixer at slow speed). Mix in lemon rind or vanilla, cognac, and melted butter. Slowly add milk and mix until batter is consistency of thin cream. Let it stand an hour or two before making crêpes.",
        "Heat a crêpe pan (either 6-inch or 10-inch, according to desired size of crêpes) and rub it with butter. For each crêpe, pour a little batter into the pan, tilting about to let it run over the bottom in a fairly thin layer. When lightly browned on the bottom, turn carefully and brown other side. As each crêpe is cooked, remove it to a hot platter and keep warm. Re-butter pan as needed.",
        "Sprinkle washed, hulled, and sliced strawberries with sugar to taste and add sherry. Let stand to mellow. Heap each crêpe with sliced strawberries, roll up and arrange in a buttered chafing dish and heat over hot water. Melt currant jelly and pour over crêpes. Add and ignite cognac. Serve with plain or whipped cream."
    ],
    "ingredients": [
        "7/8 cup flour",
        "1/4 cup sugar",
        "1/8 teaspoon salt",
        "3 eggs",
        "1 teaspoon grated lemon rind (or a lttle grated vanilla bean)",
        "2 tablespoons cognac",
        "2 tablespoons melted butter",
        "1 1/2 cups milk",
        "1 quart fresh ripe strawberries",
        "Sugar",
        "1/2 cup oloroso sherry",
        "1/3 cup cognac, warmed",
        "Cream or whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Strawberry",
        "Cognac/Armagnac",
        "Summer",
        "House & Garden",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Crepes",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-crepes-101493"
}
