{
    "directions": [
        "Combine the flour, sugar, and salt in a small bowl and place in the freezer for 30 minutes. Put the flour mixture in the bowl of a food processor fitted with a steel blade. Add the butter and shortening and pulse about 10 times, or until the butter is in the size of peas. Add the ice water and process until the dough comes together. Dump on a well-floured board and form into a disk. Wrap in plastic and chill for at least 30 minutes.",
        "Meanwhile, preheat the oven to 375 degrees F.",
        "Roll out the dough and fit into 4 (4 1/2-inch) tart pans with removable sides. Don't stretch the dough when placing it in the pans or it will shrink during baking. Cut off the excess by rolling the pin across the top of each pan. Line the tart shells with a piece of buttered aluminum foil, butter side down, and fill them with dried beans or rice. Bake for 10 minutes. Remove the beans and foil, prick the bottom of the shells all over with a fork, and bake for another 15 to 20 minutes until lightly browned. Set aside to cool.",
        "Before serving, fill the tart shells with the pastry cream. Arrange the berries decoratively on top of the cream. Melt the apricot jelly with 1 teaspoon of water and brush the top of the tarts. Sprinkle with pistachios, if using, and serve.",
        "5 extra-large egg yolks, room temperature",
        "3/4 cup sugar",
        "3 tablespoons cornstarch",
        "1 1/2 cups scalded milk",
        "1/2 teaspoon pure vanilla extract",
        "1 teaspoon Cognac",
        "1 tablespoon unsalted butter",
        "1 tablespoon heavy cream",
        "In the bowl of an electric mixer fitted with the paddle attachment, beat the egg yolks and sugar on medium-high speed for 4 minutes, or until very thick. Reduce to low speed, and add the cornstarch.",
        "With the mixer still on low, slowly pour the hot milk into the egg mixture. Pour the mixture into a medium saucepan and cook over low heat, stirring constantly with a wooden spoon, until the mixture thickens, 5 to 7 minutes. Don't be alarmed when the custard comes to a boil and appears to curdle; switch to a whisk and beat vigorously. Cook, whisking constantly, for another 2 minutes; the custard will come together and become very thick, like pudding. Stir in the vanilla, Cognac, butter, and heavy cream. Pour the custard through a sieve into a bowl. Place plastic wrap directly on the custard and refrigerate until cold.",
        "Yield: 2 cups"
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "3 tablespoons sugar",
        "1/2 teaspoon kosher salt",
        "6 tablespoons (3/4 stick) cold unsalted butter, diced",
        "2 tablespoons cold shortening (recommended: Crisco)",
        "1/4 cup ice water",
        "2 cups Pastry Cream, recipe follows",
        "2 pints whole strawberries, hulled and halved",
        "1/3 cup apricot jelly",
        "3 tablespoons shelled pistachios, halved, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Fruit",
        "Strawberry",
        "Spring",
        "Summer",
        "Kid-Friendly"
    ],
    "title": "Strawberry Tarts",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/strawberry-tarts-recipe"
}
