{
    "directions": [
        "TO MAKE THE STREUSEL, cut the butter into small chunks and let sit at room temperature for 5 minutes.",
        "In the bowl of a stand mixer fitted with the paddle attachment, combine the flour, sugar, salt, and zest. Add the butter and mix on low speed until the mixture resembles coarse beach sand, about 2 minutes. Add the pistachios and mix just until the streusel begins to clump together and look like gravel, being careful not to let it come together to form a dough. If not using the streusel right away, store it in an airtight container in the refrigerator for up to 3 days or in the freezer for up to 1 month.",
        "TO MAKE THE CAKE, preheat the oven to 350°F (175°C). Butter and flour the bottom and sides of a 9-inch (23 cm) springform pan.",
        "Sift the flour and baking powder into a small bowl.",
        "In the bowl of a stand mixer fitted with the paddle attachment, beat the butter on low speed until smooth, 1 to 2 minutes. Add the sugar and salt and mix on low speed until well combined. Scrape down the sides of the bowl, then mix on medium speed until light and fluffy, 4 to 5 minutes.",
        "In a small bowl, combine the eggs and the vanilla extract and whisk vigorously until well blended.",
        "With the mixer on medium speed, add the egg mixture very slowly, in a steady stream, and mix until well-incorporated and very smooth, about 30 seconds. Scrape down the sides of the bowl, then mix on medium speed for 30 more seconds.",
        "Scrape down the sides of the bowl, then add the flour mixture. Mix on low speed just until uniform in texture. Use a rubber spatula to gently fold in the fruit until evenly incorporated.",
        "TO ASSEMBLE AND BAKE, pour the batter into the prepared pan, smooth it with an offset or rubber spatula, and sprinkle the streusel evenly over the top. Bake for 55 to 60 minutes, until the streusel is dry and golden and the buckle is firm and springs back when gently pressed in the center, rotating the pan midway through the baking time.",
        "Let the cake cool in the pan on a wire rack for 30 minutes, then remove from the pan. Serve warm or at room temperature. Stored in a covered container at room temperature, it will keep for up to 3 days."
    ],
    "ingredients": [
        "6 tablespoons (3 oz / 85 g) cold unsalted butter",
        "1 cup (4.9 oz / 140 g) all-purpose flour",
        "1/2 cup (3.5 oz / 100 g) sugar",
        "3/4 teaspoon kosher salt",
        "Finely grated zest of 1 lemon",
        "1/2 cup (2.7 oz / 76 g) unsalted shelled pistachios, coarsely chopped",
        "1 cup (4.9 oz / 140 g) all-purpose flour",
        "1 teaspoon baking powder",
        "11 tablespoons (5.5 oz / 156 g) unsalted butter, at room temperature",
        "3/4 cup (5.3 oz / 150 g) sugar",
        "3/4 teaspoon kosher salt",
        "2 eggs (3.5 oz / 100 g), at room temperature",
        "1 teaspoon vanilla extract",
        "1 cup (4.7 oz / 133 g) strawberries, cut into bite-sized pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Berry",
        "Citrus",
        "Fruit",
        "Nut",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Kid-Friendly",
        "Strawberry",
        "Lemon",
        "Tree Nut",
        "Pistachio",
        "Party",
        "Advance Prep Required",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Buckle with Lemon-Pistachio Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-buckle-with-lemon-pistachio-streusel-51119400"
}
