{
    "directions": [
        "Preheat oven to 425°F. Line baking sheet with parchment paper. Blend flour, 3 tablespoons sugar, baking powder, baking soda and salt in processor. Add butter and process using on/off turns until mixture resembles coarse meal. Add 1/2 cup buttermilk and process just until moist clumps form. Blend in chopped chocolate using on/off turns.",
        "Turn dough out onto lightly floured work surface. Dust lightly with flour. Gently press dough to 1/2-inch thickness. Using 3 1/4-inch cutter, cut out shortcakes. Gather dough scraps and press to 1/2-inch thickness; cut out additional shortcakes for a total of 6. Transfer shortcakes to prepared baking sheet. Brush shortcakes with remaining 1 tablespoon buttermilk. Sprinkle with 1 teaspoon sugar.",
        "Bake shortcakes until golden and tester inserted into center comes out clean, about 15 minutes. Transfer to rack and cool. (Can be prepared 8 hours ahead. Let stand at room temperature.)",
        "Toss strawberries, sugar and liqueur in large bowl. Let stand at room temperature until juices form, tossing occasionally, about 1 hour.",
        "Cut shortcakes horizontally in half. Place 1 shortcake bottom on each of 6 plates. Spoon 1/3 cup White Chocolate Mousse over each. Spoon some of strawberry topping over each. Cover each with shortcake top. Top each with spoonful of mousse, then more strawberry topping and serve."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "3 tablespoons plus 1 teaspoon sugar",
        "2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "1/2 cup plus 1 tablespoon chilled buttermilk",
        "3 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "2 1-pint baskets strawberries, hulled, quartered",
        "1/4 cup sugar",
        "1 tablespoon Grand Marnier or other orange liqueur",
        "White Chocolate Mousse"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Food Processor",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Strawberry",
        "Spring",
        "Summer",
        "Simmer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Shortcakes with White Chocolate Mousse",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-shortcakes-with-white-chocolate-mousse-103286"
}
