{
    "directions": [
        "Combine yeast, 1 tablespoon flour, 1 tablespoon sugar, and 2 tablespoons warm water in the bowl of a stand mixer*; let stand until yeast starts to foam, about 5 minutes.",
        "Whisk in egg yolks, whole egg, milk, orange zest, orange juice, brandy, if using, salt, vanilla, 2 cups flour, and remaining 1/4 cup sugar. Mix on low speed with dough hook until combined, about 2 minutes.",
        "Add 6 tablespoons butter 1 piece at a time, mixing well between additions. (Any small lumps of butter will get worked into dough when more flour is added.)",
        "Gradually add remaining 2 cups flour (you may not need all of it), mixing until mostly combined between additions, until dough is soft, smooth, and shiny—the dough will begin to pull away from the sides of bowl and climb up dough hook.",
        "*If you don't have a stand mixer, you can get the same results by mixing the dough with a sturdy wooden spoon and kneading on a lightly floured surface.",
        "Turn dough out onto a floured work surface and knead, adding more flour as needed, until no longer sticky, about 5 minutes. Transfer to a buttered bowl, turn to coat, and cover with a clean kitchen towel. Let rise in a warm, draft-free place until doubled in size, about 1 hour.",
        "Roll out dough on a lightly floured surface until 3/4\" thick. Using a floured cutter, cut out rounds of dough, twisting cutter to release the dough (this strengthens the edges so the dough puffs when frying). Reroll scraps once.",
        "Transfer rounds of dough to a parchment-lined baking sheet and cover loosely with another kitchen towel. Let rise until not quite doubled in size, 40–50 minutes.",
        "If you are not ready to fry dough, refrigerate rounds up to 3 hours.",
        "Fit a large heavy saucepan with thermometer; pour in vegetable oil to measure 4\" and heat over medium-high heat until thermometer registers 350°F. Working in batches, fry dough until golden, about 1 minute per side. Transfer to a paper towel–lined baking sheet and let cool slightly before filling.",
        "Pulse jam in a food processor until smooth (this will make it easier to pipe). Scrape jam into piping bag fitted with 1/4\" tip*. Insert tip into top of sufganiyot and gently fill until jam just pokes out of hole. Dust with powdered sugar just before serving.",
        "*If you don't have a piping bag, make a shallow hole with a toothpick, then use a plastic bag with a 1/4\" opening cut diagonally from 1 corner.",
        "Once you master the sufganiyot technique, you can swap in whatever preserve, pastry cream, or sugar coating you'd like."
    ],
    "ingredients": [
        "1 1/4-ounce envelope active dry yeast (about 2 1/4 teaspoon)",
        "3—4 cups all-purpose flour, divided, plus more for surface",
        "1 tablespoon plus 1/4 cup sugar",
        "2 large egg yolks",
        "1 large egg",
        "1/2 cup warm whole milk",
        "1/2 teaspoon finely grated orange zest",
        "2 tablespoons fresh orange juice",
        "1 tablespoon brandy (optional)",
        "1 teaspoon kosher salt",
        "1/2 teaspoon vanilla extract",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature, cut into pieces, plus more",
        "Vegetable oil (for frying; about 8 cups)",
        "1 1/2 cups strawberry jam",
        "Powdered sugar (for dusting)",
        "Special equipment: A deep-fry thermometer; piping bag, and 1/4\" round tip; 2 1/2\"-diameter biscuit or cookie cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Hanukkah",
        "Deep-Fry",
        "Jam or Jelly",
        "Pastry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Sufganiyot",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-sufganiyot-51198880"
}
