{
    "directions": [
        "Cut the ends off each orange. Cut the oranges in half crosswise and remove the seeds. Place the orange halves in a food processor and process until roughly pureed. Transfer to a nonreactive bowl. Add the rhubarb, strawberries and sugar and toss gently to combine. Cover and refrigerate for at least 8 hours or up to overnight.",
        "Have ready 7 hot, sterilized half-pint jars and their lids. Place 2 or 3 small plates in the freezer.",
        "Transfer the rhubarb mixture to a large nonreactive saucepan and add the lemon juice. Bring to a boil over medium-high heat, reduce the heat to medium and cook, uncovered, stirring frequently, for 10 minutes. Remove from the heat. To test if the jam is ready, put 1 tsp. of the jam on a chilled plate and place in the freezer for 2 minutes. The jam is ready if it wrinkles when nudged gently with a finger. If it doesn’t, continue to cook for 1 to 2 minutes more, remove from the heat and test again on a clean chilled plate.",
        "Ladle the hot jam into the jars, leaving 1/4 inch of headspace. Remove any air bubbles and adjust the headspace, if necessary. Wipe the rims clean and seal tightly with the lids.",
        "Process the jars in a boiling-water bath for 10 minutes. The sealed jars can be stored in a cool, dark place for up to 1 year. If a seal has failed, store the jar in the refrigerator for up to 1 month. Makes 7 half-pint jars.",
        "Adapted from",
        "The Art of Preserving,",
        "by Lisa Atwood, Rebecca Courchesne & Rick Field (Weldon Owen, 2010)."
    ],
    "ingredients": [
        "2 oranges, preferably blood oranges",
        "1 1/2 to 2 lb. rhubarb, cut into 1/2-inch chunks (about 6 cups)",
        "3 cups strawberries, hulled and sliced",
        "4 cups sugar",
        "1/2 cup fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Strawberry-Rhubarb Jam",
    "url": "http://www.williams-sonoma.com/recipe/strawberry-rhubarb-jam.html"
}
