{
    "directions": [
        "1. Preheat the oven to 400°F. Grease a baking sheet.",
        "2. Combine the flour, sugar and salt in a bowl.",
        "3. Add the butter. Using a pastry blender or your fingers, rub it into the dry ingredients until mixture resembles a coarse meal. Stir in the milk until a very soft dough is formed. Do not overwork.",
        "4. Drop the dough in 6 equal portions onto the prepared baking sheet. Lightly pat the dough into rounds—3 to 3 1/2 inches in diameter—and lightly brush the tops with the cream.",
        "5. Bake the shortcakes in the center of the oven for 15 to 20 minutes or until golden brown. Cool on a wire rack.",
        "1. Place strawberries in a bowl. Sprinkle with lemon juice and sugar, then gently toss with a rubber spatula. Let rest for 1 1/2 to 2 hours for juices to develop.",
        "2. Just before serving, whip cream with 1 Tbsp sugar until it holds soft peaks.",
        "3. To serve, slice off the top third of each shortcake. Place the bottoms on 6 dessert plates and top with 1/3 cup of the prepared berries and juice, plus a spoonful of whipped cream. Cover with the top. Spoon over more berries and juice, then dollop with whipped cream. Garnish each with a whole berry and drizzle with any remaining juice."
    ],
    "ingredients": [
        "4 pints strawberries, lightly rinsed, hulled and halved",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon sugar",
        "2 cups heavy (whipping) cream",
        "1 tablespoon sugar",
        "6 shortcakes (see recipe below), for serving",
        "6 whole strawberries, for garnish",
        "2 cups self-rising flour",
        "2 1/2 tablespoon sugar",
        "1/8 teaspoon salt",
        "1/2 cup (1 stick) cold, unsalted butter, cut into small pieces",
        "3/4 cup milk",
        "2 tablespoon heavy (whipping) cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Strawberry",
        "Lemon",
        "Summer",
        "Parade"
    ],
    "title": "Strawberry Shortcakes",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-shortcakes-242601"
}
