{
    "directions": [
        "Blend first 4 ingredients in processor until nuts are ground but some small pieces still remain. Add butter; cut in using on/off turns until mixture resembles fine meal. Blend in enough water by teaspoonfuls until mixture begins to form clumps. Gather dough into ball; flatten into disk. Press dough evenly over bottom and up sides of 9-inch-diameter tart pan with removable bottom. Freeze crust until firm, about 30 minutes. Preheat oven to 375°F. Bake crust until deep golden brown, about 30 minutes. Transfer to rack and cool.",
        "Place lime juice in small bowl; sprinkle gelatin over. Let stand 10 minutes to soften. Bring 1/4 cup cream to simmer in medium saucepan. Reduce heat to low. Add white chocolate; stir until melted and smooth. Add gelatin mixture; stir to dissolve. Mix in peel. Chill until cold and beginning to thicken but not set, stirring often, about 45 minutes. Beat sugar, sour cream and remaining 1/2 cup cream to medium-stiff peaks in medium bowl. Fold whipped cream mixture into white chocolate mixture. Spoon mousse into crust. Chill until mousse sets, about 4 hours. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Decoratively arrange berries atop mousse. Melt jam in small saucepan over low heat, stirring often. Brush enough jam over berries to glaze. (Can be made 4 hours ahead. Cover; chill.)"
    ],
    "ingredients": [
        "3/4 cup all purpose flour",
        "1/3 cup whole almonds, toasted",
        "1/3 cup powdered sugar",
        "1/4 teaspoon salt",
        "6 tablespoons chilled unsalted butter, cut into 1/2-inch pieces",
        "2 teaspoons (about) cold water",
        "1/4 cup fresh lime juice",
        "1/2 teaspoon unflavored gelatin",
        "3/4 cup chilled whipping cream",
        "5 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
        "1 teaspoon grated lime peel",
        "2 tablespoons sugar",
        "2 tablespoons sour cream",
        "3 12-ounce basket strawberries, hulled, sliced",
        "1/3 cup (about) seedless strawberry jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chocolate",
        "Dessert",
        "Bake",
        "Strawberry",
        "Lime",
        "Almond",
        "Spring",
        "Chill",
        "North Carolina"
    ],
    "title": "Strawberry-Topped Lime Mousse Tart",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-topped-lime-mousse-tart-1639"
}
