{
    "directions": [
        "Place strawberries, 2 tablespoons sugar, and salt in large bowl. Mash to coarse purée. Stir blueberries and 4 tablespoons sugar in large saucepan over medium heat until sugar dissolves and berries release juices, about 7 minutes. Increase heat; boil until mixture thickens slightly, stirring often, about 5 minutes. Remove from heat; add strawberry mixture.",
        "Line 6-cup bowl with 3 sheets plastic wrap, leaving 6-inch overhang. Generously butter 1 side of bread slices. Line bowl with bread, buttered side up, cutting pieces to cover bowl completely. Pour berry mixture into bread-lined bowl. Top with remaining bread, buttered side down, cutting pieces to cover completely. Fold plastic wrap over bread. Place plate slightly smaller than top of bowl atop pudding. Weigh down plate with 4 pounds of canned goods or dried beans and chill at least 12 hours and up to 36 hours.",
        "Beat cream, powdered sugar, and vanilla in large bowl until peaks form. Remove weights and plate from pudding. Open plastic wrap. Place large plate atop bowl and invert pudding. Remove bowl, then plastic. Spoon pudding onto plates. Serve with whipped cream."
    ],
    "ingredients": [
        "2 pounds strawberries, hulled, sliced (about 2 3/4 cups)",
        "6 tablespoons sugar, divided",
        "Pinch of salt",
        "1 pound blueberries (generous 3 cups)",
        "4 tablespoons (1/2 stick) unsalted butter, room temperature",
        "12 slices firm-textured white bread (such as Pepperidge Farm Original), crusts removed",
        "2 cups chilled whipping cream",
        "1/4 cup powdered sugar",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Berry",
        "Dairy",
        "Fruit",
        "Dessert",
        "Freeze/Chill",
        "Blueberry",
        "Strawberry",
        "Vanilla",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry and Blueberry Summer Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-and-blueberry-summer-pudding-238537"
}
