{
    "directions": [
        "Preheat oven to 350°F. Toast pistachios on a rimmed baking sheet, tossing once, until golden brown, 5–8 minutes. Let cool, then finely grind in a spice mill, or finely chop with a knife.",
        "Mix pistachios, flour, oats, brown sugar, lemon zest, poppy seeds, cardamom, and salt in a medium bowl. Using your fingers, work in butter until no dry spots remain and crumble holds together when squeezed. Chill while you make the pie filling.",
        "Toss strawberries, tapioca starch, granulated sugar, lemon zest, lemon juice, and salt in a large bowl to combine.",
        "Using a small offset spatula, spread cream cheese in an even layer over bottom of crust. Scrape strawberry mixture into crust, mounding into a dome. Sprinkle crumble evenly over top, breaking up any very large pieces.",
        "Place pie dish on a foil-lined rimmed baking sheet (to catch any rogue juices) and bake pie, tenting with foil if crumble starts to get too dark before filling is done, until crumble is brown and strawberry filling is bubbling around edges, 1 1/2–1 3/4 hours. Transfer to a wire rack and let cool before slicing, at least 4 hours.",
        "Top pie with chopped pistachios just before serving.",
        "Pie can be baked 1 day ahead. Store uncovered at room temperature."
    ],
    "ingredients": [
        "1/4 cup raw pistachios",
        "1/2 cup all-purpose flour",
        "1/2 cup old-fashioned oats",
        "1/4 cup (packed) light brown sugar",
        "1 teaspoon finely grated lemon zest",
        "1 teaspoon poppy seeds",
        "1/4 teaspoon ground cardamom",
        "1/4 teaspoon kosher salt",
        "6 tablespoons unsalted butter, chilled, cut into pieces",
        "2 pounds strawberries, hulled, halved if large (about 6 cups)",
        "5 tablespoons tapioca starch",
        "1/4 cup granulated sugar",
        "1 teaspoon finely grated lemon zest",
        "2 tablespoons fresh lemon juice",
        "1/4 teaspoon kosher salt",
        "2 tablespoons cream cheese, room temperature",
        "1 blind-baked Sister Pie Crust, cooled",
        "2 tablespoons chopped pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pie",
        "Strawberry",
        "Pistachio",
        "Summer",
        "Bake",
        "Michigan",
        "Poppy"
    ],
    "title": "Strawberry–Pistachio Crumble Pie",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-pistachio-crumble-pie"
}
