{
    "directions": [
        "Put oven racks in upper and lower thirds of oven and preheat oven to 350°F. Butter cake pans. Line bottom of each with a round of parchment paper, then butter parchment and dust cake pans with flour, knocking out excess.",
        "Whisk together yolks, 1 cup sugar, milk, vanilla, and zest in a large bowl until smooth. Whisk in flour and salt until combined (batter will be thick).",
        "Beat whites with a pinch of salt in a bowl using an electric mixer at medium-high speed until they just hold soft peaks. Add remaining 1/2 cup sugar, a little at a time, beating at medium speed, and continue to beat until whites hold stiff glossy peaks, about 2 minutes more.",
        "Fold about one third of whites into batter to lighten, then fold in remaining whites gently but thoroughly.",
        "Divide batter among cake pans and bake, switching position of cake pans halfway through baking, until cakes are springy to the touch and a wooden pick or skewer inserted in center of each comes out clean, 20 to 25 minutes. Cool cakes in pans on racks 10 minutes, then invert onto racks. Carefully peel off parchment, then cool cakes completely.",
        "Bring wine, sugar, and cardamom to a boil in a 1-quart heavy saucepan, stirring until sugar is dissolved, then boil until reduced to about 1 cup, 6 to 8 minutes. Strain syrup through a fine-mesh sieve and cool completely.",
        "Beat together heavy cream, sour cream, sugar, and vanilla in a bowl with cleaned beaters until cream just holds stiff peaks.",
        "Prick cake layers all over with wooden pick or skewer, then brush or pour syrup, little by little, evenly over each layer, letting syrup be absorbed before adding more.",
        "Transfer 1 layer (flat side up) to a cake stand or plate, then spread with a rounded cup of cream. Arrange some sliced strawberries in 1 layer over cream. Turn second layer over and spread a thin layer of cream over top, then place it, with the aid of a spatula, cream side down, over layer of strawberries. Continue making layers with cream, strawberries, and cake in same manner. Spread top with remaining cream and decorate with remaining strawberries."
    ],
    "ingredients": [
        "8 large egg yolks",
        "1 1/2 cups sugar",
        "1/4 cup whole milk",
        "1 teaspoon vanilla",
        "1/2 teaspoon finely grated fresh lemon zest",
        "1 cup all-purpose flour",
        "1/2 teaspoon salt",
        "4 large egg whites",
        "1 1/2 cups Muscat de Beaumes-de-Venise or Essensia (orange-flavored Muscat wine)",
        "1/4 cup sugar",
        "3/4 teaspoon ground cardamom",
        "2 cups chilled heavy cream",
        "1/2 cup sour cream",
        "2 tablespoons sugar",
        "1 teaspoon vanilla",
        "1 1/2 pound strawberries, 5 left whole and remainder trimmed and cut lengthwise into 1/4-inch-thick slices",
        "Special equipment: 3 (9- by 2-inch) round cake pans; parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Fruit",
        "Dessert",
        "Bake",
        "Wedding",
        "Strawberry",
        "Spice",
        "White Wine",
        "Summer",
        "Sour Cream",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry and Cream Cake with Cardamom Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-and-cream-cake-with-cardamom-syrup-109344"
}
