{
    "directions": [
        "Mix flour, 2 tablespoons sugar, orange peel and salt in medium bowl. Add butter and shortening and rub in, using fingertips, until mixture resembles coarse meal. Sprinkle orange juice over. Stir with fork until moist clumps form. Gather dough into ball; flatten into disk. Wrap in plastic and refrigerate at least 30 minutes. (Can be made 2 days ahead. Keep chilled. Soften slightly at room temperature before rolling out.)",
        "Preheat oven to 375°F. Butter heavy large baking sheet. Roll out dough on lightly floured surface to scant 1/4-inch-thick round. Using 3-inch round cookie cutter, cut out rounds. Reroll scraps and cut out additional rounds, forming 8 total. Transfer rounds to prepared baking sheet. Brush lightly with cream. Sprinkle with 1 tablespoon sugar, dividing equally. Bake cookies until light golden brown, about 15 minutes. Cool on baking sheet on rack.",
        "Combine quartered strawberries, 2 tablespoons sugar and Grand Marnier in medium bowl. Beat 1 cup whipping cream, vanilla and remaining 1 tablespoon sugar in another medium bowl until soft peaks form.",
        "Place 1 cookie on each of 4 plates. Top cookie with berry mixture, dividing equally and allowing mixture to spill over sides of cookies. Spoon large dollops of whipping cream over. Top each with second cookie. Garnish tops with small dollops of whipped cream and whole strawberries."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "6 tablespoons sugar",
        "1 teaspoon grated orange peel",
        "1/4 teaspoon salt",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into pieces",
        "2 tablespoons chilled solid vegetable shortening",
        "1 tablespoon orange juice",
        "Whipping cream",
        "1 1-pint basket strawberries, hulled, quartered",
        "1 tablespoon Grand Marnier or other orange liqueur",
        "1 cup chilled whipping cream",
        "2 teaspoons vanilla extract",
        "4 small strawberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Strawberry",
        "Orange",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Stacks",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-stacks-445"
}
