{
    "directions": [
        "Preheat oven to 375°F. Line baking sheet with parchment paper. Combine water, butter, salt and sugar in heavy medium saucepan. Bring to boil, stirring to melt butter. Add flour; using wooden spoon, stir vigorously until mixture clumps together, forming ball. Stir 1 minute longer. Remove from heat. Transfer dough to medium bowl. Using electric mixer, add eggs 1 at time, beating until dough is smooth after each addition (dough will be slightly soft and shiny).",
        "Using 1 rounded tablespoon dough for each cream puff, spoon dough onto prepared baking sheet, spacing about 2 inches apart and forming mounds about 3/4 inch to 1 inch high and 1 1/4 inches in diameter. Using moist fingertips, gently press tops of cream puffs flatten any peaks. Bake until golden brown, about 37 minutes. Transfer baking sheet to rack; let cream puffs cool. (Can be made 4 hours ahead. Let stand at room temperature.)",
        "Beat cream, 1 teaspoon sugar, kirsch and vanilla in medium bowl until stiff peaks form. Combine 6 strawberries and 2 tablespoons sugar in small bowl. Using fork, crush berries. Fold crush strawberry mixture into cream.",
        "Cut top third off each cream puff. Place cream puff bottoms, cut side up, on plates. Spoon filling into bottoms, mounding slightly. Ladle sauce over, allowing sauce to spill onto plates. Top with cream puff tops. Dust with powdered sugar.",
        "Puree 1 basket strawberries in processor. Transfer to bowl. Stir in sugar. Quarter remaining strawberries; add to sauce.",
        "Makes about 2 1/3 cups."
    ],
    "ingredients": [
        "3/4 cups water",
        "3 tablespoons unsalted butter, cut into pieces",
        "1/4 teaspoon salt",
        "1/4 teaspoon sugar",
        "3/4 cup all purpose flour",
        "3 large eggs",
        "1 cup chilled whipping cream",
        "1 teaspoon plus 2 tablespoons sugar",
        "1/4 teaspoon kirsch (clear cherry brandy)",
        "1/8 teaspoon vanilla extract",
        "6 large strawberries, hulled",
        "2 1-pint strawberries, hulled",
        "3 tablespoons sugar",
        "Powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Berry",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Kirsch",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Cream Puffs with Strawberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-cream-puffs-with-strawberry-sauce-1570"
}
