{
    "directions": [
        "For the strawberry shortcake: Preheat the oven to 350 degrees F. Grease and flour an 8-inch cake pan.",
        "Sift together the flour, cornstarch, baking soda and salt. In a stand mixer fitted with a paddle attachment, cream the butter with 1 1/2 cups of the granulated sugar until light and fluffy. Add the eggs one at a time, mixing well after each addition. Add the sour cream and vanilla, and mix until combined. Add the sifted dry ingredients and mix on low speed until just barely combined.",
        "Pour the batter into the prepared cake pan. Bake until no longer jiggly like my bottom, 45 to 50 minutes. Remove the cake from the pan as soon as you pull it out of the oven. Place the cake on a cooling rack and allow it to cool completely.",
        "Stem and halve the strawberries, and mash then them. Sprinkle the strawberries with the remaining 2 tablespoons granulated sugar and allow to sit for 30 minutes.",
        "For the icing: Combine the powdered sugar, cream cheese, butter, vanilla and dash of salt in a mixing bowl. Mix until very light and fluffy.",
        "Slice the cake in half to make 2 smaller cakes. Spread the strawberries evenly over each cut side of the cake halves, pouring on all the juices as well. Place the cake halves into the freezer for 5 minutes, just to make icing the cake easier.",
        "Remove the cake halves from the freezer. Use a little less than one-third of the icing to spread over the top of the strawberries on the bottom layer. Place the second layer of cake on top. Add half of the remaining icing to the top spreading evenly, then spread the remaining icing around the sides.",
        "Leave plain or garnish with strawberry halves. Serve slightly cool."
    ],
    "ingredients": [
        "9 tablespoons unsalted butter, softened, plus more for greasing",
        "1 1/2 cups all-purpose flour, plus more for dusting",
        "3 tablespoons cornstarch",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 1/2 cups plus 2 tablespoons granulated sugar",
        "3 whole large eggs",
        "1/2 cup sour cream, at room temperature",
        "1 teaspoon vanilla extract",
        "1 pound strawberries, plus more to garnish, optional",
        "1 1/2 pounds powdered sugar, sifted",
        "8 ounces cream cheese, at room temperature",
        "2 sticks unsalted butter, softened",
        "1 teaspoon vanilla extract",
        "Dash salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Strawberry Shortcake",
        "Fruit",
        "Strawberry",
        "Baking",
        "Dessert",
        "Cake"
    ],
    "title": "Strawberry Shortcake Cake",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/strawberry-shortcake-cake"
}
