{
    "directions": [
        "Preheat oven to 325°F. Spray 9-inch-diameter springform pan with nonstick spray. Whisk eggs, sugar, and vanilla in large metal bowl to blend. Set bowl over saucepan of simmering water (do not allow bowl to touch water); whisk constantly just until mixture is warm, about 2 minutes. Remove bowl from over water. Using electric mixer, beat mixture until very thick and ribbons form when beaters are lifted, about 7 minutes. Add flour in 3 additions, gently folding just to combine after each. Fold in poppy seeds, then quickly fold in butter in 2 additions (do not overfold). Pour batter into prepared pan.",
        "Bake cake until top is golden and tester inserted into center comes out clean, about 28 minutes. Cool completely in pan on rack. Remove pan sides.",
        "Line 4-quart 10-inch-diameter bowl with plastic wrap, leaving 8-inch overhang. Spread sorbet in even layer over bottom (not sides) of bowl. Spread ice cream over sorbet. Place cake atop ice cream, pressing slightly to compact. Cover with plastic wrap overhang; freeze at least 4 hours or overnight.",
        "Using electric mixer, beat egg whites in large bowl until soft peaks form. Gradually beat in sugar, 1 tablespoon at a time; beat until thick and glossy. Beat in vanilla.",
        "Unfold plastic wrap from over cake at top of bowl. Invert dessert onto 9-inch-diameter tart pan bottom; remove plastic wrap. Working quickly, spread meringue over dessert, swirling to form peaks and covering completely. Freeze at least 30 minutes. (Can be made 1 day ahead; keep frozen.)",
        "Preheat oven to 500°F. Place dessert on its tart pan bottom on heavy large baking sheet. Bake just until meringue is light golden, about 5 minutes. Transfer to platter. Serve immediately."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "4 large eggs",
        "1/2 cup sugar",
        "1 1/2 teaspoons vanilla extract",
        "3/4 cup sifted cake flour (sifted, then measured)",
        "1 tablespoon poppy seeds",
        "6 tablespoons (3/4 stick) unsalted butter, melted, cooled",
        "2 pints strawberry sorbet, softened",
        "1 quart strawberry ice cream, softened",
        "6 large egg whites",
        "3/4 cup sugar",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Strawberry",
        "Spring",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Baked Alaska",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-baked-alaska-106393"
}
