{
    "directions": [
        "In large bowl, sift together all-purpose and cake flours, sugar, baking powder, and salt. Use pastry cutter or fork to blend in butter until mixture resembles coarse meal.",
        "In medium bowl, whisk together buttermilk and cream, then whisk in lemon zest. Add liquid mixture to dry mixture, stirring with fork just until dough forms.",
        "Turn dough out onto floured work surface and knead gently just until dough holds together, about 10 turns. Place dough on plate, cover with plastic wrap, and refrigerate until well chilled, at least 30 minutes.",
        "Preheat oven to 400°F.",
        "On floured work surface, pat out dough to 1/2-inch-thick round. Using 3-inch cutter, cut out biscuits. Transfer to ungreased baking sheet, brush lightly with cream, and sprinkle with sugar. Bake until golden brown, 15 to 18 minutes, then transfer to rack to cool.",
        "In large mixing bowl, combine strawberries, Grand Mariner, 1/4 cup sugar, lemon juice, and salt. Mix gently, taste, and add more sugar if needed. Let stand at room temperature until juices form, at least 30 minutes.",
        "Chill medium mixing bowl and whisk in freezer for 10 minutes before beginning. In chilled bowl, whisk cream until it begins to foam and thicken. Add sugar and continue to whisk just until soft peaks form. Do not over-whip.",
        "Cut biscuits in half horizontally and place each bottom half in wide bowl or on plate. Divide compote among bowls, spooning strawberries onto biscuit bottoms and pouring some juice into each bowl. Top each shortcake with Chantilly Cream and biscuit top."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "2 cups cake flour",
        "1/2 cup sugar, plus more for sprinkling",
        "2 tablespoons baking powder",
        "Pinch (1/16 teaspoon) kosher salt",
        "1/2 cup cold butter (1 stick), cut into chunks",
        "1 cup well-shaken buttermilk",
        "1/2 cup cream, plus more for brushing",
        "Finely grated zest from one lemon",
        "4 pints strawberries, stems removed and quartered",
        "1/2 cup Grand Mariner",
        "1/4 to 1/2 cup sugar",
        "2 tablespoons fresh lemon juice",
        "Pinch (1/16 teaspoon) kosher salt",
        "1 cup cold heavy cream",
        "2 tablespoons confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Strawberry",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Shortcake with Grand Marnier Strawberry Compote and Chantilly Cream",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-shortcake-with-grand-marnier-strawberry-compote-and-chantilly-cream-235525"
}
