{
    "directions": [
        "Combine first 5 ingredients in heavy large saucepan or Dutch oven. Bring to boil over medium heat, stirring until sugar dissolves. Reduce heat to medium-low; cover and simmer until rhubarb is tender but some pieces remain intact, about 7 minutes. Remove from heat and add allspice. Cool completely. Stir in strawberries. Cover and refrigerate until well chilled, at least 3 hours or overnight.",
        "Position rack in center of oven and preheat to 400°F. Combine first 5 ingredients in medium bowl. Add butter and cut in using pastry blender or rub with fingertips until mixture resembles coarse meal. Add 3/4 cup plus 3 tablespoons cream and stir until dough comes together.",
        "Turn out dough onto lightly floured work surface and knead until smooth, about 6 turns. Flatten dough to 3/4-inch-thick round. Cut out rounds using 2 3/4-inch-diameter plain or scalloped cookie cutter. Gather dough scraps and shape into 3/4-inch-thick round. Cut out additional dough rounds.",
        "Transfer rounds to heavy large ungreased baking sheet. Bake until biscuits are puffed and golden, about 23 minutes. Transfer biscuits to rack and cool slightly. (Can be prepared 2 hours ahead. Rewarm biscuits in 350°F. oven just until heated through, about 5 minutes.)",
        "Cut biscuits in half. Place 1 bottom half on each plate. Spoon 1/4 cup compote over each. Top with large spoonful sweetened compote, then more whipped cream. Cover with biscuits tops. Garnish with mint sprigs and serve."
    ],
    "ingredients": [
        "4 cups 3/4-inch-thick slices fresh rhubarb (about 1 1/2 pounds)",
        "3/4 cup sugar",
        "2 tablespoons water",
        "2 tablespoons strawberry preserves",
        "1 teaspoon minced orange peel",
        "1/4 teaspoon ground allspice",
        "1 1-pint basket strawberries, hulled, thickly sliced",
        "2 1/4 cups all purpose flour",
        "6 tablespoons sugar",
        "4 1/2 teaspoons baking powder",
        "1 1/2 tablespoons minced orange peel (orange part only)",
        "1/4 teaspoon salt",
        "9 tablespoons chilled unsalted butter, cut into pieces",
        "3/4 cup plus 3 tablespoons chilled whipping cream",
        "2 cups chilled whipping cream, sweetened, softly whipped",
        "Mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Kid-Friendly",
        "Strawberry",
        "Spring",
        "Chill",
        "Rhubarb",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry-Rhubarb Shortcakes",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-rhubarb-shortcakes-1773"
}
