{
    "directions": [
        "Preheat oven to 350°F. Line 2 large baking sheets with parchment paper. Place 1 phyllo sheet on work surface (cover remaining phyllo with plastic wrap, then damp kitchen towel). Brush phyllo sheet with some melted butter and sprinkle with 1/2 teaspoon sugar. Top with second phyllo sheet. Brush with some melted butter and sprinkle with 1/2 teaspoon sugar. Repeat with 2 more phyllo sheets, brushing each with melted butter and sprinkling each with 1/2 teaspoon sugar. Cut phyllo stack in half lengthwise; cut crosswise into thirds, creating six 4 1/4-inch squares. Transfer squares to 1 prepared baking sheet, spacing evenly apart. Repeat with 4 more phyllo sheets to create 6 more squares; transfer to second baking sheet, spacing evenly apart. Bake phyllo until light golden, about 7 minutes. Using spatula, transfer phyllo stacks to rack and cool completely. Repeat with remaining phyllo sheets, butter, and sugar to make 36 squares total. (Phyllo squares can be made up to 2 days ahead. Store between layers of waxed paper in airtight container at room temperature.)",
        "Bring vinegar and 4 teaspoons sugar to boil in small saucepan over medium-high heat. Reduce heat to low and simmer until syrupy and reduced to 1/4 cup, about 25 minutes. Refrigerate until cold, about 1 hour. (Can be prepared 1 day ahead. Refrigerate.)",
        "Beat mascarpone, cream, vanilla extract, and remaining 1/2 cup sugar in large mixing bowl until stiff peaks form. (Mascarpone filling can be prepared 1 day ahead. Cover and refrigerate.)",
        "Set aside 1/4 of strawberries and blueberries for garnish. Place 12 phyllo squares on work surface. Spread each with 1 tablespoon mascarpone filling. Cover with remaining sliced strawberries. Spread 1 tablespoon filling over strawberries. Place another 12 phyllo squares atop filling with corners slightly askew to bottom square. Spread each square with 1 tablespoon filling. Cover with remaining blueberries. Spread 1 more tablespoon filling over blueberries. Top with final 12 phyllo squares with corners slightly askew to middle square. (Can be made 3 hours ahead. Place napoleons on 2 large baking sheets. Cover and refrigerate.)",
        "Spoon dollop of filling atop each napoleon. Garnish with reserved straw-berry slices and blueberries. Dust with powdered sugar. Place 1 napoleon in center of each plate. Drizzle balsamic reduction around edge of plates.",
        "*Italian cream cheese, available at Italian markets and many supermarkets."
    ],
    "ingredients": [
        "24 9x14-inch sheets fresh or thawed frozen phyllo pastry (about 3/4 pound)",
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "16 teaspoons plus 1/2 cup sugar",
        "2/3 cup balsamic vinegar",
        "1 pound mascarpone cheese,* whisked to loosen",
        "1 cup chilled heavy whipping cream",
        "2 teaspoons vanilla extract",
        "3 1-pint baskets fresh strawberries, hulled, thinly sliced",
        "4 1/2-pint baskets fresh blueberries",
        "Powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Berry",
        "Dairy",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Vinegar",
        "Summer",
        "Chill",
        "Phyllo/Puff Pastry Dough",
        "Pastry",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry-Blueberry Napoleons",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-blueberry-napoleons-108260"
}
