{
    "directions": [
        "Preheat the oven to 350°F. Sift together the flour and baking powder, and set aside.",
        "In the bowl of a stand mixer or in a bowl with a handheld electric mixer, cream together the butter and sugar until light and fluffy, approximately 3 to 5 minutes.",
        "Add the egg yolks, orange juice, and vanilla extract, and mix slowly.",
        "Add the flour mixture to the butter mixture, and mix slowly until a dough forms.",
        "Remove the dough from the mixer, and knead with your hands until it’s stretchy. Place the dough between two sheets of parchment paper and, using a rolling pin, roll flat.",
        "Remove the top sheet of parchment paper and cut the dough in half. Punch out the “solid” bottom halves of the cookies on one half of the dough. Punch out the “heart window” top halves of the cookies on the other half of the dough.",
        "Arrange cookies on a cookie sheet lined with parchment paper and bake for 8 to 10 minutes. Remove before browned, and let cool completely.",
        "Carefully spread strawberry preserves on the solid bottom halves of the cookies, and place the heart window part of each cookie on top. Serve and enjoy!"
    ],
    "ingredients": [
        "6 cups sifted all-purpose flour",
        "1 teaspoon baking powder",
        "2 cups unsalted butter",
        "2 cups sifted confectioners’ sugar",
        "2 large egg yolks",
        "1/2 cup orange juice",
        "1 teaspoon pure vanilla extract",
        "6 cups strawberry preserves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Cookies",
        "Bake",
        "Strawberry",
        "Orange",
        "Valentine's Day",
        "Jam or Jelly",
        "Kid-Friendly",
        "Dessert"
    ],
    "title": "Babee’s Strawberry Shortbread Valentine’s Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-shortbread-valentines-cookies"
}
