{
    "directions": [
        "Preheat oven to 325°F. Butter 9-inch-diameter springform pan with 2 3/4-inch-high sides. Grind cookies in processor to coarse crumbs. Add butter and blend until crumbs are evenly moistened. Press crumb mixture over bottom and 1 inch up sides of prepared pan. Bake crust until just golden, about 8 minutes. Set aside while preparing filling. Maintain oven temperature.",
        "Puree thawed strawberries and juices in processor until smooth. Measure 3/4 cup puree (reserve any remaining puree for another use); do not wash bowl. Add cream cheese and sugar to processor. Blend until smooth. Using on/off turns, blend in flour. Add eggs; process until smooth, scraping down sides of bowl occasionally. Add 3/4 cup strawberry puree, lemon juice, vanilla extract, and almond extract; process until well blended. Transfer filling to prepared crust.",
        "Bake cake until center is softly set and edges begin to color, puff and crack, about 1 hour 15 minutes. Place hot cheesecake on rack. Refrigerate uncovered on rack until cold, at least 4 hours. (Can be made 2 days ahead. Cover and keep refrigerated.)",
        "Using small knife, cut around pan sides to loosen cake; remove pan sides. Stir jelly in heavy saucepan over low heat until melted. Arrange berry halves atop cheesecake in concentric circles; brush with warm jelly to glaze. Chill at least 1 hour and up to 8 hours."
    ],
    "ingredients": [
        "1 10-ounce package shortbread cookies (such as Lorna Doone)",
        "5 tablespoons unsalted butter, melted",
        "10 ounces frozen unsweetened strawberries (about 2 3/4 cups), thawed, juices reserved",
        "3 8-ounce packages cream cheese, room temperature",
        "1 cup sugar",
        "2 tablespoons all purpose flour",
        "3 large eggs",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon almond extract",
        "1/3 cup strawberry or currant jelly",
        "3 1-pint baskets fresh strawberries, hulled, halved lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Strawberry",
        "Spring",
        "Shavuot",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry-Strawberry Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-strawberry-cheesecake-106342"
}
