{
    "directions": [
        "Using electric mixer, beat butter and sugar in large bowl until light and fluffy, about 4 minutes. Beat in egg yolk and vanilla. Mix in flour and salt until just combined. Gather into ball. Flatten into disk, wrap in plastic, and chill at least 30 minutes and up to 1 day.",
        "Preheat oven to 350°F. Roll out dough on lightly floured surface to 14-inch round. Transfer dough to 10-inch-diameter tart pan with removable bottom. Press sides in firmly; trim overhang. Freeze until firm, about 10 minutes. Bake until golden brown, pressing any bubbles that form with back of fork, about 25 minutes. Remove crust from oven and cool.",
        "Whisk sugar and cornstarch in medium saucepan. Gradually add 1/2 cup milk, whisking until smooth. Whisk in remaining 2 cups milk, then next 3 ingredients. Add vanilla bean. Stir over medium-high heat until mixture thickens and boils, about 8 minutes. Remove from heat. Whisk in cream cheese, several cubes at a time, until melted. Strain warm filling through sieve into bowl; pour mixture into prepared crust. Refrigerate overnight.",
        "Place strawberries in medium bowl. Bring next 3 ingredients to boil in small saucepan over medium-high heat, stirring until sugar dissolves. Pour over berries and toss to coat. Let stand about 10 minutes, stirring occasionally. Pour into colander to drain excess syrup.",
        "Mound berries atop tart, leaving 1-inch plain border. Garnish with herb sprigs, if desired."
    ],
    "ingredients": [
        "14 tablespoons (1 3/4 sticks) unsalted butter, room temperature",
        "3/4 cup powdered sugar",
        "1 large egg yolk",
        "1 1/2 teaspoons vanilla extract",
        "2 1/4 cups all purpose flour",
        "1/4 teaspoon salt",
        "3/4 cup sugar",
        "1 1/2 tablespoons cornstarch",
        "2 1/2 cups whole milk, divided",
        "3 large egg yolks",
        "1 1/2 tablespoons fresh lemon juice",
        "3/4 teaspoon finely grated lemon peel",
        "1 vanilla bean, split lengthwise",
        "4 ounces cream cheese, room temperature, diced",
        "5 cups whole strawberries (about 1 1/2 pounds), hulled, halved",
        "1/2 cup sugar",
        "1/4 cup water",
        "1 teaspoon fresh lemon juice",
        "Fresh mint or tarragon sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Cream Cheese",
        "Strawberry",
        "Vanilla",
        "Summer",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Cream Cheese Tart",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-cream-cheese-tart-234743"
}
