{
    "directions": [
        "Preheat oven to 350°F. Butter two 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottoms with parchment. Using electric mixer, beat butter until light. Add 1 cup plus 2 tablespoons sugar and beat until fluffy. Beat in eggs 1 at a time. Beat in 2 teaspoons vanilla. Sift flour, baking powder, 1 teaspoon nutmeg and salt into medium bowl. Fold into butter mixture. Gently mix in milk.",
        "Divide batter between prepared pans. Bake cakes until firm to touch about 30 minutes. Cool cakes in pans on racks 15 minutes. Turn out cakes onto racks and cool completely.",
        "Split each cake into 2 layers, using serrated knife. Combine cream, 6 tablespoons sugar, 1 teaspoon vanilla and 1 teaspoon nutmeg in bowl. Beat to stiff peaks. Place 1 cake layer, cut side up, on platter. Spread with 3/4 cup compote, then 1 cup cream. Repeat layering with 2 more cake layers, compote and cream. Top with last cake layer, cut side down. Cover cake and chill 1 hour. (Can be prepared 6 hours ahead. Keep refrigerated.)",
        "Dust with powdered sugar. Arrange berries atop cake. Serve, spooning some of remaining compote over each slice.",
        "Combine rhubarb, sugar and water in heavy medium saucepan. Bring just to boil. Reduce heat, cover and cook just until rhubarb is tender, about 5 minutes. Remove from heat; mix in berries, vanilla and nutmeg. Chill until cold. (Can be made 1 day ahead. Keep chilled.)"
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 cup plus 8 tablespoons sugar",
        "4 eggs",
        "3 teaspoons vanilla extract",
        "2 3/4 cups all purpose flour",
        "4 teaspoons baking powder",
        "2 teaspoons ground nutmeg",
        "1 teaspoon salt",
        "1/4 cup milk",
        "1 1/2 cups chilled whipping cream",
        "Powdered sugar",
        "1 1-pint basket strawberries, stemmed",
        "Makes about 3 1/2 cups",
        "4 cups 1/2-inch-thick rhubarb slices (about 1 generous pound)",
        "1/2 cup sugar",
        "2 tablespoons water",
        "1 16-ounce package frozen sliced sweetened strawberries, thawed",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon ground nutmeg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Berry",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Strawberry",
        "Spice",
        "Spring",
        "Winter",
        "Chill",
        "Rhubarb",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry-Rhubarb \"Courting\" Cake",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-rhubarb-courting-cake-1827"
}
