{
    "directions": [
        "Sprinkle gelatin over cold water in small bowl; let stand until soft, about 10 minutes. Combine lemonade concentrate, sugar, butter, yolks and egg in medium metal bowl. Set bowl over saucepan of simmering water; whisk until candy thermometer registers 160°F., about 5 minutes. Remove from over water; whisk in gelatin mixture. Strain into large bowl. Set in larger bowl or ice water. Stir until mixture is cool and beginning to thicken but not set, about 10 minutes. Beat cream in medium bowl to firm peaks; fold into lemon mixture. Chill at least 4 hours.",
        "Preheat oven to 350°F. Place 1 phyllo sheet on work surface (cover remaining phyllo with plastic wrap and damp towel). Brush phyllo with butter; sprinkle with sugar. Repeat with remaining phyllo, butter and sugar. Cut phyllo stack into twenty 3-inch squares. Transfer squares to baking sheets. Bake until dark golden, watching closely, about 12 minutes. Transfer to racks; cool. (Lemon cream and phyllo squares can be made 1 day ahead. Keep cream chilled. Store phyllo squares airtight at room temperature.)",
        "Simmer 2 1/4 cups sliced strawberries and 6 tablespoons sugar in heavy medium saucepan until strawberries are soft, stirring occasionally, about 5 minutes. Purée in processor. Strain into small bowl. Chill.",
        "Place 10 phyllo squares on work surface. Transfer lemon cream to pastry bag fitted with large star tip. Pipe lemon cream over squares, leaving 1/2-inch border on sides. Arrange sliced berries in single layer over cream. Pipe small rosette of cream atop berries. Top each with phyllo square. Pipe rosette of cream atop phyllo. Sprinkle with powdered sugar. Garnish each with whole berry. Serve with sauce."
    ],
    "ingredients": [
        "1 teaspoon unflavored gelatin",
        "2 tablespoons cold water",
        "3/4 cup frozen lemonade concentrate, thawed",
        "6 tablespoons sugar",
        "6 tablespoons (3/4 stick) unsalted butter",
        "4 large egg yolks",
        "1 large egg",
        "1/2 cup chilled whipping cream",
        "5 fresh phyllo pastry sheets or frozen, thawed",
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "5 tablespoons sugar",
        "4 1/2 cups sliced hulled strawberries",
        "6 tablespoons sugar",
        "Powdered sugar",
        "10 whole strawberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Strawberry",
        "Lemon",
        "Summer",
        "Chill"
    ],
    "title": "Strawberry Napoleons with Lemon Cream",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-napoleons-with-lemon-cream-5851"
}
