{
    "directions": [
        "In the bowl of a stand mixer, using the paddle attachment, or in a bowl with a handheld electric mixer, mix the egg yolks and the sugar for 4 to 5 minutes.",
        "In another large bowl, sift together the flour and the cornstarch.",
        "Add the flour mixture to the egg mixture slowly, mixing on low speed for 1 to 2 minutes or until smooth.",
        "In a medium saucepan, warm the milk on medium heat, just until it starts to boil.",
        "Switch your mixer to the whisk attachment, then add the hot milk slowly to the mixer, and whisk continuously at medium speed while pouring the milk, to keep the mixture smooth, without lumps or curdles.",
        "Add the heavy cream, rum extract, vanilla extract, and vanilla bean seeds and mix thoroughly for 2 to 3 minutes.",
        "Then pour the mixture back into the saucepan and cook over medium heat until it boils. Note: It must be hand-whisked constantly during this time. After it reaches boiling, whisk for 2 more minutes, until it thickens.",
        "Remove from heat. Let it come to room temperature before pouring in a bowl. Refrigerate for at least 2 hours to chill.",
        "Preheat the oven to 350°F. Line two cupcake pans with twelve paper baking cups each, or grease pans with butter if not using baking cups.",
        "Sift together the flour, baking powder, and salt in a bowl, and set aside.",
        "Place the butter in the bowl of a stand mixer or in a bowl with a handheld electric mixer. Add the sugar; beat on medium speed until well incorporated, approximately 3 to 5 minutes.",
        "Add the eggs one at a time, mixing slowly after each addition.",
        "Combine the vanilla extract and milk in a large liquid measuring cup. Carefully scrape the vanilla bean seeds from the milk.",
        "Add one third of the flour mixture to the butter mixture, then gradually add one third of the milk mixture, beating slowly until well incorporated. Add another third of the flour mixture, followed by another third of the milk mixture. Stop to scrape down the bowl as needed. Add the remaining flour mixture, followed by the remaining milk mixture, and beat just until combined.",
        "Using a spatula, gently fold into the strawberries.",
        "Scoop batter into baking cups so that each is two-thirds full, and bake for 15 to 18 minutes or until a toothpick inserted into the center of the cupcake comes our clean. Transfer the pans to a wire rack to cool completely.",
        "Place all of the ingredients in the bowl of a stand mixer or in a bowl with a handheld electric mixer. Beat until well incorporated and the frosting is light and fluffy, approximately 3 to 4 minutes.",
        "Once cooled, peel the wrappers off the strawberry cupcakes and slice in half length-wise. Add a tablespoon of the filling on top of the bottom half of the strawberry cupcake; add a layer of sliced strawberries; cover with the top to make a cupcake “sandwich”; then frost with a swirl and garnish with a strawberry slice."
    ],
    "ingredients": [
        "2 large egg yolks",
        "1/4 cup sugar",
        "1/4 cup sifted all-purpose flour",
        "1/4 cup cornstarch",
        "1 cup whole milk",
        "2 tablespoons heavy cream",
        "1/4 teaspoon rum extract",
        "1 teaspoon pure vanilla extract",
        "Seeds from 1 vanilla bean",
        "2 1/2 cups sifted all-purpose flour",
        "2 1/2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "8 tablespoons unsalted butter",
        "1 3/4 cups sugar",
        "2 large eggs",
        "2 1/4 teaspoons pure vanilla extract",
        "1 1/4 cups whole milk",
        "Seeds from 1 vanilla bean",
        "1 cup fresh strawberries, diced",
        "16 tablespoons unsalted butter",
        "4 cups sifted confectioners’ sugar",
        "1 teaspoon whole milk",
        "1 teaspoon pure vanilla extract",
        "1/4 teaspoon salt",
        "1/2 cup diced strawberries",
        "24 fresh strawberries, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Dessert",
        "Cupcake",
        "Strawberry",
        "Valentine's Day",
        "Kid-Friendly",
        "Bake"
    ],
    "title": "Strawberry Shortcake Cupcakes",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-shortcake-cupcakes"
}
