{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. Whisk together 2 cups of flour and 2 tablespoons of sugar in a bowl; use a pastry cutter to cut the butter into the flour mixture until the mixture  resembles coarse crumbs. Press the crust into the bottom and up the sides of the prepared baking dish.",
        "Bake crust in the preheated oven until lightly browned, about 20 minutes.",
        "Mix together 2 cups of sugar, 1/3 cup of flour, salt, egg yolks, and cream in a large bowl until well combined; stir in the rhubarb and strawberries. Pour the filling into the baked crust.",
        "Return to oven, and bake until the filling is set, 50 to 60 more minutes.",
        "Meanwhile, place egg whites and cream of tartar in a large mixing bowl, and beat with an electric mixer on medium-high speed until the whites form soft peaks; gradually beat in 3/4 cup of sugar until the mixture forms glossy, stiff peaks; beat in the vanilla extract. Remove the dessert from the oven, and top with the meringue, swirling and lifting your spatula to make decorative peaks and swirls. Return to oven, and bake until the meringue is pale golden brown, about 15 more minutes. Cool the pie to room temperature, then chill to serve."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "2 tablespoons white sugar",
        "1 cup cold butter",
        "2 cups white sugar",
        "1/3 cup all-purpose flour",
        "1 teaspoon salt",
        "6 egg yolks",
        "1 cup heavy cream",
        "5 cups thinly sliced rhubarb",
        "2 cups thinly sliced strawberries",
        "6 egg whites",
        "1/2 teaspoon cream of tartar",
        "3/4 cup white sugar",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Strawberry Rhubarb Meringue Dessert",
    "url": "http://allrecipes.com/recipe/216997/strawberry-rhubarb-meringue-dessert/"
}
