{
    "directions": [
        "In a medium bowl, whisk together sugar, flour and egg yolks until thick and smooth, 3 to 5 minutes.",
        "In a medium pot, bring the milk and vanilla bean to a gentle boil. Pour about half of the milk mixture over the eggs whisking constantly. Pour the whole mix back into the pot and place the pot back over low heat, stirring with a wooden spoon, until the mixture thickens, 3 to 5 minutes. Note: you must stir this mixture constantly, scraping the bottom as you stir, so the flour doesn't stick to the bottom and burn.",
        "Remove the pot from the stove and whisk in the marzipan. Pour the mixture onto a baking sheet lined with plastic wrap and cover it with a coating of plastic wrap. Place the tray in the refrigerator to cool.",
        "In a medium skillet over low heat, melt the granulated sugar. Spray a tray with a light coating of nonstick spray. Spray the end of a wooden spoon as well. When the sugar turns light brown, add the almonds and stir to coat them with the sugar. Spoon the almonds on to the baking sheet and sprinkle lightly with salt.",
        "When the almond cream has cooled, remove and discard the vanilla bean and place the pastry cream in a medium bowl. Whisk until it is smooth. In another medium bowl, toss the strawberries and brown sugar together.",
        "Place 4 to 6 glasses on a flat surface. Begin by spooning a thin layer of almond cream in the bottom of each. Sprinkle with a few almonds. Add a layer of the whipped cream. Top with a layer of strawberries. Repeat the layers until the glasses are full. Refrigerate for a while before serving or enjoy immediately."
    ],
    "ingredients": [
        "1/2 cup granulated sugar",
        "2 tablespoons all-purpose flour",
        "4 egg yolks",
        "1 1/4 cups whole milk",
        "1 vanilla bean, split and scraped",
        "3 ounces marzipan",
        "1/3 cup granulated sugar",
        "Nonstick spray",
        "1 3/4 cups slivered almonds, lightly toasted",
        "Kosher salt",
        "12 ounces fresh strawberries, hulled washed and quartered",
        "1 tablespoon light brown sugar",
        "1/2 cup heavy cream, lightly whipped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Fruit Dessert Recipes",
        "Fruit",
        "Strawberry",
        "Nut Recipes",
        "Sugar",
        "Dairy Recipes",
        "Egg Recipes"
    ],
    "title": "Strawberry and Almond Cream Parfait",
    "url": "http://www.foodnetwork.com/recipes/alexandra-guarnaschelli/strawberry-and-almond-cream-parfait-recipe"
}
