{
    "directions": [
        "Beat together butter, confectioners sugar, and yolks with an electric mixer at low speed until just combined. Increase speed to medium-high and beat until pale and fluffy. Reduce speed to medium and beat in flour until just combined. Form dough into a disk and chill, wrapped in plastic wrap, at least 1 hour.",
        "Purée peach, apricot, and half of mango (save remaining for filling) with superfine sugar and boiling water in a blender until smooth, then force through a fine-mesh sieve into a bowl, discarding solids. Chill coulis, loosely covered.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Let dough stand at room temperature until just soft enough to roll out, about 10 minutes. Roll out dough on a lightly floured surface with a lightly floured rolling pin to 3/4 inch thick. Cut out 8 rounds with ring mold and arrange, about 1 inch apart, on an ungreased baking sheet. (Chill scraps for another use.) Bake cookies until edges are beginning to brown and tops are still very pale, about 10 minutes. Cool cookies on a rack.",
        "Halve passion fruits crosswise and scrape pulp with seeds into cleaned blender. Add remaining half of mango, grenadine (if using), and superfine sugar, then purée. Force purée through sieve into a large bowl. Beat in cream with cleaned beaters at high speed until it just holds stiff peaks.",
        "Divide coulis among 4 plates. Center 1 cookie in coulis on 1 plate. Place ring mold used to cut dough on top of cookie. Arrange strawberry halves cut sides against inside of mold and points of berries pointing up. Spoon one fourth of cream filling into center of mold, then remove ring and top with a cookie. Dust top with confectioners sugar. Assemble 3 more sablés in same manner."
    ],
    "ingredients": [
        "1 3/4 sticks (3/4 cup plus 2 tablespoons) unsalted butter, softened",
        "1 1/3 cups confectioners sugar",
        "2 large egg yolks",
        "2 cups all-purpose flour",
        "1 peach, pitted and cut into pieces",
        "1 apricot, pitted and cut into pieces",
        "1 mango, peeled and fruit cut from pit",
        "1/3 cup superfine granulated sugar",
        "1/4 cup boiling-hot water",
        "6 passion fruits",
        "2 teaspoons grenadine (optional)",
        "2 tablespoons superfine granulated sugar",
        "1 1/2 cups chilled heavy cream",
        "1 1/2 lb small (1-inch) strawberries, trimmed and halved lengthwise",
        "Confectioners sugar for dusting",
        "Special equipment: a 3 1/2- by 1 1/2-inch ring mold or round biscuit cutter without a handle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Strawberry",
        "Apricot",
        "Peach",
        "Mango",
        "Summer",
        "Passion Fruit",
        "Gourmet"
    ],
    "title": "Strawberry Passion-Fruit Sables",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-passion-fruit-sables-109550"
}
