{
    "directions": [
        "Preheat oven to 350°F.",
        "In food processor, process cookies and walnuts until finely ground. Press crumbs onto bottom and 1 inch up sides of 9-inch-diameter springform pan. Bake until golden and fragrant, about 10 minutes. Transfer to rack to cool.",
        "In medium saucepan over moderate heat, combine sliced strawberries, rhubarb, and 1/3 cup sugar. Simmer, stirring often, until soft, about 6 minutes. Remove pan from heat and set aside.",
        "In large metal bowl using handheld electric mixer, beat eggs and remaining 1/2 cup sugar until foamy. Beat in hot strawberry-rhubarb mixture. Place bowl atop saucepan of barely simmering water and beat at moderately high speed until instant-read thermometer registers 140°F, about 5 minutes. Turn off heat and continue beating 3 minutes more. Remove bowl from saucepan and let custard cool, stirring occasionally, until room temperature. Cover and chill 30 minutes.",
        "In large bowl, combine mascarpone, 1/4 cup heavy cream, and vanilla. Using handheld electric mixer with clean beaters, beat mixture at low speed until combined. Gradually beat in remaining cream, then beat at moderately high speed until mixture just holds stiff peaks. Fold mixture into chilled custard, then pour into springform pan, smoothing top. Wrap well in plastic wrap and freeze until firm but not frozen solid, about 3 hours.",
        "To serve, unwrap and let stand at room temperature 20 minutes to soften slightly. Place tart on serving platter and remove sides of pan. Garnish with remaining strawberries."
    ],
    "ingredients": [
        "2 (5 1/3-ounce) boxes all-butter shortbread cookies, broken into pieces",
        "1/2 cup walnut halves",
        "1 pint strawberries, enough hulled and thinly sliced to make 3/4 cup, and remainder reserved for garnish",
        "1/2 pound fresh rhubarb stalks, peeled and sliced crosswise into 1/2-inch chunks",
        "1/3 cup plus 1/2 cup sugar",
        "2 large eggs",
        "1/2 cup mascarpone cheese",
        "1 1/2 cups heavy cream",
        "1 teaspoon pure vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mixer",
        "Berry",
        "Cheese",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Chill",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry-Rhubarb Semifreddo",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-rhubarb-semifreddo-238008"
}
