{
    "directions": [
        "Position rack in center of oven and preheat to 400°F. Line 15 x 10 x 1-inch baking sheet with waxed paper, extending 2 inches over ends of pan. Butter waxed paper. Beat egg whites in large bowl until soft peaks form. Gradually add 1 1/4 cups sugar, beating until meringue is stiff and shiny.",
        "Spread meringue evenly in prepared baking sheet. Bake until pale golden, about 8 minutes. Reduce oven temperature to 325°F. Bake until meringue is slightly firm to touch on top but soft inside, about 8 minutes longer. Remove baking sheet from oven. Run knife around pan sides to loosen meringue. Turn out onto sheet of waxed paper. Carefully peel off waxed paper. Cool meringue 25 minutes.",
        "Whip cream and vanilla in medium bowl to stiff peaks. Mix sliced strawberries and preserves in another medium bowl. Spoon strawberry mixture over meringue, leaving 1-inch border on all sides. Spread whipped cream over strawberry mixture. Starting at 1 long side, gently roll up meringue jelly-roll style, enclosing filling. Place roulade, seam side down, on platter. Refrigerate at least 1 hour and up to 4 hours.",
        "Dust roulade with powdered sugar. Cut into slices. Transfer to plates. Garnish with whole strawberries, if desired. Serve roulade chilled."
    ],
    "ingredients": [
        "4 large egg whites",
        "1 1/4 cups sugar",
        "1 1/4 cups chilled whipping cream",
        "2 teaspoons vanilla extract",
        "1 12-ounce basket strawberries, sliced (about 2 1/2 cups)",
        "1/2 cup strawberry preserves",
        "Powdered sugar",
        "Whole strawberries (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Strawberry",
        "Summer",
        "Chill",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Strawberry Meringue Roulade",
    "url": "http://www.epicurious.com/recipes/food/views/strawberry-meringue-roulade-101972"
}
