{
    "directions": [
        "Bring water and freekeh to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until freekeh is tender and liquid has been absorbed, 20 to 30 minutes.",
        "Heat 1 tablespoon olive oil in a large skillet over medium heat; cook and stir onion, green bell pepper, tofu, mushrooms, garlic, and serrano chile pepper until vegetables are tender and tofu is lightly browned, 10 to 15 minutes. Add corn, black beans, and freekeh; cook and stir until heated through, 2 to 3 minutes. Stir juice of 1/4 lemon, juice of 1/4 lime, cumin, 1 teaspoon white sugar, chili powder, coriander, paprika, and a pinch of salt into vegetable-tofu mixture; cook and stir until evenly coated and tofu is browned, 2 to 3 minutes.",
        "Mix tomatoes, mango, basil, cilantro, 2 tablespoons olive oil, juice of 3/4 lemon, juice of 3/4 lime, 1 tablespoon white sugar, oregano, and a pinch of salt together in a bowl until salsa is evenly combined.",
        "Spoon vegetable-tofu mixture into each corn tortilla; top each with mango salsa, about 1 tablespoon feta cheese, and 1 tablespoon yogurt."
    ],
    "ingredients": [
        "Taco Filling:",
        "2 1/2 cups water",
        "1 cup freekeh",
        "1 tablespoon olive oil",
        "1/2 onion, chopped",
        "1/2 green bell pepper, diced",
        "1/2 (12 ounce) package tofu, sliced",
        "1/2 (8 ounce) package sliced fresh mushrooms",
        "4 cloves garlic, minced",
        "1 tablespoon diced serrano chile pepper",
        "1 (15.25 ounce) can corn",
        "1 (15 ounce) can black beans, rinsed and drained",
        "1/4 lemon, juiced",
        "1/4 lime, juiced",
        "1 teaspoon ground cumin",
        "1 teaspoon white sugar",
        "1/2 teaspoon chili powder",
        "1/4 teaspoon ground coriander",
        "1/4 teaspoon ground paprika",
        "salt to taste",
        "Mango Salsa:",
        "2 tomatoes, chopped",
        "1/4 mango, chopped, or more to taste",
        "1/4 cup chopped fresh basil, or to taste",
        "1/4 cup chopped fresh cilantro, or to taste",
        "2 tablespoons olive oil",
        "3/4 lemon, juiced",
        "3/4 lime, juiced",
        "1 tablespoon white sugar",
        "1 pinch oregano",
        "1 pinch salt",
        "Taco Toppings:",
        "10 (6 inch) corn tortillas, warmed",
        "10 tablespoons crumbled feta cheese, or to taste",
        "10 tablespoons plain yogurt, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Street Taco with Mango Salsa",
    "url": "http://allrecipes.com/recipe/238055/street-taco-with-mango-salsa/"
}
