{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease an 11x17 inch jelly roll pan. Mix together the walnuts, ground cinnamon, and 3/4 cup of sugar in a medium bowl and set aside.",
        "In a small bowl, dissolve the yeast and 1 teaspoon sugar in warm water. Let stand until creamy, about 10 minutes. In a large bowl, stir together the yeast mixture, egg yolks, sour cream, and butter. Gradually stir in the flour until the dough becomes too stiff to use a spoon. Use your hand to knead the dough in the bowl until it becomes smooth, about 5 minutes. Divide the dough into three equal parts, form into balls, cover, and set aside to rest for about 15 minutes.",
        "Roll one of the balls of dough between 2 sheets of waxed paper to fit the pan. Place the dough in the bottom of the prepared baking pan and spread with 3/4 of the nut mixture. Roll out another ball of dough in the same way, place this over the nut layer in the pan and spread the apricot preserves evenly over the dough. Roll the third ball in the same way and place on top of the layer of preserves.",
        "Place the torte in the preheated oven and set the timer for 40 minutes.  When the timer goes off, the top of the torte should be golden brown, if not then wait a few minutes. Place the egg whites into a clean glass or metal bowl.  Whip the egg whites to soft peaks, then gradually add 2/3 cup sugar while beating the egg whites to stiff peaks. Spread the meringue evenly over the top of the torte and sprinkle with the remaining nut mixture.",
        "Bake the meringue-covered torte for an additional 15 minutes. Cool the torte in the pan set on a wire rack. Trim the edges for a cleaner presentation. Serve at room temperature."
    ],
    "ingredients": [
        "2 cups chopped walnuts",
        "1 teaspoon ground cinnamon",
        "3/4 cup white sugar",
        "1/4 cup warm water (110 degrees F/45 degrees C)",
        "1 (.25 ounce) envelope active dry yeast",
        "1 teaspoon white sugar",
        "4 egg yolks",
        "1/2 cup sour cream",
        "1 1/3 cups butter or margarine, softened",
        "4 1/2 cups all-purpose flour",
        "1 (16 ounce) jar apricot preserves",
        "4 egg whites",
        "2/3 cup white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Streamline Hungarian Torte",
    "url": "http://allrecipes.com/recipe/142127/streamline-hungarian-torte/"
}
