{
    "directions": [
        "Blend all purpose flour, sugar and salt in processor. Add chilled butter pieces and cut in using on/off turns until mixture resembles coarse meal. Add 3 tablespoons ice water and process until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic and refrigerate 30 minutes. (Can be prepared 2 days ahead. Keep refrigerated. Let soften slightly at room temperature before rolling out.)",
        "Roll out dough on lightly floured surface to 12-inch round. Transfer to 9-inch-diameter glass pie dish. Fold edges under, forming high-standing rim 3/4 inch above dish sides; crimp edges decoratively. Freeze crust 25 minutes.",
        "Preheat oven to 350°F. Bake crust until light golden brown, about 30 minutes. Cool while preparing filling. Maintain oven temperature.",
        "Combine pear pieces, 3 tablespoons sugar, 2 tablespoons orange juice and salt in large nonstick skillet. Cook over medium heat until pears are tender but still hold their shape, stirring often, about 6 minutes. Transfer pear mixture to large bowl; cool to room temperature. Add blueberries, flour and remaining 6 tablespoons sugar to pears; toss gently to blend.",
        "Transfer filling to cooled pie crust, mounding filling slightly in center. Sprinkle with Walnut-Streusel Topping. Bake pie until juices bubble thickly, fruit is tender and streusel topping is golden brown, about 1 hour 5 minutes. Cool pie on rack until lukewarm. Cut pie into wedges and serve."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1 tablespoon sugar",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "3 tablespoons (or more) ice water",
        "2 pounds firm but ripe pears (about 5 medium), peeled, cored, cut into 3/4-inch pieces",
        "9 tablespoons sugar",
        "2 tablespoons orange juice",
        "Pinch of salt",
        "2 1/4 cups frozen blueberries",
        "6 tablespoons all purpose flour",
        "Walnut-Streusel Topping"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Dessert",
        "Bake",
        "Blueberry",
        "Pear"
    ],
    "title": "Streusel Topped Pear and Blueberry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/streusel-topped-pear-and-blueberry-pie-102911"
}
