{
    "directions": [
        "Finely grind first 5 ingredients in spice grinder. Transfer to small bowl. Add butter and tomato paste; stir to blend. Season with salt and pepper. Do ahead Can be made 2 days ahead. Cover and chill.",
        "Preheat oven to 350°F. Place garlic in small ovenproof dish. Drizzle with 1 teaspoon oil, cover tightly with foil, and roast until tender, about 30 minutes. Cool; peel.",
        "Place roasted garlic, remaining 2 tablespoons oil, olives, capers, raisins, anchovies, and crushed red pepper in mortar. Mash with pestle until coarse puree forms. (Alternatively, process in mini processor until coarse puree forms.) Do ahead Spiced puree can be made 1 day ahead. Transfer to small bowl and chill.",
        "Cook broccoli rabe in large saucepan of boiling salted water until stems are crisp-tender, about 5 minutes. Drain, pressing on broccoli rabe to release excess water. Transfer to medium bowl. Add spiced puree and toss to coat. Do ahead Can be made 2 hours ahead. Let stand at room temperature.",
        "Bring broth to boil in heavy large saucepan. Add cauliflower, squash, and radishes. Sprinkle with salt and pepper. Cover and simmer 3 minutes. Uncover, add 6 tablespoons saffron butter, and simmer until vegetables are tender and broth thickens slightly, stirring frequently, about 4 minutes.",
        "Meanwhile, sprinkle fish with salt and pepper, then dredge in flour. Heat 1 tablespoon oil in each of 2 large skillets over medium-high heat. Place 3 fillets, skin side down, in each skillet and cook until brown, about 3 minutes per side.",
        "Divide vegetables and broth among 6 shallow soup bowls. Top each with fish fillet, skin side up. Top with spiced broccoli rabe and serve."
    ],
    "ingredients": [
        "1 1/2 teaspoons fennel seeds",
        "1/2 teaspoon aniseed",
        "1/2 teaspoon whole white peppercorns",
        "1/2 teaspoon minced fresh thyme",
        "1/4 teaspoon (scant) saffron threads",
        "1/2 cup (1 stick) butter, room temperature",
        "1 1/2 teaspoons tomato paste",
        "3 garlic cloves, unpeeled",
        "1 teaspoon plus 2 tablespoons olive oil",
        "1/4 cup coarsely chopped pitted picholine olives* or other brine-cured green olives",
        "2 tablespoons drained capers",
        "2 tablespoons raisins",
        "4 anchovy fillets, rinsed",
        "1/2 teaspoon dried crushed red pepper",
        "1 bunch broccoli rabe (rapini; about 1 pound), cut crosswise into 1/2-inch slices",
        "1 1/2 cups chicken broth",
        "1 large head of cauliflower, cut into small florets",
        "2 medium yellow squash, cut into 1/2-inch cubes",
        "1 1/2 cups sliced radishes",
        "6 (6-ounce) farmed striped bass fillets with skin",
        "All purpose flour (for dredging)",
        "2 tablespoons vegetable oil",
        "*Medium-size brine-cured green olives; available at some supermarkets and at specialty foods stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Olive",
        "Tomato",
        "Roast",
        "Sauté",
        "Low Cal",
        "High Fiber",
        "Raisin",
        "Bass",
        "Cauliflower",
        "Squash",
        "Capers",
        "Broccoli Rabe"
    ],
    "title": "Striped Bass with Saffron Vegetables and Spiced Broccoli Rabe",
    "url": "http://www.epicurious.com/recipes/food/views/striped-bass-with-saffron-vegetables-and-spiced-broccoli-rabe-236888"
}
