{
    "directions": [
        "Let steak sit at room temperature 20 minutes before cooking (this will help it cook more evenly).",
        "Heat a dry large skillet over medium-high. Rub steaks with 2 Tbsp. oil; season generously with kosher salt. Cook, turning several times, until lightly charred, 6–8 minutes. Pour off excess oil from skillet. Add butter, thyme, garlic, and cardamom, and cook steaks, tilting skillet and basting with foaming butter, until medium-rare, about 3 minutes. Transfer steaks to a cutting board and let rest 10 minutes before slicing. Reserve pan drippings.",
        "Meanwhile, mix lemon zest and 1 tsp. lemon juice into yogurt in a small bowl; season generously with kosher salt.",
        "Just before serving, toss radishes, parsley, and remaining 1 Tbsp. lemon juice in a medium bowl. Season with kosher salt, drizzle with oil, and toss again to coat.",
        "Swipe plates with seasoned yogurt and top with steak and radishes. Drizzle with pan drippings and sprinkle with red pepper flakes and sea salt."
    ],
    "ingredients": [
        "2 (1-inch-thick) boneless New York strip steaks (about 10 ounces each)",
        "2 tablespoons olive oil, plus more for drizzling",
        "Kosher salt",
        "3 tablespoons unsalted butter",
        "4 sprigs thyme",
        "2 garlic cloves, crushed",
        "6 cardamom pods, lightly crushed",
        "1 1/2 teaspoons finely grated lemon zest",
        "1 teaspoon plus 1 tablespoon fresh lemon juice",
        "1 1/2 cups plain whole-milk Greek yogurt",
        "8 ounces radishes (such as red radishes and/or daikon), some cut into wedges and some sliced",
        "1 cup (packed) parsley leaves with tender stems",
        "Crushed red pepper flakes and flaky sea salt (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Steak",
        "Radish",
        "Summer",
        "Yogurt",
        "Lemon Juice",
        "Cardamom",
        "Parsley",
        "Dinner",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Strip Steak With Lemony Yogurt and Radishes",
    "url": "http://www.epicurious.com/recipes/food/views/strip-steak-with-lemony-yogurt-and-radishes"
}
