{
    "directions": [
        "Combine poblano chile, pumpkin seeds, broth, cilantro, and hierba santa in blender; puree until smooth.",
        "DO AHEAD Can be made up to 6 hours ahead. Cover and refrigerate.",
        "Soak corn husks in warm water until flexible, at least 1 hour. Drain; pat dry.",
        "Preheat oven to 350°F. Heat 3 tablespoons oil in large skillet over medium heat until hot. Working in batches, fry corn tortillas until light golden but still soft and pliable, about 30 seconds per side for each. Transfer to paper towels; cool.",
        "Heat remaining 1 tablespoon oil in clean large skillet over medium-high heat. Working in batches, cook spinach until just wilted. Lightly season with salt and pepper. Transfer spinach to sieve. Using back of spoon, press on spinach to remove excess liquid.",
        "Place tortillas on work surface. Divide spinach and cheese among tortillas. Roll up tortillas, enclosing filling.",
        "Place 2 corn husks in roasting pan, overlapping slightly to form base for fish. Arrange 2 filled tortillas lengthwise and seam side down on corn husks. Place 1 fish fillet over tortillas; sprinkle with salt and pepper. Overlap remaining corn husks in same pan, using 2 for each base; top with filled tortillas and fish; sprinkle with salt and pepper. Place 1 tablespoon butter atop each fillet. Cover pan with foil and bake until fish is just cooked through, about 20 minutes.",
        "Meanwhile, transfer sauce to small saucepan. Bring to near boil, then reduce heat and simmer 5 minutes. Add cream; season to taste with salt and pepper. Adjust consistency, adding water by tablespoons to thin, if desired.",
        "Transfer 1 corn-husk base with fish and tortillas to each of 4 plates. Spoon warm sauce over fish. Serve, passing remaining sauce separately.",
        "*A fresh green chile, often called a pasilla, available at some supermarkets, Latin markets, and specialty foods stores.",
        "**An herb from Mexico available at Latin markets.",
        "***Available at many supermarkets and at Latin markets."
    ],
    "ingredients": [
        "1 large fresh poblano chile*, charred, peeled, seeded, chopped",
        "1 cup pumpkin seeds, lightly toasted",
        "1 cup low-salt chicken broth",
        "1/4 cup chopped fresh cilantro",
        "2 tablespoons chopped hierba santa leaves** or 1 teaspoon aniseed",
        "8 large corn husks***",
        "4 tablespoons vegetable oil, divided",
        "8 corn tortillas",
        "8 ounces baby spinach",
        "2 cups (lightly packed) grated Monterey Jack cheese",
        "4 striped bass fillets (4 to 6 ounces each)",
        "4 tablespoons (1/2 stick) butter, cut into 4 pieces",
        "1/4 cup heavy whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Bake",
        "Bass",
        "Corn",
        "Spinach",
        "Healthy",
        "Cilantro",
        "Tortillas",
        "Monterey Jack",
        "Seed"
    ],
    "title": "Striped Bass with Pipian Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/striped-bass-with-pipian-sauce-234957"
}
