{
    "directions": [
        "Heat 3 tablespoons oil in large nonstick skillet over medium-high heat. Sprinkle both sides of fish fillets with salt and pepper; add to skillet and cook until golden, about 3 minutes per side. Transfer fish to platter; tent with foil to keep warm. Add chard, chestnuts, wine, and clam juice to skillet; cook until chard is just wilted, about 3 minutes. Using slotted spoon, place chard mixture atop fish; tent with foil. Boil juices in skillet to reduce slightly, about 3 minutes. Remove skillet from heat; add pomegranate molasses, vinegar, mustard, and shallot. Slowly whisk in remaining 4 tablespoons oil. Season vinaigrette with salt and pepper. Spoon over fish and serve.",
        "*To prepare fresh chestnuts, start with heavy, glossy nuts with firm, smooth shells. Cut a small cross on one side of each shell to let steam escape as the nuts roast and to make them easier to peel afterward. Place chestnuts in a shallow roasting pan; sprinkle with water. Roast in 400°F oven for 25 to 20 minutes. Wrap hot chestnuts in towl and squeeze to crush the shells. Keep nuts wrapped for 5 minutes before removing the hard outer shell and the brown skin inside, being wary of burning your fingers. One pound of fresh chestnuts equals about two cups when shelled.",
        "**Available at some supermarkets and Middle Eastern markets, and by mail from Adriana's Caravan (adrianascaravan.com)."
    ],
    "ingredients": [
        "7 tablespoons olive oil, divided",
        "4 5-ounce striped bass fillets",
        "2 cups (packed) thinly sliced Swiss chard",
        "1 cup peeled roasted chestnuts*, or jarred chestnuts, chopped",
        "1/3 cup dry white wine",
        "1/3 cup bottled clam juice",
        "3 tablespoons pomegranate molasses**",
        "1 tablespoon Sherry wine vinegar",
        "1 teaspoon Dijon mustard",
        "1 large shallot, minced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Mustard",
        "Nut",
        "Sauté",
        "Christmas",
        "Bass",
        "White Wine",
        "Fall",
        "Winter",
        "Chestnut",
        "Chard",
        "Molasses"
    ],
    "title": "Striped Bass with Swiss Chard, Chestnuts, and Pomegranate Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/striped-bass-with-swiss-chard-chestnuts-and-pomegranate-vinaigrette-231286"
}
