{
    "directions": [
        "1. Melt the butter in a heavy 7- to 8-quart stockpot over medium heat. Add the onions, celery, carrots, bay leaves, parsley, thyme, and peppercorns and cook, stirring frequently with a wooden spoon, until the vegetables become very soft without browning, about 8 minutes.",
        "2. Place the fish head on the vegetables and stack the fish frames evenly on top. Pour in the wine, cover the pot tightly, and let the bones sweat for 10 to 15 minutes, or until they have turned completely white.",
        "3. Add enough very hot or boiling water to just barely cover the bones. Give the mixture a gentle stir and allow the brew to come to a simmer. Simmer for 10 minutes, uncovered, carefully skimming off any white foam that comes to the surface, trying not to take any herbs, spices, or vegetables with it. (Using a ladle and a circular motion, push the foam from the center to the outside of the pot, where it is easy to remove.)",
        "4. Remove the pot from the stove, stir the stock again, and allow it to steep for 10 minutes. Strain through a fine-mesh strainer and season lightly with salt. If you are not going to be using the stock within the hour, chill it as quickly as possible. Cover the stock after it is thoroughly chilled (it will have a light jellied consistency) and keep refrigerated for up to 3 days, or freeze for up to 2 months."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "2 medium onions, very thinly sliced",
        "4 stalks celery, very thinly sliced",
        "2 medium carrots, very thinly sliced",
        "2 dried bay leaves",
        "1/4 cup roughly chopped fresh flat-leaf parsley leaves and stems",
        "6 to 8 sprigs fresh thyme",
        "2 tablespoons black peppercorns",
        "1 large (6 inches long or more) or 2 small (4 inches long or less) fish heads from cod or haddock, split lengthwise, gills removed, and rinsed clean of any blood",
        "2 1/2 to 3 pounds fish frames (bones) from sole, flounder, bass, and/or halibut, cut into 2-inch pieces and rinsed clean of any blood",
        "1/4 cup dry white wine",
        "About 2 quarts very hot or boiling water",
        "Kosher or sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish"
    ],
    "title": "Strong Fish Stock",
    "url": "http://www.epicurious.com/recipes/food/views/strong-fish-stock-105266"
}
