{
    "directions": [
        "Heat oil and 2 tablespoons butter in a large skillet over medium heat until butter is foaming. Add garlic and 1/4 teaspoon red pepper flakes; cook, stirring often, until fragrant, about 1 minute. Add panko and cook, stirring often, until panko is golden brown, about 2 minutes. Mix in lemon zest and transfer panko to a paper towel-lined plate; season with salt and pepper. Let cool; set aside. Wipe out skillet.",
        "Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente (about 5 minutes for fresh pasta). Drain.",
        "Meanwhile, heat remaining 6 tablespoons butter in same skillet over medium heat. Cook, swirling skillet occasionally, until butter is brown, about 3 minutes. Add 1 bunch spinach; cook, tossing, until wilted, about 1 minute.",
        "Add pasta to skillet and toss to coat. Add lemon juice, preserved lemon peel, and remaining 1/4 teaspoon red pepper flakes and toss to combine; season with salt, pepper, and more lemon juice and preserved lemon peel, if desired. Add remaining spinach and toss until slightly wilted, about 1 minute.",
        "Serve pasta topped with reserved panko.",
        "DO AHEAD: Panko can be toasted 1 day ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "8 tablespoons (1 stick) unsalted butter, divided",
        "1 garlic clove, crushed",
        "1/2 teaspoon crushed red pepper flakes, divided",
        "3/4 cup panko (Japanese breadcrumbs)",
        "1 teaspoon finely grated lemon zest",
        "Kosher salt, freshly ground pepper",
        "12 ounces fresh strozzapreti or other fresh or dried pasta",
        "2 bunches flat-leaf spinach, trimmed, large leaves torn in half (about 8 cups), divided",
        "1 tablespoon (or more) fresh lemon juice",
        "1 tablespoon (or more) thinly sliced preserved lemon peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Vegetable",
        "Vegetarian",
        "Dinner",
        "Lemon",
        "Spinach",
        "Sugar Conscious",
        "Pescatarian",
        "Kosher"
    ],
    "title": "Strozzapreti with Spinach and Preserved Lemon",
    "url": "http://www.epicurious.com/recipes/food/views/strozzapreti-with-spinach-and-preserved-lemon-51187290"
}
