{
    "directions": [
        "Preheat oven to 350°. Season oxtails with salt and pepper. Heat 2 tablespoons oil in a large heavy pot over medium-high and cook oxtails until deeply browned all over, 15–18 minutes; transfer to a bowl.",
        "Meanwhile, finely chop onion, carrots, and celery in a food processor.",
        "Cook vegetables in same pot, stirring often, until soft, 5–7 minutes. Add garlic and cook, stirring, until fragrant, about 2 minutes. Return oxtails to pot and add wine, broth, and 2 teaspoons rosemary. Oxtails should be just covered; top off with water if needed. Bring to a simmer, cover, and transfer to oven. Braise, checking halfway through to make sure oxtails are covered at least two-thirds of the way up, until meat is falling off the bone, 2–2 1/2 hours. Remove oxtails from liquid. When cool enough to handle, shred meat and return to sauce; discard bones.",
        "Meanwhile, toss breadcrumbs with remaining 2 tablespoons oil on a rimmed baking sheet, squeezing bread to help it absorb oil. Bake until golden brown, 5–7 minutes; let cool. Stir breadcrumbs, horseradish, and remaining 1 teaspoon rosemary in a medium bowl.",
        "Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente (pasta will still be opaque and very firm in the center). Drain pasta, reserving 1 1/2 cups pasta cooking liquid.",
        "Bring ragu to a simmer over mediumhigh heat. Add pasta and 1 cup pasta cooking liquid and cook, tossing often and adding more cooking liquid to help finish cooking pasta, until pasta is al dente and sauce is thickened and coats pasta, about 5 minutes. Taste and season with salt and pepper. Serve pasta topped with horseradish breadcrumbs.",
        "Do ahead: Ragu can be made 4 days ahead. Let cool; cover and chill."
    ],
    "ingredients": [
        "3 pounds oxtails",
        "Kosher salt, freshly ground pepper",
        "4 tablespoons olive oil, divided",
        "1 medium yellow onion",
        "2 medium carrots, peeled",
        "2 celery stalks",
        "2 garlic cloves, finely chopped",
        "2 cups dry white wine",
        "2 cups low-sodium chicken broth",
        "3 teaspoons finely chopped rosemary, divided",
        "1 cup coarsely torn breadcrumbs",
        "2 teaspoons freshly grated horseradish",
        "12 ounces strozzapreti or other short pasta"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Pasta",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Carrot",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Strozzapreti with Oxtail Ragù and Horseradish Crumbs",
    "url": "http://www.epicurious.com/recipes/food/views/strozzapreti-with-oxtail-ragu-and-horseradish-crumbs-51264080"
}
