{
    "directions": [
        "Heat oil in a medium skillet over medium-high heat. Add onion, carrot, and celery and cook, stirring often, until lightly golden, 5–8 minutes; season with salt and pepper. Reduce heat to medium-low and cook, stirring often, until vegetables have reduced in volume by two-thirds, 15–20 minutes. Add paprika and cook, stirring often, 5 minutes. Transfer to a small bowl.",
        "Heat 2 tablespoons oil in a large skillet over medium-high heat. Add half of mushrooms; season with salt and pepper. Cook, tossing, until browned and softened, 8–10 minutes; transfer to a bowl. Repeat with 2 tablespoons oil and remaining mushrooms; reserve skillet.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente, 8–10 minutes. Drain, reserving 1 cup pasta cooking liquid.",
        "Heat 2 tablespoons oil in reserved skillet over medium-low heat. Cook garlic, stirring, until fragrant, about 30 seconds. Toss in soffritto, mushrooms, pasta, lemon juice, 2 tablespoons chives, and half of Parmesan, thinning with pasta cooking liquid as needed; season with salt and pepper. Serve topped with ricotta, eggs, if using, more chives, and remaining Parmesan and drizzle with oil."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "1 small red onion, finely chopped",
        "1 large carrot, peeled, finely chopped",
        "1 celery stalk, finely chopped",
        "Kosher salt",
        "Freshly ground black pepper",
        "1/4 teaspoon smoked paprika",
        "6 tablespoons olive oil, divided, plus more",
        "1 pound mixed mushrooms (such as maitake, shiitake, and king trumpet), cut or torn into 1/2\" pieces",
        "Kosher salt",
        "Freshly ground pepper",
        "1 pound strozzapreti or gemelli",
        "1 garlic clove, finely chopped",
        "2 tablespoons fresh lemon juice",
        "2 tablespoons chopped fresh chives, plus more for serving",
        "1/2 cup grated Parmesan, divided",
        "2/3 cup fresh ricotta",
        "6 soft-boiled eggs, peeled (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Vegetarian",
        "Ricotta",
        "Dallas",
        "Texas"
    ],
    "title": "Strozzapreti with Mushrooms and Ricotta",
    "url": "http://www.epicurious.com/recipes/food/views/strozzapreti-with-mushrooms-and-ricotta-51245810"
}
