{
    "directions": [
        "For the pizza dough: Add the yeast, 1 cup warm water and sugar in the bowl of an electric mixer fitted with the dough hook. Let the mixture sit to allow the yeast to activate. The mixture should start foaming and forming small bubbles on the surface, 10 minutes. Gradually add the flour with the mixer on low speed. Add the olive oil and salt. Continue to mix on low and scrape down the sides of the bowl with a rubber spatula as needed. Increase the speed as the flour becomes incorporated, and knead on medium speed, 7 to 8 minutes. The dough is done when it comes together as a single mass.",
        "Remove the dough from the mixer and knead 4 to 5 times on a lightly-floured surface so the dough is smooth and consistent. Place in an oiled bowl, cover with plastic and allow to sit until the dough rises and doubles in volume, 1 hour.",
        "For the filling: Preheat the oven to 375 degrees F. Divide the dough in half and, working with one piece at a time, stretch the dough into a 10-by-13-inch rectangle. Arrange the dough rectangle so the 13-inch-long side is closest to you. Brush the surface with half of the melted butter, then spread the minced garlic out evenly over the top, remembering to split the filling ingredient quantities evenly across both stromboli. Leave a 1-inch border around the far and side borders.",
        "Sprinkle the dough with the Parmesan, then layer with the salami slices. Top the salami with a layer of deli ham and then a layer of bresaola. Shingle the cheese slices over the top and finish with fresh basil and some ground black pepper. With the covered edge closest to you, roll the dough up into a log, gently sealing the ends of the roll as you go. When you get to the end that has no filling on it, gently press to seal, then place the roll seam-side down on a nonstick sheet tray. Repeat the process with second piece of dough. Brush the tops of the dough with the remaining melted butter and sprinkle with Parmesan. Bake in the center of the oven until golden brown and puffy, 25 to 30 minutes.",
        "Allow the stromboli to cool 5 minutes before slicing it into thick slices with a serrated knife. Serve with the Marinara Sauce on the side or some mustard.",
        "Heat the olive oil in a medium saucepan over medium-low heat. Add the onions and cook until translucent, about 4 minutes. Add the garlic and cook until the garlic is almost brown, another 2 minutes. Add the tomatoes and simmer, 20 minutes.",
        "Add the basil and oregano, and continue to simmer to thoroughly marry the flavors, 20 minutes longer. Puree the mixture with a stick blender, food mill or food processor. Season with salt and pepper. Yield: Makes 1 quart."
    ],
    "ingredients": [
        "One 1/4-ounce packet dry-active yeast",
        "2 teaspoons sugar",
        "3 cups all-purpose flour, plus bench flour",
        "1 tablespoon extra-virgin olive oil",
        "1 teaspoon salt",
        "3 tablespoons unsalted butter, melted",
        "4 cloves garlic, minced",
        "1/2 cup grated Parmesan, plus extra for the tops",
        "6 ounces thinly sliced salami",
        "6 ounces thinly sliced deli ham",
        "6 ounces thinly sliced bresaola",
        "8 thin slices mozzarella (about 6 ounces)",
        "8 thin slices pepper jack cheese (about 6 ounces total)",
        "1/4 cup finely sliced fresh basil leaves",
        "Freshly ground black pepper",
        "Marinara Sauce, recipe follows",
        "1 tablespoon extra-virgin olive oil",
        "1/2 cup diced yellow onion",
        "3 medium cloves garlic, crushed",
        "One 28-ounce can fire-roasted diced tomatoes, such as Muir Glen",
        "1/4 cup shredded fresh basil leaves",
        "1 tablespoon chopped fresh oregano",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pizza Recipes",
        "Sauce Recipes",
        "Meat",
        "Pork",
        "Cheese",
        "Tomato",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Stromboli",
    "url": "http://www.foodnetwork.com/recipes/guy-fieri/stromboli-recipe"
}
