{
    "directions": [
        "Mix black pepper and smoked paprika together in a bowl; season 1 side of each chicken breast with black pepper  mixture. Flip each chicken breast over and season the other side with about 1 1/2 teaspoons ground chipotle per chicken breast. Wrap chicken breasts in plastic wrap and refrigerate 8 hours to overnight.",
        "Bring a pot of water to a boil; add vegetable bouillon and rosemary. Stir carrots, mushrooms, celery, and garlic into boiling broth; cook until vegetables are tender, about 10 minutes. Strain vegetables from broth using a slotted spoon and transfer to a bowl.",
        "Preheat the grill to 300 degrees F (150 degrees C). Soak 8 toothpicks in a bowl of water.",
        "Remove plastic wrap from chicken breasts and place chipotle-side down on a work surface. Spoon the vegetable mixture onto each chicken breast; roll chicken breast around filling. Secure each breast with 2 toothpicks. Season outside of rolls with more ground chipotle.",
        "Grill chicken breasts until no longer pink in the center and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Brush chicken breasts with barbeque sauce; cook until exterior is caramelized, about 10 more minutes."
    ],
    "ingredients": [
        "1/4 cup ground black pepper",
        "2 tablespoons smoked paprika",
        "4 skinless, boneless chicken breast halves, pounded flat",
        "2 tablespoons ground chipotle",
        "2 cubes vegetable bouillon, or more to taste",
        "1/4 cup chopped fresh rosemary",
        "16 baby carrots, chopped",
        "2 shiitake mushrooms, sliced (optional)",
        "2 stalks celery, chopped",
        "5 cloves garlic, chopped",
        "1 pinch ground chipotle, or to taste",
        "1/4 cup barbeque sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Roasted Barbecue Chicken",
    "url": "http://allrecipes.com/recipe/232973/stuffed-roasted-barbecue-chicken/"
}
