{
    "directions": [
        "Put pork in a 3-quart heavy saucepan with salt, onion slice, garlic, thyme, and enough cold water to cover by 1/2 inch and bring to a boil, skimming foam. Reduce heat and simmer, partially covered, until pork is very tender, 1 to 1 1/2 hours. Cool pork in liquid, uncovered, 15 minutes. Drain, then cut pork into 1/3-inch dice. Discard onion, garlic, and thyme.",
        "Cook onion and garlic in oils in a 12-inch heavy skillet over moderately low heat, stirring, until softened, 5 to 8 minutes. Add tomatoes, thyme, bay leaves, cinnamon, allspice, cloves, nutmeg, 1 tablespoon vinegar, 1 1/2 teaspoons sugar, and 3/4 teaspoon salt and simmer, uncovered, stirring occasionally, until tomatoes have broken down and sauce is slightly thickened, 20 to 30 minutes.",
        "While tomatoes simmer, cut an X in bottom of peach, then immerse in boiling water until skin begins to loosen, 10 to 30 seconds. Transfer peach to a bowl of cold water to stop cooking, then peel, pit, and dice (1/3 inch).",
        "Discard bay leaves, thyme sprig, and cinnamon stick from tomato mixture, then add diced pork and remaining filling ingredients and simmer, uncovered, stirring occasionally, until fruit is softened but still intact, 8 to 10 minutes. Season with additional salt, sugar, and vinegar.",
        "Purée walnuts and almonds in a blender with milk, cheese, 1 tablespoon sugar, and 1/4 teaspoon salt until smooth and silky, about 2 minutes. (Sauce should thickly coat back of a large spoon. If sauce is too thin, add more almonds and puré. If too thick, add more milk.) Season with salt and sugar.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Cut a lengthwise slit in each chile and carefully cut out seeds with kitchen shears, leaving stem intact. (For milder heat, carefully cut out ribs also.)",
        "Divide pork filling among chiles, then close, overlapping sides of openings slightly. Transfer, seam sides up, to a 13- by 9-inch shallow baking dish, then cover with foil and bake until just heated through, 15 to 25 minutes.",
        "Transfer chiles to plates, carefully turning them seam sides down. Pour about 1/3 cup walnut sauce over each chile, leaving some of chile visible, then sprinkle chiles with pomegranate seeds. Serve chiles warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 lb boneless pork shoulder, cut into 1 1/2-inch pieces",
        "1 teaspoon salt",
        "1 (1/2-inch-thick) crosswise slice white onion",
        "2 garlic cloves, peeled",
        "1 sprig fresh thyme",
        "1 cup finely chopped white onion",
        "1 tablespoon finely chopped garlic (about 3 large cloves)",
        "2 tablespoons olive oil",
        "2 tablespoons lard or vegetable oil",
        "2 lb fresh tomatoes, cored and coarsely chopped, or 1 (28-oz) can whole tomatoes, coarsely chopped, with juice",
        "1 sprig fresh thyme",
        "2 Turkish bay leaves or 1 California",
        "1 (4-inch) cinnamon stick (preferably Mexican)",
        "1/4 teaspoon ground allspice",
        "1/8 teaspoon ground cloves",
        "1 pinch freshly grated nutmeg (optional)",
        "1 tablespoon cider vinegar, or to taste",
        "1 1/2 teaspoons sugar, or to taste",
        "3/4 teaspoon salt, or to taste",
        "1 small peach",
        "1/3 cup dried apricots, coarsely chopped",
        "1/4 cup raisins",
        "1/4 cup pine nuts",
        "1/3 cup diced (1/3 inch) peeled green apple",
        "1/2 cup diced (1/3 inch) peeled very ripe (black) plantain or firm banana",
        "1 1/2 cups walnut halves (5 oz)",
        "3/4 cup slivered almonds (2 1/2 oz) plus additional if necessary to thicken sauce",
        "1 1/2 cups whole milk plus additional if necessary to thin sauce",
        "6 oz queso fresco or very mild soft goat cheese, crumbled (1 1/2 cups)",
        "1 tablespoon sugar, or to taste",
        "1/4 teaspoon salt, or to taste",
        "8 large fresh poblano chiles (2 lb total), roasted and peeled",
        "1/2 cup fresh pomegranate seeds (from 1 pomegranate)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Cheese",
        "Dairy",
        "Herb",
        "Nut",
        "Pepper",
        "Pork",
        "Tomato",
        "Walnut",
        "Pomegranate",
        "Gourmet"
    ],
    "title": "Stuffed Poblano Chiles with Walnut Sauce and Pomegranate Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-poblano-chiles-with-walnut-sauce-and-pomegranate-seeds-235743"
}
