{
    "directions": [
        "Heat olive oil in a saucepan over medium heat. Stir in 1/2 cup onion and garlic, and cook until the onion softens and turns translucent, about 5 minutes. Stir in the chopped bell pepper, tomato sauce, crushed tomatoes, then season with salt, chili powder, sugar, black pepper, glove, and a bay leaf. Bring to a simmer, then reduce heat to medium-low, cover, and simmer 20 minutes, stirring occasionally.",
        "While the sauce is simmering, microwave the peppers until tender, about 45 seconds. Preheat a skillet over medium-high heat, and add ground beef. Cook and stir until browned and crumbly, then stir in 1/4 cup onion, and celery. Drain off grease. Cook another 5 minutes, then fold in the rice and Parmesan cheese. Season to taste with salt and pepper.",
        "Preheat oven to 375  degrees F (190 degrees C).",
        "To assemble, stir about 1/2 cup of the Creole sauce into the beef mixture to moisten it. Stuff the peppers with the beef mixture, and place onto a 9x9 inch baking pan. Pour the remaining Creole sauce over the peppers.",
        "Bake peppers, uncovered, until hot and beginning to brown, about 25 minutes."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1/2 cup finely chopped onion",
        "2 cloves garlic, minced",
        "1/2 cup finely chopped green bell pepper",
        "1 (8 ounce) can tomato sauce",
        "1 (15 ounce) can crushed tomatoes",
        "1 teaspoon salt",
        "1 teaspoon chili powder",
        "1 teaspoon white sugar",
        "1/4 teaspoon ground black pepper",
        "1/8 teaspoon ground clove",
        "1 bay leaf",
        "Stuffed Peppers:",
        "4 large green bell peppers, tops removed, seeded",
        "1 pound ground beef",
        "1/4 cup minced onion",
        "1/3 cup finely chopped celery",
        "1 1/2 cups cold, cooked white rice",
        "1/4 cup grated Parmesan cheese",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Peppers with Creole Sauce",
    "url": "http://allrecipes.com/recipe/149225/stuffed-peppers-with-creole-sauce/"
}
