{
    "directions": [
        "Char poblano chiles directly over gas flame or in broiler until blackened on all sides. Enclose in paper bag 10 minutes. Peel, seed, and slice chiles into 1/4-inch strips.",
        "Place tomatoes in processor; chop coarsely. Heat oil in large saucepan over medium-high heat. Add tomatoes and cook 3 minutes, stirring occasionally. Add chiles; cook until mixture thickens, stirring often, about 5 minutes. Remove from heat; mix in cheese. Season with salt.",
        "Combine fresh masa or masa harina mixture, flour, baking powder, and salt in large bowl. Knead to blend well, adding warm water by tablespoonfuls as needed until dough is soft but not sticky. Divide dough into 10 equal portions; roll each into ball. Place balls on sheet of aluminum foil. Cover balls of dough with plastic wrap to prevent drying.",
        "Cut two 8-inch rounds from heavy-duty resealable plastic bag. Place 1 round on bottom half of tortilla press. Place 1 dough ball in center; top with second plastic round. Close tortilla press, gently flattening dough to 4-inch round about 1/4 inch thick. Peel off top plastic. Lift bottom plastic and peel dough round off. Place on sheet of waxed paper. Shape remaining 9 balls into 4-inch rounds.",
        "Line baking sheet with aluminum foil. Heat heavy large griddle or skillet over medium heat. Place two 4-inch rounds at a time on griddle or skillet. Cook until just light brown, about 2 minutes per side. Transfer gorditas to prepared baking sheet. (Filling and gorditas can be made 2 hours ahead. Cover loosely; let stand at room temperature.)",
        "Pour enough oil into heavy large skillet to reach depth of 1/2 inch. Attach deep-fry thermometer. Heat oil over medium heat to 325°F to 350°F. Fry 2 or 3 gorditas at a time until crisp and slightly puffed, 30 seconds per side. Transfer to paper towels to drain.",
        "Cut halfway around edge of each gordita to make opening. Gently squeeze sides to open shell. Spoon about 1/4 cup filling into each opening. Arrange gorditas on platter; serve warm."
    ],
    "ingredients": [
        "12 ounces poblano chiles (about 4 medium)",
        "1 14.5- to 16-ounce can whole tomatoes in juice, drained",
        "1 tablespoon vegetable oil",
        "2 cups crumbled queso fresco or feta cheese (about 8 ounces)",
        "2 cups freshly ground corn masa dough for tortillas (about 17 ounces), or make masa dough with 1 3/4 cups masa harina (corn tortilla mix; about 8 1/2 ounces) mixed with 1 cup plus 2 tablespoons warm water",
        "1/3 cup all purpose flour",
        "1 teaspoon baking powder",
        "3/4 teaspoon salt",
        "Warm water",
        "Vegetable oil (for frying)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Cheese",
        "Pepper",
        "Tomato",
        "Vegetarian",
        "Cinco de Mayo",
        "Buffet",
        "Hot Pepper",
        "Spring",
        "Pan-Fry",
        "Hominy/Cornmeal/Masa"
    ],
    "title": "Stuffed Masa Pockets with Green Chiles and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-masa-pockets-with-green-chiles-and-cheese-108027"
}
