{
    "directions": [
        "Blend first 5 ingredients in mini processor until olives and garlic are chopped. Transfer stuffing to small bowl; season with salt and pepper. Using fingertips, gently loosen skin on 1 chicken breast, leaving 1 long side attached. Spread 1/6 of stuffing over flesh under skin. Pull skin flap over to cover; secure flap with metal pin or toothpick. Repeat with remaining chicken and stuffing. Arrange chicken on large rimmed baking sheet. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Combine first 4 ingredients in medium bowl. Gradually whisk in oil, then olives. Season dressing to taste with salt and pepper. Transfer 3/4 cup dressing to small bowl; reserve for serving.",
        "Coat grill rack with nonstick spray and prepare barbecue (medium-high heat). Divide remaining dressing between 2 small cups. Drizzle chicken with dressing from 1 cup. Arrange orange wedges on sheet of foil; brush oranges with dressing from second cup.",
        "Grill chicken until cooked through, drizzling with dressing from first cup and turning occasionally, 12 to 14 minutes. Grill orange wedges until heated through and slightly charred, turning and brushing often with dressing from second cup, about 10 minutes. Transfer chicken and orange wedges to platter. Serve with reserved 3/4 cup dressing."
    ],
    "ingredients": [
        "1 cup pitted brine-cured green olives",
        "1 tablespoon olive oil",
        "1 large garlic clove, peeled",
        "1 1/2 teaspoons chopped fresh rosemary",
        "1/2 teaspoon finely grated orange peel",
        "6 boneless chicken breast halves with skin",
        "6 tablespoons orange juice",
        "2 tablespoons chopped fresh rosemary",
        "4 garlic cloves, pressed",
        "1 tablespoon finely grated orange peel",
        "3/4 cup olive oil",
        "1/2 cup chopped pitted brine-cured green olives",
        "Nonstick vegetable oil spray",
        "2 large unpeeled oranges, each cut into 6 wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Backyard BBQ",
        "Dinner",
        "Orange",
        "Rosemary",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Stuffed Chicken Breasts with Rosemary-Orange Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-chicken-breasts-with-rosemary-orange-dressing-359355"
}
