{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Remove the flap of meat at the wider end of the tenderloin and trim the last two inches off of the narrow end of the tenderloin; chop trimmings and reserve.",
        "Cut from one side of the tenderloin through the middle horizontally to within one-half inch of the other side. Open the two sides and spread them out like an open book. Cut a few shallow slashes in the meat. Cover the meat with plastic wrap and pound to about 1/2-inch thick. Roll up pounded tenderloin, cover with plastic wrap, and refrigerate to keep cold.",
        "Mix chopped pork trimmings, parsley, bread crumbs, currants, garlic, rosemary, egg, olive oil, 2 teaspoons salt, 1 1/2 teaspoons black pepper, and cayenne pepper together in a bowl with a fork until stuffing is well-combined.",
        "Unroll tenderloin on work surface. Spread stuffing over tenderloin, leaving a 2-inch border on one of the long-sides. Roll up tenderloin, ending at the 2-inch border; tie meat with twine to secure shape. Season tenderloin all over with salt and black pepper.",
        "Heat an oven-safe skillet over high heat until hot. Cook tenderloin in hot skillet until browned, 3 to 4 minutes per side.",
        "Cook in the preheated oven until pork is slightly pink in the center, about 30 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Transfer to a plate and let rest for 15 minutes before removing twine and slicing."
    ],
    "ingredients": [
        "1 pork tenderloin",
        "1/2 bunch flat-leaf parsley, chopped",
        "1/3 cup bread crumbs",
        "1/4 cup dried currants",
        "3 cloves garlic, minced",
        "2 sprigs fresh rosemary, chopped",
        "1 egg",
        "2 tablespoons olive oil",
        "2 teaspoons salt",
        "1 1/2 teaspoons ground black pepper",
        "1 pinch cayenne pepper",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed and Rolled Pork Tenderloin",
    "url": "http://allrecipes.com/recipe/239233/stuffed-and-rolled-pork-tenderloin/"
}
