{
    "directions": [
        "To prepare the cranberry filling: Soak 1 cup dried cranberries in the boiling water for 20 minutes. Drain the cranberries, reserving 1/4 cup of the water. Place the cranberries, reserved water, 2 tablespoons pine nuts, cinnamon, cloves, and 1 tablespoon brown sugar in a food processor. Process until finely chopped; set aside.",
        "Bring the chicken stock to a boil over high heat. Reduce heat to medium, and simmer until the chicken stock has reduced to half its original volume, about 15 minutes. Add the white wine, red wine, cranberry juice, and 1 tablespoon of brown sugar. Continue cooking until the sauce has reduced by half again, about 10 minutes. Keep warm.",
        "Preheat an oven to 400 degrees F (200 degrees C).",
        "Cut a pocket into the side of each pork chop, about 3/4 of the way through. Stuff each pork chop with the dried cranberry mixture, then season on all sides with salt and pepper to taste. Heat the olive oil in a large, ovenproof skillet over medium-high heat until it begins to smoke. Cook the pork chops on one side until golden brown, 3 to 4 minutes. Turn the pork chops over, and cook another few minutes until browned on the other side too.",
        "Pour 1 cup of the sauce into the skillet and bring to a simmer. Place the skillet in the preheated oven, and bake until the pork is no longer pink in the center, 8 to 10 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
        "To serve, place each pork chop onto a warmed dinner plate, and spoon the sauce from the skillet over top. Sprinkle the pork chops with 2 tablespoons dried cranberries and 2 tablespoons toasted pine nuts for decoration. Serve with the remaining cranberry sauce."
    ],
    "ingredients": [
        "Cranberry Filling:",
        "1 cup dried cranberries",
        "2 cups boiling water",
        "2 tablespoons toasted pine nuts",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1 tablespoon brown sugar",
        "Cranberry Sauce:",
        "4 cups chicken stock",
        "1/4 cup white wine",
        "1/4 cup red wine",
        "1/4 cup cranberry juice",
        "1 tablespoon brown sugar",
        "4 (1-inch thick) pork chops",
        "salt and black pepper to taste",
        "2 tablespoons olive oil",
        "2 tablespoons dried cranberries",
        "2 tablespoons toasted pine nuts"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Pork Chops with Cranberries",
    "url": "http://allrecipes.com/recipe/216452/stuffed-pork-chops-with-cranberries/"
}
