{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "Coat a large saute pan with olive oil, add the pancetta, and bring to medium-high heat. Cook the pancetta until it starts to brown and crisp on the edges, 6 to 8 minutes. Add the onions and season with salt. Continue cooking until the onions are soft and aromatic, about 5 minutes. Add the chopped mushroom stems, rosemary and garlic, and cook for another 2 to 3 minutes, stirring frequently. Remove from the heat and place in a mixing bowl to cool.",
        "Once cooled, add the sausage and breadcrumbs. Pour in 1 whisked egg and combine. Add another egg if the mixture is still dry.",
        "Make a 1- to 2-inch tester patty out of the stuffing mixture. In a small saute pan, heat a bit of oil and cook the patty until it's done. When cool enough, taste your tester patty to make sure it's delicious, if it's not, re-season.",
        "When your tester tastes fabulous, generously fill each mushroom cap with the stuffing mixture and arrange them on a rimmed baking sheet. Pour 1/4 to 1/3 cup water into the pan to keep the mushrooms moist. Bake until the filling is cooked through and brown and crispy on the top, 8 to 10 minutes. Transfer to serving platters."
    ],
    "ingredients": [
        "Olive oil",
        "4 ounces pancetta, cut into 1/4-inch dice",
        "2 onions, finely diced",
        "Kosher salt",
        "1 pound cremini mushrooms, cleaned and stems removed, finely chopped and reserved",
        "2 tablespoon finely chopped fresh rosemary",
        "2 cloves garlic, smashed",
        "4 sweet Italian sausage links, casings removed",
        "1/2 cup breadcrumbs",
        "1 to 2 large eggs, lightly whisked"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Stuffed Mushroom Recipes",
        "Sausage Recipes",
        "Mushroom",
        "Vegetable",
        "Appetizer"
    ],
    "title": "Stuffed Mushrooms",
    "url": "http://www.foodnetwork.com/recipes/anne-burrell/stuffed-mushrooms"
}
