{
    "directions": [
        "Put mushrooms, water, and wine into a container and soak until mushrooms are rehydrated. Remove mushrooms and squeeze out excess liquid. Reserve the liquid. Roughly chop mushrooms.",
        "Sprinkle the cored and seeded tomatoes with salt and place upside down to drain. In a saute pan heat 2 tablespoons of olive oil and add shallots, garlic, and onion. Cook until translucent. Add mushrooms and cook for about 5 minutes then add 1/2 cup of the reserved mushroom liquid to pan and cook for another 4 or 5 minutes, or until most of liquid is absorbed. Add the panko and the chopped tomato and stir to combine. Season the mushroom mixture with salt and pepper and remove from heat.",
        "Preheat the broiler. Mix together the room temperature goat cheese and parsley and reserve. Stuff each tomato with the mushroom stuffing and top with thin layer of goat cheese mixture. Place tomatoes on a baking sheet and put under the broiler for 2 to 3 minutes until cheese is slightly melted and golden."
    ],
    "ingredients": [
        "1 cup dried morel mushrooms",
        "1 cup dried chanterelle mushrooms",
        "1 cup dried shiitake mushrooms",
        "1 cup warm water",
        "3 cups white wine",
        "6 medium tomatoes, cored, seeded plus 1 tomato, chopped",
        "1/2 teaspoon salt",
        "2 tablespoons olive oil",
        "2 tablespoons minced shallots",
        "1 tablespoon minced garlic",
        "1 cup finely diced onion",
        "1 1/4 cup panko crumbs (Japanese)",
        "1/4 teaspoon pepper",
        "3 1/2 ounces goat cheese, room temperature",
        "1 tablespoon chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Snack",
        "Tomato Side Dish",
        "Tomato",
        "Vegetable",
        "Appetizer",
        "Low-Cholesterol",
        "Low-Fat",
        "Low Sodium",
        "Heart-Healthy",
        "Low Calorie",
        "Diabetes-Friendly"
    ],
    "title": "Stuffed Tomatoes",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/stuffed-tomatoes-recipe"
}
