{
    "directions": [
        "Drain tomatoes, reserving juice, then finely chop. Heat oil in a 4- to 5-quart heavy pot over moderately high heat until hot but not smoking, then cook garlic, stirring, until golden, about 1 minute. Add tomatoes with reserved juice, water, tomato paste, sugar, and salt and bring to a boil. Reduce heat and simmer, uncovered, stirring occasionally, until thickened, about 30 minutes. Stir in basil.",
        "Bring a 5- to 6-quart pot of salted water to a boil over moderately high heat.",
        "Prick eggplants all over with a fork. Boil eggplants, uncovered, stirring occasionally, until tender when pierced with a knife, 20 to 25 minutes. Transfer with a slotted spoon to a colander to drain and discard cooking water. When eggplants are cool enough to handle (after about 15 minutes), halve eggplants lengthwise through stem (keep stem attached). With a small sharp knife, scoop out and reserve flesh, leaving 1/4-inch-thick shells. Very finely chop flesh and transfer to a large bowl.",
        "Bring rice and water to a boil in a 1-quart heavy saucepan, uncovered, then reduce heat and simmer rice, covered, until water has been absorbed and rice is tender, about 15 minutes. Remove from heat and let stand 5 minutes. Fluff rice with a fork and add to chopped eggplant.",
        "While rice cooks, combine bread and milk in a small bowl and let stand until bread has absorbed milk, then gently squeeze bread, discarding any milk.",
        "Add bread to rice mixture along with garlic, eggs, cheese, parsley, basil, 1/2 teaspoon salt, and 1/2 teaspoon pepper and stir to combine well.",
        "Sprinkle inside of eggplant shells with remaining 1/2 teaspoon salt and 1/2 teaspoon pepper. Firmly pack a scant 1/3-cup eggplant stuffing into each eggplant shell. (You may have some stuffing left over.)",
        "Put oven rack in middle of oven and preheat oven to 375°F.",
        "Heat 1 inch vegetable oil in a 10-inch cast-iron or other deep heavy skillet over moderate heat until thermometer reaches 320°F and add 2 eggplant halves, stuffing sides up. Fry, turning over once using 2 slotted spoons, until golden brown, 5 to 8 minutes total. Transfer, stuffing sides up, to paper towels to drain, then fry remaining eggplants, 2 halves at a time, in same manner, returning oil to 320°F between batches.",
        "Spoon sauce into a 3-quart (about 13- by 9-inch) nonreactive baking dish. Add eggplants, stuffing sides up, and bake, covered with foil, until sauce is bubbling, about 25 minutes."
    ],
    "ingredients": [
        "1 (28-oz) can whole tomatoes in juice (preferably Italian)",
        "3 tablespoons olive oil",
        "4 garlic cloves, finely chopped",
        "1 1/4 cups water",
        "2 tablespoons tomato paste",
        "1 teaspoon sugar",
        "3/4 teaspoon salt",
        "2 tablespoons chopped fresh basil",
        "4 small Italian eggplants (1 1/2 lb total; preferably with stem attached",
        "1/2 cup long-grain white rice",
        "3/4 cup water",
        "3 slices firm white sandwich bread, torn into 1-inch pieces",
        "1/4 cup whole milk",
        "3 garlic cloves, minced",
        "2 large eggs, lightly beaten",
        "3 oz finely grated Pecorino Romano (1 1/4 cups)",
        "1/3 cup chopped fresh flat-leaf parsley",
        "1/3 cup chopped fresh basil",
        "1 teaspoon salt",
        "1 teaspoon black pepper",
        "About 2 cups vegetable oil",
        "Special equipment: a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Rice",
        "Tomato",
        "Vegetable",
        "Fry",
        "Vegetarian",
        "Dinner",
        "Eggplant",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Stuffed Italian Eggplant",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-italian-eggplant-235746"
}
