{
    "directions": [
        "Bring the water and brown rice to a boil in a saucepan. Reduce the heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, 45 to 50 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.",
        "Scoop the flesh from the zucchini halves using a melon baller, starting about 1/2 inch from one end, creating a 'boat'. Chop and reserve zucchini flesh. Place the zucchini boats face down onto the prepared baking sheet.",
        "Bake zucchini boats in the preheated oven for 15 minutes. Flip over the halves using tongs and line each zucchini boat with 2 half-slices of provolone cheese.",
        "Heat a large skillet over medium-high heat. Cook and stir ground chicken in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Mix rice into chicken.",
        "Heat olive oil in a non-stick pan over medium heat; cook and stir onion, jalapeno pepper, and zucchini flesh in the hot oil until onion is slightly softened, about 5 minutes. Add garlic, Worcestershire sauce, basil, and oregano; stir well. Mix in chicken-rice mixture, tomato sauce, 1 tablespoon Parmesan cheese, salt, and pepper. Scoop mixture into the zucchini boats; sprinkle each boat with about 1 rounded teaspoon Parmesan cheese.",
        "Bake in the preheated oven until cooked through and Parmesan cheese is melted, 25 to 30 minutes."
    ],
    "ingredients": [
        "2 cups water",
        "1 cup brown rice",
        "5 zucchini, halved lengthwise",
        "10 (1 ounce) slices Provolone cheese, halved",
        "1 pound ground chicken breast",
        "2 tablespoons extra-virgin olive oil",
        "1 red onion, finely chopped",
        "2 jalapeno peppers, seeded and chopped",
        "1 clove garlic, chopped",
        "1 teaspoon Worcestershire sauce",
        "1/2 teaspoon dried basil",
        "1/4 teaspoon dried oregano",
        "1/4 cup tomato sauce, or to taste",
        "1 tablespoon freshly grated Parmesan cheese",
        "salt and ground black pepper to taste",
        "2 tablespoons freshly grated Parmesan cheese, or to taste - divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Zucchini Boats with Meat",
    "url": "http://allrecipes.com/recipe/232110/stuffed-zucchini-boats-with-meat/"
}
