{
    "directions": [
        "For the sauce, heat the olive oil in a large saucepan, add the onions, and cook over medium-low heat for 8 minutes, until the onions are translucent. Add the tomatoes, vinegar, brown sugar, raisins, salt, and pepper. Bring to a boil, then lower the heat and simmer uncovered for 30 minutes, stirring occasionally. Set aside.",
        "Meanwhile, bring a large pot of water to a boil.",
        "Remove the entire core of the cabbage with a paring knife. Immerse the head of cabbage in the boiling water for a few minutes, peeling off each leaf with tongs as soon as it s flexible. Set the leaves aside. Depending on the size of each leaf, you will need at least 14 leaves.",
        "For the filling, in a large bowl, combine the ground chuck, eggs, onion, breadcrumbs, rice, thyme, salt, and pepper. Add 1 cup of the sauce to the meat mixture and mix lightly with a fork.",
        "Preheat the oven to 350 degrees F.",
        "To assemble, place 1 cup of the sauce in the bottom of a large Dutch oven. Remove the hard triangular rib from the base of each cabbage leaf with a small paring knife. Place 1/3 to 1/2 cup of filling in an oval shape near the rib edge of each leaf and roll up toward the outer edge, tucking the sides in as you roll. Place half the cabbage rolls, seam sides down, over the sauce. Add more sauce and more cabbage rolls alternately until you ve placed all the cabbage rolls in the pot. Pour the remaining sauce over the cabbage rolls. Cover the dish tightly with the lid and bake for 1 hour or until the meat is cooked and the rice is tender. Serve hot."
    ],
    "ingredients": [
        "3 tablespoons good olive oil",
        "1 1/2 cups chopped yellow onions (2 onions)",
        "2 (28-ounce) cans crushed tomatoes and their juice",
        "1/4 cup red wine vinegar",
        "1/2 cup light brown sugar, lightly packed",
        "1/2 cup raisins",
        "1 1/2 teaspoons kosher salt",
        "3/4 teaspoon freshly ground black pepper",
        "1 large head Savoy or green cabbage, including outer leaves",
        "2 1/2 pounds ground chuck",
        "3 extra-large eggs, lightly beaten",
        "1/2 cup finely chopped yellow onions",
        "1/2 cup plain dried breadcrumbs",
        "1/2 cup uncooked white rice",
        "1 teaspoon minced fresh thyme leaves",
        "1 1/2 teaspoons kosher salt",
        "1/2 teaspoon freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beef",
        "Meat",
        "Cabbage Recipes",
        "Vegetable",
        "Fruit",
        "Raisin Recipes"
    ],
    "title": "Stuffed Cabbage",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/stuffed-cabbage-recipe"
}
