{
    "directions": [
        "Melt butter in heavy medium saucepan over medium-low heat. Add shallots; sauté until beginning to brown, about 10 minutes. Add sugar. Sauté until shallots are golden brown, about 10 minutes. Increase heat to medium-high. Add vinegar; boil 2 minutes. Add both stocks; boil until liquid is reduced to 1 1/2 cups, about 25 minutes. Strain.",
        "Soak dried fruit in hot water to cover for 15 minutes. Drain.",
        "Melt 1 tablespoon butter in heavy medium skillet over medium-high heat. Add mushrooms and sauté until tender, about 4 minutes. Add tomatoes and sauté until almost all liquid evaporates, about 4 minutes. Stir in fruit and sauté 2 minutes. Season with salt and pepper.",
        "Steam spinach until just wilted, about 2 minutes. Cool.",
        "Using sharp knife, cut horizontal slit 3/4 of the way through each chicken breast. Open as for book. Sprinkle with salt and pepper. Place thin layer of spinach over half of each breast. Top spinach with 2 tablespoons fruit mixture. Close breasts over filling. Tie with kitchen string. (Sauce and chicken can be made 1 day ahead; chill.)",
        "Preheat oven to 425°F. Melt 1 tablespoon butter in large skillet over medium-high heat. Sprinkle chicken with salt and pepper; brown in skillet, about 4 minutes per side. Transfer to baking sheet. Bake until chicken is cooked through, about 15 minutes.",
        "Bring sauce to simmer. Remove from heat. Gradually add 4 tablespoons butter, whisking just until melted. Remove string from chicken. Cut each breast crosswise into 5 slices. Serve with sauce."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "3/4 cup sliced shallots",
        "1/4 cup sugar",
        "1/4 cup cider vinegar",
        "2 1/2 cups chicken stock or canned low-salt broth",
        "1 1/2 cups beef stock or canned broth",
        "1/2 cup dried apricots, sliced",
        "1/4 cup raisins",
        "6 tablespoons (3/4 stick) butter",
        "5 mushrooms, chopped",
        "1 cup chopped seeded peeled tomatoes",
        "1 10-ounce package ready-to-use spinach, stemmed",
        "6 boneless chicken breast halves with skin",
        "Kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Bake",
        "Sauté",
        "Vinegar",
        "Dried Fruit",
        "Raisin",
        "Spinach",
        "Fall"
    ],
    "title": "Stuffed Chicken Breasts with Cider Vinegar Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-chicken-breasts-with-cider-vinegar-sauce-1015"
}
