{
    "directions": [
        "Preheat oven to 350°F with rack in middle.",
        "Spread bread crumbs in a shallow baking pan and toast in oven, stirring once or twice, until pale golden, about 10 minutes. Cool completely, then toss with parmesan, garlic, parsley, soppressata, provolone, 1 teaspoon salt, and 1/2 teaspoon pepper in a bowl. Drizzle oil (1/4 cup) over crumbs and toss to coat.",
        "Cut off artichoke stems and discard. Cut off top 1/2 inch of 1 artichoke with a serrated knife, then cut about inch off all remaining leaf tips with kitchen shears. Rub cut leaves with a lemon half.",
        "Separate leaves slightly with your thumbs, then pull out purple leaves from center and enough yellow ones to expose fuzzy choke. Scoop out choke with a melon-ball cutter or small spoon, then squeeze some juice from other lemon half into cavity. Repeat with remaining artichokes.",
        "Spoon about 2 tablespoons stuffing into cavity of each artichoke and, Starting with bottom leaves and spreading leaves open as much as possible without breaking, spoon a rounded teaspoon stuffing between each leaf.",
        "Put 1/2 cup water, 1/2 cup broth, 1/4 cup oil, 1 1/2 teaspoons garlic, 1/2 teaspoon salt, and 1/8 teaspoon pepper in pressure cooker (without insert) or pot and arrange 4 stuffed artichokes in liquid in 1 layer. Drizzle with 1/4 cup oil.",
        "If using pressure cooker, seal lid and cook at high pressure, according to manufacturer's instructions, 13 to 15 minutes. Put pressure cooker in sink (do not remove lid) and run cold water over lid until pressure goes down completely.",
        "If using a regular pot, simmer artichokes, covered, until leaves are tender, about 50 minutes. Transfer cooked artichokes, along with any liquid, to a shallow bowl and keep warm, loosely covered with foil.",
        "Repeat procedure to cook remaining stuffed artichokes. Transfer artichokes with tongs to 8 shallow soup bowls and spoon cooking liquid around them."
    ],
    "ingredients": [
        "4 cups fine fresh bread crumbs from an Italian loaf (1/2 pound)",
        "1 1/2 cups grated Parmigiano-Reggiano (3 ounces)",
        "3 tablespoons finely chopped garlic (5 cloves)",
        "1/2 cup finely chopped flat-leaf parsley",
        "1/2 cup minced sweet soppressata (dried Italian sausage; 2 1/2 ounces)",
        "1 cup finely chopped provolone cheese (1/4 pounds)",
        "1/4 cup olive oil",
        "8 medium artichokes (8 to 9 ounces each)",
        "1 lemon, halved",
        "1 cup water, divided",
        "1 cup reduced-sodium chicken broth, divided",
        "1 cup olive oil, divided",
        "1 tablespoon finely chopped garlic, divided",
        "Equipment: a 6- to 8-qt pressure cooker or a wide 4- to 6-qt heavy pot with a tight-fitting lid"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pressure Cooker",
        "Cheese",
        "Dairy",
        "Vegetable",
        "Appetizer",
        "Christmas",
        "Thanksgiving",
        "Parmesan",
        "Meat",
        "Sausage",
        "Artichoke",
        "Fall",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Stuffed Artichokes",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-artichokes-240554"
}
