{
    "directions": [
        "In a small bowl, stir together the filling ingredients of your choice. Set aside.",
        "Place the ground beef in a large bowl and sprinkle with the hamburger seasoning. Using your hands, gently mix the ingredients together; do not overmix.",
        "Divide the beef into 6 equal portions and shape each into a ball. Using your thumb, make a deep depression in each ball; do not push all the way through. Spoon about 1 Tbs. of the filling mixture into the depression. Gently shape the meat around the filling, sealing it inside. Using a burger press according to the manufacturer's instructions, or using your hands, form the balls into patties about 1 inch thick. Transfer the patties to a flexible easy-turn grill basket and set aside.",
        "Put the red onion slices in a shallow bowl and toss with enough olive oil to lightly coat. Arrange on a nonstick grill topper. Set aside.",
        "Prepare a medium-hot fire in a grill.",
        "Place the grill topper on the grill. Cook, turning the onion slices once, until softened and slightly caramelized, 10 to 15 minutes total. Transfer to a plate and cover loosely with aluminum foil.",
        "Place the burgers on the grill and cook, turning once, 5 to 7 minutes per side for medium, or until done to your liking.",
        "Transfer each burger to the bottom half of a bun. Spread mayonnaise on the inside of each top bun. Top each burger with grilled onion slices, lettuce and tomatoes. Serve immediately. Serves 6."
    ],
    "ingredients": [
        "4 bacon slices, cooked until crispy and crumbled",
        "2 oz. blue cheese, crumbled",
        "3 oz. feta cheese, crumbled",
        "Zest of 1/2 lemon",
        "1 1/2 tsp. minced fresh oregano",
        "2 oz. feta cheese, crumbled",
        "1 small yellow onion, diced and caramelized",
        "2 oz. Roquefort cheese, crumbled",
        "1 small yellow onion, diced and caramelized",
        "2 1/4 lb. ground beef",
        "5 Tbs. hamburger seasoning",
        "1 large red onion, sliced 1/4 inch thick",
        "Olive oil as needed",
        "6 hamburger buns",
        "Mayonnaise for serving",
        "Lettuce leaves for serving",
        "6 tomato slices"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Stuffed Burgers",
    "url": "http://www.williams-sonoma.com/recipe/stuffed-burgers.html"
}
