{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Melt 2 tablespoons butter in a skillet. Cook and stir mushrooms and garlic in melted butter until tender, about 3 minutes. Remove skillet from heat. Mix bread crumbs, blue cheese, pistachio nuts, cranberries, parsley, onion powder, and seasoned salt into the mushroom mixture.",
        "Cut a long slice lengthwise down the center of the tenderloin to within 1/2 inch of the other side. Spoon stuffing into the slice and fold meat around the stuffing. Secure tenderloin closed with kitchen string. Brush olive oil over the tenderloin; sprinkle with salt. Put tenderloin in a roasting pan.",
        "Roast in preheated oven until an instant-read thermometer reads 140 degrees F (60 degrees C), 35 to 40 minutes. Cover beef loosely with aluminum foil and rest meat 15 minutes before slicing.",
        "As the beef roasts, stir currant jelly, Merlot wine, beef broth, and 2 tablespoons butter together in a saucepan; bring to a boil. Reduce heat to medium-low and cook at a simmer until thick and syrupy, 35 to 40 minutes.",
        "Arrange beef slices onto a platter and drizzle with currant sauce to serve."
    ],
    "ingredients": [
        "Stuffing:",
        "2 tablespoons butter",
        "1 cup finely chopped mushrooms",
        "1/2 teaspoon minced garlic",
        "1/2 cup dry bread crumbs",
        "1/2 cup crumbled blue cheese",
        "1/4 cup finely chopped pistachio nuts",
        "1/4 cup finely chopped dried cranberries",
        "1 tablespoon dried parsley",
        "1/2 teaspoon onion powder",
        "1/4 teaspoon seasoned salt",
        "1 (2.5 pound) beef tenderloin",
        "1 tablespoon olive oil",
        "salt to taste",
        "Currant Sauce:",
        "1 cup currant jelly",
        "1 cup Merlot wine",
        "1/2 cup beef broth",
        "2 tablespoons butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Tenderloin Roast with Currant Sauce",
    "url": "http://allrecipes.com/recipe/232726/stuffed-tenderloin-roast-with-currant/"
}
