{
    "directions": [
        "Fill a medium pot with enough water to cover the onions and bring to a boil. Add whole onions, return to a boil, and cook until tender, 20 to 25 minutes. Using a slotted spoon, remove onions to a colander, drain, and let stand until cool enough to handle. Cut a 1/2-inch wedge from the outside to the core of each onion, then carefully peel 5 outer layers from each onion and reserve; chop the onion wedges and core, and reserve separately.",
        "In a medium skillet, heat the oil over medium-high. Add the chopped onion and cook, stirring, until golden, 4 to 5 minutes. Add the lamb, anchovies, salt, and pepper and cook, breaking meat up with a wooden spoon, until lamb is no longer pink, 5 to 6 minutes. Add the rice and cook, stirring, until translucent, 2 to 3 minutes. Add the spices and 1 cup broth; cook, stirring, until evaporated, 4 to 5 minutes. Transfer lamb mixture to a rimmed baking sheet and cool slightly; cover and refrigerate for 30 minutes. Remove from the refrigerator, transfer to a bowl, and add parsley, cilantro, and 1 tablespoon pomegranate molasses.",
        "Preheat the oven to 250°F. In a small bowl, whisk together the remaining broth and pomegranate molasses with the tomato paste. Wrap one onion layer around about 2 to 3 tablespoons filling and arrange seam-side down in a 2-quart shallow baking dish. Repeat with remaining onion layers and filling.",
        "Pour liquid over stuffed onions, cover with foil, and roast until tender and some of the liquid is absorbed, 2 hours (you can roast for up to 3 additional hours for softer, more savory onions). Remove from oven and uncover. Preheat broiler and broil until golden brown, 1 to 2 minutes. Let cool for 10 minutes. To serve, drizzle with oil, and garnish with pomegranate seeds, parsley, and cilantro."
    ],
    "ingredients": [
        "2 large Spanish onions (1 pound), peeled and left whole",
        "2 tablespoons extra-virgin olive oil, plus more for drizzling",
        "1/4 pound ground lamb",
        "1 1/2 oil-packed anchovies, drained, patted dry, and finely chopped",
        "1/2 tablespoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "3/4 cup raw jasmine rice",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon ground cinnamon",
        "1 pinch ground nutmeg",
        "3 cups low-sodium chicken broth, divided",
        "3 tablespoons pomegranate molasses, divided",
        "1 tablespoon chopped parsley, plus more for garnish",
        "1 tablespoon chopped cilantro, plus more for garnish",
        "3 tablespoons tomato paste",
        "1/4 cup pomegranate seeds, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Side",
        "Rosh Hashanah/Yom Kippur",
        "Ground Lamb",
        "Pomegranate",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Stuffed Onions with Spiced Lamb and Pomegranate",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-onions-with-spiced-lamb-and-pomegranate-51251810"
}
