{
    "directions": [
        "Preheat the oven to 425 degrees F. Line a large casserole pan with Reynolds Wrap(R) Aluminum Foil. Set aside.",
        "Cut squashes in half. Use a spoon to scrape the seed pulp out of the squashes. If necessary, cut 1/4 inch off the bottom of the squash halves to help them stand upright without falling over. Place the squash cut side up on the foil and set aside.",
        "Heat the olive oil in a large frying pan over medium heat. Add the bacon and saute until just cooked through on both sides, working in batches if necessary. Remove from the pan, allow to cool slightly and then dice.",
        "Saute the onion and garlic in the rendered fat until softened and transparent, about 8 minutes. Add the rice, chicken stock, dates, cinnamon, salt, pepper, allspice, nutmeg and diced bacon. Stir to combine. Allow the mixture to simmer for 10 minutes, uncovered, stirring every few minutes.",
        "Add the sage and remove from heat. Gently spoon the stuffing into the squash. Spoon any leftover stuffing around the squash in the pan, then pour the water into the pan. Place the pan in the oven and roast until the squash flesh is tender and the rice is cooked through, about 45 minutes to 1 hour. Cool for 15 minutes before serving."
    ],
    "ingredients": [
        "8 acorn squash",
        "2 tablespoons extra virgin olive oil",
        "1 pound bacon",
        "1 medium sweet onion, diced",
        "2 cloves garlic, minced",
        "1 1/2 cups medium-grain white rice",
        "3 cups chicken stock",
        "1 cup chopped pitted dates",
        "3/4 teaspoon ground cinnamon",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon black pepper",
        "1/2 teaspoon allspice",
        "1/4 teaspoon nutmeg",
        "1/4 cup minced fresh sage leaves",
        "1 cup water",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Squash with Bacon, Dates and Sage",
    "url": "http://allrecipes.com/recipe/245471/stuffed-squash-with-bacon-dates-and/"
}
