{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Combine the chopped prunes and currants with the creme de cassis in a small bowl, and set aside.  In another small bowl, combine the rosemary, thyme, coriander, salt, and pepper; set aside.",
        "Untie and unroll the lamb, lay it out flat on the work surface.  Trim off excess fat, and cut any thick parts open so that it is evenly thick and somewhat rectangular in shape.  Sprinkle half of the herb mixture over the lamb. Mix the almonds and chopped mint into the prune mixture; spread evenly over the lamb.  Roll up starting at one of the short sides, and tie with kitchen twine in 1-inch intervals.  Cut 9 slits about 1-inch deep into the top of the lamb, and insert a slice of garlic in each.  Rub with olive oil, and sprinkle with the remaining herb mixture.",
        "Place lamb seam-side up on a rack set in a roasting pan.  Roast in the preheated oven to desired doneness.  For medium-rare, a thermometer inserted into the center will read 140 degrees F (60 degrees C).  Remove lamb from the oven and cover with foil.  Allow to rest for 15 minutes while proceeding with the recipe.",
        "While the lamb is resting, bring the balsamic vinegar to a boil in a small saucepan over high heat.  Boil until the vinegar has reduced by half, 4 to 5 minutes. Once reduced, stir in the butter, honey, and sliced figs.  Stir until the butter has melted, then remove from the heat, stir in the chopped basil and set aside.",
        "To serve, remove the twine from the lamb and cut into 1/2 inch thick slices.  Arrange on a warm serving platter and drizzle with the fig sauce, garnish with mint and basil leaves."
    ],
    "ingredients": [
        "1/2 cup coarsely chopped prunes",
        "1/4 cup currants",
        "2 tablespoons creme de cassis liqueur",
        "1 1/2 tablespoons minced fresh rosemary",
        "1 1/2 tablespoons minced fresh thyme",
        "1/2 teaspoon ground coriander",
        "1 1/4 teaspoons salt",
        "1 teaspoon freshly ground black pepper",
        "1 (4 pound) boneless leg of lamb, rolled and tied",
        "1/2 cup chopped roasted and salted almonds",
        "2 tablespoons chopped fresh mint",
        "3 cloves garlic, cut into thirds",
        "2 tablespoons olive oil",
        "1/2 cup balsamic vinegar",
        "5 tablespoons butter",
        "3 tablespoons honey",
        "1/3 cup thinly sliced, stemmed Calimyrna figs",
        "5 teaspoons chopped fresh basil",
        "6 leaves mint",
        "6 leaves basil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Leg of Lamb with Balsamic-Fig-Basil Sauce",
    "url": "http://allrecipes.com/recipe/112260/stuffed-leg-of-lamb-with-balsamic-fig/"
}
