{
    "directions": [
        "To make the sauce:",
        "Coat a 3-quart saucepan with the oil and place over medium heat. Add the garlic and saute for 1 minute. Add the tomatoes and cook, stirring occasionally, for 5 minutes. Add the vinegar and sugar; simmer, until the sauce thickens, about 5 minutes. Season with salt and pepper and remove from the heat.",
        "Place a skillet over medium heat and coat with 2 tablespoons of the olive oil. Sauté the onion and garlic for about 5 minutes, until soft. Stir in the tomato paste, a splash of wine, parsley, and 1/2 cup of the prepared sweet and sour tomato sauce, mix to incorporate and then take it off the heat. Combine the ground meat in a large mixing bowl. Add the egg, the cooked rice, and the sauteed onion mixture. Toss the filling together with your hands to combine, season with a generous amount of salt and pepper.",
        "Bring a large pot of salted water to a boil. Remove the large, damaged outer leaves from the cabbages and set aside. Cut out the cores of the cabbages with a sharp knife and carefully pull off all the rest of the leaves, keeping them whole and as undamaged as possible, (get rid of all the small leaves and use them for coleslaw or whatever.) Blanch the cabbage leaves in the pot of boiling water for 5 minutes, or until pliable. Run the leaves under cool water then lay them out so you can assess just how many blankets you have to wrap up the filling. Next, carefully cut out the center vein from the leaves so they will be easier to roll up. Take the reserved big outer leaves and lay them on the bottom of a casserole pan, let part of the leaves hang out the sides of the pan. This insulation will prevent the cabbage rolls from burning on the bottom when baked. Use all the good looking leaves to make the cabbage rolls. Put about 1/2 cup of the meat filling in the center of the cabbage and starting at what was the stem-end, fold the sides in and roll up the cabbage to enclose the filling. Place the cabbage rolls side by side in rows, seam-side down, in a casserole pan.",
        "Preheat the oven to 350 degrees F.",
        "Pour the remaining sweet and sour tomato sauce over the cabbage rolls. Fold the hanging leaves over the top to enclose and keep the moisture in. Drizzle the top with the remaining 2 tablespoons of olive oil. Bake for 1 hour until the meat is cooked."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "2 garlic cloves, smashed",
        "1 1/2 quarts crushed tomatoes",
        "2 tablespoons white wine vinegar",
        "1 tablespoon sugar",
        "Kosher salt and freshly ground black pepper",
        "2 tablespoons extra-virgin olive oil",
        "1 yellow onion, chopped",
        "2 garlic cloves, minced",
        "2 tablespoons tomato paste",
        "Splash dry red wine",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "1 pound ground beef",
        "1 pound ground pork",
        "1 large egg",
        "1 1/2 cups steamed white rice",
        "Kosher salt and freshly ground black pepper",
        "2 large heads green cabbage, about 3 pounds each"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Appetizer",
        "Appetizer",
        "Easy Recipes",
        "Easy Side Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Christmas Appetizer",
        "Christmas",
        "Holiday",
        "Christmas Dinner",
        "European Recipes",
        "Polish Recipes",
        "Sauce Recipes",
        "Meat",
        "Rice Recipes",
        "Pork",
        "Cabbage Recipes",
        "Vegetable",
        "Sauteing Recipes"
    ],
    "title": "Stuffed Cabbage Rolls (Galumpkis)",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/stuffed-cabbage-rolls-galumpkis-recipe"
}
