{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Lightly season hens with salt and black pepper to taste.",
        "Mix rice, almonds, green onion, and 1/4 cup butter together in a saucepan over low heat; cook and stir until rice is lightly toasted, about 10 minutes. Add water, chicken bouillon, lemon juice, and 1 teaspoon salt; bring to a boil. Reduce heat, cover, and simmer until rice is cooked and water is absorbed, 20 to 25 minutes. Stir parsley into rice mixture.",
        "Stuff the cavity of each hen with rice mixture; truss the hens by securing the legs together with kitchen string. Place hens breast-side up in a shallow pan; loosely cover the pan with tented aluminum foil.",
        "Roast hens in the preheated oven for 30 minutes.",
        "Mix currant jelly, Burgundy wine, 2 tablespoons butter, lemon juice, cornstarch, Worcestershire sauce, and allspice together in a saucepan; cook and stir over medium heat until glaze is smooth and thickened, 10 to 15 minutes.",
        "Uncover hens and brush with Burgundy glaze; continue roasting for 1 hour, brushing frequently with glaze. Drumsticks with move easily in sockets when done. An instant-read thermometer inserted near the bone of the hens and in the center of the stuffing should read 165 degrees F (74 degrees C). Transfer hens to a hot platter and serve with remaining glaze."
    ],
    "ingredients": [
        "4 (1 1/2 pound) Rock Cornish hens",
        "salt and ground black pepper to taste",
        "2/3 cup long-grain rice",
        "1/2 cup slivered almonds",
        "6 tablespoons sliced green onion",
        "1/4 cup butter",
        "2 cups water",
        "2 cubes  chicken bouillon",
        "2 teaspoons lemon juice",
        "1 teaspoon salt",
        "6 tablespoons chopped fresh parsley",
        "Burgundy Glaze:",
        "1/2 cup currant jelly",
        "1/2 cup Burgundy wine",
        "2 tablespoons butter",
        "1 tablespoon lemon juice",
        "2 teaspoons cornstarch",
        "2 teaspoons Worcestershire sauce",
        "1/2 teaspoon ground allspice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Cornish Hens Burgundy",
    "url": "http://allrecipes.com/recipe/230228/stuffed-cornish-hens-burgundy/"
}
