{
    "directions": [
        "To make the stuffing: Melt butter or margarine in a large saucepan over a medium-low heat. Saute onion, celery, and parsley until all of the vegetables are just tender. Mix in crabmeat, shrimp, and vermouth. Season with salt, pepper and hot pepper sauce; cook until shrimp is finished cooking (it will be pink). Mix in bread crumbs, a little at a time. When the mixture holds together well, stop adding bread crumbs. Taste and add more seasoning (salt, pepper, and hot pepper sauce) if necessary. Set this mixture aside to let it cool.",
        "Spray a baking sheet with non-stick cooking spray.",
        "Roll 1 sheet of puff pastry onto a flat surface. The puff pastry, once rolled should be about 1/3 to 1/4 inch thick and large enough for you to lay the fish on top of it and still have puff pastry on the sides. Lay one of the fish fillets on top of the puff pastry. Spread the stuffing mixture evenly over the fish fillet. Place the remaining fillet over the stuffing. Trim the pastry around the filets in roughly the shape of a fish. Save the trimmings.",
        "Roll second sheet of puff pastry out to about 1/3 to 1/4 inch thick.  Drape second sheet over stuffed fillets, making sure that there is enough of the top sheet to tuck under the bottom sheet of puff pastry.  Trim the top sheet of pastry about 1/2 inch larger than the bottom sheet.  Brush underside of top pastry sheet with water and tuck under bottom sheet of puff pastry pressing lightly to totally encase the fish and stuffing package. Place the sealed packet on the prepared baking sheet, and let it cool for 10 to 15 minutes.",
        "While packet is chilling, roll out pastry scraps.  From the scraps cut out fins, an eye and 'lips'.  Attach cut-outs to chilled package with a little water.  Use an inverted teaspoon to make indentations in puff pastry to resemble fish scales but do not puncture pastry.  Chill entire package.",
        "While the package is chilling, preheat the oven to 425 degrees F (220 degrees C).",
        "Remove the fish from the refrigerator and brush the package with the egg yolks. Measure the thickness of the package at its thickest part. Bake for 15 minutes, then reduce the temperature to 350 degrees F (175 degrees C) and bake the fish for 10 extra minutes per inch of measured thickness. Test for doneness by inserting a thermometer into the package, when the temperature reaches 140 degrees F (70 degrees C) the fish is finished cooking."
    ],
    "ingredients": [
        "1/4 cup butter",
        "1 cup finely chopped onion",
        "1 cup minced celery",
        "1 tablespoon chopped fresh parsley",
        "8 ounces crabmeat",
        "8 ounces shrimp, peeled, deveined and minced",
        "1/4 cup dry vermouth",
        "salt to taste",
        "ground black pepper to taste",
        "1/4 teaspoon hot pepper sauce",
        "1/2 cup bread crumbs",
        "1 (17.5 ounce) package frozen puff pastry sheets, thawed",
        "2 pounds flounder fillets",
        "2 egg yolks, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Fish in Puff Pastry",
    "url": "http://allrecipes.com/recipe/19515/stuffed-fish-in-puff-pastry/"
}
