{
    "directions": [
        "Preheat oven to 375  degrees F (190 degrees C).",
        "To make the apple stuffing: In a saute pan or skillet on medium heat, melt the butter and saute thyme, chopped apples, salt and pepper together until the apples are completely softened; about 15 to 20 minutes.",
        "Place the apple mixture in a bowl and mix in 1/4 cup Gorgonzola cheese.  The cheese should liquefy into the stuffing within a couple of minutes.",
        "To prepare the pork chops: Butterfly the pork chops by slicing them parallel to the plane of the chop from the fat side to the bone.  Stuff each one with about 2 to 3 tablespoons of the apple mixture.",
        "Bake the chops for about 1 hour.  Place the chops on a rack with the two stuffing sides pressed together to hold the stuffing inside the chops.",
        "To make the sauce: Heat the oil in a saute pan or skillet on medium heat, then saute the garlic until transparent, and the cheese until slightly melting.  Immediately add the sherry, let cook for a minute until combined, then add the cream and 1/4 cup of the chicken stock, salt and pepper.  Stir until well blended.  Stir occasionally and reduce the liquid on medium high heat until the sauce begins to toast/caramelize and turn darker brown.  Add the remaining 1/4 cup chicken stock, reincorporate the cheese and continue reducing until there is just 1/4 to 1/2 cup of thick liquid remaining."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "1/2 tablespoon dried thyme",
        "1/2 cup chopped Granny Smith apples",
        "ground black pepper to taste",
        "1/4 cup Gorgonzola cheese at room temperature, crumbled",
        "2 thick cut pork chops",
        "1/2 teaspoon olive oil",
        "2 cloves garlic",
        "1/4 cup Gorgonzola cheese",
        "3 tablespoons dry sherry",
        "1/8 cup heavy cream",
        "1/2 cup chicken broth",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Pork Chops with Gorgonzola and Apple",
    "url": "http://allrecipes.com/recipe/21444/stuffed-pork-chops-with-gorgonzola-an/"
}
