{
    "directions": [
        "Prepare a medium-hot fire in a grill. Place a la plancha cast-iron griddle on the grill, cover the grill and preheat.",
        "Divide the burger blend into eight 4-oz. portions and shape each into a ball.",
        "Using a stuffed burger press according to the manufacturer’s instructions, make 4 burgers, stuffing each with one-fourth each of the caramelized onions and crumbled bacon. Season the burgers with salt and pepper.",
        "Brush the cut sides of the hamburger buns with the melted butter and place, buttered side down, on the plancha to lightly toast, about 30 seconds. Transfer the buns to a plate.",
        "Place the burgers on the plancha and cook, turning once, about 4 minutes per side, brushing the burgers with the barbecue sauce during the last 1 minute of cooking. Transfer the burgers to a plate.",
        "Meanwhile, make the beer-cheddar fondue: In a saucepan over medium heat, melt the butter. Add the flour and cook, stirring constantly, until fragrant, about 1 minute. Slowly whisk in the milk and beer and bring to a simmer. Reduce the heat to medium-low and continue to simmer until the mixture is slightly thickened, 2 to 3 minutes. Add the cheese by the handful, stirring until melted and incorporated.",
        "Place the burgers on the buns and serve immediately with the beer-cheddar fondue. Serves 4.",
        "Recipe by Adam Fleischman, Chef/Owner of Umami Burger."
    ],
    "ingredients": [
        "2 lb. ultimate burger blend or ground beef",
        "2 oz. caramelized onions",
        "4 thick bacon slices, cooked until crispy and crumbled",
        "Kosher salt and freshly ground pepper, to taste",
        "4 hamburger buns, split",
        "1 Tbs. unsalted butter, melted",
        "1/2 cup chipotle barbecue sauce or your other favorite sauce",
        "1 Tbs. unsalted butter",
        "1 Tbs. all-purpose flour",
        "1/4 cup milk",
        "1/2 cup dark ale",
        "10 oz. sharp cheddar cheese, grated"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Stuffed Barbecue Burgers with Beer-Cheddar Fondue",
    "url": "http://www.williams-sonoma.com/recipe/stuffed-barbecue-burgers-with-beer-cheddar-fondue.html"
}
