{
    "directions": [
        "Cook the pasta",
        "Bring a large pot of water to a boil over high heat. Add the 2 Tbs. salt and the pasta. Cook, stirring occasionally to prevent sticking, until not quite al dente (tender but firm to the bite), about 2 minutes less than the package instructions. Drain the pasta, rinse under cool water to prevent sticking and set aside.",
        "Prepare the filling",
        "Put the spinach and the water in a large fry pan over medium heat. Cook, stirring frequently, until wilted, about 2 minutes. Drain, pressing on the spinach with the back of a large spoon to remove as much water as possible. In a large bowl, combine the spinach, ricotta, egg yolks, nutmeg, the 1/2 tsp. salt, the 1/4 tsp. pepper and 1/2 cup of the Parmigiano-Reggiano. Blend well with a wooden spoon.",
        "Stuff and bake the cannelloni",
        "Preheat an oven to 375°F.",
        "Spread the bottom of a 10-by-12-inch baking dish with a large spoonful of the sauce. Use a teaspoon to stuff the cannelloni with the spinach filling. Place the stuffed pasta in the dish and spoon the sauce over the top. Sprinkle with the remaining 1/2 cup Parmigiano-Reggiano and cover the dish with aluminum foil. Bake for 15 minutes. Remove the foil and bake until bubbly and nicely colored, about 10 minutes more. Remove the cannelloni from the oven and let cool for 10 to 15 minutes before serving. Serves 4 to 6.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Slow Cooker,",
        "by Norman Kolpas (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "2 Tbs. plus 1/2 tsp. salt",
        "1/2 lb. cannelloni pasta",
        "1 1/2 lb. baby spinach, coarsely chopped",
        "1/2 cup water",
        "3 cups fresh ricotta cheese",
        "2 egg yolks, lightly beaten",
        "1/4 tsp. freshly grated nutmeg",
        "1/4 tsp. freshly ground pepper",
        "1 cup grated Parmigiano-Reggiano cheese",
        "4 cups bolognese sauce"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Stuffed Cannelloni with Bolognese",
    "url": "http://www.williams-sonoma.com/recipe/stuffed-cannelloni-with-bolognese.html"
}
