{
    "directions": [
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the shell pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 13 minutes. Drain well in a colander set in the sink.",
        "Heat a large skillet over medium-high heat and stir in the ground beef. Cook and stir until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease.",
        "Preheat an oven to 350 degrees F (175 degrees C). Spray 2 9x13-inch baking dishes with cooking spray. Combine the 2 cups mozzarella cheese, ricotta cheese, 1/4 cup Parmesan cheese, spinach, and pesto together in a bowl.",
        "Stir half of the cheese-spinach mixture into the cooked beef. Season with garlic powder. Spread about 1 cup spaghetti sauce into a 9x13-inch baking dish. Stuff 12 pasta shells with the beef and cheese mixture, then arrange in the baking dish. Top with the remaining spaghetti sauce, and sprinkle with 1/4 cup mozzarella cheese and 1/4 cup Parmesan cheese.",
        "Mix the remaining spinach-cheese mixture with ham and crab. Stuff the last 12 pasta shells with the ham mixture, and arrange in another 9x13-inch baking dish sprayed with nonstick spray. Pour the alfredo sauce on top, then sprinkle with 1/4 cup mozzarella cheese and 1/4 cup Parmesan cheese.",
        "Bake both casseroles in the preheated oven until the cheese melts and the sauce is bubbly, about 30 minutes."
    ],
    "ingredients": [
        "24 jumbo pasta shells",
        "1/4 pound ground beef",
        "cooking spray",
        "2 cups shredded mozzarella cheese",
        "1 (15 ounce) container ricotta cheese",
        "1/4 cup grated Parmesan cheese",
        "1 (10 ounce) package frozen chopped spinach, thawed and drained",
        "1 tablespoon prepared pesto",
        "1 teaspoon garlic powder",
        "1 (24 ounce) jar spaghetti sauce",
        "1/4 cup shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese",
        "1/4 pound finely chopped cooked ham",
        "1 (6 ounce) can crabmeat",
        "1 (15 ounce) jar Alfredo sauce",
        "1/4 cup shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Pasta Shells Surprise",
    "url": "http://allrecipes.com/recipe/218135/stuffed-pasta-shells-surprise/"
}
