{
    "directions": [
        "In a very small saucepan boil Sherry until reduced by about half and let cool. In a bowl whisk together Sherry, balsamic vinegar, garlic, shallot, sugar, and salt and pepper to taste and add oils in a stream, whisking until emulsified. Whisk in herbs and reserve 1/4 cup vinaigrette for dressing mesclun. Transfer remaining vinaigrette to a large sealable plastic bag.",
        "Discard stems from mushrooms. Add mushrooms to bag and seal, pressing out excess air. Put bag in a bowl. Marinate mushrooms, chilled, turning bag once or twice, at least 30 minutes and up to 2 hours.",
        "Preheat oven to 350°F.",
        "Finely chop onion and cut prosciutto into julienne strips. In a skillet cook onion in butter over moderately low heat, stirring, until soft and transfer to a bowl. Stir in prosciutto and remaining stuffing ingredients and salt and pepper to taste until combined well.",
        "Remove mushrooms from bag, letting excess vinaigrette drip off, and arrange mushrooms, gill sides up, in a 13- by 9- by 2-inch baking pan. Divide stuffing among mushrooms and press gently and evenly into caps. Pour water and Sherry around mushrooms and bake in middle of oven 20 to 25 minutes, or until stuffing is golden brown.",
        "In a bowl toss mesclun with reserved vinaigrette and salt and pepper to taste and divide among 4 plates. Transfer mushrooms with a slotted spatula to a cutting board and cut each crosswise into 4 or 5 pieces. Transfer a sliced mushroom to each plate and garnish with Parmesan curls."
    ],
    "ingredients": [
        "1/3 cup medium-dry Sherry",
        "3 tablespoons balsamic vinegar",
        "1 tablespoon minced garlic",
        "1 tablespoon minced shallot",
        "1 tablespoon sugar",
        "1/2 cup olive oil",
        "1/2 cup vegetable oil",
        "3 tablespoons finely chopped mixed fresh herbs such as basil, parsley, thyme, sage, and chives",
        "4 large portabella mushrooms (each 5 to 6 inches in diameter; about 1 pound total)",
        "1 medium white onion",
        "2 ounces thinly sliced prosciutto",
        "1/2 stick (1/4 cup) unsalted butter",
        "1 tablespoon finely chopped fresh basil leaves",
        "1/4 cup finely chopped fresh parsley leaves",
        "1 1/2 cups fine fresh bread crumbs",
        "1 cup freshly grated Parmesan (about 3 ounces)",
        "1/2 cup warm water",
        "1/4 cup medium-dry Sherry",
        "6 ounces mesclun (about 2 quarts loosely packed)",
        "Garnish: Parmesan curls, shaved with a vegetable peeler from a piece of Parmesan at room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Mushroom",
        "Appetizer",
        "Bake",
        "Marinate",
        "Lunch",
        "Parmesan",
        "Fall",
        "Prosciutto",
        "Lettuce",
        "Gourmet"
    ],
    "title": "Stuffed Marinated Portabella Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-marinated-portabella-mushrooms-15750"
}
