{
    "directions": [
        "Heat olive oil in a 14-inch skillet over medium heat. Quickly saute the minced garlic and onions. Add the tomatoes and saute for 5 minutes, or until the tomatoes soften. Add cinnamon, cloves, shrimp (reserved from the stock), olives, chiles, stock, wine, and salt, and then simmer until all the liquid in the stuffing is cooked off.",
        "Preheat a grill to medium-high.",
        "Spoon about 4 or more tablespoons of stuffing inside the cavity of each boned fish. Thread a large upholstery needle with a 15-inch length of cooking string. Knot the string, and sew the fish closed. Rub the fish with generous amounts of butter, and then roll it in bread crumbs. Wrap each fish twice over in parchment paper making sure to butter the side of the paper that will touch the fish. Wrap the fish up in the paper, firmly tying off each end with a bit of string. Repeat this procedure with each fish. Place the fish on the grill for about 15 minutes, turning fish about halfway through cooking. A rich aroma of shrimp and toasted bread will indicate when the fish is finished cooking.",
        "Remove the parchment paper, snip away string, and promptly serve the fish on a platter with parsley sprigs and lemon wedges. Serve with the Salsa for Fish.",
        "Pour 2 cups water into a 5-quart soup pot and bring to a boil. Add the unshelled shrimp, garlic, and salt. Reduce the heat to medium and simmer for 3 to 4 minutes. Remove the shrimp, cool, peel, and chop into small chunks. Reserve both the stock and shrimp for the stuffing.",
        "Heat a dry heavy skillet over a medium flame and toast the chiles for 30 seconds or until the skin turns a dark red. Set aside. Place the garlic, onion, and salt in a food processor or blender and grind to a coarse consistency. Add the allspice and chiles and continue grinding until well blended. Add the tomatoes and grind them to a pulpy consistency. Pour the sauce into a serving bowl. Stir in rice wine vinegar, olive oil, and minced cilantro. Add 1 tablespoon warm water to thin, if needed."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "1 teaspoon minced garlic",
        "1/2 cup minced white onion",
        "2 1/2 cups finely diced tomatoes",
        "1/3 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "Shrimp reserved from stock",
        "1/3 cup green olives, pitted and chopped",
        "3 to 4 small yellow pickled chiles, halved",
        "5 tablespoons Shrimp Stock, recipe follows",
        "1/3 cup dry white wine",
        "3/4 teaspoon salt",
        "4 rainbow trout, each 12 inches long, boned",
        "1/4 cup butter, softened",
        "5 cups day-old sourdough bread crumbs",
        "10 sprigs Italian parsley",
        "3 lemons, cut into wedges",
        "Salsa for fish, recipe follows",
        "2 cups cold water",
        "1 1/2 pounds jumbo, unshelled shrimp",
        "1 garlic clove",
        "1/4 teaspoon salt",
        "5 cascabel chiles, seeded, and deveined",
        "2 whole arbol chiles",
        "1 large garlic clove, roasted and peeled",
        "1 tablespoon minced white onion",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon ground allspice",
        "2 large tomatoes, roasted and quartered",
        "1 teaspoon rice wine vinegar",
        "1 tablespoon olive oil",
        "12 cilantro sprigs, leaves minced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Shellfish Recipes",
        "Shrimp",
        "Tomato",
        "Vegetable",
        "Fish",
        "Trout Recipes",
        "Fruit",
        "Lemon Recipes",
        "Meat",
        "Olive Recipes",
        "Main Dish Recipes"
    ],
    "title": "Stuffed Whitefish: Pescado Blanco Relleno",
    "url": "http://www.foodnetwork.com/recipes/stuffed-whitefish-pescado-blanco-relleno-recipe"
}
