{
    "directions": [
        "Preheat the oven to 375 degrees F; line a baking sheet with parchment paper.",
        "On a floured surface, roll out the dough and cut it into two 12-by-14-inch portions. Layer half of the cheese, then half of the Italian Beef, giardiniera and red peppers on each portion of dough. Using a pastry brush, paint one of the short borders with the egg wash. Starting with the unwashed side, roll the dough into a cylinder, pinching the ends to seal. Transfer to the prepared baking sheet, poke with a fork or sharp knife to vent and brush with olive oil.",
        "Bake until golden brown on top, 20 to 25 minutes. Let stand for 15 minutes before cutting and serving with a sidecar of strained jus from the Italian Beef.",
        "Position a rack in the middle of the oven and preheat the oven to 350 degrees F.",
        "Liberally season the roast with salt and pepper. Heat the oil in a Dutch oven over medium-high heat. Sear the roast, browning on all sides until golden and caramelized. Reduce the heat if the oil begins to smoke. Transfer the roast to a plate and lower the heat to medium.",
        "Add the onions and saute, stirring occasionally, until they are just beginning to brown, 8 to 10 minutes. Add the Italian seasoning, crushed red pepper and garlic and saute until fragrant, 1 minute. Deglaze the pan with the red wine and cook until you no longer smell the alcohol and the wine has reduced. Add in the stock and thyme and bring to a simmer. Adjust the seasoning of the braising liquid.",
        "Return the roast and any accumulated juices back to the pot. Transfer to the oven and cook, turning every 30 minutes, until very tender, 3 1/2 to 4 hours. Transfer the roast to a cutting board and tent with foil. Once the roast has cooled, pull the meat into smaller chunks.",
        "Strain the braising liquid through a fine-mesh strainer and return to the pot. Bring to a simmer and adjust the seasoning if necessary. Serve the jus with the meat."
    ],
    "ingredients": [
        "All-purpose flour, for dusting",
        "1 pound prepared pizza dough, proofed in a greased bowl in a warm area for at least 1 hour",
        "1 pound shredded sharp provolone cheese",
        "Italian Beef, recipe follows, with the reduced braising liquid",
        "1 cup hot giardiniera",
        "1 cup roasted red peppers",
        "1 large egg, lightly beaten",
        "Olive oil, for brushing",
        "1 boneless chuck eye roast (about 3 1/2 pounds)",
        "Salt and freshly ground black pepper",
        "2 tablespoons vegetable oil",
        "1 medium onion, chopped",
        "1 tablespoon Italian seasoning",
        "1 tablespoon crushed red pepper flakes",
        "6 cloves garlic, chopped",
        "1/2 cup dry red wine",
        "4 cups good beef stock",
        "1 sprig fresh thyme"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Bread",
        "Cheese",
        "Provolone Recipes",
        "Beef",
        "Meat",
        "Appetizer",
        "Recipes for Parties",
        "Super Bowl",
        "Roasting"
    ],
    "title": "Stuffed Italian Beef Stromboli",
    "url": "http://www.foodnetwork.com/recipes/jeff-mauro/stuffed-italian-beef-stromboli"
}
