{
    "directions": [
        "Cook bacon in a 12-inch heavy ovenproof skillet over medium heat, stirring occasionally, until fat is rendered and bacon is golden but not crisp.",
        "Add garlic and cook, stirring occasionally, until pale golden, about 2 minutes. Add spinach and cook, turning with tongs, until wilted and tender, about 3 minutes. Toss spinach with mustard and 3/4 teaspoon each of salt and pepper in a bowl.",
        "Arrange tenderloin on a work surface with pointed (thinner) end nearest you. Starting at top (thicker part), make a lengthwise incision down center of tenderloin, cutting two thirds of the way through thickness of meat, adjusting depth of incision as tenderloin tapers (be careful not to cut all the way through). Open tenderloin. Turning knife horizontally, cut tenderloin open on either side like the flaps of a book jacket, being careful not to cut all the way through. Season inside of tenderloin with 3/4 teaspoon each of salt and pepper.",
        "Turn tenderloin so that a long side is nearest you, then spread spinach filling evenly over opened tenderloin, leaving a 1-inch border along long edge farthest from you. Arrange egg quarters, end to end, along edge nearest you.",
        "Preheat oven to 425°F with rack in middle.",
        "Roll up tenderloin tightly, then tie with string at 1 1/2-inch intervals.",
        "Pat tenderloin dry and season with 1/4 teaspoon salt and 3/4 teaspoon pepper.",
        "Heat oil in cleaned skillet over high heat until it shimmers. Sear tenderloin, turning occasionally, until golden brown, 8 to 10 minutes. Transfer skillet to oven and roast until an instant-read thermometer inserted diagonally 2 inches into thickest part registers 150°F, 18 to 25 minutes.",
        "Transfer tenderloin to a platter and cool completely, uncovered, about 30 minutes. Chill, covered, until cold, about 2 hours.",
        "Force eggs through a fine-mesh sieve into a bowl, then stir in remaining sauce ingredients.",
        "Cut off string, then thinly slice tenderloin. Serve pork, cold or at room temperature, with sauce."
    ],
    "ingredients": [
        "2 bacon slices, cut crosswise into 1/4-inch strips",
        "2 garlic cloves, finely chopped",
        "5 ounces spinach, coarse stems discarded, finely chopped",
        "2 teaspoons coarse-grain mustard",
        "1 (1-pound) pork tenderloin",
        "1 hard-boiled egg, quartered lengthwise",
        "1 tablespoon vegetable oil",
        "2 hard-boiled eggs",
        "3 tablespoons olive oil",
        "2 tablespoons mayonnaise",
        "1 tablespoon coarse-grain mustard",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon drained capers,",
        "Equipment: kitchen string",
        "Accompaniment: crusty bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Roast",
        "Dinner",
        "Pork Tenderloin",
        "Family Reunion",
        "Christmas Eve",
        "Potluck",
        "Capers",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Stuffed Pork Tenderloin with Mustard-Caper Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-pork-tenderloin-with-mustard-caper-sauce-243190"
}
