{
    "directions": [
        "Remove neck, giblets, and liver from turkey and reserve for another use. Rinse turkey inside and out and pat dry.",
        "Place whole nutmeg in center of 9-inch-square of cheesecloth. Using back of knife or cleaver, smash nutmeg. Add Sichuan peppercorns, star anise, cinnamon, cloves, coriander seeds and mace (if using), gather cheesecloth around spices, and tie tightly with kitchen string.",
        "In large stock pot over high heat, bring 2 gallons water to boil. Add spice package and ginger, then reduce heat to medium and simmer, uncovered, 20 minutes. Stir in salt, remove from heat, and let cool. Strain out and discard spice package and ginger.",
        "Place turkey in cooled brine (brine should completely cover turkey; if it doesn't add additional chicken stock) and refrigerate at least 12 hours and up to 24 hours.",
        "In large pot, soak rice in enough water to cover by 2 inches for 4 hours, then drain and set aside. In small, dry skillet over moderate heat, toast pine nuts, shaking skillet occasionally, until golden brown, about 3 to 4 minutes. Remove freom heat and set aside.",
        "In medium saucepan over high heat, combine 1 cup water, chestnuts, and sugar and bring to a boil. Reduce heat to low and simmer, covered, until chestnuts are tender, about 5 minutes. Stir in butter and continue to cook, uncovered, until most of liquid evaporates, about 5 minutes. Remove from heat and set aside.",
        "In heavy, large skillet over moderately high heat, heat oil until hot but not smoking. Add shallots and garlic and sauté until soft, about 3 to 4 minutes. Add sausage and mushrooms and sauté 2 minutes. Add rice and sauté, uncovered, until grains are coated with oil, about 2 minutes. Reduce heat to moderately low and slowly pour in stock. Continue cooking until rice is translucent and stock is absorbed, about 10 minutes. Remove from heat and let cool to room temperature.",
        "When rice is room temperature, stir in pine nuts, chestnuts, salt, and pepper.",
        "Preheat oven to 425°F.",
        "Remove turkey from brine and place, breast side up, on wire rack set over paper towel-lined, rimmed baking sheet to drain completely. Pat dry. Loosely fill large body cavity (and neck cavity if desired) with stuffing. Fold neck skin under body and secure with skewers. Tie legs together with kitchen string and tuck wings under bird or secure with kitchen string or skewers.",
        "Brush melted butter over breast side, then transfer turkey, breast side down, to rack set in large roasting pan. Brush other side with melted butter. Add 2 cups water to pan and roast 45 minutes. Reduce oven temperature to 350°F. Remove turkey from oven and flip over so breast side faces up, then return to oven and roast, adding water if pan juices evaporate, 45 minutes.",
        "Raise oven temperature to 425°F and roast until thermometer inserted in center of body cavity (stuffing) registers 165°F (fleshy part of thigh will be about 180°F; do not touch bone) and juices run clear when thigh is pierced with skewer, about 45 minutes. If skin starts to brown too much, tent breast with foil.",
        "Transfer turkey to platter, remove skewers, and discard string. Transfer stuffing from cavity to serving dish and keep warm, covered. Let turkey stand 30 minutes before carving."
    ],
    "ingredients": [
        "1 (12 to 14 pound) turkey, preferably organic, quills removed if necessary",
        "1 whole nutmeg",
        "1 tablespoon whole Sichuan peppercorns*",
        "6 whole star anise",
        "3 sticks cinnamon",
        "1 tablespoon cloves",
        "1 tablespoon coriander seeds",
        "1/2 teaspoon whole mace (optional)",
        "1 (3-inch) piece fresh ginger, unpeeled, sliced",
        "1 cup table salt",
        "1 1/2 cups Chinese short-grain sticky rice (also called \"sweet\" or glutinous\")",
        "1/2 cup pine nuts",
        "2 cups bottled peeled, roasted whole chestnuts",
        "1 tablespoon sugar",
        "1 tablespoon unsalted butter",
        "1/4 cup corn or soybean oil",
        "3 medium shallots, sliced (about 3/4 cup)",
        "3 garlic cloves, sliced",
        "8 ounces Chinese sausage or chorizo, thinly sliced",
        "1/2 pound shiitake mushrooms, stems removed and thinly sliced",
        "1 cup chicken or vegetable stock or low-sodium chicken broth**",
        "1 teaspoon kosher salt",
        "1/2 teaspoons freshly ground pepper",
        "1 stick (1/2 cup) unsalted butter, melted",
        "Red or green peppercorns can be substituted.",
        "**Additional stock may be necessary."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Mushroom",
        "Nut",
        "Onion",
        "Pork",
        "Rice",
        "turkey",
        "Marinate",
        "Roast"
    ],
    "title": "Stuffed Nanking Brined Turkey with Five Treasure Sweet Rice",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-nanking-brined-turkey-with-five-treasure-sweet-rice-236128"
}
