{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "To Make Stuffing: Melt butter in a large skillet over medium heat. When foam subsides add onion and saute, stirring frequently, for about 5 minutes. Stir in celery and apples; saute (without browning) about 5 minutes longer. Scrape skillet contents into a large mixing bowl. Add bread crumbs, ground pork, sausage meat, parsley, sage, salt and pepper. Mix together gently but thoroughly. (Note: Do not taste the uncooked stuffing, for it contains raw pork; instead, fry a small ball of the stuffing in the skillet, then taste and season with more salt and pepper as necessary).",
        "Fill the center of the crown with the stuffing, mounding it slightly. Cover it with a round of aluminum foil and wrap the ends of the chop bones in strips of foil to prevent them from charring and snapping off.",
        "Place the crown on a rack in a shallow roasting pan just large enough to hold it comfortably, and roast in the center of the oven, undisturbed, for about 3 hours or until internal temperature of meat is 175 degrees F (80 degrees C). (Note: 30 minutes before pork is done, remove the foil from the top of the stuffing to allow the top to brown.)",
        "Carefully transfer the crown to a large, heated, circular platter, strip the foil from the ends of the chops and replace it with paper frills. Let the crown rest for about 10 minutes before carving and serving.  To Carve Pork: Insert a large fork in the side of the crown to steady it and, with a large, sharp knife, cut down through each rib to detach the chops. Two chops per person is a customary portion accompanied by a generous serving of the stuffing."
    ],
    "ingredients": [
        "3 tablespoons butter",
        "3/4 cup chopped onion",
        "1/4 cup chopped celery",
        "1/2 cup peeled, cored and chopped tart apple",
        "1/2 cup fresh bread crumbs",
        "1 pound ground pork",
        "1/2 pound ground seasoned pork sausage",
        "1/2 cup chopped parsley",
        "1/2 teaspoon dried sage",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons ground black pepper",
        "9 pounds crown pork roast"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Crown Roast of Pork",
    "url": "http://allrecipes.com/recipe/15307/stuffed-crown-roast-of-pork/"
}
