{
    "directions": [
        "Preheat the oven to 400 degrees F. Cut the eggplants in half lengthwise, wrap each half in a sheet of Reynolds Wrap(R) Aluminum Foil and arrange them on a baking sheet. Roast the eggplants until the centers are soft and tender, about 30 minutes. Unwrap the eggplants and scoop out the center pulp, leaving a 1/2-inch border around the edges of each eggplant. Roughly chop the reserved pulp and set it aside.",
        "Add the olive oil to a medium saucepan set over medium-low heat. Add the garlic and cook, stirring constantly for 1 minute, then add the couscous, allspice, bay leaves and cinnamon stick and cook, stirring constantly, for an additional 2 minutes.",
        "Add the chicken broth and 1/2 teaspoon salt then bring the mixture to a boil. Reduce the mixture to a simmer, cover the saucepan, and cook the couscous until it is tender and the liquid has absorbed, 10 to 12 minutes. Remove the bay leaves and cinnamon stick. Stir in the reserved eggplant, parsley and feta cheese, then divide the couscous mixture evenly among the eggplants.",
        "Arrange the stuffed eggplants on a foil-lined baking sheet and return them to the oven, uncovered, and bake until they are warmed throughout, about 5 minutes. Remove the eggplants from the oven, top them with pomegranate seeds and serve immediately."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/3457384.jpg",
    "ingredients": [
        "2 medium eggplants",
        "1 tablespoon olive oil",
        "2 teaspoons minced garlic",
        "3/4 cup Israeli couscous, uncooked",
        "1/2 teaspoon allspice",
        "2 dried bay leaves",
        "1 cinnamon stick",
        "1 cup low-sodium chicken broth",
        "1/2 teaspoon salt",
        "1 1/2 tablespoons chopped fresh parsley",
        "1/2 cup crumbled feta cheese",
        "1/4 cup pomegranate seeds",
        "1 sheet Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Eggplant with Israeli Couscous",
    "url": "http://allrecipes.com/recipe/246792/stuffed-eggplant-with-israeli-couscou/"
}