{
    "directions": [
        "Preheat the oven to 350 degrees F and line a baking sheet with Reynolds Wrap(R) Aluminum Foil. Spray or grease the foil. Wipe the mushrooms clean with a damp paper towel and remove the stems. Place the mushrooms gill side up on the baking sheet and sprinkle with a bit of salt. Bake the mushrooms for 10 minutes to just soften.",
        "Finely chop the celery, leeks and garlic. In a saucepan over medium heat, warm 1 tablespoon of the olive oil. Once warmed, add the leek mixture and sea salt. Saute until softened, about 5-6 minutes.",
        "In another bowl, combine the pecans, panko breadcrumbs, Parmesan, beans, pepper flakes and black pepper. Stir to mix, mashing the beans a bit with the back of a spoon. Add the leek mixture, remaining tablespoon oil, and stir again. The filling mixture can be made an hour in advance.",
        "Spoon the vegetable mix into the mushroom caps, filling them generously. Sprinkle the tops with a little extra Parmesan and the grated fontina. Bake the mushrooms for another 10 minutes or until barely golden on top. Sprinkle with parsley and serve warm."
    ],
    "ingredients": [
        "16 ounces button or cremini mushrooms",
        "Salt to taste",
        "2 ribs chopped celery",
        "1 leek, white and light green parts only, cleaned",
        "1 large clove garlic",
        "2 tablespoons extra virgin olive oil, divided",
        "1/2 teaspoon sea salt",
        "1/3 cup toasted chopped pecans",
        "1/3 cup panko bread crumbs",
        "1/2 cup grated Parmesan cheese, plus additional for garnish",
        "1/2 cup canned cannellini beans, rinsed and drained",
        "1/2 teaspoon red pepper flakes",
        "1/2 teaspoon fresh ground black pepper",
        "1/3 cup grated fontina cheese, for garnish",
        "finely chopped flat-leaf parsley, for garnish",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Mushrooms, Leeks, White Beans and Pecans",
    "url": "http://allrecipes.com/recipe/244908/stuffed-mushrooms-leeks-white-beans/"
}
