{
    "directions": [
        "Working one at a time, place turkey breast, skin side down, on a cutting board. Using a sharp knife and cutting parallel to board, slice through thickest part of breast, cutting along length of breast without cutting all the way through, then open breast like a book. Place breast in between 2 large pieces of plastic wrap and pound with a meat mallet to a uniform thickness of 1/2\". Season inside of breast with 1 tsp. salt, 1/2 tsp. pepper, and 1/2 tsp. ground fennel. Transfer skin side up to a rimmed baking sheet; season with 1 tsp. salt, 1/2 tsp. pepper, and 1/2 tsp. ground fennel. Repeat with remaining breast. Let sit at room temperature 1 hour, or chill up to 24 hours for maximum flavor and juiciness (if chilled, let sit at room temperature 1 hour before roasting).",
        "Arrange a rack in center of oven; preheat to 450°F. Heat oil in a large skillet over medium-high. Add sausage, stirring and breaking up into small pieces with a spoon, until browned and cooked through, 5–7 minutes. Using a slotted spoon, transfer sausage to a large bowl, leaving drippings behind.",
        "Meanwhile, place croutons on a rimmed baking sheet. Crush slightly with the bottom of a small pot or pan until some pieces are smaller.",
        "Return skillet to medium-high heat and melt 2 Tbsp. butter. Add onion, squash, chopped fennel, garlic, thyme, and remaining 1 1/2 tsp. salt and 1/2 tsp. pepper and cook, stirring occasionally, until softened, 6–8 minutes. Stir in kale, 2 Tbsp. butter, and 1 cup broth and cook, scraping up brown bits on bottom of pan, until kale is wilted and butter is melted, about 3 minutes. Transfer to bowl with sausage. Fold in croutons and parsley; if mixture seems dry, add 1/4 cup broth.",
        "Flip breasts so they are skin side down. Divide stuffing between breasts, spreading with a spatula and leaving a 1\" border. Starting at 1 short end, roll each breast into a log, completely enclosing stuffing, then transfer each to separate, large pieces of cheesecloth. Wrap cheesecloth around turkey and secure by tying a piece of twine at each end (like a sausage). Tie 4–5 pieces of twine crosswise around log, spacing about 2–2 1/2\" apart. Rub remaining 4 Tbsp. butter all over breasts and transfer skin side up to roasting pan.",
        "Pour enough broth (about 4 cups) to come 1/4\" up sides of turkey. Reduce oven temperature to 375°F and roast turkey, basting with pan juices every 20 minutes and adding more broth if pan starts to dry out, until an instant-read thermometer inserted into the center reads 155°F, 60–70 minutes.",
        "Transfer to a cutting board and let sit 15–20 minutes (internal temperature should rise to 165°F). Remove twine and slice crosswise about 1/2\" thick to serve.",
        "Turkey can be seasoned 2 days ahead and stuffed, rolled in cheesecloth, and buttered 1 day ahead; loosely cover and chill. Let sit at room temperature 1 hour before roasting."
    ],
    "ingredients": [
        "2 (3-pound) skin-on, boneless turkey breasts",
        "5 1/2 teaspoons kosher salt, divided",
        "2 1/2 teaspoons freshly ground black pepper, divided",
        "2 teaspoons ground fennel, divided",
        "1 tablespoon olive oil",
        "10 ounces sweet or spicy Italian sausage, casings removed, crumbled",
        "1 1/2 cups homemade croutons (see Cooks’ Note) or plain small-dice store-bought croutons",
        "1/2 cup (1 stick) unsalted butter, softened, divided",
        "1 medium onion, chopped",
        "2 cups peeled, 1/4\"–1/2\"-cubed butternut squash",
        "1 cup chopped fennel",
        "3 garlic cloves, finely chopped",
        "3 tablespoons chopped thyme",
        "1 bunch Tuscan kale, stemmed, coarsely chopped (about 6 cups)",
        "5 cups (or more) low-sodium chicken broth, divided",
        "1/4 cup chopped parsley",
        "Butcher’s twine; cheesecloth; a large roasting pan or 2 (13x9\") baking dishes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Friendsgiving",
        "Thanksgiving",
        "Dinner",
        "Butternut Squash",
        "Fennel",
        "Kale",
        "Sausage",
        "turkey"
    ],
    "title": "Stuffed Turkey Breast With Butternut Squash, Kale, and Sausage",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-turkey-breast-with-butternut-squash-kale-and-sausage"
}
