{
    "directions": [
        "Remove plastic netting or twine from around the leg of lamb, if any, and open up the roast on a cutting board. Place the boned side of the roast up.  With a sharp paring knife, cut away any excess fatty areas. Use a sharp knife to cut 1/2-inch deep slits in the meat about 2 inches apart, to help the meat lie flat. Cover the meat with a sturdy piece of plastic wrap or a cut-apart food storage bag, and pound the meat with a mallet or the edge of a small plate until the roast is about 3/4 inch thick everywhere, and 10 to 14 inches square.",
        "Preheat an oven to 400 degrees F (200 degrees C).",
        "Sprinkle the upper side of the meat with salt and pepper, and then spread spinach leaves over the top of the roast to within 1/2 inch of the edges. Break up the goat cheese and sprinkle it evenly over the spinach, then sprinkle the pine nuts over the cheese.",
        "Roll the roast up into a tight cylinder, and tie the roast together with kitchen twine at 2 inch intervals. It's okay if a little stuffing protrudes from the sides of the roast.",
        "In a flat dish, mix together the flour, 1 tablespoon of salt, 1 tablespoon of pepper, the thyme, and the fennel seeds, and press the tied roast firmly into the flour mixture to coat all sides.",
        "Heat the sesame oil in a heavy oven-proof or cast-iron skillet over medium-high heat until the oil shimmers, and sear all sides of the roast, including the ends, to a golden brown color. Lay the roast into the skillet, place into the preheated oven, and roast to your desired degree of doneness, or an internal temperature of 145 degrees F (65 degrees C) for medium, about 40 minutes. Remove from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area  10 to 15 minutes before slicing."
    ],
    "ingredients": [
        "1 (5 pound) boneless leg of lamb",
        "salt and black pepper to taste",
        "1 (10 ounce) bag fresh spinach leaves",
        "6 ounces goat cheese, or more if needed",
        "2 teaspoons pine nuts",
        "kitchen twine",
        "1 cup all-purpose flour",
        "1 tablespoon salt",
        "1 tablespoon ground black pepper",
        "1 teaspoon dried thyme",
        "1 teaspoon fennel seeds",
        "1 tablespoon sesame oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Stuffed Leg of Lamb",
    "url": "http://allrecipes.com/recipe/206640/stuffed-leg-of-lamb/"
}
