{
    "directions": [
        "Preheat the oven to 400°F. Line a roasting pan with four layers of aluminum foil, each three times the length of the pan, with two layers extending crosswise across the pan.",
        "Combine the parsley, mint, garlic, carrots, and jalapeño in a medium bowl and stir together. Set aside.",
        "Lay the lamb flat on a clean work surface. In a small bowl, mix together the allspice, cardamom, nutmeg, cloves, salt, and pepper. Rub this spice mix all over both sides of the lamb. Spoon the reserved herb mixture down the middle of the lamb (there may be too much — pack in as much as possible). Roll the lamb up over the stuffing and secure it with lengths of kitchen string tied around it every few inches.",
        "Arrange the onions, cinnamon stick, and bay leaves in the foil-lined pan. Sprinkle the vinegar over all. Place the meat on top, and wrap it tightly in the foil. Pour enough water into the pan to fill it to about 1 inch. Bake for 3 hours, adding water to the pan every hour if necessary to maintain the level. The lamb should be very tender and browned.",
        "Remove the pan from the oven and pour off the water. Carefully open the foil, standing far away from it to avoid the steam. Ladle as much liquid as you can out of the foil and into a small saucepan. Reseal the foil to keep the meat warm. Add the red wine to the broth in the saucepan and bring to a boil over high heat. Whisk in the flour and cook until the sauce is smooth and has thickened a bit, 8 minutes. Remove from the heat.",
        "Transfer the lamb to a serving platter by sliding two lunch plates underneath it, on either side, to lift it out of the foil. Cut away the string. Arrange the onions around the lamb. Slice the lamb into 1/2-inch-thick pieces, and serve with the red wine sauce on the side."
    ],
    "ingredients": [
        "4 packed cups chopped fresh flat-leaf parsley",
        "1 packed cup chopped fresh mint leaves",
        "25 cloves garlic, mashed (see tip, below)",
        "2 1/2 pounds carrots, sliced into 1/4-inch-thick rounds",
        "1/2 teaspoon finely chopped jalapeño pepper",
        "2 tablespoons ground allspice",
        "1 teaspoon ground cardamom",
        "1/2 teaspoon grated nutmeg",
        "1/2 teaspoon ground cloves",
        "2 teaspoons salt",
        "1 teaspoon black pepper",
        "4 1/2 pounds boneless leg of lamb, butterflied, trimmed of excess fat, rinsed, and patted dry",
        "1 pound onions, halved",
        "One 3-inch cinnamon stick",
        "2 bay leaves",
        "1/4 cup red wine vinegar",
        "1 cup red wine",
        "low-sodium canned chicken broth, or verjus",
        "1 to 2 tablespoons all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Bake",
        "Roast",
        "Ramadan",
        "Dinner",
        "Mint",
        "Parsley",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Stuffed Leg of Lamb (Fakdeh Mehshi Khodra)",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-leg-of-lamb-fakdeh-mehshi-khodra-233061"
}
