{
    "directions": [
        "Place porcini mushrooms in large bowl. Pour 2 cups hot water over; let stand 30 minutes to soften. Using slotted spoons, remove mushrooms from soaking liquid. Discard liquid. Finely chop porcini.",
        "Heat oil in heavy large skillet over medium heat. Add garlic and saute 1 minute. Add porcini and parsley and saute 1 minute. Add wine and boil until liquid evaporates, about 2 minutes. Reduce heat to medium-low. Mix in button mushrooms. Cover and cook until tender, stirring occasionally, about 10 minutes. Uncover and simmer until liquid evaporates, about 3 minutes. Season with salt and pepper.",
        "Melt butter in large saucepan over medium heat. Add flour and stir 3 minutes (do not brown). Gradually whisk in milk. Simmer until sauce thickens, stirring occasionally, about 5 minutes. Stir in nutmeg. Season with salt and pepper. Cool to lukewarm, about 30 minutes.",
        "Whisk eggs and salt in large bowl. Gradually whisk in flour, then 1 1/4 cups milk. Strain into medium bowl. Let stand 1 hour.",
        "If necessary, add more milk by tablespoons to batter to thin to consistency of heavy whipping cream. Heat 8-inch diameter nonstick skillet over medium-high head. Brush with melted butter. Pour 3 tablespoons batter into skillet and swirl to coat bottom evenly. Cook until top appears dry, loosening sides of crepe with spatula, about 45 seconds. Turn and cook until brown spots appear on second side, about 30 seconds. Turn crepe out onto plate. Repeat with remaining batter, brushing skillet with butter and stacking crepes on plate.",
        "Place 8 crepes on work surface. Place 1 ham slice in center of each crepe. Spread 1 tablespoons sauce over each. Top each with 2 rounded tablespoons mushroom filling. Roll up crepe jelly roll style. Arrange rolled crepes in single layer in 13x9x2-inch glass baking dish. Spoon remaining sauce over.",
        "Preheat oven to 475°F. Bake uncovered until crepes are heated through and top is golden, about 20 minutes. Sprinkle with cheese."
    ],
    "ingredients": [
        "1 ounce dried porcini mushrooms",
        "2 cups hot water",
        "1 tablespoon olive oil",
        "1 garlic clove, minced",
        "1 tablespoon finely chopped fresh Italian parsley",
        "1/4 cup dry white wine",
        "1/2 pound button mushrooms, sliced",
        "6 tablespoons (3/4 stick) unsalted butter",
        "3 tablespoons plus 1 teaspoon unbleached all purpose flour",
        "2 2/3 cups milk (do not use low-fat or nonfat)",
        "1/4 teaspoon ground nutmeg",
        "8 thin 5x3-inch smoked ham slices",
        "1 1/2 cups grated Parmesan cheese",
        "2 large eggs",
        "1/4 teaspoon salt",
        "1 cup unbleached all purpose flour",
        "1 1/4 cups (or more) milk (do not use low-fat or nonfat)",
        "Melted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pork",
        "Bake",
        "Bastille Day",
        "Parmesan",
        "Ham",
        "Winter"
    ],
    "title": "Stuffed Crepes with Mushrooms, Ham and Bechamel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/stuffed-crepes-with-mushrooms-ham-and-bechamel-sauce-1202"
}
