{
    "directions": [
        "Make the cabbage rolls: Combine the bread and milk in a small bowl and soak 5 minutes. Squeeze the excess milk from the bread and transfer to a large bowl. Add the pork, beef, parmesan, eggs, parsley, cognac, oregano, garlic, nutmeg, 1 1/4 teaspoons salt and 1/4 teaspoon pepper; mix with your hands until combined. Cover with plastic wrap and refrigerate at least 30 minutes or up to 1 day.",
        "Meanwhile, bring a large pot of lightly salted water to a boil and fill a large bowl with ice water. Carefully separate the cabbage leaves (you will need 12 large leaves, or you can use 2 small leaves to make a large one). Working in batches, blanch the leaves until pliable, about 45 seconds, then remove with tongs and transfer to the ice water. Remove from the ice water, shake dry, then layer between paper towels to soak up the excess moisture. Trim the tough center stem from the bottom of each leaf.",
        "Shape the meat mixture into twelve 4-inch-long sausages. Lay out a cabbage leaf, then put a sausage on top lengthwise. Fold in the short ends of the leaf, then tightly roll up the leaf like a burrito. Repeat with the remaining cabbage leaves and sausages. Transfer the rolls to a plate and refrigerate until ready to cook.",
        "Fit a large, wide pot with a steamer insert and fill with 2 inches of water; bring the water to a boil. Arrange the cabbage rolls in the steamer insert, cover and reduce the heat to medium low; steam until the filling is cooked through, about 45 minutes.",
        "Meanwhile, make the sauce: Heat the butter in a saucepan over medium heat. Add the onion, garlic and red pepper flakes and cook, stirring occasionally, until the onion is soft, about 6 minutes. Add the cognac and simmer until almost evaporated, about 2 minutes. Add the tomatoes, 1 1/2 cups water, the oregano and 3/4 teaspoon salt; bring to a simmer and cook until slightly thickened, about 30 minutes. Transfer to a blender and puree until mostly smooth, then return to the pot; thin with up to 1/2 cup hot water, if desired. Season with salt. Bring just to a simmer and stir in a splash of cognac.",
        "Serve the cabbage rolls topped with the sauce, parmesan and parsley.",
        "Photograph by Con Poulos"
    ],
    "ingredients": [
        "2 slices white sandwich bread, torn into small pieces",
        "1/2 cup milk",
        "3/4 pound ground pork",
        "3/4 pound ground beef",
        "1/4 cup grated parmesan cheese",
        "2 large eggs, lightly beaten",
        "2 tablespoons chopped fresh parsley",
        "1 tablespoon cognac or brandy",
        "1 teaspoon chopped fresh oregano",
        "1 clove garlic, finely grated",
        "1/4 teaspoon freshly grated nutmeg",
        "Kosher salt and freshly ground pepper",
        "1 head Savoy cabbage",
        "4 tablespoons unsalted butter",
        "1 medium onion, chopped",
        "1 clove garlic, chopped",
        "Pinch of red pepper flakes",
        "3 tablespoons cognac or brandy, plus more for finishing",
        "1 28-ounce can crushed San Marzano tomatoes",
        "1/2 teaspoon chopped fresh oregano",
        "Kosher salt",
        "1/2 cup grated parmesan cheese",
        "1/4 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Cabbage Recipes",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Stuffed Cabbage Rolls With Tomato Sauce",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/stuffed-cabbage-rolls-with-tomato-sauce-recipe"
}
