{
    "directions": [
        "Heat 1 tablespoon oil in large saucepan over medium heat. Add garlic; cook, stirring occasionally, 1 minute. Add spinach, 1/4 teaspoon salt, 1/8 teaspoon pepper and the Italian seasoning; cook, stirring, just until spinach is wilted, about 2 minutes. Remove the spinach mixture to a medium-size bowl; let cool completely. When cool, add the capocollo, provolone cheese and egg; gently stir to combine completely.",
        "Place the pork chops on a flat work surface; cut a slit horizontally to the bone so chop can be opened like a book. Stuff each chop with 1/4 of the stuffing. (If freezing, wrap each chop tightly in freezer wrap, without toothpicks; freeze up to 1 month.) Secure chops with toothpicks.",
        "To cook and serve: If chops are frozen, thaw in refrigerator overnight.",
        "Preheat oven to 375 degree F.",
        "Heat remaining 1 tablespoon oil in large skillet. Add chops; cook 2 minutes per side or until browned. Place chops in single layer in a baking dish just large enough to hold them. Sprinkle with remaining 1/4 teaspoon salt and 1/8 teaspoon pepper. Bake the chops in the oven for 15 minutes or until the internal temperature registers 155 degrees on an instant-read thermometer when inserted in the pork. Remove chops to a platter; cover with foil. Let stand 5 to 10 minutes in warm place before serving."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "2 cloves garlic, chopped",
        "1 bag (6 ounces) baby spinach",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/2 teaspoon dried Italian seasoning",
        "1/4 pound capocollo (spicy Italian ham), cut into small dice",
        "1/4 pound provolone cheese, cut into small dice",
        "1 egg, lightly beaten",
        "4 thick-cut (1 1/4 to 1 1/2 inches) pork chops for stuffing (about 2 to 2 1/2 pounds total)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Stuffed Pork Chops",
        "Pork Chop",
        "Meat",
        "Pork",
        "Cheese",
        "Provolone Recipes",
        "Spinach",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Stuffed Pork Chops",
    "url": "http://www.foodnetwork.com/recipes/stuffed-pork-chops-recipe"
}
