{
    "directions": [
        "In a heavy saucepan bring 2 cups of the water to a boil, add the grits in a stream, stirring, and cook them, covered, over moderate heat, stirring occasionally, for 7 minutes, or until they are very thick. Add the Cheddar, the butter, and salt to taste, stir the mixture until the cheese is melted, and spread it in an 8-inch-square baking dish. Chill the grits mixture, covered, overnight.",
        "In a heavy skillet cook the bacon over moderate heat until it is crisp, transfer it to paper towels to drain, and crumble it fine. In the fat remaining in the skillet cook the bell pepper over moderate heat, stirring, until it is softened, stir in the lima beans, the corn, and the remaining 1/2 cup water, and simmer the succotash, covered partially, for 8 to 10 minutes, or until the beans are tender.",
        "Have ready in separate bowls the egg mixture and the bread crumbs. In a kettle heat 3/4 inch of the oil over moderately high heat until it registers 360°F. on a deep-fat thermometer. While the oil is heating cut the grits mixture into 9 squares. Working in batches, dip the squares into the egg mixture, letting the excess drip off, coat them with the bread crumbs, and fry them in the oil, turning them carefully, for 2 minutes on each side, or until they are golden, transferring them as they are fried to paper towels to drain. Serve the succotash spooned over the grits squares."
    ],
    "ingredients": [
        "2 1/2 cups water",
        "1/2 cup quick-cooking grits",
        "1 cup grated sharp Cheddar",
        "1 tablespoon unsalted butter",
        "2 slices of lean bacon",
        "1 green bell pepper, chopped fine",
        "1/2 cup fresh or frozen baby lima beans",
        "1 1/2 cups fresh corn kernels including the pulp scraped from the cobs (cut from about 2 ears of corn)",
        "1 large egg beaten with 1 tablespoon water",
        "fine dry bread crumbs for coating the grits",
        "vegetable oil for frying the grits"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Fry",
        "Cheddar",
        "Bacon",
        "Corn",
        "Lima Bean",
        "Chill",
        "Gourmet",
        "Sugar Conscious"
    ],
    "title": "Succotash on Fried Cheddar Grits",
    "url": "http://www.epicurious.com/recipes/food/views/succotash-on-fried-cheddar-grits-12309"
}
