{
    "directions": [
        "Melt butter in heavy large skillet over medium heat. Add bread and pepper and stir to coat. Sauté until croutons are golden and crisp on all sides, stirring occasionally, about 12 minutes. Sprinkle with salt. (Can be made 1 day ahead. Cool completely; store airtight at room temperature.)",
        "Melt butter in heavy large pot over medium heat. Add leeks, shallots, and garlic; sauté until leeks are soft, about 5 minutes. Add 4 tablespoons parsley, thyme, and oregano; sauté until fragrant, about 3 minutes. Mix in red bell pepper. Add broth and lima beans and bring soup to boil. Reduce heat to medium-low, cover, and simmer until lima beans are tender, about 10 minutes. Add creamed corn and corn kernels and heat through. Remove soup from heat; season to taste with salt. (Can be made 1 day ahead. Refrigerate uncovered until cold, then cover and keep refrigerated. Bring to simmer before continuing.)",
        "Ladle soup into bowls. Top each with some croutons and some of remaining 2 tablespoons parsley. Serve, passing remaining croutons separately."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) butter",
        "3 cups 1/2-inch cubes crustless sourdough bread (about 8 ounces)",
        "1 teaspoon coarsely cracked black pepper",
        "2 tablespoons (1/4 stick) butter",
        "2 cups chopped leeks (white and pale green parts only; about 3 medium)",
        "1/4 cup minced shallots",
        "3 garlic cloves, chopped",
        "6 tablespoons finely chopped fresh Italian parsley",
        "2 tablespoons chopped fresh thyme",
        "1 tablespoon chopped fresh oregano",
        "1 large red bell pepper, cut into 1/4-inch cubes",
        "8 cups low-salt chicken broth",
        "1 1/2 cups frozen baby lima beans (about 8 ounces)",
        "1 14 3/4-ounce can creamed corn",
        "1 1/2 cups frozen white corn kernels (about 8 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Sauté",
        "Thanksgiving",
        "Lunch",
        "Leek",
        "Corn",
        "Lima Bean",
        "Fall",
        "Healthy",
        "Simmer",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Succotash Soup with Black Pepper Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/succotash-soup-with-black-pepper-croutons-108805"
}
