{
    "directions": [
        "Prepare the pastry: combine the flour, baking powder, and salt in a bowl. Stir in 3 beaten eggs, 2 tablespoons vegetable oil, and the cold water, and mix just until combined. Wrap the dough in plastic and refrigerate for 20 minutes.",
        "Heat a large skillet over medium-high heat and stir in the Italian sausage. Cook and stir until the sausage is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Cool.",
        "Divide the pastry into two unequal pieces, about one-third and two-thirds. Roll the small piece out on a lightly floured surface. Trace the bottom of a springform pan to make a 9-inch circle; keep any scraps of dough. Transfer the circle of dough to a plate or baking sheet and refrigerate. Roll out the larger piece of dough and any leftover scraps into a large circle about 1/4-inch thick. Carefully fold the dough in half and transfer it to a 9-inch springform pan. Let the weight of the dough sink down into the sides of the pan; gently press the dough into the bottom edges. Use a sharp knife or kitchen shears to trim the dough to have a 1-inch overhang. Refrigerate while you assemble the filling.",
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Combine the 1 tablespoon vegetable oil, 3 beaten eggs, the ricotta, mozzarella, and Parmesan cheeses, and the chopped parsley in a bowl and mix well.",
        "Layer the filling in the pastry-lined springform pan. Place 4 slices of ham, half the pepperoni, and half of the hard-cooked egg slices in the bottom of the pan. Top with half of the cubed salami and half of the cooked Italian sausage. Spread half of the ricotta cheese mixture on top. Repeat the layers.",
        "Top the filled torta with the chilled round of pastry. Fold the edges over and crimp the crust to seal. Brush the pastry with the melted butter and bake in the preheated oven until the pastry is a deep golden brown, 45 minutes to 1 hour. Let cool at least 15 minutes before slicing."
    ],
    "ingredients": [
        "Pastry:",
        "2 cups unsifted all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "3 eggs, lightly beaten",
        "2 tablespoons vegetable oil",
        "2 tablespoons cold water",
        "Filling:",
        "1/2 pound sweet Italian sausage",
        "1 tablespoon vegetable oil",
        "3 eggs, lightly beaten",
        "1 1/2 pounds ricotta cheese",
        "1/2 pound shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese",
        "1/4 cup chopped fresh parsley",
        "8 thin slices deli ham",
        "1 cup sliced pepperoni",
        "6 hard-cooked eggs, sliced",
        "1 cup salami, cubed",
        "2 tablespoons butter, melted and cooled to lukewarm"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sue's Torta Rustica",
    "url": "http://allrecipes.com/recipe/216881/sues-torta-rustica/"
}
