{
    "directions": [
        "In a small bowl, whisk the 1 tsp sugar into the warm water until dissolved. Whisk in the yeast until dissolved. Set aside to proof. The mixture will get foamy. If your kitchen is warm, the mixture may foam quickly-watch it to make sure it doesn't overflow the bowl.",
        "In a medium bowl, mix together the all-purpose flour, salt, xanthan gum, baking powder, and 1/4 cup/50 g of the sugar.",
        "In the bowl of a stand mixer fitted with the paddle attachment, beat the egg, butter, and yeast mixture on low speed for a few seconds to combine. Add the flour mixture and beat for a few seconds to combine. Increase the speed to high and beat for 3 minutes longer.",
        "Grease a large bowl with oil. Scrape the dough into the oiled bowl and cover with plastic wrap. Let the dough stand in a warm, draft-free place until nearly double in bulk, about 1 hour.",
        "Liberally dust your rolling surface with tapioca flour. Line two cookie sheets with waxed paper. These will be your holding trays for the cut dough. Place the dough on the floured surface and dust with tapioca flour. Gently roll the dough to about 1/8 in/6 mm thick. With a 2 1/4-in/5.75-cm cookie cutter, cut out as many rounds as possible, dipping the cutter into tapioca flour before each cut. With a spatula dipped in tapioca flour, scoop up the rounds and place on the prepared sheets, spacing them at least 1 in/2.5 cm apart. Flour your hands with tapioca flour, gather the remaining dough, and squish it a few times to smooth it out, then repeat the process until all the dough is used. Try to do this in as few batches as you can. It's fine if some of the last cut rounds have some folds. You should aim for 40 rounds (you need an even amount).",
        "Using a pastry brush, brush off as much tapioca flour as you can from the cut rounds. Place 1/4 tsp jam in the center of half of the rounds. With a finger dipped in water, moisten the dough around the jam. Set a plain round on top of each jam-covered round. Press around the edges to seal, then push the edges toward the center so each doughnut is fat and fluffy. You may also want to bring the cookie cutter down around the perimeter of each doughnut to cut off any extra dough sticking out from the circle and to further seal the sides. Let the doughnuts stand in a warm, draft-free place until they are puffy and about double in bulk, about 1 hour.",
        "About 30 minutes before the doughnuts have risen fully, pour 3 to 4 in/7.5 to 10 cm of oil into a deep, heavy-bottomed 2-qt/2-L saucepan. Heat over medium-high heat until the oil reaches 375°F/190°C on a candy thermometer. Have ready one or two platters lined with paper towels.",
        "Using the spatula, carefully lower the doughnuts into the hot oil. Cook only as many doughnuts as will fit comfortably in your pan, allowing some space between them so that they can fry all the way around. As you place the doughnuts in the oil, the oil will start to foam-this means that the doughnuts are cooking. Fry the doughnuts until brown on one side, about 40 seconds, then turn and fry until the doughnuts are brown on the second side, and puffed and golden, about 20 seconds. With tongs, remove the doughnuts from the oil and place on the paper towels to drain. Allow the oil to return to 375°F/190°C, and repeat until all the doughnuts are fried. Be sure to monitor the oil so that the temperature remains constant; you may need to adjust the heat as you fry each batch. You don't want the oil to go above 380°F/193°C, because the doughnuts will burn before they are cooked through.",
        "Set a wire rack over a cookie sheet. Place the remaining 1/2 cup/100 g sugar in a bowl. Gently roll each warm doughnut in the sugar until coated. Set on the rack to cool completely.",
        "Doughnuts made with yeasted dough are best eaten the day they are fried. Only make as many as you plan to eat that day. The dough may be stored in the refrigerator for up to 2 days."
    ],
    "ingredients": [
        "1 tsp granulated sugar, plus 3/4 cup/150 g",
        "3/4 cup plus 2 Tbsp/210 ml warm water (about 110°F/43°C)",
        "1 Tbsp active dry yeast",
        "2 cups/280 g Jeanne's Gluten- Free All-Purpose Flour",
        "1 tsp salt",
        "1 tsp xanthan gum",
        "2 tsp baking powder",
        "1 extra-large egg, at room temperature",
        "1 tablespoon unsalted butter, melted and cooled a bit",
        "Neutral-flavored oil such as rice bran or canola for greasing and frying",
        "Tapioca flour for dusting",
        "1/4 cup/60 ml jam of your choice such as raspberry"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Fry",
        "Hanukkah",
        "Wheat/Gluten-Free",
        "Jam or Jelly",
        "Pastry"
    ],
    "title": "Sufganiyot (Jelly Doughnuts)",
    "url": "http://www.epicurious.com/recipes/food/views/sufganiyot-jelly-doughnuts-51133810"
}
