{
    "directions": [
        "Cook sugar snaps in an 8-quart pot of boiling salted water 2 minutes, then transfer 1 cup sugar snaps to a colander and rinse under cold water to stop cooking. Transfer cooled sugar snaps to a cutting board. Cook sugar snaps remaining in pot until tender, about 2 1/2 minutes more, then transfer with a slotted spoon to a bowl. Measure out and save 1 cup cooking water, reserving remaining water in pot.",
        "Return cooking water in pot to a boil and cook pasta until al dente, then drain in colander. While pasta is cooking, cut 1 cup sugar snaps (on cutting board) crosswise into 1/2-inch pieces. Purée half of sugar snaps from bowl, half of garlic paste, 2 tablespoons oil, 1/4 cup cheese, and 1/4 cup saved cooking water in a blender (use caution when blending hot liquids), then force purée with a rubber spatula through a medium-mesh sieve into a large bowl. Purée another batch in same manner, forcing through sieve into bowl, and add cut sugar snaps.",
        "Toss hot pasta with sugar snap sauce and, if necessary, enough of remaining 1/2 cup saved cooking water to thin sauce to desired consistency, then season pasta with salt and pepper."
    ],
    "ingredients": [
        "1 lb sugar snap peas, trimmed and strings discarded",
        "1 lb penne",
        "1 medium garlic clove, minced and mashed to a paste with 1/2 teaspoon salt",
        "1/4 cup extra-virgin olive oil",
        "1 oz finely grated Parmigiano-Reggiano (1/2 cup) plus additional for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Vegetable",
        "Vegetarian",
        "Quick & Easy",
        "Dinner",
        "Spring",
        "Noodle",
        "Sugar Snap Pea",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sugar Snap Peas and Pasta",
    "url": "http://www.epicurious.com/recipes/food/views/sugar-snap-peas-and-pasta-231793"
}
