{
    "directions": [
        "Preheat  oven to 375 degrees F (200 degrees C).",
        "In a mixing bowl, sift the flour and white sugar together, and stir in 1 egg and the vanilla extract until well combined. Using a pastry cutter, cut the cold butter into the mixture until it resembles coarse cornmeal. Shape the dough into a ball, wrap it in plastic wrap, and refrigerate for 20 minutes.",
        "Divide the dough in half, and roll into two 11-inch-long logs. Wrap one of the logs in waxed paper and then plastic wrap, and refrigerate overnight. Place 3 tablespoons of coarse sugar crystals on a flat plate. Brush the second log with beaten egg, and roll it in the sugar crystals, coating it thickly. Carefully wrap the sugared log in plastic wrap, and refrigerate overnight. (See Cook's Note.)",
        "Preheat the oven to 400 degrees F (200 degrees C) and line baking sheets with parchment paper.",
        "Cut the unsugared log of dough into round slices about 1/8-inch thick, and place the rounds onto the prepared baking sheets, about 1/2-inch apart. Top each round with a pecan half. Cut the sugared log of dough into 1/8-inch thick slices, and place them onto prepared baking sheets. Sprinkle each sugared cookie with more coarse sugar crystals, if desired.",
        "Place one baking sheet of cookies at a time into the preheated oven, and bake until the edges barely turn golden, 4 to 5 minutes. Remove the cookies to wire racks to cool."
    ],
    "ingredients": [
        "4 cups all-purpose flour",
        "1 1/2 cups white sugar",
        "1 egg",
        "2 teaspoons vanilla extract",
        "1 1/2 cups cold unsalted butter, cut into chunks",
        "1 egg, beaten",
        "3 tablespoons coarse sugar crystals",
        "88 pecan halves, toasted",
        "1 tablespoon coarse sugar crystals for sprinkling (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sugared Danish Butter Cookies with Pecan Halves",
    "url": "http://allrecipes.com/recipe/212867/sugared-danish-butter-cookies-with-pe/"
}
