{
    "directions": [
        "Heat milk in a small saucepan until just starting to bubble.  Remove from  heat; stir in butter, honey and salt.  Set aside and let cool.  Set aside 2 teaspoons sugar.  Stir remaining sugar into milk mixture.  Let cool to room temp.",
        "In a large bowl, combine yeast and lukewarm water.  Set aside 5 minutes for yeast to soften.   Beat cooled milk mixture, egg, 4 cups flour, and nutmeg into yeast mixture.",
        "Knead dough in a bowl, adding up to 1/2 cup more flour if necessary, until a smooth, soft dough forms.  Divide dough into 8 balls 3 inches in diameter.  Place balls 4 inches apart on lightly greased cookie sheets; pat into 4 inch rounds.   Brush tops of rounds with water and sprinkle with reserved sugar.  Set aside, lightly covered with kitchen towels, about 1 hour, or until doubled in size.",
        "Preheat oven to 350 degrees F (180 degrees C).  Bake raised rounds 30 minutes, or until golden brown.  Remove from oven; leave oven on.  Let cool on sheets 10-15 minutes, or until cool enough to handle.",
        "With a serrated knife, cut each round into six 1/2-inch slices.  Place slices, cut sides down, on cookie sheets and return to oven for 5 minutes.  Turn slices and bake 5 to 7 minutes longer, or until golden on both sides.  Turn off heat and leave in unopened oven until cool, about 45 minutes.  Store in tightly covered container."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=250&h=131&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F155085.jpg",
    "ingredients": [
        "1 cup milk",
        "4 tablespoons butter, cut into pieces",
        "¼ cup honey",
        "½ teaspoon salt",
        "⅔ cup white sugar",
        "1 (.25 ounce) package active dry yeast",
        "¼ cup warm water",
        "1  egg",
        "4 cups all-purpose flour",
        "½ teaspoon freshly grated nutmeg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sugar Zwieback",
    "url": "http://allrecipes.com/recipe/10140/sugar-zwieback/"
}