{
    "directions": [
        "Sift the cake flour, baking powder and salt onto a piece of parchment paper or into a medium bowl; set aside. Beat the butter and sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 5 minutes. Add the egg and vanilla and beat until incorporated. Reduce the mixer speed to low and beat in the flour mixture in 2 batches until just incorporated. Divide between 2 pieces of plastic wrap; shape into disks. Wrap and refrigerate until firm, at least 1 hour. (The dough can be frozen for up to 1 month; thaw overnight in the refrigerator before rolling.)",
        "Line 2 baking sheets with parchment paper. Working with 1 disk at a time, roll out the dough on a floured surface, dusting with flour as needed, until about 1/8 inch thick. Cut out shapes with 2-to-4-inch cookie cutters; arrange 2 inches apart on the prepared baking sheets. (If the dough becomes too soft as you work, return to the refrigerator until firm.) Gather the scraps and refrigerate until firm; reroll once to cut out more cookies. Chill the cutouts 30 minutes.",
        "Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Bake, switching the pans halfway through, until the cookies are slightly puffed and just golden, 13 to 15 minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool completely before icing.",
        "Basic Royal Icing:",
        "Whisk one 1-pound box confectioners' sugar and 2 tablespoons meringue powder in a large bowl. Add 5 tablespoons water and beat with a mixer on medium-high speed until soft glossy peaks form, adding up to 1 more tablespoon water if necessary. Cover the bowl with a damp paper towel and plastic wrap until ready to use to prevent the icing from drying out. (Makes about 2 1/4 cups.)",
        "How to Ice Sugar Cookies:",
        "\"Flooding\" is a technique used to cover a cookie completely with royal icing. Here's how to do it:",
        "Transfer about 1/2 cup of the royal icing to a resealable plastic bag and snip a small corner. Use this icing to pipe a thin border around the edge of each cookie. Let set for a few minutes. Thin the remaining icing with a few drops of water until it's the consistency of syrup.",
        "Place half of the thinned icing in a resealable plastic bag and tint the rest with red and/or green gel food coloring. Transfer the colored icing to bags. Snip a corner of the white icing bag and pipe a generous amount inside the border of each cookie.",
        "Using a small offset spatula or the back of a spoon, spread the icing to cover the cookie. Decorate with the colored icing while the white icing is still wet. Let the cookies set at room temperature, at least 1 hour.",
        "Photograph by Andrew Purcell"
    ],
    "ingredients": [
        "2 1/2 cups cake flour (not self-rising), plus more for dusting",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "2 sticks unsalted butter, at room temperature",
        "3/4 cup sugar",
        "1 large egg",
        "1 teaspoon pure vanilla extract",
        "Royal icing, for decorating (see right)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cookie",
        "Sugar Cookie",
        "Dessert"
    ],
    "title": "Sugar Cookies with Royal Icing",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/sugar-cookies-with-royal-icing"
}
