{
    "directions": [
        "Combine first 7 ingredients in heavy large saucepan. Scrape in seeds from vanilla bean; add bean. Bring to boil over medium-high heat, stirring to dissolve sugar. Reduce heat to medium-low; simmer 5 minutes. Add apples; cover and simmer until tender, about 12 minutes. Using slotted spoon, transfer apples to bowl. Boil syrup in saucepan until reduced to 1 1/4 cups, about 10 minutes. Add syrup to bowl with apples. (Can be prepared 1 day ahead. Cover and chill. Bring to room temperature before using.)",
        "Whisk eggs, yolks, milk, 2/3 cup sugar, vanilla, and salt in 15x10x2-inch baking dish. Place bread in single layer in egg mixture; spoon egg mixture over bread and let stand until soaked through, about 3 minutes.",
        "Melt 3 tablespoons butter in each of 2 large nonstick skillets over medium heat. Sprinkle each skillet with 2 tablespoons sugar. Add 3 bread slices to each skillet; cook until deep golden on bottom, about 3 minutes. Sprinkle top of bread slices with sugar, using 2 tablespoons for each skillet; turn slices over and cook until deep golden on bottom, about 3 minutes. Transfer French toast to plates. Place 1 apple half alongside each serving. Drizzle French toast with some of syrup from apples and serve.",
        "*Brown star-shaped seedpods sold at Asian markets and specialty foods stores and in the spice section of some supermarkets."
    ],
    "ingredients": [
        "3 cups water",
        "1/2 cup honey",
        "1/3 cup sugar",
        "4 3x1/2-inch strips orange peel",
        "4 3x1/2-inch strips lemon peel",
        "2 whole star anise*",
        "1 cinnamon stick",
        "1/2 vanilla bean, split lengthwise",
        "3 medium apples (such as Braeburn or Golden Delicious), peeled, halved, cored",
        "6 large eggs",
        "3 large egg yolks",
        "31/2 cups whole milk",
        "2/3 cup plus 8 tablespoons sugar",
        "1 tablespoon vanilla extract",
        "1/2 teaspoon salt",
        "6 4x4x1-inch slices egg bread",
        "6 tablespoons (3/4 stick) unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Breakfast",
        "Brunch",
        "Poach",
        "Quick & Easy",
        "Apple",
        "Vanilla",
        "Winter",
        "Pan-Fry",
        "Honey",
        "Simmer"
    ],
    "title": "Sugar-Crusted French Toast with Honeyed Apples",
    "url": "http://www.epicurious.com/recipes/food/views/sugar-crusted-french-toast-with-honeyed-apples-109158"
}
