{
    "directions": [
        "Place nuts and 1 1/2 cups flour in a food processor. Process until nuts are finely ground. Add remaining 3 cups flour, salt, baking powder, and 1 1/2 teaspoons nutmeg; process to blend.",
        "Using an electric mixer, beat the sugar and butter in a large bowl until creamy, about 2 minutes. Add 6 tablespoons cream and 3 egg yolks; beat to blend well, about 1 minute. Add half of flour mixture; beat just to blend. Add the remaining flour mixture and beat until large, moist clumps form. Divide dough equally into thirds. Form 1 portion into a ball; flatten into a disk. Wrap in plastic and chill while preparing tarts.",
        "With lightly floured hands, press the 2 remaining dough portions evenly onto bottom and up sides of the tart pans. DO AHEAD: Can be made 1 day ahead. Cover; keep chilled.",
        "Preheat oven to 375°F. Mix tea and 1/4 cup boiling water in a small bowl; set aside to steep for 15 minutes. Stir apricot jam and strained tea in a medium bowl to blend. Stir plum jam and orange zest in another medium bowl to blend.",
        "Using a lightly floured rolling pin, roll reserved dough disk out on a lightly floured surface to 1/8\" thickness. Using decorative cookie cutter, cut out shapes. Gather dough into a ball, roll out, and repeat until enough cutouts are made to arrange on tops of tarts. Freeze any remaining dough for future use.",
        "Spread apricot jam mixture in an even layer over crust in 1 tart pan. Spread plum jam mixture in an even layer over crust in other pan. Place dough cutouts decoratively over jam. Whisk remaining 1 tablespoon cream and remaining egg yolk in a small bowl. Brush cutouts with cream mixture. Mix remaining 1/2 teaspoon nutmeg with raw sugar; sprinkle over tarts.",
        "Bake tarts, rotating pans halfway through and covering crust edges if browning too quickly, until top is golden brown and jam is bubbly, 45-50 minutes. Transfer to wire racks and let cool (jam will set as tarts cool). DO AHEAD: Can be made 1 day ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups hazelnuts with skins",
        "4 1/2 cups all-purpose flour, divided, plus more for surface",
        "2 1/4 teaspoons kosher salt",
        "1 1/2 teaspoons baking powder",
        "2 teaspoons freshly grated nutmeg, divided",
        "1 1/2 cups sugar",
        "1 1/2 cups (3 sticks) unsalted butter, room temperature",
        "7 tablespoons heavy cream, divided",
        "4 large egg yolks, divided",
        "1 teaspoon (or 1 bag) Earl Grey tea",
        "1 1/2 cups apricot jam",
        "1 1/2 cups plum jam",
        "2 teaspoons finely grated orange zest",
        "1/4 cup raw sugar",
        "Special equipment: Two tart pans with removable bottoms, either 11\"-diameter or 11x8\" rectangle; decorative cookie cutters in 2 sizes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tea",
        "Mixer",
        "Dessert",
        "Bake",
        "Christmas",
        "Shower",
        "Christmas Eve",
        "Jam or Jelly",
        "Butter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sugarplum-Orange and Apricot-Earl Grey Jam Tarts",
    "url": "http://www.epicurious.com/recipes/food/views/sugarplum-orange-and-apricot-earl-grey-jam-tarts-368968"
}
