{
    "directions": [
        "Rinse the turkey, inside and out, and set aside. Place the plastic bag into the cooler, and open out the bag.",
        "Pour the water into the plastic bag, and add the salt; smush the bag around several times with your fingers to dissolve the salt. Squeeze juice from the orange, lemon, and clementine chunks into the salty water, and drop the chunks into the bag. Mix in the rosemary and thyme, and place the turkey into the brine with the breast side down. Close the bag, squeeze out excess air, and tightly seal; close lid of the cooler, and place in a refrigerator for 24 hours.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Remove turkey from the brine, and retain 4 or 5 chunks each of navel orange and lemon and the sprigs of rosemary and thyme from the brine. Discard remainder of used brine. Rinse the entire turkey, inside and out, and place into a roasting pan.",
        "Place the pieces of fruit and herb sprigs into the cavity of the turkey. Loosen the skin over the breast with your fingers, and spread butter over the breast underneath the skin. Rub the entire turkey with olive oil, and sprinkle with poultry seasoning and black pepper. If desired, cover the breast of the turkey with foil.",
        "Roast in the preheated oven until the turkey is golden brown and the juices run clear, 3 1/2 to 4 hours. Remove foil for last 30 to 45 minutes of baking. An instant-read thermometer inserted into the thickest part of a thigh should read at least 165 degrees F (75 degrees C)."
    ],
    "ingredients": [
        "1 (10 pound) whole turkey, neck and giblets removed",
        "1 large, sturdy food-grade plastic bag",
        "1 large cooler",
        "2 gallons water",
        "2 cups kosher salt",
        "2 unpeeled navel oranges, cut into chunks",
        "2 unpeeled lemons, cut into chunks",
        "2 unpeeled clementines (Mandarin oranges), cut into chunks",
        "1 bunch fresh rosemary sprigs",
        "1 bunch fresh thyme",
        "2 tablespoons butter, softened",
        "1 tablespoon olive oil (optional)",
        "1 teaspoon poultry seasoning, or to taste (optional)",
        "1 teaspoon ground black pepper, or to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sugar Free Citrus Turkey Brine",
    "url": "http://allrecipes.com/recipe/219476/sugar-free-citrus-turkey-brine/"
}
