{
    "directions": [
        "Combine garlic and oil in a small saucepan and cook over low heat, shaking pan occasionally, until garlic is golden and very tender, 15–20 minutes. (Reduce heat if garlic is browning too quickly.) Using a slotted spoon, transfer to a cutting board and mash to a paste.",
        "Add anchovies and walnuts to garlic oil and cook over medium heat, stirring occasionally, until anchovies disintegrate and walnuts are golden brown, 5–8 minutes. Remove from heat, stir in garlic paste, and season with salt and pepper. Transfer bagna cauda to a shallow dish.",
        "Squeeze 3 lemon halves into a bowl of cold water. Working one at a time, remove several layers of tough outer leaves from artichokes to reveal tender light-green leaves. Trim stem and peel with a vegetable peeler. Cut off top third from artichokes, then halve lengthwise and transfer to lemon water.",
        "Cook artichokes in a large pot of boiling salted water until a knife slides easily through outer leaves, 5–8 minutes. Using a slotted spoon, transfer to a bowl of ice water and let sit until cold, about 5 minutes. Drain and pat dry.",
        "Meanwhile, return water in pot to a boil and cook eggs 8 minutes. Drain and transfer eggs to a fresh bowl of ice water; let sit until cold, about 5 minutes. Drain, peel, then cut in half.",
        "Arrange eggs and all vegetables on a platter. Season with salt and pepper and squeeze remaining lemon half over. Serve with bagna cauda for dipping."
    ],
    "ingredients": [
        "1 head of garlic, cloves peeled",
        "3/4 cup olive oil",
        "10 oil-packed anchovy fillets",
        "1/2 cup walnuts, finely chopped",
        "Kosher salt, freshly ground pepper",
        "2 lemons, halved, divided",
        "8 baby artichokes",
        "6 large eggs, room temperature",
        "2 bunches small carrots (any color), trimmed, halved if large",
        "1 Treviso radicchio, leaves separated",
        "1 small fennel bulb, quartered",
        "2 Persian cucumbers, cut lengthwise into quarters",
        "2 celery stalks, halved",
        "6 red radishes",
        "1 watermelon radish, peeled, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Walnut",
        "Artichoke",
        "Celery",
        "Fennel",
        "Carrot",
        "Radish",
        "Anchovy"
    ],
    "title": "Summer Crudités with Bagna Cauda",
    "url": "http://www.epicurious.com/recipes/food/views/summer-crudites-with-bagna-cauda-56389893"
}
