{
    "directions": [
        "Combine 2 cups herbs, 1/4 cup scallions, ginger, and garlic in a mini-processor. Pulse to chop ingredients. Add 4 tablespoons oil, vinegar, and 1/4 cup water and process until a coarse purée forms. Transfer herb sauce to a bowl and stir in sesame seeds. Season to taste with salt and pepper. DO AHEAD: Herb sauce can be made 2 hours ahead. Cover and chill.",
        "Heat 1 tablespoon oil in large heavy skillet over medium-high heat until oil just begins to smoke. Add remaining 1/4 cup scallions and wheat berries. Stir-fry until wheat berries are golden brown and slightly crunchy, about 3 minutes. Season with salt and pepper. Divide wheat berries among bowls.",
        "Return skillet to medium-high heat and add remaining 2 tablespoons oil. Add vegetables, season with salt and pepper, and stir-fry until brightly colored and crisp-tender, about 4 minutes. Add remaining 1 cup herbs and toss to combine. Divide vegetables over wheat berries. Drizzle with herb sauce."
    ],
    "ingredients": [
        "3 cups mixed tender herbs (such as basil, Thai basil, mint, cilantro, tarragon, and celery leaves), divided",
        "1/2 cup thinly sliced scallions, divided",
        "1 1/2\" piece peeled ginger, sliced",
        "1 garlic clove",
        "7 tablespoons vegetable oil, divided",
        "2 tablespoons unseasoned rice vinegar",
        "2 tablespoons sesame seeds",
        "Kosher salt and freshly ground black pepper",
        "2 cups cooked, cooled wheat berries, farro, or brown rice",
        "4 cups chopped mixed summer vegetables (such as bell peppers, eggplant, chiles, zucchini, summer squash, carrots, celery, radishes, and cherry tomatoes)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Tomato",
        "Stir-Fry",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Low Sodium",
        "Dinner",
        "Mint",
        "Basil",
        "Eggplant",
        "Bell Pepper",
        "Squash",
        "Zucchini",
        "Summer",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Tarragon",
        "Cilantro",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Summer Vegetable Stir-Fry",
    "url": "http://www.epicurious.com/recipes/food/views/summer-vegetable-stir-fry-51108260"
}
