{
    "directions": [
        "In a medium bowl, combine cream cheese, 1 clove minced garlic, basil, and dill. Cover and set aside.",
        "Heat the olive oil in a medium skillet over medium heat and cook 1 clove minced garlic and onion for 4 to 6 minutes, or until translucent. Remove from heat and allow to cool.",
        "Preheat an outdoor grill for high heat and lightly oil grate.",
        "While the grill is heating, gently mix together the cooked garlic and onion, ground beef, pork sausage, feta cheese, red wine, egg, salt, and pepper in a large bowl. Do not over work the meat mixture. Divide into 8 equal parts and form into patties.",
        "Grill patties on preheated grill for 5 to 10 minutes per side, until well done. Toast the split buns on the grill for 1 to 2 minutes. Assemble the burgers by spreading 1 1/2 tablespoon of the cheese and herb spread to both the top and bottom of each roll. Place patties on the bottom half of the rolls and stack a slice of tomato, sliced red onion, and a leaf of lettuce on each burger. Add the roll tops and serve."
    ],
    "ingredients": [
        "1 (8 ounce) package cream cheese, softened",
        "1 clove garlic, minced",
        "2 tablespoons chopped fresh basil",
        "1 tablespoon chopped fresh dill",
        "2 tablespoons extra virgin olive oil",
        "1 clove garlic, minced",
        "1 red onion, minced",
        "1 3/4 pounds ground beef",
        "1/4 pound ground pork sausage",
        "1 1/2 cups crumbled feta",
        "1/4 cup red wine",
        "1 egg",
        "1 teaspoon salt",
        "1 teaspoon fresh-ground black pepper",
        "1 large heirloom tomato, sliced",
        "1 medium red onion, sliced",
        "8 leaves green leaf lettuce leaves",
        "8 Kaiser rolls, split"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Summer Feta Burger with Gourmet Cheese Spread",
    "url": "http://allrecipes.com/recipe/141912/summer-feta-burger-with-gourmet-chees/"
}
