{
    "directions": [
        "In a saucepan combine the wine, the sugar, the lemon juice, and 1/2 cup water, bring the mixture to a boil, stirring until the sugar is dissolved, and add 2 of the peaches, peeled, halved, and pitted, cut sides down. Simmer the peaches for 10 to 15 minutes, or until they are very tender, and transfer them with a slotted spoon to a blender. Add 1 cup of the cooking liquid and blend the mixture until it is smooth. In a small saucepan sprinkle the gelatin over 1/3 cup cold water, let it soften for 5 minutes, and heat the mixture over low heat, stirring, until the gelatin is dissolved. With the motor running add the gelatin mixture in a stream to the peach mixture until it is combined well. (There will be about 2-1/2 cups peach purée.)",
        "Line a 5- to 6-cup terrine or loaf pan with plastic wrap and pour into it about 1/4 cup of the peach purée, or enough to just cover the bottom. Arrange half the strawberries, cut sides down, in one layer on the peach purée and pour enough of the peach purée over the strawberry layer to just cover it. Peel, halve, and pit the remaining 2 peaches, slice them thin, and in a bowl toss them with 1/4 cup of the peach purée. Arrange half the peach slices, overlapping them slightly, over the strawberry layer and pour enough of the remaining peach purée over the peach layer to just cover it.",
        "In a small bowl toss the raspberries and the blueberries with 1/4 cup of the peach purée and arrange the berries in one layer over the peaches. Pour enough of the remaining peach purée into the terrine to just cover the berries, in the bowl toss the grapes with about 2 tablespoons of the remaining purée, and arrange them in one layer over the berries. Pour enough of the remaining purée into the terrine to just cover the grape layer, arrange the remaining peaches in one layer, overlapping them slightly, over the grapes, and pour enough of the remaining purée over the peaches to just cover them. Arrange the remaining strawberries, cut sides up, in one layer over the peaches and cover them with remaining purée. Chill the terrine for 1 hour, or until it is just set, cover it with plastic wrap, and chill it overnight.",
        "Remove the plastic wrap from the top of the terrine, invert the terrine onto a serving plate, and peel off the plastic wrap carefully. Cut the terrine into 3/4-inch slices with a serrated knife and serve it with the sauce and the mint sprigs.",
        "In a saucepan combine the sugar, the lemon juice, and 1/4 cup water and bring the mixture to a boil, stirring until the sugar is dissolved. In a blender purée the peaches, peeled, pitted, and chopped, and raspberries with the sugar syrup until the mixture is smooth and force the mixture through a fine sieve set over a bowl, discarding the solids. Chill the sauce, covered, for a least 1 hour or overnight. Makes 2-1/4 cups."
    ],
    "ingredients": [
        "1 cup dry white wine",
        "1/2 cup sugar",
        "3 tablespoons fresh lemon juice",
        "4 large peaches (about 2 pounds)",
        "2 envelopes (about 2 tablespoons) unflavored gelatin",
        "16 to 18 small strawberries, hulled and halved lengthwise",
        "1/2 cup raspberries",
        "1/2 cup blueberries",
        "1/2 cup seedless green grapes, halved lengthwise",
        "2 1/4 cups raspberry peach sauce",
        "1/4 cup sugar",
        "3 tablespoons fresh lemon juice",
        "2 large peaches (about 1 pound)",
        "1-1/2 cups raspberries",
        "mint sprigs for garnish if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Berry",
        "Fruit",
        "Dessert",
        "Low Sodium",
        "Peach",
        "White Wine",
        "Summer",
        "Chill",
        "Grape",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Summer Fruit Terrine",
    "url": "http://www.epicurious.com/recipes/food/views/summer-fruit-terrine-12344"
}
