{
    "directions": [
        "Combine berries in a bowl. Add sugar, mint and lemon juice; toss well and chill, tossing occasionally, 4 hours or overnight. For lemon cream: Combine sour cream, sugar and lemon zest in a bowl; mix well. Chill at least 1 hour.",
        "Heat oven to 400°. Line a baking sheet with parchment paper or coat with cooking spray. Whisk flour, sugar, baking powder, baking soda, salt and nutmeg in a bowl until well blended. Using a pastry blender or 2 knives, cut butter pieces into flour mixture until it resembles coarse crumbs. With a rubber spatula, stir in 1 cup plus 1 tbsp buttermilk until just moistened and dough begins to form (it will be sticky at this point). With lightly floured hands, gently knead dough 3 or 4 times until it holds together. On a lightly floured surface, gently roll dough with a rolling pin into an 8 1/2-inch circle about 1/2 inch thick. With a floured 2 1/2-inch biscuit cutter, cut out 8 circles from dough and transfer to baking sheet. Discard dough scraps. Brush top of each shortcake with remaining 1 tbsp buttermilk. Bake until shortcakes rise and turn lightly golden, 16 to 18 minutes.",
        "Cut each shortcake in half crosswise. Place the bottom on a plate and top with 3/4 cup berry mixture and 2 tbsp lemon cream. Cover with top half of shortcake. Serve immediately."
    ],
    "ingredients": [
        "1 lb fresh strawberries, cored and halved",
        "2 containers (5.6 oz each) fresh blackberries",
        "2 containers (4.4 oz each) fresh blueberries",
        "1 container (6 oz) fresh raspberries",
        "1/3 cup sugar",
        "2 tbsp chopped fresh mint",
        "2 tbsp fresh lemon juice",
        "1 cup fat-free sour cream",
        "3 tbsp sugar",
        "2 tsp grated lemon zest",
        "2 1/3 cups all-purpose flour",
        "2 tbsp sugar",
        "1 tsp baking powder",
        "1/2 tsp baking soda",
        "1/2 tsp salt",
        "1/8 tsp ground nutmeg",
        "5 oz unsalted butter,cut into very small pieces and chilled",
        "1 cup plus 2 tbsp lowfat buttermilk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Berry",
        "Dessert",
        "Bake",
        "Low Fat",
        "Backyard BBQ",
        "Blackberry",
        "Blueberry",
        "Raspberry",
        "Lemon",
        "Summer",
        "Healthy",
        "Pastry",
        "Self",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Summer Berry Shortcakes with Tangy Lemon Cream",
    "url": "http://www.epicurious.com/recipes/food/views/summer-berry-shortcakes-with-tangy-lemon-cream-232347"
}
