{
    "directions": [
        "Melt butter in a 6- to 8-quart wide heavy pot over moderate heat, then cook onion with salt, stirring, until softened, about 8 minutes. Add squash, carrots, potato, and stock and bring to a boil. Reduce heat, then simmer, partially covered, until vegetables are very tender, about 20 minutes. Remove from heat and cool soup, uncovered, 10 minutes.",
        "Working in batches, purée; soup in a blender until smooth (use caution when blending hot liquids) and transfer to a bowl. Return puré to cleaned pot and thin with water if desired; simmer 3 minutes. Season with salt.",
        "Pulse mint, parsley, and scallion in a food processor until finely chopped. With motor running, add oil in a stream, then add water and salt, blending until incorporated.",
        "Swirl 1 tablespoon pistou into each bowl of soup."
    ],
    "ingredients": [
        "3/4 stick (6 tablespoons) unsalted butter, cut into pieces",
        "1 medium onion, halved lengthwise and thinly sliced crosswise",
        "1/2 teaspoon salt",
        "2 lb yellow summer squash, halved and thinly sliced",
        "2 carrots, thinly sliced",
        "1 yellow-fleshed potato (1/2 lb), peeled, halved,",
        "4 cups chicken stock or reduced-sodium chicken broth",
        "3/4 cup loosely packed fresh mint leaves",
        "1/2 cup loosely packed fresh flat-leaf parsley sprigs",
        "1 large scallion, chopped (1/2 cup)",
        "1/4 cup extra-virgin olive oil",
        "2 tablespoons water",
        "1/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Food Processor",
        "Herb",
        "Onion",
        "Potato",
        "Vegetable",
        "Mint",
        "Squash",
        "Summer",
        "Parsley",
        "Gourmet"
    ],
    "title": "Summer-Squash Soup with Parsley Mint Pistou",
    "url": "http://www.epicurious.com/recipes/food/views/summer-squash-soup-with-parsley-mint-pistou-235736"
}
