{
    "directions": [
        "In a bowl with an electric mixer cream the butter with the sugar, the salt, and the vanilla, add the flour, and blend the mixture until it forms crumbs that become a dough when pressed together. Turn the crumbs into a buttered 10-inch tart pan with a removable fluted rim, press them firmly onto the bottom and up the side of the pan, and chill the shell for 30 minutes. Prick the shell all over with a form, line it with foil, and fill the foil with the rice. Bake the shell in the lower third of a preheated 375°F. oven for 15 minutes, remove the rice and the foil carefully, and bake the shell for 10 minutes more, or until it is golden. Let the shell cool in the pan on a rack for 5 minutes, remove the side of the pan, and let the shell cool completely. (The shell will be very crisp and cookie-like.)",
        "In a small saucepan bring the milk to a boil with the mint, remove the pan from the heat, and let the mixture stand, covered, for 5 minutes. Strain the milk through a fine sieve into a bowl, pressing hard on the mint. In the pan, cleaned, whisk together the egg yolks, the sugar, the cornstarch, and the vanilla, whisk in the milk, and bring the mixture to a boil over moderate heat, whisking constantly. Simmer the pastry cream, whisking, for 3 minutes (it will be very thick), transfer it to a bowl, and chill it, its surface covered with plastic wrap, for 4 hours, or until it is firm. The pastry cream may be made 1 day in advance and kept covered and chilled. In a chilled bowl with an electric mixer beat the heavy cream until it holds stiff peaks. Whisk the pastry cream until it is smooth, whisk in half the whipped cream, and fold in the remaining whipped cream gently but thoroughly.",
        "Arrange the shell on a large plate and fill it with the mint cream. Stand the strawberries, hulled ends down, in the mint cream, scatter the blueberries and the raspberries over and between the strawberries, and chill the tart for 1 hour. The tart may be made 1 day in advance and kept covered loosely and chilled."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter at room temperature",
        "1/3 cup sugar",
        "1/4 teaspoon salt",
        "1/2 teaspoon vanilla extract",
        "1 1/4 cups all-purpose flour",
        "raw rice for weighting the shell",
        "1 cup milk",
        "1/3 cup coarsely chopped fresh mint leaves",
        "3 large egg yolks",
        "1/2 cup sugar",
        "3 tablespoons cornstarch",
        "1 teaspoon vanilla extract",
        "1/2 cup well-chilled heavy cream",
        "1 quart strawberries, hulled",
        "2 cups blueberries",
        "2 cups raspberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Blueberry",
        "Raspberry",
        "Strawberry",
        "Mint",
        "Summer",
        "Chill",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Summer Berry Mint Cream Tart",
    "url": "http://www.epicurious.com/recipes/food/views/summer-berry-mint-cream-tart-12306"
}
