{
    "directions": [
        "Hard boil the eggs by placing them into a saucepan in a single layer. Fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Once the water is boiling, remove from the heat and let the eggs stand in the hot water for 15 minutes. Pour out the hot water, then cool the eggs under cold running water in the sink. Peel once cold.",
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the bow tie pasta and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 12 minutes. Drain well in a colander set in the sink, and rinse with cold water.",
        "Simmer the chicken tenders in about 1/4 cup of water in a saucepan over medium-low heat, until no longer pink inside. Remove the tenders from the water, and set aside to cool.",
        "Cut the tenders into bite-size pieces. Slice the eggs. Combine the cooked pasta, chicken, eggs, cucumber, radishes, carrots, green onions, and red onion in a salad bowl, and pour the Italian dressing over. Toss lightly to mix, and refrigerate the salad for at least 1 hour, or until cold.",
        "Place about 3/4 cup of sliced romaine hearts on each plate, then top with about 1 cup of pasta-chicken salad to serve."
    ],
    "ingredients": [
        "6 eggs",
        "1 (16 ounce) package farfalle (bow tie) pasta",
        "6 chicken tenders",
        "1 cucumber, sliced",
        "1 bunch radishes, trimmed and sliced",
        "2 carrots, peeled and sliced",
        "3 green onions, thinly sliced",
        "1/2 red onion, chopped",
        "1/2 (16 ounce) bottle Italian-style salad dressing",
        "4 romaine lettuce hearts, thinly sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Summertime Chicken and Pasta Salad",
    "url": "http://allrecipes.com/recipe/86216/summertime-chicken-and-pasta-salad/"
}
