{
    "directions": [
        "Remove corn kernels from cob and scrape cob with dull edge of knife to remove as much of the corn as possible. Place corn in blender with chicken broth. Blend on high until completely smooth, about 2 minutes. For a smoother mixture, strain through a fine strainer (straining is optional).",
        "Heat olive oil in a large skillet over medium heat. Add pancetta; cook until pancetta is cooked but not crisp, about 3 minutes. Remove some of the grease from the pan. Add zucchini and red pepper to pan. Saute just until zucchini begins to soften, about 3 minutes. Remove from heat. Season with salt, black pepper, and cayenne pepper.",
        "Bring a large pot of lightly salted water to a boil; add cavatelli and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes or 1 minute less than recommended on the package. Drain well.",
        "Transfer the drained pasta to the skillet with the vegetables. Pour in corn cream. Cook and stir on medium-high heat until sauce begins to thicken, about 3 minutes. Stir in cherry tomatoes, basil, parsley, and grated cheese."
    ],
    "ingredients": [
        "Corn \"Cream\":",
        "2 ears fresh white corn, or other sweet corn",
        "2 cups chicken broth or water",
        "Pasta:",
        "1 tablespoon olive oil",
        "4 ounces diced bacon or pancetta",
        "1/2 cup diced sweet red pepper",
        "1 1/2 cups diced zucchini",
        "salt and pepper to taste",
        "1 pinch cayenne pepper",
        "2 cups cavatelli pasta",
        "1 1/2 cups corn \"cream,\" or as needed",
        "1 cup halved sweet cherry tomatoes",
        "1 tablespoon chopped Italian parsley",
        "1 tablespoon finely sliced fresh basil leaves",
        "1 tablespoon grated Parmigiano-Reggiano cheese, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Summer Vegetable Cavatelli with Fresh Corn \"Cream\"",
    "url": "http://allrecipes.com/recipe/244686/summer-vegetable-cavatelli-with-fresh/"
}
