{
    "directions": [
        "Preheat an oven to 400 degrees F (200 degrees C). Grease a baking sheet.",
        "Combine mango, blueberries, and strawberries in a large bowl.  Drizzle with lime juice and honey; mix well.  Cover; reserve in refrigerator.",
        "Sprinkle the gelatin over the water in a large heatproof glass or metal bowl.  Let soak for 5 minutes. Place bowl over a pan of simmering water, stirring often until dissolved. Transfer to a small bowl; refrigerate until cool, about 10 minutes.  Beat cream in the large bowl with an electric mixer.  When cream begins to thicken, sprinkle in confectioners' sugar and coconut extract. Mix in cooled gelatin all at once. Whip until soft peaks form. Cover and refrigerate.",
        "Whisk flour, baking powder, white sugar, lime zest, poppy seeds, and salt in a large bowl.  Cut in the shortening with a knife or pastry blender until the mixture resembles coarse crumbs. Beat the egg and buttermilk in a small bowl, lightly stir into flour mixture just until moistened. Turn out onto a floured work surface; knead 3 to 4 times, or until dough just comes together. Roll to 1/2 inch thickness; cut with a 3 inch round biscuit cutter. Place on prepared baking sheet.",
        "Bake shortcakes in preheated oven until golden brown, about 15 to 18 minutes. Allow to cool slightly; split each cake in half horizontally.",
        "To assemble, arrange fruit on the bottom half of each cake. Spoon or pipe cream evenly over fruit. Top each with remaining biscuit halves."
    ],
    "ingredients": [
        "Fruit:",
        "2 ripe mangoes, cut into 1/2-inch cubes",
        "3/4 cup fresh blueberries",
        "1 cup sliced fresh strawberries",
        "1 1/2 teaspoons lime juice",
        "1 tablespoon honey",
        "Cream:",
        "1/2 teaspoon unflavored gelatin",
        "1 tablespoon water",
        "1 cup heavy cream",
        "2 tablespoons confectioners' sugar",
        "1/2 teaspoon coconut extract (optional)",
        "Shortcakes:",
        "2 1/2 cups all-purpose flour",
        "3 1/2 teaspoons baking powder",
        "1/4 cup white sugar",
        "1 tablespoon grated lime zest",
        "1 tablespoon poppy seeds",
        "1 1/2 teaspoons salt",
        "1/2 cup vegetable shortening",
        "1 egg",
        "1 cup buttermilk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Summery Lime-Mango Shortcakes",
    "url": "http://allrecipes.com/recipe/202344/summery-lime-mango-shortcakes/"
}
