{
    "directions": [
        "Have ready large bowl ice water. Bring medium pot salted water to boil. Gently add 8 eggs, cover, and return to boil. Lower heat to simmer and cook 6 minutes. Using slotted spoon, immediately transfer eggs to ice water to stop cooking. Let stand until cold, about 5 minutes, then carefully peel and set aside.",
        "In medium bowl, whisk together flour, 1/2 teaspoon salt, and 1/4 teaspoon pepper. In second medium bowl, lightly beat together 2 tablespoons water and remaining 2 eggs. In third medium bowl, whisk together panko, ground almonds, Parmesan, remaining 1/2 teaspoon salt, and remaining 1/4 teaspoon pepper.",
        "Roll 1 egg in flour mixture, shaking gently to remove any excess. Next, dip in beaten eggs, then roll in crumb mixture until completely coated. Again dip in egg and crumb mixtures, pressing coating to adhere. Repeat with remaining eggs, then transfer to large baking sheet and refrigerate at least 30 minutes or up to 4 hours.",
        "In large bowl, toss together the greens, herbs, 1/2 cup apricots, and 1/2 cup pistachios.",
        "In heavy, 2-quart saucepan over high heat, heat 3 inches oil until thermometer registers 350°F. Working in batches of 2 to 3, carefully add eggs and fry, turning over once, until golden brown, about 2 minutes per batch. Using slotted spoon, transfer to paper towels to drain.",
        "Drizzle vinaigrette over salad and toss to combine. Divide salad among 8 bowls. Scatter remaining apricots and pistachios over salads and top each bowl with 1 egg."
    ],
    "ingredients": [
        "10 large eggs",
        "1/3 cup all-purpose flour",
        "1 teaspoon fine sea salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 cup panko (Japanese bread crumbs)",
        "2/3 cup blanched whole almonds, finely ground*",
        "2/3 cup finely grated Parmesan (about 1 ounce)",
        "4 cups mixed baby greens such as arugula, beet shoots, kale, and spinach",
        "1 1/4 cups mixed fresh herbs such as chervil, chives, parsley, tarragon, and thyme, coarsely chopped",
        "8 small apricots, pitted and cut into 1/2-inch dice",
        "3/4 cup shelled raw unsalted pistachios (not dyed red), toasted",
        "1 quart vegetable oil for frying",
        "1 cup lemon vinaigrette",
        "*To grind almonds, pulse in food processor until uniformly ground. Be careful not to overprocess, or mixture will become almond butter."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Egg",
        "Fruit",
        "Leafy Green",
        "Herb",
        "Nut",
        "Fry",
        "Vegetarian",
        "Apricot",
        "Almond",
        "Pistachio",
        "Summer"
    ],
    "title": "Summer Salad with Apricots, Pistachios, and Almond Soft-Fried Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/summer-salad-with-apricots-pistachios-and-almond-soft-fried-eggs-238787"
}
