{
    "directions": [
        "Using electric mixer, beat yolks in medium bowl to blend. Add sugar and beat on high speed until thick and pale yellow, about 3 minutes. Reduce speed to low; beat in cornstarch.",
        "Place milk in heavy medium saucepan. Scrape seeds from vanilla bean into milk; add bean. Bring mixture to boil. Gradually whisk hot milk into yolk mixture. Return mixture to same pan. Cook over medium heat until very thick and center of mixture is bubbling, whisking constantly, about 2 minutes. Remove pastry cream from heat. Whisk 1 minute. Strain into large bowl. Place sheet of plastic wrap directly onto surface. Chill until cold, at least 3 hours. (Pastry cream can be made 1 day ahead. Keep refrigerated.)",
        "Whip cream in large bowl until stiff peaks form. Whisk pastry cream to loosen. Fold 1 cup whipped cream into pastry cream. Fold in remaining whipped cream. Cover and refrigerate while preparing fruit.",
        "Place meringues in large resealable plastic bag and seal. Coarsely crush meringues with mallet, leaving some large pieces (there should be about 6 cups). Place nectarines in another large bowl. Fold 1/2 cup peach preserves into nectarines. Place peaches in another large bowl. Fold remaining 1/2 cup peach preserves into peaches. Place 3 containers boysenberries in another large bowl; fold in boysenberry preserves. Spread 2 cups crushed meringues over bottom of 14-cup trifle dish. Spoon nectarines over meringues. Spread 13/4 cups pastry cream over fruit. Cover fruit with 2 cups crushed meringues. Spoon boysenberry mixture over meringues. Spread 13/4 cups pastry cream over fruit. Cover fruit with 2 cups crushed meringues. Spoon peach mixture over meringues. Place remaining cream in large dollop in center of trifle. Decorate top with additional berries. Refrigerate at least 3 hours and up to 5 hours."
    ],
    "ingredients": [
        "4 large egg yolks",
        "1/3 cup sugar",
        "2 1/2 tablespoons cornstarch",
        "1 1/3 cups whole milk",
        "1 vanilla bean, split lengthwise",
        "1 1/3 cups chilled whipping cream",
        "1 5-ounce container mini vanilla meringue cookies",
        "1 pound ripe yellow nectarines, halved, pitted, cut into 1/2-inch-thick slices",
        "1 cup peach preserves, divided",
        "1 pound ripe yellow peaches, halved, pitted, cut into 1/2-inch-thick slices",
        "3 5.6-ounce containers boysenberries or blackberries, plus additional for garnish",
        "1/2 cup boysenberry preserves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Berry",
        "Egg",
        "Dessert",
        "Nectarine",
        "Peach",
        "Vanilla",
        "Summer",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Kosher"
    ],
    "title": "Summer Fruit and Meringue Trifle",
    "url": "http://www.epicurious.com/recipes/food/views/summer-fruit-and-meringue-trifle-234962"
}
