{
    "directions": [
        "Position rack in bottom third of oven and preheat to 400°F. Combine 2/3 cup sugar and vanilla bean in processor; blend until vanilla bean is very finely minced. Sift vanilla sugar through strainer into large bowl; discard any large bits in strainer. Mix flour and cardamom into vanilla sugar. Add peaches to flour-sugar mixture and toss gently to coat.",
        "Roll out 1 pie crust disk on floured surface to 12-inch round. Transfer to 9-inch-diameter glass pie dish. Trim dough overhang to 1/2 inch. Spoon peach mixture into crust; dot with butter. Roll out second pie crust disk on lightly floured surface to 12-inch round. Drape dough over peach filling; trim overhang to 1 1/2 inches. Fold top and bottom edges under, pressing together to seal. Crimp edges decoratively. Using small sharp knife, cut 2-inch-long X in center of top crust to allow steam to escape. Brush crust lightly with whipping cream; sprinkle with remaining 2 teaspoons sugar.",
        "Place pie on rimmed baking sheet. Bake until crust is golden, peaches are tender, and juices bubble thickly through cut in top crust, about 1 hour 15 minutes. Transfer pie to rack and cool until lukewarm, about 2 hours.",
        "Serve pie lukewarm or at room temperature with vanilla ice cream."
    ],
    "ingredients": [
        "2/3 cup plus 2 teaspoons sugar",
        "1/2 vanilla bean, cut crosswise into 1/2-inch pieces",
        "3 tablespoons unbleached all purpose flour",
        "1 teaspoon (scant) ground cardamom",
        "3 3/4 pounds firm but ripe unpeeled peaches, halved, pitted, each half cut into 4 slices (about 10 cups)",
        "2 Best-Ever Pie Crust dough disks",
        "2 tablespoons (1/4 stick) unsalted butter, cut into 1/2-inch cubes",
        "Whipping cream (for glaze)",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Backyard BBQ",
        "Peach",
        "Vanilla",
        "Summer"
    ],
    "title": "Summer Peach Pie with Vanilla and Cardamom",
    "url": "http://www.epicurious.com/recipes/food/views/summer-peach-pie-with-vanilla-and-cardamom-238821"
}
