{
    "directions": [
        "Heat 1 tablespoon oil in large saucepan over medium heat. Add onion, carrot, lemongrass, and ginger; sauté until slightly softened but not brown, about 5 minutes. Add apple and curry powder; sauté until vegetables are tender, about 8 minutes. Add remaining 2 tablespoons oil, then flour and stir 1 to 2 minutes. Gradually pour in carrot juice; bring to boil, whisking constantly. Reduce heat to medium-low; simmer uncovered until sauce is slightly thickened and reduced to generous 2 1/2 cups, about 20 minutes. Strain sauce through fine strainer set over bowl, pressing on solids to extract as much liquid as possible; discard solids in strainer. Season to taste with salt and freshly ground pepper. DO AHEAD: Curry sauce can be made 1 day ahead. Cool slightly. Cover; chill. Rewarm before using.",
        "Preheat oven to 400&def;F. Place eggplant cubes in large bowl. Add 3 tablespoons oil and toss to coat; sprinkle with salt. Spread eggplant cubes in even layer on large rimmed baking sheet. Toss squash and remaining 2 tablespoons oil in same bowl. Sprinkle with salt and pepper. Spread squash in even layer on another large rimmed baking sheet. Roast until squash and eggplant are light golden and tender, turning occasionally, about 25 minutes for squash and 40 minutes for eggplant. Remove baking sheets with vegetables from oven and set aside. Fill large bowl with water and ice. Cook beans in large pot of boiling salted water until just crisp-tender, 2 to 4 minutes, depending on size of beans. Using tongs, transfer beans to bowl of ice water to cool. Drain. Maintain boiling water in same pot; add corn. Cook until corn is just tender, about 5 minutes. Drain corn. Cool slightly. Cut kernels off corn cobs; discard cobs. DO AHEAD: Vegetables can be made 4 hours ahead. Combine all vegetables on large rimmed baking sheet. Let stand at room temperature.",
        "Preheat oven to 400°F. Mix garbanzo beans into vegetables; bake until heated through, about 15 minutes.",
        "Combine hot vegetables and hot curry sauce in large bowl. Season to taste with salt and pepper. Stir in arugula and basil."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil, divided",
        "1 small onion, chopped (about 1 cup)",
        "1 small carrot, peeled, chopped",
        "1 stalk lemongrass, coarsely chopped and pounded with meat mallet to flatten slightly",
        "1 1-inch piece unpeeled fresh ginger, thinly sliced",
        "1 small Granny Smith apple, peeled, finely chopped (about 1 cup)",
        "2 tablespoons curry powder (preferably Madras)",
        "2 1/2 tablespoons all purpose flour",
        "2 cups fresh carrot juice",
        "1 1/2 pounds eggplants (about 2 medium), peeled, cut into 1-inch cubes",
        "5 tablespoons vegetable oil, divided",
        "1 pound assorted summer squash (such as zucchini, yellow crookneck, and pattypan), cut into 1-inch pieces",
        "1 pound green beans, haricots verts, and/or yellow wax beans, trimmed, cut into 2-inch lengths",
        "4 ears of corn, husked",
        "1 15- to 16-ounce can garbanzo beans (chickpeas), drained",
        "2 cups (packed) arugula",
        "1/4 cup torn fresh basil",
        "Test-Kitchen Tip: To release the most flavor from the lemongrass stalk, it's important to coarsely chop and flatten it."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Ginger",
        "Vegetarian",
        "High Fiber",
        "Curry",
        "Corn",
        "Eggplant",
        "Green Bean",
        "Arugula",
        "Chickpea",
        "Squash",
        "Summer",
        "Healthy",
        "Low Cholesterol"
    ],
    "title": "Summer Vegetable Ragout with Exotic Curry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/summer-vegetable-ragout-with-exotic-curry-sauce-360673"
}
