{
    "directions": [
        "Blend flour and salt in processor. Using on/off turns, cut in butter and shortening until pea-size pieces form. With machine running, add enough ice water by tablespoonfuls to form moist clumps. Gather dough into ball; flatten into disk. Wrap in plastic; refrigerate 1 hour. (Can be made 1 day ahead. Keep refrigerated. Soften dough slightly at room temperature before continuing.)",
        "Roll out dough on lightly floured surface to 12-inch round. Transfer to 9-inch-diameter tart pan with removable bottom. Trim dough overhang to 1 inch. Fold overhang in; press to form double-thick sides. Pierce bottom of dough all over with fork. Refrigerate 1 hour.",
        "Preheat oven to 400°F. Bake crust until golden, piercing with fork if bubbles form, about 20 minutes. Cool 5 minutes. Reduce oven temperature to 375°F.",
        "Whisk cheese, cream, sour cream, salt, and cayenne in medium bowl to blend. Add eggs and whisk to blend. Pour into prepared crust. Bake until filling is set, about 20 minutes. Cool 10 minutes.",
        "Meanwhile, heat oil in large skillet over medium heat. Add bell pepper and fennel and sauté until beginning to soften, about 4 minutes. Add zucchini, yellow squash, and corn; sauté until all vegetables are tender, about 12 minutes. Season with salt and pepper. Mound vegetables on top of tart and sprinkle with basil. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1/2 teaspoon salt",
        "6 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "3 tablespoons chilled solid vegetable shortening, cut into 1/2-inch cubes",
        "4 tablespoons (about) ice water",
        "5 ounces soft fresh goat cheese",
        "1/2 cup whipping cream",
        "1/4 cup sour cream",
        "1/8 teaspoon salt",
        "Generous pinch of cayenne pepper",
        "3 large eggs",
        "2 tablespoons olive oil",
        "1 small red bell pepper, stemmed, seeded, cut into 1/2-inch strips",
        "1/2 medium fennel bulb, cored, cut lengthwise into 1/2-inch strips",
        "1 small zucchini (about 5 ounces), halved lengthwise, cut crosswise into 1/2-inch pieces",
        "1 small yellow squash (about 5 ounces), halved lengthwise, cut crosswise into 1/2-inch pieces",
        "1/2 cup fresh corn kernels",
        "1 tablespoon chopped fresh basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Cheese",
        "Egg",
        "Pepper",
        "Vegetable",
        "Appetizer",
        "Brunch",
        "Bake",
        "Lunch",
        "Goat Cheese",
        "Fennel",
        "Corn",
        "Zucchini",
        "Summer",
        "Yellow Squash",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Summer Vegetable Tart",
    "url": "http://www.epicurious.com/recipes/food/views/summer-vegetable-tart-108448"
}
