{
    "directions": [
        "Soak noodles in a medium bowl of boiling-hot water 10 minutes.",
        "Meanwhile, blanch carrot in boiling water until softened, about 45 seconds. Drain. Rinse under cold water to stop cooking, then transfer to a small bowl along with cucumber, jalapeño, vinegar, sugar, 1 tablespoon lime juice, and 1/4 teaspoon salt. Let stand 5 minutes. Reserve 2 tablespoons liquid and drain pickled vegetables.",
        "Drain noodles and rinse under cold water, then drain and pat dry. Toss noodles with remaining 3/4 teaspoon lime juice and snip with kitchen shears 5 or 6 times.",
        "Fill a shallow pan or pie plate with warm water. Soak 2 rice-paper rounds until they begin to soften, about 30 seconds, then let excess water drip off and stack soaked rounds on a work surface so that they overlap by all but 1 inch on either side. Put 2 pieces of romaine on bottom third of round. Top with one eighth of noodles (about 2 tablespoons), tofu (4 sticks), bean sprouts (about 2 tablespoons), herbs (3 tablespoons), and pickled vegetables (3 tablespoons). Roll up tightly around filling, folding in sides. Make 7 more rolls in same manner.",
        "Stir together hoisin sauce, peanut butter, water, and reserved 2 tablespoons pickling liquid. Serve rolls with dipping sauce."
    ],
    "ingredients": [
        "2 ounces dried bean thread noodles (cellophane noodles)",
        "1 small carrot, cut into thin matchsticks (about 3/4 cup)",
        "1 Kirby cucumber, halved lengthwise, seeded, and cut into thin matchsticks (about 3/4 cup)",
        "1 small fresh jalapeño, cut into thin matchsticks",
        "1/4 cup rice vinegar (not seasoned)",
        "1/4 teaspoon sugar",
        "1 tablespoon plus 3/4 teaspoon fresh lime juice, divided",
        "16 rice-paper rounds (also called galettes de riz; about 8 inches in diameter) plus additional in case some tear",
        "plus additional in case some tear",
        "4 romaine leaves, each torn into 4 pieces",
        "10 ounces packaged baked tofu, cut into 3- by 1/3-inch sticks",
        "1 cup fresh bean sprouts",
        "1/2 cup each of torn basil, mint, and cilantro leaves (11/2 cups total)",
        "1/3 cup hoisin sauce",
        "2 tablespoons chunky peanut butter",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Picnic",
        "Vegetarian",
        "Quick & Easy",
        "Lunch",
        "Lime",
        "Tofu",
        "Healthy",
        "Noodle",
        "Soy Sauce",
        "Gourmet",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Summer Rolls with Baked Tofu and Sweet-and-Savory Dipping Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/summer-rolls-with-baked-tofu-and-sweet-and-savory-dipping-sauce-352777"
}
