{
    "directions": [
        "Cook udon in a medium pot of boiling salted water according to package directions. Transfer udon to a colander to drain; reserve cooking liquid in pot. Transfer udon to a large bowl and toss with 1 Tbsp. oil.",
        "If using eggs, cover pot and return cooking liquid to a boil. Add eggs and cook at a low boil until soft-boiled, about 6 minutes. Transfer eggs to a large bowl of ice water to cool, then peel and reserve.",
        "Heat remaining 2 Tbsp. oil in a large pot over medium-high. Sauté mushrooms and 1/4 tsp. salt until lightly browned and moisture releases, about 5 minutes. Stir in garlic and ginger; cook until fragrant, 30–60 seconds. Stir in miso, then add chicken broth. Stir in kombu, if using, soy sauce, and remaining 1/2 tsp. salt. Cover, bring to a simmer, and cook 10 minutes.",
        "Add meatballs and carrots. Cover and continue to simmer until meatballs are just cooked through, about 10 minutes. Remove kombu from broth and discard.",
        "Stir in bok choy and vinegar, if using. Place fish on top of stew, then cover and cook 3 minutes. Gently fold in shrimp (try to avoid breaking up fish) and cook, covered, until shrimp is pink and fish is opaque and cooked through, about 3 minutes more.",
        "Divide stew among bowls. Slice eggs in half lengthwise and top each bowl with 2 halves. Sprinkle with scallions. Serve udon in large bowl for sharing alongside."
    ],
    "ingredients": [
        "8 ounces udon noodles",
        "3/4 teaspoon kosher salt, divided, plus more",
        "3 tablespoons vegetable oil, divided",
        "4–6 large eggs (optional)",
        "8 ounces sliced maitake or shiitake mushrooms",
        "2 garlic cloves, finely chopped",
        "1 tablespoon finely chopped ginger",
        "2 teaspoons white miso paste",
        "4 cups homemade or store-bought low-sodium chicken broth",
        "1 (6x5-inch) piece dried kombu (optional)",
        "1 tablespoon low-sodium soy sauce",
        "Chicken Meatballs with Ginger and Miso",
        "1 medium carrot, sliced into 1/4-inch coins",
        "3/4 pound baby bok choy, trimmed, cut crosswise in 2-inch pieces (about 6 cups)",
        "1 tablespoon rice wine vinegar (optional)",
        "8 ounces skinless flaky white fish (such as bass, halibut, branzino, or cod), cut into 3x3/4-inch pieces",
        "8 ounces peeled, deveined, tail-on large shrimp",
        "2 tablespoons sliced scallions"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Stew",
        "Chicken",
        "Meatball",
        "Fish"
    ],
    "title": "Sumo Stew (*Chanko Nabe*) With Shrimp, Meatballs, and Bok Choy",
    "url": "http://www.epicurious.com/recipes/food/views/sumo-stew-chanko-nabe-with-shrimp-meatballs-and-bok-choy"
}
