{
    "directions": [
        "Into a bowl sift together the flour, the baking powder, the baking soda, the salt, and the sugar. In a small skillet cook the garlic with the rosemary and the pepper in the reserved oil from the sun-dried tomatoes over moderately low heat, stirring, until it is softened and fragrant but not brown. In a large bowl whisk together the eggs, the milk, the shortening, and the garlic mixture, add the flour mixture, and stir the batter until it is just combined. Stir in the sun-dried tomatoes, the olives, the capers, the parsley, and the Parmesan, divide the batter among 4 buttered and floured loaf pans, each 5 3/4 by 3 1/4 by 2 inches, and bake the breads in the middle of a preheated 350°F. oven for 35 to 40 minutes, or until a tester comes out clean. Remove the breads from the pans and let them cool, right sides up, on a rack. The breads keep, wrapped well in plastic wrap and foil, chilled for 1 week or frozen for 1 month."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "2 teaspoons double-acting baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon salt",
        "2 tablespoons sugar",
        "2 garlic cloves, minced",
        "1 teaspoon crumbled dried rosemary",
        "1 teaspoon freshly ground black pepper",
        "1/2 cup drained and chopped sun-dried tomatoes packed in oil  (available at specialty foods shops and some supermarkets), reserving 2 tablespoons of the oil",
        "2 large eggs",
        "1 1/2 cups milk",
        "3 tablespoons vegetable shortening, melted and cooled",
        "1/2 cup chopped pitted Kalamata or other brine-cured black olives",
        "2 tablespoons drained bottled capers, minced",
        "1/2 cup minced fresh parsley leaves (preferably flat-leaved)",
        "1 cup freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Olive",
        "Tomato",
        "Bake",
        "Parmesan",
        "Rosemary",
        "Winter",
        "Capers",
        "Gourmet"
    ],
    "title": "Sun-Dried Tomato and Olive Breads",
    "url": "http://www.epicurious.com/recipes/food/views/sun-dried-tomato-and-olive-breads-13582"
}
