{
    "directions": [
        "Place half of pork and half of fat in processor. Using on/off turns, blend until pork is ground to coarse texture (about 1/4-inch cubes). Scrape into large bowl. Repeat with remaining pork and fat. Add all remaining sausage ingredients to bowl with pork and mix gently with hands until blended. Using wet hands, shape sausage into 10 oval patties, each about 3/4 inch thick. Place on plastic-lined plate. Cover and chill at least 2 hours and up to 1 day.",
        "Heat 1 tablespoon oil in heavy large skillet over medium-high heat. Add sausage patties and sauté until brown, about 4 minutes per side. Transfer patties to small baking sheet.",
        "Pour off all but 2 tablespoons fat from skillet (or add olive oil to make 2 Add tomatoes with juice and 2 tablespoons basil. Simmer uncovered until sauce thickens, crushing tomatoes with back of fork, about 10 minutes. Add sausage patties and any juices to sauce. Cover; simmer over medium heat until cooked through and tender, turning patties occasionally, about 15 minutes. Season sauce with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cool; cover and chill. Rewarm covered over low heat before continuing.",
        "Spoon polenta into large shallow bowl. Top with sausages and sauce. Sprinkle with cheese and additional chopped basil. Serve, passing more cheese separately.",
        "Available at specialty foods stores and from zingermans.com."
    ],
    "ingredients": [
        "1 1/2 pounds boneless heritage pork shoulder (Boston butt), cut into 3/4-inch cubes (about 3 cups packed)",
        "4 ounces fat from heritage pork, cut into 1/2-inch cubes (about 1/2 cup packed)",
        "1/4 cup ice water",
        "3 tablespoons chopped drained oil-packed sun-dried tomatoes",
        "2 large garlic cloves, minced",
        "1 tablespoon chopped fresh basil",
        "2 teaspoons fennel pollen* or freshly ground fennel seeds",
        "1 1/2 teaspoons coarse kosher salt",
        "1/2 teaspoon sugar",
        "1/2 teaspoon freshly ground black pepper",
        "1 tablespoon (or more) olive oil",
        "1/2 cup finely chopped onion",
        "1/4 cup finely chopped carrot",
        "2 large garlic cloves, minced",
        "1 cup dry white wine",
        "3 cups canned diced tomatoes in juice (from two 14.5-ounce cans)",
        "2 tablespoons chopped fresh basil plus additional for garnish",
        "Creamy Polenta",
        "Freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Pork",
        "Tomato",
        "Sauté",
        "High Fiber",
        "Father's Day",
        "Dinner",
        "Potluck",
        "Simmer"
    ],
    "title": "Sun-dried Tomato and Fennel Sausage Patties with Creamy Polenta",
    "url": "http://www.epicurious.com/recipes/food/views/sun-dried-tomato-and-fennel-sausage-patties-with-creamy-polenta-352593"
}
