{
    "directions": [
        "Spread out breadcrumbs on a baking sheet and let sit uncovered at room temperature until dried out, about 12 hours.",
        "Combine breadcrumbs, Pecorino, parsley, red pepper flakes, paprika, 1 chopped garlic clove, and 2 tablespoons oil in a medium bowl.",
        "Trim beef slices into 6x2\" pieces; season with salt and pepper. Sprinkle each slice with about 2 tablespoons breadcrumb mixture, roll up, and secure with a toothpick or twine; set braciole aside. Set remaining breadcrumb mixture aside.",
        "Heat remaining 2 tablespoons oil in a large heavy pot over medium-high heat and cook sausage, turning occasionally, until browned on all sides, 5–8 minutes. Transfer to a large rimmed baking sheet.",
        "Season ribs with salt and pepper; cook in same pot until browned on all sides, 8–10 minutes. Transfer to baking sheet with sausage. Cook reserved braciole in pot, turning occasionally, until browned, 5–8 minutes; transfer to same baking sheet.",
        "Reduce heat to medium-low and cook onion, anchovy, and remaining garlic in pot, stirring occasionally, until onion is translucent, 8–10 minutes. Add tomato paste and cook, stirring often, until slightly darkened in color, 5–8 minutes.",
        "Add crushed and whole tomatoes, crushing whole tomatoes with your hands; season with salt and pepper. Bring to a boil, reduce heat, and simmer, stirring occasionally, until sauce has thickened, 1–1 1/2 hours.",
        "Add sausage, ribs, braciole, and any accumulated juices on baking sheet to sauce. Cook, partially covered, stirring occasionally and skimming surface as needed, until meat is very tender (rib meat should be falling off the bone), 2 1/2–3 hours longer. Season sauce with salt and pepper.",
        "Just before serving, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente; drain.",
        "Toss pasta in a large bowl with a little of the sauce and top with reserved breadcrumb mixture. Remove bones from ribs and remove toothpicks from braciole. Serve braciole, ribs, sausage, and remaining sauce with pasta alongside.",
        "DO AHEAD: Breadcrumbs can be dried out 5 days ahead; store airtight at room temperature. Sauce can be cooked 2 days ahead; cover and chill. Gently reheat sauce, covered, before cooking pasta."
    ],
    "ingredients": [
        "2 cups fresh breadcrumbs",
        "1/2 cup finely grated Pecorino",
        "1/3 cup finely chopped fresh flat-leaf parsley",
        "1 1/2 teaspoons crushed red pepper flakes",
        "1/4 teaspoon hot smoked Spanish paprika",
        "7 garlic cloves, finely chopped, divided",
        "4 tablespoons olive oil, divided",
        "2 pounds beef top round, thinly sliced by a butcher for braciole",
        "Kosher salt, freshly ground pepper",
        "1 freshly ground pepper",
        "2 pounds hot or sweet Italian sausage, halved crosswise",
        "1 pound baby back pork ribs, cut into 3- to 4-rib pieces, or pork spare ribs, cut into individual ribs",
        "1 large onion, finely chopped",
        "2 anchovy fillets packed in oil, drained",
        "1/4 cup tomato paste",
        "2 28-ounce cans crushed tomatoes",
        "2 28-ounce cans whole peeled tomatoes",
        "1 1/2 pounds large tubular pasta (such as rigatoni or tortiglioni)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pasta",
        "Tomato",
        "Dinner",
        "Pork Rib",
        "Sausage",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sunday Sauce with Sausage and Braciole",
    "url": "http://www.epicurious.com/recipes/food/views/sunday-sauce-with-sausage-and-braciole-51223920"
}
