{
    "directions": [
        "Pulse tomatoes with juice (1 can at a time) in a blender until almost smooth.",
        "Heat oil in a wide 10-to 12-quarts heavy pot over medium-high heat until it shimmers, then sauté onion until golden, about 6 minutes. Add garlic and sauté 1 minute.",
        "Add tomato purée, bay leaf, and 1/2 teaspoon salt and simmer, uncovered, stirring occasionally, until thickened, 40 to 45 minutes. Discard bay leaf.",
        "Stir together garlic, parsley, cheese, and pancetta.",
        "Pound top round to 1/8 inch thick between 2 sheets of plastic wrap with a rolling pin or meat pounder. Spoon parsley mixture evenly over beef cutlets (about 3 tablespoons each). Starting with a short side, roll up cutlets and tie at each end with string to make braciole.",
        "Form reserved meatball mixture into balls (about 16), using a 1/4-cup measure.",
        "Heat 2 tablespoons olive oil in a 12-inch heavy skillet over medium heat until it shimmers. Season braciole with 1/2 teaspoon salt and 1/4 teaspoon pepper (total) and brown well in 2 batches, turning, about 6 minutes per batch. Transfer to a large shallow pan.",
        "Add 2 tablespoons oil to skillet and brown sausage in 2 batches, turning, about 6 minutes per batch. Transfer to pan with braciole.",
        "Pat pork shoulder dry and season with 1/4 teaspoon salt and 1/4 teaspoon pepper. Add 2 tablespoons oil to skillet and brown pork shoulder all over, about 5 minutes. Transfer to pan.",
        "Pat pork ribs dry and season with 1/2 teaspoon salt and 1/4 teaspoon pepper. Add remaining 2 tablespoons oil to skillet and brown ribs well in 2 batches, turning, about 6 minutes per batch. Transfer to pan.",
        "Heat reserved oil from polpette in skillet over medium heat until it shimmers. Fry meatballs in 2 batches (do not crowd), turning occasionally, until well browned, about 6 minutes per batch. Transfer to paper towels using a slotted spoon. (Discard oil.)",
        "Return sauce to a simmer and carefully add all meats and juices. Simmer, partially covered, gently stirring occasionally (do not break up meatballs), until all meats are tender, about 2 1/4 hours.",
        "Transfer meats with tongs to a large platter. Serve with fettuccine and remaining sauce."
    ],
    "ingredients": [
        "5 (28-ounce) cans whole tomatoes in juice (preferably Italian)",
        "1/2 cup olive oil",
        "1 large onion, finely chopped",
        "5 garlic cloves, minced",
        "1 Turkish bay leaf or 1/2 California",
        "4 garlic cloves, minced",
        "1/2 cup finely chopped flat-leaf parsley",
        "1 cup grated Pecorino Romano (2 ounces)",
        "3 ounces thinly sliced pancetta, finely chopped",
        "1 1/2 pounds beef top round, cut across the grain into 1/4-inch slices",
        "Reserved meat mixture and frying oil from polpette",
        "1/2 cup olive oil for frying, divided",
        "1 pound sweet Italian sausage links",
        "1 pound hot Italian sausage links",
        "1 1/2 pound boneless pork shoulder, cut into 2-inch pieces",
        "2 pounds country-style pork ribs",
        "Equipment: kitchen string",
        "Accompaniment: fresh egg fettuccine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Soup/Stew",
        "Beef",
        "Tomato",
        "Sausage",
        "Simmer",
        "Gourmet"
    ],
    "title": "Sunday _Ragù_",
    "url": "http://www.epicurious.com/recipes/food/views/sunday-em-ragu-em-351172"
}
