{
    "directions": [
        "Two hours before roasting, remove the meat from the refrigerator and allow it to come to room temperature.",
        "Preheat the oven to 500 degrees F (see Cook's Note).",
        "Place the oven rack on the second lowest position.",
        "Place the roast in a pan large enough to hold it comfortably, bone-side down, and spread the top thickly with the salt and pepper. Roast the meat for 45 minutes. Without removing the meat from the oven, reduce the oven temperature to 325 degrees F and roast for another 30 minutes. Finally, increase the temperature to 450 degrees F and roast for another 15 to 30 minutes, until the internal temperature of the meat is 125 degrees F. (Be sure the thermometer is exactly in the center of the roast.) The total cooking time will be between 1 1/2 and 1 3/4 hours. Meanwhile, make the sauce.",
        "Remove the roast from the oven and transfer it to a cutting board. Cover it tightly with aluminum foil and allow the meat to rest for 20 minutes. Carve and serve with the sauce.",
        "Whisk together the mayonnaise, mustards, horseradish, sour cream, and salt in a small bowl."
    ],
    "ingredients": [
        "One 3-rib standing rib roast (7 to 8 pounds)",
        "1 tablespoon kosher salt",
        "1 1/2 teaspoons freshly ground black pepper",
        "Mustard Horseradish Sauce, recipe follows",
        "1 1/2 cups good mayonnaise",
        "3 tablespoons Dijon mustard",
        "1 1/2 tablespoons whole-grain mustard",
        "1 tablespoon prepared horseradish",
        "1/3 cup sour cream",
        "1/4 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Roast Recipes",
        "Christmas",
        "Holiday",
        "Meat",
        "Beef",
        "Roasting"
    ],
    "title": "Sunday Rib Roast",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/sunday-rib-roast-recipe"
}
