{
    "directions": [
        "Purée onions and garlic in a food processor until very finely chopped.",
        "Heat oil in a large Dutch oven or heavy ovenproof pot over medium-high. Cook onion mixture and 1/2 tsp. salt, stirring often, until liquid is evaporated and bits on bottom of pot are beginning to brown, 10–12 minutes. Add tomato paste, oregano, and red pepper flakes; cook, stirring, until slightly darker in color, about 2 minutes more. Add 1/2 cup water and cook, scraping up browned bits from bottom of pot. Add tomatoes and their juices and 1 cup water; stir to combine. Stir in basil, season with pepper and remaining 1 tsp. salt, and bring to a simmer. Keep warm, stirring occasionally, until ready to use.",
        "Combine cheese, parsley, breadcrumbs, and garlic in a medium bowl.",
        "Preheat oven to 300°F. Lay beef flat on a work surface; season with 3/4 tsp. salt and 1/2 tsp. pepper. Sprinkle evenly with 1/2 cup breadcrumb mixture. Working one at a time and starting at the short end, roll up beef, then tie in a few places with butcher’s twine to secure. Season braciole with remaining 1/2 tsp. salt and 1/4 tsp. pepper.",
        "Heat 1 Tbsp. oil in a large skillet over medium-high. Working in batches and adding remaining 1 Tbsp. oil to skillet as needed, cook braciole, turning occasionally, until browned on all sides, about 8 minutes per batch.",
        "Transfer braciole to pot with sauce, cover, and bake 1 1/2 hours. Wipe out skillet and reserve.",
        "Mix ground beef, eggs, milk, salt, pepper, and remaining 1 1/4 cups breadcrumb mixture with a fork in a medium bowl. Shape into 12 (1 1/2\") balls.",
        "Heat 1 Tbsp. oil in reserved skillet. Working in batches, cook meatballs, turning occasionally, until browned on all sides, about 8 minutes per batch; transfer to a plate. Working in batches and adding remaining 1 Tbsp. oil to skillet as needed, cook sausages, turning occasionally, until browned on all sides, about 8 minutes per batch. Transfer to plate.",
        "After braciole has baked 1 1/2 hours, using tongs, gently lower meatballs and sausages into sauce. Cover pot and continue to bake until braciole is very tender and meatballs and sausages are cooked through, 25–30 minutes more.",
        "Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Transfer sausages, meatballs, and braciole to a platter; remove strings from braciole. Spoon some warm sauce over.",
        "Drain pasta and toss with as little or as much sauce as you like. Serve topped with Parmesan.",
        "Sauce can be made 3 days ahead; cover and chill, or freeze up to 6 months.\nBraciole, meatballs, and sausages can be made 3 days ahead; submerge in sauce, cover, and chill, or freeze up to 3 months."
    ],
    "ingredients": [
        "2 medium onions, cut into 1\" pieces",
        "4 garlic cloves, peeled",
        "1/4 cup olive oil",
        "1 1/2 teaspoons kosher salt, divided",
        "2 tablespoons tomato paste",
        "2 teaspoons dried oregano",
        "1 teaspoon crushed red pepper flakes",
        "2 (28-ounce) cans whole peeled tomatoes, crushed",
        "3 (packed) cups basil leaves",
        "1/2 teaspoon freshly ground black pepper",
        "1 cup finely grated Parmesan",
        "2/3 cup chopped parsley",
        "1/2 cup fine breadcrumbs",
        "3 garlic cloves, finely chopped",
        "6 slices beef top round (about 1 1/2 pounds total), pounded 1/4\" thick",
        "1 1/4 teaspoons kosher salt, divided",
        "3/4 teaspoon freshly ground black pepper, divided",
        "2 tablespoons olive oil, divided",
        "1 pound ground beef chuck (20% fat)",
        "2 large eggs",
        "2 tablespoons milk",
        "3/4 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "2 tablespoons olive oil, divided",
        "6 sweet Italian sausages",
        "1 pound pasta, such as spaghetti",
        "Kosher salt",
        "Finely grated Parmesan (for serving)",
        "Butcher's twine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Freezer Food",
        "Pasta",
        "Beef",
        "Tomato",
        "Parmesan",
        "Meatball",
        "Sausage",
        "Breadcrumbs",
        "Ground Beef",
        "Oregano",
        "Dinner",
        "Potluck"
    ],
    "title": "Sunday Sauce With Braciole, Meatballs, and Sausage",
    "url": "http://www.epicurious.com/recipes/food/views/sunday-sauce-with-braciole-meatballs-and-sausage"
}
