{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Using paper towels, pat the roast dry to help get a great crust on the meat. Sprinkle the roast generously with salt and pepper. In a large Dutch oven over medium heat, add 2 tablespoons oil and heat until glossy. Add the roast and brown on all sides. Remove and transfer to a cutting board or a large plate.",
        "Add more oil to the pot if needed, along with the carrots, celery and onions. Season with salt and pepper. Add the fresh herb bundle and cook until the vegetables start to brown, 5 to 10 minutes. Add the garlic and continue cooking for another minute. Add 3/4 cup of the red wine and reduce by half, scraping up the seared bits and incorporating them into the juice. Then return the roast to the pot and add the beef broth. Bring the liquid to a simmer before covering with a tight-fitting lid and placing the pot in the oven. Allow the roast to cook until fork tender, 3 1/2 to 4 hours, turning once halfway through.",
        "Remove from the oven and transfer the roast to a large cutting board. Tent with foil while the roast rests. Placing the Dutch oven back on the stovetop over medium-high heat, add the remaining 1/4 cup of red wine to the liquid and reduce by half at a simmer, about 10 minutes. Strain the sauce and season with salt and pepper. Shred the roast into big chunks and toss with the jus.",
        "For the herb salad: Toss the watercress and picked parsley with the lemon juice and olive oil to taste. Season with salt and pepper and top with the toasted almonds",
        "Serve on top of the Risotto Cakes and top with the fresh herb salad.",
        "For the risotto: In a medium saucepan, heat the chicken broth to a simmer. In a separate saucepan, melt the butter over medium-high heat. Add the shallots to the butter, cooking until fragrant and translucent, about 2 minutes. Add the Arborio rice and lightly toast, stirring to coat in the butter and shallots. Add the white wine, continuing to cook while stirring until the wine is absorbed. You should be able to run your spoon through the risotto and have the indentation stay.",
        "Using a ladle, add enough of the warm chicken broth to cover the rice, stirring constantly over medium heat until the broth is completely absorbed. Repeat the process 3 more times, adding the broth in stages while continuing to stir. Once all of the chicken broth has been added and the rice is tender, add the peas, lemon juice and lemon zest and stir to combine.",
        "Remove from the heat and stir in the Parmesan, mozzarella and season with salt and pepper. Cool the risotto by spreading it evenly over a sheet tray. Cover with plastic wrap and chill in the refrigerator for 20 to 30 minutes.",
        "Once the risotto is cooled, form the mixture into burger-size patties, about 1-inch thick. Set up a dredging station with the flour in one dish, beaten eggs in another and panko breadcrumbs in another. Dip the rice patties into the flour, then into the eggs and finally coat them in the panko breadcrumbs.",
        "In a large skillet, heat 1/2-inch vegetable oil over medium heat until a pinch of panko sizzles when dropped in the oil. Working in batches of 2 to 3, fry the risotto cakes until golden brown, 2 to 3 minutes per side (use a fish spatula under the cake and the back of a fork on top to help stabilize while flipping). Transfer to a wire rack, which will help them stay crispy. Season with salt and they are ready to serve. Yield: 6 large cakes."
    ],
    "ingredients": [
        "One 4-pound boneless chuck roast",
        "Kosher salt and cracked black pepper",
        "2 tablespoons vegetable or olive oil, plus more if needed",
        "2 carrots, chopped",
        "2 celery ribs, chopped",
        "1 yellow onion, chopped",
        "1 bundle various fresh herbs, such as tarragon, rosemary, parsley, tied with twine",
        "4 cloves garlic, chopped",
        "1 cup dry red wine, such as cabernet sauvignon",
        "2 1/2 cups low-sodium beef broth",
        "2 cups watercress",
        "1 cup picked fresh parsley leaves",
        "Lemon juice, for drizzling",
        "Olive oil, for drizzling",
        "Salt and freshly cracked black pepper",
        "1/4 cup sliced almonds, toasted",
        "Risotto Cakes, for serving, recipe follows",
        "3 cups low-sodium chicken broth",
        "3 tablespoons unsalted butter",
        "2 large shallots, minced (about 1/2 cup)",
        "1 cup Arborio rice",
        "3/4 cups dry white wine",
        "5 ounces frozen peas, defrosted",
        "1/3 cup lemon juice",
        "1 tablespoon lemon zest",
        "1 1/4 cups freshly grated Parmesan",
        "4 ounces low-moisture shredded mozzarella",
        "Salt and freshly ground black pepper",
        "1 cup all-purpose flour, for dredging",
        "2 eggs, beaten",
        "1 1/2 cups panko breadcrumbs",
        "Vegetable oil, for frying"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Roast Recipes",
        "Salad Recipes",
        "Sauce Recipes",
        "Beef",
        "Meat",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Sunday Pot Roast",
    "url": "http://www.foodnetwork.com/recipes/sunday-pot-roast"
}
