{
    "directions": [
        "Place sunflower seeds in a medium, wide, heavy pot or Dutch oven and cover with water. Cover pot and bring to a boil, then reduce to a simmer and cook until al dente, 45–55 minutes.",
        "Strain seeds through a fine-mesh sieve into a large bowl, reserving cooking liquid. Transfer 1 cup cooking liquid and 1 cup seeds to a blender; reserve remaining seeds and discard remaining liquid. Add cream and 2/3 cup Parmesan and blend until very smooth.",
        "Wipe out pot. Heat 2 Tbsp. oil in pot over medium. Add onion, half of garlic, and 4 thyme sprigs. Cook, stirring, until garlic is fragrant and onion begins to turn translucent, about 4 minutes. Add reserved sunflower seeds and cook until seeds are toasted, about 1 minute. Add broth and wine and simmer over medium heat until liquid is almost fully reduced and seeds are tender, 15-20 minutes.",
        "Meanwhile, heat 1 Tbsp. oil in a large skillet over medium-high. Add squash and cook, stirring occasionally, until just beginning to brown, 5–7 minutes. Add mushrooms, 2 thyme sprigs, and remaining garlic and 1 Tbsp. oil and continue cooking until mushrooms and squash are tender, about 5 minutes. Season with 1/2 tsp. salt and 1/4 tsp. pepper and transfer to a plate.",
        "When broth is almost completely evaporated, add blended seed mixture and cook until sauce thickens, 5-8 minutes. Discard thyme sprigs and stir in 1 tsp. salt and 1/4 tsp. pepper; taste and adjust seasonings. Divide \"risotto\" among bowls and top with sautéed vegetables, Parmesan, pepper, and thyme sprigs."
    ],
    "ingredients": [
        "4 cups raw sunflower seeds",
        "2/3 cup heavy cream",
        "2/3 cup freshly grated Parmesan (about 1 ounce), plus more for serving",
        "4 tablespoons olive oil, divided",
        "1/2 large onion, finely chopped",
        "4 garlic cloves, finely chopped, divided",
        "6 thyme sprigs, divided, plus more for serving",
        "2 cups vegetable broth",
        "2 tablespoons dry white wine",
        "3 cups 1/2\" cubed butternut squash (about 1 pound squash)",
        "3 1/2 ounces shiitake or cremini mushrooms, trimmed, coarsely chopped",
        "1 1/2 teaspoons kosher salt, plus more",
        "1/2 teaspoon freshly ground black pepper, plus more"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetarian",
        "Seed",
        "Wheat/Gluten-Free",
        "Parmesan",
        "Butternut Squash",
        "White Wine",
        "Garlic",
        "Dinner",
        "Fall",
        "Winter"
    ],
    "title": "Sunflower Seed \"Risotto\" With Squash and Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/sunflower-seed-risotto-with-squash-and-mushrooms"
}
