{
    "directions": [
        "In a large stockpot over medium-high heat, melt 1/4 cup butter and lightly saute the onions and garlic, about 3 minutes. Add the chicken, water, and stock, making sure liquid covers meat. Tie the thyme sprigs, parsley stems, and sage sprigs together and add to the pot along with the peppercorns, and celery. Bring to a boil, then reduce the heat and simmer the chicken until it is \"fall of the bone\" tender, about 30 minutes, skimming off scum as it simmers. Remove the chicken from the pot to a cutting board and let cool. Remove the herb bundle and the celery and discard. Reserve the stock. When the chicken is cool enough to handle, pull it from bones and cut into bite-sized pieces.",
        "In a large bowl, mix together 2 cups of flour with the remaining chopped herbs and the tablespoon of salt. Make a well in the middle and pour 1 cup of the reserved chicken stock, including fat, into the well. Using a fork, slowly stir the stock into the flour. Repeat, adding more flour and/or stock until a soft, doughy consistency is reached. Add more flour, 1 tablespoon at a time, if it gets too sticky. On a lightly floured surface, roll the dough out to 1/8 to 1/4-inch thickness. Use a pizza cutter or sharp knife to slice the dough into 2-inch squares, then cut the squares in half on the diagonal into triangles.",
        "Return the stock to a simmer and slowly add the dumplings, allowing some excess flour to remain on the dumplings to increase the body of the broth. Be careful not to let the dumplings touch as they are added to the pot. Cook until the dumplings rise to the surface. If the broth does not thicken to your liking, mix together 1 tablespoon of butter and 1 tablespoon flour in a small bowl with a fork. Slowly add the mixture into the broth to help thicken the soup. Stir in the reserved chicken and ladle into serving bowls."
    ],
    "ingredients": [
        "1/4 cup unsalted butter, plus 1 tablespoon",
        "1 medium onion, chopped",
        "3 cloves garlic, chopped",
        "1 whole (5- to 6-pound) chicken, skin on, cut into 8 pieces, including neck",
        "6 cups water",
        "6 cups low-sodium chicken stock",
        "5 to 6 fresh thyme sprigs, plus 1 tablespoon chopped leaves",
        "Small bunch parsley stems, plus 1 tablespoon chopped leaves",
        "2 fresh sage sprigs, plus 1 tablespoon chopped leaves",
        "1 teaspoon whole black peppercorns",
        "1 stalk celery, trimmed and halved crosswise",
        "2 to 3 cups all-purpose flour, plus",
        "1 tablespoon 1 tablespoon kosher salt, plus more for seasoning"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Southern Recipes",
        "Chicken and Dumpling",
        "Soup",
        "Chicken",
        "Poultry Recipes",
        "Celery",
        "Vegetable",
        "Main Dish Recipes",
        "Sauteing Recipes"
    ],
    "title": "Sunny's Easy Chicken and Dumplings",
    "url": "http://www.foodnetwork.com/recipes/sunny-anderson/sunnys-easy-chicken-and-dumplings-recipe"
}
