{
    "directions": [
        "In a large bowl, add the peanut butter, butter and powdered sugar and beat with a whisk or electric beater until smooth. Using a teaspoon measure, scoop the mixture and form into balls, then press into a coin shape the diameter of a quarter. Refrigerate to set up dough cookies, about 30 minutes.",
        "To make bites, dip peanut butter coins in melted chocolate then toss in graham cracker crumbs until coated, double dip and double coat if you feel dangerous. Arrange the coated coins on a wire rack and refrigerate for about 30 more minutes to set. Add the marshmallow fluff to a pastry bag fitted with a star tip. Remove the coins from the refrigerator and squeeze about 1 teaspoon of marshmallow fluff into the center of half of the coins. If you don't have a pastry bag, use a plastic bag, fill it with fluff and cut 1 corner off and dollop that way. Then top each half with another coin to make a sandwich and place return to the refrigerator to set, about 1 hour.",
        "Options: chop coconut flakes and add them to the graham cracker crumbs to use for coating.",
        "Add puffed rice cereal into the peanut butter, butter and powdered sugar for a bit more texture and crunch."
    ],
    "ingredients": [
        "2 cups crunchy peanut butter",
        "1 1/2 sticks butter",
        "5 cups powdered sugar",
        "24 ounces (4 cups) milk chocolate chips, melted",
        "2 cups graham cracker crumbs",
        "1 cup marshmallow fluff",
        "1 cup coconut flakes, optional",
        "2 1/2 cups puffed rice cereal, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cookie Recipes",
        "Chocolate",
        "Cookie",
        "Coconut Recipes",
        "Fruit",
        "Dessert",
        "Lunch",
        "Holiday"
    ],
    "title": "Sunny's Crunchy Peanut Butter S'more Bites",
    "url": "http://www.foodnetwork.com/recipes/sunny-anderson/sunnys-crunchy-peanut-butter-smore-bites-recipe"
}
