{
    "directions": [
        "For the topping: In a medium bowl, add the flour, brown sugar, butter, pecans, sage, orange zest and a pinch of salt. Mix with your hands until it feels like you could make a ball that would just slightly hold together and everything is crumbly. Take a tiny bite; it should be slightly sweet with a hint of salt (like a good chocolate chip cookie!). Add a tiny pinch more of salt as needed. Cover the bowl and place in the freezer while finishing the recipe. Remove from the freezer 5 minutes before using and break apart with a fork as if you were flaking rice.",
        "For the filling: Preheat the oven to 400 degrees F. Poke the sweet potatoes about 6 to 8 times, about 1/4-inch deep, using a fork. Rub with the oil and set the potatoes on a baking sheet. Roast on the middle rack until fork tender and the skins are darkened, 40 to 50 minutes. Set aside to cool. By the time the potatoes are cool enough to handle, the skins will loosen from the flesh. With your hands, gently remove the skins and discard. Place the sweet potato flesh in a large bowl along with the cream, flour, brown sugar, butter and pumpkin pie spice. Mash until smooth.",
        "Shift the oven rack one level down and turn on the broiler. Spread out the marshmallows in a single layer on a baking sheet, transfer to the oven and broil, watching the entire time. When the tops of the marshmallows char to a black color and begin smoking (be strong, brown looks good, but black tastes better!), quickly remove from the oven. Lower the oven to 375 degrees F. With a rubber spatula, fold the marshmallows into the mashed sweet potatoes until combined. Taste and add a bit more brown sugar if needed, a tablespoon at a time; this should be just on the edge of sweet, the topping does the rest. In a small bowl, whisk the eggs and fold them into the sweet potatoes to combine.",
        "Spread the sweet potato mixture into a 9-by-13-inch baking dish, leveling the top. Sprinkle the prepared topping evenly over the potatoes. Bake until the topping is shiny and golden brown, 30 to 35 minutes. Serve warm."
    ],
    "ingredients": [
        "1/2 cup all-purpose flour",
        "1/4 cup plus 2 tablespoons light brown sugar, packed",
        "5 tablespoons unsalted butter, cold, cut into teeny weeny bits",
        "1 cup pecan halves, roughly chopped",
        "6 to 8 fresh sage leaves, finely chopped",
        "Zest of 1 orange",
        "Kosher salt",
        "2 1/2 pounds (about 4 medium) sweet potatoes, skin on",
        "2 tablespoons vegetable oil",
        "1/2 cup heavy cream",
        "1/2 cup all-purpose flour",
        "1/4 cup light brown sugar, packed, plus more to taste",
        "4 tablespoons unsalted butter",
        "1/2 teaspoon pumpkin pie spice",
        "1 cup mini marshmallows, more if desired",
        "2 eggs"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sweet Potato Casserole",
        "Vegetable Casserole",
        "Casserole",
        "Sweet Potato",
        "Vegetable",
        "Thanksgiving Side Dishes",
        "Holiday",
        "Thanksgiving",
        "Nut Recipes"
    ],
    "title": "Sunny's Sage and Pecan Sweet Potato Casserole",
    "url": "http://www.foodnetwork.com/recipes/sunny-anderson/sunnys-sage-and-pecan-sweet-potato-casserole"
}
