{
    "directions": [
        "In a large skillet on high heat, add the butter and ground chuck. Season with a pinch of salt and, using a wooden spoon or spatula, break it up into small chunks, not bits. Brown the meat on all sides, 6 to 8 minutes, then remove from the skillet with a slotted spoon to a plate and reserve.",
        "Toss the top round cubes in a medium bowl with the flour to coat. Add the cubes to the hot skillet in batches and sear on all sides, 6 to 8 minutes. Remove to the plate with the ground beef and reserve.",
        "Use twine to tie the thyme, sage and oregano together. Turn the slow cooker to high and add the seared beef, tied herbs, onions, beef stock, red chili flakes, peppercorns, garlic and 1 cup of the beer. Season with another pinch of salt and cover. When the liquid begins to boil, after about 30 minutes, turn the slow cooker to low and cook until the onions are tender, about 4 hours.",
        "At the 4-hour mark, add the potatoes, carrots and remaining 1/2 cup beer. Cover and cook until the potatoes and carrots are tender, about 2 hours. Skim any fat off the top (see Cook's Note), then spoon the stew atop your choice of serving options. Sprinkle with parsley before serving.",
        "Preheat the oven to 250 degrees F.",
        "In a large ovensafe pot or Dutch oven, sear the ground chuck and beef cubes in the butter using the same method as above. Use twine to tie the thyme, sage and oregano together. Add all the meat back to the pot along with the tied herbs, onions, beef stock, red chili flakes, peppercorns, garlic and 1 cup of the beer. Season with a pinch of salt, cover and place in the oven to cook until the onions are tender, about 6 hours.",
        "At the 6-hour mark, add the potatoes, carrots and remaining 1/2 cup beer. Cover and cook until the potatoes and carrots are tender, about 2 hours. Skim any fat off the top (see Cook's Note), then spoon the stew atop your choice of serving options. Sprinkle with parsley before serving.",
        "In a large pot or Dutch oven, sear the ground chuck and beef cubes in the butter using the same method as above. Load the pot the same as above. Bring to a very low simmer over medium heat, cover and simmer until the onions are tender, about 6 hours.",
        "At the 6-hour mark, add the potatoes, carrots and remaining 1/2 cup beer. Reduce the heat to low, cover and cook until the potatoes and carrots are tender, about 2 hours. Skim any fat off the top (see Cook's Note), then spoon the stew atop your choice of serving options. Sprinkle with parsley before serving."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "1 pound ground chuck (80 percent beef, 20 percent fat)",
        "Kosher salt",
        "2 pounds top round beef, cut into 1-inch cubes",
        "1/4 cup all-purpose flour",
        "8 to 10 sprigs fresh thyme",
        "4 to 6 fresh sage leaves",
        "2 sprigs fresh oregano",
        "1 pound pearl onions, peeled",
        "2 cups beef stock",
        "1/2 teaspoon red chili flakes",
        "8 to 10 whole black peppercorns",
        "4 cloves garlic, halved lengthwise",
        "1 1/2 cups beer (I prefer pilsner or wheat beer)",
        "8 ounces small white potatoes",
        "8 ounces baby carrots",
        "2 cups cooked rice",
        "1 package egg noodles, cooked",
        "2 to 4 warmed French baguettes, torn into chunks to sop",
        "2 pounds zucchini \"pasta\"",
        "4 spaghetti squash, cooked",
        "1/2 cup chopped fresh parsley, for sprinkling"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beef Stew",
        "Beef",
        "Meat",
        "Stew Recipes",
        "Main Dish Recipes"
    ],
    "title": "Sunny's Easy Beefy Stew",
    "url": "http://www.foodnetwork.com/recipes/sunny-anderson/sunnys-easy-beefy-stew"
}
