{
    "directions": [
        "Preheat the oven to 375 degrees F. Grease the sides and bottom of a 10-inch round cake pan with butter.",
        "For the filling: In a bowl, add the brown sugar, pecans, diced apple, lemon zest, cinnamon, nutmeg, cardamom and a pinch of salt. Stir until combined.",
        "In a small pot, melt the 2 tablespoons butter with a pinch of salt. Lightly dust a clean work surface with flour. Flatten the puff pastry and roll with a rolling pin to even out and seal the perforations, if any. Brush the butter all over the puff pastry, leaving a 1-inch border at one of the shorter ends. Sprinkle the apple-cinnamon mixture evenly over the pastry sheet, being careful to leave that 1-inch border. Starting from the end furthest from the edge without any filling, begin to tightly roll the pastry. Tuck and press as you go, keeping the log as even as possible. When the edge is reached, roll the pastry onto itself and press firmly, even pinching, to seal. Using a serrated knife, trim the edges and gently cut 6 equal slices from each log. Repeat with the second puff pastry sheet to make 12 pieces total.",
        "Place the slices spiral side up in the prepared cake pan. Start around the edges and fill in the center. Bake until the pastry is cooked through and golden brown, 35 to 40 minutes.",
        "Meanwhile, for the glaze: In a small pot, add the butter and melt over low heat. Add the vanilla extract and lemon juice and begin whisking in the powdered sugar in 1/4 cup increments. Continue adding and whisking between additions until the glaze thickens. Season with a pinch of salt, then remove from the heat.",
        "Remove the buns from the oven and pour the glaze over the top. Let rest about 5 minutes before serving. Serve warm."
    ],
    "ingredients": [
        "2 tablespoons butter, plus more for greasing pan",
        "3/4 cup light brown sugar",
        "1 cup chopped pecans",
        "1 honeycrisp or Fuji apple, peeled, cored and diced",
        "1 lemon, zested",
        "3 teaspoons ground cinnamon",
        "1/8 teaspoon freshly ground nutmeg (8 scrapes on a fine grater)",
        "1/8 teaspoon ground cardamom",
        "Generous pinch of salt",
        "Pinch of salt",
        "Flour, for dusting",
        "2 puff pastry sheets, thawed",
        "1 1/2 tablespoons butter, melted",
        "1/4 teaspoon vanilla extract",
        "1 1/2 tablespoons fresh lemon juice",
        "3/4 to 1 cup powdered sugar",
        "Pinch of salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Breakfast Recipes",
        "Easy Recipes",
        "Easy Brunch Recipes",
        "Brunch",
        "Pastry Recipes",
        "Apple",
        "Fruit"
    ],
    "title": "Sunny's Easy Glazed Cinnamon Buns",
    "url": "http://www.foodnetwork.com/recipes/sunny-anderson/sunnys-easy-glazed-cinnamon-buns-recipe"
}
