{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.",
        "Open the cans of sweet roll dough and unroll the dough from each can into 3 strands. Working on a clean surface, place 3 dough strands side by side and gather them together to make one large strand. Fold this in half, and roll slightly to make a fat log. Repeat steps with the remaining dough. Place each log on the prepared baking sheet and shape to make a ring, overlapping the ends and pinching them together to make a complete circle. Pat the dough into shape as necessary to make the ring even in size all the way around. Cover loosely with foil.",
        "Bake in preheated oven until firm to the touch and golden brown, 50 to 60 minutes. Check often for doneness so the ring doesn't overbake. Place on a wire rack and cool completely.",
        "Place the cake ring on a serving plate. Cut a slit along the inside of the ring and insert a small plastic baby, pushing it far enough into the cake to be hidden from view.",
        "Divide the frosting evenly between 4 bowls. Stir 1 tablespoon of milk into each bowl to thin the frosting. Use the frosting in one bowl to drizzle over the cooled cake. To the remaining three bowls of frosting, stir yellow food coloring into one and green into another. Stir the red and blue food colorings together with the frosting in a third bowl to make purple frosting. Drizzle the cake with yellow, green, and purple frostings in any desired pattern. Dust the cake with multi-colored sprinkles and decorate with beads, additional plastic babies, curly ribbon, and other festive trinkets."
    ],
    "ingredients": [
        "3 (14 ounce) cans refrigerated sweet roll dough",
        "2 (12 fluid ounce) cans creamy vanilla ready-to-spread frosting",
        "1/4 cup milk",
        "2 drops green food coloring",
        "2 drops yellow food coloring",
        "1 drop red food coloring",
        "1 drop blue food coloring",
        "1/2 cup multi-colored sprinkles"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Super Easy Mardi Gras King Cake",
    "url": "http://allrecipes.com/recipe/60241/super-easy-mardi-gras-king-cake/"
}
