{
    "directions": [
        "Heat a large skillet over medium high heat. Add oil and meat to the pan. Spread the meat around the pan and begin to break it up. Combine brown sugar and steak seasoning. Add sugar and spice mixture to the skillet and combine. When the meat has browned, add onion and red peppers to the skillet. Reduce heat to medium and cook onions, peppers, red wine vinegar and Worcestershire sauce with meat for 5 minutes. Add tomato sauce and paste to pan. Stir to combine. Reduce heat to simmer and cook Sloppy Joe mixture 5 minutes longer. Using a large spoon or ice cream scoop, pile sloppy meat onto toasted, buttered bun bottoms and cover with bun tops. Serve with your favorite sides or sliced tomatoes seasoned with salt and pepper, dill pickles and Deviled Potato Salad. Have plenty of napkins on hand!",
        "Boil potatoes in water seasoned with coarse salt until they are tender, about 10 minutes. Drain cooked potatoes and return to the warm pot to dry them out. Let the potatoes stand 2 minutes, then spread potatoes out on to a cookie sheet to quick-cool them.",
        "In the bottom of a medium mixing bowl, grate 1/4 onion using a hand grater. Add mustard and mayonnaise, paprika and cayenne pepper sauce to the grated onion and stir to combine. Add potatoes to the bowl and stir to evenly distribute dressing. Season potato salad with salt and pepper and taste to adjust your seasonings. Top servings of salad with chopped scallions."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil, 1 turn of the pan",
        "1 1/4 pounds ground beef sirloin",
        "1/4 cup brown sugar",
        "2 teaspoons to 1 tablespoon steak seasoning blend, such as McCormick brand Montreal Seasoning",
        "1 medium onion, chopped",
        "1 small red bell pepper, chopped",
        "1 tablespoon red wine vinegar",
        "1 tablespoon Worcestershire sauce",
        "2 cups tomato sauce",
        "2 tablespoons tomato paste",
        "4 crusty rolls, split, toasted, and lightly buttered",
        "Garnish: sliced ripe tomatoes, pickles, Deviled Potato Salad, recipe follows",
        "5 all-purpose potatoes, peeled and diced",
        "Coarse salt",
        "1/4 onion",
        "3 tablespoons prepared yellow mustard",
        "1/2 cup mayonnaise, eyeball the amount",
        "1 teaspoon sweet paprika",
        "1 teaspoon hot cayenne pepper sauce (recommended: Tabasco or Frank's Red Hot)",
        "Salt and freshly ground black pepper",
        "2 scallions, thinly sliced, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "American",
        "Sandwich",
        "Meat",
        "Sauteing Recipes",
        "Kid-Friendly"
    ],
    "title": "Super Sloppy Joes",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/super-sloppy-joes-recipe4"
}
