{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Grease 24 muffin cups or line with paper liners.",
        "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels and crumble. Measure 1 1/2 cups bacon pieces and reserve the rest for garnish.",
        "Stir flour, sugar, chocolate chips, baking soda, baking powder, and salt together in a bowl; make a well in the center. Whisk coffee, buttermilk, bacon grease, and eggs together in a separate bowl; pour into the flour mixture well. Stir until batter is just combined; fold in reserved 1 1/2 cups bacon. Spoon batter into the prepared muffin cups.",
        "Bake in the preheated oven until tops spring back when lightly pressed, 20 to 25 minutes. Cool cupcakes in the muffin tin set on a wire rack.",
        "Beat cream cheese and butter together in a bowl using an electric mixer until smooth and creamy. Stir confectioners' sugar, maple extract, and vanilla extract into creamed butter mixture until frosting is smooth.",
        "Arrange cooled cupcakes on a serving platter and spread frosting over each cupcake; sprinkle with reserved bacon pieces."
    ],
    "ingredients": [
        "Cupcakes:",
        "24 slices bacon",
        "2 cups whole wheat flour",
        "2 cups demerara sugar",
        "1 cup dark chocolate chips",
        "2 teaspoons baking soda",
        "1 teaspoon baking powder",
        "1/2 teaspoon sea salt",
        "1 cup cold, strong, brewed coffee",
        "1 cup buttermilk",
        "1/2 cup bacon grease",
        "2 eggs",
        "Frosting:",
        "1 (8 ounce) package cream cheese, softened",
        "1/4 cup butter, softened",
        "3 cups confectioners' sugar",
        "1 1/2 teaspoons maple-flavored extract",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Super Baconator Cupcakes",
    "url": "http://allrecipes.com/recipe/236008/super-baconator-cupcakes/"
}
