{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Mix together ground beef, bread crumbs, egg, 1/2 a chopped onion, milk, Worcestershire sauce in a bowl; season with garlic, Italian seasoning, dry mustard, salt, and black pepper. Transfer the meat mixture to a piece of waxed paper or aluminum foil and flatten to a 1/2-inch thick rectangle.",
        "Melt butter in a skillet over medium heat. Cook and stir yellow onion and mushrooms in melted butter until the onion is translucent and mushrooms soft, about 5 minutes. Remove from heat to cool.",
        "Spread filling mixture into center of meat rectangle. Sprinkle Cheddar cheese over filling, leaving a bit of space at one end for easier rolling and sealing. Pick up the edge of the waxed paper or foil to roll the flattened meat into a log around the filling. Seal the ends and seam and place the loaf into a 9x5-inch loaf pan.",
        "Bake in the preheated oven until oil from the cheese begins to pool, about 30 minutes. Drain oil and continue baking until the meat is no longer pink in the center, about 30 to 60 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C)."
    ],
    "ingredients": [
        "Meatloaf:",
        "1 1/2 pounds ground beef",
        "1 1/3 cups dry bread crumbs",
        "1 egg, slightly beaten",
        "1/2 onion, finely chopped",
        "1/4 cup milk",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon chopped fresh garlic",
        "1 1/2 teaspoons Italian seasoning",
        "1 teaspoon dry mustard",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "Filling:",
        "1 tablespoon butter",
        "1 yellow onion, chopped",
        "1 (6 ounce) package portobello mushroom caps, chopped",
        "1 cup shredded Cheddar cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Super Stuffed Meatloaf",
    "url": "http://allrecipes.com/recipe/232576/super-stuffed-meatloaf/"
}
