{
    "directions": [
        "Peel potatoes and carrots and cut into 1/2 inch cubes.  In a small pot of salted boiling water, cook the potato and carrot cubes until they are tender, about 10 minutes. Drain them, and run under cold water for a few seconds",
        "In a heavy skillet, heat the olive oil over medium heat. Add the onions, and cook them, stirring frequently for 5 minutes or until they have softened. Add the garlic, and saute for 1 minute. Add the spinach in two or three batches, letting each batch wilt before you add more.",
        "Take the spinach mixture off the heat and spoon it into a food processor. Add the cottage cheese, nutmeg, salt and pepper and adjust the seasonings, if you like. Puree the mixture well.",
        "Preheat the oven to 400 degrees F (200 degrees C).",
        "Lay a sheet of phyllo on your work surface and brush it lightly with melted butter. Place another sheet of phyllo on top and butter it. Do the same with the third and fourth sheets. Cut the layered phyllo in half crosswise, so that the pieces are 8 1/2 by 11 inches.",
        "Spoon the spinach filling into a shallow casserole approximately 8 by 10 inches in size. Add the potatoes and carrots, and stir them in.",
        "Place the phyllo layers over the filling. Turn under the edges as necessary to fit the pan.",
        "Bake the pie at 400 degrees F (200 degrees F) for 20 minutes or until the phyllo is golden brown. Cut the pie into portions and serve."
    ],
    "ingredients": [
        "1 baking potato",
        "1 large carrot",
        "1 tablespoon olive oil",
        "2 cups chopped onion",
        "1 clove garlic, minced",
        "10 ounces spinach, rinsed",
        "1 cup low-fat cottage cheese",
        "2 pinches ground nutmeg",
        "1/2 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "4 sheets phyllo dough",
        "3 tablespoons unsalted butter, melted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Super Spinach Pie",
    "url": "http://allrecipes.com/recipe/12628/super-spinach-pie/"
}
