{
    "directions": [
        "Carefully prick the goose on all sides with a skewer, taking care to avoid piercing the flesh. Fill a pot large enough to hold the goose 2/3 full of water, and bring to a boil. Submerge bird neck side down for 1 minute, until goose bumps arise on the goose. Turn goose tail side down, and repeat the process. Remove goose from the pot, and drain. Place breast side up on a rack in a large roasting pan. Set in the refrigerator, uncovered, to dry the skin for 24 to 48 hours.",
        "Cook the rice the night before roasting the goose: place the rice in a pot with 5 cups water, and bring to a boil. Reduce heat to low, cover, and simmer 45 minutes. Refrigerate overnight.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Melt the butter in a skillet over medium heat, and cook the onion until tender. Mix in cooked rice, mushrooms, and egg. Season mixture with poultry seasoning, salt, and pepper. Sprinkle the goose inside and out with salt and pepper. Fill goose cavities with the stuffing. Seal cavities with kitchen twine, and place the goose breast side down on a rack in a roasting pan.",
        "Roast bird 1 1/2 hours in the preheated oven; do not open the oven door. Remove bird from the oven, and use a baster to remove the fat that has accumulated in the bottom of the pan. Turn bird on it's back in the roasting pan, and continue roasting 1 hour, or until the internal temperature when tested with a meat thermometer has reached a minimum of 180 degrees F (82 degrees C).",
        "Increase the oven temperature to 400 degrees F (200 degrees C). Remove goose from the oven, and transfer to a larger pan. Return to the oven for 15 minutes to further crisp and brown the bird. Take out  the goose, and let it sit uncovered for 30 minutes before removing stuffing.",
        "To make gravy, place the original roasting pan over 2 burners. Mix in 2/3 cup of dry sherry, and scrape the pan with a wooden spoon. Combine these drippings with giblet broth to make a gravy for the goose and stuffing."
    ],
    "ingredients": [
        "1 (10 pound) fresh goose",
        "1 1/2 cups wild rice",
        "5 cups cold water",
        "1 tablespoon butter",
        "1 onion, chopped",
        "2 1/2 cups fresh sliced shiitake mushrooms",
        "1 egg",
        "1 tablespoon poultry seasoning",
        "salt and freshly ground black pepper to taste",
        "2/3 cup dry sherry",
        "2 cups giblet gravy"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Super Crispy Roasted Goose",
    "url": "http://allrecipes.com/recipe/9318/super-crispy-roasted-goose/"
}
