{
    "directions": [
        "Whisk all ingredients in medium bowl to blend.",
        "Place fish and lamb in separate medium glass or stainless steel bowls. Add 2/3 cup marinade to each; toss to coat. Chill at least 30 minutes and up to 1 hour, stirring occasionally. Reserve remaining marinade for basting and making sauce.",
        "Drain fish. Alternate 2 fish cubes, 2 tomato halves, 2 peach wedges, and 2 onion bottoms on each of 8 skewers.",
        "Drain lamb. Alternate 2 lamb cubes, 2 bell pepper squares, 2 eggplant cubes, and 2 zucchini rounds on each of 8 skewers. (Kebabs can be assembled 2 hours ahead. Arrange on 2 rimmed baking sheets. Cover; chill.)",
        "Spray grill rack with nonstick spray, then prepare barbecue (medium-high heat). Transfer 1 cup reserved marinade to small saucepan for sauce. Grill kebabs until slightly charred and cooked as desired, turning occasionally and basting with remaining marinade, about 8 minutes for fish and 10 minutes for lamb. Transfer kebabs to platter.",
        "Bring marinade in saucepan to boil. Reduce heat to medium-low. Whisk in butter, 1 slice at a time, allowing each to melt before adding next (do not boil). Season butter sauce to taste with pepper. Serve sauce with kebabs."
    ],
    "ingredients": [
        "1/2 cup fresh lime juice",
        "1/2 cup olive oil",
        "1/2 cup dry Sherry",
        "1/2 cup chopped fresh cilantro",
        "6 tablespoons soy sauce",
        "6 tablespoons honey",
        "4 garlic cloves, pressed",
        "2 tablespoons Dijon mustard",
        "2 tablespoons grated fresh ginger",
        "1 teaspoon dried crushed red pepper",
        "1 1/2 pounds swordfish, cut into sixteen 1 1/2-inch cubes",
        "1 1/2 pounds boneless leg of lamb, cut into sixteen 1 1/2-inch cubes",
        "8 plum tomatoes, halved crosswise",
        "2 large peaches with skin, halved, pitted, each half cut into 4 wedges",
        "16 3-inch-long green onion bottoms",
        "1 large red bell pepper, seeded, cut into 16 squares",
        "1 1-pound eggplant, cut into sixteen 1 1/2-inch cubes",
        "3 small zucchini, trimmed, cut into sixteen 1/2-inch-thick rounds",
        "Nonstick vegetable oil spray",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 8 slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Onion",
        "Tomato",
        "Marinate",
        "Quick & Easy",
        "Lime",
        "Peach",
        "Eggplant",
        "Bell Pepper",
        "Zucchini",
        "Summer",
        "Grill/Barbecue",
        "Cilantro",
        "Swordfish"
    ],
    "title": "Surf 'n' Turf Kebabs with Cilantro-Lime Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/surf-n-turf-kebabs-with-cilantro-lime-sauce-232555"
}
