{
    "directions": [
        "Bring water and rice to a boil in a large pot. Reduce heat to medium-low, cover, and simmer until the rice is tender and liquid has been absorbed, about 25 minutes. Remove pot from heat and keep covered for 10 minutes.",
        "Stir 5 1/2 tablespoons rice vinegar, sugar, and salt together in a microwave-safe bowl; microwave until vinegar mixture is warmed, 30 to 45 seconds. Stir well. Add vinegar mixture to rice and toss thoroughly to coat each grain of rice; cool completely.",
        "Heat 1 teaspoon vegetable oil in a small skillet over medium heat; cook eggs in hot oil until firm, 3 to 5 minutes. Transfer eggs to a plate and cut into strips.",
        "Heat 1 tablespoon vegetable oil, sake, 1 tablespoon soy sauce, and sesame oil in a skillet over medium heat; fry eggplant in oil mixture until softened and lightly charred, 5 to 10 minutes. Transfer eggplant to a paper towel-lined plate.",
        "Mix carrot, 1 tablespoon rice vinegar, and 1 tablespoon soy sauce together in a microwave-safe bowl; microwave until carrot is softened, 1 to 2 minutes. Drain.",
        "Bring a large pot of lightly salted water to a boil; add asparagus and cook until bright green, 2 to 3 minutes. Drain and immediately immerse asparagus in ice water for several minutes to stop the cooking process. Drain.",
        "Cut avocado into 8 slices and drizzle lemon juice over slices in a bowl.",
        "Lay nori sheets on a flat work surface, wet hands, and spread 3/4 to 1 cup rice onto each sheet. Press rice into a thin layer, leaving 1/2-inch exposed nori on 1 long side.",
        "For California rolls, layer crabmeat, avocado, cucumber, and carrot atop one another in a thin strip along the edge opposite the uncovered edge on 3 nori sheets.",
        "For eggplant and avocado rolls, layer eggplant and avocado atop one another in a thin strip along the edge opposite the uncovered edge on 3 nori sheets.",
        "For pesto and egg rolls, spread pesto in a thin strip along the edge opposite the uncovered edge and top with egg slices on 3 nori sheets.",
        "For shrimp and asparagus rolls, layer shrimp and asparagus atop one another in a thin strip along the edge opposite the uncovered edge on 3 nori sheets.",
        "Transfer 1 prepared nori to a bamboo sushi mat. Use the mat to roll the nori and rice around the filling toward the exposed nori edge, squeezing gently. Wet the exposed nori edge and seal the roll. Slice each roll into 8 pieces. Repeat with remaining prepared nori."
    ],
    "ingredients": [
        "Rice:",
        "9 3/4 cups water",
        "5 1/2 cups Japanese sushi-style white rice",
        "5 1/2 tablespoons rice vinegar",
        "5 1/2 tablespoons white sugar",
        "2 3/4 tablespoons kosher salt",
        "Filling:",
        "1 teaspoon vegetable oil",
        "2 eggs, beaten",
        "1 tablespoon vegetable oil",
        "1 tablespoon sake",
        "1 tablespoon soy sauce",
        "2 tablespoons sesame oil",
        "1 eggplant, sliced lengthwise into strips",
        "1 carrot, sliced into thin strips",
        "1 tablespoon rice vinegar",
        "1 tablespoon soy sauce",
        "8 spears fresh asparagus",
        "1 avocado",
        "1 tablespoon lemon juice, or as needed",
        "12 sheets nori (dry seaweed)",
        "1 (8 ounce) package imitation crabmeat strips, halved lengthwise",
        "1 cucumber, seeded and sliced lengthwise into strips",
        "1 (4 ounce) jar pesto",
        "8 large cooked shrimp, coarsely chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sushi Party",
    "url": "http://allrecipes.com/recipe/234351/sushi-party/"
}
