{
    "directions": [
        "Using a food grinder, grind together the green tomatoes, red peppers, green peppers, onions, apples, and cucumbers into a large food-safe container. Mix in 1 scant cup salt, and let stand overnight.",
        "The next day, drain off the excess liquid from the ground vegetable mixture.",
        "Bring the vinegar to a boil in a large kettle or stockpot. Place the allspice, cloves, mustard, 1 tablespoon of salt, cinnamon, and turmeric into a closely-woven cloth bag, and place the bag into the hot vinegar to boil for about 15 minutes. Remove the spice bag, and stir in the sugar until dissolved. Add the ground vegetable mixture, bring back to a boil, and simmer over medium-low heat, stirring frequently to prevent burning, until the relish is soft and slightly darkened in color, about 20 minutes.",
        "Sterilize pint canning jars and lids in boiling water for at least 5 minutes. Pack the relish into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large canning kettle, and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 5 minutes.",
        "Remove the jars from the kettle and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "13 1/4 pounds green tomatoes, cored and cut into chunks",
        "5 red bell peppers, seeded and cut into chunks",
        "4 green bell peppers, seeded and cut into chunks",
        "2 large onions, peeled and cut into chunks",
        "6 apples, cored and cut into chunks",
        "3 large cucumbers - peeled, seeded, and cut into chunks",
        "1 cup salt (scant)",
        "2 quarts distilled white vinegar",
        "1 tablespoon ground allspice",
        "1 tablespoon ground cloves",
        "1 tablespoon ground mustard",
        "1 tablespoon salt",
        "1 tablespoon ground cinnamon",
        "1 tablespoon ground turmeric",
        "5 pounds white sugar",
        "11 (1 pint) canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Suzy's Green Tomato Relish",
    "url": "http://allrecipes.com/recipe/206693/suzys-green-tomato-relish/"
}
