{
    "directions": [
        "In a large bowl combine water, butter, and sugar. Sprinkle yeast over mixture and let stand 5 minutes, or until foamy. Stir in eggs, salt and dry milk until combined. With a wooden spoon stir in 5 sups flour, 1 cup at a time, and stir mixture until a dough is formed.",
        "On a floured surface, knead dough about 10 minutes, adding enough of the remaining 1 cup flour to make dough smooth and elastic. Put dough in a lightly oiled bowl, turning to coat, and let rise, covered with plastic wrap, in a warm place until doubled in bulk, about 1 hour.",
        "Punch down dough and on floured surface with a floured rolling pin roll into a 15- by 20-inch rectangle. Spread butter over dough and sprinkle with granulated sugar, cinnamon and cardamom.",
        "With a long side facing you, roll up dough jelly-roll fashion and cut crosswise into approximately 1 1/2-inch-thick slices with a cut side down. Working with 1 slice at a time gently twist opposite ends of slice around twice to form a figure eight. Crimp ends together. Arrange rolls, a swirled side up, on a buttered baking sheet about 2 inches apart and let rise in a warm place until increased 1 1/2 times in bulk, about 1 hour.",
        "While rolls are rising, preheat oven to 350F.",
        "Brush tops of rolls with egg wash and sprinkle with sugar. Bake rolls in middle of oven until tops are pale golden, about 25 minutes."
    ],
    "ingredients": [
        "1 1/4 cups warm water (105°F.)",
        "3/4 stick (6 tablespoons) unsalted butter, melted and cooled slightly",
        "6 tablespoons granulated sugar",
        "two 1/4-ounce packages active dry yeast (about 4 1/2 teaspoons total)",
        "3 large eggs beaten lightly",
        "1 1/2 teaspoons salt",
        "1/4 cup powdered nonfat dry milk",
        "5 to 6 cups all-purpose flour",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1/2 cup granulated sugar",
        "2 tablespoons ground cinnamon",
        "3 tablespoons cardamom seeds, ground in a mortar with a pestle, or in an electric spice/coffee grinder",
        "an egg wash made by beating 1 large egg with 2 tablespoons water",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Dairy",
        "Egg",
        "Breakfast",
        "Brunch",
        "Bake",
        "Cinnamon",
        "Seed",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Swedish Cardamom Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/swedish-cardamom-rolls-14327"
}
