{
    "directions": [
        "Cook onion in oil in a 12-inch deep heavy skillet over moderate heat, stirring occasionally, until golden, 12 to 15 minutes. Add tomatoes with juice, lemon juice, brown sugar, cherries, salt, and pepper and simmer, uncovered, breaking up tomatoes into smaller pieces with a wooden spoon and stirring occasionally, 30 minutes.",
        "Immerse whole heads of cabbage, 1 at a time if necessary, in a large pot of boiling salted water and cook until leaves are tender but still hold their shape, about 5 minutes. Transfer cabbages with a large slotted spoon to a large bowl of ice and cold water to stop cooking, then drain in a colander. Separate leaves, then cut off and reserve tough stem ends. Discard core. Pat leaves dry with paper towels.",
        "Stir together beef, rice, water, onion, salt, and pepper. Spread out 1 large cabbage leaf on a work surface and put 2 tablespoons filling in center. Fold both sides of leaf toward center (over filling), then fold stem over filling and roll tightly into a cylinder. Stuff remaining cabbage leaves in same manner, using less filling for smaller leaves. Chop any unused leaves and reserved stem ends and stir into simmering sauce.",
        "Arrange stuffed cabbage rolls, seam sides down, in 1 layer over sauce and simmer, covered, 1 1/2 hours."
    ],
    "ingredients": [
        "1 large onion (1 lb), halved and thinly sliced crosswise",
        "3 tablespoons vegetable oil",
        "1 (28- to 32-oz) can whole tomatoes including juice",
        "3 tablespoons fresh lemon juice",
        "3 tablespoons packed dark brown sugar",
        "1/2 cup dried sour cherries",
        "2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "2 lb wrapped-heart mustard cabbage (2 heads)",
        "1 lb ground chuck (preferably not lean)",
        "3 tablespoons long-grain rice",
        "3 tablespoons water",
        "1/4 cup grated onion",
        "2 teaspoons salt",
        "1/4 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Beef",
        "Leafy Green",
        "Rice",
        "Sauté",
        "Rosh Hashanah/Yom Kippur",
        "Winter",
        "Simmer",
        "Gourmet"
    ],
    "title": "Sweet-and-Sour Stuffed Mustard Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-and-sour-stuffed-mustard-cabbage-107746"
}
