{
    "directions": [
        "Preheat the oven to 200°C (400°F/gas mark 6).",
        "Place the sweet potatoes in a baking tin, drizzle over 1 tablespoon of the sunflower oil and roast for 20–30 minutes, until tender. Set aside.",
        "Heat the remaining 1 tablespoon of oil in a pan over a medium heat. Add the onion, leek, lemon grass, half the chilli and the ginger and sweat for 4 minutes, stirring occasionally. Add the roasted sweet potato with the stock and tomato purée, then bring to the boil. Reduce the heat and simmer for 10 minutes, until the liquid has slightly reduced and all the vegetables are completely tender.",
        "Pour the coconut milk into the pan, reserving about 3 tablespoons from the top of the can as a garnish, and cook for another 5 minutes, stirring constantly. Season to taste. Remove the lemon grass and then blend with a hand blender until smooth.",
        "To serve, ladle the soup into warmed bowls and swirl in the reserved coconut milk. Add a drizzle of the chilli oil, then sprinkle over the reserved chilli slices and micro coriander."
    ],
    "ingredients": [
        "450g (1lb) sweet potatoes, cut into cubes",
        "2 tbsp sunflower oil",
        "1 onion, finely chopped",
        "1 leek, trimmed and finely chopped",
        "1 lemon grass stalk, trimmed and halved",
        "1 red chilli, halved, seeded and thinly sliced",
        "1 tsp freshly grated root ginger",
        "1.25 litres (2 1/4 pints) vegetable stock",
        "4 tsp tomato purée",
        "400g can coconut milk",
        "sea salt and freshly ground black pepper",
        "chilli oil , to garnish",
        "fresh micro coriander, to garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Ginger",
        "Sweet Potato/Yam",
        "Lemongrass",
        "Simmer"
    ],
    "title": "Sweet Potato and Coconut Soup",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-and-coconut-soup-51229610"
}
