{
    "directions": [
        "Preheat oven to 450°F. and butter a 2-quart shallow baking dish.",
        "Prick each potato with a fork 3 times and bake on a sheet in middle of oven about 1 hour, or until very tender.",
        "While potatoes are baking, in a bowl wash quinoa in at least 5 changes cold water, rubbing grains and letting them settle before pouring off most of water, until water runs clear and drain in a fine sieve.",
        "In a saucepan combine quinoa with 2 cups salted water and bring to a boil. Simmer quinoa, covered, until all liquid is absorbed, about 15 minutes, and remove lid.",
        "In a skillet heat 1 tablespoon oil over moderate heat and cook bread crumbs until golden brown. Season crumbs with salt and pepper.",
        "While quinoa is cooking, finely chop reserved Swiss chard stems and coarsely chop leaves, keeping both separate. In a deep heavy 12-inch kettle heat remaining 3 tablespoons oil over moderate heat and cook stems until tender, about 5 minutes. Stir in leaves, a handful at a time, and stir in garlic, tossing. Cook leaves until just wilted, about 4 minutes. Remove kettle from heat and stir in quinoa until combined well. Season mixture with salt and pepper.",
        "Reduce temperature to 350°.F.",
        "When potatoes are cool enough to handle, peel and mash with a fork. Season potatoes with salt and pepper.",
        "With a large spoon drop mounds of potatoes and Swiss chard mixture in baking dish, alternating them decoratively to cover bottom, and smooth top. Top gratin with bread crumbs.",
        "Bake gratin in middle of oven about 30 minutes, or until hot. Cool gratin 5 minutes before serving."
    ],
    "ingredients": [
        "1 1/2 pounds sweet potatoes (about 3)",
        "1 cup quinoa*",
        "4 tablespoons olive oil",
        "2 cups coarse fresh breadcrumbs",
        "2 1/2 pounds Swiss chard, washed well and stems trimmed, removed, and reserved",
        "3 tablespoons minced garlic (about 6 cloves), or to taste",
        "*available at natural foods stores and specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Leafy Green",
        "Side",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "High Fiber",
        "Casserole/Gratin",
        "Quinoa",
        "Sweet Potato/Yam",
        "Winter",
        "Christmas Eve",
        "Gourmet",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet Potato, Swiss Chard, and Quinoa Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-swiss-chard-and-quinoa-gratin-11436"
}
