{
    "directions": [
        "In a kettle cook the onion, the leek, the garlic, and the carrots with the bay leaf and salt and pepper to taste in the butter over moderate heat, stirring, until the vegetables are softened. Add the sweet potatoes, peeled, halved lengthwise, and sliced thin, the russet potato, peeled, halved lengthwise, and sliced thin, the 5 cups broth, the wine, and the water, simmer the mixture, covered for 15 to 20 minutes, or until the potatoes are very tender, and discard the bay leaf. In a blender puree the mixture in batches until it is very smooth, transferring it as it is pureed to a large saucepan, add the additional broth to thin the soup to the desired consistency, and season the soup with salt and pepper. The soup may be made 1 day in advance, kept covered and chilled, and reheated.",
        "In a skillet cook the pecans in the butter with salt to taste over moderate heat, stirring occasionally, for 10 minutes, or until they are golden brown, and transfer them to paper towels to drain. The pecans may be made 2 days in advance and kept in an airtight container or a resealable plastic bag.",
        "Divide the soup among bowls and top each serving with a dollop of the crème fraîche and some of the buttered pecans."
    ],
    "ingredients": [
        "3/4 cup finely chopped onion",
        "1 cup finely chopped leek, washed well and drained",
        "2 large garlic cloves, minced",
        "3 large carrots, sliced thin (about 1 1/2 cups)",
        "1 bay leaf",
        "3 tablespoons unsalted butter",
        "2 pounds (about 3 large) sweet potatoes",
        "a 1/2-pound russet (baking) potato",
        "5 cups chicken broth plus additional for thinning the soup if desired",
        "3/4 cup dry white wine",
        "1 1/2 cups water",
        "3/4 cup chopped pecans",
        "2 tablespoons unsalted butter",
        "crème fraîche or sour cream as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Thanksgiving",
        "Pecan",
        "Sweet Potato/Yam",
        "Gourmet"
    ],
    "title": "Sweet Potato Soup with Buttered Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-soup-with-buttered-pecans-13324"
}
