{
    "directions": [
        "Preheat the oven to 425°F/220°C.",
        "Place the orange juice in a saucepan with the sugar and vinegar. Bring to a boil over high heat, then turn down the heat to medium-high and simmer fairly rapidly for about 20 minutes, until the liquid has thickened and reduced to scant 1 cup/200 ml (about the amount in a large glass of wine). Add the bitters, olive oil, and 1 1/2 teaspoons salt.",
        "Place the potatoes in a large bowl, add the chiles, sage, thyme, and garlic, and then pour in the reduced sauce. Toss well so that everything is coated and then spread the mixture out in a single layer on a baking sheet on which it fits snugly, about 12 by 16 inches/30 by 40 cm.",
        "Place in the oven and roast for 50 to 60 minutes, turning and basting the potatoes every 15 minutes or so. They need to remain coated in the liquid in order to caramelize, so add more orange juice if the pan is drying out. At the end, the potatoes should be dark and sticky. Remove from the oven and leave to cool slightly before arranging on a platter and dotting with the goat cheese. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups/350 ml freshly squeezed orange juice (the juice of 4 to 5 oranges)",
        "1/3 cup/80 g brown sugar",
        "1/4 cup/60 ml red wine vinegar",
        "1/4 cup/60 ml Angostura bitters",
        "1 1/2 tablespoon olive oil",
        "Salt",
        "4 to 5 sweet potatoes, unpeeled, halved crosswise, each half cut into 1-inch-/2.5-cm-wide wedges (3 1/3 pounds/1.5 kg)",
        "2 red chiles, halved lengthwise",
        "3 sage sprigs (1/2 ounce/15 g)",
        "10 thyme sprigs (1/3 ounce/10 g)",
        "2 heads garlic, unpeeled and halved horizontally",
        "3 ounce/90 g chèvre (goat cheese) log, broken into pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Low Fat",
        "Vegetarian",
        "Low Cal",
        "Sweet Potato/Yam",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet Potatoes with Orange Bitters",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potatoes-with-orange-bitters-51254470"
}
