{
    "directions": [
        "Cook sweet potatoes in large pot of boiling salted water until just tender but still firm, about 15 minutes. Drain and refrigerate until cold, at least 2 hours. (Can be made 1 day ahead; keep refrigerated.)",
        "Line large baking sheet with parchment paper. Peel potatoes and coarsely grate into large bowl. Stir in green onions. Whisk eggs, flour, salt, and pepper in small bowl. Gently mix into potato mixture. Form mixture into 48 walnut-size balls; transfer to prepared baking sheet. (Can be made 6 hours ahead. Cover and refrigerate.)",
        "Heat 3 tablespoons oil in large nonstick skillet over medium-high heat. Place 8 potato balls in skillet, pressing each gently with spatula to flatten to 1 1/2-inch diameter. Cook until pancakes are rich golden brown, about 2 minutes per side. Transfer to paper towels to drain. Repeat with remaining potato balls, adding more oil to skillet if necessary. Transfer pancakes to platter. Top each with 1 teaspoon sour cream and scant 1/4 teaspoon caviar. Garnish with chives. Serve warm or at room temperature."
    ],
    "ingredients": [
        "2 pounds tan-skinned sweet potatoes (about 3 medium)",
        "3/4 cup chopped green onions",
        "2 large eggs",
        "1 1/2 tablespoons all purpose flour",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon ground black pepper",
        "3 tablespoons (or more) vegetable oil",
        "1 cup sour cream",
        "1 ounce black caviar",
        "Fresh chives, cut into 1-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Appetizer",
        "Fry",
        "Sweet Potato/Yam",
        "Fall",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sweet-Potato Pancakes with Caviar",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-pancakes-with-caviar-105768"
}
