{
    "directions": [
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the Chinese noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 5 minutes. Drain well in a colander set in the sink.",
        "Whisk together the 3 tablespoons soy sauce, 3/4 cup sweet chili sauce, 1/2 teaspoon garlic powder, the ground ginger, and the sesame oil in a large bowl; add the drained Chinese noodles and toss to coat; set aside",
        "Whisk together the 1/2 cup soy sauce and 1/2 teaspoon garlic powder in a large bowl; add the pork and stir to coat. Allow to marinate 5 minutes.",
        "Heat the cooking oil in a wok or a large, deep skillet over medium-high heat. Add the pork, onions, and red pepper flakes to the oil; cook until the pork is browned completely. Stir in 3 tablespoons sweet chili sauce, the napa cabbage, celery, carrots, and bell peppers; cook and stir until vegetables are completely heated, about 5 minutes. Whisk together the cornstarch and water and add to the stir fry, stirring until the mixture thickens. Serve the stir-fry over the noodles."
    ],
    "ingredients": [
        "12 ounces dry Chinese noodles",
        "3 tablespoons soy sauce",
        "3/4 cup sweet chili sauce",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon ground ginger",
        "3 tablespoons sesame oil",
        "1/2 cup soy sauce",
        "1/2 teaspoon garlic powder",
        "1 (1 pound) pork loin, cut into 2-inch strips",
        "2 tablespoons cooking oil",
        "2 onions, cut into bite-size pieces",
        "1/8 teaspoon crushed red pepper flakes",
        "3 tablespoons sweet chili sauce",
        "3 cups chopped napa cabbage",
        "3/4 cup sliced celery",
        "1 cup sliced carrots",
        "3 red bell peppers, chopped",
        "2 teaspoons cornstarch",
        "1/4 cup cold water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet and Spicy Pork and Napa Cabbage Stir-Fry with Spicy Noodles",
    "url": "http://allrecipes.com/recipe/187448/sweet-and-spicy-pork-and-napa-cabbage/"
}
