{
    "directions": [
        "Slice one onion into very thin strips. Combine with the vinegar in a bowl and set aside. Chop the other onion coarsely and set aside. In a mixing bowl, whisk the sour cream and milk together.",
        "In a large skillet, pour enough vegetable oil to come 1/4 inch up the sides. Heat the oil over medium heat until lightly smoking. Fry the tortillas, 1 or 2 at a time (or as many as will fit in the pan), just until crisp, about 1 minute. (You may need to add a little more oil for the last few tortillas.) Drain on paper towels.",
        "Place the stock in a saucepan and bring to a boil. Add the tomatillos and cook until tender, about 6 minutes; drain, reserving the stock. Place the tomatillos, jalapeños, chopped onion, garlic, and cilantro in a blender or food processor and blend until smooth. Season with salt.",
        "In a large skillet over medium heat, heat the vegetable shortening until lightly smoking. Pour in the tomatillo mixture and stir constantly for about 5 minutes, until thick and dark. Add the reserved stock and bring to a boil. Reduce the heat and simmer for 8 to 10 minutes; the sauce should be thick enough to coat the back of a spoon. Meanwhile, preheat the oven to 350°F.",
        "Add the sweet potato to a saucepan of boiling salted water and blanch for 3 minutes, or until tender. Drain and refresh in ice water to stop the cooking process.",
        "Line an 8-inch square baking pan with 3 tortillas; they will overlap slightly. Pour one quarter of the tomatillo sauce on top, and pour one quarter of the sour cream-milk mixture on top of the sauce. Top with one quarter of the cheese, and place a third of the poblanos and sweet potatoes over the cheese. Repeat this process with the remaining tortillas, sauce, sour cream mixture, and cheese: the top layer will not have poblanos or sweet potato.",
        "Cover the baking pan with foil and bake for 30 minutes, or until the cheese is melted and bubbly. Remove and top with the drained marinated onions. Serve with the salsa."
    ],
    "ingredients": [
        "2 small onions",
        "1/4 cup red wine vinegar or fruit vinegar",
        "1 1/2 cups sour cream",
        "1/2 cup whole milk",
        "Vegetable oil for frying",
        "12 Corn Tortillas",
        "1 1/2 cups vegetable stock, homemade or store-bought",
        "8 tomatillos, husked, rinsed, and quartered",
        "2 jalapeño chiles, seeded and chopped",
        "1 garlic clove, chooped",
        "1/2 cup chopped fresh cilantro leaves",
        "Salt to taste",
        "1 tablespoon vegetable shortening or vegetable oil",
        "1 sweet potato (about 12 ounces), peeled and finely diced",
        "1/2 cup grated Monterey Jack cheese",
        "2 poblano chiles, roasted, peeled, seeded, and diced",
        "1 cupGriddled Tomato-Chipotle Salsa"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Bake",
        "Casserole/Gratin",
        "Sweet Potato/Yam",
        "Winter",
        "Tomatillo",
        "Jalapeño",
        "Sour Cream",
        "Cilantro"
    ],
    "title": "Sweet Potato Chilaquiles with Griddled Salsa Roja",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-chilaquiles-with-griddled-salsa-roja-104138"
}
