{
    "directions": [
        "For the ketchup: Preheat the oven to 450 degrees F. Wrap the beets in foil, enclosing completely. Roast the beets until very tender when pierced with fork or skewer, 1 1/4 to 1 1/2 hours. Let the beets stand until cool enough to handle. Cut the beets into 1-inch chunks and transfer to a food processor. Add the ketchup, vinegar, olive oil, ginger, salt and pepper. Process until the mixture is smooth, 2 to 3 minutes. Transfer the beet ketchup to a small bowl. Adjust the seasoning with more salt and pepper and a pinch of allspice, if desired. (Can be prepared 1 day ahead. Cover and refrigerate).",
        "For the sweet potato strings: Using a mandoline or a V-slicer, cut the potatoes into matchstick-size strips 1/8- to 1/4-inch thick and preferably no longer than 4 to 5 inches (if the potatoes begin to discolor, place in a bowl of iced water until ready to use). Pat the potato strips completely dry. Place the flour in a large bowl. In batches, add the potato strips to the flour and toss to coat lightly. Pour the canola oil into a large wide saucepan. Attach a deep-fry thermometer to the side of the saucepan. Heat the oil between 330 to 350 degrees F. Shake off any excess flour from the potatoes. Working in batches, add the potatoes to the oil and fry until just tender and light golden, maintaining the oil temperature between 320 to 340 degrees F, 1 1/2 to 2 minutes. Using a slotted spoon or skimmer, remove the potato strings and drain on paper towels.",
        "Sprinkle the potatoes lightly with salt and mound on a platter. Serve with the beet ketchup."
    ],
    "ingredients": [
        "Three 2- to 2 1/2-inch-diameter beets, trimmed and peeled",
        "1/2 cup ketchup",
        "2 tablespoons plus 2 teaspoons balsamic vinegar",
        "2 tablespoons extra-virgin olive oil",
        "One 1/2-inch piece fresh ginger, peeled and minced",
        "1/4 teaspoon kosher salt, plus more for seasoning",
        "1/8 teaspoon freshly ground black pepper, plus more for seasoning",
        "Pinch ground allspice, optional",
        "2 pounds small to medium sweet potatoes or red garnet yams, peeled",
        "1/2 cup all-purpose flour",
        "4 cups canola oil",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sweet Potato",
        "Vegetable",
        "Beet",
        "Roasting",
        "Pureeing Recipes"
    ],
    "title": "Sweet Potato Strings with Beet Ketchup",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/sweet-potato-strings-with-beet-ketchup-recipe"
}
