{
    "directions": [
        "Combine the cream, Scotch, and salt in a measuring cup with a spout. Use a knife to scrape the seeds of the vanilla bean into the cup and stir well.",
        "Combine the granulated sugar, butter, brown sugar, corn syrup, and 1/4 cup of water in a medium saucepan with high sides. Set it over high heat and bring to a boil. Attach a candy thermometer to the pan and boil until the mixture reaches 245ºF. Remove the pan from the heat and gradually whisk in the cream mixture. Let the mixture cool to room temperature. You’ll have about 1 cup of butterscotch.",
        "Use straightaway or stir once more and keep in an airtight container in the fridge for up to 2 weeks. Gently reheat until warm before using.",
        "Cut the corn kernels from the cobs, reserving the cobs. Cut the cobs crosswise into a few pieces. Combine the kernels and cobs in a medium pot along with the cream, milk, salt, and 1/4 cup of the sugar. Bring the liquid to a simmer, stirring occasionally, over medium-high heat, then turn off the heat, cover the pot, and let the mixture steep at room temperature for at least 2 hours or in the fridge for as long as 12 hours. Remove the cobs, gently scraping them with a spoon to get at any liquid that may be hiding in them, and discard the cobs. Strain the remaining mixture through a sieve into a clean medium pot, stirring and pressing on the kernels to release as much corn flavor as possible. Discard the kernels.",
        "Bring the milk mixture to a simmer over medium heat and turn off the heat. Combine the egg yolks and the remaining 1/2 cup of sugar in a medium mixing bowl and whisk until smooth. Slowly but steadily add about 3/4 cup of the milk mixture to the yolk mixture, whisking constantly. Then slowly but steadily add the yolk mixture to the pot, again whisking constantly. Cook over medium-low heat, whisking constantly and adjusting the heat if necessary to maintain a simmer, until the mixture thickens enough to coat the back of a spoon, about 10 minutes.",
        "Strain the mixture again through a sieve into a medium mixing bowl, pressing and then discarding the solids. Fill a larger bowl halfway with very icy water and nestle the medium bowl inside. Stir frequently until the mixture is cold. Cover the medium bowl and chill in the fridge for at least 4 hours or overnight.",
        "Pour the mixture into an ice cream maker and process according to the manufacturer’s instructions. Transfer the ice cream to an airtight container and freeze until firm. Serve straightaway or keep the ice cream in the freezer for up to 3 days.",
        "When you’re ready to eat, scoop the ice cream into bowls, drizzle on some butterscotch, and top with caramel popcorn."
    ],
    "ingredients": [
        "3 tablespoons heavy cream",
        "1 tablespoon Scotch",
        "1 teaspoon Maldon or another flaky sea salt",
        "1/4 vanilla bean, split lengthwise",
        "1/4 cup plus 1 1/2 tablespoons granulated sugar",
        "4 tablespoons (1/2 stick) unsalted butter",
        "2 tablespoons packed light brown sugar",
        "1 1/2 teaspoons light corn syrup",
        "3 medium ears corn, shucked",
        "2 cups heavy cream",
        "1 cup whole milk",
        "1/4 teaspoon kosher salt",
        "3/4 cup granulated sugar",
        "6 large egg yolks",
        "Caramel popcorn, for topping (optional)",
        "A 1 1/2–quart-capacity ice cream maker and a candy thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Ice Cream",
        "Dessert",
        "Corn",
        "Butterscotch/Caramel",
        "Summer",
        "Milk/Cream",
        "Wheat/Gluten-Free",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet Corn Ice Cream With Butterscotch",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-corn-ice-cream-with-butterscotch"
}
