{
    "directions": [
        "For the slaw: Toss the green cabbage, red cabbage, vinegar, oil, salt pepper and green onions in a medium bowl to blend. Cover and refrigerate while preparing the pork.",
        "For the pork: In a medium bowl, whisk together the orange juice, soy sauce, brown sugar, vinegar, sesame oil, pepper, garlic, ginger and orange zest to blend. Add the pork tenderloin and turn to coat. Refrigerate for at least 1 hour, turning occasionally.",
        "Preheat the oven to 425 degrees F.",
        "Remove the pork from the marinade. Reserve the marinade. Place the pork on a nonstick heavy baking sheet and roast until an instant-read thermometer inserted into the center of the pork registers 145 degrees F, 25 to 30 minutes. Remove the pork from the oven and let stand 5 to 10 minutes.",
        "Pour the marinade into a heavy medium saucepan and whisk in the arrowroot. Bring the mixture to a boil over medium-high heat. Reduce the heat and simmer until the sauce thickens slightly, 3 to 4 minutes. Remove the sauce from the heat and cool slightly.",
        "Transfer the pork tenderloin to a work surface and cut crosswise into 1/4- to 1/3-inch-thick slices. Divide the pork among the bottom halves of the rolls. Top the pork with sauce and slaw. Cover with the top halves of the rolls and serve."
    ],
    "ingredients": [
        "1 1/2 cups very thinly sliced green cabbage (about 1/4 cabbage)",
        "1 1/2 cups very thinly sliced red cabbage (about 1/4 cabbage)",
        "2 tablespoons seasoned rice vinegar",
        "1 teaspoon sesame oil",
        "1/4 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "4 thinly sliced green onions (about 1/2 cup)",
        "1/2 cup fresh orange juice",
        "1/2 cup soy sauce",
        "1/4 packed cup golden brown sugar",
        "2 1/2 tablespoons seasoned rice vinegar",
        "2 tablespoons sesame oil",
        "1/2 teaspoon freshly ground black pepper",
        "2 cloves garlic, minced",
        "One 1-inch piece fresh ginger, peeled and minced",
        "Zest of 1 large orange",
        "One 1 to 1 1/4-pound pork tenderloin, trimmed",
        "2 teaspoons arrowroot",
        "10 to 12 mini Hawaiian-style sweet rolls, halved horizontally"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Meat",
        "Pork",
        "Appetizer",
        "Recipes for Parties",
        "Super Bowl"
    ],
    "title": "Sweet and Sour Pork Sliders",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/sweet-and-sour-pork-sliders-recipe"
}
