{
    "directions": [
        "Preheat oven to 400°F. Oil rimmed baking sheet. Cut sweet potatoes in half lengthwise; place cut side down on baking sheet. Roast until tender, about 35 minutes; cool. Scoop potato pulp out of skins into small bowl. Spoon 11/3 cups pulp into medium bowl. (Reserve any remaining potato pulp for another use.) Add sugar and butter; mash well. Season filling with salt and pepper.",
        "Line large baking sheet with parchment paper. Place wonton wrappers on work surface. Using pastry brush, brush wrappers with beaten egg. Place 1/2 tablespoon sweet-potato filling in center of each. Fold each wrapper diagonally over filling, forming triangle. Seal edges. Transfer to parchment-lined baking sheet. Let stand at room temperature while preparing fried shallots and sauce. (Can be made up to 5 days ahead. Freeze, then cover and keep frozen. Do not thaw before cooking.)",
        "Heat vegetable oil in heavy small saucepan over medium-high heat. Working in 2 batches, fry shallots until crisp and dark brown, about 2 minutes. Using slotted spoon, transfer shallots to paper-towel-lined plate to drain. Cook butter in large pot over medium heat until beginning to brown, about 3 minutes. Remove from heat. Add sage and red pepper.",
        "Meanwhile, working in batches, cook ravioli in pot of boiling salted water until tender, about 3 minutes. Drain well. Add ravioli to pot with butter sauce; toss to coat. Transfer to plates, drizzling any sauce from pot over ravioli. Top with fried shallots and pine nuts; serve immediately."
    ],
    "ingredients": [
        "2 1-pound red-skinned sweet potatoes (yams)",
        "2 tablespoons (packed) golden brown sugar",
        "2 tablespoons (1/4 stick) butter, room temperature",
        "1 12-ounce package wonton wrappers",
        "1 large egg, beaten to blend",
        "1 cup vegetable oil",
        "4 large shallots, cut crosswise into thin rounds, separated into rings",
        "6 tablespoons (3/4 stick) butter",
        "8 large fresh sage leaves, thinly sliced",
        "1/2 teaspoon dried crushed red pepper",
        "1/3 cup pine nuts, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Pasta",
        "Appetizer",
        "Vegetarian",
        "Dinner",
        "Root Vegetable",
        "Sweet Potato/Yam",
        "Fall",
        "Winter",
        "Pan-Fry",
        "Sage",
        "Boil",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet-Potato Ravioli with Sage Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-ravioli-with-sage-butter-sauce-104709"
}
