{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Butter and flour pie plate, knocking out excess flour.",
        "Toss together all crust ingredients in a bowl with a fork until crumbs are moistened, then press evenly over bottom and up side of pie plate. Bake crust 6 minutes, then cool on a rack.",
        "Increase oven temperature to 400°F.",
        "Prick each sweet potato once with a fork. Roast in a foil-lined shallow baking pan until tender, about 1 hour. Remove from oven and reduce oven temperature to 375°F. Halve potatoes lengthwise and cool.",
        "While potatoes cool, cook sugar in a dry 8-inch heavy skillet over moderate heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally with a fork, until sugar melts into a deep golden caramel. Remove from heat. Carefully pour water down side of skillet (mixture will bubble and steam vigorously), then return to heat and simmer, stirring, until hardened caramel is completely dissolved. Remove from heat.",
        "When potatoes are cool enough to handle, peel, then cut away any eyes or dark spots. Purée potatoes in a food processor until smooth, then add eggs, cinnamon, and salt and blend until smooth. Add milk, caramel, rum, and vanilla, and blend until combined well.",
        "Pour filling into crust. Bake until filling 2 inches from edge is slightly puffed and center trembles slightly when gently shaken, 40 to 50 minutes (top may crack; filling will continue to set as it cools). If the crust begins to brown too much before the filling is done, crimp a ring of foil or use a pie shield to protect it. Cool pie on rack about 1 hour.",
        "Serve warm or at room temperature."
    ],
    "ingredients": [
        "5 tablespoons unsalted butter, melted, plus additional for buttering pie plate",
        "Flour for dusting",
        "1 cup finely crushed gingersnap cookies (5 ounces; 20 2-inch cookies)",
        "1/2 cup finely chopped pecans (2 ounces), toasted",
        "2 tablespoons sugar",
        "1/8 teaspoon salt",
        "2 lb sweet potatoes (4 medium)",
        "1/2 cup sugar",
        "1/3 cup water",
        "3 large eggs",
        "1/2 teaspoon cinnamon",
        "1/4 teaspoon salt",
        "2/3 cup whole milk",
        "1 tablespoon dark rum",
        "1/2 teaspoon vanilla",
        "Special equipment: a 10-inch glass or ceramic pie plate (6-cup capacity)",
        "Accompaniments: lightly sweetened whipped cream and toasted pecans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Sweet Potato/Yam",
        "Fall",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet-Potato Pie with Gingersnap Pecan Crust",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-pie-with-gingersnap-pecan-crust-233021"
}
