{
    "directions": [
        "Preheat the oven to 400°F. Put on a large-ish pan of water to boil, with the lid on to make it come to a boil faster.",
        "Peel the sweet potatoes and cut them roughly into 1 inch pieces. When the water’s boiling, add salt to taste, and then the sweet potato pieces, and cook them for about 10 minutes or until they are soft. Scoop them out of the water into a bowl–using a ”spider” or slotted spoon–and lightly mash with a fork, without turning them into a purée. Don’t get rid of this water, as you will need it to cook your pasta in later.",
        "In another saucepan, gently melt the butter and add the flour, whisking to form a roux, then take the pan off the heat, slowly whisk in the milk and, when it’s all combined and smooth, put back on the heat. Exchange your whisk for a wooden spoon, and continue to stir until your gently bubbling sauce has lost any floury taste and has thickened. Add the mustard and ¼ teaspoon of the paprika. Season to taste, but do remember that you will be adding Cheddar and salty feta later, so underdo it for now.",
        "Cook the pennette in the sweet-potato water, starting to check 2 minutes earlier than packet instructions dictate, as you want to make sure it doesn’t lose its bite entirely. Drain (reserving some of the pasta cooking water first) and then add the pennette to the mashed sweet potato, and fold in to combine; the heat of the pasta will make the mash easier to mix in.",
        "Add the feta cheese to the sweet potato and pasta mixture, crumbling it in so that it is easier to disperse evenly, then fold in the white sauce, adding 1 1/4 cups grated Cheddar as you go. Add some of the pasta cooking water, should you feel it needs loosening up at all.",
        "Check for seasoning again, then, when you’re happy, spoon the brightly sauced macaroni cheese into 4 small ovenproof dishes of approx. 1 1/2 to 1 3/4 cup capacity (or 1 large rectangular dish measuring approx. 12x8x2 inches deep and 6 1/2 cup capacity). Sprinkle the remaining Cheddar over each one, dust with the remaining ¼ teaspoon of paprika, then shred the sage leaves and scatter the skinny green ribbons over the top, too.",
        "Put the pots on a baking tray, pop into the oven and bake for 20 minutes (or, if you’re making this in a larger dish, bake for 30–35 minutes), by which time they will be piping hot and bubbling, and begging you to eat them."
    ],
    "ingredients": [
        "1 pound sweet potatoes",
        "10 ounces (about 2 cups) pennette, or other small, short pasta",
        "4 tablespoons unsalted butter, softened",
        "3 tablespoons all-purpose flour",
        "2 cups whole milk",
        "1 teaspoon English mustard",
        "1/2 teaspoon paprika",
        "3 ounces feta cheese (approx. 3/4 cup crumbled)",
        "1 1/2 cups sharp Cheddar, grated",
        "4 fresh sage leaves",
        "Salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "cookbooks",
        "Macaroni and Cheese",
        "Cheese",
        "Sweet Potato/Yam",
        "Vegetarian"
    ],
    "title": "Sweet Potato Macaroni and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-macaroni-and-cheese"
}
