{
    "directions": [
        "Line large baking sheet with parchment paper. Place sweet potatoes on plate; microwave on high until tender, about 5 minutes per side. Cut in half and cool. Scrape sweet potato flesh into medium bowl and mash; transfer 3 cups to large bowl. Add ricotta cheese; blend well. Add Parmesan cheese, brown sugar, 2 teaspoons salt, and nutmeg; mash to blend. Mix in flour, about 1/2 cup at a time, until soft dough forms.",
        "Turn dough out onto floured surface; divide into 6 equal pieces. Rolling between palms and floured work surface, form each piece into 20-inch-long rope (about 1 inch in diameter), sprinkling with flour as needed if sticky. Cut each rope into 20 pieces. Roll each piece over tines of fork to indent. Transfer to baking sheet.",
        "Bring large pot of water to boil; add 2 tablespoons salt and return to boil. Working in batches, boil gnocchi until tender, 5 to 6 minutes. Transfer gnocchi to clean rimmed baking sheet. Cool completely. (Can be made 4 hours ahead. Let stand at room temperature.)",
        "Preheat oven to 300°F. Melt butter in heavy large saucepan over medium-high heat. Cook until butter solids are brown and have toasty aroma, swirling pan occasionally, about 5 minutes.",
        "Add chopped sage (mixture will bubble up). Turn off heat. Season sage butter generously with salt and pepper.",
        "Transfer half of sage butter to large skillet set over medium-high heat. Add half of gnocchi. Sauté until gnocchi are heated through, about 6 minutes. Empty skillet onto rimmed baking sheet; place in oven to keep warm. Repeat with remaining sage butter and gnocchi.",
        "Divide gnocchi and sauce among shallow bowls. Garnish with sage leaves."
    ],
    "ingredients": [
        "2 1-pound red-skinned sweet potatoes (yams), rinsed, patted dry, pierced all over with fork",
        "1 12-ounce container fresh ricotta cheese, drained in sieve 2 hours 1 cup finely grated Parmesan cheese (about 3 ounces)",
        "2 tablespoons (packed) golden brown sugar",
        "2 teaspoons plus 2 tablespoons salt",
        "1/2 teaspoon freshly ground nutmeg",
        "2 3/4 cups (about) all purpose flour",
        "1 cup (2 sticks) unsalted butter",
        "6 tablespoons chopped fresh sage plus whole leaves for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Appetizer",
        "Vegetarian",
        "Parmesan",
        "Ricotta",
        "Sweet Potato/Yam",
        "Fall",
        "Winter",
        "Sage",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet Potato Gnocchi with Brown Butter and Sage",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-gnocchi-with-brown-butter-and-sage-233379"
}
