{
    "directions": [
        "Into a bowl sift together flour, baking soda, and salt and stir in thyme. In a large bowl with an electric mixer beat together butter, granulated sugar, and zest until light and fluffy. Add egg, beating until combined well, and beat in lemon juice and gingerroot. Add flour mixture, beating until just combined.",
        "Halve dough and on separate sheets of wax paper form each half into a 14- by 1 1/2-inch log, using wax paper as a guide. Freeze logs, wrapped in wax paper and foil, about 20 minutes, or until firm, and up to 3 weeks. If frozen solid, bring logs to cool room temperature for ease of slicing.",
        "Preheat oven to 350° F.",
        "Cut 1 log diagonally into 1/4-inch-thick ovals and halve each slice diagonally. Arrange cookies about 1 inch apart on ungreased baking sheets and bake in batches in upper and lower thirds of oven, switching position of sheets halfway through baking, until golden, about 12 minutes total. Immediately transfer crisps with a spatula to racks to cool. Make more cookies with remaining log if desired. Dust cookies lightly with confectioners' sugar."
    ],
    "ingredients": [
        "3 1/4 cups all-purpose flour",
        "2 teaspoons baking soda",
        "1/2 teaspoon salt",
        "4 teaspoons finely chopped fresh lemon thyme or regular thyme leaves",
        "2 sticks (1 cup) unsalted butter, softened",
        "1 1/2 cups granulated sugar",
        "2 1/2 tablespoons finely grated fresh lemon zest",
        "1 large egg",
        "3 tablespoons fresh lemon juice",
        "1 tablespoon finely grated peeled fresh gingerroot",
        "confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Ginger",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Lemon",
        "Thyme",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet Lemon-Thyme Crisps",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-lemon-thyme-crisps-14225"
}
