{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Roast sweet potatoes in the preheated oven until tender, about 1 hour; set aside until cool enough to handle.",
        "Halve cooled sweet potatoes lengthwise and scoop the flesh from the peels. Discard potato peels. Mash the sweet potato flesh on a work surface and allow to rest for at least 30 minutes to cool and release moisture.",
        "Transfer mashed sweet potatoes to a bowl and mix with egg yolks, ricotta cheese, and 3/4 cup Parmigiano-Reggiano cheese. Stir in salt, black pepper, and nutmeg. Add flour gradually to the sweet potato mixture until the dough holds together.",
        "Scoop dough by teaspoonful and roll into marble-size balls. Sprinkle a baking sheet generously with semolina flour and place gnudi onto the prepared baking sheet. Refrigerate at least 1 hour or overnight for best texture.",
        "Bring a large pot of salted water to a boil. Reduce heat to low and let the water simmer. Gently drop gnudi, about 12 at a time, into the simmering water and cook until they rise to the surface, about 4 minutes. Simmer for 4 more minutes and remove with a slotted spoon. Keep boiled gnudi warm while you finish cooking remaining batches.",
        "Melt butter in a large skillet over medium heat and cook whole sage leaves until they wilt and are beginning to brown, about 2 minutes; remove leaves. Retain butter in skillet. Stir chopped sage into the hot butter and cook until the butter begins to brown and give off a nutty fragrance, about 2 minutes. Gently mix the gnudi into the butter and sage until gnudi are coated. Garnish with whole sage leaves and sprinkle with 2 tablespoons Parmigiano-Reggiano cheese to serve."
    ],
    "ingredients": [
        "2 sweet potatoes",
        "2 egg yolks",
        "1 cup ricotta cheese",
        "3/4 cup finely shredded Parmigiano-Reggiano cheese",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/2 teaspoon ground nutmeg",
        "1/4 cup all-purpose flour, or more as needed",
        "1/4 cup semolina flour, or as needed",
        "1/2 cup unsalted butter",
        "10 whole fresh sage leaves",
        "1 tablespoon chopped fresh sage leaves",
        "2 tablespoons shredded Parmigiano-Reggiano cheese, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet Potato Gnudi with Sage Butter",
    "url": "http://allrecipes.com/recipe/230046/sweet-potato-gnudi-with-sage-butter/"
}
