{
    "directions": [
        "Preheat an oven to 450°F (230°C). Line a baking sheet with parchment paper.",
        "Place the sweet potatoes on the prepared baking sheet, drizzle with 2 Tbs. of the olive oil and spread out in a single layer. Roast, stirring once, until the potatoes are caramelized and very tender, about 25 minutes. Let cool, transfer to a bowl and, using a potato masher or a fork, mash slightly.",
        "Place 4 tortillas on a work surface. Cover each tortilla with one-fourth of the sweet potatoes, cheese, green chilies and cilantro. Cover with the remaining 4 tortillas.",
        "In a large fry pan over medium heat, warm 1/2 tsp. of the olive oil. Fry each quesadilla, turning once and adding 1/2 tsp. more olive oil for each, until the cheese is melted and the tortillas are golden brown, about 3 minutes. Transfer the quesadillas to a cutting board and cut into quarters.",
        "Put the arugula in a bowl and drizzle with the remaining 2 Tbs. olive oil and the lemon juice. Season with salt and pepper and toss to combine. Serve the quesadillas topped with the arugula. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Vegetable of the Day",
        ", by Kate McMillan (Weldon Owen, 2012)."
    ],
    "ingredients": [
        "2 sweet potatoes, about 1 lb. (500 g) total, peeled and cut into\n 1/2-inch (12-mm) pieces",
        "4 Tbs. (2 fl. oz./60 ml) plus 2 tsp. olive oil",
        "8 flour or corn tortillas, about 9 inches (23 cm) in diameter",
        "3 cups (12 oz./375 g) shredded Monterey jack cheese",
        "1 can (4 oz./125 g) roasted green chilies, drained",
        "1/3 cup (1/2 oz./15 g) fresh cilantro leaves",
        "4 oz. (125 g) baby arugula",
        "Juice of 1/2 lemon",
        "Salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Sweet Potato and Green Chili Quesadillas with Arugula",
    "url": "http://www.williams-sonoma.com/recipe/sweet-potato-chili-quesadilla.html"
}
