{
    "directions": [
        "Heat oven to 300 degrees F.",
        "Place the Bruce's(R) Yams Cut Sweet Potatoes in a bowl and remove any fibers. Using a hand held beater, whip until yams are creamy and contain no lumps; set aside.",
        "Place the cream in a heavy saucepan and slowly bring to a simmer; remove from heat and cool 5 minutes.",
        "In a separate bowl, combine the brown sugar, egg yolks and brandy. Whisk mixture until smooth and the brown sugar has dissolved.",
        "Temper the cream into the eggs by slowing adding it into the bowl while constantly whisking. This process should be done slowly, in order to not cook the eggs.",
        "Fold in whipped sweet potatoes then strain the custard through a fine-mesh sieve into a clean container. Ladle the egg mixture into 4 ramekins, leaving 1/4 inch at the top.",
        "Place the ramekins in a large, glass baking dish and place in oven. Carefully pour boiling water into the baking dish until it reaches halfway up the sides of the ramekin.",
        "Bake for 35 minutes or until custards are almost completely set. Turn off the oven and let sit undisturbed for 10 minutes. Carefully remove baking dish from oven and allow ramekins to cool completely in the water bath.",
        "Transfer to the refrigerator and chill for 5 hours.",
        "Remove custards from the refrigerator 15 minutes before you want to serve them. Sprinkle the tops evenly with the granulated sugar and brulee the tops with a small confectioner's torch or place under the broiler for 2-3 minutes until the sugar has caramelized. Garnish with whipped cream and maraschino cherries before serving, if desired."
    ],
    "ingredients": [
        "1 (15 ounce) can Bruce's® Yams Cut Sweet Potatoes in Syrup, drained",
        "2 cups heavy cream",
        "1/3 cup brown sugar",
        "5 large egg yolks, room temperature",
        "1 tablespoon brandy, or other liqueur",
        "1/4 cup granulated sugar",
        "Whipped cream, for serving (optional)",
        "Maraschino cherries, for garnish (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet Potato Creme Brulee",
    "url": "http://allrecipes.com/recipe/255016/sweet-potato-creme-brulee/"
}
