{
    "directions": [
        "Arrange ribs in large roasting pan. Pour bourbon over. Chill 30 minutes, turning ribs often. Pour off and discard bourbon.",
        "Whisk salt and next 5 ingredients in medium bowl. Sprinkle spice mixture on both sides of ribs. Let stand 1 hour.",
        "Place wood chips in medium bowl. Pour beer over; let stand 1 hour. Place handful of torn newspaper in bottom of charcoal chimney. Top newspaper with 25 charcoal briquettes. Remove upper rack from barbecue. Place chimney on lower grill rack. Light newspaper and let charcoal burn until ash is gray, about 30 minutes.",
        "Open 1 bottom grill vent. Turn out hot charcoal onto 1 side of lower rack. Using metal spatula, spread charcoal to cover approximately 1/3 of rack. Remove 1 cup wood chips from beer and drain (keep remaining chips in beer). Scatter drained chips over coals (avoid using too many wet chips, which may douse the fire). Fill foil loaf pan halfway with water and place opposite the coals on lower grill rack.",
        "Place upper grill rack on barbecue. Arrange ribs on upper grill rack above loaf pan. Cover barbecue with lid, positioning top vent directly over ribs. Place stem of candy thermometer through top vent, with gauge on outside and tip near ribs (thermometer should not touch meat or grill rack); leave in place during cooking. Check temperature after 5 minutes. Use top and bottom vents to maintain temperature between 275°F and 325°F, opening vents wider to increase heat and closing to decrease heat. Leave any other vents closed.",
        "After 45 minutes, use technique described earlier to light an additional 15 charcoal briquettes in same charcoal chimney set atop nonflammable surface.",
        "When temperature of barbecue falls below 275°F, use oven mitts to lift off upper rack with ribs; place rack with ribs on heatproof surface. Using tongs, add hot gray charcoal from chimney to bottom rack. Drain remaining 1 cup wood chips; sprinkle over charcoal. Reposition upper rack on barbecue, placing ribs above loaf pan. Cover with lid. Grill until ribs are very tender and meat pulls away from bones, about 45 minutes longer, brushing with 3/4 cup Bourbon Barbecue Sauce the last 15 minutes of cooking.",
        "Transfer ribs to platter. Brush with 3/4 cup more barbecue sauce. Serve, passing remaining sauce separately, if desired."
    ],
    "ingredients": [
        "6 baby back pork rib racks",
        "1 cup bourbon",
        "3 tablespoons coarse salt",
        "3 tablespoons (packed) dark brown sugar",
        "3 tablespoons paprika",
        "2 tablespoons ground black pepper",
        "1 tablespoon garlic powder",
        "1 teaspoon ground cumin",
        "2 cups hickory wood chips",
        "2 cups beer",
        "Bourbon Barbecue Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Bourbon",
        "Pork",
        "Marinate",
        "Backyard BBQ",
        "Pork Rib",
        "Summer",
        "Grill",
        "Grill/Barbecue"
    ],
    "title": "Sweet-and-Smoky Baby Back Ribs with Bourbon Barbecue Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-and-smoky-baby-back-ribs-with-bourbon-barbecue-sauce-103632"
}
