{
    "directions": [
        "About one hour before smoking, make the dry rub. Combine all ingredients in small bowl; mix well.",
        "Brush thin layer of mustard on both sides of ribs; sprinkle an even coat of dry rub both sides of ribs. Set aside at room temperature for 1 hour.",
        "Heat charcoal or gas grill for indirect cooking at 250 to 300 degrees F. Add drained wood chips, if using.",
        "Place the ribs, meaty side down, over a drip pan and cook for 1 1/2 to 2 hours.  Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.",
        "Meanwhile, make the sauce. Combine all ingredients in medium saucepan; bring to a simmer until flavors are blended, stirring frequently. Set aside to cool.",
        "Remove ribs from grill. Double-wrap each rack in heavy-duty aluminum foil. Return wrapped ribs to the grill and cook for 1 1/2 to 2 hours more over indirect heat, until very tender. Add more coals as needed to maintain temperature for a charcoal grill.",
        "Remove ribs from grill and unwrap. Place ribs over direct heat on grill and brush with sauce. Cook for about 5 minutes until the sauce is set. Turn ribs and repeat with more sauce.",
        "Serve ribs with remaining sauce."
    ],
    "ingredients": [
        "Dry Rub:",
        "1/3 cup light brown sugar, plus",
        "1 tablespoon light brown sugar",
        "1 tablespoon kosher salt",
        "1 tablespoon chili powder",
        "1 1/2 teaspoons black pepper",
        "Sauce:",
        "1 cup ketchup-based barbecue sauce",
        "1/4 cup honey",
        "2 racks Smithfield® Extra Tender Pork Back Ribs, membrane removed",
        "3 tablespoons prepared yellow mustard",
        "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet Southern BBQ Back Ribs",
    "url": "http://allrecipes.com/recipe/242407/sweet-southern-bbq-back-ribs/"
}
