{
    "directions": [
        "Preheat oven to 375  degrees F (190 degrees C). Lightly grease a 2-quart, deep-dish casserole pan.",
        "Place the sweet potato, russet potato, and carrot each in separate saucepans. Pour enough water into each saucepan to cover the vegetables. Place each saucepan over medium heat and bring to a boil. Cook each until tender enough to pierce with a fork, 5 to 7 minutes; drain. Set the carrots aside.",
        "Place the drained sweet potato and russet potato in a large mixing bowl; mash lightly. Add the egg substitute and sour cream. Blend the potato mixture with an electric hand mixer set to medium until smooth and fluffy, about 2 minutes. Season with salt and pepper. Set aside.",
        "Heat the oil in a large skillet over medium heat. Cook the turkey in the hot oil until browned, 4 to 5 minutes. Add the onion, celery, garlic, 1 teaspoon thyme, and poultry seasoning. Cook until the turkey is cooked through and no longer pink. Increase the heat to medium-high. Pour the chicken stock into the turkey mixture. Whisk together the hot milk and flour until smooth. When the chicken stock begins to boil, add the flour mixture to the stock and stir until it thickens. Remove from heat and stir in Worcestershire sauce and browning sauce.",
        "Pour the turkey mixture into the bottom of the prepared casserole dish. Sprinkle the stuffing mix over the turkey mixture. Arrange the carrots, peas, and corn atop the stuffing mix. Season with thyme, salt and pepper. Spoon the potato mixture over the vegetables, spreading to cover all the way to the edges of the dish. Sprinkle with nutmeg.",
        "Bake in preheated oven until top is slightly browned, about 35 minutes. Allow to rest 30 minutes before serving."
    ],
    "ingredients": [
        "2 large sweet potatoes, peeled and cubed",
        "1 large russet potato, peeled and cubed",
        "2 large carrots, peeled and diced",
        "1/4 cup egg substitute",
        "1/3 cup light sour cream",
        "salt and ground black pepper to taste",
        "1 tablespoon olive oil",
        "1 pound ground turkey",
        "1/2 cup chopped onion",
        "1 stalk celery, chopped",
        "1 clove garlic, minced",
        "1 teaspoon crumbled dried thyme",
        "3/4 teaspoon poultry seasoning",
        "1/2 cup chicken stock",
        "1/2 cup hot milk",
        "1 tablespoon all-purpose flour",
        "1 dash Worcestershire sauce",
        "1 dash browning sauce",
        "1 1/3 cups herb-seasoned stuffing mix",
        "1 cup peas",
        "3/4 cup corn",
        "1/2 teaspoon crumbled dried thyme",
        "salt and ground black pepper to taste",
        "1 teaspoon ground nutmeg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet Potato and Turkey Shepherd's Pie",
    "url": "http://allrecipes.com/recipe/147624/sweet-potato-and-turkey-shepherds-pi/"
}
