{
    "directions": [
        "Preheat oven to 350°F. Arrange corn bread on rimmed baking sheet. Bake until slightly toasted, stirring occasionally, about 40 minutes. (Corn bread can be prepared 1 day ahead. Cover and store at room temperature.)",
        "Cook bacon in heavy large pot over medium heat until brown and crisp, about 10 minutes. Using slotted spoon, transfer bacon to bowl. Reserve 6 tablespoons drippings in pot (discard any remaining drippings). Add sweet potatoes, onion and thyme to same pot. Cover and cook over medium-low heat until sweet potatoes are just tender, stirring occasionally, about 20 minutes. Add greens. Cover; cook until greens just wilt, stirring occasionally, about 5 minutes.",
        "Whisk vinegar, honey, salt, pepper and mustard in very large bowl to blend. Mix in sweet potato mixture, pecans and bacon. Stir in corn bread. Mix eggs into stuffing.",
        "Loosely fill main cavity with stuffing. Add enough broth to remaining stuffing to moisten lightly (about 1/4 to 1/2 cup, depending on amount of remaining stuffing). Generously butter glass baking dish. Spoon remaining stuffing into prepared dish. Cover with buttered foil, buttered side down. Bake stuffing in dish alongside turkey until heated through, about 25 to 30 minutes. Uncover and bake until top is slightly crisp and golden, about 15 to 20 minutes.",
        "Preheat oven to 350°F. Generously butter 15 x 10 x 2-inch . Add enough broth to stuffing to moisten (about 3/4 to 1 cup). Transfer stuffing to prepared dish. Cover with butter foil, buttered side down; bake until heated through, about 30 to 35 minutes. Uncover and bake until top is slightly crisp and golden, about 20 to 25 minutes longer."
    ],
    "ingredients": [
        "11 cups very coarsely crumbled Sweet Potato Corn Bread",
        "3/4 pound bacon, coarsely chopped",
        "2 pounds red-skinned sweet potatoes (yams), peeled, cut into 1/2-inch cubes (about 4 cups)",
        "1 large onion, chopped",
        "4 1/2 tablespoons chopped fresh thyme",
        "3 large bunches kale, Swiss chard, or mustard or collard greens, stemmed, coarsely chopped",
        "3 tablespoons apple cider vinegar",
        "3 tablespoons honey",
        "2 teaspoons salt",
        "2 teaspoons ground black pepper",
        "1 teaspoon dry mustard",
        "1 1/4 cups chopped pecans, toasted",
        "5 large eggs, beaten to blend",
        "Canned low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Side",
        "Bake",
        "Thanksgiving",
        "High Fiber",
        "Bacon",
        "Pecan",
        "Kale",
        "Sweet Potato/Yam",
        "Fall",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Sweet Potato Corn Bread Stuffing with Greens and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-corn-bread-stuffing-with-greens-and-bacon-100461"
}
