{
    "directions": [
        "Whisk the ginger, garlic, 1 tablespoon oil, soy sauce, mirin, salt, and pepper in a small bowl. Place the skirt steak in a resealable plastic bag and pour the marinade over. Turn to coat and let sit at room temperature 30 minutes.",
        "Remove the skirt steak from the marinade. Heat 1 tablespoon oil in a large skillet over medium-high heat. Add the steak and sear to desired doneness, about 3 minutes per side for medium rare. Let steak rest on a cutting board.",
        "Wipe out skillet and heat remaining 1 tablespoon oil. Sear the bok choy cut side down over medium-high heat until browned, 2 to 3 minutes. Flip the bok choy over, add 1/4 cup water, cover, and cook 2 minutes more. Remove bok choy and roughly chop.",
        "Using a mandoline, carefully slice the sweet potato lengthwise into 1/8-inch-thick planks. Select 4 planks from the center of the sweet potato that are similar in size. Meanwhile, fill a large Dutch oven or cast-iron skillet with oil to a depth of 1 1/2 inches and heat carefully to 350°F. Sift the flour, cornstarch, and 1/2 teaspoon salt into a large bowl. Gently incorporate the club soda into the flour mixture; do not overmix. Coat 2 slices sweet potato in the batter and fry, turning occasionally, until golden brown, about 5 to 6 minutes. Repeat with remaining 2 slices sweet potato. Sprinkle with remaining 1/4 teaspoon salt and drain on a cooling rack placed over a sheet tray.",
        "Assemble the sandwich: Mix together the miso, mayonnaise, and lemon juice in a small bowl. Thinly slice the skirt steak against the grain. Place 1 fried sweet potato slice on a plate and layer with half the bok choy, half the skirt steak and 1 tablespoon of miso mayo. Top with another sweet potato slice to form a sandwich. Repeat with remaining sweet potato slices to make a second sandwich.",
        "The leftover miso mayo can be refrigerated for up to a week."
    ],
    "ingredients": [
        "2 teaspoons finely grated ginger",
        "1 large clove garlic, finely grated",
        "3 tablespoons vegetable oil, divided",
        "2 tablespoons low-sodium soy sauce",
        "1 tablespoon mirin",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon black pepper",
        "10 ounces skirt steak, cut into 2 pieces",
        "2 heads baby bok choy, split in half lengthwise (1/2 pound)",
        "1 large sweet potato",
        "Vegetable oil, for frying",
        "1/2 cup all-purpose flour",
        "2 tablespoons cornstarch",
        "3/4 teaspoon kosher salt, divided",
        "1/2 cup very cold club soda",
        "1/2 teaspoon white miso paste",
        "1/4 cup mayonnaise",
        "1 teaspoon fresh lemon juice",
        "A mandoline"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Steak",
        "Sweet Potato/Yam",
        "Bok Choy",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Sweet Potato Tempura and Steak Sandwich with Bok Choy and Miso Mayo",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-tempura-and-steak-sandwich-with-bok-choy-and-miso-mayo-51234910"
}
