{
    "directions": [
        "Cook sweet potato in pot of boiling salted water until just tender, about 10 minutes. Drain; transfer to large bowl.",
        "Melt 2 tablespoons butter in heavy medium skillet over medium heat. Add apple; sauté until tender and golden, about 8 minutes. Add apple to sweet potato; mash together. Cool. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 350°F. Bring milk, sugar, sage, and salt to boil in heavy medium saucepan. Reduce heat to medium-low; gradually whisk in cornmeal. Cook until cornmeal absorbs milk and pulls clean from bottom of pan, stirring constantly, about 5 minutes. Whisk in 3 tablespoons butter. Whisk yolks in large bowl to blend. Gradually whisk in warm cornmeal mixture. Whisk in baking powder. Mix sweet potato mixture into cornmeal mixture. Beat egg whites in medium bowl to medium-stiff peaks. Fold whites into warm cornmeal mixture.",
        "Melt 1 tablespoon butter in heavy large ovenproof skillet (preferably cast iron) over medium-high heat. Pour batter into skillet. Transfer skillet to oven; bake spoon bread until top is golden and puffed, about 1 hour. Serve warm."
    ],
    "ingredients": [
        "1 1-pound red-skinned sweet potato (yam), peeled, cut into 1 1/2-inch chunks",
        "6 tablespoons unsalted butter",
        "1 6-ounce Granny Smith apple, peeled, cut into 1/2-inch chunks",
        "2 cups whole milk",
        "1 tablespoon (packed) golden brown sugar",
        "2 teaspoons chopped fresh sage",
        "2 teaspoons coarse salt",
        "1 cup white cornmeal",
        "4 large eggs, separated",
        "1 1/2 teaspoons baking powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Potato",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Apple",
        "Sweet Potato/Yam",
        "Fall",
        "Sage",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet Potato, Apple, and Sage Spoon Bread",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-apple-and-sage-spoon-bread-107317"
}
