{
    "directions": [
        "Preheat oven to 400 degrees F. Add flour to a Reynolds(R) Large Oven Bag. Shake. This helps prevent bag from bursting. Place bag in a 13x9x2-inch baking pan.",
        "Add rice, sweet potato, onion, 1 tablespoon butter, thyme, garlic, and pepper to oven bag. Turn bag several times to mix ingredients. Arrange ingredients in even layer in bag. Fold down bag opening two times to hold it open; set aside.",
        "Microwave chicken broth and wine in a medium microwave-safe bowl or measuring cup for 3 minutes on high power until liquid is hot (140 degrees F). Carefully pour or ladle liquid over ingredients in bag. Carefully unfold bag opening.",
        "Close bag with tie (found inside package). Cut six 1/2-inch slits in top of bag to allow steam to escape. Tuck ends of bag in pan",
        "Place pan in oven, allowing room for bag to expand during cooking without touching heating elements, wall, or racks. Bag should not hang over pan.",
        "Bake 25 to 30 minutes or until most of the liquid is absorbed. Let stand 5 minutes.",
        "Cut open top of oven bag carefully. Remember: Always support bag with pan.",
        "Spoon rice mixture into a large serving bowl. Stir in remaining 1 tablespoon butter and 1/4 cup cheese. Sprinkle with additional cheese, if desired."
    ],
    "ingredients": [
        "1 tablespoon all-purpose flour",
        "1 1/2 cups uncooked Arborio rice",
        "1 (8 ounce) sweet potato, peeled and shredded",
        "1/2 cup chopped onion",
        "2 tablespoons butter, softened and divided",
        "2 teaspoons snipped fresh thyme",
        "2 cloves garlic, minced",
        "1/4 teaspoon ground black pepper",
        "3 cups reduced-sodium chicken broth",
        "1/2 cup dry white wine or reduced-sodium chicken broth",
        "1/4 cup finely shredded Parmesan cheese, plus more for serving"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet Potato Risotto from Reynolds®",
    "url": "http://allrecipes.com/recipe/238763/sweet-potato-risotto-from-reynolds/"
}
