{
    "directions": [
        "Preheat oven to 350°F. Line rimmed baking sheet with foil; place metal rack on sheet. Sprinkle ribs all over with salt and pepper; place, meat side down, on rack.",
        "Press chiles through sieve into heavy small saucepan (discard solids in sieve). Add remaining ingredients to pan. Stir to blend over medium heat until sauce comes to boil. Season sauce to taste with salt. Transfer 1/2 cup sauce to small bowl and reserve.",
        "Brush ribs with 2 tablespoons sauce from pan. Turn ribs over; brush with 2 tablespoons sauce. Roast ribs until very tender, brushing with 2 tablespoons sauce every 15 minutes, about 1 1/2 hours. Cut rack into individual ribs. Serve ribs with reserved sauce.",
        "*Chipotle chiles canned in a spicy tomato sauce, often called adobo, are available at some supermarkets, specialty foods stores, and Latin markets.",
        "**Pomegranate molasses is a sweet-tart syrup made from reduced pomegranate juice. It can be found at some supermarkets, specialty foods stores, and Middle Eastern markets.",
        "Place chiles and adobo sauce in a small strainer set over a small bowl or saucepan. Because canned chipotles are soft, you can simply use a rubber spatula to mash them through the strainer into the bowl, leaving the skins and seeds behind."
    ],
    "ingredients": [
        "1 2-pound rack baby back pork ribs",
        "1/4 cup canned chipotle chiles*",
        "3/4 cup red currant jelly",
        "5 tablespoons pomegranate molasses**",
        "1/4 cup low-salt chicken broth",
        "2 tablespoons olive oil",
        "1/4 teaspoon ground allspice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Currant",
        "Pork Rib",
        "Hot Pepper",
        "Pomegranate",
        "Molasses",
        "Jam or Jelly"
    ],
    "title": "Sweet and Spicy Chipotle-Glazed Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-and-spicy-chipotle-glazed-ribs-230936"
}
