{
    "directions": [
        "1. Place the saffron into the cup of hot water and stir to dissolve. Pour into a large bowl. Pour in the honey and whisk until dissolved. Add the yeast and stir again. Add 1 1/2 cups of the flour and stir to mix everything together. Cover with a clean dish cloth and let sit for 30 minutes.",
        "2. Meanwhile, in another bowl or the bowl of a stand mixer, place 2 1/2 cups of the flour, the sugar, salt, and margarine. Using a whisk, an electric mixer, or the whisk attachment of a stand mixer, cut the margarine into the dry ingredients until it looks like sand and there are no big clumps of margarine.",
        "3. After the half hour, the yeast mixture should have changed: It will either look thick, have bubbles, or have increased in size. If the mixture has not changed, your yeast may be dead and you should dump that mixture and make a new one with new yeast. Beat 2 of the eggs in a small bowl. Add the eggs to the yeast mixture and mix using a wooden spoon or silicone spatula. Add the flour and margarine mixture in three parts, mixing well after each addition. With your hands or a dough hook on the stand mixer, knead the dough and add 1/4 cup of the flour. If the dough remains sticky, add another 1/4 cup of flour. Add more flour, a tablespoon at a time, until the dough is no longer sticky and feels soft when you slide your hand across it.",
        "4. Wash the bowl, dry it, and rub the oil round the bowl. Add the dough and rub the top with the oil on your hands. Cover with a dish towel and let rise 1 1/2 hours.",
        "5. Sprinkle the top of the cookie with the remaining teaspoon of sugar. Slide the parchment onto a cookie sheet and bake for 35 to 37 minutes, until the edges start to look golden. Remove from the oven and immediately cut the cookie into 8 or 12 large wedges or about eighteen 1 x 3-inch bars, if you like. If you wait until the cookie cools to cut it, you will not get nice clean edges. 5. Place the dough on a floured surface and punch it down to remove air pockets. Divide the dough into 2 or 3 balls, depending on how many challahs you will bake. Divide each ball into three pieces. Roll the three pieces into strands the same length, shorter for a fatter challah, longer for a long and narrow challah. Braid the strands. *See instructions in \"Braiding Challah\" below.",
        "6. Place on a greased cookie sheet. Let rise another 1 1/2 hours. Beat the remaining egg and brush the challahs with the egg.",
        "7. Preheat the oven to 350°F. Bake for 35 minutes, or until the top is browned and when you lift the challah and tap on the bottom, it sounds hollow. Remove the challahs to a wire rack to cool."
    ],
    "ingredients": [
        "1/4 teaspoon saffron threads",
        "1 cup hot, not boiling water",
        "1/2 cup honey",
        "3/4 ounce (3 envelopes) active dry yeast",
        "4 1/2 to 5 cups bread flour, plus extra to dust work surface",
        "1/4 cup sugar",
        "Dash of salt",
        "1/2 cup (1 stick) parve margarine, at room temperature, plus extra to grease pan",
        "3 large eggs, divided",
        "1 teaspoon canola or vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Mixer",
        "Bake",
        "Hanukkah",
        "Vegetarian",
        "Purim",
        "Sukkot",
        "Rosh Hashanah/Yom Kippur",
        "Condiment",
        "Spice",
        "Saffron",
        "Kosher",
        "Honey",
        "Shavuot",
        "Advance Prep Required"
    ],
    "title": "Sweet Honey and Saffron Challah",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-honey-and-saffron-challah-361129"
}
