{
    "directions": [
        "Cook potatoes in large saucepan of simmering water until tender, about 20 minutes. Drain, reserving 1 cup cooking liquid. Place potatoes in medium bowl. Transfer reserved cooking liquid to large bowl; cool to 120°F. to 130°F.",
        "Sprinkle yeast and sugar over reserved warm liquid; stir to dissolve. Let yeast mixture stand until foamy, about 5 minutes. Combine potatoes, 1/2 cup melted butter, 1/2 cup honey, oil, eggs and salt in processor. Blend until smooth. Add to yeast mixture. Mix in all purpose flour. Gradually stir in enough whole wheat flour 1/2 cup at a time to form soft, slightly sticky dough. Turn dough out onto lightly floured surface and knead until smooth and elastic, adding more whole wheat flour if sticky.",
        "Lightly oil large bowl. Add dough, turning to coat entire surface. Cover bowl with kitchen towel. Let dough rise in warm draft-free area until doubled in volume, about 30 minutes.",
        "Preheat oven to 400°F. Grease three 9-inch-diameter cake pans. Punch dough down. Turn dough out onto lightly floured surface and knead until smooth. Divide dough into thirds. Cut each third into 12 pieces. Roll each piece into ball. Mix remaining 1 cup melted butter and 1/2 cup honey until well blended. Dip each dough ball into honey mixture and then roll in graham cracker crumbs to coat. Place 12 balls in each prepared pan, arranging close together. Let stand 10 minutes. Bake until golden brown, about 25 minutes. (Rolls can be prepared ahead. Cool completely. Wrap tightly and refrigerate 1 day or freeze up to 1 month. Reheat rolls before serving.) Serve warm."
    ],
    "ingredients": [
        "1 1/2 pounds sweet potatoes, peeled, quartered",
        "2 envelopes fast-rising yeast",
        "1/4 cup sugar",
        "1 1/2 cups (3 sticks) unsalted butter, melted",
        "1 cup honey",
        "1/4 cup vegetable oil",
        "2 eggs, beaten to blend",
        "2 teaspoons salt",
        "3 cups all purpose flour",
        "4 cups (about) whole wheat flour",
        "4 cups graham cracker crumbs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Bake",
        "Sweet Potato/Yam",
        "Fall",
        "California"
    ],
    "title": "Sweet Potato Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-rolls-2566"
}
