{
    "directions": [
        "Preheat oven to 450°F with rack in middle.",
        "Pierce russet and sweet potatoes in several places with a fork, then bake in a 4-sided sheet pan until just tender, 45 minutes to 1 hour.",
        "Cool potatoes slightly, then peel and force through ricer into sheet pan, spreading in an even layer. Cool potatoes completely.",
        "Lightly flour 2 or 3 large baking sheets or line with parchment paper.",
        "Beat together egg, nutmeg, 1 teaspoon salt, and 1/2 teaspoon pepper in a small bowl.",
        "Gather potatoes into a mound in sheet pan, using a pastry scraper if you have one, and form a well in center.",
        "Pour egg mixture into well, then knead into potatoes. Knead in cheese and 1 1/2 cups flour, then knead, adding more flour as necessary, until mixture forms a smooth but slightly sticky dough. Dust top lightly with some of flour.",
        "Cut dough into 6 pieces. Form 1 piece of dough into a 1/2-inch-thick rope on a lightly floured surface. Cut rope into 1/2-inch pieces. Gently roll each piece into a ball and lightly dust with flour.",
        "Repeat with remaining 5 pieces of dough.",
        "Turn a fork over and hold at a 45-degree angle, with tips of tines touching work surface. Working with 1 at a time, roll gnocchi down fork tines, pressing with your thumb, to make ridges on 1 side. Transfer gnocchi as formed to baking sheets.",
        "Heat oil in a 12-inch heavy skillet over medium heat until it shimmers. Fry sage leaves in 3 batches, stirring, until they turn just a shade lighter and crisp (they will continue to crisp as they cool), about 30 seconds per batch. Transfer to paper towels to drain. Season lightly with salt.",
        "Fry chestnuts in 3 batches, stirring, until golden and crisp, about 30 seconds per batch. Transfer to paper towels to drain. Season lightly with salt. Reserve oil in skillet.",
        "Add butter to oil in skillet with 1/2 teaspoon salt and cook until golden-brown, 1 to 2 minutes. Remove from heat.",
        "Add half of gnocchi to a pasta pot of well-salted boiling water and stir. Cook until they float to surface, about 3 minutes. Transfer with a slotted spoon to skillet with butter sauce. Cook remaining gnocchi in same manner, transferring to skillet as cooked.",
        "Heat gnocchi in skillet over medium heat, stirring to coat.",
        "Serve sprinkled with fried sage and chestnuts and grated cheese."
    ],
    "ingredients": [
        "1 1/4 pounds russet (baking potatoes)",
        "1 (3/4-pound) sweet potato",
        "1 large egg",
        "1/2 teaspoon grated nutmeg",
        "1/3 cup grated Parmigiano-Reggiano plus more for serving",
        "1 1/2 to 2 cups all-purpose flour plus more for dusting",
        "1/3 cup extra-virgin olive oil",
        "1 cup sage leaves (from 1 bunch)",
        "1/3 cup bottled roasted chestnuts, very thinly sliced with an adjustable-blade slicer or a sharp vegetable peeler",
        "2 tablespoons unsalted butter",
        "Equipment: a potato ricer or a food mill fitted with fine disk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Potato",
        "Appetizer",
        "Dinner",
        "Parmesan",
        "Sweet Potato/Yam",
        "Fall",
        "Sage",
        "Chestnut",
        "Gourmet",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sweet Potato Gnocchi with Fried Sage and Shaved Chestnuts",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-gnocchi-with-fried-sage-and-shaved-chestnuts-355415"
}
