{
    "directions": [
        "Heat butter and brown sugar in a small saucepan, stirring to dissolve sugar, until butter is melted.",
        "Meanwhile, very finely grind sesame seeds in spice mill or with mortar and pestle. Pulse cookies in a food processor until finely ground.",
        "Pour butter mixture into food processor; add salt and ground sesame and pulse to combine. Using a measuring cup, press cookie mixture firmly onto bottom and up the sides of a 9\" pie dish. Freeze until very cold, 20–25 minutes.",
        "Preheat oven to 350°F. Bake crust until firm and slightly darkened in color, 15–18 minutes. If crust slides down sides, gently press back up. Let cool.",
        "Preheat oven to 350°F. Roast sweet potatoes on a foil-lined rimmed baking sheet until tender, 50–60 minutes. Slice open lengthwise and let cool. Scoop out flesh from skins (you should have about 1 cup); pulse in food processor until very smooth. Discard skins.",
        "Whisk brown sugar, butter, and miso in a medium bowl until smooth. Add egg yolks and egg and whisk just to incorporate. Whisk in sweet potato purée, then cream.",
        "Reduce oven temperature to 300°F. Pour filling into crust. Bake pie, rotating halfway through, until filling is set (it will still wobble slightly in the very center), 50–60 minutes. Transfer dish to a wire rack and let pie cool before slicing, about 2 hours.",
        "Serve pie topped with whipped cream or scoops of vanilla ice cream."
    ],
    "ingredients": [
        "6 tablespoons unsalted butter",
        "1/4 cup (packed) light brown sugar",
        "1/3 cup black sesame seeds",
        "5 ounces chocolate wafer cookies (about 23), broken into small pieces",
        "Pinch of kosher salt",
        "2 small sweet potatoes (about 1 pound)",
        "1/2 cup (packed) light brown sugar",
        "3 tablespoons unsalted butter, melted",
        "2 tablespoons white miso",
        "2 large egg yolks",
        "1 large egg",
        "1 cup heavy cream",
        "Whipped cream or vanilla ice cream (for serving)",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Thanksgiving",
        "Pie",
        "Sweet Potato/Yam",
        "Bean",
        "Milk/Cream",
        "Sesame",
        "Dessert",
        "Chocolate"
    ],
    "title": "Sweet Potato–Miso Pie With Chocolate-Sesame Crust",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-miso-pie-with-chocolate-sesame-crust"
}
