{
    "directions": [
        "Blanch onions in a large pot of boiling water 1 minute, then drain in a colander and transfer to a bowl of cold water to stop cooking. Drain and peel onions.",
        "Bring sugar and water to a boil in a 3-quart heavy saucepan over moderate heat, stirring until sugar is dissolved. Boil, without stirring, washing down any sugar crystals on side of pan with a pastry brush dipped in cold water, until syrup turns pale golden. Continue to cook caramel, gently swirling pan, until deep golden.",
        "Immediately remove from heat, then carefully add wine (caramel will steam vigorously and harden). Return pan to heat and simmer, stirring, until caramel is dissolved.",
        "Add onions, red-wine vinegar, oil, salt, peppercorns, and bay leaf and simmer, uncovered, stirring occasionally, until onions are tender, about 1 hour. Transfer onions to a bowl using a slotted spoon, then boil liquid until reduced to about 1 cup, 10 to 15 minutes. Stir in balsamic vinegar, then pour liquid over onions and cool to room temperature. Chill, covered, 1 to 3 days (for flavors to develop).",
        "Serve chilled or at room temperature."
    ],
    "ingredients": [
        "2 lb cipolline or small (1 1/2-inch) white boiling onions, left unpeeled",
        "1 cup sugar",
        "1/4 cup water",
        "1 cup dry red wine",
        "1 cup red-wine vinegar",
        "2 tablespoons extra-virgin olive oil",
        "1 teaspoon salt",
        "10 whole black peppercorns",
        "1 Turkish or 1/2 California bay leaf",
        "1 tablespoon balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Side",
        "Marinate",
        "Cocktail Party",
        "Quick & Easy",
        "Vinegar",
        "Red Wine",
        "Spring",
        "Edible Gift",
        "Gourmet"
    ],
    "title": "Sweet-and-Sour Cipolline Onions",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-and-sour-cipolline-onions-109198"
}
