{
    "directions": [
        "Preheat the oven to 250°F and place each rack of ribs on a square of aluminum foil. Sprinkle the ribs generously with salt, add a few sprigs of thyme to each, and then wrap well. Place the rib packets on a cookie sheet and bake for 3 to 4 hours, until the ribs are extremely tender. Allow the ribs to cool slightly in their packets before opening.",
        "To make the glaze, combine all of the ingredients in a large pot on medium-low heat. Allow to simmer, stirring every so often, for a few hours, until the sauce is nice and thick. Set aside.",
        "To bring the ribs and glaze together, do the following. Turn on the broiler (if you don't have a broiler, get the oven up to 450°F). Cut the rib racks into individual ribs, place them on a foil-lined cookie sheet or broiler tray, and brush them aggressively with the glaze. Pop them under the broiler and watch them carefully: all that sugar makes them burn very easily! You want the glaze to fuse with the ribs; it takes 3 to 4 minutes. If you're cooking the ribs in the oven, do so just until the glaze begins to bubble, 4 to 5 minutes. Serve the ribs hot with lots of napkins—trust me, you'll need them."
    ],
    "ingredients": [
        "2 racks spareribs",
        "Kosher salt",
        "4 to 6 sprigs of fresh thyme",
        "2 1/2 cups balsamic vinegar (don't waste your best balsamic here)",
        "1/2 cup honey",
        "2 cups ketchup",
        "1 can beer (preferably dry)",
        "1 tablespoon minced garlic",
        "1 red onion, diced",
        "1/2 cup dark brown sugar",
        "1 tablespoon molasses",
        "1/4 cup grainy mustard",
        "1 or 2 teaspoons Tabasco (depending on how spicy you like it)",
        "1 tablespoon Worcestershire sauce",
        "1/2 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Bake",
        "Broil",
        "Dinner",
        "Vinegar",
        "Meat",
        "Pork Rib",
        "Advance Prep Required",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sweet-and-Sour Balsamic-Glazed Spareribs",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-and-sour-balsamic-glazed-spareribs-51129400"
}
