{
    "directions": [
        "Mix the yeast, 1/3 cup of sugar, and warm water together in a large bowl, stir to dissolve the sugar, and let the mixture stand until a creamy layer forms on top, about 5 minutes. Stir in 3 cups of flour to make a loose sponge.",
        "In a separate bowl, beat 4 eggs, 1/2 cup of vegetable oil, 1 tablespoon of salt, and 1 cup of sugar together, and stir the egg mixture into the yeast-flour mixture until well combined. Continue mixing in flour, 1 cup at a time, up to 9 total cups. Dough should be slightly sticky, but not so wet that it leaves dough stuck to your hands.",
        "Turn the dough out onto a floured surface, and knead for 5 minutes to develop gluten. Form the dough into a compact round shape, and place in an oiled bowl. Turn the dough over several times in the bowl to oil the surface of the dough, cover the bowl with a cloth, and let rise in a warm area until doubled in size, about 1 hour. Punch down the dough and knead for another 5 minutes, until smooth and elastic.",
        "Grease baking sheets, or line with parchment paper. To make egg glaze, whisk together 1 egg, 1 teaspoon oil, 2 teaspoons sugar, and 1 teaspoon of water in a small bowl, and refrigerate until needed.",
        "Cut the dough into 4 pieces, and cut each piece into 3 smaller pieces for a 3-strand braided loaf. Working on a floured surface, roll the small dough pieces into ropes about the thickness of your thumb and about 12 inches long. Ropes should be fatter in the middle and thinner at the ends. Pinch 3 ropes together at the top and braid them. Starting with the strand to the right, move it to the left over the middle strand (that strand becomes the new middle strand.) Take the strand farthest to the left, and move it over the new middle strand. Continue braiding, alternating sides each time, until the loaf is braided, and pinch the ends together and fold them underneath for a neat look. Place the loaves onto the prepared baking sheets, and let rise in a warm place until doubled in size, 30 to 45 minutes. Brush a coating of egg glaze onto the tops of the bread, and reserve the remaining glaze.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Bake the bread in the preheated oven for 20 minutes, remove from the oven, and brush another coating of glaze onto the bread. Return to the oven, and bake until the tops are shiny and golden brown, 5 to 10 more minutes. Let cool before cutting."
    ],
    "ingredients": [
        "1 tablespoon active dry yeast",
        "1/3 cup white sugar",
        "2 cups warm water (110 degrees F/45 degrees C)",
        "3 cups all-purpose flour",
        "4 eggs",
        "1/2 cup vegetable oil",
        "1 tablespoon salt",
        "1 cup white sugar",
        "6 cups all-purpose flour, or as needed",
        "1 egg",
        "1 teaspoon vegetable oil",
        "2 teaspoons white sugar",
        "1 teaspoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet Challah",
    "url": "http://allrecipes.com/recipe/132319/sweet-challah/"
}
