{
    "directions": [
        "Position rack in center of oven; preheat to 350°F. Spread bread cubes in single layer on large baking sheet; bake until almost firm to touch, about 10 minutes. Cool. DO AHEAD: Can be made 1 day ahead. Store in airtight container at room temperature.",
        "Place bread cubes in extra-large bowl. Cook bacon in heavy large pot over medium heat until crisp. Using slotted spoon, transfer bacon to paper towels to drain.",
        "Pour off and discard all but 3 tablespoons bacon drippings from pot; place pot over medium-high heat. Add butter, then sweet potatoes, onions, celery, thyme, and 1 1/4 teaspoons coarse salt to pot. Sauté until onions are slightly soft but not brown, 6 to 8 minutes. Add orange juice and bring to boil; cook until sweet potatoes are almost tender and juice is almost absorbed, about 5 minutes. Add bacon and sweet potato mixture to bowl with bread cubes. Season with more salt and freshly ground black pepper. Cool slightly. DO AHEAD: Can be made 1 day ahead. Cover; chill.",
        "Preheat oven to 350°F. Butter 15 x 10 x 2- inch glass baking dish. Whisk eggs and 1 1/3 cups chicken broth in medium bowl to blend; add to stuffing and toss to combine. Transfer to prepared baking dish.",
        "Bake stuffing uncovered until top is lightly browned and crisp around edges, 50 minutes to 1 hour."
    ],
    "ingredients": [
        "10 cups 1-inch cubes sourdough baguette with crust (from about 1 1/2 one-pound baguettes)",
        "1 pound thick-cut bacon slices, cut into 1/2-inch pieces",
        "2 tablespoons (1/4 stick) butter",
        "6 1/2 cups 3/4-inch cubes peeled redskinned sweet potatoes (yams; about 2 3/4 pounds)",
        "4 cups 1/2-inch onion pieces (from about 2 large onions)",
        "3 cups 1/2- to 3/4-inch celery pieces",
        "1 1/2 tablespoons chopped fresh thyme",
        "1 1/4 teaspoons (or more) coarse kosher salt",
        "1 1/3 cups fresh orange juice",
        "3 large eggs",
        "1 1/3 cups low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Side",
        "Thanksgiving",
        "High Fiber",
        "Dinner",
        "Stuffing/Dressing",
        "Bacon",
        "Sweet Potato/Yam",
        "Family Reunion",
        "Thyme",
        "Potluck",
        "Orange Juice",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sweet Potato Stuffing with Bacon and Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-stuffing-with-bacon-and-thyme-355798"
}
