{
    "directions": [
        "Arrange chickpeas in 1 layer on paper towels and allow to air-dry while frying other ingredients.",
        "Heat oil in a 3-quart heavy saucepan over moderate heat until deep-fat thermometer registers 365°F.",
        "While oil is heating, peel sweet potato and, using peeler (preferably Y-shaped), shave enough thin strips to measure 2 cups (reserve remaining sweet potato for another use).",
        "Fry sweet-potato shavings, 1/2 cup at a time, until golden and just crisp, about 1 minute, then transfer with a slotted spoon to paper towels to drain. (Return oil to 365°F between batches.)",
        "Cool oil to 340°F.",
        "Fry pumpkin seeds in 2 batches, covered (seeds will pop and splatter), until puffed (but not brown), 30 seconds to 1 minute, then transfer with slotted spoon to paper towels to drain. (Return oil to 340°F between batches.)",
        "Fry chiles until crisp but still red, about 1 minute, then transfer with slotted spoon to paper towels to drain.",
        "Fry chickpeas in 2 batches until golden and crisp throughout, 5 to 10 minutes, then transfer with slotted spoon to paper towels to drain.",
        "Toss sweet-potato crisps, pumpkin seeds, chiles, chickpeas, and raisins with sugar, cayenne, and salt to taste."
    ],
    "ingredients": [
        "1 cup canned chickpeas, rinsed, drained, and patted dry",
        "4 cups vegetable oil",
        "1 small sweet potato",
        "1/2 cup hulled (green) pumpkin seeds",
        "3 (4-inch-long) fresh hot red chiles, cut crosswise into 3/4-inch-thick slices",
        "1/4 cup raisins",
        "1 teaspoon sugar",
        "3/4 teaspoon cayenne (optional)",
        "Special equipment: a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Appetizer",
        "Fry",
        "Cocktail Party",
        "Dried Fruit",
        "Raisin",
        "Legume",
        "Chickpea",
        "Hot Pepper",
        "Root Vegetable",
        "Pumpkin",
        "Sweet Potato/Yam",
        "Poker/Game Night",
        "Deep-Fry",
        "Party",
        "Seed",
        "Gourmet",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet-Potato Pumpkin Seed, and Chickpea Party Mix",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-pumpkin-seed-and-chickpea-party-mix-104629"
}
