{
    "directions": [
        "Preheat oven to 350°F. Pierce sweet potato with fork; roast until tender, 1 to 1 1/2 hours, depending on width of potato. Cool. Cut potato in half and scoop flesh into mini processor; puree until smooth. Measure 1 cup puree (reserve any remaining puree for another use). Maintain oven temperature.",
        "Stir 1/2 cup sugar and 2 tablespoons water in medium saucepan over medium-low heat until sugar dissolves. Increase heat to high and boil without stirring until syrup turns deep amber, occasionally swirling pan and brushing down sides with wet pastry brush, about 5 minutes. Immediately pour caramel into 8-inch-diameter metal cake pan, leaving about 2 tablespoons caramel in saucepan. Using pot holders, swirl cake pan, allowing caramel to coat bottom and about 1/2 inch up sides.",
        "Add half and half to remaining caramel in saucepan. Stir over medium-low heat until caramel dissolves. Whisk eggs in medium bowl until frothy. Whisk in cream, salt, 1 cup sweet potato puree, and remaining 1/2 cup sugar. Gradually whisk in hot half and half mixture. Strain into same saucepan. Stir over medium heat 1 minute. Remove from heat; whisk in Port. Pour custard into prepared cake pan.",
        "Place cake pan in large roasting pan. Add enough hot water to roasting pan to come halfway up sides of cake pan. Bake until just set in center, about 1 hour. Remove flan from water. Chill until cold, about 5 hours. DO AHEAD: Can be made 1 day ahead. Cover; keep chilled.",
        "Dip bottom and 1 inch up sides of cake pan into pan of hot water 15 seconds. Wipe dry. Invert onto rimmed plate, scraping caramel in pan over flan."
    ],
    "ingredients": [
        "1 large red-skinned sweet potato (yam; about 12 ounces)",
        "1 cup sugar, divided",
        "2 tablespoons water",
        "1 cup half and half",
        "4 large eggs",
        "1/2 cup whipping cream",
        "1/4 teaspoon salt",
        "2 tablespoons tawny Port"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Sweet Potato/Yam",
        "Fall",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet Potato Flan",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-flan-240091"
}
