{
    "directions": [
        "1. Preheat the oven to 450°F.",
        "2. Remove the giblets from the capon. Rinse out the cavity with cold water and pat it dry. Season it with salt and pepper. Carefully separate the skin from the meat of the breast meat of the capon. Divide the butter in two equal parts, and carefully spread half of it on each side of the breast meat with your fingers, being careful not to break the skin. Carefully lay a bay leaf atop the butter on each side of the breast meat.",
        "3. Coarsely chop the giblets. In a medium-sized bowl, mix together the pork, the breadcrumbs, the giblets, the chestnuts, the thyme, and the spices, working the mixture together with your fingers so it is homogeneous. As you work, the chestnuts will break into pieces — leave them in uneven pieces. Mix in the egg thoroughly with your hands, then season with salt and pepper. Sauté a teaspoon of the stuffing and taste it for seasoning. Adjust if necessary. Place as much of the stuffing as you can fit inside the capon, without packing it in too hard. Place any leftover stuffing in a baking dish.",
        "4. Truss the capon and place it in a roasting pan. Add 1 cup water. Roast it in the center of the oven for 30 minutes, then turn it on one side. Roast it for 25 minutes, then turn it on the other side and roast it for 25 minutes. Finally, leaving it breast up, continue to roast it until the juices of the capon run golden and the stuffing inside the bird reaches a temperature of 160°F, a total of about 2 hours, checking it occasionally to be sure that it isn't browning too much, and adding more water if the pan is dry. Remove the capon from the oven and season it liberally with salt and pepper. Turn it on its breast at an angle, so the juices run into the breast meat, and let it rest for at least 20 minutes before carving.",
        "5. Place the roasting pan over medium heat and add three-quarters cup water. Scrape up any browned bits from the bottom of the pan and cook until reduced by about one-third. Taste for seasoning.",
        "6. To serve the capon, present it first at the table, whole, then carve it. Remove the stuffing in one piece if possible and slice it."
    ],
    "ingredients": [
        "1 4-pound capon, cleaned and trimmed",
        "Fine sea salt and freshly ground black pepper",
        "4 tablespoons unsalted butter, softened",
        "4 imported bay leaves, dried",
        "1 pound 4 ounces lean ground pork",
        "1/2 cup fresh bread crumbs",
        "6 candied chestnuts (or 10 regular, peeled chestnuts)",
        "1/4 teaspoon freshly ground cinnamon",
        "1/4 teaspoon freshly ground allspice",
        "1 large egg",
        "Fine sea salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Game",
        "Nut",
        "Pork",
        "Poultry",
        "Roast",
        "Christmas",
        "Dinner",
        "Stuffing/Dressing",
        "Spice",
        "Fall",
        "Winter",
        "Chestnut",
        "Party",
        "Sugar Conscious",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Sweet Stuffed Capon",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-stuffed-capon-104677"
}
