{
    "directions": [
        "Preheat the oven to 350 degrees F. Poke the sweet potato with a fork a few times and bake until soft in the center, about 40 minutes. Let cool, then scoop out the flesh and puree in a food processor until smooth.",
        "Turn the oven down to 200 degrees F (to keep cooked waffles warm). Preheat a waffle iron to medium-high if there are settings (but it's ok if there aren't any). Whisk together the flour, baking powder, baking soda, cinnamon and salt in a medium bowl. Whisk together the buttermilk, 1/2 cup of the sweet potato puree, the oil, brown sugar, egg and egg white. Pour the buttermilk mixture into the flour mixture and gently stir until just incorporated (it's ok if there are lumps).",
        "Lightly brush the top and bottom of the waffle iron with oil, then fill each section about three-quarters of the way full (there should still be some waffle iron showing). Close and cook until the waffles are golden brown and slightly crisp, 6 to 10 minutes. Keep the waffles warm in the oven or covered with foil on a plate while you repeat with the remaining batter.",
        "Switch the oven to broil, and drizzle each waffle with a little syrup and 1/4 cup mini marshmallows. Broil until golden, 15 to 30 seconds."
    ],
    "ingredients": [
        "1 medium sweet potato",
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon fine salt",
        "3/4 cup buttermilk",
        "1/3 cup vegetable oil, plus more for brushing waffle iron",
        "3 tablespoons brown sugar",
        "1 large egg plus 1 large egg white",
        "Pure maple syrup, for serving",
        "1 1/2 cups mini marshmallows"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Waffle Recipes",
        "Sweet Potato",
        "Vegetable",
        "Main Dish Recipes",
        "Broiling",
        "Pureeing Recipes"
    ],
    "title": "Sweet Potato Waffles with Marshmallows",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/sweet-potato-waffles-with-marshmallows-recipe"
}
