{
    "directions": [
        "In large bowl, whisk together 1 3/4 cups milk, heavy cream, and eggs. Gradually whisk in flour until smooth. Whisk in remaining 1 cup milk, sugar, salt, and vanilla. Strain batter through fine-mesh sieve, discarding any lumps. Refrigerate at least 1 hour or up to 2 days.",
        "Using pastry brush or paper towel, lightly coat 6-inch crêpe pan or cast-iron skillet with butter. Heat pan over moderately high heat until butter is hot but not smoking. Whisk batter briefly to reincorporate any settled solids.",
        "Ladle about 2 tablespoons batter into pan, immediately tilting and rotating skillet to coat bottom. Cook until crêpe is just set and golden around edges, 10 to 15 seconds. Using tip of knife, loosen edge of crêpe, then, using fingertips, carefully flip crêpe over. Cook until underside is set, about 20 seconds more. Transfer cooked crêpe to platter and keep warm.",
        "Repeat to cook remaining crêpes, coating pan with butter each time and stacking crêpes on platter. Fill crêpes with desired fillings and serve immediately.",
        "DO AHEAD: Crêpes can be made 1 day ahead. Refrigerate, covered. To rewarm, transfer stack to baking sheet, cover with foil, and heat in 300°F oven about 15 minutes."
    ],
    "ingredients": [
        "2 3/4 cups whole milk",
        "3/4 cup plus 2 tablespoons heavy cream",
        "4 large eggs",
        "2 cups all-purpose flour",
        "2 tablespoons sugar",
        "1/8 teaspoon salt",
        "1 tablespoon vanilla extract",
        "About 4 tablespoons unsalted butter, softened, for cooking crêpes",
        "Assorted fillings, such as fresh lemon juice and sugar or bananas and Nutella"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Brunch",
        "Dessert",
        "Quick & Easy",
        "Bastille Day",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet Crêpes",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-crepes-352470"
}
