{
    "directions": [
        "Heat oil in large saucepan over medium-high heat. Add onion, ginger, and garlic; sauté until onion is tender, about 7 minutes. Add both bell peppers and jalapeño; sauté until beginning to soften, about 5 minutes. Add plum tomatoes and sun-dried tomatoes; sauté until tomatoes soften slightly, about 5 minutes. Add wine and all remaining ingredients; bring to boil. Reduce heat to medium-low; simmer until all vegetables are soft and mixture thickens slightly, stirring occasionally, about 25 minutes. Cool slightly.",
        "Puree barbecue sauce in processor or blender until almost smooth, adding water by tablespoonfuls for desired sauce consistency. Season with salt and pepper. DO AHEAD: Can be made 1 week ahead. Cool slightly, then cover and refrigerate.",
        "Smoked sun-dried tomatoes (julienne cut) are sold in three-ounce packages in the produce section of some supermarkets and at specialty foods stores. For a list of stores, go to calsundry.com."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 cup chopped onion",
        "1/4 cup thinly sliced peeled fresh ginger",
        "2 garlic cloves, chopped",
        "1 cup chopped green bell pepper",
        "3/4 cup chopped red bell pepper",
        "1 jalapeño chile, seeded, chopped",
        "2 large plum tomatoes, chopped",
        "1/4 cup smoked sun-dried tomatoes or regular sun-dried tomatoes (not packed in oil), thinly sliced",
        "1/2 cup dry red wine",
        "1/2 cup ketchup",
        "1/2 cup distilled white vinegar",
        "1/4 cup (packed) golden brown sugar",
        "2 tablespoons mild-flavored (light) molasses"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Sauce",
        "Ginger",
        "Pepper",
        "Tomato",
        "Low Fat",
        "Vegetarian",
        "Low Cal",
        "Bell Pepper",
        "Low Cholesterol",
        "Jalapeño"
    ],
    "title": "Sweet-Hot Barbecue Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-hot-barbecue-sauce-241103"
}
