{
    "directions": [
        "1. Prepare the batter: In a medium bowl, stir together the eggs, cornstarch, and flour. The batter should be liquidy enough to coat the pork. If the batter looks too dry, add 1 to 2 tablespoons of water and stir again. Add the pork and stir gently to coat. Let stand at room temperature for 10 minutes.",
        "2. Prepare the sauce: In a small bowl, stir together the water, ketchup, pineapple juice, cider vinegar, Worcestershire sauce, soy sauce, and sugar until the sugar is dissolved. Set aside.",
        "3. Heat the peanut oil in a wok until it registers 350°F on an instant-read oil thermometer. Working in 2 or 3 batches, add the first batch of pork cubes and fry until golden brown on the outside and cooked through, 4 to 5 minutes. Remove the pork with a slotted spoon and drain on a plate lined with paper towels. Remove any excess bits of batter from the oil with a slotted spoon or fine-mesh strainer. Continue frying the rest of the pork.",
        "4. Transfer the oil to a heat-proof container. (It will take about 1 hour to fully cool, after which you can transfer it to a container with a tight lid to dispose of it.) Wipe up any food remains in the wok with paper towels, being careful not to touch the metal directly with your hands.",
        "5. Heat the remaining 1 tablespoon oil in the wok or a skillet over medium-high heat. Add the garlic and ginger and stir-fry until just aromatic, about 20 seconds. Add the pineapple and the sauce and stir to coat the vegetables. Let the sauce simmer for 2 to 3 minutes to allow the pineapple to become tender (about 1 minute for canned pineapple). Return pork to the wok and toss until well coated with the sauce. Transfer to a plate and serve."
    ],
    "ingredients": [
        "2 large eggs, beaten",
        "1/4 cup cornstarch",
        "1/4 cup all-purpose flour",
        "1 pound boneless pork loin, cut into1-inch pieces",
        "3 tablespoons water",
        "2 tablespoons ketchup",
        "2 tablespoons fresh pineapple juice, or juice from the canned pineapple, or substitute orange juice",
        "1 1/2 tablespoons cider vinegar",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon soy sauce",
        "2 tablespoons sugar",
        "2 cups peanut or vegetable oil for frying, plus 1 tablespoon for stir-frying",
        "1 tablespoon minced garlic",
        "1 teaspoon minced fresh ginger",
        "1 cup fresh or canned bite-size pineapple chunks",
        "Instant-read oil thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Pork",
        "Stir-Fry",
        "Dinner",
        "Pineapple",
        "Soy Sauce",
        "Dairy Free",
        "Tree Nut Free"
    ],
    "title": "Sweet and Sour Pork",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-and-sour-pork-51179800"
}
