{
    "directions": [
        "Preheat oven to 400 degrees F. Cut the tops off the garlic heads. Cut two (6x6 inch) squares of Reynolds Wrap(R) Aluminum Foil and place the garlic in the center. Drizzle 1/2 teaspoon of olive oil on top of the garlic and wrap the aluminum foil tightly around each garlic head. Bake for 40 minutes until fragrant. Remove garlic from oven and wait until cool enough to handle. Set aside.",
        "Line two baking sheets with Reynolds Wrap(R) Aluminum Foil. Arrange the sweet potato wedges on one baking sheet. Drizzle 3 tablespoons of olive oil over wedges, and add a generous pinch each of coarse salt and black pepper. Toss to coat.",
        "Arrange the bread cubes on the second baking sheet. Drizzle with 1/4 cup olive oil, and sprinkle with thyme, and a pinch of coarse salt and black pepper. Toss to coat. Bake for 25 minutes until the sweet potato is tender and the croutons are crispy and brown.",
        "Combine the croutons, frisee, ricotta salata and sherry vinegar on a platter. Squeeze the roasted garlic over them and gently toss to combine. Add the sweet potato wedges, toasted hazelnuts and cilantro. Add additional salt and pepper to taste."
    ],
    "ingredients": [
        "2 heads garlic",
        "1/2 teaspoon olive oil",
        "3 medium sweet potatoes, cut into 1/2-inch wedges",
        "7 tablespoons olive oil, divided",
        "4 cups cubed day-old bread",
        "1 tablespoon chopped fresh thyme",
        "Salt to taste",
        "1/4 teaspoon Ground black pepper to taste",
        "2 cups frisee (or other bitter green such as radicchio or endive), chopped",
        "4 ounces ricotta salata or feta cheese",
        "1/4 cup sherry vinegar",
        "1/2 cup toasted hazelnuts, coarsely chopped",
        "1/2 cup chopped fresh cilantro",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet Potato Salad with Garlic Bread and Frisee",
    "url": "http://allrecipes.com/recipe/244910/sweet-potato-salad-with-garlic-bread/"
}
