{
    "directions": [
        "Combine dark sweet cherries and sour cherries with sugar, cornstarch, lemon juice, and vanilla extract in medium saucepan; toss to coat. Let cherry mixture stand 30 minutes at room temperature. Stir gently over medium-high heat until mixture boils and thickens slightly, about 2 minutes. Cool cherry compote completely. DO AHEAD: Compote can be made 1 day ahead. Cover and chill.",
        "Combine heavy cream, goat cheese, and powdered sugar in medium bowl. Scrape in seeds from vanilla bean (reserve bean for another use). Using electric mixer, beat until mixture is smooth and peaks form (do not overbeat or mixture may curdle). DO AHEAD: Goat cheese cream can be made 6 hours ahead. Cover and chill. Rewhisk just until thick and smooth before using.",
        "Position rack in center of oven and preheat to 375°F. Roll out 1 puff pastry sheet on lightly floured work surface to 11 1/2-inch square. Cut into 4 equal squares. Repeat with second puff pastry sheet.",
        "Arrange 6 pastry squares like diamonds on work surface, spacing apart (reserve remaining 2 squares puff pastry for another use). Place 1/6 of cherry compote in center of lower half of each pastry diamond. Brush edges of pastry with beaten egg. Fold top half of pastry over filling on lower half, forming triangle. Press firmly on pastry edges to adhere, then fold edges over, enclosing filling completely and creating double edges; press with fork to seal.",
        "Place turnovers on large rimmed baking sheet, spacing 2 to 3 inches apart. Using tines of fork, pierce top crust of each turnover in 3 places to allow steam to escape during baking. Brush tops and edges of turnovers with beaten egg; sprinkle with raw sugar.",
        "Bake turnovers until crust is golden and filling is bubbling thickly through steam holes in crust, about 35 minutes. Cool slightly. Serve turnovers warm or at room temperature with goat cheese cream.",
        "Also called turbinado or demerara sugar; available at most supermarkets and at natural foods stores.",
        "Sour cherries may be difficult to find in most supermarkets, but they can be ordered from King Orchards (kingorchards.com or 877-937-5464)."
    ],
    "ingredients": [
        "1 1/2 cups pitted dark sweet cherries",
        "1 1/2 cups pitted sour cherries",
        "1/4 cup sugar",
        "2 teaspoons cornstarch",
        "1 teaspoon fresh lemon juice",
        "1/2 teaspoon vanilla extract",
        "1 1/2 cups chilled heavy whipping cream",
        "3 ounces soft fresh goat cheese, crumbled",
        "1/4 cup powdered sugar",
        "1 2-inch piece vanilla bean, split lengthwise",
        "1 17.3-ounce package frozen puff pastry (2 sheets), thawed",
        "1 egg, beaten to blend",
        "2 tablespoons raw sugar*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Fruit",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bake",
        "High Fiber",
        "Goat Cheese",
        "Cherry",
        "Vanilla",
        "Summer",
        "Phyllo/Puff Pastry Dough",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet-and-Sour Cherry Turnovers with Goat Cheese Cream",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-and-sour-cherry-turnovers-with-goat-cheese-cream-242723"
}
