{
    "directions": [
        "Bring sweet potatoes and 1 1/2 cups water to a boil with turmeric, cayenne, and 1 teaspoon salt in a 3-quart saucepan, then simmer, covered, until tender, 8 to 10 minutes.",
        "Meanwhile, toast coconut in a small heavy skillet over medium heat, stirring constantly, until very toasted (pale reddish-brown all over; be careful not to burn). Transfer to a plate.",
        "Break sweet potatoes up with the back of a spoon so that some chunks remain. Add toasted coconut, beans, garlic, cumin, chile, and remaining 1/2 cup water and simmer, stirring occasionally, 5 minutes. If mixture becomes too thick and begins to stick to bottom of saucepan, add more water.",
        "Heat oil in cleaned small heavy skillet over medium-high heat until it shimmers. Add mustard seeds, and cook until seeds begin to pop and/or turn gray. Add red pepper flakes and curry leaves (if using), covering skillet immediately and cooking just long enough for leaves to crackle. Stir spice mixture into sweet potato mixture (it will be very thick and chunky). Season with salt."
    ],
    "ingredients": [
        "3 medium sweet potatoes (1 3/4 pound total), peeled and cut into 1-inch pieces (about 5 cups)",
        "2 cups water, divided",
        "1/4 teaspoon ground turmeric",
        "1/8 teaspoon cayenne pepper",
        "Salt",
        "1/2 cup grated dried unsweetened coconut",
        "1/2 cup canned kidney beans, rinsed and drained",
        "1/2 teaspoon minced garlic",
        "1/2 teaspoon ground cumin",
        "1 small fresh green chile, such as serrano, Thai, or jalapeño, slit lengthwise with stem end intact",
        "2 tablespoons vegetable oil",
        "1/2 teaspoon brown mustard seeds",
        "1/8 teaspoon hot red pepper flakes",
        "10 fresh curry leaves (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Potato",
        "Appetizer",
        "Side",
        "Vegetarian",
        "Coconut",
        "Spice",
        "Root Vegetable",
        "Sweet Potato/Yam",
        "Vegan",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sweet Potato with Toasted Coconut",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-with-toasted-coconut-394652"
}
