{
    "directions": [
        "Preheat an oven to 375 degrees F (190 degrees C). Butter a baking dish.",
        "Heat the canola oil in a large skillet over medium-high heat. Cook the ground pork and cooked ham in the hot oil until the pork is completely cooked and no longer pink, 7 to 10 minutes. Remove from the skillet and set aside, reserving 2 tablespoons of the drippings in the skillet.",
        "Reduce the heat to medium-low. Place the skillet over the heat and add the sofrito; cook and stir the sofrito for 5 minutes. Add the olives, capers, salt, garlic powder, oregano, and tomato sauce to the sofrito; cook and stir another 5 minutes. Return the ground pork and ham to the skillet and stir; simmer for 15 minutes, stirring a few times while it cooks.",
        "Bring a pot of lightly salted water to a boil. Rinse the plantains and cut off their tips, leaving the skin on; cut each plantain into 2 to 3 segments each about 3 inches long. Cook the plantains in the boiling water until tender, about 15 minutes; drain and peel. Put the peeled plantains in a mixing bowl and mash with a potato masher. Add the softened butter and sugar; mix.",
        "Spread about half of the plantain mixture into the bottom of the prepared baking dish. Layer the meat mixture over the plantains. Top with the remaining plantain mixture.",
        "Bake in the preheated oven for 15 minutes. Brush the top with the melted butter and continue baking until the top is browned, about 10 minutes more. Remove from oven and allow to rest 10 to 15 minutes before slicing to serve."
    ],
    "ingredients": [
        "2 tablespoons canola oil",
        "1 pound ground pork",
        "2 ounces cooked ham, cut into small dice",
        "1/2 cup sofrito",
        "12 small pitted olives, chopped",
        "1 tablespoon capers, drained and chopped",
        "3/4 teaspoon salt",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon dried oregano",
        "1/2 cup tomato sauce",
        "5 large plantains",
        "1/4 cup butter, softened",
        "3/4 teaspoon white sugar",
        "2 tablespoons melted butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet Plantain Pie",
    "url": "http://allrecipes.com/recipe/214829/sweet-plantain-pie/"
}
