{
    "directions": [
        "Preheat oven to 300°F. Puree first 4 ingredients in blender until smooth. Heat 3 tablespoons oil in large wide ovenproof pot over medium-high heat. Add onions and whole shallots. Sauté until onions are deep golden and shallots begin to brown, about 20 minutes. Transfer shallots to small bowl; reserve. Add chicken broth to onions; bring to boil, scraping up browned bits. Pour onion mixture into large bowl. Add 2 tablespoons oil to same pot. Sprinkle brisket on all sides with salt and pepper. Add to pot and brown well, about 5 minutes per side. Turn brisket fat side up. Return onion mixture to pot. Add tomato puree and orange juice mixture. Bring to boil, stirring to blend sauce.",
        "Cover pot; bake brisket 2 hours. Add shallots and potatoes. Cover; bake 1 hour. Uncover; bake until brisket is tender, occasionally spooning sauce over, about 1 hour longer. Let rest 30 minutes. (Can be made 2 days ahead. Chill uncovered until cold, then cover and keep chilled.)",
        "Scrape sauce off brisket. Transfer brisket to work surface; slice thinly across grain, trimming any fat, if desired. Overlap hot slices on platter or cold slices in 13x9x2-inch glass baking dish. Surround with shallots and potatoes. Rewarm sauce. Spoon some sauce over. Rewarm brisket, if necessary, in 350°F oven until heated through. Serve, passing remaining sauce separately."
    ],
    "ingredients": [
        "1 1/2 cups orange juice",
        "5 large soft dates (such as Medjool), pitted",
        "4 large garlic cloves, peeled",
        "1/2 teaspoon ground cloves",
        "5 tablespoons olive oil, divided",
        "2 pounds onions, thinly sliced",
        "16 large shallots, peeled",
        "2 1/2 cups low-salt chicken broth",
        "1 4 3/4- to 5-pound flat-cut (also called first-cut) brisket, trimmed of all but 1/4 inch of fat",
        "1 1/2 cups canned tomato puree",
        "16 1- to 1 1/2-inch-diameter red-skinned new potatoes, scrubbed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Fruit",
        "Potato",
        "Roast",
        "Passover",
        "Purim",
        "Spring",
        "Kosher",
        "Shallot"
    ],
    "title": "Sweet-and-Sour Brisket with Shallots and New Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-and-sour-brisket-with-shallots-and-new-potatoes-231882"
}
