{
    "directions": [
        "About one hour before you plan to start grilling, make the rub: In a small bowl, combine the brown sugar, salt, onion powder, chili powder, paprika and pepper. Pat the ribs dry with paper towels, then sprinkle both sides of each rack with the rub. Set aside at room temperature for one hour.",
        "Preheat the grill for indirect cooking at 250 to 300 degrees F. Add the drained wood chips, if using.",
        "Place the ribs, meaty side up, over a drip pan, close the grill, and cook for 2 hours, adding about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.",
        "Meanwhile, make the sauce: In a medium saucepan over medium heat, combine the honey, soy sauce, jam, vinegar and garlic sauce and bring to a boil. Reduce to a simmer and cook 15 minutes, stirring frequently, until lightly thickened. Set aside to cool to room temperature, then refrigerate.",
        "Continue to cook the ribs until they're so tender the rack will easily break when bent with tongs, 1 to 2 more hours, spraying on both sides with the tamarind juice every 20 to 30 minutes. Brush the ribs on both sides with the sauce and continue to cook for about 5 minutes, until the sauce is set. Remove from the grill and let stand for 5 minutes.",
        "Cut the racks into 3- or 4-rib sections and serve. Pass any remaining sauce at the table."
    ],
    "ingredients": [
        "2 racks Smithfield® Extra Tender Pork Back Ribs, membrane removed",
        "Rub:",
        "1/4 cup packed light brown sugar",
        "3 tablespoons fine sea salt",
        "4 1/2 teaspoons onion powder",
        "4 1/2 teaspoons chili powder",
        "4 1/2 teaspoons paprika",
        "2 teaspoons ground black pepper",
        "Sauce:",
        "3/4 cup clover honey",
        "1/2 cup reduced-sodium soy sauce",
        "2 tablespoons red plum jam",
        "1 tablespoon apple cider vinegar",
        "1 tablespoon chili garlic sauce*",
        "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional)",
        "3/4 cup tamarind juice, in a spray bottle*"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet & Spicy Asian Style BBQ Back Ribs",
    "url": "http://allrecipes.com/recipe/242419/sweet-spicy-asian-style-bbq-back-ri/"
}
