{
    "directions": [
        "1. To make the sweet potato filling, bring a medium pot of salted water to a boil over high heat. Boil the sweet potato chunks just until tender, about 10 minutes.",
        "2. Drain the potatoes, reserving 1/4 cup of the cooking water.",
        "3. Transfer the hot potatoes and reserved cooking water, the brown sugar, vegan butter, vanilla, and salt to a medium bowl. Beat with a hand mixer until totally smooth, then set aside to fully cool.",
        "4. Meanwhile, make the sweet kraut. Heat the oil in a medium sauté pan over medium heat. Add the cabbage and allow it to start to sear for about 3 minutes, then add the brown sugar and spices. Let the sugar start to melt with the cabbage juice for another 3 minutes, then add the Riesling. Allow the cabbage to cook down and steam itself for another 8 to 10 minutes. The cabbage will now be dark pink instead of purple. Remove the pan from the heat and let it cool fully.",
        "5. While the potatoes and kraut are cooling, make the turnover crust. Pulse together the flour, vegan butter, and vegan shortening until it looks chunky and sandy. Add the sugar, olive oil, cinnamon, salt, and allspice and pulse again. While pulsing, slowly drizzle in 2 to 3 tablespoons cold water, little by little-just until a loose dough ball is formed and spins around the bowl of the food processor. Wrap the dough in plastic wrap and refrigerate for at least 10 minutes or up to 2 days.",
        "6. Preheat the oven to 400°F. Line a sheet pan with parchment paper.",
        "7. On a work surface dusted with flour, roll out the dough to 1/4 inch thick. Use a 4-inch-wide circle cutter to stamp out the turnover shells. Place 1 heaping tablespoon of the sweet potato filling in the center of each dough circle. Bring the edges of the circle together, forming a half circle, and pinch them together tightly. Use a fork to crimp the edges of the seal. Arrange the turnovers on the prepared sheet pan.",
        "8. Bake the turnovers until golden brown, 10 to 12 minutes. Remove from the oven and allow to cool slightly. Arrange on serving dishes with the sweet kraut and serve."
    ],
    "ingredients": [
        "1 large sweet potato, peeled and chopped into 1-inch chunks",
        "1/2 cup packed light brown sugar",
        "3 tablespoons vegan butter",
        "1 1/2 teaspoons pure vanilla extract",
        "1/2 teaspoon salt",
        "1 tablespoon olive oil",
        "2 cups thinly sliced red cabbage (approximately 1/4 head, outer leaves and stem removed)",
        "1/4 cup packed light brown sugar",
        "1/2 teaspoon ground cinnamon",
        "Pinch of ground allspice",
        "Pinch of ground cloves",
        "1 cup sweet Riesling",
        "1 cup all-purpose flour, plus more for dusting",
        "1 tablespoon vegan butter, cold",
        "1 tablespoon vegan shortening, cold",
        "2 tablespoons granulated sugar",
        "1 tablespoon olive oil",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground allspice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Sweet Potato/Yam",
        "Fall",
        "Chill",
        "Vegan",
        "Cabbage",
        "Advance Prep Required",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Sweet Potato Turnovers with Sweet Kraut",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-turnovers-with-sweet-kraut-51199410"
}
