{
    "directions": [
        "Combine the beef shanks and water in a large stock pot. Bring to a boil and reduce the heat to a very low simmer. Use a strainer to skim off any foam on the surface. Add the carrot pieces, whole onions, celery stalks, bay leaf, and peppercorns. Simmer for 4 hours, skimming the surface occasionally.",
        "Strain the stock. Discard the vegetables but reserve the meat. Allow the stock to cool to room temperature, then transfer to a covered container and refrigerate overnight. When the beef shanks are cool, remove the meat from the bones. Discard bones and gristle. Dice the meat and any remaining marrow into small cubes. Cover the container and refrigerate overnight.",
        "The next day, heat the vegetable oil in a stock pot or Dutch oven over medium heat. Stir in the garlic and 1 diced onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the paprika and cook 1 additional minute, stirring constantly. Gradually add the cabbage and cook, stirring occasionally, until slightly wilted and reduced in bulk, about 8 minutes.",
        "Remove the beef stock from the refrigerator; skim and discard any fat. Pour the stock into the pot; stir in the reserved chopped beef. Add the tomatoes with their juice. Bring the soup to a boil, and then reduce the heat to a simmer. Cook the soup, partially covered, until the cabbage is quite soft, about 1 hour.",
        "Stir in the lemon juice, sugar, dill, salt, and pepper. Add more water, if desired, for a thinner soup. Cook for 5 minutes, uncovered. Taste and adjust the seasonings before serving."
    ],
    "ingredients": [
        "For the stock:",
        "4 pounds bone-in beef shank",
        "12 cups water",
        "3 carrots, peeled and cut into 3-inch pieces",
        "3 onions, peeled",
        "4 stalks celery with leaves",
        "1 bay leaf",
        "16 peppercorns",
        "For the soup:",
        "2 tablespoons vegetable oil",
        "1 onion, peeled and diced",
        "2 cloves garlic, minced",
        "1 tablespoon sweet Hungarian paprika",
        "1 head Savoy cabbage, coarsely chopped",
        "1 (14.5 ounce) can diced tomatoes with juice",
        "1 lemon, juiced",
        "1/4 cup white sugar",
        "1/4 cup chopped fresh dill",
        "salt and freshly ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet and Sour Cabbage Soup",
    "url": "http://allrecipes.com/recipe/213620/sweet-and-sour-cabbage-soup/"
}
