{
    "directions": [
        "To make the crust, put the flour, sugar, coconut, and salt in a food processor and pulse a few times to combine. Add the butter and shortening and pulse until the mixture resembles coarse cornmeal. Add the egg yolks to the water and, with the machine running, pour it through the feed tube. Pulse until the dough comes together and forms a ball. Turn it out onto a sheet of plastic wrap, flatten it into a disk, and wrap it tightly. Chill for at least 1 hour, or overnight.",
        "To make the rum crème anglaise, whisk the egg yolks and sugar in a medium bowl until smooth and pale yellow. In a medium saucepan, bring the half-and-half to a boil. Remove from the heat. Gradually add about 1/2 cup of the half-and-half to the egg yolks, whisking constantly, to temper them. Transfer the egg mixture to the saucepan with the remaining half-and-half and cook, stirring constantly, until the sauce coats the back of a spoon, 2 to 3 minutes; it should register 175°F on an instant-read thermometer. Strain into a bowl and add the vanilla bean and rum. Let cool to room temperature, then refrigerate until chilled. (The crème anglaise can be refrigerated for up to 3 days.)",
        "On a lightly floured surface, roll the dough out to a 12-inch round. Fit the dough into a 10-inch fluted pan with a removable bottom, pressing it gently onto the bottom and up the sides. Trim the excess dough. Prick all over the bottom with a fork. Chill until firm, about 30 minutes.",
        "Preheat the oven to 375°F.",
        "Line the tart shell with parchment paper or foil and fill with dried beans or pie weights. Bake for 20 minutes. Remove the paper and weights and bake for 5 to 10 minutes longer, or until golden brown and crisp on the bottom. Let cool slightly on a rack before filling, about 20 minutes.",
        "To make the filling, prick the sweet potatoes a few times with a fork. Bake for about 45 minutes, until tender. Let cool.",
        "Peel the sweet potatoes and pass through a food mill. (You need 2 cups pureed sweet potatoes for the filling.)",
        "Lower the oven to 350°F.",
        "In a large bowl, combine the sweet potatoes, eggs, sugar, salt, ginger, cinnamon, vanilla extract, half-and-half, and butter and whisk with a sturdy whisk until satiny smooth. (The filling can be made ahead, covered, and refrigerated for up to 2 days.)",
        "To make the streusel, put the pecans, flour, sugar, cinnamon, and salt in a food processor and pulse a few times to combine. Add the butter and pulse a few times until the mixture comes together a bit. Transfer the mixture to a bowl and, working quickly, rub the mixture between your fingers until the streusel is in lumps slightly larger than peas.",
        "Pour the filling into the prebaked crust. Sprinkle the streusel evenly over the top of the tart. Bake for 30 to 40 minutes, or until the filling is slightly puffed and set in the middle. Let cool slightly on a rack. To serve, cut the tart into wedges and drizzle with rum crème anglaise.",
        "Cinnamon crème anglaise is another worthy companion if rum doesn't suit your fancy. Simply omit the rum and add 1/4 teaspoon cinnamon along with the vanilla."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "2 1/2 teaspoons sugar",
        "1 cup shredded unsweetened coconut",
        "1 teaspoon Kosher salt",
        "12 tablespoons (1 1/2 sticks) cold unsalted butter, diced",
        "1/2 cup vegetable shortening",
        "2 large egg yolks",
        "1/4 cup ice water",
        "4 large egg yolks",
        "1/4 cup sugar",
        "1 1/2 cups half-and-half",
        "1/4 vanilla bean, split",
        "1 tablespoon dark rum",
        "2 medium sweet potatoes, scrubbed",
        "2 large eggs",
        "3/4 cup sugar",
        "1/2 teaspoon Kosher salt",
        "1/2 teaspoon ginger, or to taste",
        "Pinch of cinnamon, or to taste",
        "1 teaspoon pure vanilla extract",
        "1 2/3 cups half-and-half",
        "8 tablespoons (1 stick) unsalted butter, melted and cooled slightly",
        "1/2 cup pecans, toasted and coarsely chopped",
        "1/2 cup all-purpose flour",
        "1/2 cup sugar",
        "1/4 teaspoon cinnamon",
        "Pinch of salt",
        "4 to 6 tablespoons cold unsalted butter, diced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Nut",
        "Vegetable",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Coconut",
        "Pecan",
        "Sweet Potato/Yam",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet Potato Tart with Coconut Crust and Pecan Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-tart-with-coconut-crust-and-pecan-streusel-231143"
}
