{
    "directions": [
        "Cut the pork into 1-inch cubes. In a medium bowl, combine the salt, baking soda, and 1 tablespoon water. Whisk in the egg. Place the pork pieces in the bowl and turn to coat. Set aside while you prepare the other ingredients.",
        "Whisk the white sugar, salt, and cornstarch together in a small bowl. Stir in the vinegar, ketchup, plum sauce, and water.",
        "Place the tapioca flour in a large, resealable plastic bag. Place the pork pieces in the bag with the flour and shake the meat around until all the pieces are coated with the flour. Discard the marinade and excess tapioca flour.",
        "Heat 1 cup oil in a large skillet or wok over medium high heat. Working in batches, place the pork pieces in the oil and fry for 5 to 10 minutes, or until golden brown on all sides. Remove the pork from the oil and drain on a paper towel-lined plate. Carefully pour out the frying oil into a separate container to cool.",
        "Pour 2 tablespoons fresh cooking oil into the pan. Over medium-high heat, stir-fry the green bell pepper, red chile pepper, pineapple, onion and tomato until the vegetables are tender, about 5 minutes.",
        "Stir in the reserved sauce mixture. Bring sauce to a boil, stirring constantly, until thickened, about 3 minutes. Return pork pieces to the skillet, mix well, and serve immediately."
    ],
    "ingredients": [
        "1 pound boneless center-cut pork loin chops",
        "1 teaspoon salt",
        "1/2 teaspoon baking soda",
        "1 tablespoon water",
        "1 egg",
        "For the Sauce:",
        "1/4 cup white sugar",
        "1/2 teaspoon salt",
        "1 1/2 tablespoons cornstarch",
        "1/4 cup white vinegar",
        "3 tablespoons ketchup",
        "2 tablespoons plum sauce",
        "5 tablespoons water",
        "1/4 cup tapioca starch",
        "1 cup oil for frying, or as needed",
        "1 green bell pepper, cut into 1-inch pieces",
        "2 tablespoons vegetable oil",
        "1 red chile pepper, minced (optional)",
        "1/2 cup crushed pineapple",
        "1 onion, chopped",
        "1 tomato, coarsely chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet and Sour Pork I",
    "url": "http://allrecipes.com/recipe/17626/sweet-and-sour-pork-i/"
}
