{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "To Make Crust: In a medium bowl, stir together 1 cup flour, 1/4 cup sugar, 1 1/2 teaspoons lemon zest and 1 1/2 teaspoons orange zest. Cut in butter until mixture resembles coarse crumbs; stir in coconut. Mix together egg yolk and water; stir into flour mixture. Form dough into ball.",
        "Press slightly less than half the mixture onto the bottom of a 9 inch springform pan with the sides removed. Place on shallow baking sheet and bake for 15 minutes or until lightly browned. Let cool. Attach sides onto pan and press remaining mixture all the way up the sides of the pan; set aside.",
        "To Make Filling: In a large bowl, combine cream cheese, 3/4 cup sugar, 3 tablespoons flour, 1 tablespoon lemon zest, 1 tablespoon orange zest, cinnamon and nutmeg. Beat until smooth. Blend in sweet potatoes and eggs. Stir in heavy cream. Pour mixture into prepared crust. Place pan in a shallow baking sheet.",
        "Bake in preheated oven for 65 to 70 minutes or until center of the pie is nearly set.",
        "Cool in pan on wire rack for 15 minutes. Using a small spatula or knife, loosen the crust from the sides of the pan; cool for an additional 30 minutes. Remove sides of the pan and allow pie to cool completely. Cover and refrigerate for at least 4 hours before serving."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "1/4 cup white sugar",
        "1 1/2 teaspoons lemon zest",
        "1 1/2 teaspoons orange zest",
        "1/2 cup butter, chilled",
        "1/2 cup flaked coconut",
        "1 egg yolk, beaten",
        "1 tablespoon water",
        "3 (8 ounce) packages cream cheese, softened",
        "3/4 cup white sugar",
        "3 tablespoons all-purpose flour",
        "1 tablespoon grated lemon zest",
        "1 tablespoon grated orange zest",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "2 cups cooked and mashed sweet potatoes",
        "4 eggs",
        "1/4 cup heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet Potato Cheesecake",
    "url": "http://allrecipes.com/recipe/19441/sweet-potato-cheesecake/"
}
