{
    "directions": [
        "Combine gyoza dipping sauce, sugar, garlic,  toasted sesame oil and red pepper flakes in a small sauce pan. Cook over medium heat until reduced by half. Remove from heat and set aside.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Place defrosted puff pastry sheet on a lightly floured work surface. Dust the top of the puff pastry sheet with flour, and roll out slightly to form an 11 x 13-inch rectangle. Cut the pastry sheet into 24 equal size rectangles by cutting the 11-inch dimension into 4 equal strips, and then cutting the 13-inch dimension into 6 equal strips.",
        "Lay each rectangle over the hole of a mini muffin tin, and push the middle of the dough down into the muffin tin, to form a cup. (There will be some excess dough that sits on top of the muffin tin, and depending on the size of your mini muffin pan, you may need to bake these in batches, skipping every-other hole of the muffin tin, so that the excess dough does not touch.)",
        "Bake for 8 minutes. Remove from oven and punch down the puffed up middle portion of the pastry cups with a fork. Return to the oven and bake an additional 3 minutes, or until lightly golden brown. Remove from the oven and punch down the centers again with a fork, forming a nice hole for the filling. Let cool completely before removing from the muffin tin.",
        "In a medium bowl, lightly toss the tuna, mango, and sweet bell pepper until evenly combined. Using a small spoon, fill each puff pastry cup with the tuna filling. Drizzle the reserved sauce over the tuna filling and garnish with the chopped green onions and toasted sesame seeds."
    ],
    "ingredients": [
        "1/3 cup gyoza dipping sauce",
        "2 teaspoons granulated sugar",
        "1 clove garlic, minced",
        "1/2 teaspoon sesame oil",
        "1/4 teaspoon crushed red pepper flakes",
        "1 sheet frozen puff pastry, thawed",
        "1 tablespoon all-purpose flour",
        "2 (5 ounce) cans Bumble Bee® Solid White Albacore Tuna in Water, drained",
        "1/3 cup finely diced fresh mango",
        "1 tablespoon chopped green onion",
        "2 tablespoons minced green bell pepper",
        "1/2 tablespoon toasted sesame seeds (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet and Spicy Tuna Cups",
    "url": "http://allrecipes.com/recipe/247017/sweet-and-spicy-tuna-cups/"
}
