{
    "directions": [
        "Preheat oven to 400°F. Pierce potatoes with fork; place on small baking sheet. Roast potatoes until soft, about 1 hour. Cool, peel, and mash potatoes. Measure 2 cups mashed potatoes; cool to lukewarm (reserve any remaining potatoes for another use). Reduce oven temperature to 350°F.",
        "Butter and flour two 9-inch-diameter cake pans with 2-inch-high sides; line pans with parchment. Sift flour and next 6 ingredients into medium bowl. Combine oil, 1 cup sugar, and brown sugar in large bowl; whisk until smooth. Whisk in eggs 1 at a time, then mashed sweet potatoes. Whisk in flour mixture in 3 additions. Stir in 2/3 cup walnuts and 2/3 cup cranberries. Divide batter between prepared pans. Bake cakes until tester inserted into center comes out clean, about 30 minutes. Cool cakes completely in pans on racks.",
        "Using electric mixer, beat cream cheese and butter in large bowl until fluffy. Beat in powdered sugar, scraping down bowl often. Beat in orange juice concentrate and vanilla.",
        "Cut around pan sides; turn out cakes. Peel off parchment. Place 1 cake layer, flat side up, on platter. Spread 3/4 cup frosting over. Top with second cake layer, flat side down. Spread remaining frosting over top and sides of cake. Combine orange peel, 3 tablespoons sugar, remaining 1/4 cup walnuts, and 1/4 cup cranberries in small bowl. Stir to coat with sugar. Transfer to sieve; sift off excess sugar. Sprinkle fruit and nut mixture decoratively atop cake. Chill until frosting sets, at least 2 hours. (Can be made 1 day ahead. Cover with cake dome; keep chilled. Let stand at room temperature 1 hour before serving.)"
    ],
    "ingredients": [
        "2 pounds tan-skinned sweet potatoes (about 3 medium)",
        "3 cups cake flour",
        "2 teaspoons baking soda",
        "2 teaspoons baking powder",
        "2 teaspoons ground cinnamon",
        "1 teaspoon ground ginger",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground cloves",
        "1 cup vegetable oil",
        "1 cup sugar",
        "1 cup (packed) golden brown sugar",
        "4 large eggs",
        "2/3 cup plus 1/4 cup chopped walnuts, toasted",
        "2/3 cup plus 1/4 cup dried cranberries",
        "1 8-ounce package cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "31/4 cups powdered sugar, sifted",
        "2 tablespoons frozen orange juice concentrate, thawed",
        "1/2 teaspoon vanilla extract",
        "1/4 cup sliced candied orange peel",
        "3 tablespoons sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cream Cheese",
        "Orange",
        "Walnut",
        "Sweet Potato/Yam",
        "Fall"
    ],
    "title": "Sweet-Potato Layer Cake with Orange-Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-layer-cake-with-orange-cream-cheese-frosting-105843"
}
