{
    "directions": [
        "Blend flour, almonds, and salt in processor until almonds are finely ground. Using electric mixer, beat butter and powdered sugar in large bowl until fluffy. Add egg and beat until just blended. Add flour mixture in 2 additions, beating until moist clumps form. Gather dough into ball. Flatten into disk. Chill until firm, at least 1 hour and up to 1 day. Soften dough slightly before rolling out.",
        "Roll out dough on lightly floured surface to 14-inch round. Transfer dough to 10-inch-diameter tart pan with removable bottom. Fold in overhang, pressing to form double-thick sides. Pierce bottom of crust all over with fork. Chill crust at least 30 minutes and up to 1 hour.",
        "Preheat oven to 325°F. Bake crust until pale golden, about 25 minutes. Transfer to rack and cool completely. (Can be made 1 day ahead. Store in airtight container at room temperature.)",
        "Preheat oven to 375°F. Roast yam on foil-lined baking sheet until very tender when pierced with skewer, about 45 minutes. Halve yam lengthwise; cool completely.",
        "Scoop 1 cup yam pulp into blender (reserve remaining pulp for another use). Add sugar, cream, eggs, vanilla, spices, and salt and process until smooth. Sprinkle marshmallows and pecans over prepared crust. Pour batter over.",
        "Bake tart until filling is set, about 35 minutes. Transfer to rack and cool completely. (Can be made 1 day ahead. Cover and refrigerate.) Serve cold or at room temperature with whipped cream."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "3/4 cup whole almonds",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/3 cup powdered sugar",
        "1 large egg",
        "1 1-pound yam (red-skinned sweet potato)",
        "3/4 cup sugar",
        "1/2 cup whipping cream",
        "2 large eggs",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1/8 teaspoon ground nutmeg",
        "1/8 teaspoon salt",
        "1 cup mini marshmallows",
        "1/2 cup pecans, toasted, chopped",
        "Sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Almond",
        "Sweet Potato/Yam",
        "Fall",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Sweet Potato Tart with Pecans and Marshmallows",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-tart-with-pecans-and-marshmallows-107339"
}
