{
    "directions": [
        "Preheat oven to 400°F.",
        "On foil-lined baking sheet, toss potato slices with 3 tablespoons melted butter, 1 teaspoon salt, and 1/2 teaspoon pepper. Bake until cooked through and slightly caramelized, about 20 minutes. Keep warm.",
        "In heavy medium skillet over moderate heat, melt 3 tablespoons butter. Add apples and sauté until tender and golden brown, about 15 minutes. Keep warm.",
        "In heavy large pot over moderate heat, combine remaining 2 tablespoons butter and 3 tablespoons water. Add greens and sauté, stirring occasionally, until wilted, about 5 minutes. Lower heat to moderately low and add sweet potatoes and apples. Continue cooking, stirring occasionally, until warmed through, 3 to 4 minutes. Stir in parsley, remaining 2 teaspoons salt, and 1 1/2 teaspoons pepper. Serve hot."
    ],
    "ingredients": [
        "4 medium sweet potatoes, peeled and cut lengthwise into quarters, then cut crosswise into 1/8-inch slices",
        "5 tablespoons unsalted butter, plus 3 tablespoons melted",
        "1 tablespoon fine sea salt",
        "2 teaspoons freshly ground black pepper",
        "3 medium baking apples, such as Sierra Beauty or Granny Smith, peeled, cored, and cut into quarters",
        "6 cups loosely packed braising greens such as kale, chard, or collard greens, stems removed and torn into 2-inch strips",
        "1/4 cup loosely packed fresh parsley leaves, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Leafy Green",
        "Vegetable",
        "Side",
        "Bake",
        "Braise",
        "Sauté",
        "Thanksgiving",
        "Vegetarian",
        "Dinner",
        "Apple",
        "Kale",
        "Root Vegetable",
        "Sweet Potato/Yam",
        "Fall",
        "Winter",
        "Chard",
        "Collard Greens",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sweet Potatoes, Apples, and Braising Greens",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potatoes-apples-and-braising-greens-240487"
}
