{
    "directions": [
        "Heat the oven to 200°F. Line an oven-proof plate or baking sheet with paper towels. Peel and grate the sweet potatoes and squeeze or press them dry if necessary; you want 3 packed cups; save the rest for later.",
        "Combine the grated sweet potato, flour, cornmeal, onion, egg, and sprinkle of salt and pepper and mix well with a fork. If the mixture looks too liquid, add more flour, 1 tablespoon at a time. (You can make the batter ahead of time and refrigerate for up to a couple of hours before cooking.)",
        "Put 2 inches of oil in a large pot over medium heat. When the oil is hot, carefully drop spoonfuls of sweet potato into the pot. (Work in batches to avoid crowding the pot.)",
        "Cook turning them with tongs or a slotted spoon as necessary so they brown on all sides, until they’re cooked through, 5 to 7 minutes. Transfer the finished fritters to the paper towel–lined plate and put it in the oven to keep warm while you make the rest. Serve hot or at room temperature, with more salt and pepper if you like.",
        "Drying Grated Vegetables: Put them into a strainer over a bowl or just squeeze them between your hands.",
        "Heating Oil for Deep Frying: To use a thermometer for deep frying, clip it on the side of the pot and make sure the tiny hole that registers the temperature isn’t touching the pot. If you don’t have a thermometer,  use a pinch of cornmeal or flour to test when the oil is ready for frying: It should sizzle immediately but not burn.",
        "Putting the Fritters in the Oil: To minimize splattering, hold one spoon close to the oil and scrape the batter into the oil with another spoon.",
        "Recognizing Doneness: The fritters should be golden on the outside and soft but not wet in the middle. Check inside—you should still be able to tell the sweet potatoes were grated."
    ],
    "ingredients": [
        "About 1 pound sweet potatoes",
        "1/3 cup all-purpose flour, or more as needed",
        "1/3 cup cornmeal",
        "1/4 cup chopped red onion",
        "1 egg, lightly beaten",
        "Salt and freshly ground black pepper",
        "Vegetable oil for deep frying"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fry",
        "Sweet Potato/Yam",
        "snack",
        "Side",
        "Fritter",
        "Deep-Fry"
    ],
    "title": "Sweet Potato Fritters",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-fritters"
}
