{
    "directions": [
        "Roast red, green, and yellow bell peppers over an open flame or in broiler, turning frequently, until skins are charred and blistered.  Place in a bowl and cover with plastic; let sit 5 to 10 minutes. Remove skins. Cut peppers in half, lengthwise. Remove seeds and stem, and chop into small pieces. Set aside.",
        "Place grated onions in a colander to drain liquid. Place them in a large bowl, and sprinkle with 1/4 cup kosher salt. Mix by hand. Mix in cabbage and 3 tablespoons salt by hand. Let sit 1 hour.",
        "Place onions and cabbage into colander, and squeeze out as much liquid as possible. Place in cheese cloth or towel, and squeeze out additional water.",
        "Place cabbage and onions into a large pot over medium-high heat. Add roasted bell peppers. Stir in sugar, apple cider vinegar, turmeric, mustard seed, and celery seed. Bring to a low boil, stirring constantly to prevent onions from sticking to the bottom. Reduce heat to medium, and simmer for 45 minutes, stirring often.",
        "To prepare jars you first need to wash jars then place them into the canning pot with rack and boil them in water to sterilize them. Fill a small pot half way with water and bring to simmer; place the lids into water. Taking one jar out of the water at a time put on canning funnel and fill with hot relish about 1/2 inch from the top. Then take a kitchen knife a stick down to the bottom of jar and work the knife around to remove all air bubbles. Wipe off top of jar very well and clean then place a hot lid on jar the screw ring on top. Repeat until all relish is gone. Jars and relish must stay hot throughout this canning process.",
        "Place in a bath of simmering water, covering the jars by one inch. Process for 10 minutes, or according to your local extension's guidelines. When jars start to seal and vacuum, the lids will make a pop sound and your canning was a success. Once jars have been opened, store in the refrigerator and use within two weeks."
    ],
    "ingredients": [
        "4 large red bell peppers",
        "4 large green bell peppers",
        "4 large yellow bell peppers",
        "40 cups grated Vidalia onions",
        "1/4 cup kosher salt",
        "2 large heads cabbage, finely shredded",
        "3 tablespoons kosher salt",
        "9 cups white sugar",
        "2 quarts apple cider vinegar",
        "3 tablespoons ground turmeric",
        "3 tablespoons mustard seed",
        "1 tablespoon celery seed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet Vidalia Onion Relish",
    "url": "http://allrecipes.com/recipe/87077/sweet-vidalia-onion-relish/"
}
