{
    "directions": [
        "Put oven rack in middle position and preheat oven to 200°F.",
        "Heat 2 tablespoons oil in a 12-inch nonstick heavy skillet over moderately low heat until hot but not smoking, then cook sweet potatoes, stirring occasionally, until tender and browned, about 15 minutes.",
        "Meanwhile, heat 1 tablespoon oil in a 9- to 10-inch heavy skillet over moderate heat until hot but not smoking, then cook sausage, stirring occasionally and breaking up large lumps, until browned, about 8 minutes. Add onion and cook, stirring occasionally, until softened, 8 to 10 minutes, then add peppers and cook, stirring occasionally, until tender, about 5 minutes.",
        "Add sausage mixture, cilantro, salt, and pepper to potatoes in skillet and toss to combine, then transfer to a large shallow serving dish and keep warm in oven while you prepare eggs. (Wipe out nonstick skillet with a paper towel.)",
        "Carefully break eggs into a bowl without breaking yolks.",
        "Heat remaining 2 tablespoons oil in 12-inch nonstick skillet over moderate heat until hot but not smoking, then pour eggs into skillet and season with salt and pepper. Cook eggs, covered, until edges of whites are crisp and browned but yolks are still soft, 2 to 2 1/2 minutes. Slide eggs onto hash and serve immediately."
    ],
    "ingredients": [
        "5 tablespoons extra-virgin olive oil",
        "2 lb sweet potatoes, peeled and cut into 1/2-inch cubes",
        "3/4 lb hot Italian sausages, casings discarded and sausage coarsely crumbled",
        "1 cup chopped onion (1 medium)",
        "1 lb sweet Italian frying peppers, seeded and cut into 1/2-inch pieces",
        "1/2 cup chopped fresh cilantro",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "6 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Pork",
        "Side",
        "Bake",
        "Sauté",
        "Sausage",
        "Sweet Potato/Yam",
        "Fall",
        "Cilantro",
        "Gourmet",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Sweet-Potato Hash",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-hash-230455"
}
