{
    "directions": [
        "Place the pork shoulder roast into a large plastic bag, pour 1 cup of root beer over the meat, and squeeze out all the air from the bag. Seal the bag closed, and refrigerate 6 hours to overnight.",
        "The next day, mix together the light brown sugar, kosher salt, black pepper, paprika, dry mustard, onion powder, garlic salt, celery salt, cinnamon, ginger, and nutmeg in a bowl.",
        "Remove the meat from the marinade, and shake off the excess. Rub the meat all over with the spice mixture, wrap in plastic wrap, and refrigerate for 30 minutes to 2 hours.",
        "Mix together the balsamic vinegar, 1 1/2 cups of root beer, whiskey, and brown sugar in a bowl, and stir until the sugar dissolves.",
        "Heat the olive oil in a skillet over medium-high heat, and sear the meat on all sides until the meat develops a brown crust, about 3 minutes per side. Place the seared meat into a slow cooker. Pour the balsamic vinegar-root beer mixture over the meat, set the slow cooker to High, and cook for 6 to 8 hours.",
        "Remove the roast from the slow cooker, and shred with 2 forks. Discard the bones and all but 1 cup of the liquid in the slow cooker. Return the shredded meat to the cooker, mix in the barbecue sauce, and let sit on Low until ready to serve. Serve piled on buns."
    ],
    "ingredients": [
        "1 (4.5 pound) bone-in pork shoulder roast",
        "1 cup root beer",
        "2 1/2 tablespoons light brown sugar",
        "2 teaspoons kosher salt",
        "1/2 teaspoon ground black pepper",
        "1 1/2 teaspoons ground paprika",
        "1/2 teaspoon dry mustard",
        "1/2 teaspoon onion powder",
        "1/4 teaspoon garlic salt",
        "1/4 teaspoon celery salt",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon ground nutmeg",
        "1/3 cup balsamic vinegar",
        "1 1/2 cups root beer",
        "1 1/2 fluid ounces whiskey",
        "1/4 cup brown sugar",
        "1 tablespoon olive oil",
        "3/4 cup prepared barbecue sauce",
        "10 hamburger buns, split"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet and Savory Slow Cooker Pulled Pork",
    "url": "http://allrecipes.com/recipe/213262/sweet-and-savory-slow-cooker-pulled-p/"
}
