{
    "directions": [
        "1. Combine the quinoa and 1/2 cup water in a very small saucepan with a lid. Bring to a boil, cover the pot, and lower the heat to the slowest possible simmer, with a heat diffuser, if you have one, underneath. You'll have cooked quinoa in about 20 minutes. Uncover, fluff with a fork, and set aside.",
        "2. Meanwhile, cut the sweet potato into rounds about 1 1/2 inches thick and steam over or cook in boiling water until fork-soft, about 15 minutes. Cool until comfortable to handle. Strip off and discard the peels and transfer to a food processor.",
        "3. Add the chickpeas, ginger, garlic, scallions, 3/4 teaspoon salt, cumin, and 2 tablespoons of the lemon juice to the sweet potato and process until reasonably blended. It doesn't need to be completely smooth.",
        "4. Transfer the mixture to a bowl, then sprinkle in the cooked quinoa and the quinoa flour. Stir until all the quinoa disappears into the mixture. Gently fold in the green peas and peanuts, if using. Taste to see if it needs more salt or lemon juice and add a few big pinches of crushed red pepper flakes to taste.",
        "5. Place a medium skillet over medium heat for about a minute, then add a scant 1/2 tablespoon oil and swirl to coat the pan. Heat for a little longer, until the oil is hot enough to instantly sizzle a dot of the sweet potato mixture. Turn the heat to low.",
        "6. Use a nonstick-sprayed 1/3-cup measure to scoop-shape the batter as uniformly as possible. Carefully transfer as many burgers as will fit in a single layer to the hot, oiled pan, knocking the cup handle assertively against the side of the pan or using the back of a spoon to release the batter. Smooth the top surface with a dinner knife, so the burgers will crisp evenly, and push in the sides to help them keep their shape as they cook.",
        "7. Cook over low heat for 8 to 10 minutes, or until golden brown on the bottom. (Longer cooking is OK—just not hotter. The sugar content of sweet potatoes causes them to burn easily at higher temperatures.) Use a small spatula with a thin blade to carefully loosen each burger and flip it over, adding more oil as needed and pushing the burgers back into shape if they slump or break.",
        "8. Cook on the second side for 8 to 10 minutes, or until the bottoms are nicely browned. Continue to cook in batches until all the batter has been used. Serve hot or warm.",
        "Toasted peanuts on top * Steamed peas on top * Yogurt or Raita * Salsa Verde * A drizzle of pomegranate molasses"
    ],
    "ingredients": [
        "1/3 cup quinoa",
        "1 medium orange sweet potato (3/4 pound)",
        "1 1/2 cups cooked chickpeas or one 15-ounce can, rinsed and thoroughly drained",
        "1 heaping tablespoon finely minced fresh ginger",
        "1 teaspoon minced or crushed garlic",
        "3 scallions (whites plus light greens), cut into 1-inch pieces",
        "3/4 teaspoon salt, or more to taste",
        "2 teaspoons cumin seeds, lightly toasted",
        "2-3 tablespoons fresh lemon juice, or to taste",
        "6 tablespoons quinoa flour",
        "1 cup green peas (steamed fresh or defrosted frozen)",
        "1 cup unsalted peanuts, lightly toasted (optional)",
        "Crushed red pepper",
        "About 2 tablespoons grapeseed or high-oleic safflower oil for frying",
        "Nonstick cooking spray"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Vegetarian",
        "Dinner",
        "Quinoa",
        "Root Vegetable",
        "Sweet Potato/Yam",
        "Vegan",
        "Party",
        "Advance Prep Required",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sweet Potato–Chickpea-Quinoa Burgers",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-chickpea-quinoa-burgers-51196430"
}
