{
    "directions": [
        "For the caramelized onions: Heat the oil over medium heat in a large nonstick skillet. Add the onions, vinegar, salt and pepper, stirring occasionally, until the onions are deep golden brown, about 20 minutes.",
        "Fries: Drain the potatoes and dry completely on a clean kitchen towel. In a large heavy-bottomed saucepan, pour enough oil to fill the pan about a third of the way. Heat over medium-high heat until a deep-frying thermometer inserted in the oil reaches 375 degrees F. (If you don't have a thermometer a cube of bread will brown in about 5 minutes.)",
        "While the oil is heating, in a large bowl, whisk together the flour, baking powder, baking soda, salt and 2 1/2 cups water until smooth. Coat the potatoes in the batter. Transfer 8 to 10 potatoes to the oil, allowing any excess batter to drip back into the bowl. Fry until golden and crisp, 5 to 6 minutes. Drain on paper towels. Repeat with the remaining potatoes.",
        "For the sauce: In a small skillet, melt the butter over low heat. Add the thyme and garlic and cook for 2 minutes. Pour the sauce over the fries and gently toss until coated.",
        "Place the fries on a platter and spoon the onions on top. Sprinkle with fontina and serve immediately."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "2 red onions, thinly sliced",
        "1 tablespoon balsamic vinegar",
        "1/4 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "2 1/2 pounds sweet potatoes or garnet yams (about 3 medium), scrubbed, unpeeled and cut into 1/4-inch-by-4-inch fries, soaked in ice water",
        "Canola oil or vegetable oil",
        "2 1/2 cups all-purpose flour",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon kosher salt",
        "1/4 cup (1/2 stick) unsalted butter, at room temperature",
        "1 tablespoon chopped fresh thyme",
        "3 cloves garlic, minced",
        "8 ounces shredded fontina, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fries",
        "Sweet Potato",
        "Vegetable",
        "Onion Recipes",
        "Cheese"
    ],
    "title": "Sweet Potato Garlic Fries",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/sweet-potato-garlic-fries-recipe"
}
