{
    "directions": [
        "Heat the peanut oil in a large skillet over low heat. Stir in the ginger, brown sugar, and chili powder. Cook and stir for several minutes until the brown sugar has melted and the ginger is fragrant. Add the onion, red bell pepper, yellow bell pepper, and garlic. Increase heat to medium and continue cooking until the onion has softened and turned translucent, about 7 minutes.",
        "Stir the soy sauce, unagi sauce, paprika, mirin, and coconut extract into the vegetable mixture; bring to a simmer. Add the pork cubes and chicken stock; return to a simmer. Reduce heat to medium-low, cover, and simmer until the pork is tender and no longer pink in the center, about 15 minutes.",
        "Dissolve the cornstarch in the water; stir into the simmering pork. Add the apple and orange cubes; cover and cook until the apple is becoming tender, about 5 minutes. Stir in the basil, green onions, and black pepper; cook 2 minutes more before serving."
    ],
    "ingredients": [
        "2 tablespoons peanut oil",
        "2 tablespoons minced fresh ginger root",
        "3 tablespoons brown sugar",
        "2 tablespoons chili powder, or to taste",
        "1 onion, cut into strips",
        "1 red bell pepper, cut into strips",
        "1 yellow bell pepper, cut into strips",
        "5 cloves garlic, minced",
        "1/2 cup soy sauce",
        "1/4 cup unagi (eel) sauce",
        "2 tablespoons paprika",
        "2 tablespoons mirin (Japanese sweet wine) (optional)",
        "1 teaspoon coconut extract (optional)",
        "2 pounds pork tenderloin, cut into 1 inch cubes",
        "1 cup chicken broth",
        "1 1/2 tablespoons cornstarch",
        "1 1/2 tablespoons water",
        "1 red apple - cored and diced",
        "1 large orange, peeled, sectioned, and cut into bite-size pieces",
        "10 leaves fresh basil, chopped",
        "2 green onions, chopped",
        "1 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet and Spicy Pork with Apples in Unagi Sauce",
    "url": "http://allrecipes.com/recipe/208349/sweet-and-spicy-pork-with-apples-in-u/"
}
