{
    "directions": [
        "Cook sweet potatoes in large pot of boiling water until tender, about 35 minutes. Drain well. Let cool 20 minutes. Peel potatoes. Transfer to medium bowl; mash until smooth. Set aside.",
        "Position rack in center of oven and preheat to 325°F. Stir 2 cups sugar and 3/4 cup water in heavy medium saucepan over medium heat until sugar dissolves. Increase heat and boil without stirring until syrup turns deep amber, occasionally brushing down sides of pan with wet pastry brush and swirling pan, about 10 minutes. Working quickly, divide caramel among twelve 3/4-cup custard cups or soufflé dishes, tilting cups to cover bottom with caramel. Cool.",
        "Whisk mashed sweet potatoes, remaining 3/4 cup sugar, eggs, vanilla and salt in large bowl to blend well. Combine cream and orange peel in heavy medium saucepan. Bring to boil. Gradually whisk cream into potato-egg mixture. Strain mixture into 2-quart measuring cup or bowl; discard solids in strainer. Divide mixture among custard cups. Place 6 cups in each of 2 large baking pans. Add enough hot water to baking pans to come halfway up sides of cups. Bake flans until sides are set but center still moves slightly when cups are shaken. Remove cups from water and cool about 40 minutes. Cover and refrigerate at least 3 hours and up to 2 days. Run small sharp knife around edges to loosen. Turn flans out onto plates and serve."
    ],
    "ingredients": [
        "1 1/2 pounds unpeeled whole red-skinned sweet potatoes (yams)",
        "2 3/4 cups sugar",
        "3/4 cup water",
        "6 large eggs",
        "1 tablespoon vanilla extract",
        "3/4 teaspoon salt",
        "2 cups whipping cream",
        "2 teaspoons grated orange peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Orange",
        "Sweet Potato/Yam",
        "Fall",
        "Chill",
        "Ramekin",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet-Potato Flans",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-flans-104316"
}
