{
    "directions": [
        "Pulse lemongrass, ginger, and garlic in a food processor until very finely chopped.",
        "Heat oil in a large heavy pot over medium heat. Add lemongrass mixture and cook, stirring often, until golden brown, about 5 minutes; season with salt. Add curry and tomato pastes and cook, stirring, until darkened, about 3 minutes. Add tomatoes and cook, scraping up any browned bits, until thickened, about 5 minutes. Stir in coconut milk; season with salt. Bring to a boil; reduce heat and simmer, stirring occasionally, until curry is rich and full of flavor, 20–25 minutes.",
        "Add sweet potatoes and carrots, then pour in water to cover. Partially cover pot and cook until carrots are crisp-tender, 10–15 minutes. Add shallots and cook until potatoes are tender and shallots are soft, 15–20 minutes.",
        "Add chile, if desired, and lime juice to curry and spoon over rice. Top with scallions, basil, and cilantro; serve with lime wedges.",
        "DO AHEAD: Curry can be made 2 days ahead. Let cool; cover and chill."
    ],
    "ingredients": [
        "1 lemongrass stalk, tough outer layer removed, coarsely chopped",
        "1 2\" piece ginger, peeled, chopped",
        "4 garlic cloves",
        "2 tablespoons vegetable oil",
        "Kosher salt",
        "1/4 cup red curry paste",
        "2 tablespoons tomato paste",
        "1 14.5-ounce can crushed tomatoes",
        "2 13.5 ounce cans coconut milk",
        "1 1/2 pound sweet potatoes, peeled, cut into 1\" pieces",
        "3/4 pound small or young carrots, peeled, cut on a diagonal into 2\" pieces",
        "6 medium shallots, peeled keeping roots intact, quartered lengthwise",
        "1 red Thai chile, thinly sliced (optional)",
        "1 tablespoon fresh lime juice",
        "Steamed jasmine rice (for serving)",
        "Thinly sliced scallions, basil leaves, cilantro leaves with tender stems, and lime wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Low Fat",
        "Vegetarian",
        "Kid-Friendly",
        "Wheat/Gluten-Free",
        "Sweet Potato/Yam",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Sweet Potato Curry",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-curry-51259330"
}
