{
    "directions": [
        "Cook sweet potato in medium saucepan of boiling salted water until tender, 8 to 10 minutes. Drain, cool, and mash.",
        "Position rack in lower third of oven; preheat to 425°F. Butter bottom and sides of 9-inch cake pan with 1 1/2-inch-high sides.",
        "Whisk flour and next 5 ingredients in large bowl. Add cubed butter to flour mixture; toss to coat and rub in with fingertips until mixture resembles coarse meal. Whisk 3/4 cup mashed sweet potatoes and buttermilk in medium bowl. Add to flour mixture; toss with fork. Gather mixture in bowl, kneading until dough comes together. Turn dough out onto floured work surface and pat into 1-inch-thick round. Using 11/2-inch round biscuit cutter, cut out biscuits, flouring cutter after each cut. Gather scraps; pat into 1-inch-thick round. Cut out additional biscuits (do not reuse scraps more than once).",
        "Arrange biscuits side by side in prepared cake pan. Brush with melted butter. Bake until puffed and golden on top and tester inserted into center biscuit comes out clean, about 22 minutes. Cool 10 minutes in pan. Turn biscuits out and gently pull them apart. Cut each biscuit in half crosswise.",
        "Spread bottom half of each biscuit with mustard, then top each with sliced ham and second half of biscuit. Serve with honey."
    ],
    "ingredients": [
        "1 3/4-pound red-skinned sweet potato (yam), peeled, cut into 1/2-inch cubes",
        "1 3/4 cups all purpose flour",
        "1 tablespoon (packed) dark brown sugar",
        "2 1/2 teaspoons baking powder",
        "1 teaspoon salt",
        "1/2 teaspoon baking soda",
        "Pinch of cayenne pepper",
        "8 tablespoons (1 stick) chilled unsalted butter, cut into 1/2-inch cubes, plus 2 tablespoons butter, melted",
        "1/3 cup chilled buttermilk",
        "Dijon mustard",
        "6 ounces thinly sliced country ham or Black Forest ham",
        "Honey"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Mustard",
        "Side",
        "Bake",
        "Christmas",
        "Low Cal",
        "Ham",
        "Sweet Potato/Yam",
        "Honey",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sweet Potato Biscuits with Ham, Mustard, and Honey",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-biscuits-with-ham-mustard-and-honey-356312"
}
