{
    "directions": [
        "Pierce potatoes with fork. Microwave on high until tender, turning once, about 10 minutes. Cut in half. Scoop out enough potato to measure 1 1/4 cups; cool.",
        "Process 1 1/4 cups potato and matzo meal, eggs, 2 1/2 tablespoons margarine, sugar, salt and ginger until blended. transfer mixture to bowl. Cover and chill until firm, about 4 hours or overnight.",
        "Drop matzo mixture by generous teaspoonfuls onto sheet of foil. Using wet hands, roll dropped mixture into balls.",
        "Cook 1/3 of matzo balls in large pot of boiling salted water until tender, about 6 minutes. Using slotted spoon, transfer to clean sheet of foil. Repeat with remaining matzo balls in 2 batches. Let stand until firm, at least 30 minutes.",
        "Melt 5 1/2 tablespoons margarine in heavy large skillet over medium-high heat. Add half of matzo balls; sauté until beginning to brown, about 4 minutes. Transfer to 13x9x2-inch glass baking dish. Repeat with remaining matzo balls.",
        "Bring juice and apricots to boil in small saucepan. Remove from heat. Cover; steep until apricots are tender, about 10 minutes. Drain juice into medium saucepan; add cinnamon. Add 4 tablespoons margarine and jam. Simmer over medium heat until reduced to 3/4 cup, about 15 minutes. Return apricots to sauce. (Matzo balls and sauce can be made 2 hours ahead. Cover loosely; let stand at room temperature.)",
        "Preheat oven to 350°F. Spoon sauce over matzo balls. Bake until heated through, about 20 minutes. Top with mint."
    ],
    "ingredients": [
        "2 large red-skinned sweet potatoes (yams; about 1 1/2 pounds)",
        "1 1/4 cups unsalted matzo meal",
        "5 large eggs",
        "12 tablespoons (1 1/2 sticks) unsalted pareve margarine",
        "2 1/2 tablespoons sugar",
        "1 3/4 teaspoons coarse salt",
        "1 1/4 teaspoons ground ginger",
        "3 cups apple juice",
        "1 6-ounce package dried apricots",
        "1 cinnamon stick, broken in half",
        "1/3 cup apricot jam",
        "Chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Microwave",
        "Fruit",
        "Side",
        "Bake",
        "Passover",
        "Apricot",
        "Sweet Potato/Yam",
        "Kosher",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Sweet Potato Matzo Ball Tzimmes with Apricot Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potato-matzo-ball-tzimmes-with-apricot-sauce-3143"
}
