{
    "directions": [
        "Stir coffee, maple syrup, sugar, and espresso powder in a medium saucepan over medium-high heat until sugar dissolves. Bring mixture to a boil; cook until thickened and reduced by half, 6-7 minutes.",
        "Remove syrup from heat; add bourbon and 2 tablespoons butter. Reduce heat to medium and simmer until sauce is reduced to about 3/4 cup, 40-45 minutes (mixture should be thick enough to coat a spoon, but not sticky, and will thicken as it cools). Season sauce to taste with salt and pepper. DO AHEAD: Sauce can be made 2 days ahead. Cover; chill. Rewarm before serving.",
        "Arrange racks in upper and lower thirds of oven; preheat to 425°F.1 Melt remaining 7 tablespoons butter in a small saucepan; pour into a large bowl. Add sweet potatoes and oil and season with salt and pepper. Divide potato mixture between 2 large rimmed baking sheets and roast, turning potatoes often and rotating sheets halfway through, until potatoes are tender and start to turn golden brown and crisp around the edges, 30-35 minutes. DO AHEAD: Potatoes can be roasted 4 hours ahead. Let stand at room temperature. Rewarm before continuing.",
        "Transfer potatoes to a serving platter. Drizzle some warm sauce over and sprinkle with almonds; serve remaining sauce alongside for those who want more."
    ],
    "ingredients": [
        "1 1/2 cups strong hot coffee",
        "9 tablespoons pure maple syrup",
        "3 tablespoons (packed) dark brown sugar",
        "1/2 teaspoons instant espresso powder",
        "1/3 cup bourbon",
        "9 tablespoons unsalted butter, divided",
        "Kosher salt and freshly ground black pepper",
        "5 pounds red-skinned sweet potatoes (about 8 medium), peeled, cut into 2 1/2\"-3\" pieces",
        "3 tablespoons olive oil",
        "1/2 cup chopped smoked almonds (or toasted almonds)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Side",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Root Vegetable",
        "Sweet Potato/Yam",
        "Fall",
        "Maple Syrup",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Sweet Potatoes with Bourbon and Maple",
    "url": "http://www.epicurious.com/recipes/food/views/sweet-potatoes-with-bourbon-and-maple-51124230"
}
