{
    "directions": [
        "Place the zucchini and onion in a large, non-metallic bowl, and sprinkle the salt overtop. Use your hands to evenly mix the salt throughout the zucchini. Cover, and refrigerate overnight.",
        "The following day, drain the zucchini in a colander, and rinse well with cool water. Squeeze out excess water and set aside. Place the red and green bell pepper, sugar, vinegar, and cornstarch into a large pot. Add the nutmeg, turmeric, celery seed and pepper. Stir to combine, then add the drained zucchini. Bring to a boil over medium-high heat, then reduce the heat to medium-low, and simmer 30 minutes.",
        "Meanwhile, sterilize 7 one-pint jars and lids to hold relish. Pack relish into sterilized jars, making sure there are no spaces or air pockets. Fill jars all the way to top. Screw on lids.",
        "Place a rack in the bottom of a large stockpot and fill halfway with boiling water. Carefully lower jars into pot using a holder. Leave a 2 inch space between jars. Pour in more boiling water if necessary, until tops of jars are covered by 2 inches of water. Bring water to a full boil, then cover and process for 30 minutes.",
        "Remove jars from pot and place on cloth-covered or wood surface, several inches apart, until cool. Once cool, press top of each lid with finger, ensuring that seal is tight (lid does not move up or down at all)."
    ],
    "ingredients": [
        "12 cups shredded unpeeled zucchini",
        "4 cups chopped onion",
        "5 tablespoons canning salt",
        "1 red bell pepper, chopped",
        "1 green bell pepper, chopped",
        "6 cups white sugar",
        "2 1/2 cups white vinegar",
        "1 tablespoon cornstarch",
        "3/4 teaspoon ground nutmeg",
        "3/4 teaspoon ground turmeric",
        "1 1/2 teaspoons celery seed",
        "1/2 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet Zucchini Relish",
    "url": "http://allrecipes.com/recipe/172346/sweet-zucchini-relish/"
}
