{
    "directions": [
        "Place sweet potato and potato into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 15 minutes. Drain and transfer to a large bowl to cool.",
        "Place salmon into a skillet and pour in milk. Bring to a simmer, cover skillet, and cook until salmon flakes easily with a fork, about 5 minutes. Remove salmon from the skillet; reserve milk in a bowl.",
        "Heat olive oil in the skillet over medium heat; cook and stir celery, carrot, nutmeg, red pepper flakes, salt, and pepper in the hot oil until celery and carrot are softened, about 5 minutes. Add shallots, parsley, cilantro, and garlic; cook and stir until fragrant, 3 to 5 minutes.",
        "Pour wheat germ, egg, and reserved milk over sweet potato and potato; mash until evenly combined.",
        "Flake salmon with a fork; mix flaked salmon and vegetable mixture into the mashed potato mixture using your hands.",
        "Heat vegetable oil large saucepan or skillet over medium-high heat.",
        "Pour bread crumbs into a large bowl.",
        "Form salmon mixture into patties using your hands; press each patty into bread crumbs, coating both sides.",
        "Fry patties, working in batches, in the hot oil until crisp and golden, about 3 minutes per side."
    ],
    "ingredients": [
        "1 large sweet potato, peeled and cut into large chunks",
        "1 large potato, peeled and cut into large chunks",
        "2 (4 ounce) salmon fillets",
        "2 cups milk",
        "1/4 cup olive oil",
        "1 stalk celery, diced",
        "1 large carrot, diced",
        "1 pinch ground nutmeg",
        "1 pinch red pepper flakes",
        "salt and ground black pepper to taste",
        "3 shallots, diced",
        "1/4 cup chopped fresh parsley",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons minced garlic",
        "1/4 cup wheat germ",
        "1 large egg",
        "1 cup dry seasoned bread crumbs",
        "1/2 cup vegetable oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sweet Potato Salmon Fish Cakes",
    "url": "http://allrecipes.com/recipe/232127/sweet-potato-salmon-fish-cakes/"
}
