{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Heat olive oil in a skillet; cook and stir the garlic in the hot oil until slightly browned, 2 to 3 minutes. Sprinkle in the rosemary and let cook until fragrant, 1 to 2 more minutes. Cook and stir the chard until the leaves are wilted; cover the skillet and let the chard steam until the stems are tender, about 5 minutes. Transfer the chard mixture to a bowl, stir in the tarragon and basil, season to taste with salt and pepper, and let cool. Stir in the mozzarella.",
        "Trim the stem and blossom ends from the zucchini and halve lengthwise. Scoop out the flesh with a spoon, leaving a 3/4-inch thick shell. Discard the flesh. Beat 2 eggs with the milk in a bowl. Lightly fill the shells with the chard mixture. Pour the egg mixture over the chard.",
        "Bake in the preheated oven until the quiche filling is set and the zucchini shells are tender, about 40 minutes.",
        "To prepare crumb topping, melt butter in a skillet over medium heat; cook and stir the bread crumbs in the butter until well combined and starting to give off a toasty fragrance, about 2 minutes. Remove the stuffed zucchini from the oven and gently pat the bread crumbs over the top in a layer; return to oven and bake until the crumbs are browned, 10 to 15 more minutes."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "2 cloves garlic, finely chopped",
        "1 sprig fresh rosemary, leaves finely chopped",
        "5 leaves Swiss chard including stems, roughly chopped",
        "1/2 teaspoon tarragon",
        "5 fresh basil leaves, roughly chopped",
        "salt and black pepper to taste",
        "6 1-inch fresh mozzarella balls, quartered",
        "1 large zucchini",
        "2 eggs",
        "1 cup milk",
        "3 tablespoons butter",
        "1 1/2 cups dry bread crumbs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Swiss Chard and Mozzarella Quiche in Zucchini Crust",
    "url": "http://allrecipes.com/recipe/215079/swiss-chard-and-mozzarella-quiche-in/"
}
