{
    "directions": [
        "Bring milk and bay leaf to simmer in medium saucepan; remove from heat. Melt butter in heavy large saucepan over medium-low heat. Add flour and whisk to blend. Cook 2 minutes, whisking almost constantly (do not let roux brown). Gradually whisk milk with bay leaf into roux. Add 1/2 teaspoon coarse salt, nutmeg, and cloves and bring to simmer. Cook until sauce thickens enough to coat spoon, whisking often, about 3 minutes. Remove bay leaf. DO AHEAD: Béchamel sauce can be made 1 day ahead. Press plastic wrap directly onto surface and chill. Remove plastic and rewarm sauce before using, whisking to smooth.",
        "Blanch chard in large pot of boiling salted water 1 minute. Drain, pressing out all water, then chop coarsely. Heat 2 tablespoons oil in heavy medium skillet over medium-high heat. Add onion, half of garlic, and crushed red pepper. Sauté until onion is tender, 3 to 4 minutes. Mix in chard and season to taste with coarse salt and freshly ground black pepper.",
        "Heat remaining 2 tablespoons oil in heavy large nonstick skillet over medium- high heat. Add mushrooms and remaining garlic. Sauté until mushrooms are brown and tender, 7 to 8 minutes. Mix in nutmeg and season with coarse salt and pepper.",
        "Cook noodles in medium pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain; arrange noodles in single layer on sheet of plastic wrap.",
        "Brush 13 x 9 x 2-inch glass baking dish with oil to coat. Spread 3 tablespoons béchamel sauce thinly over bottom of dish. Arrange 3 noodles in dish to cover bottom (2 side by side lengthwise, then 1 crosswise). Spread half of chard mixture over pasta, then half of mushrooms. Drop half of ricotta over in dollops and spread in even layer. Sprinkle with half of Fontina, then 4 tablespoons Parmesan; spread 3/4 cup béchamel over. Repeat layering with 3 noodles, remaining chard, mushrooms, ricotta, Fontina, Parmesan, and 3/4 cup béchamel. Cover with 3 noodles and remaining béchamel. DO AHEAD: Can be made 2 hours ahead. Cover with foil. Let stand at room temperature.",
        "Preheat oven to 400°F. Bake lasagna covered 30 minutes. Uncover and bake until heated through and top is golden brown, 20 to 30 minutes longer. Let stand 15 minutes before serving."
    ],
    "ingredients": [
        "2 1/2 cups whole milk",
        "1 Turkish bay leaf",
        "6 tablespoons (3/4 stick) unsalted butter",
        "1/4 cup all purpose flour",
        "1/2 teaspoon coarse kosher salt",
        "1/2 teaspoon (scant) ground nutmeg",
        "Pinch of ground cloves",
        "1 pound Swiss chard, center rib and stem cut from each leaf",
        "4 tablespoons extra-virgin olive oil, divided",
        "1 1/3 cups chopped onion",
        "4 large garlic cloves, chopped, divided",
        "1/4 teaspoon dried crushed red pepper",
        "Coarse kosher salt",
        "1 pound crimini mushrooms, sliced",
        "1/4 teaspoon ground nutmeg",
        "9 7 x 3-inch lasagna noodles",
        "Extra-virgin olive oil",
        "1 15-ounce container whole-milk ricotta cheese (preferably organic), divided",
        "6 ounces Italian Fontina Cheese, coarsely grated (about 1 1/2 cups packed), divided",
        "8 tablespoons finely grated Parmesan cheese, divided",
        "Test-kitchen tip: To test for doneness, insert the blade of a small knife deep into the center of the lasagna for 30 seconds. remove the knife and feel the blade. If it's hot, so is the lasagna."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "Bake",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Buffet",
        "Ricotta",
        "Swiss Cheese",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Swiss Chard Lasagna with Ricotta and Mushroom",
    "url": "http://www.epicurious.com/recipes/food/views/swiss-chard-lasagna-with-ricotta-and-mushroom-362954"
}
