{
    "directions": [
        "Stir 1/3 cup cream, honey and butter in small saucepan over medium heat until butter melts. Set aside. Stir sugar, water and lemon juice in heavy medium saucepan over low heat until sugar dissolves. Increase heat; boil without stirring until syrup turns golden, occasionally swirling pan and brushing down sides with wet pastry brush, about 12 minutes. Remove from heat. Add warm cream mixture (mixture will bubble up). Stir over very low heat until smooth. Add vanilla. Chill uncovered until cold, about 1 hour. (Can be made 1 day ahead. Cover; keep chilled.)",
        "Roll out 1 pastry sheet on floured surface to 11-inch square. Using 10-inch-diameter cake pan bottom as guide, trim to 10-inch round. Transfer to ungreased baking sheet. Roll out second pastry sheet to 11-inch square. Using 11-inch-diameter tart pan bottom as guide, trim to 11-inch round. Using fork, score design on 11-inch round; cut out small hole from center.",
        "Mix nuts into cold caramel. Brush beaten egg in 1-inch border on pastry on baking sheet. Spread filling over pastry, mounding in center and leaving 1-inch border. Cover with 11-inch round. Press to seal. Fold edge of bottom pastry over top pastry. Seal edge tightly. Mix 1 tablespoon cream and yolk into remaining beaten egg. Brush top of tart with egg mixture. Chill tart on baking sheet 1 hour.",
        "Preheat oven to 400°F. Bake tart until golden, about 25 minutes. Cool. (Can be made 8 hours ahead.)"
    ],
    "ingredients": [
        "1/3 cup plus 1 tablespoon whipping cream",
        "1/4 cup honey",
        "1 tablespoon unsalted butter",
        "2/3 cup sugar",
        "3 tablespoons water",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon vanilla extract",
        "1 17 1/4-ounce package frozen puff pastry (2 sheets), thawed",
        "2 cups coarsely chopped walnuts",
        "1 large egg, beaten to blend",
        "1 large egg yolk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Rosh Hashanah/Yom Kippur",
        "Walnut",
        "Fall",
        "Honey",
        "Phyllo/Puff Pastry Dough"
    ],
    "title": "Swiss Honey-Walnut Tart",
    "url": "http://www.epicurious.com/recipes/food/views/swiss-honey-walnut-tart-4663"
}
