{
    "directions": [
        "In a large heavy skillet cook bacon over moderate heat until crisp and with a slotted spatula transfer to a cutting board. Chop bacon fine. Remove all but 1 tablespoon fat from skillet and heat remaining fat over moderately high heat until hot but not smoking. Cook chard and garlic, stirring, until chard is tender, about 2 minutes. Transfer chard mixture to a bowl and cool. To chard mixture add cheeses, 2 tablespoons bacon, and salt and pepper to taste.",
        "Bring a large saucepan of salted water to a gentle boil.",
        "Put a won ton wrapper on a lightly floured surface and mound 1 tablespoon filling in center of wrapper. Brush edges of wrapper with water and put a second wrapper over first, pressing down around filling to force out air. Seal edges well and transfer ravioli to a kitchen towel. Make more ravioli with remaining wrappers and filling in same manner, turning them occasionally to dry slightly. Cook ravioli in water at a gentle boil 6 to 8 minutes, or until they rise to surface and are tender. (Do not let water boil vigorously once ravioli have been added.) With a slotted spoon transfer ravioli as cooked to a kitchen towel to drain.",
        "Divide ravioli between 2 plates and spoon sauce over them. Garnish ravioli with remaining tablespoon bacon."
    ],
    "ingredients": [
        "3 slices bacon",
        "3 cups chopped Swiss chard, stems discarded, leaves washed and chopped (about 1/2 pound)",
        "1/2 teaspoon minced garlic",
        "1/2 cup ricotta cheese",
        "2 tablespoons freshly grated Parmesan cheese",
        "24 won ton wrappers*, thawed if frozen",
        "1 cup prepared tomato sauce, heated",
        "*available at Asian markets and most supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Quick & Easy",
        "Parmesan",
        "Ricotta",
        "Bacon",
        "Chard",
        "Gourmet"
    ],
    "title": "Swiss Chard, Bacon, and Ricotta Ravioli with Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/swiss-chard-bacon-and-ricotta-ravioli-with-tomato-sauce-12699"
}
