{
    "directions": [
        "Cook chard in large pot of boiling salted water until just wilted, about 2 minutes. Drain. Squeeze out liquid. Chop chard.",
        "Heat oil in heavy large skillet over medium heat. Add garlic; saut\u2029 1 minute. Add chard; sauté until excess liquid evaporates, about 5 minutes. Transfer chard mixture to large bowl. Cool slightly. Mix in ricotta and next 7 ingredients.",
        "Position rack in bottom third of oven; preheat to 375°F. Roll out 1 pastry sheet on lightly floured surface to 14-inch square. Transfer pastry to 9-inch-diameter tart pan with removable bottom. Trim edges, leaving 1-inch overhang. Fill pastry with chard mixture. Lightly brush pastry overhang with pastry brush dipped into water. Roll out second pastry sheet to 13-inch square. Using tart pan as guide, trim pastry square to 10-inch round. Drape over filling. Seal edges and fold in.",
        "Bake until pastry is golden brown, about 45 minutes. Cool 10 minutes.",
        "Remove pan sides from tart. Transfer to platter. Cut into wedges and serve."
    ],
    "ingredients": [
        "1 pound Swiss chard, stems and ribs removed",
        "1 1/2 tablespoons extra-virgin olive oil",
        "1 garlic clove, minced",
        "1 15-ounce container whole-milk ricotta cheese",
        "1/2 cup freshly grated Parmesan cheese",
        "2 large eggs",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/4 teaspoon minced fresh thyme",
        "1/4 teaspoon minced fresh oregano",
        "1/8 teaspoon grated nutmeg",
        "1 17.3-ounce package frozen puff pastry (2 sheets), thawed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Leafy Green",
        "Herb",
        "Bake",
        "Vegetarian",
        "Lunch",
        "Parmesan",
        "Ricotta",
        "Fall",
        "Healthy",
        "Chard",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Swiss Chard and Herb Tart",
    "url": "http://www.epicurious.com/recipes/food/views/swiss-chard-and-herb-tart-103433"
}
