{
    "directions": [
        "Cut chard leaves from each side of center stem. Cut stems into matchsticksize strips. Cover and refrigerate stems; reserve for sauce.",
        "Cook chard leaves in large pot of boiling salted water until tender, about 3 minutes. Drain; cool. Squeeze chard leaves until very dry; place in processor. Using on/off turns, finely chop chard. Add ricotta, 1/2 cup Parmesan, shallot, egg, coarse salt, pepper, and nutmeg; process to blend. Transfer mixture to medium bowl. Add 1/2 cup flour; stir to blend. Cover and refrigerate dough overnight.",
        "Bring chicken broth, sliced shallots, and mushroom stems to boil in large saucepan. Reduce heat to medium and simmer until mixture is reduced to 3 cups, 35 to 40 minutes. Strain. Return broth to saucepan; discard solids in strainer. DO AHEAD: Can be made 1 day ahead. Cover and chill. Rewarm before continuing. Melt 2 tablespoons butter with 2 tablespoons oil in heavy large skillet over medium-high heat; add sliced mushroom caps. Sprinkle with salt and pepper; sauté until mushrooms are tender and browned, 8 to 10 minutes. Transfer to bowl. Heat remaining 1 tablespoon oil in same skillet over medium heat. Add reserved thinly sliced chard stems and sauté until tender, 6 to 8 minutes. do ahead Mushrooms and chard stems can be prepared 2 hours ahead. Let stand at room temperature.",
        "Line rimmed baking sheet with parchment paper. Spoon some flour onto large plate. Working in batches, drop heaping teaspoonfuls gnudi dough (size of small walnuts) onto plate with flour to form about 36 gnudi. Using floured hands, gently shape each into 1 1/2-inch-long, 1/2-inch-thick oval. Tap off excess flour; transfer gnudi to prepared baking sheet. do ahead Can be made 2 hours ahead. Cover and chill. Bring large wide pot of salted water to boil. Slide gnudi into pot; cook until tender, stirring occasionally, about 10 minutes. Meanwhile, whisk remaining 4 tablespoons butter into hot broth. Season broth to taste with salt and pepper. Cover to keep warm.",
        "Divide mushrooms and chard stems among 6 bowls. Add broth, dividing equally (about 1/2 cup each). Using slotted spoon, divide gnudi among bowls. Sprinkle with Parmesan and serve immediately.",
        "Fruity and earthy Michele Chiarlo 2006 \"Le Orme\" Barbera d'Asti Superiore, Italy ($11)."
    ],
    "ingredients": [
        "1 pound Swiss chard, stem ends trimmed",
        "1 cup whole-milk ricotta cheese",
        "1/2 cup grated Parmesan cheese (about 1 1/2 ounces) plus additional for serving",
        "1/4 cup coarsely chopped shallot (about 1 large)",
        "1 large egg",
        "1/2 teaspoon coarse kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "1/8 teaspoon freshly grated nutmeg",
        "1/2 cup all purpose flour plus additional for shaping dumplings",
        "6 cups low-salt chicken broth",
        "2 shallots, thickly sliced",
        "1 pound assorted wild mushrooms (such as shiitake, chanterelle, and crimini), stems trimmed and reserved, caps thinly sliced",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 6 pieces, divided",
        "3 tablespoons extra-virgin olive oil, divided",
        "Coarse kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mushroom",
        "Low Cal",
        "Dinner",
        "Parmesan",
        "Ricotta",
        "Fall",
        "Swiss Cheese",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Swiss Chard Ricotta Gnudi with Fall Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/swiss-chard-ricotta-gnudi-with-fall-mushrooms-355214"
}
