{
    "directions": [
        "Melt 2 tablespoons butter and toss with bread crumbs, cheese, garlic, herbs, half of nutmeg, and salt and pepper to taste in a bowl.",
        "Boil broth in a small saucepan until reduced by half. Add cream and keep warm.",
        "Melt 1 tablespoon butter in a small heavy saucepan over moderate heat and stir in flour. Cook roux, whisking, 1 minute, then whisk in broth mixture and boil, whisking, 1 minute. Season sauce with salt and pepper.",
        "Preheat oven to 400°F.",
        "Cook onion in remaining 2 tablespoons butter in a wide 8-quart heavy pot over moderately low heat, stirring, until softened. Add chard stems, remaining nutmeg, and salt and pepper to taste and cook, stirring, until vegetables are tender but not browned, about 8 minutes.",
        "Increase heat to moderately high and add chard leaves and spinach by large handfuls, stirring, until all greens are wilted. Season with salt and pepper.",
        "Transfer vegetables to a colander to drain well and press out liquid with back of a large spoon. Toss vegetables with cream sauce and transfer to a buttered 12-inch oval gratin or 2-quart shallow baking dish, spreading evenly.",
        "Top vegetables with bread crumbs and bake in middle of oven until bubbling and topping is golden, about 20 minutes."
    ],
    "ingredients": [
        "5 tablespoons unsalted butter",
        "1 cup fresh white bread crumbs",
        "3 oz Tomme de Savoie or Gruyère cheese, grated (1 cup)",
        "1 garlic clove, halved lengthwise, germ removed if green, and garlic finely chopped",
        "1 tablespoon finely chopped mixed fresh herbs (preferably chives, tarragon, and flat-leaf parsley)",
        "1/8 teaspoon freshly grated nutmeg",
        "1 cup low-sodium chicken broth",
        "1/2 cup heavy cream",
        "1 tablespoon all-purpose flour",
        "1 medium onion, finely chopped",
        "3 lb Swiss chard, leaves and stems separated and both cut into 1-inch pieces",
        "1 lb spinach, coarse stems discarded, leaves coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Dairy",
        "Vegetable",
        "Side",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Casserole/Gratin",
        "Fall",
        "Swiss Cheese",
        "Chard",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Swiss Chard Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/swiss-chard-gratin-103976"
}
