{
    "directions": [
        "Bring raisins and water to a boil in a 1-quart heavy saucepan, then remove from heat and let stand, covered, 1 hour. Drain in a colander, then pat dry with paper towels. Put oven rack in middle position and preheat oven to 400°F.",
        "Blanch chard in a large pot of boiling salted water, uncovered, stirring occasionally, until tender but still bright green, about 5 minutes. Transfer chard with a slotted spoon to a large bowl of ice and cold water to stop cooking. Drain chard in a colander, then squeeze out excess water by handfuls. Coarsely chop chard.",
        "Whisk together egg, cream, granulated sugar, zest, and a pinch of salt in a large bowl. Stir in pine nuts, raisins, and chard until combined.",
        "Roll out larger piece of dough on a lightly floured surface with a lightly floured rolling pin into a 15- by 11-inch rectangle and fit into tart pan (do not trim edges). Chill shell while rolling out top.",
        "Roll out smaller piece of dough on a lightly floured surface with lightly floured rolling pin into a 12- by 9-inch rectangle. Spread chard filling evenly into shell, then top with second rectangle of dough. Using a rolling pin, roll over edges of pan to seal tart and trim edges, discarding scraps. Cut 3 steam vents in top crust with a paring knife, then put tart in pan on a baking sheet. Bake until top is golden, about 1 hour. Transfer to a rack and cool 10 minutes, then remove side of pan. Cool to room temperature, about 1 hour. Dust with confectioners sugar."
    ],
    "ingredients": [
        "1/2 cup golden raisins",
        "1 cup water",
        "2 pounds green Swiss chard, stems and center ribs discarded",
        "1 large egg",
        "1/2 cup heavy cream",
        "1 1/2 tablespoons granulated sugar",
        "1/2 teaspoon finely grated fresh orange zest",
        "1/3 cup pine nuts (1 1/2 ounces), toasted",
        "Pastry dough for a double-crust epi:recipelinkpie</epi:recipelink>",
        "2 teaspoons confectioners sugar",
        "Special equipment: an 11- by 8- by 1-inch rectangular tart pan with a removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Side",
        "Bake",
        "Vegetarian",
        "Raisin",
        "Pine Nut",
        "Chard",
        "Gourmet"
    ],
    "title": "Swiss Chard, Raisin, and Pine Nut Tart",
    "url": "http://www.epicurious.com/recipes/food/views/swiss-chard-raisin-and-pine-nut-tart-236407"
}
