{
    "directions": [
        "Bring 1/4 cup water to boil in large pot. Add chard leaves. Cover; cook until tender but still bright green, stirring occasionally, about 3 minutes. Drain. Cool slightly. Squeeze dry. Chop chard finely. Transfer to large bowl. Mix in ricotta, 1/3 cup Parmesan cheese, egg, garlic, thyme, salt, rosemary and pepper.",
        "Line baking sheet with foil or plastic wrap; sprinkle with flour. Place 1 gyoza wrapper on work surface. Brush surface of wrapper with some egg white. Spoon generous 1 teaspoon chard mixture into center of wrapper. Top with another wrapper. Press edges together to seal. Transfer to baking sheet. Repeat with remaining wrappers, egg white and chard mixture to make 32 ravioli total. (Can be made 8 hours ahead. Cover and chill.)",
        "Melt butter in heavy small skillet over medium heat. Add sage; stir 1 minute. Season with salt and pepper. Remove from heat.",
        "Working in batches, cook ravioli in large pot of boiling salted water until just tender, stirring occasionally, about 4 minutes per batch. Transfer ravioli to large shallow bowl.",
        "Pour sage butter over ravioli and toss. Serve, passing additional Parmesan cheese alongside, if desired."
    ],
    "ingredients": [
        "1/4 cup water",
        "1 pound Swiss chard, center spine and stems trimmed",
        "1 cup ricotta cheese",
        "1/3 cup freshly grated Parmesan cheese",
        "1 large egg",
        "1 garlic clove, minced",
        "1 teaspoon chopped fresh thyme",
        "3/4 teaspoon salt",
        "1/2 teaspoon chopped fresh rosemary",
        "1/4 teaspoon ground black pepper",
        "64 gyoza (potsticker) wrappers* (from two 12-ounce packages)",
        "1 large egg white, beaten to blend",
        "3/4 cup (1 1/2 sticks) butter",
        "1/4 cup chopped fresh sage",
        "Additional freshly grated Parmesan cheese (optional)",
        "*Gyoza wrappers can be found at Asian markets and in the refrigerator section of many supermarkets. If unavailable, substitute wonton wrappers and cut into 3 1/2-inch rounds."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Leafy Green",
        "Appetizer",
        "Spring",
        "Winter",
        "Chard"
    ],
    "title": "Swiss Chard Ravioli",
    "url": "http://www.epicurious.com/recipes/food/views/swiss-chard-ravioli-101627"
}
