{
    "directions": [
        "Heat oil in a 1-quart saucepan over moderately high heat until hot but not smoking (365°F on deep-fat thermometer), then fry shallots in 3 batches, stirring occasionally, until golden brown, 2 to 3 minutes. Transfer as fried with a slotted spoon to paper towels to drain, spreading evenly, then cool.",
        "Cook chard leaves in a large pot of boiling salted water until tender, about 2 minutes. Transfer with tongs to a bowl of ice and cold water to stop cooking. Drain well and pat dry with paper towels.",
        "Halve each leaf lengthwise, discarding rib. Place 1 tablespoon shallots at 1 end of a chard strip and firmly roll up, forming a cigar shape. Make 15 more rolls in same manner.",
        "Mash garlic to a paste with sea salt using a mortar and pestle (or mince and mash with a large heavy knife). Purée cilantro with garlic paste and 1/4 cup yogurt in a blender, scraping down sides occasionally. Transfer to a bowl and stir in remaining 3/4 cup yogurt. Serve chard rolls with raita."
    ],
    "ingredients": [
        "1 cup vegetable oil",
        "1/2 pound shallots, thinly sliced (2 cups)",
        "8 medium Swiss chard leaves, stems trimmed flush with leaves",
        "1 small garlic clove",
        "1/2 teaspoon fine sea salt",
        "1/2 cup chopped fresh cilantro",
        "1 cup whole-milk yogurt",
        "a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Fry",
        "Vegetarian",
        "Quick & Easy",
        "Yogurt",
        "Fall",
        "Healthy",
        "Chard",
        "Shallot",
        "Cilantro",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Swiss Chard and Crisp Shallot Rolls with Cilantro Raita",
    "url": "http://www.epicurious.com/recipes/food/views/swiss-chard-and-crisp-shallot-rolls-with-cilantro-raita-107003"
}
