{
    "directions": [
        "Soak porcini mushrooms in 1 1/2 cups hot water until softened, about 20 minutes. Drain, reserving soaking liquid. Squeeze mushrooms dry. Chop.",
        "Mix Emmenthal and Gruyère cheese and cornstarch in large bowl. Combine 1 cup reserved mushroom soaking liquid, white wine and garlic in fondue pot or heavy medium saucepan. Simmer 2 minutes. Discard garlic. Adjust heat so that liquid barely simmers. Add cheese 1 handful at a time and stir until each addition melts before adding next.",
        "After all cheese is added, mix until smooth. Mix in mushrooms and 2 teaspoons minced fresh thyme. Season with generous amount of pepper. (Can be prepared 1 day ahead. Cool. Press plastic onto surface of fondue and refrigerate. Cover and refrigerate remaining mushroom soaking liquid. Before continuing, rewarm fondue over low heat, stirring frequently and adding reserved mushroom soaking liquid as necessary if fondue is too thick.) If not using fondue pot, transfer mixture to flameproof 2-quart casserole. Sprinkle with fresh thyme leaves. Set over alcohol burner or gas table burner and serve, allowing diners to skewer bread with fork and dip into cheese fondue."
    ],
    "ingredients": [
        "1 ounce dried porcini mushrooms*",
        "1 1/2 cups hot water",
        "1/2 pound Emmenthal cheese, grated",
        "1/2 pound Swiss Gruyère cheese, grated",
        "1 tablespoon cornstarch",
        "1 cup dry white wine",
        "1 garlic clove, halved",
        "2 teaspoons minced fresh thyme",
        "Fresh thyme leaves",
        "Day-old French bread, cut into 1-inch cubes",
        "*Porcini are available at Italian markets and specialty foods stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Appetizer",
        "Vegetarian",
        "White Wine",
        "Fall",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Swiss Cheese and Porcini Fondue",
    "url": "http://www.epicurious.com/recipes/food/views/swiss-cheese-and-porcini-fondue-2489"
}
