{
    "directions": [
        "Preheat oven to 400°F. Wrap beets individually in foil. Roast until beets are tender, about 1 hour. Cool. Peel beets, then cut into 1/2-inch cubes. (Can be prepared 2 days ahead. Cover; chill.)",
        "Fold Swiss chard leaves in half lengthwise and cut stalks away from leaves. Cut leaves coarsely into 1-inch pieces. Slice stalks thinly crosswise. Reserve stalks and leaves separately. Cook chopped leaves in large pot of boiling salted water until just tender, about 1 minute. Drain and reserve.",
        "Heat oil in heavy large pot over high heat. Add sliced stalks; sauté until starting to soften, about 8 minutes.",
        "Add onion and next 3 ingredients; sauté 3 minutes. Add drained tomatoes and 1 cup raisins. Reduce heat to medium and simmer until vegetables are soft, stirring occasionally, about 15 minutes.",
        "Add chard leaves to pot; stir to heat through. Remove from heat; add lime juice and stir to blend. Season to taste with salt and pepper. Transfer chard mixture to large platter. Sprinkle with beets, goat cheese, pine nuts, and remaining 2 tablespoons raisins. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 pounds red beets (about 3 large)",
        "4 pounds Swiss chard",
        "1/4 cup olive oil",
        "1 large red onion, halved lengthwise, cut thinly crosswise",
        "3/4 cup sliced green onions (about 3)",
        "5 garlic cloves, chopped",
        "2 jalapeño chiles, thinly sliced crosswise with seeds",
        "3 14 1/2-ounce cans diced tomatoes in juice, drained",
        "1 cup plus 2 tablespoons golden raisins",
        "1/4 cup fresh lime juice",
        "1 51/2-ounce log soft fresh goat cheese, crumbled",
        "2 tablespoons pine nuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Tomato",
        "Side",
        "Roast",
        "Christmas",
        "High Fiber",
        "Goat Cheese",
        "Raisin",
        "Beet",
        "Winter",
        "Chard",
        "Jalapeño",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Swiss Chard with Beets, Goat Cheese, and Raisins",
    "url": "http://www.epicurious.com/recipes/food/views/swiss-chard-with-beets-goat-cheese-and-raisins-233410"
}
