{
    "directions": [
        "Preheat oven to 200°F. Prepare grill.",
        "In a bowl toss swordfish with lemon juice, oregano, and salt and pepper to taste and marinate, covered and chilled, 15 minutes.",
        "Wrap pitas in foil and keep warm in oven. Peel and seed cucumber and grate coarse. Wrap cucumber in a kitchen towel and squeeze to extract liquid. In a small bowl stir together cucumber, yogurt, mint, garlic paste, and salt and pepper to taste. In another bowl combine tomatoes, onion, parsley, and salt and pepper to taste.",
        "Thread fish onto skewers and grill on an oiled rack set 5 to 6 inches over glowing coals, turning once, until just cooked through, about 8 minutes. Remove fish from skewers. (Alternatively, cook fish in a heated well-seasoned ridged grill pan in same manner.)",
        "Divide cucumber mixture among pitas, spreading to cover, and top with fish. Sprinkle tomato mixture over fish and roll pitas into cones, wrapping with parchment paper or foil to secure."
    ],
    "ingredients": [
        "1 pound skinless swordfish steak (about 1 inch thick), cut into 1-inch cubes",
        "1 tablespoon fresh lemon juice",
        "1/2 teaspoon dried oregano, crumbled",
        "4 loaves 6- to 7-inch pita bread (preferably pocketless)",
        "1 large cucumber",
        "an 8-ounce container plain low-fat yogurt",
        "1 1/2 teaspoons chopped fresh mint leaves",
        "1/2 teaspoon chopped garlic, mashed to a paste with 1/2 teaspoon salt",
        "2 medium plum tomatoes, chopped coarse",
        "1/2 small red onion, cut into slivers",
        "1/4 cup fresh flat-leafed parsley leaves, washed well, spun dry, and torn",
        "four 12-inch bamboo skewers, soaked in water 1 hour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fish",
        "Onion",
        "Tomato",
        "Yogurt",
        "Spring",
        "Gourmet"
    ],
    "title": "Swordfish Souvlaki",
    "url": "http://www.epicurious.com/recipes/food/views/swordfish-souvlaki-12016"
}
