{
    "directions": [
        "Place pork butt, onion, 5 cloves garlic, and 1 tablespoon salt in a large pot; cover with water. Simmer mixture over medium heat until pork is very tender, about 3 hours. Discard onion and garlic. Strain and shred meat, reserving liquid.",
        "Heat a skillet over medium-high heat. Cook and stir California chile pods and New Mexico chile pods in the hot skillet until toasted and fragrant, 2 to 3 minutes. Rinse chile pods. Bring a pot of water to a boil and add chile pods; boil until chile pods are slightly softened, about 3 minutes. Drain and cool chile pods.",
        "Blend 1 cup pork broth, 1 cup water, chile pods, 1 tablespoon salt, 3 cloves garlic, and cumin together in a blender until smooth. Stir pork meat and chile sauce together in a bowl.",
        "Melt 1/2 cup lard in a large pot over medium heat. Stir flour into melted lard until browned and fragrant, about 5 minutes. Stir pork-chile sauce mixture into flour mixture, adding more salt if needed.",
        "Remove silk and debris from corn husks and soak in boiling water, 30 minutes to 1 hour. Drain and place on a work surface; cover with a clean, damp towel.",
        "Mix masa, 1 pound lard, 1 cup reserved pork broth, baking powder, and salt in a large pan until mixture is fluffy and holds together.",
        "Select 1 wide corn husk or 2 small ones. Spread about 2 tablespoons masa mixture onto corn husk, spreading to the sides and about 2 inches from the bottom and 1/4 inch from the top. Spoon 1 to 2 tablespoons pork mixture down the center of masa mixture. Fold sides of husk together, 1 over the other. Fold the bottom of husk over seam of 2 folded sides. Repeat with remaining husks and filling.",
        "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add tamales and cook until filling is heated through and set, 1 to 2 hours. Let tamales rest for 30 minutes before serving."
    ],
    "ingredients": [
        "3 pounds pork butt roast",
        "1 large onion, chopped",
        "5 cloves garlic",
        "1 tablespoon salt",
        "water to cover",
        "3 ounces California chile pods, seeds and veins removed",
        "3 ounces New Mexico chile pods, seeds and veins removed",
        "1 cup pork broth",
        "1 cup water",
        "1 tablespoon salt",
        "3 cloves garlic",
        "1 teaspoon ground cumin",
        "1/2 cup lard",
        "1/2 cup all-purpose flour",
        "salt to taste",
        "1 (8 ounce) package dried corn husks",
        "5 pounds masa harina",
        "1 pound lard",
        "1 tablespoon baking powder"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sylvia's Pork Tamales",
    "url": "http://allrecipes.com/recipe/235668/sylvias-pork-tamales/"
}
