{
    "directions": [
        "1. Soak the wheat berries in a big bowl of cool water for at least 8 hours and up to 16 hours.",
        "2. Drain the wheat berries in a fine-mesh sieve or a small-holed colander set in the sink. Dump the grains into a medium saucepan with the fennel seeds and fill the saucepan two-thirds of the way with water. Bring to a boil over high heat. Reduce the heat to low and simmer until the grains are tender, about 50 minutes. Drain again in that sieve or colander; if you're using a standard colander with larger holes, line it with cheesecloth or paper towels so you don't lose the fennel seeds.",
        "3. As the wheat berries cook, scatter the pistachios, pine nuts, and walnuts in a large dry skillet and set it over medium-low heat. Toast, stirring once in a while, until the nuts are lightly browned, maybe 5 or 6 minutes. Spread them out on a large cutting board and cool for a few minutes; then chop them into small pieces, about the size of the wheat berries themselves.",
        "4. Scrape the wheat berries and fennel seeds into a big bowl. Mix in everything else: the chopped nuts, sugar, pomegranate seeds, coconut, cinnamon, and salt. Cool to room temperature before serving, or store in a sealed container in the refrigerator for breakfasts (or snacks) in the week to come."
    ],
    "ingredients": [
        "1 cup wheat berries, preferably soft white wheat berries",
        "2 tablespoons fennel seeds",
        "1 cup shelled, unsalted pistachios",
        "1 cup pine nuts",
        "1 cup chopped walnuts (in about 1/2-inch bits to match the pistachios)",
        "1/4 cup sugar",
        "1/4 cup pomegranate seeds",
        "1/4 cup unsweetened shredded coconut",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Nut",
        "Side",
        "Vegetarian",
        "Tree Nut",
        "Pine Nut",
        "Walnut",
        "Vegan",
        "Pomegranate",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Syrian Sliha",
    "url": "http://www.epicurious.com/recipes/food/views/syrian-sliha-51118420"
}
