{
    "directions": [
        "Place sugar, salt, and oil in either a mixing bowl for an electric mixer with a dough hook or any large bowl.  Add hot water, and stir to dissolve the sugar and salt. Stir in yeast, and let stand until mixture gets foamy.  Add slightly beaten eggs.",
        "If using an electric mixer, add  4 1/2 cups of flour to the yeast mixture.  Mix until flour is mixed in, and dough gets stringy. This stringiness indicates that the gluten has developed.  Continue to add flour until dough is all on dough hook; 1 or 2 cups is usually sufficient.  Let hook continue to knead for several minutes.  Dough should be smooth and elastic.  To knead by hand, stir 4 1/2 cups of flour in to the yeast mixture. Turn soft dough onto lightly floured surface, and work in 1 to 2 cups of flour. Knead until smooth and elastic, about 8 to 10 minutes.",
        "Place dough into a greased bowl, and turn several times to coat the surface.  Cover bowl with a damp cloth.  Let dough rise until doubled in bulk.  Punch down after first rising, and allow to rise a second time. The first rising is about 1 hour, the second about 45 minutes.  Two risings makes for a better bread, but if time is a problem just do one.",
        "Divide dough in half, and divide each half into three or four equal parts.  Make two braids, and place both breads on a greased baking sheet.  Cover, and allow to rise until doubled.  Brush with beaten egg.  Sprinkle with poppy seeds, if desired.",
        "Bake at 350 degrees F (175 degrees C) for 35 minutes until golden brown.  Allow loaves to cool on a wire rack."
    ],
    "ingredients": [
        "1/4 cup white sugar",
        "1 tablespoon salt",
        "1/4 cup vegetable oil",
        "1 1/4 cups warm water",
        "2 (.25 ounce) packages active dry yeast",
        "3 eggs",
        "6 cups all-purpose flour",
        "1 egg",
        "1 tablespoon poppy seeds (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Sy's Challah",
    "url": "http://allrecipes.com/recipe/6681/sys-challah/"
}
