{
    "directions": [
        "In a wok or large skillet heat the vegetable oil over high heat until it is hot but not smoking and in it stir-fry the eggplant over moderately high heat for 3 to 5 minutes, or until it is tender and browned. Transfer the eggplant with a slotted spoon to paper towels to drain.",
        "In a small bowl dissolve the cornstarch in the broth. To the wok add the garlic, the gingerroot, the chili paste, the hoisin sauce, the vinegar, and the Sherry and stir-fry the mixture for 30 seconds. Add the scallions and stir-fry the mixture for 30 seconds. Add the soy sauce, the brown sugar, the cornstarch mixture, stirred, the bell pepper, and the eggplant and stir-fry the mixture for 1 minute, or until the eggplant has absorbed most of the liquid. Remove the wok from the heat, add the sesame oil and salt and pepper to taste, and toss the mixture well. The eggplant mixture may be made 1 day in advance and kept covered and chilled. Transfer the eggplant mixture to a bowl and serve it with the pita wedges."
    ],
    "ingredients": [
        "1/4 cup vegetable oil",
        "a 1 1/4-pound eggplant, peeled if desired and cut into 1/2-inch cubes (about 6 cups)",
        "1 teaspoon cornstarch",
        "1/2 cup chicken broth",
        "1 teaspoon minced garlic",
        "1 tablespoon minced peeled fresh gingerroot",
        "2 to 3 teaspoons Szechwan chili paste*, or to taste",
        "1 teaspoon hoisin sauce*",
        "1 tablespoon rice vinegar* or white-wine vinegar",
        "1 tablespoon dry Sherry",
        "3 scallions, sliced thin",
        "2 tablespoons soy sauce",
        "1 tablespoon firmly packed light brown sugar",
        "1 red bell pepper, minced",
        "1/2 teaspoon Oriental sesame oil, or to taste",
        "white pita and whole-wheat pita, cut into wedges, as an accompaniment",
        "*available at Oriental markets, specialty foods shops, and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Stir-Fry",
        "Eggplant",
        "Summer",
        "Gourmet"
    ],
    "title": "Szechwan-Style Eggplant with Pita Wedges",
    "url": "http://www.epicurious.com/recipes/food/views/szechwan-style-eggplant-with-pita-wedges-12780"
}
