{
    "directions": [
        "In dry heavy skillet over moderate heat, toast peppercorns, stirring, until fragrant, 3 to 5 minutes. Transfer to bowl and let cool, then grind in spice grinder to fine powder. Set aside.",
        "In large pot over moderately high heat, bring 4 cups water to boil. Add tofu, remove from heat, and let steep, uncovered, 5 minutes. Using slotted spoon, transfer tofu to medium bowl and set aside.",
        "In small bowl, whisk together hot bean paste, black-bean paste, 2 tablespoons oyster sauce, and chili powder. Set aside.",
        "In small bowl, whisk together cornstarch and 3 tablespoons water. Set aside.",
        "In wok or heavy large sauté pan over moderate heat, heat oil until hot but not smoking. Add beef, ginger, garlic, and scallions and stir-fry until meat is browned, about 1 minute. Add rice wine and cook, stirring occasionally, until most of moisture evaporates, 1 to 2 minutes. Add hot bean paste mixture and cook, stirring occasionally, until mixture is incorporated and oil in pan turns red, about 1 minute.",
        "Add tofu, leeks, stock, light and dark soy sauces, and remaining 2 tablespoons oyster sauce and bring to boil. Whisk cornstarch mixture to recombine, then add to pan and cook, stirring occasionally, until juices thicken slightly, about 1 minute.",
        "Transfer to serving dish. Sprinkle with Sichuan peppercorn powder and cilantro, if using. Serve immediately."
    ],
    "ingredients": [
        "1 teaspoon Sichuan peppercorns",
        "1 1/2 pounds soft (not silken) tofu, cut into 1-inch cubes",
        "2 tablespoons Chinese hot bean paste (also called chili bean sauce)*",
        "1 tablespoon Chinese black-bean paste or sauce*",
        "4 tablespoons oyster sauce",
        "2 tablespoons Asian chili powder*",
        "1 tablespoon cornstarch",
        "1/4 cup peanut oil",
        "4 ounces ground beef",
        "1 (1/4-inch) piece fresh ginger, minced (about 1 teaspoon)",
        "2 cloves garlic, minced",
        "1 scallion (white and green parts), thinly sliced on diagonal",
        "1/4 cup Shaohsing rice wine",
        "1 medium leek (white and pale green parts only), washed, halved lengthwise, and cut into 1/2-inch slices (about 1/2 cup)",
        "1/2 cup chicken stock or low-sodium chicken broth",
        "1 tablespoon light soy sauce",
        "1 tablespoon dark soy sauce",
        "2 tablespoons fresh cilantro, chopped (optional)",
        "*Available at Asian markets and in the Asian section of some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Wok",
        "Ginger",
        "Stir-Fry",
        "Lunar New Year",
        "Ground Beef",
        "Tofu",
        "Spice",
        "Leek",
        "Soy Sauce"
    ],
    "title": "Ma–Po Tofu (Spicy Bean Curd with Beef)",
    "url": "http://www.epicurious.com/recipes/food/views/ma-po-tofu-spicy-bean-curd-with-beef-243066"
}
