{
    "directions": [
        "Combine the crushed pretzels and parmesan cheese in a small bowl. Set aside.",
        "Fill a large pot with lightly salted water, and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni, and return to a boil. Cook until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well.",
        "Place the bacon in a large, deep pot, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Place the bacon slices on a paper towel-lined plate. Pour off the bacon fat, reserving 2 tablespoons of the fat.",
        "Melt the butter in the saucepan with the reserved bacon fat over medium heat. Stir in the onion, celery, carrots, and garlic; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the flour, and stir until the mixture becomes paste-like and light golden brown, about 3 minutes. Gradually whisk the mustard, the beer, and finally the milk into the flour mixture; bring to a simmer over medium heat. Cook and stir until the mixture is thick and smooth, 5 to 10 minutes.",
        "Stir in the cheese, bacon, red pepper, salt, and pepper. Turn off the heat, and stir in the cooked macaroni. Sprinkle with the pretzel and cheese mixture before serving."
    ],
    "ingredients": [
        "3 sourdough pretzels, crushed",
        "2 tablespoons grated Parmesan cheese",
        "1 (16 ounce) package whole wheat elbow macaroni",
        "6 slices bacon, chopped",
        "1 tablespoon butter",
        "1 onion, diced",
        "2 stalks celery, diced",
        "2 carrots, diced",
        "2 cloves garlic, minced",
        "3 tablespoons all-purpose flour",
        "2 tablespoons Dijon mustard",
        "1 (12 fluid ounce) bottle beer",
        "2 1/2 cups milk",
        "3 cups shredded sharp Cheddar cheese",
        "1/2 teaspoon ground red pepper",
        "salt and pepper, to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mac and Cheese and Beer",
    "url": "http://allrecipes.com/recipe/174719/mac-and-cheese-and-beer/"
}
