{
    "directions": [
        "Preheat oven to 400°F. Butter 11x7x2-inch glass baking dish. Melt 3 tablespoons butter in heavy large skillet over medium-high heat. Add shallots; sprinkle with salt and pepper. Cover and cook 5 minutes, stirring often. Reduce heat to medium. Cook, covered, until shallots are deep brown, stirring often, about 6 minutes.",
        "Meanwhile, cook macaroni in large saucepan of boiling salted water until just tender but still firm to bite, stirring occasionally; drain well. Reserve pan. Bring half and half and hot sauce to simmer in same saucepan over medium heat. Toss cheddar cheese and flour in medium bowl to coat; add to half and half mixture. Whisk until sauce is smooth and just returns to simmer, about 2 minutes. Mix in pasta. Season with salt and pepper.",
        "Spread pasta mixture in prepared dish. Top with shallots, then goat cheese. Sprinkle with pepper. Bake until heated through, about 15 minutes."
    ],
    "ingredients": [
        "3 tablespoons butter plus more for baking dish",
        "3 cups sliced large shallots (about 6)",
        "8 ounces small elbow macaroni (2 cups)",
        "1 1/4 cups half and half",
        "2 1/2 teaspoons hot sauce (such as Cholula)",
        "2 cups (packed) coarsely grated extrasharp cheddar cheese (about 8 ounces)",
        "1 1/2 tablespoons all purpose flour",
        "2/3 cup crumbled soft fresh goat cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Dinner",
        "Goat Cheese",
        "Fall",
        "Potluck",
        "Shallot",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Mac and Two Cheeses with Caramelized Shallots",
    "url": "http://www.epicurious.com/recipes/food/views/mac-and-two-cheeses-with-caramelized-shallots-350762"
}
