{
    "directions": [
        "Defrost spinach in microwave. Wring out and separate, reserve.",
        "While the spinach defrosts, bring a large pot of water to a boil over medium heat for the pasta and a pan with a few inches of water to a boil over medium heat for the broccolini. Salt the boiling water and cook pasta to just-shy of al dente. Cook the broccolini for 3 minutes, then shock in a bowl of cold water and drain well.",
        "Return the pan that you cooked the broccolini in, to the stove top over medium heat and add 3 tablespoons butter. When the butter has melted, whisk in the flour and cook for 1 minute. Add the milk and whisk to combine. Cook the sauce for 5 minutes, to thicken, then season with salt, pepper and nutmeg, to taste. Reduce the heat to low. When pasta is almost ready, and the provolone and Asiago cheeses to the sauce.",
        "Heat the broiler or the oven to high.",
        "In a large bowl, combine the pasta with the spinach, broccolini and sauce. Transfer to individual casseroles or a large single casserole dish. Top with the Parmesan cheese and brown under the broiler or in hot oven for a couple of minutes. Remove from the oven and serve."
    ],
    "ingredients": [
        "1 box chopped frozen spinach",
        "Salt",
        "1 pound cavatappi, hollow corkscrew pasta or other short cut pasta",
        "1 bunch broccolini, trimmed and chopped into 2-inch pieces",
        "3 tablespoons butter",
        "3 tablespoons all-purpose flour",
        "2 1/2 cups whole milk",
        "Black pepper",
        "Nutmeg, grated, to taste",
        "1 cup grated provolone",
        "1 cup shredded Asiago",
        "1 cup grated Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Pasta Recipes",
        "Easy Recipes",
        "Pasta Recipes",
        "Easy Main Dish Recipes",
        "Main Dish Recipes",
        "Easy Side Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "American",
        "Macaroni and Cheese",
        "Spinach",
        "Vegetable",
        "Cheese",
        "Dairy Recipes",
        "Provolone Recipes",
        "Broiling",
        "Kid-Friendly"
    ],
    "title": "Mac-n-Cheese-n-Spin-occolini Bake",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/mac-n-cheese-n-spin-occolini-bake-recipe"
}
