{
    "directions": [
        "Preheat the oven to 375 degrees F.",
        "Heat the butter and 2 tablespoons of olive oil in a large (12-inch) saute pan, add the mushrooms, and cook over medium heat for 3 to 5 minutes, until they are tender. Add the sherry and continue to saute for a few more minutes, until the sherry is absorbed. Set aside.",
        "Bring a large pot of water to a boil and add a splash of olive oil and a pinch of salt. Add the pasta and cook for 6 to 8 minutes, until al dente. Drain well.",
        "Meanwhile, melt the truffle butter in a large (4-quart) saucepan and whisk in the flour. Cook for 2 minutes over low heat, stirring constantly with a whisk. Slowly whisk in the hot milk and cook for 2 minutes, stirring constantly with a wooden spoon, until the white sauce is thickened and creamy. Off the heat, add the Gruyere, Cheddar, 1 1/2 tablespoons salt, the pepper, and nutmeg.",
        "Combine the pasta, sauce, and mushrooms in a large bowl and pour them into a 10 by 13 by 2-inch baking dish.",
        "Place the garlic and parsley in the bowl of a food processor fitted with the steel blade and pulse until they're minced. Add the bread crumbs and pulse to combine. Sprinkle the crumbs over the pasta and bake for 35 to 45 minutes, until the sauce is bubbly and the crumbs are golden brown. Serve hot."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "Good olive oil",
        "1/2 pound shiitake mushrooms, stems removed and caps sliced 1/2-inch",
        "1/2 pound cremini mushrooms, stems removed and caps sliced 1/2-inch",
        "3 tablespoons cream sherry",
        "Kosher salt",
        "1 pound pasta, such as cavatappi",
        "3 ounces white truffle butter (recommended: D'Artagnan)",
        "1/2 cup all-purpose flour",
        "1 quart whole milk, scalded",
        "12 ounces Gruyere cheese, grated (4 cups)",
        "8 ounces extra-sharp Cheddar, grated (2 1/2 to 3 cups)",
        "1 teaspoon freshly ground black pepper",
        "1/2 teaspoon ground nutmeg",
        "2 garlic cloves, chopped",
        "3 tablespoons freshly chopped parsley leaves",
        "1 1/2 cups fresh white bread crumbs"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pasta Recipes",
        "Macaroni and Cheese",
        "Mushroom",
        "Vegetable",
        "Cheese",
        "Gruyere Recipes",
        "Cheddar",
        "Dairy Recipes",
        "Main Dish Recipes",
        "Lunch"
    ],
    "title": "Mac and Cheese",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/mac-and-cheese-recipe"
}
