{
    "directions": [
        "Preheat the oven to 350°F. Lightly butter a 9- by 13-inch baking dish.",
        "In a small saucepan over moderate heat, melt 3 tablespoons of the butter. Place the panko bread crumbs in a small bowl, drizzle with the melted butter, and toss to combine. Add a handful of the grated cheese to the bowl, toss to combine, and set aside.",
        "In a large pot of boiling salted water, cook the elbow macaroni until al dente. Drain the noodles, without rinsing, then return them to the pot they were cooked in.",
        "In a small saucepan over moderate heat, warm the milk just until it starts to steam and form tiny bubbles around its edges—be careful not to let the milk come to a boil. Remove from the heat.",
        "In a medium saucepan over moderate heat, melt the remaining 3 tablespoons of butter. Add the flour and use a flat-edged wooden spoon or heat-safe rubber spatula to stir the mixture together, scraping the bottom of the pan to prevent burning, just until it starts to turn a light brown color, about 3 minutes. Slowly add the warm milk and stir constantly until the sauce thickens, about 3 minutes. Remove from the heat and stir in the dry mustard, salt, and pepper. Add the remaining grated cheese and stir until it's completely melted. Adjust the seasoning to taste. Pour the cheese sauce over the cooked elbow macaroni and gently stir to coat the noodles in the sauce.",
        "Pour the macaroni and cheese into the prepared baking dish and top with the panko-cheese mixture. Bake until light golden brown and bubbling, about 30 minutes. Serve hot. DO AHEAD: Macaroni and cheese can be made ahead, put into the baking dish, cooled completely, and kept, covered in the refrigerator, for 2 days. Do not add the bread crumbs until ready to bake. (Chilled Macaroni and Cheese may take longer than 30 minutes to be fully cooked.)"
    ],
    "ingredients": [
        "6 tablespoons unsalted butter, plus more to grease the baking dish",
        "1 cup panko bread crumbs",
        "24 ounces sharp or extra-sharp Cheddar, grated (about 9 cups total)",
        "1 pound elbow macaroni",
        "3 1/4 cups whole milk",
        "3 tablespoons all-purpose flour",
        "1 1/2 teaspoons dry mustard",
        "1 teaspoon fine sea salt",
        "1/2 teaspoon freshly ground black pepper",
        "Equipment: 9- by 13-inch baking dish, flat-edged wooden spoon or heat-safe rubber spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Pasta",
        "Bake",
        "Super Bowl",
        "Kid-Friendly",
        "Back to School",
        "Cheddar",
        "Fall",
        "Winter",
        "Breadcrumbs"
    ],
    "title": "Macaroni and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/macaroni-and-cheese-51218810"
}
