{
    "directions": [
        "Preheat oven to 350°F Butter 13x9x2-inch baking dish. Cook macaroni in heavy large pot of boiling salted water until just tender but still firm to bite. Drain. Rinse and drain again.",
        "Cook bacon in heavy large pot over medium heat until crisp, about 10 minutes. Transfer bacon and 1/4 cup pan drippings to large bowl. Add breadcrumbs, 1/4 cup Parmesan cheese and 1/4 cup parsley to bacon; toss to coat.",
        "Add minced garlic to remaining pan drippings in pot and sauté over medium heat until fragrant, about 30 seconds. Add flour and whisk 3 minutes. Gradually whisk in whole milk, then egg yolks, salt and pepper. Cook until mixture thickens, whisking constantly, about 12 minutes. Add 2 cups Fontina cheese and remaining 3/4 cup Parmesan cheese; whisk until cheeses melt. Remove from heat. Mix in peas, macaroni and remaining 1/4 cup parsley. Stir in remaining 1 1/2 cups Fontina. Transfer macaroni mixture to prepared dish. (Can be prepared 6 hours ahead. Cover macaroni and breadcrumb mixtures separately and refrigerate. Before continuing, bake refrigerated macaroni mixture, covered, at 350°F until just heated through, about 30 minutes.)",
        "Sprinkle breadcrumb mixture over macaroni mixture. Bake just until topping is golden, about 15 minutes. Let stand 15 minutes before serving."
    ],
    "ingredients": [
        "3 1/4 cups large elbow macaroni (about 11 ounces)",
        "12 bacon slices",
        "3 cups fresh coarse breadcrumbs made from French bread (about 4 ounces)",
        "1 cup (packed) finely grated Parmesan cheese (about 4 ounces)",
        "1/2 cup chopped fresh Italian parsley",
        "2 garlic cloves, minced",
        "3 tablespoons all purpose flour",
        "6 cups whole milk",
        "6 large egg yolks",
        "1 1/2 teaspoons salt",
        "3/4 teaspoon ground black pepper",
        "3 1/2 cups (packed) grated Fontina cheese (about 14 ounces)",
        "1 1/4 cups frozen peas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Pasta",
        "Pork",
        "Bake",
        "Christmas",
        "Parmesan",
        "Bacon",
        "Winter",
        "Fontina"
    ],
    "title": "Macaroni and Cheese Carbonara",
    "url": "http://www.epicurious.com/recipes/food/views/macaroni-and-cheese-carbonara-102871"
}
