{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).  Grease and line with waxed paper two 8 inch cake pans.",
        "Drain and reserve syrup from pineapple.  Add enough water to syrup to make 1/2 cup liquid.  Place liquid in small saucepan, and mix in cornstarch.  Cook and stir over medium heat until thickened, about 2 minutes; stir in reserved pineapple.  Spoon filling into a small bowl.  Cover with plastic wrap, and refrigerate until chilled.",
        "Whisk together flour, baking powder, and salt in a small bowl.",
        "In large bowl, cream the butter or margarine.  Add 1/2 cup sugar, and beat until fluffy.  Beat in egg yolks and vanilla.  Add flour mixture alternately with milk in two parts, mixing after each addition.  Spread batter into prepared pans.  Sprinkle with all but 2 tablespoons macadamia nuts.",
        "In another bowl, beat egg whites until soft peaks form.  Gradually add remaining 1/2 cup sugar, and beat until stiff peaks form.  Spread egg whites evenly over batter.",
        "Bake for 35 minutes, or until tester inserted in the center of the layers comes out clean.  Remove from oven; cool in pans on wire racks.  Loosen edges with spatula and turn out of pans.  Peel off waxed paper.  Place one layer, cake side down, on plate.  Spread with pineapple filling.  Place second layer, meringue side down over filling."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "1 1/4 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1/2 cup butter, softened",
        "1 cup white sugar",
        "3 eggs",
        "1 teaspoon vanilla extract",
        "1/4 cup milk",
        "3/4 cup chopped macadamia nuts",
        "1 (8 ounce) can crushed pineapple in heavy syrup",
        "1 tablespoon cornstarch"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Macadamia Pineapple Dream Cake",
    "url": "http://allrecipes.com/recipe/7780/macadamia-pineapple-dream-cake/"
}
