{
    "directions": [
        "Lay poblanos on their sides on racks of gas burners, then turn flames on moderately high. Roast poblanos, turning occasionally with tongs, until skins are blistered and charred, 4 to 6 minutes. (Alternatively, broil poblanos on a broiler pan about 2 inches from heat, turning occasionally with tongs, 8 to 10 minutes.) Transfer poblanos immediately to a large bowl and cover. Let steam 10 minutes, then peel or rub off skins and discard stems, seeds, and ribs. Cut poblanos into 1/4-inch-thick strips.",
        "Cook onion with salt in butter in a 12-inch heavy skillet over moderately low heat, stirring occasionally, until onion is golden, 10 to 12 minutes. Add poblanos, serrano, garlic, and oregano and cook, stirring, until fragrant, about 1 minute. Remove from heat.",
        "While onion is browning, cook pasta in a large pot of boiling salted water until tender, 14 to 15 minutes. Reserve 1/4 cup pasta-cooking water, then drain pasta in a colander. Add pasta to chile mixture along with crema and reserved cooking water. Increase heat to high and cook, tossing, until pasta is well coated, about 1 minute. Stir in cheese."
    ],
    "ingredients": [
        "3/4 pound fresh poblano chiles (about 4)",
        "1/2 large white onion, cut lengthwise into 1/4-inch-wide strips (1 3/4 cups)",
        "1/2 teaspoon salt",
        "2 tablespoons unsalted butter",
        "1/2 fresh serrano chile, minced (1 teaspoon), including seeds",
        "2 large garlic cloves, minced",
        "1/2 teaspoon dried oregano (preferably Mexican), crumbled",
        "6 oounces dried cavatappi or penne",
        "2/3 cup crema or crème fraîche",
        "4 ounces queso fresco or mild feta, crumbled (1 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Pasta",
        "Pepper",
        "Roast",
        "Vegetarian",
        "Hot Pepper",
        "Fall",
        "Winter",
        "Gourmet"
    ],
    "title": "Macaroni with Cream and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/macaroni-with-cream-and-cheese-231498"
}
