{
    "directions": [
        "Preheat oven to 325°F. and butter and flour a loaf pan, 9 by 5 by 3 inches, knocking out excess flour.",
        "Onto a sheet of wax paper sift together flour, baking powder, and salt. In a bowl with an electric mixer on medium speed cream butter 1 minute and beat in sugar in a steady stream, beating until light and fluffy. Add eggs, a little at a time, beating well after each addition and scraping bowl occasionally. Beat in rum until mixture is pale and fluffy. Add flour mixture, one third at a time, beating well after each addition, and beat until batter is smooth. Spoon batter into prepared pan, smoothing top, and bake in middle of oven until a tester comes out clean, about 1 hour and 10 minutes. Cool cake in pan on a rack 10 minutes. Invert cake onto rack and cool completely.",
        "In a small saucepan combine sugar and water and boil, stirring until sugar is dissolved, 2 minutes. Remove pan from heat and stir in rum. Cool syrup to room temperature.",
        "In a metal bowl stir together ice cream and nuts and freeze until needed.",
        "Line cleaned loaf pan with plastic wrap, leaving a 3-inch overhang on short sides. Halve cake horizontally with a serrated knife and reserve bottom half for another use. Halve remaining cake horizontally and put bottom layer in loaf pan. Brush layer in loaf pan and cut side of other layer with syrup. Working quickly, spread ice cream evenly over cake layer in loaf pan and top with remaining cake layer, rounded side up. Freeze cake, covered, until frozen hard, about 6 hours. Cake may be made 3 days ahead and kept frozen.",
        "Preheat oven to 450°F.",
        "In a large bowl with an electric mixer stir together egg whites, salt, and sugar. Set bowl over a saucepan of simmering water and stir mixture just until sugar is dissolved. Remove bowl from pan and with mixer beat meringue until it holds stiff, glossy peaks.",
        "Working quickly, remove cake from pan and arrange, flat side down, on an ovenproof shallow platter. With a rubber spatula spread top and sides of cake with a generous layer of meringue, covering it completely. Transfer remaining meringue to a pastry bag fitted with a large star tip and pipe it generously on and around dessert. Bake dessert in middle of oven 4 to 5 minutes, or until meringue is golden brown. Serve immediately."
    ],
    "ingredients": [
        "2 cups cake flour (not self-rising)",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "2 sticks (1 cup) unsalted butter, softened",
        "1 1/4 cups sugar",
        "5 large eggs, beaten lightly",
        "1 1/2 tablespoons dark rum",
        "1/3 cup sugar",
        "2/3 cup water",
        "3 tablespoons dark rum",
        "1 1/2 pints (3 cups) super-premium vanilla ice-cream, softened",
        "1 cup salted macadamia nuts, chopped, toasted, and cooled",
        "12 large egg whites",
        "1/2 teaspoon salt",
        "3 cups sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Rum",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Macadamia Nut",
        "Gourmet"
    ],
    "title": "Macadamia Rum Baked Alaska",
    "url": "http://www.epicurious.com/recipes/food/views/macadamia-rum-baked-alaska-10150"
}
