{
    "directions": [
        "Set an oven rack about 6 inches from the heat source and preheat the oven to 425 degrees F.",
        "Bring a large pot of salted water to a boil. Add the macaroni and cook until it is al dente, about 6 minutes. Strain, reserving 1 3/4 cups of the pasta water. Set aside.",
        "Cook the bacon in a large saucepan over medium heat until it is crispy and most of the fat has been rendered, about 15 minutes. Transfer the bacon to a paper-towel-lined plate. Pour the fat into a small heat-safe measuring cup. Add enough olive oil to total 1/4 cup of fat. Reserve.",
        "Carefully wipe out the saucepan (or give it a quick rinse if it is really dirty). Add the half-and-half and 2 teaspoons pepper and bring to a simmer over medium heat. Cook until reduced to 1 1/2 cups, about 15 minutes. Add the cream cheese and stir until melted. Whisk in the Cheddar and Gruyere until all the cheese is melted and the sauce is smooth.",
        "Add the macaroni and the reserved pasta water to the saucepan and stir to combine. (It will look very loose, but the pasta will suck up a lot of the sauce as it bakes.) Season to taste with salt if needed. Gently fold in the bacon and 3/4 of the sliced scallions. Pour into a 13-by-9-inch baking dish.",
        "Toss the bread crumbs with the reserved bacon-fat mixture and a pinch of salt in a medium bowl. Sprinkle the mixture evenly over the top of the macaroni and cheese and bake until the cheese is bubbly and the bread crumbs are lightly browned and crispy, about 10 minutes. Garnish with the remaining scallions and serve."
    ],
    "ingredients": [
        "Kosher salt",
        "1 pound elbow macaroni",
        "8 slices bacon, cut into 1/2-inch pieces",
        "Extra-virgin olive oil",
        "2 1/2 cups half-and-half",
        "Freshly ground black pepper",
        "1 pound cream cheese, room temperature",
        "8 ounces sharp Cheddar, shredded (about 3 cups)",
        "3 ounces Gruyere, shredded (about 1 cup)",
        "4 scallions, thinly sliced",
        "1 cup panko bread crumbs"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Macaroni and Cheese",
        "Bacon Recipes",
        "Meat",
        "Cheese",
        "Main Dish Recipes"
    ],
    "title": "Macaroni and Cheese Carbonara",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/macaroni-and-cheese-carbonara"
}
