{
    "directions": [
        "In a heavy skillet melt the butter over moderate heat and in it cook the macadamia nuts, stirring, until they are light golden. Transfer the nuts with a slotted spoon to a small bowl, reserving the butter, and let them cool. In a large metal bowl whisk together the eggs, the sugars, the cream, the milk, the salt, and the reserved melted butter, transfer the mixture to a large saucepan, and cook it over moderately low heat, stirring until it registers 175°F. on a candy thermometer. Return the mixture to the metal bowl, cleaned, and chill it until it is cold. Freeze the mixture in an ice-cream freezer according the manufacturer's instructions, adding the macadamia nuts, patted dry, when it is frozen partially. Makes about 1 quart.",
        "In a saucepan combine the chocolate and the cream, bring the cream just to a boil, stirring, and remove the pan from the heat. Stir the mixture until it is smooth and stir in the Kahlúa. Transfer the ganache to a metal bowl and let it cool to room temperature.",
        "In a small bowl set over a saucepan of simmering water melt the chocolate, stirring, until it is smooth. In a large saucepan whisk together the melted chocolate, the cream, the milk, the eggs, the sugar, and a pinch of salt and cook the mixture over moderately low heat, stirring, until it registers 175°:F. on a candy thermometer. Stir in the vanilla and stir the mixture until it is combined well. Chill the mixture, its surface covered with plastic wrap, until it is cold. Freeze the mixture in an ice-cream freezer according the manufacturer's instructions. Makes about 1 quart.",
        "In a heavy saucepan combine the sugar with 1/3 cup water, bring the mixture to a boil over moderately high heat, stirring and washing down any sugar crystals clinging to the side of the pan with a brush dipped in cold water until the sugar is dissolved, and cook the syrup, swirling the pan gently, until it turns pale golden. Stir in the macadamia nuts, return the syrup to a boil, and boil the mixture until the syrup is golden. Pour the praline immediately onto an oiled baking sheet and let it cool completely. Break the praline into pieces and in a food processor grind it fine in batches .",
        "Line a lightly oiled 2-quart steamed-pudding mold, including the center stem, or a 2-quart metal bowl with plastic wrap, into it pack the macadamia nut ice cream, and spread the ganache over the top. Freeze the mold for 5 minutes, or until the ganache is set. Pack the bittersweet chocolate ice cream into the mold, cover the mold with the lid or plastic wrap, and freeze the bombe for at least 8 hours and up to 3 days.",
        "In a heavy saucepan combine the sugar with 1/3 cup water, bring the mixture to a boil over moderately high heat, stirring and washing down any sugar crystals clinging to the side of the pan with a brush dipped in cold water until the sugar is dissolved, and cook the syrup, swirling the pan gently, until it turns pale golden. Pour the mixture immediately onto an oiled baking sheet and let it cool completely. Break the sugar candy into small pieces.",
        "To unmold the bombe, dip the mold several times into a bowl of warm water, run a long thin knife around the outer rim of the mold and the rim of the center stem, and invert the bombe onto a platter, Coat the bombe with the ground macadamia nut praline.The bombe may be made 3 hours in advance and dept frozen. Garnish the top of the bombe and the platter with the sugar-candy."
    ],
    "ingredients": [
        "3/4 stick (6 tablespoons) unsalted butter",
        "1 1/2 cups (a 7-ounce jar) salted macadamia nuts, chopped fine",
        "2 large eggs, beaten until foamy",
        "1/2 cup granulated sugar",
        "1/4 cup firmly packed light brown sugar",
        "2 cups heavy cream",
        "1 cup milk",
        "1/4 teaspoon salt",
        "3 1/2 ounces fine-quality bittersweet chocolate, chopped",
        "3 tablespoons heavy cream",
        "2 1/2 tablespoons coffee liqueur",
        "1/2 pound fine-quality bittersweet chocolate, chopped",
        "2 cups heavy cream",
        "1 cup milk",
        "2 large eggs, beaten until foamy",
        "1/4 cup sugar",
        "1 teaspoon vanilla extract",
        "2 cups sugar",
        "1 1/2 cups (a 7-ounce jar) salted macadamia nuts, chopped",
        "2 cups sugar for garnish if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Chocolate",
        "Egg",
        "Dessert",
        "Freeze/Chill",
        "Kid-Friendly",
        "Frozen Dessert",
        "Macadamia Nut",
        "Kahlúa",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Macadamia Nut and Bittersweet Chocolate Ice-Cream Bombe with Macadamia Nut Praline",
    "url": "http://www.epicurious.com/recipes/food/views/macadamia-nut-and-bittersweet-chocolate-ice-cream-bombe-with-macadamia-nut-praline-11092"
}
