{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray a 3-quart casserole dish with cooking spray.",
        "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain macaroni and transfer to the prepared casserole dish.",
        "Heat butter in a saucepan over medium heat; cook and stir onions in the melted butter until partially translucent, about 5 minutes. Whisk in flour until paste-like consistency, 3 to 5 minutes. Slowly stream in milk, stirring constantly, until flour mixture is incorporated, about 5 minutes. Stir in Cheddar cheese and Parmesan cheese until completely melted and and sauce has thickened, 5 to 10 minutes.",
        "Pour cheese sauce into macaroni; stir to coat. Season with black pepper. Stir in sausage.",
        "Reserve 4 slices of pears; dice remaining pear slices and stir into macaroni mixture. Arrange the reserved slices atop macaroni mixture.",
        "Stir 2 tablespoons melted butter and bread crumbs together in a small bowl; sprinkle over macaroni mixture.",
        "Bake in the preheated oven until cheese is bubbling and topping is lightly browned, about 30 minutes."
    ],
    "ingredients": [
        "cooking spray",
        "1 (8 ounce) package elbow macaroni",
        "1/4 cup butter",
        "1/4 onion, chopped",
        "2 1/2 tablespoons all-purpose flour, or as needed",
        "3 cups milk",
        "2 cups shredded sharp Cheddar cheese",
        "1/2 cup grated Parmesan cheese",
        "ground black pepper to taste",
        "1 (12 ounce) package fully-cooked sausage, sliced",
        "1 pear - peeled, cored, and sliced",
        "2 tablespoons butter, melted",
        "1/2 cup bread crumbs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Macaroni and Cheese with Sausage and Pears",
    "url": "http://allrecipes.com/recipe/229425/macaroni-and-cheese-with-sausage-and/"
}
