{
    "directions": [
        "Melt butter in heavy large pot over medium heat. Add next 5 ingredients; sauté until tender, about 8 minutes. Add wine and simmer until almost all liquid evaporates, about 10 minutes. Add cream, thyme sprigs, bay leaf and peppercorns; bring to simmer. Reduce heat to low; simmer until slightly reduced, about 15 minutes. Remove from heat. Add Taleggio and Parmesan cheeses. Stir until melted and smooth. Discard bay leaf and thyme sprigs. Cool sauce slightly. Puree sauce in 2 batches in blender until smooth. Strain into same pot. Stir in chopped truffles, if desired. Season with salt and white pepper.",
        "Preheat broiler. Cook pasta in large pot of boiling salted water until just tender but still firm to bite.",
        "Mix first 3 ingredients in small bowl. Melt butter in heavy medium skillet over medium heat. Add breadcrumb mixture and sauté until golden and coated with butter, about 2 minutes.",
        "Drain pasta well. Add to sauce along with prosciutto, chives, parsley and 1 teaspoon truffle oil; toss to coat. Mix in additional truffle oil, if desired. Divide macaroni and cheese among 8 individual gratin dishes. Top each with Crumb Topping. Broil until topping is crisp and golden brown, about 2 minutes, and serve."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 medium leek (white and pale green parts only), chopped",
        "1 celery stalk, chopped (about 2/3 cup)",
        "2 ounces button mushrooms, sliced",
        "2 shallots, chopped",
        "2 garlic cloves, minced",
        "1 1/2 cups dry white wine",
        "3 cups whipping cream",
        "3 fresh thyme sprigs",
        "1 bay leaf",
        "1/4 teaspoon whole white peppercorns",
        "1 pound Taleggio cheese,* rind removed, cut into 1/2-inch pieces",
        "1/4 cup freshly grated Parmesan cheese",
        "1 tablespoon chopped whole black truffles from jar* (optional)",
        "Ground white pepper",
        "1-pound small elbow macaroni",
        "6 ounces thinly sliced prosciutto, chopped* (about 1 3/4 cup)",
        "6 tablespoons chopped fresh chives",
        "1/4 cup chopped fresh Italian parsley",
        "1 teaspoon (or more) white truffle oil*",
        "1 cup fresh breadcrumbs (made from crustless egg bread)",
        "2 tablespoons chopped fresh chives",
        "2 tablespoons chopped fresh Italian parsley",
        "2 tablespoons (1/4 stick) butter",
        "Available at Italian markets, specialty food stores and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Garlic",
        "Herb",
        "Onion",
        "Pasta",
        "Pork",
        "Vegetable",
        "Broil"
    ],
    "title": "Macaroni and Cheese with Prosciutto and Taleggio",
    "url": "http://www.epicurious.com/recipes/food/views/macaroni-and-cheese-with-prosciutto-and-taleggio-235816"
}
