{
    "directions": [
        "Mince garlic and in a small cup combine with 2 tablespoons oil. Let garlic mixture stand, covered and chilled, 1 to 2 hours.",
        "Cut salt pork or bacon into 1/4-inch dice and in a small bowl combine with 1 cup water. Let salt pork or bacon stand 30 minutes and drain.",
        "In a small heavy saucepan bring remaining 1/4 cup water to a boil with pork or bacon and cook, covered, over moderately high heat until water is evaporated, about 8 minutes. Lower heat to moderately low and continue to cook pork or bacon, covered, stirring occasionally, until golden and crisp. With a slotted spoon transfer pork or bacon to paper towels to drain and discard rendered fat (or reserve for another use if desired).",
        "Preheat oven to 200°F.",
        "With a sharp small knife cut unpeeled plantains into 3/4-inch-thick slices. Slit skin along side of each slice and peel off. In a 12-inch nonstick skillet heat 1/2 inch oil over moderate heat until just hot enough to sizzle when a plantain slice is added. Fry plantains in batches, without crowding, until tender and just golden, 2 to 3 minutes on each side. With tongs transfer plantains as fried to paper towels to drain and transfer to a baking pan. Keep fried plantains warm in middle of oven.",
        "In a food processor pulse warm fried plantains until coarsely mashed. Add garlic mixture, fried pork or bacon, and salt and pulse until mixture just starts to hold together. (If desired, mold before serving: Transfer mashed plantains to a small bowl and press into bowl. Invert bowl onto a serving plate and tap to unmold plantains.)"
    ],
    "ingredients": [
        "1 garlic clove",
        "about 2 cups plus 2 tablespoons olive oil",
        "1/4 pound rindless meaty salt pork or thick-sliced bacon",
        "1 1/4 cups water",
        "3 barely ripe (slightly yellow) to semi-ripe (yellow with some spots) plantains",
        "1/2 teaspoon salt, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fruit",
        "Garlic",
        "Pork",
        "Side",
        "Fry",
        "Bacon",
        "Plantain",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Machuquillo de Platanos",
    "url": "http://www.epicurious.com/recipes/food/views/machuquillo-de-platanos-15744"
}
