{
    "directions": [
        "1. Cut the thin ends off the mackerel fillets and set them aside. Cut the thick parts of the fillets crosswise into 8 thin, wide slices. Lay the slices flat on a plate, wrap tightly with plastic, and refrigerate.",
        "2. Roughly dice the thin ends of the filets. Using a mortar and pestle, smash the garlic and a pinch of salt into a paste.",
        "3. In a bowl, whisk together the crème fraîche, dill, horseradish, vinegar, caraway, and garlic paste. Gently stir in the diced mackerel, cucumber, beet, and apple. Season with salt and pepper. (Do not mix too much or the salad will turn pink from the beet.)",
        "4. Prepare the vinaigrette: In an electric juicer, juice the lettuce, cucumber, and parsley (alternately, puree the vegetables in a food processor or blender, adding a little water if necessary). Add a pinch of ascorbic acid, if desired, to keep the juice bright green. You should have 3/4 cup juice. Whisk in the lemon juice, vinegar, and salt and pepper to taste. Whisking constantly, drizzle in the oils and whisk until combined. Set aside 1/4 cup of this vinaigrette for the salad greens.",
        "5. Pour the remaining vinaigrette into a shallow, wide bowl. Marinate the mackerel slices in the vinaigrette at room temperature for at least 10 and no more than 20 minutes. Season the slices with salt and pepper.",
        "6. To serve, toss the greens with 3 tablespoons of the reserved vinaigrette. Make two small oval mounds of the diced mackerel tartare in the center of each plate. Top each mound with a mackerel slice. Spoon the remaining vinaigrette on top of and around the mackerel. Garnish with the baby greens and salmon roe.",
        "• Inspired by Austrian fish salads of chopped pickled herring tossed with beets and sour cream, this New Austrian version uses fresh mackerel and a light vinaigrette of fresh vegetable juices. The presentation is also innovative, showcasing the vivid pinks and greens of the components. If you prefer, the salad can be served family-style, with all the ingredients tossed together.",
        "• To grind caraway seeds, first toast them in a dry pan over medium heat until fragrant, one to two minutes. Transfer to a plate and cool completely, then grind with a mortar and pestle or in a clean electric coffee grinder.",
        "• Ascorbic acid is a form of powdered vitamin C that will help maintain the fresh green color of the vinaigrette. It's sold in health food and gourmet grocery stores.",
        "• \"Since this dish is so beautifully colored, you can have a lot of fun with the presentation,\" says Lohninger. \"Try layering the pale greens and pinks in martini glasses as an appetizer, or brush sliced bread with olive oil, toast it, and layer the salad on top like bruschetta.\""
    ],
    "ingredients": [
        "6 ounces (about 2) skinless mackerel filets",
        "1 very small garlic clove",
        "Fine sea salt",
        "3 tablespoons crème fraîche",
        "1 teaspoon chopped fresh dill",
        "1/2 teaspoon prepared horseradish",
        "1/4 teaspoon Champagne vinegar",
        "Pinch of ground toasted caraway seeds (see tips, below)",
        "1/4 cup finely diced cucumber",
        "1/4 cup finely diced cooked beet",
        "1/4 cup finely diced apple",
        "Freshly ground black pepper",
        "1 head Bibb lettuce",
        "3/4 cup seeded, diced cucumber",
        "1/2 cup packed parsley leaves",
        "Pinch of ascorbic acid (optional, see tips, below)",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon Champagne vinegar",
        "Fine sea salt and freshly ground black pepper",
        "3 tablespoons canola oil",
        "2 tablespoons extra-virgin olive oil",
        "3 1/2 ounces (about 3 1/2 cups) mixed baby greens (mesclun)",
        "Salmon roe, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Sauté",
        "Cucumber",
        "Lettuce"
    ],
    "title": "Mackerel \"Herring Style\" with Cucumber-and-Bibb-Lettuce Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/mackerel-herring-style-with-cucumber-and-bibb-lettuce-vinaigrette-231042"
}
