{
    "directions": [
        "Heat oil in a 5-quart heavy pot over moderately high heat until hot but not smoking, then sauté neck, giblets, and onion until well browned, 10 to 15 minutes. Add remaining stock ingredients and simmer, uncovered, until liquid is reduced to about 4 cups, about 45 minutes. Pour stock through a fine-mesh sieve into a bowl, discarding solids. Skim off and discard any fat.",
        "Skim fat from pan drippings (while turkey stands) and reserve fat. Straddle roasting pan across 2 burners, then add Madeira and deglaze pan by boiling over moderately high heat, stirring and scraping up brown bits, until liquid is reduced by about half, about 4 minutes, then add to giblet stock.",
        "Heat 3 tablespoons reserved turkey fat (if you have less, use butter to make up difference) in a 3- to 4-quart heavy saucepan over moderately low heat, then add flour and cook roux, whisking, 3 minutes. Add hot stock in a fast stream, whisking constantly to prevent lumps. Bring to a boil, whisking, then reduce heat and simmer, stirring frequently, 5 minutes. Add cream and simmer, stirring frequently, 10 minutes. Pour sauce through a fine-mesh sieve into a sauceboat or serving bowl and season with salt and pepper."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "Neck and giblets (excluding liver) from turkey, cut into 1-inch pieces",
        "1 onion, left unpeeled, quartered",
        "1 celery rib, coarsely chopped",
        "1 carrot, coarsely chopped",
        "1 quartt low-sodium chicken broth (32 ounces)",
        "2 cups water",
        "1 Turkish or 1/2 California bay leaf",
        "1 teaspoon whole black peppercorns",
        "Drippings from roast turkey , left in roasting pan",
        "1 1/2 cups Sercial Madeira",
        "1 to 2 tablespoons unsalted butter (if necessary)",
        "6 tablespoons all-purpose flour",
        "1/4 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Milk/Cream",
        "turkey",
        "Sauté",
        "Thanksgiving",
        "Quick & Easy",
        "Fortified Wine",
        "Fall",
        "Simmer",
        "Gourmet"
    ],
    "title": "Madeira Cream Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/madeira-cream-gravy-108762"
}
