{
    "directions": [
        "Preheat oven to 350°F. Butter each madeleine mold in pan and dust with flour, tapping out excess. Melt 9 tablespoons unsalted butter in medium skillet over medium heat. Cook until butter turns golden brown, stirring often, 3 to 4 minutes. Set browned butter aside.",
        "Using electric mixer, beat egg whites, sugar, all purpose flour, and almond flour in medium bowl until mixture is blended and smooth. Place honey in small microwave-safe bowl. Heat just to warm, 5 to 10 seconds. Beat honey into batter. Add browned butter; beat to blend. Spoon 1 tablespoon batter into each prepared madeleine mold.",
        "Bake madeleines until tops are just dry and tester inserted into center comes out clean, about 12 minutes. Cool 5 minutes. Gently tap madeleines out of molds. Place on rack to cool slightly.",
        "To prepare additional madeleines, wash pan and cool completely. Butter and flour molds and fill as directed above. Serve madeleines warm.",
        "Sometimes labeled \"ground almonds\"; available at specialty foods stores and natural foods stores.",
        "** A honey made from lavender nectar; available at specialty foods stores."
    ],
    "ingredients": [
        "9 tablespoons (1 stick plus 1 tablespoon) unsalted butter",
        "4 large egg whites, room temperature",
        "1 1/3 cups powdered sugar",
        "6 tablespoons all purpose flour",
        "1/4 cup almond flour or almond meal*",
        "1 tablespoon lavender honey**",
        "Special equipment: Madeleine pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Low Cal",
        "Family Reunion",
        "Honey",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Madeleines with Lavender Honey",
    "url": "http://www.epicurious.com/recipes/food/views/madeleines-with-lavender-honey-357229"
}
