{
    "directions": [
        "Place chicken and garlic in a large pot and with water to cover.  Bring to a boil, then reduce heat and simmer, covered, until meat is very tender, 30 minutes to 1 hour.  Remove chicken from pot and let rest until cool enough to handle.  Remove skin and bone and tear or chop meat into bite-size pieces.",
        "In a large bowl, beat together butter, flour and salt to form a mealy mixture.  Beat in eggs and egg yolks to form a stiff dough.  Divide dough into thirds and roll each third out onto a floured surface to 1/8 inch (3 mm) thickness.  Let rolled pieces of dough rest on racks for 20 minutes.",
        "While dough is resting, stir chicken meat, cilantro, parsley, kale, spinach and green onions into broth.  Season with Italian seasoning, curry powder and balsamic vinegar.  Simmer over low heat, adding more water if necessary.",
        "Slice the noodle dough into 1/2-inch (1.2 cm) widths.  Bring the soup to a light boil and drop noodles into the soup a few at a time.  Cook until noodles are tender, 5 minutes.  Season soup with salt and pepper and serve."
    ],
    "ingredients": [
        "1 (4 pound) whole chicken, cut into pieces",
        "2 medium heads garlic, chopped",
        "3 tablespoons butter",
        "2 1/4 cups sifted all-purpose flour",
        "1 teaspoon salt",
        "4 eggs",
        "4 egg yolks",
        "1 bunch fresh cilantro, chopped",
        "1 bunch fresh parsley, chopped",
        "1 bunch kale, torn into small pieces",
        "1 bunch fresh spinach, stems removed, torn into small pieces",
        "2 bunches green onions, chopped",
        "1 tablespoon Italian seasoning",
        "1 tablespoon curry powder",
        "3 tablespoons balsamic vinegar",
        "salt and cracked black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Magic's Green and White Chicken Soup",
    "url": "http://allrecipes.com/recipe/26435/magics-green-and-white-chicken-soup/"
}
