{
    "directions": [
        "Mix the garlic, shallot, red pepper flakes, and 2 tablespoons olive oil together in a shallow dish.",
        "Lay the mahi mahi fillets in the olive oil mixture; turn to coat.",
        "Season the fillets with salt and black pepper.",
        "Transfer the dish to the refrigerator and allow the fillets to marinate 30 minutes to overnight.",
        "Heat 2 teaspoons olive oil in a skillet over medium-high heat.",
        "Cook and stir the oyster mushrooms in the hot oil until tender, about 5 minutes; season with salt and black pepper.",
        "Pour the white wine over the mushrooms; bring to a simmer and allow to cook while you prepare the mahi mahi.",
        "Remove the mahi mahi fillets from the marinade; shake to remove any excess marinade.",
        "Heat a skillet over medium heat.",
        "Gently lay the fillets in the hot skillet; cook about 5 minutes. Pour the marinade over the fillets and continue cooking until the fish is just beginning to flake in the center; remove from heat, transfer to a serving dish, and keep warm.",
        "Add the tomatoes and butter to the mushroom and wine mixture. Cook and stir together just until the butter has melted; spoon over the mahi mahi fillets to serve."
    ],
    "ingredients": [
        "1 clove garlic, minced, or more to taste",
        "1 tablespoon minced shallot, or more to taste",
        "1 pinch red pepper flakes, or to taste",
        "2 tablespoons olive oil",
        "2 (4 ounce) mahi mahi fillets",
        "salt and ground black pepper to taste",
        "2 teaspoons olive oil",
        "1 cup fresh oyster mushrooms, stemmed and sliced",
        "1/2 cup halved yellow and red grape tomatoes, or more to taste",
        "1/4 cup white wine (optional)",
        "1 tablespoon butter (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mahi and Mushrooms",
    "url": "http://allrecipes.com/recipe/220118/mahi-and-mushrooms/"
}
