{
    "directions": [
        "Whisk all ingredients in small bowl. Do ahead Can be made 1 day ahead. Cover; chill.",
        "Mix first 5 ingredients in small saucepan. Bring sauce to boil over medium heat. Whisk 1 1/2 teaspoons water and cornstarch in small bowl. Add to sauce and boil until mixture thickens, about 1 minute. Do ahead Can be made 1 day ahead. Cover and chill. Bring to room temperature before serving. Divide sauce among 6 small bowls; cool to room temperature.",
        "Whisk all ingredients in small bowl to blend. Do ahead Marinade can be made 1 day ahead. Cover and refrigerate.",
        "Separate leaves from cabbage. Cook in large pot of boiling salted water until wilted, about 30 seconds. Drain; pat dry. Finely chop.",
        "Mix cabbage, rice, green onions, and 3/4 cup panko; season to taste with salt and pepper. Stir in egg. Place remaining 1 1/4 cups panko on plate. Measure heaping tablespoonful of rice mixture; press together firmly to form ball, then flatten slightly into disk. Press disk into panko to coat. Repeat with remaining rice mixture. Cover and chill 30 minutes. Do ahead Can be made 1 day ahead. Keep refrigerated.",
        "Place fish in 13x9x2-inch glass baking dish. Pour marinade over fish and chill at least 1 hour and up to 3 hours.",
        "Preheat oven to 400°F. Add enough vegetable oil to heavy medium skillet to reach depth of 2 inches. Heat oil to 375°F. Working in batches, fry rice fritters until golden brown, about 1 minute per side. Transfer fritters to paper towels to drain. Heat large ovenproof nonstick skillet over medium-high heat. Add fish with marinade still clinging to surface and cook fish until brown, about 3 minutes per side. Transfer skillet to oven and roast fish until just opaque in center, about 5 minutes longer.",
        "Place jicama matchsticks and pea sprouts in large bowl. Pour enough lemongrass dressing over to coat. Season to taste with salt and pepper. Divide slaw among 6 plates, mounding slaw in center. Arrange fish atop slaw on each plate. Divide rice fritters among plates and serve with Vietnamese sauce alongside."
    ],
    "ingredients": [
        "1/4 cup fresh lime juice",
        "2 tablespoons Asian fish sauce",
        "4 teaspoons sugar",
        "1 tablespoon minced red onion",
        "2 teaspoons minced lemongrass",
        "1 small garlic clove, minced",
        "3/4 teaspoon hot pepper sauce",
        "1 cup unseasoned rice vinegar",
        "6 tablespoons sugar",
        "1/4 cup Asian fish sauce",
        "2 tablespoons soy sauce",
        "1 teaspoon minced seeded Thai chile or serrano chile",
        "1 1/2 teaspoons water",
        "1 1/2 teaspoons cornstarch",
        "1/2 cup vegetable oil",
        "2 tablespoons chili powder",
        "2 tablespoons fresh lemon juice",
        "2 tablespoons minced lemongrass",
        "1 tablespoon chopped fresh oregano",
        "1 teaspoon sweet Spanish smoked paprika or sweet Hungarian paprika",
        "1/4 head of Napa cabbage (5 ounces)",
        "1 cup cooked medium-grain rice (such as sushi rice), cooled",
        "3/4 cup chopped green onions (about 6)",
        "2 cups panko (Japanese breadcrumbs), divided",
        "1 large egg, beaten to blend",
        "6 (6- to 7-ounce) mahi-mahi fillets",
        "Vegetable oil (for frying)",
        "4 cups peeled jicama, cut into matchstick-size pieces",
        "3 cups pea sprouts (4 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Garlic",
        "Herb",
        "Onion",
        "Pepper",
        "Rice",
        "Fry",
        "Marinate",
        "Sauté",
        "High Fiber",
        "Jícama",
        "Cabbage",
        "Lemongrass"
    ],
    "title": "Mahi-Mahi with Lemongrass Slaw and Rice Fritters",
    "url": "http://www.epicurious.com/recipes/food/views/mahi-mahi-with-lemongrass-slaw-and-rice-fritters-236886"
}
