{
    "directions": [
        "To prepare the sauce, in a saucepan, combine the water, sugar, and peppercorns. Bring to a boil over high heat, decrease the heat to medium, and simmer for 10 to 15 minutes, until the sauce becomes syrupy. Add the honey, orange zest, lemon zest, orange juice concentrate, lemon juice, syrup, and canola oil. Continue to simmer for 10 to 15 minutes, until the sauce is syrupy and reduced by one third. Pass through a fine-meshed sieve and keep warm.",
        "Split the bananas in half lengthwise. Combine the shichimi and coconut flakes in a shallow bowl. Coat the cut side of each banana piece with the coconut mixture. Place a small sauté pan over medium heat and add the oil. When the oil is hot, add the bananas, coconut side down. Cook for about 2 minutes, or until golden brown. Turn and cook the other side for 1 minute, or until lightly browned. Remove from the heat and keep warm.",
        "Season the mahimahi with salt. Place a sautéw pan over high heat and add the oil. Then the oil is hot, add the mahimahi. Cook for 2 minutes or until browned. Turn and cook the other side for 2 minutes, or until the flesh flakes with slight pressure with a fork.",
        "To serve, divide the greens among 4 plates. Place the mahimahi on top of the greens and the banana on top of the mahimahi. Drizzle 3 to 4 tablespoons of the sauce around each serving. Garnish with the cucumber and macadamia nuts. Serve immediately."
    ],
    "ingredients": [
        "3/4 cup water",
        "1/3 cups sugar",
        "1 tablespoon freshly crushed black peppercorns",
        "2 tablespoons honey",
        "2 teaspoons grated orange zest",
        "2 teaspoons grated lemon zest",
        "3 tablespoons orange juice concentrate",
        "1 tablespoon freshly squeezed lemon juice",
        "3 tablespoons passion fruit syrup",
        "2 teaspoons canola oil",
        "2 apple bananas",
        "teaspoon shichimi",
        "2 tablespoons sweetened coconut flakes",
        "1 tablespoon canola oil",
        "4 (6-ounce) mahimahi fillets",
        "Salt",
        "1 tablespoon canola oil",
        "2 cups mesclun",
        "1 cups julienned cucumber, for garnish",
        "6 tablespoons chopped macadamia nuts, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Fruit",
        "Nut",
        "Sauté",
        "Wheat/Gluten-Free",
        "Dinner",
        "Apple",
        "Banana",
        "Macadamia Nut",
        "Seafood",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mahimahi with Citrus Sauce, Apple Bananas, and Macadamia Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/mahimahi-with-citrus-sauce-apple-bananas-and-macadamia-nuts-232217"
}
