{
    "directions": [
        "Whisk together the olive oil, soy sauce, lemon juice, garlic, red pepper flakes, black pepper, ginger, green onion, and salt in a bowl. Add the mahi mahi and toss to evenly coat. Cover the bowl with plastic wrap, and marinate in the refrigerator for 1 hour.",
        "Preheat the oven's broiler and set the oven rack in the middle of the oven.",
        "Bring the rice, water, chicken bouillon, and 1 tablespoon butter to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the liquid has been absorbed, about 20 minutes. Pour in the coconut milk and 2 tablespoons of sugar. Stir, and simmer uncovered until the rice has absorbed most of the coconut milk.",
        "While the rice is cooking, remove the mahi mahi from the marinade, and shake off excess. Discard the remaining marinade. Place fish in a large baking dish in a single layer. Broil in the preheated oven until the fish flakes easily with a fork, 10 to 15 minutes. If the fish browns too quickly, cover the baking dish with a sheet of aluminum foil.",
        "Melt 1 1/2 teaspoons butter and 1 1/2 tablespoons of sugar in a skillet over medium-high heat. When the mixture begins to bubble, stir in mango cubes. Cook and stir until mango is tender, about 5 minutes. Serve by placing a mahi mahi fillet over a scoop of hot rice and top with the mango salsa."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 1/2 teaspoons soy sauce",
        "2 teaspoons lemon juice",
        "1 clove garlic, crushed",
        "2 teaspoons red pepper flakes",
        "1 teaspoon fresh ground black pepper",
        "1/2 teaspoon minced fresh ginger root",
        "2 tablespoons chopped green onion (optional)",
        "salt to taste",
        "4 (4 ounce) mahi mahi fillets",
        "2 cups uncooked jasmine rice",
        "2 cups water",
        "1 cube chicken bouillon",
        "1 tablespoon butter (optional)",
        "3/4 (14 ounce) can coconut milk",
        "2 tablespoons white sugar",
        "1 1/2 teaspoons butter",
        "1 1/2 tablespoons white sugar",
        "1 1/2 cups fresh mango, cubed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mahi Mahi with Coconut Rice and Mango Salsa",
    "url": "http://allrecipes.com/recipe/214541/mahi-mahi-with-coconut-rice-and-mango/"
}
