{
    "directions": [
        "Arrange the ducks breast sides up several inches apart on a rack set over a large roasting pan and let them dry, uncovered and chilled for 3 days.",
        "In a bowl combine the Scotch, the gingerroot, the garlic, the zest, the coriander seeds, the peppercorns, the soy sauce, the honey, and the brown sugar and let the marinade stand, covered and chilled, for 3 days. Stir the marinade and strain it through a fine sieve into a small bowl, pressing hard on the solids.",
        "Keep the ducks chilled, brush them with some of the marinade every 30 minutes for 2 1/2 hours, reserving the remaining marinade. Let the ducks dry at room temperature for 30 minutes. Stuff each duck cavity with 1 of the bread slices, 1 of the scallions, and 1 of the parsley sprigs, spoon the reserved marinade into the duck cavities, and prick the ducks, except for the breasts, lightly with a fork. Pour the beer into the roasting pan and roast the ducks on the rack in the lower third of a preheated 350°F. oven for 30 minutes. Tent the ducks with a piece of foil and roast them for 30 minutes more. Discard the foil and roast the ducks for 30 minutes more, or until a meat thermometer inserted in the fleshy part of a thigh registers 180°F. (The skin will be mahogany colored and very crisp.) Remove the stuffing ingredients with a spoon and discard them and the pan juices. Pour the juices from the cavities through a fine sieve into a small bowl, skim the fat, and reserve 1/4 cup of the juices. Arrange the ducks on a platter and keep them warm, covered loosely.",
        "In a saucepan bring the stock to a boil, simmer it for 15 minutes, and stir in the reserved juices. Bring the mixture to a simmer, stir the arrowroot mixture, and add it to the pan. Cook the mixture over moderately low heat, stirring, being careful not to let it boil, until it is thickened, add salt and pepper to taste, and transfer the sauce to a heated sauceboat."
    ],
    "ingredients": [
        "two 4 1/2- to 4 3/4-pound ducks, rinsed, patted dry, excess fat removed from the cavities, and trussed",
        "1/4 cup Scotch",
        "3 tablespoons shredded peeled fresh gingerroot",
        "1 1/2 teaspoons minced garlic",
        "2 tablespoons julienne orange zest",
        "1 teaspoon coriander seeds, crushed",
        "1 teaspoon black peppercorns, crushed",
        "3/4 cup soy sauce",
        "2 tablespoon honey",
        "2 tablespoons firmly packed dark brown sugar",
        "2 slices of bread",
        "2 scallions",
        "2 parsley sprigs",
        "three 12-ounce cans beer",
        "1 3/4 cups brown stock or beef broth",
        "2 teaspoons arrowroot dissolved in 3 tablespoons cold water",
        "kumquats for garnish if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Duck",
        "Poultry",
        "Winter",
        "Gourmet"
    ],
    "title": "Mahogany Duck",
    "url": "http://www.epicurious.com/recipes/food/views/mahogany-duck-11055"
}
