{
    "directions": [
        "Heat 2 tablespoons oil in heavy large pot over high heat. Sprinkle meat with salt and pepper. Add meat to pot; sauté until brown on all sides, about 10 minutes. Push meat to sides of pot. Reduce heat to medium; add 2 tablespoons oil to pot. Add onions; sauté until golden brown, about 15 minutes. Mix meat into onions. Add 1 cup wine, tomatoes with juices, hoisin sauce, and bay leaves. Bring to boil.",
        "Reduce heat to low, cover pot and simmer 45 minutes, stirring occasionally. Add carrots and 1 cup wine. Cover; simmer 30 minutes, stirring occasionally. Uncover, increase heat to high; boil until sauce is slightly thickened, stirring occasionally, about 15 minutes longer. Reduce heat to medium, add cornstarch mixture and simmer until sauce thickens, stirring occasionally, about 8 minutes. Discard bay leaves. Season stew with salt and pepper. (Can be made 1 day ahead. Cool slightly. Chill uncovered until cold, then cover and keep refrigerated. Bring to simmer before serving, stirring occasionally.) Transfer stew to large bowl. Sprinkle with parsley; serve.",
        "Available at Asian markets and in the Asian foods section of some supermarkets."
    ],
    "ingredients": [
        "4 tablespoons olive oil",
        "3 1/2 pounds boneless beef chuck roast, trimmed, cut into 2 1/2-inch pieces",
        "3 1/2 cups chopped onions",
        "2 cups Cabernet Sauvignon",
        "1 14.5-ounce can diced tomatoes with Italian herbs, undrained",
        "1/2 cup hoisin sauce*",
        "2 bay leaves",
        "1 pound slender carrots, peeled, cut diagonally into 1-inch lengths",
        "1 tablespoon cornstarch mixed with 1 tablespoon water",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Wine",
        "Beef",
        "Sauté",
        "Stew",
        "Dinner",
        "Meat",
        "Red Wine",
        "Winter",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Mahogany Beef Stew with Red Wine and Hoisin Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/mahogany-beef-stew-with-red-wine-and-hoisin-sauce-106212"
}
