{
    "directions": [
        "Heat vegetable oil in a skillet over medium heat; cook and stir onion, carrot, and 2 cloves minced garlic in the hot oil until onion is softened, about 10 minutes. Pour pineapple juice into onion mixture; bring to a boil. Add ribs, 2 tablespoons hot sauce, and bay leaf. Pour in enough chicken broth to cover ribs. Bring to a boil, reduce heat, and simmer until ribs are tender, 45 to 60 minutes.",
        "Remove skillet from heat and cool ribs in the cooking liquid until no longer steaming; discard cooking liquid.",
        "Combine plum sauce, tomato paste, soy sauce, 1 tablespoon hot sauce, red wine vinegar, lime juice, ginger, and 3 cloves minced garlic in a saucepan; bring to a boil. Reduce heat and simmer until flavors combine and glaze is thickened, about 5 minutes.",
        "Place ribs in a bowl; generously brush ribs with glaze. Cover bowl with plastic wrap and marinate ribs in the refrigerator for 2 hours to overnight. Reserve extra glaze in the refrigerator for basting.",
        "Remove ribs from refrigerator and bring to room temperature for 30 minutes.",
        "Preheat grill for medium heat and lightly oil the grate.",
        "Grill ribs, basting occasionally with glaze, on the preheated grill until the meat pulls away easily from the bone, 15 to 20 minutes."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "1 onion, chopped",
        "1 carrot, chopped",
        "2 cloves garlic, minced",
        "4 cups pineapple juice",
        "3 pounds baby back ribs",
        "2 tablespoons hot pepper sauce (such as Tabasco®), or to taste",
        "1 bay leaf",
        "3 cups chicken broth, or as needed",
        "Glaze:",
        "3/4 cup plum sauce",
        "1/3 cup tomato paste",
        "1/3 cup soy sauce",
        "1 tablespoon hot pepper sauce (such as Tabasco®), or to taste",
        "1 tablespoon red wine vinegar",
        "1 tablespoon lime juice",
        "2 teaspoons minced fresh ginger",
        "3 cloves garlic, minced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mahogany Grilled Baby Back Ribs",
    "url": "http://allrecipes.com/recipe/232426/mahogany-grilled-baby-back-ribs/"
}
