{
    "directions": [
        "Bring 8 quarts water and vinegar to boil in 10- to 12-quart pot. Add 2 lobsters headfirst and cook until shells turn bright red and lobsters are just cooked through, about 11 minutes. Using tongs, remove lobsters from water. Repeat with remaining 2 lobsters. Twist claws and tails off lobsters. Crack claws and remove meat. Using kitchen shears or heavy large knife, cut lobster tails lengthwise in half; remove tail meat. Cut meat into large bite-size pieces. Place in medium bowl; cover and refrigerate. Reserve claw and tail shells.",
        "Using kitchen shears, cut away lobster gills. Rinse shells under cold water. Place in large bowl. Pour cold water over and soak 10 minutes. Drain; rinse well.",
        "Heat 1/4 cup oil in large pot over medium heat. Add lobster shells, carrots, and next 4 ingredients. Cook until vegetables begin to soften, stirring occasionally, about 15 minutes. Add 4 quarts water and simmer 45 minutes, stirring occasionally. Strain lobster broth into large bowl, pressing on solids. Strain broth again through fine strainer into same pot. Boil over medium-high heat until broth is reduced to 2 cups, about 1 hour. (Can be made 1 day ahead. Cool slightly; chill broth and lobster meat separately.)",
        "Bring 1 quart water to boil in tea kettle. Place 2 cups rosemary in each of 4 large bowls; place on table.",
        "Melt 2 tablespoons butter with 1/4 cup oil in large skillet over medium-high heat. Add mushrooms, thyme, and garlic and sauté until mushrooms are tender, about 6 minutes; discard thyme and garlic. Add lobster and 1/2 cup butter to skillet and heat through, about 3 minutes.",
        "Meanwhile, bring lobster broth to simmer in small saucepan. Pour hot lobster broth into blender; add 1 cup butter. Blend until butter is melted and mixture is frothy, about 30 seconds. Divide lobster mixture among 4 shallow bowls. Pour butter sauce and foam over lobster mixture and serve. Pour 1 cup boiling water into each bowl of rosemary to create vapor."
    ],
    "ingredients": [
        "1 cup distilled white vinegar",
        "4 1 1/2-pound live Maine lobsters",
        "1/2 cup canola oil",
        "3 carrots, peeled, thinly sliced",
        "1 onion, thinly sliced",
        "1 fresh fennel bulb, thinly sliced",
        "2 tomatoes, thinly sliced",
        "4 fresh tarragon sprigs",
        "8 cups fresh rosemary leaves stripped from branches (about ten .66-ounce packages)",
        "2 tablespoons plus 1 1/2 cups (3 1/4 sticks) butter, room temperature",
        "2 pounds assorted fresh wild mushrooms (such as oyster, crimini, chanterelle, and stemmed shiitake), cut into 1-inch pieces",
        "4 large fresh thyme sprigs",
        "3 garlic cloves, halved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Tomato",
        "Rosemary",
        "Lobster",
        "Fennel",
        "Carrot",
        "Fall",
        "Tarragon",
        "Thyme"
    ],
    "title": "Maine Lobster with Wild Mushrooms and Rosemary Vapor",
    "url": "http://www.epicurious.com/recipes/food/views/maine-lobster-with-wild-mushrooms-and-rosemary-vapor-108559"
}
