{
    "directions": [
        "Scout out the location well in advance. A rocky beach is superior for cooking, but a sandy beach is better for swimming. Decide which will be more pleasurable for your guests. If you decide on a sandy beach, you will need quite a few large, flat rocks, so choose a spot where you will not have to spend hours dragging them in. If your beach does not have a lot of driftwood, you will need to bring about twenty fireplace-size logs. You will also need newspaper and kindling. Organize your wood supply and set up the pit the day before the bake. Bring along a tarp so that you can cover the wood and keep it dry overnight. Make sure there is plenty of rockweed growing nearby; otherwise, arrange for about seventy-five pounds of it. Most lobster dealers have plenty on hand, but it is wise to order ahead of time. The small oval sacs on the rockweed release the seawater that is essential for creating steam inside the pit. Take note of the foods growing near your location. If there are lots of mussels and periwinkles, count them as part of your ingredients, but be sure to check with the Coast Guard for \"red tide alert.\" You will have lots of time to pick them while you wait for your fire to be ready, provided you have a low tide at that time. If you intend to rake for clams, remember that you need a permit in most places.",
        "Build your pit well above the high-tide line. I have heard disaster stories of waves crashing over the pit and ruining the bake. To cook enough food for twelve to sixteen people, the pit should be about 5 x 3 1/2 feet wide and 3 feet deep.",
        "I learned how to build a pit on a rocky beach from my friend John Stevens — a lobsterman and great \"bake master\" from Boothbay Harbor, Maine — when, about eight years ago, we filmed a lobster bake for a PBS series called \"Crazy for Food.\" You will not always be able to create a pit that is 3 feet deep on a rocky beach, but this is okay because the top of the pit does not have to be flush with the ground. Find an area where the stones are less that 1 foot in average size and remove them from the center as you build up the sides. You may even find an area where nature has started the pit. If you clear 2 feet down and build 1 foot up, you will still have a pit that is 3 feet deep. Be sure your tarp is big enough to fold over the sides of the pit and lay flush with the ground. One advantage of a pit built on a rocky beach is that it can reach a very high temperature and cook food more quickly than a pit built on a sandy beach. Another advantage is that you will not get sand in your food.",
        "You will dig the pit 5 1/2 x 4 feet wide and 3 1/2 feet deep. Line the bottom with large stones and the sides with smaller ones. After you add the rocks, the pit will be the same size as that built on a rocky beach. Taper the sides of the pit toward the bottom so that the walls do not collapse. The more stones you use to line the pit, the better it will retain the heat.",
        "Have the pit and firewood ready to go. About 3 1/2 hours before you start the lobster bake, stack the kindling in a tepeelike structure with crumpled newspaper underneath. Light the fire; once the kindling is burning well, begin to stoke the fire by adding more kindling, then small logs or driftwood. After they have caught fire, start adding the bigger logs or driftwood; once they catch, use your shovel to spread them around the pit. Continue stoking the fire with more logs until the entire pit is filled with blazing wood. After about 2 hours, when the fire has reached its hottest stage, quit stoking the fire (do not add any more wood) and allow the wood to burn away completely. This should take about 1 1/2 hours. Wet your broom in the ocean and brush away all the coals and ashes; they will settle between the hot rocks.",
        "1. Prepare the pit according to the directions above. While the fire is cooking down, start preparing the food. Scrub the potatoes and sweet potatoes in the nearby ocean. Peel the onions, wrap in 4 cheesecloth sacks (so you can have the aroma of onions scattered throughout the pit) and tie the sacks off with twine. Scrub the sea clams and return them to your cooler. Wrap the steamers, mussels and periwinkles in cheesecloth sacks, putting about 2 pounds in each bundle. Tie the bundles together and place temporarily in the ocean — just be sure they are well anchored. Otherwise, return the bundles to the cooler to keep chilled. Divide the sausage into portions. To prepare the corn, carefully pull back the husks without detaching them. Pick away the silk and fold the husks back over the corn. Wet the corn in the ocean a few minutes before you begin the bake.",
        "2. Start the bake as soon as the coals have cooked down and been brushed away. At this point, a single person (the bake master) should take charge of the actual bake. That person should have an assistant. Caution should be exercised around the pit: Master and assistant should take their responsibilities seriously, and children should be kept at least 10 feet away. Gather all the food and bring it close to the pit. Make sure the rockweed is moist. If it is not, give it one last dip in the ocean and bring it close to the pit. Bring the tarp to the ocean and soak it thoroughly. Work carefully but as quickly as possible.",
        "3. Start with an 8-inch layer of rockweed. Place the whole fish in the center and lay the potatoes, sweet potatoes, onions and sea clams around the fish. Cover the food completely with a 4-to 6-inch layer of rockweed and then distribute the bundles of steamers, mussels and periwinkles, with the sausages on top. Add the third layer of rockweed (4 to 6 inches) over the food. Place the lobsters in the center, back to back (actually tail to tail), forming 2 rows. Lobsters can only move backward on land, so by laying them this way, they will stay put. Place the corn around the lobsters and scatter the eggs about. Place one egg very close to the corner of the pit and remember exactly where it is. Scatter a last thin layer of rockweed over the corn and eggs but do not cover the lobsters. By now the steam will be rising from the pit fairly vigorously. Cover the pit with the damp tarp and place heavy rocks all around to form a tight seal. Place the butter in a pot and set it on a corner of the tarp to melt.",
        "4. If your pit is on a rocky beach the food could be ready in as little as 50 minutes, but an hour is the norm. If your pit was made in the sand, the food could take up to 90 minutes. Make sure everyone knows the approximate time of unveiling. Have all plates and utensils ready. Bring the platters near the pit; you can even warm them on the tarp. The bake master and assistant should have their gloves on for the next step.",
        "5. Remember the special egg? Lift up the corner of the tarp and pull out the egg. Crack it open. If it is cooked through (hard-boiled), the bake is ready to eat. Gather everyone about 10 feet from the pit. Remove the melted butter and all the rocks that are holding the tarp in place. The bake master should grab one corner and the assistant the other, on the side closest to the gathering of family and friends. Quickly pull back the tarp. There will be a giant burst of steam. When it subsides, the bright red lobsters will come into view. Both the bake master and the assistant will use tongs to remove the food and place it on platters. As the rockweed is removed, it should be spread around the outside of the pit to show that it is still hot. The hot pit cannot be left unattended — a child or dog could be injured. Get a few people to bring buckets of water up from the beach to pour over the rocks to cool them. The others should unwrap the cheesecloth bundles, cut the potatoes in half and set out the food. Put the butter in small bowls for dipping lobsters, steamers, mussels and anything else you want. Allow plenty of time to eat before you bring out the desserts.",
        "6. After the festivities have ended, everyone should help clean up. Cover the pit back up with rocks or sand; be sure there are no hot rocks left on the beach. The rockweed can be left on the beach to decompose, but all other litter must be put in garbage bags and taken away. The beach must be left as it was found."
    ],
    "ingredients": [
        "75 pounds rockweed",
        "1 whole 6-pound fish (striped bass, salmon, or bluefish, etc.), gutted and scaled",
        "12 large red Bliss or medium Maine potatoes",
        "6 medium sweet potatoes",
        "2 pounds large white boiling onions or small Spanish onions",
        "4 jumbo sea clams (optional; used for flavoring, not eating)",
        "6 to 8 pounds soft-shell clams (steamers)",
        "6 to 8 pounds mussels",
        "4 pounds periwinkles",
        "3 pounds linguica, chorizo or other sausage",
        "12 live 1-pound chicken lobsters",
        "16 ears sweet corn",
        "12 extra-large eggs",
        "2 pounds unsalted butter",
        "You will need a shovel, a broom, a large canvas tarp that is at least 8 x 6 feet, a couple of big buckets, a few pairs of tongs, two pairs of gloves to protect hands from the steam, a pot to melt butter, a ladle, cheesecloth for wrapping the small food items (such as steamers and periwinkles), twine for tying the cheesecloth bundles and platters for the cooked food. A picnic table is terrific for serving the platters of food but is not absolutely necessary. You will also need plates, cups, bowls for melted butter, eating utensils, lobster crackers, plenty of napkins and several large garbage bags."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fish",
        "Potato",
        "Steam",
        "Sausage",
        "Clam",
        "Lobster",
        "Mussel",
        "Corn",
        "Summer"
    ],
    "title": "Maine Lobster Bake",
    "url": "http://www.epicurious.com/recipes/food/views/maine-lobster-bake-232598"
}
