{
    "directions": [
        "Heat vegetable oil in a large stockpot over medium-high heat. Brown turkey necks in hot oil, about 6 minutes per side. Add the onion, celery, and carrots; cook until the vegetables begin to soften and brown, 5 to 10 minutes.  Pour in the Marsala wine, and scrape and dissolve any browned meat and vegetable bits off the bottom of the pan. Raise heat to high; cook until liquid is reduced by half.",
        "Stir in 2 quarts of cold water, bay leaf, garlic cloves, and 1/4 ounce dried porcini mushrooms. Bring to a simmer, and turn heat to low.  As stock simmers, skim and discard any foam that comes to the top. Cover partially, and simmer on very low heat for 4-5 hours.  Strain out solids, and set broth aside to cool.",
        "In a bowl, cover 1/4 ounce dried porcini with 1 cup hot water; allow to rehydrate for 10 minutes. Remove mushrooms from water, and chop fine. Heat 1/4 cup butter in a large saucepan over medium heat, and brown mushrooms, about 10 minutes. Stir flour into mushrooms and butter, and cook over medium heat, stirring constantly, for 3 minutes. Whisk in broth, about 1/2 cup at a time, and raise heat to medium high; bring gravy to a boil.",
        "Reduce heat to a simmer, and cook gravy until reduced and thickened, about 30 minutes. Stir often. Just before serving, stir in cream, and season with salt and black pepper."
    ],
    "ingredients": [
        "For the turkey neck stock:",
        "2 teaspoons vegetable oil",
        "4 turkey necks",
        "1 onion, chopped",
        "1 stalk celery, chopped",
        "1 carrot, chopped",
        "1/3 cup Marsala wine",
        "2 quarts cold water",
        "1 bay leaf",
        "2 garlic cloves",
        "1/4 ounce dried porcini mushrooms",
        "For the sauce:",
        "1/4 ounce dried porcini mushrooms",
        "1 cup hot water",
        "1/4 cup butter",
        "3 tablespoons all-purpose flour",
        "2 tablespoons heavy cream",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Make-Ahead Turkey Gravy with Porcini Mushrooms and Marsala Wine",
    "url": "http://allrecipes.com/recipe/219597/make-ahead-turkey-gravy-with-porcini/"
}
