{
    "directions": [
        "Bring 1 1/2 cups of seasoned rice vinegar to a boil in a saucepan, and mix in the 2 pieces of crushed ginger root, shallots, red pepper flakes, 1/4 cup of light brown sugar, and 1 teaspoon of salt. Stir until the brown sugar and salt have dissolved, and remove from heat. Place watermelon rind into a large heatproof nonreactive bowl, and strain the pickling liquid through a fine mesh strainer into the watermelon rind. Stir to combine, and refrigerate at least 1 hour.",
        "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Chop the bacon into pieces when cooled.",
        "For dressing, place 1/2 cup of peeled and chopped ginger, garlic, lime juice, 1 cup of seasoned rice vinegar, 2 tablespoons of light brown sugar, 1/2 teaspoon of salt, and cilantro stems in a blender. Blend on high speed, scraping down blender sides occasionally, until the ginger and cilantro stems are pulverized and the dressing is thoroughly blended.",
        "To assemble, place about 1 cup of watermelon cubes onto a salad plate, and drizzle with about 2 tablespoons of the dressing. Top with about 2 tablespoons of the pickled rind, 1 to 2 tablespoons of bacon bits, 1 tablespoon of cilantro leaves, and about 1/2 tablespoon of chopped green onion, or to taste."
    ],
    "ingredients": [
        "1 1/2 cups seasoned rice vinegar",
        "2 (3 inch) pieces fresh ginger root, peeled and lightly crushed",
        "2 shallots, chopped",
        "2 teaspoons crushed red pepper flakes, or to taste",
        "1/4 cup light brown sugar",
        "1 teaspoon salt",
        "4 cups watermelon rind, white part only, cut into 1/2-inch cubes",
        "1 (1 pound) package thick cut bacon",
        "1/2 cup peeled and chopped fresh ginger root",
        "2 cloves garlic, peeled",
        "4 limes, juiced",
        "1 cup seasoned rice vinegar",
        "2 tablespoons light brown sugar",
        "1/2 teaspoon salt",
        "1 bunch cilantro, stems and leaves separated",
        "12 cups chilled seedless watermelon, peeled and cut into 1-inch cubes",
        "1 bunch green onions, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Malaysian Watermelon Salad",
    "url": "http://allrecipes.com/recipe/218131/malaysian-watermelon-salad/"
}
