{
    "directions": [
        "Place red pepper and Malbec wine in a blender, while wearing gloves; blend until smooth. Transfer to a large stockpot. Blend habanero pepper, pomegranate juice, and lemon juice in blender until smooth; add to stockpot. Stir all the pectin and butter into pepper mixture. Bring to a rolling boil; stir in sugar. Continually stir until sugar is dissolved, 2 minutes. Remove from heat, stir for 5 minutes, and skim foam off the top.",
        "Sterilize jars and lids in boiling water for at least 5 minutes. Pack the jam into the hot, sterilized jars, filling the jars to within 1/4-inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring water level to at least 1 inch above the tops of the jars. Bring water to a rolling boil, cover the pot, and process for 15 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "2 cups minced hot red pepper",
        "1 cup Malbec red wine",
        "2 cups minced habanero pepper",
        "1/2 cup pomegranate juice",
        "1 tablespoon lemon juice",
        "1 (1.75 ounce) package powdered fruit pectin",
        "2 tablespoons powdered fruit pectin",
        "1 teaspoon butter",
        "4 cups white sugar, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Malbec Inferno Hot Pepper Jelly",
    "url": "http://allrecipes.com/recipe/223552/malbec-inferno-hot-pepper-jelly/"
}
