{
    "directions": [
        "Place chicken in a large pot with 6 cups water, onion, 2 tablespoons allspice, ground cardamom, cardamom seeds, whole cloves and bay leaves. Bring to a boil, and cook until chicken is tender, about 40 minutes. Remove chicken, strain and reserve broth.",
        "Soak the rice in water while waiting for the chicken to cook. When the chicken is almost done, drain the water off, and stir in 1 1/2 tablespoons of allspice.",
        "Heat the oil in a skillet over medium-high heat. Fry the potatoes and cauliflower in the hot oil until browned. They do not need to fully cook.",
        "In a separate pot, layer fried potatoes on the bottom. This is done so that the rice will not stick to the bottom of the pan. Add the cauliflower and tomatoes, and sprinkle a handful of rice over the vegetables. Remove the bones from the chicken and place the chicken in the pot. Cover with the rest of the rice. Pour in the reserved broth until it reaches a level about 1/2 inch above the level of the rice. Cover the pot, and cook over medium-low heat for 1 hour, until rice is tender.",
        "When the liquid has absorbed, have a large round tray ready. Uncover the pot, and place the tray over the top. Invert so that the pan is upside down on top of the tray. Let stand for 5 minutes like this, then slowly remove the pot to let the food fall onto the tray."
    ],
    "ingredients": [
        "1 (4 pound) whole chicken, cut into pieces",
        "6 cups water",
        "1 medium onion, quartered",
        "2 tablespoons ground allspice",
        "1/2 teaspoon ground cardamom",
        "3 whole cardamom seeds",
        "4 whole cloves",
        "3 bay leaves",
        "2 1/2 cups uncooked basmati rice, rinsed and drained",
        "2 tablespoons ground allspice",
        "3 tablespoons vegetable oil",
        "1 large potato, sliced into rounds",
        "1 large head cauliflower, separated into florets",
        "2 medium tomatoes, diced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Malooba",
    "url": "http://allrecipes.com/recipe/56201/malooba/"
}
