{
    "directions": [
        "1. In a medium heatproof bowl, whisk the yolks just to break them up, then whisk in the malted milk powder. Set aside.",
        "2. In a heavy nonreactive saucepan, stir together the cream, milk, sugar, and salt and put the pan over medium-high heat. When the mixture approaches a bare simmer, reduce the heat to medium.",
        "3. Carefully scoop out about 1/2 cup of the hot cream mixture and, whisking the eggs constantly, add the cream to the bowl with the egg yolks. Repeat, adding another 1/2 cup of the hot cream to the bowl with the yolks. Using a heatproof rubber spatula, stir the cream in the saucepan as you slowly pour the egg-and-cream mixture from the bowl into the pan.",
        "4. Cook the mixture carefully over medium heat, stirring constantly, until it is thickened, coats the back of a spatula, and holds a clear path when you run your finger across the spatula, 1 to 2 minutes longer.",
        "5. Strain the base through a fine-mesh strainer into a clean container. Set the container into an ice-water bath, wash your spatula, and use it to stir the base occasionally until it is cool. Remove the container from the ice-water bath, cover with plastic wrap, and refrigerate the base for at least 2 hours or overnight.",
        "6. Add the vanilla to the chilled base and stir until blended.",
        "7. Freeze in your ice cream machine according to the manufacturer's instructions and put the container you'll use to store the ice cream into the freezer. Add the milk chocolate and the peanut brittle in the last minute or so of churning, or fold them in by hand after the ice cream comes out of the machine. Enjoy right away or, for a firmer ice cream, transfer to a container and freeze for at least 4 hours."
    ],
    "ingredients": [
        "5 large egg yolks",
        "1/2 cup malted milk powder (such as Carnation)",
        "1 3/4 cup heavy cream",
        "3/4 cup 1% or 2% milk",
        "1/2 cup sugar",
        "1/4 teaspoon kosher salt",
        "2 ounces milk chocolate, finely chopped or\ngrated (1/3 cup)",
        "1 teaspoon vanilla extract",
        "1/2 cup chopped Peanut Brittle , in 1/8-inch pieces",
        "Ice cream machine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Chocolate",
        "Dairy",
        "Dessert",
        "Freeze/Chill",
        "Kid-Friendly",
        "Frozen Dessert",
        "Peanut",
        "Vanilla",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Malted Vanilla Ice Cream with Peanut Brittle and Milk Chocolate Pieces",
    "url": "http://www.epicurious.com/recipes/food/views/malted-vanilla-ice-cream-with-peanut-brittle-and-milk-chocolate-pieces-51100020"
}
