{
    "directions": [
        "Preheat oven to 375°F. Spray 9-inch-diameter springform pan with nonstick spray. Sift flour, baking powder, and salt 3 times into medium bowl. Using electric mixer, beat sugar and butter in another medium bowl until blended. Add egg and vanilla; beat until thick, about 3 minutes. Beat in dry ingredients in 3 additions alternately with milk. Spread batter in pan (layer will be thin).",
        "Bake cake until tester inserted into center comes out clean, about 15 minutes. Cool cake in pan on rack. Remove pan sides. Cut enough off top of cake to make 1/2-inch-thick layer. Reattach pan sides, leaving cake layer in pan.",
        "Whisk first 5 ingredients in large bowl to blend. Stir cream, milk, and 1 cup plus 2 tablespoons sugar in heavy large saucepan over medium heat until mixture comes to simmer. Gradually whisk hot cream mixture into yolk mixture. Return to pan and cook over medium heat until custard thickens enough to coat spoon, stirring constantly, about 3 minutes (do not boil).",
        "Strain custard into large bowl; set over pot of ice and water. Cool 1 hour, stirring often, then chill 1 hour. Process custard in ice cream maker according to manufacturer's instructions. Spread ice cream over cake in pan. Cover and freeze until firm, at least 4 hours and up to 2 days.",
        "Stir 1/2 cup water and sugar in heavy large saucepan. Add half of berries and bring to boil. Reduce heat and simmer until syrup thickens, mashing berries with back of fork, about 12 minutes. Pour into medium bowl; gently stir in remaining berries. Cover and chill until cold, at least 3 hours and up to 1 day.",
        "Using hot knife, cut around pan sides to loosen ice cream cake. Remove pan sides. Transfer cake to platter. Spoon half of berry topping onto center of cake. Cut cake into wedges and serve, passing remaining topping separately."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 cup cake flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/2 cup sugar",
        "1/4 cup (1/2 stick) unsalted butter, room temperature",
        "1 large egg",
        "1 teaspoon vanilla extract",
        "1/3 cup whole milk",
        "11 large egg yolks",
        "3/4 cup (packed) golden brown sugar",
        "3/4 cup malted milk powder",
        "6 tablespoons bourbon",
        "1 1/2 tablespoons vanilla extract",
        "2 1/4 cups whipping cream",
        "2 1/4 cups whole milk",
        "1 cup plus 2 tablespoons sugar",
        "1/2 cup water",
        "6 tablespoons sugar",
        "4 1/2-pint containers blackberries, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Blackberry",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Malted Milk Ice Cream Cake with Blackberry Topping",
    "url": "http://www.epicurious.com/recipes/food/views/malted-milk-ice-cream-cake-with-blackberry-topping-109721"
}
