{
    "directions": [
        "Place a rack in middle of oven and preheat to 325°F. Pulse graham crackers in a food processor until very fine crumbs form (you should have about 2 cups). Add raw sugar, flour, and salt and pulse to combine. Add butter and pulse until mixture is the consistency of wet sand.",
        "Transfer mixture to a 9\" pie dish. Using a measuring cup, press firmly onto bottom and up sides of dish. Place pie dish on a rimmed baking sheet and bake crust, rotating halfway through, until dry and set, 20–25 minutes. Transfer pie dish to a wire rack and let crust cool.",
        "DO AHEAD: Crust can be baked 1 day ahead. Store wrapped tightly at room temperature.",
        "Toast walnuts on a rimmed baking sheet (oven should still be at 325°F), tossing occasionally, until slightly darker and fragrant, 8–10 minutes; let cool.",
        "Pour white chocolate over cooled crust and, using a small offset spatula or the back of a spoon, spread over bottom and up sides, leaving 1/4\" border along edge. Let stand until chocolate is set, 20–25 minutes.",
        "Whisk eggs, corn syrup, brown sugar, barley malt syrup, malt powder, vinegar, salt, and vanilla in a medium bowl.",
        "Melt butter in a small saucepan over medium heat. Cook, stirring often, until butter foams, then browns (do not let burn), about 5 minutes. Let cool slightly. Whisk brown butter into egg mixture, then fold in walnuts.",
        "Place pie dish on a rimmed baking sheet and pour in filling. Bake, rotating halfway through, until set (center should not jiggle), 60–70 minutes. Transfer pie dish to a wire rack and let pie cool. Cover and chill at least 2 hours before slicing.",
        "Serve pie topped with whipped cream, if desired.",
        "DO AHEAD: Pie can be baked (without whipped cream) 2 days ahead. Keep chilled."
    ],
    "ingredients": [
        "14 graham crackers (about 8 ounces)",
        "2 tablespoons raw sugar or granulated sugar",
        "1 tablespoon all-purpose flour",
        "1/2 teaspoon kosher salt",
        "8 tablespoons (1 stick) unsalted butter, melted, slightly cooled",
        "2 cups walnuts",
        "4 ounces white chocolate, melted",
        "3 large eggs",
        "3/4 cup light corn syrup",
        "2/3 cup (packed) light brown sugar",
        "1/4 cup plus 2 tablespoons barley malt syrup",
        "1/4 cup malted milk powder",
        "1 tablespoon malt vinegar",
        "3/4 teaspoon kosher salt",
        "1/2 teaspoon vanilla extract",
        "1/4 cup (1/2 stick) unsalted butter",
        "Unsweetened whipped cream (for serving; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Tree Nut",
        "Walnut",
        "Christmas Eve",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Malted Walnut Pie",
    "url": "http://www.epicurious.com/recipes/food/views/malted-walnut-pie-51199000"
}
