{
    "directions": [
        "Bring malt syrup, vinegar, herbs, and pepper to boil in small saucepan, stirring occasionally. Reduce heat to low and simmer until glaze coats spoon, 4 to 5 minutes. Mix in butter. DO AHEAD: Can be made 1 day ahead. Cover; chill. Rewarm before using.",
        "Pour 4 quarts water into 16-quart nonreactive bowl or pot. Add salt; stir to dissolve. Mix in beer and malt syrup. Insert 1 oven bag into second bag; place in large bowl. Rinse turkey inside and out. Slide turkey, breast side down, into doubled bag. Pour brine into bag. Press out any air; seal bags. Chill turkey in brine (still in bowl) 16 to 18 hours.",
        "Remove turkey from brine. Pat very dry, inside and out, with paper towels. Sprinkle main cavity with 2 teaspoons pepper; fill with onions, celery, sage, thyme, and garlic. Close cavity with turkey lacing pins. Tuck wing tips under; brush all over with oil.",
        "Set oven rack at lowest position; preheat to 350°F. Place turkey on rack in roasting pan; add 2 cups water.",
        "Roast turkey 2 hours. Brush with glaze; add water if pan is dry. Roast 30 minutes. Brush with glaze. Tent with foil if browning too quickly. Roast until thermometer inserted into thickest part of thigh registers 165°F, 30 to 45 minutes. Brush with more glaze. Transfer to platter; let rest 30 minutes (temperature will rise 5 to 10 degrees).",
        "Prepare barbecue (medium heat). Remove top grill rack. If using charcoal, light briquettes in chimney. When briquettes are covered with white ash, push to opposite sides of bottom grill rack, leaving center empty. Place disposable aluminum pan in center of rack (you will need to light additional briquettes, checking every 30 minutes during grilling time). Replace top grill rack. If using 3-burner gas grill, light burners on left and right sides, leaving center burner off. If using 2-burner gas grill, light burner on 1 side; place disposable pan over unlit side.",
        "Place turkey, breast side up, on grill rack over disposable pan. Cover barbecue. Insert instant-read thermometer into hole in hood. Maintain temperature as close as possible to 350°F on charcoal grill by opening vents to increase temperature and closing vents to reduce temperature or adjusting temperature on gas grill with controls. Cook turkey 2 hours, tenting loosely with foil if browning too quickly. Brush turkey with glaze. Cover grill; cook 30 minutes longer. Brush again with glaze. Cook until thermometer inserted into thickest part of thigh registers 165°F, about 30 minutes longer. Transfer turkey to platter. Brush with glaze. Let rest 30 minutes (temperature will rise 5 to 10 degrees)."
    ],
    "ingredients": [
        "2/3 cup barley malt syrup",
        "1/4 cup malt vinegar or apple cider vinegar",
        "6 fresh sage sprigs",
        "4 fresh thyme sprigs",
        "1/2 teaspoon ground black pepper",
        "2 tablespoons (1/4 stick) unsalted butter",
        "4 quarts water",
        "2 cups Diamond Crystal coarse kosher salt or 1 1/2 cups Morton coarse kosher salt",
        "3 12-ounce bottles stout beer (such as Guinness)",
        "1 1/2 cups barley malt syrup",
        "1 14- to 16-pound turkey",
        "2 teaspoons ground black pepper",
        "2 peeled onions, quartered",
        "2 celery stalks, cut into chunks",
        "1 bunch fresh sage",
        "1 bunch fresh thyme",
        "1 unpeeled head of garlic, cut crosswise in half",
        "3 tablespoons extra-virgin olive oil",
        "2 cups (or more) water",
        "Mixed-Mushroom and Tarragon Gravy",
        "Special equipment: 2 turkey-size oven bags",
        "Turkey lacing pins",
        "Charcoal chimney (if grilling)",
        "13 x 9 x 2-inch disposable aluminum baking pan (to catch drips; if grilling)",
        "Ingredient info: Barley malt syrup has a flavor similar to molasses. Look for it at natural foods stores or buy it from edenfoods.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Fall",
        "Grill",
        "Grill/Barbecue",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Malt-Beer-Brined Turkey with Malt Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/malt-beer-brined-turkey-with-malt-glaze-361750"
}
