{
    "directions": [
        "Heat oven to 350 degrees F.",
        "Cut the eggplant in half and scoop out the center, leaving enough meat inside the skin so that it holds its shape when baked. Chop eggplant that has been scooped out of the inside; place in saucepan, cover with water and boil until very soft, 10 to 12 minutes.",
        "Meanwhile, in a medium saute pan, heat 1 tablespoon of the olive oil over medium heat. Salt and pepper the beef. Add the seasoned ground beef to the pan, and saute until all of its liquid is evaporated and the beef begins to brown slightly. Let cool briefly, and chop the cooked beef so that there are no large chunks of meat. In another medium saute pan over medium heat, add the remaining 2 tablespoons olive oil, and saute the onion, pepper and garlic together in the oil.",
        "In a bowl, mix together the cooked eggplant, vegetables, beef, herbs, 1 cup of the cheese, 1/4 cup of the bread crumbs and the egg. Fill the scooped-out eggplant halves with this mixture, dividing it evenly between the two halves.",
        "Top with chopped tomatoes, the remaining 1/4 cup cheese, remaining 1/4 cup bread crumbs, and season with salt and pepper. Place on an oiled oven tray or baking dish, and bake for 50 minutes. Let cool briefly; slice widthwise and serve."
    ],
    "ingredients": [
        "1 large eggplant",
        "3 tablespoons extra-virgin olive oil",
        "1/2 teaspoon grey sea salt",
        "1/4 teaspoon black pepper",
        "1/2 pound ground beef",
        "1 onion, diced small",
        "1 red bell pepper, diced small",
        "3 cloves garlic, finely chopped",
        "1/2 cup chopped fresh parsley",
        "1/2 cup chopped fresh basil leaves",
        "1 1/4 cups grated Pecorino Romano cheese",
        "1/2 cup Progresso® plain Panko crispy bread crumbs",
        "1 whole egg",
        "2 small tomatoes, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mama Chiarello's Stuffed Eggplant",
    "url": "http://allrecipes.com/recipe/215600/mama-chiarellos-stuffed-eggplant/"
}
