{
    "directions": [
        "Preheat the oven to 350°F.",
        "Place a large skillet over medium-high heat and coat with the 3 tablespoons of oil. When the oil is hazy, add the leeks and garlic; cook and stir until fragrant and very soft, about 4 minutes. Add the spinach in handfuls, folding the leaves under with a spoon as you add each batch. Let the spinach wilt and cook down before adding more. Once all the spinach is in the pan, season with the pepper.",
        "Remove from the heat and transfer the spinach mixture to a colander over the sink. Using the back of a spoon, gently press out all of the excess liquid. Set aside to cool; the filling needs to cool down a bit to prevent the dough from becoming soggy. Once the mixture is cool, add the feta, dill, mint, and eggs. Fold the ingredients together until well combined.",
        "Brush the bottom and sides of a 9-by-13-inch baking dish with oil. Working with 1 sheet at a time, lay the dough on a lightly floured surface and roll it out slightly to fit the pan. Line the bottom of the dish with the first piece of dough, pressing into the corners. Trim off any excess with a paring knife. Spread the spinach filling evenly over the dough. Cover with the second sheet of dough, trimming around the edges of the dish. Brush the top with oil.",
        "Bake until the top is puffed and golden brown, about 30 to 35 minutes. Let stand for 10 minutes before cutting into squares. Serve warm or at room temperature."
    ],
    "ingredients": [
        "3 tablespoons extra-virgin olive oil, preferably Greek, plus more for brushing",
        "6 leeks, white and light green parts, chopped and well rinsed",
        "4 garlic cloves, minced",
        "2 1/2 pounds fresh baby spinach, rinsed and dried",
        "1/2 teaspoon freshly ground black pepper",
        "2 cups crumbled firm feta cheese, preferably Greek",
        "1/2 cup finely chopped fresh dill",
        "1/2 cup finely chopped fresh mint",
        "3 large eggs, lightly beaten",
        "2 frozen country-style filo sheets or puff pastry sheets (see Note), thawed but kept chilled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Leafy Green",
        "Vegetable",
        "Appetizer",
        "Vegetarian",
        "Kid-Friendly",
        "Dinner",
        "Feta",
        "Leek",
        "Spinach",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mama Voula's Spanakopita",
    "url": "http://www.epicurious.com/recipes/food/views/mama-voulas-spanakopita-354989"
}
