{
    "directions": [
        "Cut a shallow X in bottom of each tomato with a sharp paring knife and blanch tomatoes in a 2- to 3-quart saucepan of boiling water 20 seconds. Transfer tomatoes with a slotted spoon to a cutting board and, when cool enough to handle, peel, beginning from scored end, with knife, then seed and chop.",
        "Heat oil in a 4-quart heavy pot over moderately high heat until hot but not smoking. Add onion and tomatoes, then reduce heat to moderate and cook, stirring occasionally, until onion is softened, 4 to 5 minutes.",
        "Meanwhile, peel potato and cut into 1/4-inch dice.",
        "Add potato to onion mixture along with zucchini and celery and cook, stirring occasionally, 5 minutes. Add water, herbs, sea salt, and pepper and bring to a boil, uncovered. Reduce heat and simmer, uncovered, stirring occasionally, until vegetables are very tender, 30 to 35 minutes. Remove from heat.",
        "Whisk together egg and cheese in a bowl until combined well, then add to soup in a stream, stirring. Divide among 4 bowls and serve with olive oil and cheese."
    ],
    "ingredients": [
        "6 oz plum tomatoes (2 or 3 medium)",
        "2 tablespoons extra-virgin olive oil plus additional for serving",
        "1 small onion, chopped",
        "1 large yellow-fleshed potato such as Yukon Gold (1/2 lb)",
        "2 medium zucchini (3/4 lb total), quartered lengthwise, then cut crosswise into 3/4-inch pieces",
        "1 celery rib, cut into 1/2-inch pieces",
        "3 1/2 cups water",
        "1 1/2 tablespoons chopped fresh basil",
        "1 1/2 tablespoons chopped fresh flat-leaf parsley",
        "1 teaspoon dried oregano, crumbled",
        "1 1/4 teaspoons coarse gray sea salt",
        "1/4 teaspoon coarsely ground black pepper",
        "1 large egg",
        "2 tablespoons finely grated Parmigiano-Reggiano plus additional for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Herb",
        "Onion",
        "Potato",
        "Tomato",
        "Vegetarian",
        "Quick & Easy",
        "Zucchini",
        "Healthy",
        "Simmer",
        "Gourmet"
    ],
    "title": "Mama Teresa's Vegetable Soup",
    "url": "http://www.epicurious.com/recipes/food/views/mama-teresas-vegetable-soup-233968"
}
