{
    "directions": [
        "Preheat oven to 350°F",
        "On parchment-lined sheet pan, place tomatoes, onions, and sweet potato and put in oven. Roast tomatoes until blistered, about 25 minutes, then remove from oven. Roast onions until beginning to caramelize, about 35 minutes, then remove. Cook potato until knife easily slides in, about 45-55 minutes, then remove.",
        "In 10-inch, dry skillet over moderately low heat, toast ancho, guajillo, and mulato chiles, turning once, until slightly darker and beginning to puff, about 2 to 3 minutes. Remove from heat and let cool. Once chiles are cool enough to handle, halve lengthwise, then remove and discard seeds, stems, and ribs. Transfer chiles to medium bowl, cover completely with water, and let stand 20 minutes.",
        "In small, dry skillet over moderate heat, toast unpeeled garlic, turning once, until starting to turn golden brown, about 10 minutes total. When cool enough to handle, remove skins and set aside.",
        "In small, dry skillet over moderate heat, toast sesame seeds, stirring to prevent burning, until starting to turn golden brown, about 5 to 6 minutes. Set aside.",
        "In small, dry skillet over moderate heat, toast almonds, cinnamon, cloves, and peppercorns until light brown, about 2 to 3 minutes. Set aside.",
        "Drain chiles well and place in blender. Add 2 cups chicken stock and purée until smooth, about 2 to 3 minutes. Strain and set aside.",
        "In 10-inch skillet over moderate heat, heat 2 tablespoons oil until hot but not smoking. Add raisins and cook until puffed up, about 2 minutes. With slotted spoon remove raisins, place in small bowl, and set aside. Do not clean skillet.",
        "In same skillet, using oil leftover from cooking raisins, cook plantains, turning once, until golden brown, about 6 minutes total. Place in bowl and set aside.",
        "When tomatoes are cool enough to handle, remove skins, then quarter and remove seeds. Coarsely chop and place in blender. Add onions, toasted garlic, and 2 cups chicken stock, then purée until smooth. Strain and set aside.",
        "Rinse blender, then purée toasted sesame seeds and 1 1/2 cups chicken stock until very smooth, about 2 minutes. Strain and set aside.",
        "Rinse blender, then purée raisins, half of plantains, almonds, cinnamon, cloves, salt, and pepper until very smooth. Strain and set aside.",
        "In 6-quart, heavy pan over moderate heat, heat 2 tablespoons oil. Add chile purée and cook until slightly thickened, about 10 minutes. Add tomato purée, sesame purée, and raisin purée, then cook 30 minutes, stirring constantly. Keep over low heat, adding remaining 1/2 cup stock if mixture gets too thick.",
        "In heavy, 6-quart heavy pot, place chicken stock, carrots, onions, and celery and bring to a simmer. Add chicken and cook, uncovered, at bare simmer, until cooked through, about 14 to 18 minutes. Remove chicken from pot, place in bowl, and let cool. Discard cooking broth.",
        "Add chicken, sweet potato, remaining plantains, apple, pineapple, salt, sugar, orange juice and zest, and prunes to mancha manteles pot and simmer 10 minutes."
    ],
    "ingredients": [
        "1 1/2 pounds tomatoes",
        "1 1/2 medium white onions, peeled and quartered",
        "1 medium sweet potato",
        "5 dried ancho chiles*",
        "3 dried guajillo chiles*",
        "3 dried mulato chiles*",
        "6 cloves garlic, unpeeled",
        "1/2 cup sesame seeds",
        "1/3 cup whole almonds",
        "1/4 stick cinnamon",
        "3 whole cloves",
        "2 whole black peppercorns",
        "6 cups chicken stock or low-sodium chicken broth",
        "4 tablespoons vegetable oil",
        "1/2 cup raisins",
        "2 green plantains, peeled and cut into 1/2-inch pieces",
        "1 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "6 cups chicken stock or low-sodium chicken broth",
        "3 medium carrots chopped into 1/2 inch pieces",
        "1 small onion, coarsely chopped",
        "2 ribs celery, cut into 1/2 inch slices",
        "1 (3 1/2-pound) roasting chicken, cut into 8 pieces, discarding wings and cutting breast into 4 pieces",
        "3 slices pineapple (1/4 regular pinapple or 1 small pineapple)",
        "1 1/2 apples, such as gala, cubed",
        "1 teaspoon kosher salt",
        "2 teaspoon sugar",
        "1/2 cup freshly squeezed orange juice (2 medium oranges)",
        "1/2 teaspoon finely grated orange zest (less than 1/2 medium orange)",
        "1/2 cup prunes, pitted and chopped",
        "*Ancho, guajillo, and mulato seco chiles are available at most supermarkets or online at kalustyans.com"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Food Processor",
        "Chicken",
        "Citrus",
        "Fruit",
        "Garlic",
        "Nut",
        "Pepper",
        "Potato",
        "Tomato",
        "Poach",
        "Roast",
        "Plantain"
    ],
    "title": "Mancha Manteles",
    "url": "http://www.epicurious.com/recipes/food/views/mancha-manteles-236063"
}
