{
    "directions": [
        "Place bacon in a large skillet and cook over medium-high heat, stirring occasionally, until evenly browned, about 10 minutes; remove from heat. Stir green onions into bacon and saute in hot fat until slightly softened, 1 to 2 minutes. Transfer bacon mixture to a strainer to drain, retaining drippings.",
        "Whisk flour, cornmeal, baking powder, salt, black pepper, and cayenne pepper together in a large bowl. Add drained bacon mixture, milk, Cheddar cheese, eggs, melted butter, and sugar to flour mixture; whisk until batter is smooth. Let batter rest for 10 minutes.",
        "Combine maple syrup and chipotle chile powder together in a small bowl; whisk until chile powder is completely dissolved.",
        "Heat 1 teaspoon bacon drippings, 1 teaspoon oil, and 1 teaspoon butter on a griddle over medium-high heat. Drop batter by 1/4-cupful onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter. Transfer pancakes to plate and top with maple syrup."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/1164800.jpg",
    "ingredients": [
        "8 ounces bacon, chopped",
        "1/2 cup thinly sliced green onions",
        "1 1/4 cups all-purpose flour",
        "3/4 cup cornmeal",
        "1 tablespoon baking powder",
        "3/4 teaspoon salt",
        "1 pinch ground black pepper",
        "1 pinch cayenne pepper",
        "1 1/3 cups milk",
        "2 ounces sharp Cheddar cheese, grated",
        "2 large eggs, beaten",
        "2 tablespoons butter, melted",
        "1 tablespoon white sugar",
        "1 cup warm maple syrup, or to taste",
        "1/8 teaspoon chipotle chile powder, or to taste",
        "1 teaspoon vegetable oil",
        "1 teaspoon butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mancakes",
    "url": "http://allrecipes.com/recipe/238130/mancakes/"
}