{
    "directions": [
        "Heat 1/4 cup oil in heavy large skillet over high heat. Add onions and sauté 5 minutes. Reduce heat to medium-low and sauté until onions are dark brown, about 25 minutes. Add sugar, vinegar and 1 1/2 teaspoons garlic; stir until liquid evaporates and onions are well glazed, about 2 minutes longer. Season with salt and pepper. Cool to room temperature.",
        "Sprinkle chicken with salt. Heat 2 tablespoons oil in another heavy large skillet over medium-high heat. Add chicken and sauté 2 minutes. Add remaining 1 tablespoon garlic and sauté 2 minutes. Add chili sauce and sauté 1 minute. Remove chicken from heat. Stir in 3 tablespoons cilantro.",
        "Preheat oven to 425°F. Sprinkle 2 large baking sheets with flour. Stretch dough from 1 tube to 12x8-inch rectangle. Cut crosswise in half, forming two 6x8-inch rectangles. Cut off corners of each rectangle, forming oval. Transfer dough to prepared baking sheet. Repeat stretching and cutting with remaining dough. Bake until tops are light brown, about 8 minutes.",
        "Mix mozzarella, Swiss and provolone cheeses in large bowl. Sprinkle cheese mixture, tomatoes, onions, chicken and remaining 3 tablespoons cilantro over pizzas, dividing equally. Bake pizzas until cheese melts, about 5 minutes longer."
    ],
    "ingredients": [
        "1/4 cup plus 2 tablespoons olive oil",
        "2 large onions, thinly sliced",
        "3 tablespoons golden brown sugar",
        "1 1/2 tablespoons apple cider vinegar",
        "1 1/2 teaspoons plus 1 tablespoon minced garlic",
        "1 pound skinless boneless chicken thighs, cut into 3/4-inch pieces",
        "2 tablespoons Thai hot chili sauce",
        "6 tablespoons chopped fresh cilantro",
        "2 10-ounce tubes refrigerated pizza dough",
        "1 cup shredded mozzarella cheese",
        "1/2 cup shredded Swiss cheese",
        "1/2 cup shredded provolone cheese",
        "3 large plum tomatoes, seeded, chopped (about 1 1/2 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Chicken",
        "Herb",
        "Tomato",
        "Appetizer",
        "Bake",
        "Fall",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Manchu Spiced Garlic Chicken \"Pizzettas\"",
    "url": "http://www.epicurious.com/recipes/food/views/manchu-spiced-garlic-chicken-pizzettas-4278"
}
