{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Slice the zucchini in half the long way, and scoop out the seeds and flesh, leaving a 1/2-inch thick shell all around. Discard flesh, or save for another use. Bring a pot of lightly salted water to a boil, and immerse the zucchini boats in the boiling water for 2 minutes. Remove from the water, drain, and place into a 9x12-inch baking dish. With a paper towel, blot away any excess water from the inside of the zucchini.",
        "Melt 1 tablespoon of  butter in a skillet over medium heat; cook and stir the onion, garlic, and green pepper until the onion is translucent, about 5 minutes. Gently stir in the crabmeat, and cook about 5 more minutes, until the crabmeat is hot. Keep the crabmeat in lump pieces as much as possible. Season the crab mixture with paprika, salt, and black pepper.",
        "Place the crab mixture into a mixing bowl, and lightly stir in bread crumbs, mayonnaise, and white wine. Add a bit more mayonnaise to help the mixture hold together, if needed. Spoon the filling into the prepared zucchini shells, and brush each zucchini with about 3/4 tablespoon of melted butter. Top each stuffed zucchini with 2 tablespoons of  Parmesan cheese.",
        "Bake in the preheated oven until the cheese melts and the filling is hot, about 15 minutes."
    ],
    "ingredients": [
        "4 zucchini, ends trimmed",
        "1 tablespoon butter",
        "1/2 onion, finely chopped",
        "1 clove garlic, finely chopped",
        "1/2 green bell pepper, finely chopped",
        "1 pound crabmeat",
        "1 teaspoon ground paprika",
        "salt and ground black pepper to taste",
        "1 cup Italian seasoned bread crumbs",
        "1/4 cup mayonnaise, or as needed",
        "1/4 cup dry white wine",
        "3 tablespoons butter, melted",
        "1/2 cup shredded Parmesan cheese, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mandy's Crab Stuffed Zucchini",
    "url": "http://allrecipes.com/recipe/215677/mandys-crab-stuffed-zucchini/"
}
