{
    "directions": [
        "Preheat oven to 350°F. Butter 10-inch-diameter cake pan. Line bottom with parchment; butter paper. Dust pan with flour. Melt semisweet chocolate in top of double boiler over simmering water. Remove from over water. Add unsalted butter 1 tablespoon at a time, mixing until melted and smooth. Mix in sugar and grated orange peel. Mix in eggs 1 at a time. Stir in egg yolk. Add cake flour and ground ginger, then chopped toasted almonds and crystallized ginger and stir to combine. Transfer batter to prepared pan. Bake until just springy to touch, about 1 hour 5 minutes. Cool cake in pan on rack 15 minutes. Turn out onto rack, remove paper and cool.",
        "Scald whipping cream with Grand Marnier liqueur in heavy small saucepan. Remove from heat. Add semisweet chocolate and mix until smooth. Cool chocolate glaze until thick enough to spread.",
        "Arrange cake flat side up on rack. Spread glaze evenly over top and sides of cake. Refrigerate until glaze if firm, about 30 minutes. Transfer cake to serving platter. (Cake can be prepared 1 day ahead. Cover and refrigerate. Bring to room temperature before serving.)",
        "Cut orange slices in half. Twist three and place in center of cake. Arrange remaining orange slices around edge of platter and serve."
    ],
    "ingredients": [
        "12 ounces semisweet chocolate, chopped",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into 8 pieces, room temperature",
        "1 cup sugar",
        "1 1/2 tablespoons grated orange peel",
        "4 large eggs",
        "1 large egg yolk",
        "3/4 cup cake flour",
        "1/4 teaspoon (generous) ground ginger",
        "1 cup chopped toasted almonds",
        "3/4 cup minced crystallized ginger",
        "1/2 cup whipping cream",
        "2 tablespoon plus 2 teaspoons Grand Marnier",
        "11 ounces semisweet chocolate, minced",
        "4 oranges, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Liqueur",
        "Chocolate",
        "Ginger",
        "Dessert",
        "Bake",
        "Orange",
        "Almond",
        "Winter",
        "Birthday"
    ],
    "title": "Mandarin Chocolate Cake",
    "url": "http://www.epicurious.com/recipes/food/views/mandarin-chocolate-cake-1105"
}
