{
    "directions": [
        "Put the mangoes, cilantro, Truvia(R) natural sweetener, hot sauce, vinegar, coconut milk, onion, garlic, lime juice and oil in a food processor and puree until smooth, add water if too thick. Adjust salt and pepper to taste. You should have about one quart of marinade-split in half.",
        "Add the chicken with half the mango mixture to a plastic bag, and rub to coat the chicken with the mango puree. Refrigerate at least 6 to 8 hours to marinate.",
        "Put the other half of the mango mixture into a small saucepan with the water and simmer over low heat until thick, up to 20 minutes.",
        "Preheat a grill to medium high heat. Spray with non-stick cooking spray so chicken won't stick to the grill. Season chicken with salt and pepper and place on grill.",
        "Cook slowly to avoid burning. Turn heat down to medium and cook for about 20 minutes basting the chicken with marinade.",
        "Discard marinade that was in contact with raw chicken. For the last 10 minutes of cooking only use the stovetop sauce as a marinade.",
        "Cook chicken until reaching an internal temperature of 165 degrees F.",
        "Slice the chicken and serve with steamed greens such as spinach. Spoon some of the cooked sauce over the chicken if desired."
    ],
    "ingredients": [
        "2 mangoes, peeled, pitted, and roughly chopped",
        "1 bunch fresh cilantro (chopped stems and all)",
        "3/4 cup Truvia® natural sweetener spoonable*",
        "1 tablespoon your favorite hot sauce",
        "2 teaspoons red wine vinegar",
        "1 cup coconut milk",
        "1/2 red onion, diced",
        "2 tablespoons ginger, minced",
        "4 cloves garlic, peeled and minced",
        "1 fresh lime, juice and zest",
        "2 tablespoons olive oil",
        "4 ounces water",
        "2 teaspoons kosher salt",
        "1 teaspoon freshly cracked black pepper",
        "2 pounds skinless chicken breasts",
        "Non-stick cooking spray"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mango Cilantro Chicken with Truvia® Natural Sweetener",
    "url": "http://allrecipes.com/recipe/229474/mango-cilantro-chicken-with-truvia/"
}
