{
    "directions": [
        "Start by cooking the rice. Put the jasmine rice and butter in a small saucepan and place on a medium heat. Add a little salt, the water and half the Thai basil (keep the leaves attached to the stalk). Bring to the boil, then cover and cook on a slow simmer for 15 to 20 minutes. Remove and discard the basil. Spread out the rice on a flat tray to cool down.",
        "Cook the red rice in plenty of boiling water (as you would cook pasta but with no salt) for 20 minutes, or until it is cooked through. Drain and spread on a tray to cool down.",
        "Pick off the leaves of the remaining basil and chop them up roughly. Place them in a large mixing bowl. Add the jasmine and red rice together with all the remaining ingredients, apart from the shallots, and stir just to mix; do not stir too much or the mango pieces will disintegrate. Taste and adjust the seasoning. Transfer the salad into serving bowls and garnish with crisp-fried shallots, if you like."
    ],
    "ingredients": [
        "2/3 cup jasmine or basmati rice",
        "1 tsp unsalted butter",
        "Salt",
        "1/2 cup water",
        "1 cup loosely packed Thai basil",
        "1 cup Camargue red rice",
        "1 red bell pepper, thinly sliced",
        "2 tbsp mint leaves, roughly chopped",
        "2/3 cup cilantro leaves, roughly chopped",
        "2 green onions, thinly sliced",
        "1 fresh red chile, seeded and finely chopped",
        "Grated zest and juice of 1 lemon",
        "1 large mango or 2 smaller ones, cut roughly into 1-inch dice",
        "1/2 cup roasted salted peanuts, roughly chopped",
        "2/3 cup flaked coconut",
        "2 tbsp peanut oil",
        "3/4 cup crisp-fried shallots (homemade or bought, optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Vegetarian",
        "Quick & Easy",
        "Coconut",
        "Mango",
        "Peanut",
        "Healthy",
        "Shallot",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Mango and Coconut Rice Salad",
    "url": "http://www.epicurious.com/recipes/food/views/mango-and-coconut-rice-salad-365130"
}
