{
    "directions": [
        "Pulse sour cream, mayonnaise, basil, chives, 1/4 teaspoon salt, and pepper in a blender until herbs are finely chopped and mixture is pale green.",
        "Bring 2 quarts water, lemon juice, and remaining 2 teaspoons salt to a boil in a 3-quart saucepan, then poach shrimp, uncovered, at a bare simmer until just cooked through, about 3 minutes. Transfer shrimp with a slotted spoon to a bowl of ice and cold water to stop cooking. Let shrimp chill in water 2 minutes, then drain and pat dry. Coarsely chop shrimp, then add to dressing along with mango and stir to combine.",
        "Toast tortillas 1 at a time directly on burner (gas or electric) at moderately high heat, turning over and rotating with tongs, until puffed slightly and browned in spots but still flexible, 30 to 40 seconds. Transfer to a clean kitchen towel as toasted and stack, loosely wrapped in towel.",
        "Divide watercress among tortillas, arranging it across middle, then top with 1 1/4 cups shrimp salad. Tuck in ends of wraps, then roll up tightly to enclose filling. Cut wraps in half diagonally."
    ],
    "ingredients": [
        "1/3 cup sour cream",
        "1/3 cup mayonnaise",
        "1/4 cup chopped fresh basil",
        "2 tablespoons chopped fresh chives",
        "2 1/4 teaspoons salt",
        "1/4 teaspoon black pepper",
        "1 tablespoon fresh lemon juice",
        "1 1/2 lb large shrimp in shell (16 to 20 per lb), peeled and deveined",
        "1 (1-lb) firm-ripe mango, peeled and cut into 1/3-inch cubes",
        "4 (10-inch) flour tortillas",
        "1 (6-oz) bunch watercress, tough stems discarded"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Poach",
        "Quick & Easy",
        "Mayonnaise",
        "Mango",
        "Basil",
        "Shrimp",
        "Sour Cream",
        "Watercress",
        "Tortillas",
        "Gourmet"
    ],
    "title": "Mango and Shrimp Wraps",
    "url": "http://www.epicurious.com/recipes/food/views/mango-and-shrimp-wraps-109450"
}
