{
    "directions": [
        "In an electric coffee/spice grinder finely grind fenugreek seeds and in a small bowl stir together with remaining marinade ingredients. In a shallow baking dish rub salmon fillets all over with marinade. Marinate fillets, covered, at cool room temperature 30 minutes.",
        "While salmon is marinating, cut bell pepper into thin strips, thinly slice onion, and finely chop garlic. In a 10- to 12-inch nonstick skillet heat 1 1/2 tablespoons oil over moderately high heat until hot but not smoking and sear fillets until golden, about 2 minutes on each side. Transfer salmon to a plate. To skillet add onion, garlic, gingerroot, and 1 1/2 tablespoons oil and cook over moderate heat, stirring occasionally, until onion is lightly browned. Stir in coconut milk and salt and bring sauce to a boil, stirring. Add fillets and gently simmer until they are just cooked through and sauce is thickened, 5 to 6 minutes.",
        "In another skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and sauté bell peppers, stirring, until crisp-tender and lightly browned, 5 to 6 minutes.",
        "Serve salmon and sauce over rice, topped with bell peppers."
    ],
    "ingredients": [
        "1/2 teaspoonfenugreek seeds",
        "2 tablespoons red- or white-wine vinegar",
        "2 teaspoons ground coriander seeds",
        "1 teaspoon ground cumin",
        "1/2 teaspoon cayenne",
        "1/4 teaspoon turmeric",
        "four 5-ounce pieces salmon fillet with skin",
        "3 bell peppers (preferably different colors)",
        "1 medium onion",
        "4 large garlic cloves",
        "4 tablespoons vegetable oil",
        "1 tablespoon grated peeled fresh gingerroot",
        "2 cups Laxmi's fresh coconut milk or canned unsweetened coconut milk",
        "1 teaspoon coarse salt, or to taste",
        "Accompaniment: cooked white or brown basmati rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Ginger",
        "Braise",
        "Marinate",
        "Coconut",
        "Salmon",
        "Spring",
        "Coriander",
        "Gourmet"
    ],
    "title": "Mangalore Salmon Braised with Coconut Milk",
    "url": "http://www.epicurious.com/recipes/food/views/mangalore-salmon-braised-with-coconut-milk-101284"
}
