{
    "directions": [
        "Position rack in center of oven and preheat to 400°F. Butter 2 9-inch-diameter cake pans with 1 1/2-inch-high sides. Line bottom of cake pans with waxed paper. Butter paper and dust lightly with flour.",
        "Sift flour and baking powder into medium bowl. Using electric mixer, beat eggs and yolks in large bowl until frothy. Gradually add 1/2 cup sugar and beat until pale yellow and slowly dissolving ribbon forms when beaters are lifted, about 4 minutes. Fold in flour mixture. Fold 1 heaping tablespoon batter into melted butter. Fold butter mixture back into batter. Divide batter between prepared pans. Bake until cakes are just golden brown around edges and toothpick inserted into centers comes out clean, about 10 minutes. Cool cakes completely in pans on rack.",
        "Pour liqueur into small bowl; sprinkle gelatin over. Let gelatin soften 10 minutes. Puree mangoes in processor. Measure puree and return 2 1/2 cups to work bowl of processor (reserve remainder for garnish). Add sugar to mango puree in processor and blend well. Set bowl of gelatin in saucepan of simmering water. Stir until gelatin dissolves. Add gelatin mixture to mango in processor and blend. Whip cream in large bowl to soft peaks. Fold in mango mixture.",
        "Transfer 1 cake layer to 9-inch-diameter springform pan with 2 3/4-inch-high sides. Spread mango mousse over cake. Place second cake layer atop mousse. Press lightly. Wrap tightly with plastic and refrigerate at least 4 hours. (Can be prepared 1 day ahead.)",
        "Whip cream until soft peaks form. Add sugar and liqueur and beat until firm peaks form.",
        "Release pan sides. Transfer cake to platter. Frost top and sides of cake with whipped cream mixture. Press almonds onto sides. Garnish top with mango slices. Brush mango with reserved puree."
    ],
    "ingredients": [
        "1/2 cup sifted cake flour",
        "1/2 teaspoon baking powder",
        "2 large eggs",
        "2 large egg yolks",
        "1/2 cup sugar",
        "2 tablespoons (1/4 stick) unsalted butter, melted",
        "1/4 cup orange liqueur",
        "1 package unflavored gelatin",
        "2 1/2 pounds large ripe mangoes, peeled, pitted, chopped",
        "1/2 cup sugar",
        "1 cup chilled whipping cream",
        "1 cup chilled whipping cream",
        "1 tablespoon powdered sugar",
        "1 1/2 teaspoons orange liqueur",
        "1 1/2 cups sliced almonds, toasted",
        "1 ripe mango, peeled, pitted, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Wedding",
        "Orange",
        "Mango",
        "Triple Sec",
        "Summer",
        "Birthday",
        "Chill",
        "Engagement Party",
        "Texas",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Mango-Orange Mousse Cake",
    "url": "http://www.epicurious.com/recipes/food/views/mango-orange-mousse-cake-2100"
}
