{
    "directions": [
        "Place the cumin, curry powder, white and balsamic vinegar, olive oil, 1/4 cup brown sugar, salt, and black pepper into a resealable plastic bag, and smush the bag several times with your fingers to combine and mix all ingredients. Place the chicken drumsticks into the bag, and knead the bag again with your fingers to coat the chicken in seasonings.",
        "Heat butter in a large skillet over medium heat, and place the seasoned chicken pieces into the hot butter. Brown the chicken well on both sides, about 10 to 12 minutes.",
        "Place half the mango slices, Dijon mustard, garlic, red pepper flakes, and 1 sliced onion into a blender, and blend until smooth, about 1 minute. Pour the mango mixture into the skillet over the chicken. Stir in 2nd sliced onion, white sugar, 1/4 cup of brown sugar, mustard greens, and raisins; stir mixture to dissolve sugar. Bring the mixture to a boil, reduce heat to a simmer, and cook until the chicken is no longer pink at the bone and the juices run clear, 10 to 15 more minutes. Stir often while cooking."
    ],
    "ingredients": [
        "1 teaspoon ground cumin",
        "1/2 teaspoon curry powder",
        "1 tablespoon distilled white vinegar",
        "1 tablespoon balsamic vinegar",
        "1 tablespoon olive oil",
        "1/4 cup brown sugar",
        "1 pinch salt and ground black pepper, or to taste",
        "4 chicken drumsticks",
        "2 tablespoons butter",
        "1 large mango, peeled, seeded, and sliced - divided",
        "1 tablespoon Dijon mustard",
        "1 clove garlic, crushed",
        "1 teaspoon crushed red pepper flakes",
        "2 small onions, sliced - divided",
        "1/4 cup white sugar",
        "1/4 cup brown sugar",
        "1 bunch mustard greens, washed and chopped",
        "1/4 cup raisins"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mango Chicken with Greens",
    "url": "http://allrecipes.com/recipe/218499/mango-chicken-with-greens/"
}
