{
    "directions": [
        "Stir together all sauce ingredients in a small bowl until sugar is dissolved.",
        "Add shrimp to a 4- to 5-quart pot of boiling salted water then reduce heat and poach shrimp at a bare simmer, uncovered, until just cooked through, about 3 minutes. Transfer shrimp with a slotted spoon to a bowl of ice and cold water to stop cooking, then return shrimp cooking water to a boil. Chill shrimp in ice water 2 minutes, then drain and pat dry. Cut each shrimp in half lengthwise, deveining if necessary.",
        "Add noodles to boiling water and cook until just tender, about 3 minutes. Drain in a colander, then rinse under cold running water and drain well. Stir together vinegar, sugar, and salt in a large bowl until sugar is dissolved, then add noodles and toss to coat.",
        "Put a double thickness of paper towel on a work surface and fill a shallow baking pan with warm water. Check rice-paper rounds and use only those that have no holes. Soak 1 round in warm water until pliable, 30 seconds to 1 minute, then carefully transfer to paper towels.",
        "Arrange 3 shrimp halves (cut sides up) in a row across bottom third (part nearest you) of soaked rice paper. Spread 1/4 cup noodles on top of shrimp and arrange 3 cilantro leaves, 3 mint leaves, 8 cucumber matchsticks, 6 scallion strips, and 10 mango matchsticks horizontally on top of noodles. Fold bottom of rice paper over filling and begin rolling up tightly, stopping at halfway point. Arrange 3 more mint leaves and 3 more cilantro leaves along crease, then fold in ends and continue rolling. Transfer summer roll, seam side down, to a plate and cover with dampened paper towels. Make 7 more rolls in same manner and serve, whole or halved diagonally, with dipping sauce.",
        "*Available at Asian markets and ethnicgrocer.com (866-438-4642)."
    ],
    "ingredients": [
        "3 tablespoons Asian fish sauce such as Thai nam pla or Vietnamese nuoc mam*",
        "3 tablespoons fresh lime juice",
        "2 tablespoons water",
        "2 1/2 teaspoons packed brown sugar",
        "12 large shrimp in shell (21 to 25 per pound), peeled",
        "3 ounces vermicelli rice-stick noodles*",
        "3 tablespoons rice vinegar",
        "2 tablespoons sugar",
        "1/2 teaspoon salt",
        "8 (8-inch) rice-paper rounds plus additional in case some tear*",
        "48 fresh cilantro leaves (from about 1 bunch)",
        "48 fresh mint leaves (from about 1 bunch)",
        "1 seedless cucumber (usually plastic-wrapped; 1 lb), peeled, cored, and cut into 1/8-inch-thick matchsticks",
        "3 scallions, cut into 3-inch-long julienne strips",
        "1 pound firm-ripe mango, peeled, pitted, and cut into 1/8-inch-thick matchsticks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Mango",
        "Mint",
        "Shrimp",
        "Cucumber",
        "Summer",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Mango Shrimp Summer Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/mango-shrimp-summer-rolls-108091"
}
