{
    "directions": [
        "Whisk sugar, lime juice, egg yolks, 3 whole eggs, and grated ginger in large metal bowl to blend. Set bowl over saucepan of simmering water (do not allow bottom of bowl to touch water). Whisk constantly until mixture thickens and instant-read thermometer inserted into mixture registers 160°F, about 6 minutes. Remove bowl from over water. Quickly add chilled butter cubes to curd; whisk until butter is melted. Press sheet of plastic wrap directly onto surface of lime-ginger curd; refrigerate curd overnight. (Lime-ginger curd can be made 3 days ahead. Keep covered and refrigerated.)",
        "Simmer mango nectar in heavy medium saucepan over medium heat until reduced to 3/4 cup, about 20 minutes. Remove from heat. Cool mango syrup to room temperature.",
        "Position rack in center of oven and preheat to 325°F. Line bottom of two 9-inch-diameter cake pans with 1 1/2-inch-high sides with parchment paper (do not grease cake pans or parchment paper). Sift flour, 6 tablespoons sugar, baking powder, and salt into medium bowl. Whisk egg yolks, canola oil, lime peel, and 6 tablespoons mango syrup in large bowl to blend (reserve remaining mango syrup for glaze). Add dry ingredients; whisk to blend.",
        "Using electric mixer, beat egg whites in another large bowl until soft peaks form. Add remaining 6 tablespoons sugar, 1 tablespoon at a time, beating until stiff and glossy. Fold 1/3 of egg whites into yolk mixture, then fold in remaining whites in 2 additions.",
        "Divide batter between prepared pans. Bake cakes until golden and tester inserted into center comes out clean, about 22 minutes. Cool cakes completely in pans on rack. Run small knife around edge of pans to loosen cakes. Carefully invert cakes onto 9-inch-diameter cardboard rounds or tart pan bottoms; tap sharply on work surface if necessary to release cakes from pans. Peel off parchment paper.",
        "Boil sugar, lime juice, and remaining 6 tablespoons mango syrup in heavy small saucepan until liquid is reduced to 1/4 cup, about 3 minutes. Chill glaze until cold, about 15 minutes. Place 1 cake layer, flat side up, on platter. Spread 2 cups lime-ginger curd over top of cake (reserve remaining curd for another use). Chill cake until curd firms up slightly, about 2 hours. Top with second cake layer, flat side down, pressing gently to adhere.",
        "Beat whipping cream and 2 tablespoons glaze in bowl until firm peaks form. Spread cream over top (not sides) of cake. Slightly overlap mango slices in concentric circles atop cream. Rewarm remaining glaze just to soften. Brush glaze over mango slices. Chill cake at least 2 hours. (Can be made 1 day ahead. Cover with cake dome and keep chilled.)",
        "Cut cake into wedges and serve."
    ],
    "ingredients": [
        "1 cup sugar",
        "3/4 cup fresh lime juice",
        "4 large egg yolks",
        "3 large eggs",
        "1 teaspoon grated peeled fresh ginger",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 11.5-ounce can mango nectar (about 1 1/2 cups)",
        "1 1/4 cups sifted cake flour (sifted, then measured)",
        "12 tablespoons sugar",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "3 large egg yolks",
        "1/4 cup canola oil",
        "2 1/2 tablespoons grated lime peel",
        "4 large egg whites",
        "1/4 cup sugar",
        "1 tablespoon fresh lime juice",
        "3/4 cup chilled whipping cream",
        "2 large firm but ripe mangoes, peeled, pitted, cut into 1/4-inch-thick slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Lime",
        "Mango",
        "Summer",
        "Chill",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mango and Lime Chiffon Cake",
    "url": "http://www.epicurious.com/recipes/food/views/mango-and-lime-chiffon-cake-107947"
}
