{
    "directions": [
        "Preheat oven to 350°F. Using fork, mix flour, 1/2 cup powdered sugar, melted butter, and coconut in medium bowl until dough forms. Divide into 6 equal pieces. Press each piece onto bottom and up sides of 4 1/2-inch-diameter tartlet pan with removable bottom. Chill crusts 30 minutes. do ahead Can be made 1 day ahead. Cover and chill.",
        "Bake crusts until golden, pressing down with spoon if bubbles form, about 25 minutes. Cool.",
        "Purée 2 mangoes in processor. Measure 13/4 cups puree; mix in spices. Transfer to bowl; cover and refrigerate.",
        "Pour lime juice into small saucepan; sprinkle gelatin over. Let stand until gelatin softens, about 10 minutes. Stir over low heat just until gelatin dissolves, about 2 minutes. Remove from heat. Whisk in condensed milk, then spiced mango puree. Divide filling among cooled crusts. Chill at least 3 hours and up to 5 hours.",
        "Using electric mixer, blend egg whites and coarse salt in large bowl. Gradually add 1 1/2 cups powdered sugar; beat until stiff peaks form, about 5 minutes.",
        "Spoon meringue atop tartlets or pipe atop tartlets using pastry bag fitted with large star tip. Using butane torch, lightly brown meringue. (Alternatively, place tartlets in 500°F oven until meringue is golden in spots, watching carefully to prevent burning, about 3 minutes.) Garnish with remaining mango slices and mint sprigs."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "2 cups powdered sugar, divided",
        "3/4 cup (1 1/2 sticks) unsalted butter, melted, lukewarm",
        "3 tablespoons sweetened flaked coconut",
        "3 large ripe mangoes, peeled, pitted, sliced, divided",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon ground cinnamon",
        "1/3 cup fresh lime juice",
        "1 envelope unflavored gelatin",
        "1 (14-ounce) can sweetened condensed milk",
        "6 large egg whites",
        "Pinch of coarse kosher salt",
        "6 fresh mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mixer",
        "Citrus",
        "Dairy",
        "Egg",
        "Fruit",
        "Herb",
        "Dessert",
        "Bake",
        "Mango",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mango Meringue Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/mango-meringue-tartlets-238225"
}
