{
    "directions": [
        "Heat 1 teaspoon vegetable oil in a small skillet over medium heat. Add peppercorns, poppy seeds, cloves, cinnamon stick, dried chile peppers, cumin seeds, and black cardamom; toast until fragrant, 2 to 3 minutes. Transfer to a spice grinder, add grated coconut, and grind into a paste.",
        "Combine onions, garlic, and ginger in a food processor; grind into a paste.",
        "Heat 2 tablespoons vegetable oil in a stovetop pressure cooker. Add onion paste; cook and stir until golden brown, about 5 minutes. Pour in pureed tomatoes; cook and stir until darkened, 4 to 5 minutes. Stir in turmeric and salt. Add lamb; cook and stir until evenly coated and starting to release some juices, about 10 minutes.",
        "Stir coconut paste, potatoes, water, tamarind paste, and sugar into the pressure cooker. Bring to a boil. Cover, bring to high pressure according to manufacturer's instructions, and cook, about 10 minutes. Reduce heat and continue cooking, about 15 minutes more.",
        "Release pressure according to manufacturer's instructions. Serve curry garnished with cilantro leaves."
    ],
    "ingredients": [
        "1 teaspoon vegetable oil",
        "15 whole black peppercorns",
        "1 tablespoon white poppy seeds (khus khus)",
        "4 whole cloves (lavang)",
        "1 cinnamon stick (dalchini)",
        "4 dried red chile peppers",
        "1 teaspoon cumin seeds (jeera)",
        "1 pod black cardamom (badi elaichi)",
        "1/2 cup grated coconut",
        "3 large onions, quartered",
        "6 cloves garlic",
        "1 (1 1/2 inch) piece ginger root, peeled",
        "2 tablespoons vegetable oil",
        "2 large tomatoes, pureed",
        "1 teaspoon ground turmeric (haldi)",
        "salt to taste",
        "1 pound boneless lamb, cut into small pieces",
        "1/2 pound potatoes, quartered",
        "1 cup water",
        "1 tablespoon tamarind paste",
        "1 teaspoon white sugar",
        "1/4 cup fresh cilantro leaves, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mangalore Mutton Curry",
    "url": "http://allrecipes.com/recipe/247111/mangalore-mutton-curry/"
}
