{
    "directions": [
        "Standing each mango upright, remove flesh from pit by cutting a thick lengthwise slice from each broad side. (Be careful: Peeled mango is slippery.) Put slices on a work surface and cut lengthwise into 3/8-inch-thick slices.",
        "Melt butter in a small heavy saucepan over moderate heat, then stir in brown sugar. Simmer, stirring, until butter is incorporated, 1 to 2 minutes. Spread mixture in bottom of a buttered 9- by 2-inch round baking pan and arrange mango on top, overlapping slices.",
        "Preheat oven to 350°F.",
        "Whisk together flour, baking powder, and salt. Beat together butter and sugar in a large bowl with an electric mixer at high speed until light and fluffy, about 6 minutes. Add whole egg and yolks 1 at a time, beating well after each addition. Beat in vanilla. Add half of flour mixture and mix at low speed until just combined. Mix in mango nectar, then add remaining flour mixture, mixing until just combined.",
        "Beat egg whites in another bowl with cleaned beaters until they just hold stiff peaks, then fold into batter gently but thoroughly.",
        "Gently spoon batter over mango topping and spread evenly. Bake in middle of oven until golden brown and a tester comes out clean, 55 to 60 minutes. Cool cake in pan on a rack 10 minutes. Run a thin knife around inside edge of pan, then invert a plate over pan and invert cake onto plate. Cool completely on plate on rack.",
        "Serve cake at room temperature."
    ],
    "ingredients": [
        "2 (1-lb) firm-ripe mangoes, peeled",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/2 cup packed light brown sugar",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 cup granulated sugar",
        "3 large eggs, 2 of them separated",
        "1 teaspoon vanilla",
        "1/2 cup mango nectar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Fruit",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Backyard BBQ",
        "Mango",
        "Winter",
        "Party",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mango Upside-Down Cake",
    "url": "http://www.epicurious.com/recipes/food/views/mango-upside-down-cake-106085"
}
