{
    "directions": [
        "Bring cream, milk, and lemongrass to simmer in heavy medium saucepan over medium-high heat. Remove from heat and let steep 30 minutes. Strain into bowl; discard solids in strainer. Return cream mixture to same saucepan and bring to simmer.",
        "Whisk egg yolks and sugar in medium bowl to blend. Gradually whisk in hot cream mixture. Return custard to same pan. Stir over medium heat until custard thickens enough to leave path on back of spoon when finger is drawn across, about 5 minutes (do not boil). Cool custard 30 minutes.",
        "Puree mangoes in processor until smooth. Strain into small bowl. Measure 1 cup puree and whisk into custard (reserve any remaining mango puree for another use). Cover and chill custard until cold, at least 2 hours.",
        "Process mango custard in ice cream maker according to manufacturer's instructions. Transfer ice cream to container; cover and freeze. (Can be made 2 days ahead. Keep frozen.)",
        "Scoop ice cream and sorbet into dessert bowls. Serve with shortbread cookies."
    ],
    "ingredients": [
        "1 cup whipping cream",
        "1 cup whole milk",
        "1/2 cup chopped lemongrass (from about 6 large stalks)",
        "3 large egg yolks",
        "1/2 cup sugar",
        "2 large very ripe mangoes, peeled, pitted",
        "Blood Orange Sorbet",
        "Purchased shortbread cookies"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Dairy",
        "Egg",
        "Fruit",
        "Brunch",
        "Dessert",
        "Freeze/Chill",
        "Kid-Friendly",
        "Quick & Easy",
        "Orange",
        "Mango",
        "Winter",
        "Lemongrass",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mango-Lemongrass Ice Cream and Blood Orange Sorbet",
    "url": "http://www.epicurious.com/recipes/food/views/mango-lemongrass-ice-cream-and-blood-orange-sorbet-109092"
}
