{
    "directions": [
        "Preheat oven to 350°F.",
        "Spread coconut in an even layer in a pie plate and toast in middle of oven, stirring occasionally, until golden, 10 to 12 minutes. (Leave oven on for baking crust.) Cool coconut to room temperature, about 10 minutes.",
        "Pulse together flour, coconut, butter, confectioners sugar, and salt in a food processor until dough just begins to form a ball. Press dough onto bottom and up side of tart pan with floured fingers, then freeze until firm, about 10 minutes. Bake in pan on a baking sheet in middle of oven until golden, about 25 minutes, then cool completely in pan on a rack.",
        "Purée chopped mango (2 1/2 cups) with sugar, lime juice, and a pinch of salt in a food processor until smooth, about 1 minute. Sprinkle gelatin over 1/4 cup purée in a heatproof bowl and let stand to soften 1 minute. Set bowl over a saucepan of simmering water and stir until gelatin is dissolved. Remove bowl from heat and stir in remaining purée.",
        "Beat cream in a large bowl with an electric mixer until it just holds stiff peaks, then fold in purée. Set bowl with filling in a larger bowl of ice and cold water and chill, stirring occasionally, until thickened, 1 to 1 1/2 hours.",
        "Remove side of tart pan and spoon filling into crust, smoothing top. Chill, loosely covered, until filling is set, at least 8 hours. Before serving, let stand at room temperature at least 15 minutes but no longer than 30, then scatter diced mango over top of tart, leaving a 2-inch border around edge."
    ],
    "ingredients": [
        "1/2 cup sweetened flaked coconut (1 3/4 ounce)",
        "3/4 cup all-purpose flour",
        "7 tablespoons cold unsalted butter, cut into bits",
        "1/3 cup confectioners sugar",
        "1/4 teaspoon salt",
        "2 1/2 cups chopped ripe mango (from two 1-pound mangoes) plus 1 1/2 cups diced (1/3-inch) firm-ripe mango (from one 1-pound mango)",
        "3 tablespoons granulated sugar",
        "2 tablespoons fresh lime juice",
        "1 teaspoon unflavored gelatin (from 1 envelope)",
        "1/3 cup well-chilled heavy cream",
        "Special equipment: a 9-inch round fluted tart pan (1 inch deep) with a removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Fruit",
        "Dessert",
        "Bake",
        "Lime",
        "Coconut",
        "Mango",
        "Spring",
        "Chill",
        "Gourmet",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mango Tart with Coconut Crust",
    "url": "http://www.epicurious.com/recipes/food/views/mango-tart-with-coconut-crust-108128"
}
