{
    "directions": [
        "Preheat oven to 350°F. Spray eight 4-inch-diameter tartlet pans with removable bottoms with vegetable oil spray. Combine macadamia nuts, coconut, pistachios and brown sugar in processor. Process until nuts are finely chopped. Transfer to large bowl. Beat egg whites in another large bowl until soft peaks form. Fold whites into nut mixture in 3 additions (mixture will be thick and sticky). Let mixture stand 10 minutes.",
        "Using plastic wrap as aid, press about 1/3 cup nut mixture onto bottoms and up sides of each prepared pan. Place pans on baking sheet. Bake until crusts are puffed and begin to brown, about 20 minutes. Cool crusts in pans 5 minutes. Using oven mitt, gently remove pan sides; cool crusts completely on rack.",
        "Whisk sugar, lime juice and yolks in large metal bowl to blend. Set bowl over saucepan of simmering water (do not allow bottom of bowl to touch water); whisk constantly until mixture thickens and candy thermometer registers 180°F., about 9 minutes. Remove bowl from over water. Gradually add chilled butter, whisking until melted and well blended. Press plastic wrap directly on surface of curd. Refrigerate until cold, about 3 hours. (Crusts and lime curd can be prepared 1 day ahead. Store crusts in airtight container at room temperature. Keep lime curd refrigerated.)",
        "Fill each crust with 5 tablespoons lime curd. Arrange mango slices decoratively atop tartlets. Whisk guava jelly in heavy small saucepan over low heat until melted. Brush over mango slices. Chill at least 3 hours and up to 1 day."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 cups roasted macadamia nuts (about 10 ounces)",
        "1 1/2 cups sweetened shredded coconut",
        "1 1/4 cups shelled pistachios (about 5 ounces)",
        "1/2 cup (packed) golden brown sugar",
        "3 large egg whites",
        "1 cup sugar",
        "3/4 cup fresh lime juice",
        "10 large egg yolks",
        "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
        "2 mangoes, peeled, pitted, sliced",
        "1/4 cup guava jelly or red currant jelly"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Lime",
        "Coconut",
        "Mango",
        "Macadamia Nut",
        "Pistachio",
        "Chill",
        "Simmer",
        "Candy Thermometer"
    ],
    "title": "Mango Tartlets with Lime Curd and Tropical Nut Crust",
    "url": "http://www.epicurious.com/recipes/food/views/mango-tartlets-with-lime-curd-and-tropical-nut-crust-4248"
}
