{
    "directions": [
        "Cut all visible pieces of fat from the steak so that only center 'eye' portion of the steak remains. Set steaks aside. Cut all meat from the trimmed fat scraps, discard the fat, and finely chop the meat scraps until they resemble ground beef. Transfer chopped meat to a container and refrigerate.",
        "Season steaks with black pepper and place on a wire rack set over a tray; refrigerate uncovered, 8 hours to overnight.",
        "Bring steaks to room temperature and season with salt.",
        "Heat vegetable oil in a large skillet over high heat. Cook steaks in hot oil until browned on one side, 4 to 5 minutes. Reduce heat to medium-high and turn steaks. Continue cooking until steaks start to firm and are reddish-pink and juicy in the center, 4 to 6 minutes more. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C) for medium-rare. Transfer meat to a plate to rest, 5 to 10 minutes. Set skillet aside.",
        "Place chopped beef scraps in a cold skillet and heat over medium-high heat. Cook and stir until meat is browned and caramelized. Add shallots and a pinch of salt; saute until shallots are golden brown and are softened, about 5 minutes more.",
        "Pour red wine into skillet and bring to a boil; cook and stir until wine is almost completely evaporated, 2 to 4 minutes. Add chicken broth, bring to a simmer, reduce heat to low, and cook until reduced by about half, 60 to 90 minutes. Strain sauce into bowl and skim fat that rises to the top.",
        "Heat empty steak skillet over medium-high heat. Pour the strained sauce into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Season sauce with salt and pepper and continue cooking until reduced and thickened, 3 to 5 minutes.",
        "Remove skillet from heat and whisk butter into sauce until melted and smooth. Place each steak on a plate and spoon sauce over the top."
    ],
    "ingredients": [
        "2 large New York strip steaks",
        "salt and ground black pepper to taste",
        "1 tablespoon vegetable oil",
        "1/4 cup sliced shallots",
        "1/2 cup red wine",
        "2 (10.75 ounce) cans  low-sodium chicken broth",
        "1 tablespoon cold butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Manhattan Filet with Pan Sauce Bordelaise",
    "url": "http://allrecipes.com/recipe/237138/manhattan-filet-with-pan-sauce-bordel/"
}
