{
    "directions": [
        "Scrub clams well and line a large sieve with a double thickness of cheesecloth. In an 8-quart heavy kettle with a lid steam clams in water, covered, stirring occasionally, until they have just opened, 8 to 10 minutes. Discard any unopened clams and drain remainder in lined sieve set over a bowl. Reserve clam juice. Remove two thirds clams from shells (leave remainder in shells). Transfer all clams to another bowl and partially cover with foil. Clams may be prepared up to this point 4 hours ahead and chilled, covered. Wipe kettle clean with paper towels and discard cheesecloth.",
        "Cut bacon crosswise into 1/2-inch-wide slices. Cut onions into 1/2-inch cubes and mince garlic. Peel potatoes and turnips and cut into 1/2-inch cubes. Trim fennel stalks flush with bulbs, discarding stalks, and core bulbs. Halve bulbs lengthwise and cut crosswise into 1/2-inch-thick slices. In kettle cook bacon over moderate heat, stirring occasionally, until crisp. Transfer bacon with a slotted spoon to paper towels to drain.",
        "In fat remaining in kettle cook onion and garlic over moderate heat, stirring, 2 minutes. Stir in potatoes, turnips, fennel, and reserved clam juice and simmer, covered, stirring occasionally, until potatoes are tender, about 20 minutes.",
        "Drain tomatoes in sieve set over a bowl and reserve juice. Chop tomatoes and add to vegetables with juice, wine, tomato paste, and salt and pepper to taste and simmer, covered, 15 minutes. Chowder may be made up to this point 4 hours ahead and chilled, covered. Return chowder to simmer before proceeding.",
        "Cut halibut into 2-inch cubes and remove any bones. Chop parsley or cilantro. Add halibut and clams to chowder, stirring gently to combine well, and cook until halibut is just cooked through, 3 to 4 minutes. Stir in parsley or cilantro and serve chowder sprinkled with bacon."
    ],
    "ingredients": [
        "6 dozen small hard-shelled clams such as littlenecks (less than 2 inches in diameter)",
        "cheesecloth for lining sieve",
        "1/2 cup water",
        "1/2 pound bacon (about 8 slices)",
        "2 medium onions",
        "4 garlic cloves",
        "3 large Yukon Gold or other boiling potatoes (about 1 1/2 pounds)",
        "2 large turnips (about 1 pound total)",
        "2 medium fennel bulbs (sometimes called anise; about 1 pound total)",
        "a 28- to 32-ounce can whole tomatoes",
        "1 cup dry white wine",
        "2 tablespoons tomato paste (optional)",
        "1 1/2 pounds skinless halibut fillets",
        "1 cup packed fresh flat-leafed parsley or cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Onion",
        "Potato",
        "Tomato",
        "Bacon",
        "Halibut",
        "Clam",
        "Fennel",
        "Turnip",
        "White Wine",
        "Winter",
        "Parsley",
        "Gourmet"
    ],
    "title": "Manhattan Seafood Chowder",
    "url": "http://www.epicurious.com/recipes/food/views/manhattan-seafood-chowder-100584"
}
