{
    "directions": [
        "Heat 2 tablespoons of oil in a large saucepot over medium heat. Cook the sausage, breaking it up into small pieces, until browned and caramelized, 8 to 10 minutes. Remove the sausage to a paper towel-lined plate and reserve for the filling.",
        "Add the remaining 2 tablespoons of oil to the pot and cook the onion until softened and translucent. Add the garlic and cook for 1 minute. Stir in the tomato paste and cook for 1 minute (the tomato paste will turn a deep maroon color). Add the crushed tomatoes, sugar, bay leaves, 1 1/2 teaspoons salt and a pinch of black pepper. Bring to a simmer, reduce the heat to low and cook for 30 minutes. Melt the butter into the sauce, remove the bay leaves and stir in 1/3 cup of basil. Remove the sauce from the heat and allow to cool to room temperature, 40 minutes.",
        "For the filling: mix together the ricotta, reserved sausage, the remaining 1/3 cup basil, 1 1/2 cups mozzarella, 1 1/2 cups Parmesan, 1 teaspoon salt and pepper to taste. Fold in 1 cup of the cooled tomato sauce. Place the filling in a large piping bag and refrigerate for 30 minutes.",
        "Preheat the oven to 375 degrees F.",
        "Bring a large pot of salted water to a boil. Cook the manicotti shells until they have softened slightly but still hold their tubular shape, 5 minutes.",
        "Pour half of the tomato sauce into a 9-by-13-inch baking dish. Fill each shell with the ricotta mixture. Place the filled shells in the baking dish. Pipe any extra filling along the ends of the shells in the dish. Top with the remaining tomato sauce and sprinkle the remaining 1 1/2 cups mozzarella and 1 cup Parmesan over the top. Cover the baking dish with foil and bake until the sauce begins to bubble, 40 minutes. Remove the dish from the oven, remove the foil and turn the oven to broil. Put the manicotti back into the oven to broil until the cheese is browned and bubbling, 2 to 4 minutes. Let cool slightly before serving."
    ],
    "ingredients": [
        "4 tablespoons extra-virgin olive oil",
        "4 ounces bulk hot Italian sausage",
        "4 ounces bulk sweet Italian sausage",
        "1 cup chopped yellow onion",
        "4 cloves garlic, minced",
        "2 tablespoons tomato paste",
        "Two 28-ounce cans crushed tomatoes",
        "1 teaspoon granulated sugar",
        "3 fresh bay leaves",
        "Kosher salt and freshly ground black pepper",
        "4 tablespoons unsalted butter",
        "2/3 cup chopped fresh basil",
        "2 cups ricotta",
        "3 cups shredded low-moisture mozzarella",
        "2 1/2 cups grated Parmesan",
        "One 8-ounce package manicotti"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sausage Recipes",
        "Main Dish Recipes"
    ],
    "title": "Manicotti with Italian Sausage",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/manicotti-with-italian-sausage"
}
