{
    "directions": [
        "Bring a large pot of water to a boil. Salt the water and cook the manicotti until shy of al dente, 5 to 6 minutes. Drain and cool to handle.",
        "For the sauce: Place in a food processor the canned tomatoes, garlic, onion, sugar, basil, parsley, thyme, salt and pepper to taste and the EVOO. Blend until smooth, and then place the sauce in a pot. Stir together with the passata or tomato sauce and simmer 20 minutes.",
        "Pour half of the sauce into large baking dish.",
        "For the filling: Mix together in a large bowl the spinach, ricotta, half the Parm, salt and pepper to taste and a little nutmeg. Taste to adjust seasonings before adding the eggs. Once the eggs are incorporated, spoon the filling into a large plastic food storage bag and trim the corner. Pipe the filling into the manicotti and put in the baking dish. Cover the casserole with the remaining sauce, Parm and mozzarella. Cover and store for a make-ahead meal.",
        "Preheat the oven to 450 degrees F and bake until brown and bubbly, 30 to 35 minutes."
    ],
    "ingredients": [
        "Kosher salt",
        "16 manicotti shells",
        "One 32-ounce can San Marzano tomatoes",
        "3 to 4 cloves garlic, grated",
        "1 small onion, grated",
        "1/2 teaspoon sugar",
        "A few leaves fresh basil, torn",
        "A few sprigs fresh parsley, leaves only",
        "A few sprigs fresh thyme, finely chopped",
        "Kosher salt and ground black pepper",
        "About 2 tablespoons EVOO",
        "2 cups passata or tomato sauce",
        "One 10-ounce package organic chopped frozen spinach, wrung dry in a kitchen towel",
        "4 cups ricotta",
        "1 1/2 cup grated Parmigiano-Reggiano",
        "Kosher salt and ground black pepper",
        "Freshly grated nutmeg",
        "2 eggs, lightly beaten",
        "2 cups shredded mozzarella"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Make Ahead",
        "Spinach",
        "Vegetable",
        "Tomato",
        "Cheese",
        "Main Dish Recipes"
    ],
    "title": "Manicotti",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/manicotti"
}
