{
    "directions": [
        "For the tomato sauce: Cook the ground sirloin in a pan over medium heat until it is cooked through, about 10 minutes. Meanwhile, heat the oil in a large pan over medium heat. Add the mushrooms and half the onion and saute, about 8 minutes. Drain and set aside.",
        "Combine the tomatoes,  garlic and remaining onion in a blender and pulse until the mixture is smooth. Transfer to a large stock pot over medium heat. Add the sugar, crushed red pepper, salt, basil, sirloin and mushroom mixture. Bring to a boil and simmer until slightly thickened. Set aside.",
        "For the filling: In a large bowl, combine the ricotta and eggs with a spoon. Add the Parmesan, parsley and pepper, and mix well. Set aside.",
        "For the manicotti crepes: In a large mixing bowl, whisk together the flour and egg. Add the milk and 1/4 cup water and combine.",
        "Spray a nonstick pan with cooking spray and heat over medium heat. Pour or scoop 2 to 4 tablespoons batter into the pan. Tilt the pan in a circular motion so that the batter coats the bottom of the pan evenly. Cook the crepe until the bottom is a light brown, about 2 minutes. Loosen with a rubber spatula, flip over and cook the other side. Repeat this process with the rest of the batter. Set crepes aside.",
        "Preheat the oven to 350 degrees F.",
        "Fill the crepes: Place 2 to 3 tablespoons of the ricotta filling in the middle of each crepe and roll up. Place the crepes, seam-side down, in an 11-by-17-inch baking dish. Cover the crepes with tomato sauce then sprinkle with a thin layer of Parmesan. Bake until bubbly, about 45 minutes. Serve warm."
    ],
    "ingredients": [
        "1 pound ground sirloin",
        "2 teaspoons oil",
        "1 cup mushrooms",
        "1 onion, medium dice",
        "Two 16-ounce cans crushed tomatoes",
        "4 cloves garlic",
        "3 teaspoons granulated sugar",
        "Pinch crushed red pepper",
        "Pinch of kosher salt",
        "4 fresh basil leaves",
        "1 pint part-skimmed ricotta cheese",
        "2 large eggs, beaten",
        "3/4 cup Parmesan, plus more for sprinkling",
        "2 tablespoons fresh parsley, chopped",
        "1 teaspoon freshly ground black pepper",
        "1 cup all-purpose flour",
        "1 large egg",
        "1/4 cup water",
        "1 cup skim milk",
        "Cooking spray"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Sauce Recipes",
        "Cheese",
        "Beef",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Manicotti",
    "url": "http://www.foodnetwork.com/recipes/manicotti-recipe20"
}
