{
    "directions": [
        "1. Simmer the turkey giblets and neck in water until tender, about 1 hour. Mince the giblets. Remove the meat from the neck. Combine both and reserve for the gravy. Preheat the oven to 325°F.",
        "2. Rinse the turkey and pat dry. Squeeze the orange inside the body cavity. Sprinkle with paprika, salt, and pepper. Stuff the cavity loosely with Cornbread Chorizo Stuffing and tie the legs together. Rub the turkey with butter; sprinkle with paprika, salt and pepper all over.",
        "3. Place the turkey, breast-side up, on a rack in a roasting pan. Add 2 cups of the broth and cover turkey with foil. Roast for 1 1/2 hours. Remove foil and roast turkey for 2 1/2 hours longer, basting every 30 minutes.",
        "4. Raise the oven temperature to 350°F; cook for an additional 45 minutes. Brush the Maple Ginger Glaze on the turkey; cook about 30 minutes longer. A thermometer inserted into the thickest part of the thigh should read 180°F; in the thickest part of the breast, 160°F; and in the deepest part of the stuffing, 165°F. Juices should run clear when the thigh is pricked with a knife.",
        "5. Remove turkey to a platter; let rest 20 minutes, covered loosely with foil, before carving. Remove the stuffing and cover with foil to keep warm.",
        "6. Prepare the gravy: Heat the pan juices in the roasting pan, scraping up all of the brown bits on the bottom. Pour the juices through a gravy separator to remove the fat. Pour the defatted juices into a measuring cup, along with any remaining glaze. Stir well; reserve.",
        "7. Melt the butter in a saucepan over medium heat. Whisk in the flour and continue whisking for 2 to 3 minutes, or until it browns slightly. Whisking constantly, slowly pour in 2 cups of the reserved pan juices and continue whisking until smooth. Bring the gravy to a boil, reduce heat to medium-low and add the thyme, salt, pepper, parsley, and reserved giblet mixture. Simmer for 10 minutes, stirring, until thickened. For a thinner gravy, add the remaining cup of chicken broth."
    ],
    "ingredients": [
        "1 fresh turkey (about 18 pounds), with giblets and neck",
        "1 orange, halved",
        "Paprika, to taste",
        "Salt and pepper, to taste",
        "Cornbread Chorizo Stuffing",
        "6 tablespoons soft butter",
        "3 cups chicken broth",
        "Maple Ginger Glaze",
        "4 tablespoons butter",
        "4 tablespoons flour",
        "1 teaspoon dried thyme",
        "1 tablespoon chopped parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Parade"
    ],
    "title": "Maple Ginger Roasted Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/maple-ginger-roasted-turkey-106798"
}
