{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Line and cover a baking sheet with aluminum foil. Place a baking rack on top of foil layer and spray rack with cooking spray.",
        "Place 4 bacon slices on the prepared rack. Coat 1 side of each slice with 1 tablespoon maple syrup using a pastry brush. Take ends of each strip and twist in opposite directions until the syrup-glazed side is twisted into the interior and the bacon is coiled tight. Place toothpicks in each end of bacon strips to hold in place.",
        "Bake bacon in the preheated oven for 15 minutes. Remove baking sheet from oven and brush the twisted bacon with another 1 tablespoon maple syrup. Continue baking until cooked through and crispy, about 5 minutes more. Remove baking sheet from oven and cool bacon.",
        "Place the remaining 4 bacon slices in a skillet over medium heat; cook, flipping occasionally, until crispy, about 5 minutes. Keep bacon grease in the skillet.",
        "Transfer the bacon slices from the skillet to a saucepan, pouring about 1 tablespoon bacon grease into the saucepan. Add the remaining 6 tablespoons maple syrup to saucepan. Cook and stir bacon maple syrup over medium heat until flavors have combined, 3 to 4 minutes. Remove saucepan from heat and cool, allowing bacon flavor to infuse into the syrup, about 10 minutes.",
        "Remove bacon from maple syrup and place on a work surface; chop into bits.",
        "Combine bacon-infused maple syrup and milk in a blender; blend on low until combined. Add ice cream and blend on medium until mixed, but still thick. Add most of the bacon bits and stir until incorporated into the milkshake.",
        "Pour milkshake into 4 glasses and top each with 1 tablespoon whipped cream. Sprinkle remaining bacon bits over whipped cream and garnish each with a bacon twist."
    ],
    "ingredients": [
        "cooking spray",
        "8 slices bacon, divided",
        "1/2 cup pure maple syrup, divided",
        "1 cup milk",
        "4 cups French vanilla ice cream",
        "1/2 cup whipped cream, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Maple Bacon Milkshake",
    "url": "http://allrecipes.com/recipe/246365/maple-bacon-milkshake/"
}
