{
    "directions": [
        "In the bowl of a stand mixer, combine the water, 1 tablespoon of sugar, and yeast. Let the mixture sit for 10 minutes to activate the yeast. Whisk in the remaining sugar, egg, and buttermilk. Add the flour, cinnamon, nutmeg, and salt. Knead the dough with the dough hook attachment until well combined, about 3 minutes. The dough will be very sticky.",
        "Transfer the dough to a large bowl coated lightly with cooking spray. Cover, and leave in a warm, draft-free place to rise until doubled in size, 1 1/2-2 hours.",
        "Transfer the dough to a floured surface and pat or roll it into a 1-inch thick rectangle, approximately 8x12 inches. Cut the dough into 12 (1x8 inch) rectangular pieces with a pizza cutter or sharp knife.",
        "Lay a slice of bacon on top of each piece of dough and twist 2-3 times to form a spiral, pinching the ends to adhere dough and bacon. Repeat with the remaining bacon and dough pieces. Cover and let rest for 30 minutes.",
        "Preheat oil in a deep fryer or large pot to 350°F.",
        "Deep fry the doughnuts, a few at a time, until the dough is fully cooked and the bacon is crisp, about 3 minutes. Transfer to a sheet pan lined with paper towels.",
        "Drizzle the doughnuts with Maple Glaze and let the glaze set before serving."
    ],
    "ingredients": [
        "1/3 cup warm water (110°F)",
        "1/4 cup sugar, divided",
        "1 1/8 teaspoon yeast (1/2 packet)",
        "1 large egg",
        "3 tablespoons buttermilk",
        "1 3/4 cups flour",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon freshly grated nutmeg",
        "1/8 teaspoon salt",
        "12 slices thick-cut, maple-flavored bacon, par-cooked (see note)",
        "Peanut or canola oil, for frying",
        "Maple Glaze"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bacon",
        "Deep-Fry",
        "Kidney Friendly",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Maple Bacon Twists",
    "url": "http://www.epicurious.com/recipes/food/views/maple-bacon-twists-51225830"
}
