{
    "directions": [
        "Heat milk, cream, and 1 tablespoon water in a small saucepan until an instant-read thermometer registers 110°-115°F. Transfer to a small bowl and stir in a pinch of sugar. Sprinkle yeast over. Let stand until foamy, about 10 minutes.",
        "Using an electric mixer, beat remaining 1/3 cup sugar and eggs in a large bowl until pale and foamy, about 3 minutes. Gently stir in yeast mixture and melted butter. Add 2 cups flour and salt; stir until a very soft dough forms.",
        "Cover bowl with a clean kitchen towel. Let dough rise in a warm, draft-free area until doubled, about 1 1/2 hours. (Alternatively, cover bowl loosely with plastic wrap and allow dough to rise for 8 hours in the refrigerator.)",
        "Punch down dough and knead several turns in bowl; form into a ball. Transfer to a generously floured work surface. Sprinkle dough with flour and roll out to 1/2\" thickness. Cut out doughnut holes with cookie cutter. Transfer to a floured baking sheet. Cover with a kitchen towel and let rest for 20 minutes.",
        "Pour syrup into a large bowl. Attach deep-fry thermometer to the side of a large pot; pour in oil to a depth of 2\" and heat over medium heat until thermometer registers 350°F. Working in batches, fry doughnuts, stirring gently with a slotted spoon to keep doughnuts rotating, until golden brown, about 2 minutes per batch. Using slotted spoon, transfer doughnuts to bowl of maple syrup; let soak, turning as more doughnuts are added, until doughnuts absorb syrup, about 15 minutes."
    ],
    "ingredients": [
        "1/3 plus 1/4 cup whole milk",
        "1 tablespoon plus 1 teaspoon heavy cream",
        "1/3 cup granulated maple sugar or white sugar plus more for yeast",
        "2 1/4 teaspoons (1 package) active dry yeast",
        "2 large eggs, room temperature",
        "3 1/2 teaspoons unsalted butter, melted",
        "2 cups all-purpose flour plus more for surface",
        "1/2 teaspoon kosher salt",
        "1 1/4 cups pure maple syrup",
        "Vegetable oil",
        "Ingredient info: Maple sugar is available at specialty foods stores, natural foods stores, and kingarthurflour.com.",
        "Special equipment: A 1\" round cookie cutter; a deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Egg",
        "Brunch",
        "Dessert",
        "Kid-Friendly",
        "Birthday",
        "Deep-Fry",
        "Maple Syrup",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Maple Syrup-Soaked Doughnut Holes",
    "url": "http://www.epicurious.com/recipes/food/views/maple-syrup-soaked-doughnut-holes-380633"
}
