{
    "directions": [
        "Roll out dough into a 13-inch round on a lightly floured surface with a floured rolling pin. Fit into a 9-inch pie plate and trim excess dough, leaving a 1/2-inch overhang, then fold overhang under (to reinforce edge) and press against rim of pie plate. Decoratively crimp edge and chill shell until firm, about 30 minutes.",
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Lightly prick bottom and side of pie shell all over with a fork, then line shell with foil and fill with pie weights. Bake until pastry is pale golden along rim and set underneath weights, about 20 minutes. Carefully remove foil and weights and bake shell until bottom and side are pale golden, about 10 minutes more. Cool completely in pie plate on a rack, about 20 minutes.",
        "Reduce oven temperature to 350°F.",
        "Soak dried cranberries in hot water until softened, about 10 minutes, then drain well.",
        "Spread nuts in a shallow baking pan and toast in oven until fragrant, about 6 minutes. Leave oven on.",
        "Whisk together syrup, brown sugar, butter, eggs, bourbon (if using), vinegar, and salt until combined well, then stir in nuts and cranberries.",
        "Pour filling into cooled pie shell and bake until filling is just set, 40 to 50 minutes. Cool completely in pie plate on a rack before serving."
    ],
    "ingredients": [
        "All-butter pastry dough",
        "3/4 cup dried cranberries (3 oz)",
        "1 cup hot water",
        "1/2 cup coarsely chopped pecans (about 2 oz)",
        "1/2 cup coarsely chopped walnuts (about 2 oz)",
        "1/2 cup coarsely chopped hazelnuts (about 2 oz)",
        "3/4 cup pure maple syrup (preferably Grade B)",
        "1/2 cup packed dark brown sugar",
        "1/2 stick (1/4 cup) unsalted butter, melted",
        "3 large eggs",
        "2 tablespoons bourbon (optional)",
        "1 teaspoon cider vinegar",
        "1/8 teaspoon salt",
        "Special equipment: pie weights, raw rice, or dried beans",
        "Accompaniment: lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Egg",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cranberry",
        "Pecan",
        "Walnut",
        "Fall",
        "Hazelnut",
        "Maple Syrup",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Maple Nut Pie",
    "url": "http://www.epicurious.com/recipes/food/views/maple-nut-pie-231013"
}
