{
    "directions": [
        "Briskly simmer vinegar, soy sauce, Sherry, and maple syrup in a 9- to 10-inch heavy skillet over moderately low heat until reduced to about 1/3 cup, 20 to 25 minutes. Keep warm.",
        "Quarter avocado lengthwise, then pit and peel. Cut lengthwise into 1/2-inch-thick slices, then gently toss together with lemon juice, oil, salt, and pepper in a small bowl.",
        "Preheat broiler. Line a large (15- by 10-inch) shallow baking pan with foil. 3Reserve about one fourth of glaze in a small bowl.",
        "Arrange fillets, skin sides down, in 1 layer in baking pan. Spoon about one third of remaining glaze over fillet, then spread with back of spoon to coat evenly.",
        "Broil fish 5 to 6 inches from heat, without turning, 2 minutes. Remove pan from broiler and coat with another layer of glaze, then broil 2 minutes more. Remove fillets from broiler and apply a third coat of glaze, then broil 1 minute more (for a total of 5 minutes). Remove from broiler and, with a clean spoon, apply reserved glaze. (Reserved glaze will not have touched uncooked fish.)",
        "Divide avocado salad among 4 plates, then serve fish alongside it."
    ],
    "ingredients": [
        "2/3 cup rice vinegar (not seasoned)",
        "1/2 cup soy sauce",
        "1/2 cup dry Sherry",
        "1/2 cup dark amber or Grade B maple syrup",
        "1 large firm-ripe California avocado",
        "2 teaspoons fresh lemon juice",
        "2 teaspoons extra-virgin olive oil",
        "1/4 teaspoon salt",
        "1/8 teaspoon black pepper",
        "4 (7- to 8-oz) Spanish mackerel fillets with skin (about 1/2 inch thick)",
        "Accompaniments: rice; lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Bake",
        "Quick & Easy",
        "Vinegar",
        "Soy Sauce",
        "Gourmet"
    ],
    "title": "Maple-Soy-Glazed Mackerel Fillets with Avocado",
    "url": "http://www.epicurious.com/recipes/food/views/maple-soy-glazed-mackerel-fillets-with-avocado-233978"
}
