{
    "directions": [
        "Sterilize jars and lids",
        "Cook onions in a large pot of boiling water until almost tender, about 5 minutes. Transfer with a slotted spoon to a bowl, reserving cooking water. When cool enough to handle, trim root ends from onions, keeping onions intact, then slip off skins. Halve onions lengthwise.",
        "Add beets to water in pot and boil until almost tender, about 25 minutes. Drain and, when cool enough to handle, slip off stems and skins. Halve beets lengthwise (quarter if large).",
        "Bring vinegar, syrup, water, salt, star anise, and ginger to a boil in a 3-quart saucepan, then simmer, uncovered, 10 minutes.",
        "Drain jars upside down on a clean kitchen towel 1 minute, then invert. Fill jars with beets and onions. Remove star anise and ginger slices from pickling liquid and tuck 1 of each into side of each jar. Fill jars with pickling liquid, leaving 1/4 inch of space at top, then run a thin knife between vegetables and jar to eliminate air bubbles.",
        "Seal, process, and store filled jars, boiling beets and onions in jars 20 minutes.",
        "Let beets and onions stand in jars at least 1 week for flavors to develop."
    ],
    "ingredients": [
        "2 lb small (1-inch) white boiling onions (not peeled)",
        "30 small to medium beets (1 1/2 to 2 inches; about 5 lb with greens), stems trimmed to 1 inch",
        "3 cups cider vinegar",
        "1 1/2 cups pure maple syrup (preferably dark amber)",
        "1 1/2 cups water",
        "2 teaspoons canning salt",
        "6 whole star anise",
        "6 (1/4-inch-thick) slices peeled fresh ginger",
        "Special equipment: 6 (1-pint) canning jars with lids and screw bands"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Ginger",
        "Onion",
        "Vegetable",
        "Beet",
        "Summer",
        "Maple Syrup",
        "Gourmet"
    ],
    "title": "Maple Pickled Beets and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/maple-pickled-beets-and-onions-105229"
}
