{
    "directions": [
        "Slice off the stem ends of each pumpkin 1 inch from the top, reserving them, scrape out the seeds and the membranes, reserving the seeds for toasting if desired, and brush the insides of the pumpkins with the butter. Top the pumpkins with the reserved stem ends and bake them in a glass baking dish in the middle of a preheated 375°F. oven for 45 minutes, or until the pulp is tender. (Alternatively, the pumpkins may be microwaved, uncovered, at high power (100%) for 12 to 15 minutes, or until the pulp is tender.)",
        "Let the pumpkins cool in the dish until they can be handled and discard any liquid that may have accumulated in them. Scoop out the pulp from the shells and the stems, being careful not to puncture the shells, force the pulp through a sieve into a metal bowl, and whisk in the maple syrup and the cinnamon. In a very small saucepan sprinkle the gelatin over the water, let it soften for 1 minute, and heat the mixture over moderate heat, stirring, until the gelatin is dissolved. Whisk the gelatin mixture into the pumpkin mixture.",
        "In a bowl beat the cream until it holds soft peaks and whisk it into the pumpkin mixture. Chill the mixture in the bowl set in a larger bowl of ice and cold water until it is the consistency of raw egg whites, spoon it into the shells, and chill the mousses, covered loosely with plastic wrap, for at least 6 hours or overnight. Garnish the mousses with the pumpkin-seed brittle."
    ],
    "ingredients": [
        "four 1/2 pound pumpkins (preferably sugar pumpkins)",
        "1 tablespoon unsalted butter, melted",
        "1/2 cup maple syrup",
        "1/2 teaspoon cinnamon",
        "1 envelope of unflavored gelatin",
        "3 tablespoons cold water",
        "1 cup well-chilled heavy cream",
        "pumpkin-seed brittle for garnish if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Thanksgiving",
        "Halloween",
        "Pumpkin",
        "Maple Syrup",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Maple Pumpkin Mousses",
    "url": "http://www.epicurious.com/recipes/food/views/maple-pumpkin-mousses-10751"
}
