{
    "directions": [
        "Boil apple cider and maple syrup in a heavy saucepan over medium-high heat until reduced to 1/2 cup (about 20 minutes). Remove from heat and mix in 1/2 of the thyme and marjoram and all of the lemon zest. Add the butter or margarine and whisk until melted. Add salt and ground pepper to taste. Cover and refrigerate until cold (syrup can be made up to 2 days ahead).",
        "Preheat oven to 375 degrees F (190 degrees C). Place oven rack in the lowest third of oven.",
        "Wash and dry turkey. Place turkey in a large roasting pan. Slide hand under skin of the breast to loosen breast skin. Rub 1/2 cup of the maple butter mix under the skin of the breast. If planning on stuffing turkey do so now. Rub 1/4 cup of the maple butter mixture over the outside of the turkey. With kitchen string tie legs of turkey together loosely.",
        "Arrange the chopped onion, chopped celery and chopped carrot around the turkey in the roasting pan. If desired the neck and giblets may be added to the vegetables. Sprinkle the remaining thyme and marjoram over the vegetables and pour the chicken stock into the pan.",
        "Roast turkey at 375 degrees F (190 degrees C) for 30 minutes. Reduce oven temperature to 350 degrees F (175 degrees C), and cover turkey loosely with foil (shiny side towards turkey). Continue to roast until very tender, basting occasionally with pan juices. About 3 to 4 hours unstuffed, 4 to 5 hours stuffed. Pierce the leg joint with a fork, if the juices run clear or faintly pink then the turkey is done. Transfer turkey to a platter and cove with foil. Reserve pan mixture for gravy.",
        "To Make Gravy: Strain pan juices into a measuring cup. Spoon fat from juices. Add enough chicken stock to make 3 cups. Transfer liquid to a heavy saucepan and bring to a boil.",
        "Mix 3 tablespoons of the reserved maple butter mixture with the flour in a small bowl to form a paste. Whisk baste into broth mixture. Add the chopped fresh thyme and bay leaf. Boil until reduced and thickened slightly, whisking occasionally. Add apple brandy if desired and season with salt and ground pepper to taste."
    ],
    "ingredients": [
        "2 cups apple cider",
        "1/3 cup real maple syrup",
        "2 tablespoons chopped fresh thyme",
        "2 teaspoons dried marjoram",
        "2 1/2 teaspoons grated lemon zest",
        "3/4 cup butter",
        "14 pounds whole turkey, neck and giblets reserved",
        "2 cups chopped onion",
        "1 cup chopped celery",
        "1 cup coarsely chopped carrots",
        "2 cups chicken stock",
        "3 cups chicken stock",
        "3 tablespoons all-purpose flour",
        "1 teaspoon chopped fresh thyme",
        "1 bay leaf"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Maple Roast Turkey and Gravy",
    "url": "http://allrecipes.com/recipe/9155/maple-roast-turkey-and-gravy/"
}
