{
    "directions": [
        "Boil maple syrup and 2 tablespoons marjoram in heavy medium saucepan until reduced to 1/2 cup, about 4 minutes. Remove from heat. Mix in 1 tablespoon marjoram, coriander, lemon peel, and pepper. Add butter and whisk until well blended. Freeze until butter is firm but still spreadable, stirring occasionally, about 45 minutes. (Can be made 2 days ahead. Cover and refrigerate.)",
        "Set rack in bottom third of oven and preheat to 375°F. Rinse turkey inside and out; pat dry with paper towels. Place turkey on small rack set in large roasting pan. Starting at neck end, carefully slide hand between skin and breast meat to loosen skin. Rub 1/2 cup maple butter over breast meat under skin. If stuffing turkey, spoon stuffing into neck and main cavities. Tie legs together loosely to hold shape. Rub 1/4 cup maple butter over outside of turkey. Reserve remaining maple butter for gravy. Arrange onions, celery, parsnips, and reserved turkey parts around turkey in pan. Sprinkle vegetables with remaining 1 tablespoon marjoram.",
        "Roast turkey 30 minutes. Reduce oven temperature to 350°F. Cover entire turkey (not pan) with foil and roast 1 1/2 hours. Add 2 cups broth to pan; roast turkey 1 1/2 hours. Remove foil. Add 1 cup broth to pan and roast turkey until meat thermometer inserted into thickest part of thigh registers 175°F, basting occasionally with pan juices, about 30 minutes longer if unstuffed or 1 hour longer if stuffed. Transfer turkey to platter; tent with foil and let stand 30 minutes (internal temperature of turkey will increase 5 to 10 degrees). Reserve mixture in pan for gravy.",
        "Strain pan juices into large measuring cup, pressing on solids; discard solids in strainer. Spoon fat from top of pan juices; discard fat. Add enough chicken broth to pan juices in cup to measure 4 1/2 cups. Melt 1/4 cup maple butter and 3 tablespoons butter in heavy large saucepan over medium-high heat. Add flour; whisk constantly until mixture is deep brown, about 8 minutes (mixture will resemble lumpy oatmeal-like paste). Gradually whisk in broth mixture; bring to boil. Add bay leaf and boil until thickened to sauce consistency, whisking occasionally, about 10 minutes. Whisk in Madeira, 1 tablespoon mustard, and marjoram. Simmer 2 minutes. Taste, adding more mustard if desired. Season gravy with salt and pepper. Brush turkey with maple butter. Serve turkey with gravy."
    ],
    "ingredients": [
        "3/4 cup pure maple syrup",
        "4 tablespoons chopped fresh marjoram",
        "1/4 cup coriander seeds, coarsely cracked in resealable plastic bag",
        "2 teaspoons grated lemon peel",
        "1 teaspoon cracked black pepper",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 16- to 18-pound turkey; neck, gizzard, and heart reserved",
        "2 cups chopped onions",
        "2 cups chopped celery with leaves",
        "2 cups sliced peeled parsnips (about 5 medium)",
        "3 cups (about) canned low-salt chicken broth",
        "2 1/2 cups (about) canned low-salt chicken broth",
        "3 tablespoons unsalted butter",
        "1/3 cup all purpose flour",
        "1 small bay leaf",
        "2 tablespoons Madeira",
        "1 to 2 tablespoons Dijon mustard",
        "1 teaspoon chopped fresh marjoram"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Fall",
        "Maple Syrup"
    ],
    "title": "Maple-Glazed Turkey with Dijon Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/maple-glazed-turkey-with-dijon-gravy-105765"
}
