{
    "directions": [
        "Preheat the oven to 400 degrees F. In the bowl of an electric mixer fitted with a paddle attachment, combine the flours, oats, baking powder, sugar and salt. Blend the cold butter in at the lowest speed and mix until the butter is in pea-size pieces. Combine the buttermilk, maple syrup and eggs and add quickly to the flour-and-butter mixture. Mix until just blended. The dough may be sticky.",
        "Dump the dough out onto a well-floured surface and be sure it is combined. Flour your hands and a rolling pin and roll the dough 3/4 to 1 inch thick. You should see lumps of butter in the dough. Cut into 3-inch rounds with a plain or fluted cutter and place on a baking sheet lined with parchment paper.",
        "Brush the tops with egg wash. Bake for 20 to 25 minutes, until the tops are crisp and the insides are done.",
        "To make the glaze, combine the confectioners' sugar, maple syrup and vanilla. When the scones are done, cool for 5 minutes and drizzle each scone with 1 tablespoon of the glaze. I like to sprinkle some uncooked oats on the top, for garnish. The warmer the scones are when you glaze them, the thinner the glaze will be.",
        "Photograph by Quentin Bacon"
    ],
    "ingredients": [
        "3 1/2 cups all-purpose flour",
        "1 cup whole-wheat flour",
        "1 cup quick-cooking oats, plus additional for sprinkling",
        "2 tablespoons baking powder",
        "2 tablespoons granulated sugar",
        "2 teaspoons salt",
        "1 pound cold unsalted butter, diced",
        "1/2 cup cold buttermilk",
        "1/2 cup pure maple syrup",
        "4 extra-large eggs, lightly beaten",
        "1 egg beaten with 1 tablespoon milk or water, for egg wash",
        "1 1/4 cups confectioners' sugar",
        "1/2 cup pure maple syrup",
        "1 teaspoon pure vanilla extract"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Breakfast Recipes",
        "Easy Brunch Recipes",
        "Brunch",
        "Easy Baking",
        "Baking",
        "Scone Recipes",
        "Grain Recipes",
        "Oats"
    ],
    "title": "Maple-Oatmeal Scones",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/maple-oatmeal-scones-recipe"
}
