{
    "directions": [
        "Preheat oven to 350°F. Butter 15 x 10 x 1-inch nonstick jelly roll pan. Mix brown sugar, maple syrup, unsalted butter and 3 tablespoons water in heavy small saucepan. Stir over low heat until sugar dissolves. Increase heat; bring mixture to boil. Boil until candy thermometer inserted into mixture reaches 240°F, about 3 minutes. Remove from heat. Stir in chopped pecans",
        "Using electric mixer, beat cream cheese, powdered sugar and butter in medium bowl until well blended. Set filling aside.",
        "Mix unbleached flour, baking powder and salt in large bowl. Using fork, cut in unsalted butter until mixture resembles coarse meal. Mix in enough milk to form moist dough. Gather dough into ball. Divide dough in half. Flatten dough into disks. Roll out 1 dough disk on floured surface to 1/8-inch thickness. Using 3 3/4- to 4-inch-diameter cookie cutter, cut out 8 rounds from dough. (Reroll dough scraps if necessary.) Place generous 2 teaspoonfuls cream cheese filling in center of each dough round. Spread filling over rounds, leaving 1/4-inch border. Roll up rounds jelly roll style. Place cheese pastries on prepared jelly roll pan, seam side down, spacing apart. Repeat with remaining dough disk and cheese filling.",
        "Bake pastries until firm to touch and beginning to brown at edges, about 25 minutes. Spoon syrup mixture over pastries. Bake 5 minutes longer. Let stand 1 minute. Using metal spatula, transfer pastries to platter. Serve pastries warm or at room temperature."
    ],
    "ingredients": [
        "1 cup (packed) golden brown sugar",
        "1/2 cup maple sugar",
        "5 tablespoons unsalted butter",
        "3 tablespoons water",
        "3/4 cup chopped pecans",
        "6 ounces cream cheese, room temperature",
        "5 tablespoons powdered sugar",
        "1 1/2 tablespoons unsalted butter, room temperature",
        "2 cups unbleached all purpose flour",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup (about) milk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Breakfast",
        "Brunch",
        "Bake",
        "Cream Cheese",
        "Pecan",
        "Fall",
        "Pastry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Maple Cream Cheese Pastries",
    "url": "http://www.epicurious.com/recipes/food/views/maple-cream-cheese-pastries-100483"
}
