{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Spread oats, almonds, pecans, and sunflower seeds in an even layer in a large shallow baking pan and bake, stirring occasionally, until oats are pale golden, about 15 minutes. Transfer to a bowl and toss with pumpkin seeds and zest.",
        "Line a baking sheet with nonstick liner. Cook brown sugar, syrup, juice, and salt in a 4- to 6-quart heavy saucepan over moderately high heat, stirring with a wooden spoon (be careful not to splash or splatter while stirring; mixture will become extremely hot), until it registers 290°F on thermometer, 8 to 10 minutes. Stir in butter until melted (mixture will thicken and become opaque), then quickly add nut mixture and stir until coated well. Immediately pour onto liner, then cover mixture with a sheet of parchment paper.",
        "Roll out brittle as thin as possible with a rolling pin. Carefully peel off parchment paper and discard (don't worry if some caramel sticks to parchment).",
        "Cool to room temperature, about 30 minutes. Break brittle into large pieces."
    ],
    "ingredients": [
        "1 cup old-fashioned rolled oats",
        "1/2 cup whole almonds (2 1/2 oz)",
        "1/2 cup pecans (2 oz)",
        "1/2 cup shelled sunflower seeds (2 oz)",
        "1/2 cup roasted pumpkin seeds (2 1/2 oz)",
        "1 teaspoon finely grated fresh orange zest",
        "1 cup packed light brown sugar",
        "1/2 cup pure maple syrup",
        "1/2 cup fresh orange juice",
        "1/4 teaspoon salt",
        "1/2 stick (1/4 cup) cold unsalted butter, softened",
        "Special equipment: a nonstick bakeware liner such as Silpat; a candy thermometer; parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Nut",
        "Dessert",
        "Kid-Friendly",
        "Back to School",
        "Oat",
        "Maple Syrup",
        "Seed",
        "Candy Thermometer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Maple Granola Brittle",
    "url": "http://www.epicurious.com/recipes/food/views/maple-granola-brittle-232334"
}
