{
    "directions": [
        "Preheat oven to 325 degrees F.",
        "Remove neck and giblets from body and neck cavities of turkey. Refrigerate for other use or discard.  Drain juices from turkey. Pat dry with paper towels.  Turn wings back to hold neck skin against back of turkey.  Place turkey, breast up, on flat roasting rack in shallow roasting pan.  Place 4 sage leaves under skin on both sides of breast. Place turkey on shallow rack in pan. Brush all of skin with lemon juice.",
        "Bake approximately 3-1/2 hours, or until meat thermometer reaches 180 degrees F when inserted in deepest part of thigh. Cover breast and top of drumsticks with aluminum foil after two hours to prevent overcooking of breast.",
        "During the last 30 minutes of baking, baste the turkey with maple syrup every 15 minutes.",
        "Remove turkey from roasting pan and let rest while preparing gravy.",
        "Place roasting pan on burners over medium heat. Add 1/2 cup of the broth. Bring to boiling, while scrapping dripping from bottom of pan. Remove pan from heat. Strain mixture into a large saucepan.",
        "Stir 1-1/2 cups of the broth and cranberry juice into saucepan. Bring to boiling on medium heat, stirring frequently; reduce heat to medium-low.",
        "Stir cornstarch into remaining 1/2 cup broth. Gradually stir into simmering mixture. Stir in cranberries. Simmer, stirring frequently, 5 minutes.",
        "Carve turkey and serve with gravy."
    ],
    "ingredients": [
        "1 (12 pound) Butterball® Turkey, thawed if frozen",
        "8 fresh sage leaves",
        "1/4 cup fresh lemon juice",
        "2/3 cup pure maple syrup",
        "2 1/2 cups chicken broth",
        "2 cups cranberry juice",
        "2 tablespoons cornstarch",
        "3/4 cup sweetened dried cranberries"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Maple Basted Roast Turkey with Cranberry Pan Gravy",
    "url": "http://allrecipes.com/recipe/233485/maple-basted-roast-turkey-with-cranbe/"
}
