{
    "directions": [
        "Toast flour in heavy large skillet over medium-high heat until pale golden (about the color of peanuts), stirring constantly, about 7 minutes. Remove skillet from heat. Add butter and whisk until butter melts and mixture is smooth (mixture will become very dark). Gradually whisk in broth. Bring to boil over medium heat, whisking frequently. Reduce heat; simmer until gravy is reduced to 21/2 cups, about 30 minutes. (Can be made 8 hours ahead. Cover and chill.)",
        "Preheat oven to 325°F. Rinse turkey inside and out; discard any pieces of fat in neck and main cavity. Pat turkey dry with paper towels. Fill neck cavity loosely with bread dressing. Fold skin over and secure with skewer. Fill main cavity loosely with bread dressing. Place turkey on rack in large roasting pan. Tie turkey legs together to hold shape. Tuck wings under turkey. Brush turkey with 11/2 tablespoons melted butter. Sprinkle turkey with salt and pepper. Pour 1/2 cup broth into roasting pan.",
        "Roast turkey 3 hours, basting with pan juices and adding 1/2 cup broth to pan every 30 minutes. Mix maple syrup, ginger and 1 tablespoon melted butter in small bowl; brush mixture over turkey. Continue to roast turkey until thermometer inserted into innermost part of thigh registers 180°F, about 15 minutes longer.",
        "Transfer turkey to platter. Tent with foil and let turkey stand 30 minutes.",
        "Meanwhile, scrape pan juices and any browned bits from roasting pan into 2-cup measuring cup. Spoon off and discard fat from surface of juices. Add juices to gravy. Add herbs and bring to simmer. Season gravy with salt and pepper.",
        "Serve turkey with dressing and gravy."
    ],
    "ingredients": [
        "1/2 cup all purpose flour",
        "6 tablespoons (3/4 stick) butter, cut into pieces",
        "5 cups canned low-salt chicken broth",
        "1 14- to 15-pound turkey",
        "6 cups Herbed Bread, Cracker and Leek Dressing",
        "2 1/2 tablespoons butter, melted",
        "3 1/2 cups canned low-salt chicken broth",
        "1 tablespoon pure maple syrup",
        "1/8 teaspoon ground ginger",
        "3 tablespoons minced mixed fresh herbs (such as parsley, sage, savory and/or thyme)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "turkey",
        "Roast",
        "Thanksgiving"
    ],
    "title": "Maple-Glazed Roast Turkey with Mixed-Herb Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/maple-glazed-roast-turkey-with-mixed-herb-gravy-2753"
}
