{
    "directions": [
        "Stir together water, salt, brown sugar, Instacure, and vanilla in storage tub until solids are dissolved, about 3 minutes, then add maple syrup and stir until dissolved. Add ice and stir until cure is cold (ice may not be completely melted; keeping liquid cold slows salt absorption).",
        "Add pork to cure, then weight with a large plate to keep submerged. Chill, tub covered with a lid or plastic wrap, 36 hours.",
        "Rinse pork and pat dry, then discard brine.",
        "Open vents on bottom of grill and on lid. Remove lid and top rack from grill, then center disposable roasting pan on lower rack. Add 6 cups hardwood sawdust to pan.",
        "Light 5 briquettes in chimney starter. When briquettes are fully lit (covered completely with gray ash and glowing), transfer with tongs to sawdust, spacing evenly.",
        "When sawdust begins to smolder, replace top rack and arrange pork pieces on rack about 1 inch apart. Cover grill with lid, then insert thermometer into a vent hole in lid to monitor air temperature, which should be 80 to 120°F. (If temperature rises above 120°F, remove 1 or more briquettes or uncover grill slightly until temperature falls. If temperature falls below 80°F, light 1briquette and add to sawdust.)",
        "Smoke pork, adding 1 cup sawdust to roasting pan and stirring with tongs every 11/2 hours to ignite unburned sawdust, 8 hours. Cool completely, then chill, wrapped in plastic wrap, until ready to use.",
        "Cut finished bacon crosswise into 1/8- to 1/4-inch-thick slices (or roast whole; see cooks' note, below) and fry in a nonstick skillet over moderate heat, turning, until browned. Transfer to paper towels to drain.",
        "Available at The Sausage Maker (888-490-8525)."
    ],
    "ingredients": [
        "6 cups water",
        "1 cup kosher salt",
        "2/3 cup packed dark brown sugar",
        "2 1/2 tablespoons Instacure No. 1*",
        "2 teaspoons vanilla",
        "1/2 cup pure maple syrup",
        "3 cups ice cubes",
        "2 (2-lb) pieces boneless pork loin (2 inches thick; preferably from rib end)",
        "Special equipment: a 1- to 2-gallon plastic storage tub or stainless-steel bowl; a 22 1/2-inch covered kettle grill with a hinged top rack; a 12- by 8- by 2-inch disposable aluminum roasting pan; 3 lb hardwood sawdust*; charcoal briquettes; a chimney starter; long metal tongs; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Side",
        "Bacon",
        "Pork Tenderloin",
        "Vanilla",
        "Summer",
        "Maple Syrup",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Maple-Cured Canadian Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/maple-cured-canadian-bacon-106606"
}
