{
    "directions": [
        "Position rack in center of oven and preheat to 325°F. Butter two 8-inch-diameter cake pans with 2-inch-high sides. Line bottom of pans with parchment paper; butter parchment. Dust pans with flour; tap out excess. Sift 3 cups flour, baking powder, and salt into medium bowl. Using electric mixer, beat butter and shortening in large bowl until light and fluffy. Add maple syrup and beat until smooth, about 3 minutes. Add egg yolks and egg 1 at a time, beating until well blended after each addition. Beat in flour mixture in 3 additions alternately with milk in 2 additions. Fold in walnuts. Divide batter equally between prepared pans (about 3 1/2 cups for each); smooth tops.",
        "Bake cakes until tester inserted into center comes out clean, 50 to 55 minutes. Cool cakes in pans on racks 20 minutes. Run small knife around sides of cakes to loosen. Invert cakes onto racks; remove parchment. Cool cakes completely.",
        "Sift powdered sugar into medium bowl. Using electric mixer, beat cream cheese and butter in large bowl until smooth. Add powdered sugar and maple syrup and beat just until smooth (do not overbeat or frosting may become too soft).",
        "Using serrated knife, trim off domed top of each cake layer, creating flat surface. Place 1 cake layer, trimmed side up, on platter. Spoon 1 cup frosting in dollops over top of cake layer; spread evenly to edges. Top with second cake layer, trimmed side down. Spread remaining frosting evenly over top and sides of cake. Arrange walnut halves around top edge of cake. DO AHEAD: Can be made up to 1 day ahead. Cover with cake dome and chill. Bring to room temperature before serving.",
        "Cut cake into wedges and serve."
    ],
    "ingredients": [
        "3 cups all purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 tablespoons non-hydrogenated solid vegetable shortening, room temperature",
        "2 cups pure maple syrup (preferably Grade B)",
        "3 large egg yolks",
        "1 large egg",
        "1 1/4 cups whole milk",
        "1 cup walnuts, toasted, coarsely chopped",
        "3 cups powdered sugar",
        "1 8-ounce package cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 tablespoons pure maple syrup (preferably Grade B)",
        "Toasted walnut halves (for garnish)",
        "Special equipment: Two 8-inch-diameter cake pans with 2-inch-high sides"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Easter",
        "Fourth of July",
        "Mother's Day",
        "Walnut",
        "Birthday",
        "Maple Syrup",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Maple Cake with Maple Syrup Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/maple-cake-with-maple-syrup-frosting-358216"
}
