{
    "directions": [
        "Preheat the oven to 350 degrees F and remove the top rack.",
        "Combine the butter and sage in a mixing bowl, mash with a fork or spoon until the sage is well incorporated and the butter has flecks of green in it; season with salt and pepper.",
        "In a saute pan, melt 4 tablespoons of the sage butter, add the onions, cook and stir for 15 minutes until soft and golden. Remove from heat. Put the cornbread in a large mixing bowl and scrape the sauteed onion mixture on top. Add the egg, heavy cream, and just enough chicken stock to moisten the stuffing without making it soggy (about 1/2 cup.) Toss well to combine, season with salt and pepper.",
        "Remove the neck and gizzards from the inside of the turkey and discard. Rinse the bird thoroughly inside and out with cold water, pat dry. Sprinkle the cavity and skin liberally with salt and pepper. Using your fingers, gently lift the skin from the breast and legs, and slip pieces of the sage butter underneath; massaging it in as you go. Fill the bird with the cornbread stuffing without packing too tightly; cook the remaining stuffing separately in a buttered baking dish. Truss the turkey; place it on a rack in a large roasting pan, and put into the oven.",
        "Meanwhile, in a small mixing bowl, whisk together the maple syrup and hot water to thin the glaze out a bit; use this to baste the turkey every 30 minutes. The turkey should take about 3 hours to cook (i.e. 15 to 20 minutes per pound.) If the legs or breast brown too quickly, cover with foil. About 2 hours into cooking, shingle the strips of bacon oven the turkey breast to cover; continue to roast and baste for another hour or so. The turkey is done when an instant-read thermometer inserted into the meatiest part of the thigh registers 170 degrees F (the thigh juices will also run clear when pricked with a knife.) Transfer the turkey to a cutting board and let rest for 20 minutes before carving, so the juices can settle back into the meat.",
        "Skim off the excess fat from the pan drippings with a spoon and place the roasting pan over 2 burners set on medium-high heat. Using a wooden spoon, scrape up brown bits stuck to bottom of pan. Whisk the flour into the drippings, stirring as it thickens to prevent lumps. Add the remaining chicken stock and bring to a simmer; season with salt and pepper and hit it with a squeeze of lemon juice to brighten the flavor. Simmer for 5 minutes and then strain to remove any particles. Serve the gravy with the maple-roasted turkey and cornbread stuffing."
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, at room temperature",
        "1/2 bunch fresh sage, leaves finely chopped",
        "Kosher salt and freshly ground black pepper",
        "2 large onions, finely chopped",
        "1 loaf cornbread, cubed (about 6 cups)",
        "1 large egg, lightly beaten",
        "1/2 cup heavy cream",
        "3 cups chicken stock",
        "1 (12 to 14 pound) fresh turkey",
        "1 cup pure maple syrup",
        "1/4 cup hot water",
        "8 strips smoked bacon",
        "1/4 cup all-purpose flour",
        "1/2 lemon, juiced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Thanksgiving Stuffing and Dressing",
        "Holiday",
        "Stuffing",
        "Thanksgiving",
        "Thanksgiving Turkey",
        "Poultry Recipes",
        "Turkey Recipes",
        "Roasted Turkey",
        "Roasting",
        "Smoked Turkey",
        "Cornbread",
        "Bacon Recipes",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Maple-Roasted Turkey with Sage, Smoked Bacon, and Cornbread Stuffing",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/maple-roasted-turkey-with-sage-smoked-bacon-and-cornbread-stuffing-recipe2"
}
