{
    "directions": [
        "In a large bowl, stir together the spelt flour, whole wheat flour, oats, yeast, cinnamon, cloves, allspice, nutmeg, ginger and salt. Combine the oil, warm water, and 1/4 cup maple syrup; stir into the flour mixture.",
        "When the dough is stiff enough, turn out onto a floured surface, and knead until smooth and elastic, about 7 minutes. Knead in more flour if necessary to keep the dough from being sticky. Place dough in an oiled bowl, and turn to coat. Cover, and set in a warm place to rise until double in size.",
        "Punch down dough, and form into a tight ball by folding the sides into the center. The tighter the ball, the more it will rise instead of just spreading. Place on a greased baking sheet with the seam underneath. Let rise for 20 minutes, or until your finger leaves a dent when you poke it gently.",
        "Preheat the oven to 375 degrees F (190 degrees C). Mix together 3 tablespoon of water and 1 tablespoon of maple syrup. Brush over the top of the loaf, then sprinkle with 2 tablespoons of oats.",
        "Bake for 35 to 40 minutes in the preheated oven, or until the loaf sounds hollow when tapped on the bottom. Cool on a wire rack before slicing."
    ],
    "ingredients": [
        "2 cups spelt flour",
        "1 cup whole wheat flour, or as needed",
        "1/2 cup rolled oats",
        "1 (.25 ounce) envelope active dry yeast",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon ground nutmeg",
        "1/2 teaspoon ground ginger",
        "1 1/2 teaspoons salt",
        "2 tablespoons vegetable oil",
        "1 cup warm water (120 to 130 degrees F/50 degrees C)",
        "1/4 cup maple syrup",
        "3 tablespoons water",
        "1 tablespoon maple syrup",
        "2 tablespoons rolled oats"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Maple Oat Bread",
    "url": "http://allrecipes.com/recipe/71938/maple-oat-bread/"
}
