{
    "directions": [
        "Whisk flour, sugar, and salt in large bowl to blend. Add butter. Using back of fork, cut in butter until very coarse meal forms. Add 3 tablespoons ice water. Toss until dough comes together in moist clumps, adding more water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour and up to 1 day.",
        "Combine flour, maple sugar, butter, and salt in medium bowl. Using back of fork or fingertips, rub in butter until moist clumps form. Transfer 1/4 cup streusel to small bowl and reserve for filling. Mix walnuts into remaining streusel. Chill streusel while preparing pie.",
        "Stir maple sugar, lemon juice, vanilla, spices, and salt in large bowl to blend. Add apples and 1/4 cup reserved streusel mixture; toss to combine. Let stand 15 minutes, tossing occasionally.",
        "Position rack in bottom third of oven and preheat to 400°F. Roll out dough on floured surface to 13-inch round. Transfer to 9-inch-diameter pie dish. Fold overhang under. Crimp edge decoratively.",
        "Spoon filling into prepared crust, mounding in center. Dot with 1 tablespoon butter. Sprinkle streusel over filling; press lightly to adhere.",
        "Bake pie until apples are tender and streusel is crisp and golden brown, covering edge of crust with foil if browning too quickly, about 1 hour 5 minutes. Let pie stand 15 minutes. Serve warm or at room temperature with ice cream."
    ],
    "ingredients": [
        "1/4 cup maple sugar",
        "2 tablespoons fresh lemon juice",
        "1 teaspoon vanilla extract",
        "1 teaspoon ground coriander",
        "1/4 teaspoon ground allspice",
        "2 pinches of coarse kosher salt",
        "2 3/4 to 3 pounds Golden Delicious apples (about 6), peeled, quartered, cored, cut crosswise into 1/4-inch slices",
        "1 tablespoon unsalted butter",
        "Vanilla ice cream",
        "1 1/4 cups all purpose flour",
        "1/2 teaspoon sugar",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "3 tablespoons (or more) ice water",
        "1 cup all purpose flour",
        "1 cup maple sugar",
        "7 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "Pinch of coarse kosher salt",
        "1/2 cup walnuts, toasted, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Kid-Friendly",
        "High Fiber",
        "Apple",
        "Fall",
        "Butter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Maple-Apple Pie with Walnut Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/maple-apple-pie-with-walnut-streusel-361273"
}
