{
    "directions": [
        "Heat cannellini beans on low heat in a saucepan.",
        "Heat 1 tablespoon olive oil in a skillet over medium heat. Stir in red onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add 1 tablespoon maple syrup; reduce heat to medium-low and continue cooking and stirring until the onion is very tender and dark brown, about 15 minutes more. Remove from skillet and add to beans.",
        "Heat 1 more tablespoon olive oil in a skillet over medium heat. Add butternut squash; cook and stir until tender, about 8 minutes. Add 1 tablespoon maple syrup; cook and stir to coat, about 5 minutes. Remove from skillet and add squash to bean mixture.",
        "Heat remaining 1 tablespoon olive oil in a skillet over medium heat. Add baby broccoli; cook and stir until tender and bright green, about 7 minutes. Add broccoli to bean mixture.",
        "Pour chicken stock into bean mixture, increase heat to medium-low, and stir remaining 1 tablespoon maple syrup and thyme to the mixture. Bring to a simmer and cook until heated through, stirring gently to combine. Top with crumbled bacon before serving."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/962721.jpg",
    "ingredients": [
        "2 (15 ounce) cans cannellini beans, drained and rinsed",
        "1 tablespoon olive oil",
        "1 red onion, chopped",
        "1 tablespoon maple syrup",
        "1 tablespoon olive oil",
        "1 cup peeled, seeded, and diced butternut squash",
        "1 tablespoon maple syrup",
        "1 tablespoon olive oil",
        "1 cup chopped baby broccoli",
        "1/4 cup chicken stock",
        "1 tablespoon maple syrup",
        "1/2 teaspoon dried thyme leaves",
        "3 slices bacon, cooked and crumbled"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Maple Cannellini Bean Salad with Baby Broccoli and Butternut Squash",
    "url": "http://allrecipes.com/recipe/228251/maple-cannellini-bean-salad-with-baby/"
}