{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place sliced apples in a large bowl, and toss with 4 tablespoons sugar and 1 teaspoon cinnamon. Melt 1/4 cup butter in a large skillet over medium heat. Saute apples until tender, 10 to 15 minutes. Allow to cool.",
        "To make the Streusel Topping:  In a medium bowl, mix together oatmeal, flour, 1/2 cup sugar and 1 teaspoon cinnamon. Drizzle with1/4 cup melted butter, and mix with the fork until mixture resembles chunky crumbs, or granola. If mixture seems too moist, add a little oatmeal or flour until the consistency is right. Sprinkle crumbs onto an ungreased jellyroll pan. Bake in preheated oven for 20 to 25 minutes, stirring every 8 minutes or so, until light golden brown and crunchy. Transfer to a bowl and let cool.",
        "To make Maple Cream Filling:  In a medium mixing bowl, beat cream cheese until fluffy. Gradually beat in 1 cup milk, pudding mix, and maple extract. Add remaining 1/2 cup milk, and beat until smooth. Spread cream cheese mixture into pie shell and refrigerate until apples are cool.",
        "After apples have cooled, remove them from skillet with a slotted spoon and transfer to a bowl. Reserve remaining apple syrup to drizzle over streusel. Arrange cooled apples over maple cream, then sprinkle with cooled streusel. Drizzle the reserved apple syrup over the top and refrigerate at least 2 hours before serving in order to allow the maple cream to firm up."
    ],
    "ingredients": [
        "APPLE FLLING:",
        "4 cups Granny Smith apples - peeled, cored and thinly sliced",
        "4 tablespoons white sugar",
        "1 teaspoon ground cinnamon",
        "1/4 cup butter",
        "STREUSEL TOPPING:",
        "5 tablespoons rolled oats",
        "5 tablespoons all-purpose flour",
        "1/2 cup white sugar",
        "1 teaspoon ground cinnamon",
        "1/4 cup butter, melted",
        "MAPLE CREAM FILLING:",
        "1 (8 ounce) package cream cheese, softened",
        "1 1/2 cups milk",
        "1 (3.5 ounce) package instant vanilla pudding mix",
        "1 teaspoon maple flavored extract",
        "1 (9 inch) deep dish pie crust, baked and cooled"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Maple Crunch Cream Pie",
    "url": "http://allrecipes.com/recipe/36786/maple-crunch-cream-pie/"
}
