{
    "directions": [
        "Fill a large pot partially with water. Bring to a boil, and note the temperature of the boiling water with a candy thermometer. (Since water boils at different temperatures in different locations, it is important to follow\nthis step.) Set some candy molds into a jelly-roll pan. Set aside. (If using metal or wood molds, lightly grease them.)",
        "Empty the large pot and place the syrup in it. Add a few drops of oil. (Boiling maple syrup will foam up; the oil keeps the foam down. Buttering the rim of the pot will also help.)",
        "Boil carefully over high heat, without stirring, until the temperature of the boiling syrup is 28°F/17°C above the boiling point of your water (212°F/100°C at sea level).",
        "Remove from the heat and let cool for 3 to 5 minutes. Do not stir or disturb the candy at this point; if the thermometer is attached to the pan, leave it there during the cooling period.",
        "Stir evenly until the liquid loses its gloss, starts to become opaque, and begins to thicken. (This is the tricky part; if you stir too long the thickened syrup will “set up,” or harden, in the pan. If this happens, add a cup of water, and reheat slowly to dissolve the sugar, then start over. But if you don’t stir long enough, the sugar may not “set up” in the molds at all.)",
        "Carefully pour the candy into the molds. It’s helpful to have an assistant spread the syrup in the molds while you continue to pour the mixture into the other molds.",
        "Allow the candies to cool, remove from the molds, place on a rack to dry for a few hours, and enjoy."
    ],
    "ingredients": [
        "2 cups pure light-grade maple syrup, (Grade A Golden Delicate)",
        "A few drops of vegetable oil or butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Maple Syrup",
        "Dessert",
        "Candy Thermometer",
        "Fat Free",
        "Kidney Friendly",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Maple Syrup Candies",
    "url": "http://www.epicurious.com/recipes/food/views/maple-syrup-candies"
}
