{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.",
        "Sift together flour, baking powder, and salt together in a bowl.",
        "Beat softened butter and sugar with an electric mixer in a large bowl until smooth. Beat one egg into butter mixture until completely blended, then beat in remaining egg, 1/2 cup maple syrup, and maple extract. Stir flour mixture into butter mixture just until dough forms; fold in walnuts until just combined.",
        "Divide dough in half. Shape each portion of dough into a log the length of a baking sheet, and place on the prepared baking sheet. Flatten each log into a rectangle 3 inches wide and 1-inch tall.",
        "Bake in the preheated oven until lightly browned on the bottom and slightly cracked on top, about 30 minutes. Remove from oven to cool for 15 minutes, but leave oven on.",
        "Slice logs diagonally into 1/2-inch thick slices, and lay slices on their sides on the baking sheet.",
        "Bake biscotti in the preheated oven until lightly browned and crisp on the outside, about 8 minutes. Remove from oven; cool for a few minutes.",
        "Stir together 1 tablespoon melted butter and 1/4 cup maple syrup in a bowl. Stir confectioners' sugar into mixture gradually until smooth. Drizzle maple glaze lightly with a spoon over warm biscotti."
    ],
    "ingredients": [
        "Biscotti:",
        "3 1/2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup butter, softened",
        "1/2 cup white sugar",
        "2 eggs",
        "1/2 cup maple syrup",
        "1 teaspoon maple extract",
        "1 cup chopped walnuts",
        "Maple Glaze:",
        "1 tablespoon melted butter",
        "1/4 cup maple syrup",
        "3/4 cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Maple Walnut Biscotti",
    "url": "http://allrecipes.com/recipe/234043/maple-walnut-biscotti/"
}
