{
    "directions": [
        "Stir 2 cups water and 1/3 cup coarse salt in medium saucepan over medium heat until salt dissolves. Remove from heat. Add maple syrup, garlic, sage, bay leaves, and peppercorns. Add 2 cups ice water; cool brine to room temperature. Place roast in large resealable freezer bag; place bag in large pot. Pour brine into bag with roast; seal bag. Place in refrigerator and brine pork overnight.",
        "Remove pork from brine; discard brine. Let pork stand 1 hour at room temperature.",
        "Preheat oven to 325°F. Place first 4 ingredients on heavy 18x12x1-inch rimmed baking sheet. Drizzle with 3 tablespoons oil. Sprinkle with coarse salt and pepper; toss to coat. Push mixture to sides of sheet, making room for roast in center.",
        "Heat remaining 1 tablespoon oil in heavy large skillet over high heat. Pat pork dry. Place roast, fat side down, in skillet and cook until browned, 5 to 6 minutes. Transfer roast, browned side up, to center of baking sheet with apple-onion mixture.",
        "Add apple cider to drippings in skillet. Boil cider until reduced to 1 cup, 15 to 20 minutes. Pour reduced cider over apple-onion mixture. Mix maple syrup and 11/2 tablespoons mustard in small bowl for glaze. Brush half of glaze over browned side of pork.",
        "Roast pork until instant-read thermometer inserted into center registers 140°F, brushing every 45 minutes with remaining glaze, about 2 hours total. Transfer pork to work surface and let rest 15 minutes.",
        "Meanwhile, stir melted butter and remaining 1 tablespoon mustard in medium bowl. Add breadcrumbs; toss to coat. Season to taste with coarse salt and pepper. Spread out on small rimmed baking sheet. Increase oven temperature to 375°F.",
        "Bake breadcrumbs until golden brown and crisp, 10 to 12 minutes. Cut pork into scant 1/2-inch-thick slices off bone. Divide among plates. Using slotted spoon, divide apple-onion mixture among plates. Pour juices from baking sheet into small pitcher. Sprinkle mustard breadcrumbs over pork and serve, passing juices alongside.",
        "Fruity and spicy En Route 2007 \"Les Pommiers\" Pinot Noir, Russian River Valley ($50)."
    ],
    "ingredients": [
        "2 cups water",
        "1/3 cup coarse kosher salt",
        "1/4 cup pure maple syrup",
        "4 unpeeled garlic cloves, smashed",
        "3 large fresh sage sprigs",
        "2 bay leaves (preferably fresh)",
        "1 teaspoon whole black peppercorns",
        "2 cups ice water",
        "1 5-to 5 1/2-pound bone-in pork loin rib roast, chine bone removed",
        "1 1/2 pounds tart crisp apples (such as Granny Smith), cored, cut into 1-inch-wide wedges",
        "3 cups coarsely chopped onions",
        "3/4 cup chopped celery",
        "1 tablespoon finely chopped fresh sage",
        "4 tablespoons extra-virgin olive oil, divided",
        "Coarse kosher salt",
        "2 1/4 cups apple cider",
        "1 1/2 tablespoons pure maple syrup",
        "2 1/2 tablespoons Dijon mustard, divided",
        "3 tablespoons unsalted butter, melted",
        "1 1/2 cups fresh breadcrumbs (from crustless French bread coarsely ground in processor)",
        "Special equipment: 2-gallon resealable freezer bag"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Onion",
        "Roast",
        "Dinner",
        "Apple",
        "Pork Tenderloin",
        "Fall",
        "Maple Syrup",
        "Breadcrumbs",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Maple-Brined Pork Roast with Apples, Onions, and Mustard Breadcrumbs",
    "url": "http://www.epicurious.com/recipes/food/views/maple-brined-pork-roast-with-apples-onions-and-mustard-breadcrumbs-355231"
}
