{
    "directions": [
        "Boil maple syrup in heavy medium saucepan over medium-high heat until reduced to 1 cup, stirring occasionally and watching closely to avoid boiling over (syrup will bubble up to top of pan), about 5 minutes. Remove reduced maple syrup from heat and let cool to slightly warm or room temperature.",
        "Position rack in center of oven and preheat to 375°F. Mix graham cracker crumbs, sugar, and cinnamon in medium bowl. Add melted butter and stir until crumbs are evenly moistened. Press crumb mixture onto bottom and 2 inches up sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Bake crust until set and top edge of crust darkens slightly, about 10 minutes. Cool crust completely on rack. Reduce oven temperature to 300°F.",
        "Beat cream cheese in large bowl of heavy-duty mixer fitted with paddle attachment until very smooth. Add maple sugar, flour, and salt; beat until well blended and smooth. Add 1 cup reduced maple syrup, sour cream, and vanilla; beat until well blended. Add eggs, 2 at a time, and beat just until blended after each addition. Tap bowl several times on counter to release any air bubbles. Pour filling into cooled crust. Using tip of small knife, pop any air bubbles on surface.",
        "Bake cake until slightly puffed around edges (center will still look moist and will move slightly when pan is gently shaken), about 1 hour 30 minutes. Transfer cake to rack and cool completely. Cover and chill overnight. DO AHEAD: Can be made 3 days ahead. Keep chilled.",
        "Cut cheesecake into wedges. Divide among plates. Serve with warm Maple- Cranberry Compote alongside."
    ],
    "ingredients": [
        "1 1/2 cups pure maple syrup (preferably grade A dark amber)",
        "2 cups ground graham crackers (about 17 whole crackers ground in processor)",
        "3 tablespoons sugar",
        "1/2 teaspoon (scant) ground cinnamon",
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "3 8-ounce packages cream cheese, room temperature",
        "1/2 cup maple sugar or (packed) golden brown sugar",
        "3 tablespoons all purpose flour",
        "1/4 teaspoon salt",
        "1 cup reduced maple syrup (see above)",
        "2/3 cup sour cream",
        "2 teaspoons vanilla extract",
        "4 large eggs",
        "Maple-Cranberry Compote",
        "Heavy-duty stand mixer",
        "9-inch-diameter springform pan with 2 3/4-inch-high sides"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Cream Cheese",
        "Cranberry",
        "Winter",
        "Christmas Eve",
        "Sour Cream",
        "Maple Syrup",
        "Butter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Maple Cheesecake with Maple-Cranberry Compote",
    "url": "http://www.epicurious.com/recipes/food/views/maple-cheesecake-with-maple-cranberry-compote-356358"
}
