{
    "directions": [
        "In a small bowl stir together cream cheese, confectioners' sugar, and vanilla until smooth.",
        "Peel, halve, and core apples and cut into 1/4-inch slices. In a bowl toss apples with 2 tablespoons granulated sugar.",
        "Preheat oven to 375°F.",
        "On a lightly floured surface roll 1 sheet puff pastry into a 15- by 11-inch rectangle. From a long side, cut four 1/3-inch-wide strips. From a short side, cut two 1/3-inch-wide strips. Set pastry strips aside. Halve lengthwise what remains of rectangle and put halves on a baking sheet.",
        "Just inside pastry rectangles' edges, brush 1/3-inch-wide borders of egg wash, reserving remaining egg wash. Arrange pastry strips on borders so that they are flush with edges of rectangles, trimming strips to fit. Spread cream-cheese mixture inside borders on rectangles and top with apples.",
        "On a lightly floured surface roll remaining puff-pastry sheet into a 14- by 10-inch rectangle and halve lengthwise. Cut several 2 1/2-inch diagonal slits down middle of each rectangle (do not cut within 1 inch of edges).",
        "Brush pastry borders of apple-topped tarts with some remaining egg wash and top each with 1 pastry rectangle. Press edges gently but firmly together to seal. Brush remaining egg wash over pastry tops and sprinkle with remaining 2 tablespoons sugar. Bake tarts in middle of oven 30 minutes, or until puffed and golden.",
        "In a small saucepan simmer maple syrup 10 minutes, or until reduced to about 1/3 cup. Brush hot syrup glaze over warm tarts. Serve tarts warm or at room temperature."
    ],
    "ingredients": [
        "an 8-ounce package cream cheese, softened",
        "1/4 cup confectioners' sugar",
        "1 teaspoon vanilla",
        "2 medium Empire, Gala, or Golden Delicious apples",
        "1/4 cup granulated sugar",
        "a 17 1/4-ounce package (2 sheets) frozen puff pastry, thawed",
        "1 large egg, beaten lightly with 1 tablespoon water",
        "1/2 cup pure maple syrup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Fruit",
        "Breakfast",
        "Brunch",
        "Bake",
        "Cream Cheese",
        "Apple",
        "Fall",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Maple-Glazed Breakfast Apple Tarts",
    "url": "http://www.epicurious.com/recipes/food/views/maple-glazed-breakfast-apple-tarts-13102"
}
