{
    "directions": [
        "Blend together flour, sugar, butter, and salt in a bowl with your fingertips or a pastry blender until mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Drizzle water evenly over mixture and gently stir with a fork until incorporated and dough forms a ball.",
        "Turn dough out onto a lightly floured surface and divide into 4 portions. With heel of your hand, smear each portion once in a forward motion to help distribute fat. Gather all dough together with scraper or your hands and press into a ball, then flatten into a 5-inch disk. Wrap disk in plastic wrap and chill until firm, at least 1 hour.",
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Roll out dough on a lightly floured surface with a lightly floured rolling pin into a 16- by 14-inch oval (1/8 inch thick). Cut out 8 (4 1/2-inch) rounds with cutter and fit each round into a tartlet pan, pressing lightly to fit into pans.",
        "Transfer tartlet pans to a baking sheet and chill until dough is firm, about 15 minutes.",
        "Line each tartlet shell with foil and fill with pie weights. Bake until edges are pale golden, 8 to 10 minutes. Carefully remove foil and weights and continue baking until bottoms are golden, about 5 minutes more. Cool completely in pans on a rack, about 10 minutes. Reduce oven temperature to 350°F.",
        "While shells cool, whisk together all filling ingredients except nuts until combined well. Return cooled tartlet shells (in their pans) to baking sheet and divide nuts among shells. Ladle filling into shells, dividing it evenly.",
        "Bake tartlets until filling is just set, 15 to 18 minutes. Cool in pans on rack, about 15 minutes, then carefully remove tartlets from pans. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1 teaspoon sugar",
        "1 stick (1/2 cup) cold unsalted butter, cut into small pieces",
        "1/4 teaspoon salt",
        "1/4 cup cold water",
        "2 large eggs",
        "1/2 cup dark amber or Grade B maple syrup",
        "6 tablespoons packed light brown sugar",
        "3/4 stick (6 tablespoons) unsalted butter, melted and cooled",
        "3 tablespoons granulated maple sugar (see cooks' note, below)",
        "1 1/2 tablespoons cider vinegar",
        "Rounded 1/8 teaspoon salt",
        "2/3 cup pecans (2 1/2 ounces), finely chopped",
        "Special equipment: a pastry or bench scraper (optional); a 4 1/2-inch round cookie cutter; 8 (3 1/2-inch) fluted round tartlet pans; pie weights or raw rice",
        "Accompaniment: unsweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Vinegar",
        "Pecan",
        "Fall",
        "Winter",
        "Shower",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Maple Sugar Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/maple-sugar-tartlets-234002"
}
