{
    "directions": [
        "On a lightly floured surface with a floured rolling pin roll out two thirds dough 1/8 inch thick (about a 14-inch round). Fit dough into a 10-inch (1 1/2-quart capacity) pie plate and trim edge, leaving a 1/2-inch overhang. Crimp edge decoratively and chill shell 30 minutes. Shell may be made 1 day ahead and chilled, covered loosely with plastic wrap.",
        "Preheat oven to 375° F.",
        "On lightly floured surface roll out remaining dough 1/8 inch thick (about a 10-inch round) and with a 2-inch leaf-shaped cutter cut out 16 leaves. Transfer pastry leaves to a baking sheet and chill until firm, about 15 minutes.",
        "Brush leaves with some egg wash (being careful not to drip onto edges) and bake in middle of oven until golden, about 12 minutes. Transfer leaves to a rack and cool. Leaves may be made 1 day ahead and kept in an airtight container at room temperature.",
        "In a 3- to 3 1/2-quart heavy saucepan gently boil maple syrup until a small amount dropped into a bowl of cold water forms a soft ball, about 210° F on a candy thermometer, and cool slightly. In a bowl whisk together pumpkin, cinnamon, ginger, salt, cream, milk, and eggs and whisk in maple syrup.",
        "Pour filling into shell and brush edge of shell with some egg wash. Bake pie in middle of oven 1 hour, or until filling is set but center still shakes slightly. (Filling will continue to set as pie cools.) Transfer pie to a rack to cool completely.",
        "Garnish pie with pastry leaves just before serving."
    ],
    "ingredients": [
        "2 recipes pastry dough",
        "an egg wash made by beating 1 large egg yolk with 1 teaspoon water",
        "1 cup Grade B maple syrup*",
        "2 cups canned solid-pack pumpkin",
        "1 teaspoon cinnamon",
        "1 teaspoon ground ginger",
        "1/2 teaspoon salt",
        "1 cup heavy cream",
        "2/3 cup milk",
        "2 large eggs",
        "*available at some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pumpkin",
        "Fall",
        "Chill",
        "Potluck",
        "Maple Syrup",
        "Gourmet"
    ],
    "title": "Maple Pumpkin Pie",
    "url": "http://www.epicurious.com/recipes/food/views/maple-pumpkin-pie-13429"
}
