{
    "directions": [
        "Place all ingredients, in order listed, into large bowl of heavy-duty mixer fitted with dough hook. Beat at low speed until dough is smooth, comes cleanly from sides, and climbs hook, adding more flour by 1/4 cupfuls if dough is very sticky, about 8 minutes. Scrape dough from hook. Cover bowl with plastic wrap and towel. Let rise in warm draft-free area until doubled in volume, about 1 1/2 hours.",
        "Butter 9x5x3-inch metal loaf pan. Butter sheet of plastic wrap. Scrape dough onto lightly floured surface. Knead until smooth, about 2 minutes. Shape into 8x3-inch log. Place in prepared pan; cover loosely with prepared plastic wrap, buttered side down. Let dough rise in warm draft-free area until center is 1 1/2 inches higher than pan, about 45 minutes. Preheat oven to 350°F. Gently pull plastic off dough. Place bread in oven; bake until deep golden and instant-read thermometer inserted into center registers 180°F, about 30 minutes. Cool in pan 15 minutes. Run small knife around bread; turn out of pan. Cool completely on rack. DO AHEAD: Can be made 4 days ahead. Wrap in foil; store at room temperature."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons warm water (105°F to 115°F)",
        "1 large egg",
        "2 tablespoons (1/4 stick) unsalted butter, room temperature",
        "1/4 cup pure maple syrup (preferably grade B)",
        "1/2 teaspoon maple extract",
        "2 cups unbleached all purpose flour",
        "2 cups whole wheat flour or white whole wheat flour",
        "1 cup old-fashioned oats",
        "1 teaspoon salt",
        "2 teaspoons quick-rising yeast"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Mixer",
        "Bake",
        "Low Fat",
        "Vegetarian",
        "High Fiber",
        "Oat",
        "Healthy",
        "Maple Syrup",
        "Whole Wheat"
    ],
    "title": "Maple-Oatmeal Sandwich Bread",
    "url": "http://www.epicurious.com/recipes/food/views/maple-oatmeal-sandwich-bread-241367"
}
