{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Sift flour, sugar, baking powder, and salt together into a large bowl.",
        "Make a well in the dry ingredients; place water, oil, egg yolks, vanilla extract, and maple extract into the well. Stir together with a wooden spoon, then beat until batter is smooth; stir in walnuts.",
        "Place egg whites in a large glass or metal bowl. Sprinkle egg whites with cream of tartar; beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks.",
        "Use a rubber spatula or wire whisk to fold 1/4 the beaten egg whites into the batter. Gently run the spatula through the center of the bowl, then around the sides of the bowl, repeating until fully incorporated; repeat folding with remaining egg whites, 1/4 at a time, folding just until incorporated. Turn the batter into an ungreased 9- or 10-inch tube pan. Cut through the batter with a knife to eliminate large air bubbles.",
        "Bake in the preheated oven until cake is golden, and a toothpick inserted into the center comes out clean, about 1 hour. Tip the pan upside down over a wire rack to cool, about 30 minutes. Run a knife around the edge of pan to remove the cake; cool completely, about 30 minutes.",
        "Beat instant pudding and milk together in a bowl; fold in whipped cream. Spread over cake."
    ],
    "ingredients": [
        "2 cups pastry flour",
        "1 1/2 cups white sugar",
        "1 tablespoon baking powder",
        "1 teaspoon salt",
        "3/4 cup lukewarm water",
        "1/2 cup vegetable oil",
        "5 egg yolks",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon maple-flavored extract",
        "1/2 cup finely chopped walnuts",
        "1 cup egg whites",
        "1/2 teaspoon cream of tartar",
        "1 (3.4 ounce) package instant butterscotch pudding mix",
        "1 cup milk",
        "2 cups whipped cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Maple Walnut Chiffon Cake",
    "url": "http://allrecipes.com/recipe/234022/maple-walnut-chiffon-cake/"
}
