{
    "directions": [
        "Preheat oven to 300°F. Line rimmed baking sheet with parchment paper. Whisk egg white in bowl until frothy, about 1 minute. Whisk in sugar and cinnamon. Fold in nuts. Spread mixture on prepared sheet. Bake until beginning to dry, about 12 minutes. Using metal spatula, stir to break up nuts. Continue to bake until nuts and coating are dry and golden brown, about 10 minutes; cool on sheet. Transfer streusel to work surface. Chop nuts into small (rice-size) bits. Transfer to shallow bowl.",
        "Whisk first 5 ingredients in medium bowl to blend. Using electric mixer, beat sugar and eggs in large bowl until very thick, about 3 minutes. Beat in orange peel and vanilla. Gradually beat in butter; beat in sour cream in 2 additions. Gently fold in dry ingredients in 4 additions (dough will be slightly sticky). Cover; set aside 1 hour.",
        "Combine powdered sugar and maple extract in medium bowl. Add 4 tablespoons cream; whisk until smooth. Whisk in additional cream, 1 teaspoon at a time, to form medium-thick glaze. Cover and let stand up to 3 hours.",
        "Sprinkle 2 rimmed baking sheets lightly with flour. Press out 1/3 of dough on lightly floured surface to 1/2- to 2/3-inch thickness. Using 2 1/2-inch-diameter round cutter, cut out dough rounds. Arrange on floured sheets. Repeat with remaining dough in 2 more batches. Gather all dough scraps. Press out dough; cut out more dough rounds until all dough is used.",
        "Using 1-inch-diameter round cutter, cut out center of each dough round to make doughnuts and doughnut holes.",
        "Line 2 baking sheets with several layers of paper towels. Pour oil into large deep skillet to depth of 1 1/2 inches. Attach deep-fry thermometer and heat oil to 365°F to 370°F. Fry doughnut holes in 2 batches until golden brown, turning once, about 2 minutes. Using slotted spoon, transfer to paper towels. Fry doughnuts, 3 or 4 at a time, until golden brown, about 1 minute per side. Using slotted spoon, transfer doughnuts to paper towels. Cool doughnuts and doughnut holes completely.",
        "Working with 1 doughnut at a time, spread glaze over 1 side, then dip glazed side into streusel. Arrange doughnuts, streusel side up, on rack. Let glaze set at least 30 minutes. Coat doughnut holes with same glaze and dip into streusel."
    ],
    "ingredients": [
        "1 large egg white",
        "1/4 cup sugar",
        "1 teaspoon ground cinnamon",
        "1 1/2 cups chopped walnuts (about 6 ounces)",
        "3 1/2 cups all purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon ground cinnamon",
        "1 teaspoon salt",
        "1/2 teaspoon baking soda",
        "1 cup sugar",
        "2 large eggs",
        "2 teaspoons (packed) finely grated orange peel",
        "1/2 teaspoon vanilla extract",
        "1/3 cup melted unsalted butter, cooled briefly",
        "1 cup sour cream",
        "2 cups powdered sugar",
        "1/4 teaspoon maple extract",
        "5 tablespoons (about) heavy whipping cream",
        "Canola oil (for deep-frying)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bake",
        "Fry",
        "Cinnamon",
        "Sour Cream",
        "Maple Syrup",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Maple-Glazed Sour Cream Doughnuts with Sugared-Walnut Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/maple-glazed-sour-cream-doughnuts-with-sugared-walnut-streusel-230925"
}
