{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and lightly flour two 8- or 9-inch round cake pans or one 9x13-inch cake pan.",
        "Reserve 1/4 cup maraschino cherry juice. Coarsely chop the cherries to make 1/2 cup. Set aside.",
        "Sift cake flour, baking powder, and 1/4 teaspoon of the salt and set aside.",
        "Beat shortening in a large bowl with an electric mixer on medium high speed for 30 seconds. Add the 1 1/3 cups white sugar and beat until well combined. Add the egg whites, one at a time, beating well after each.",
        "Combine 2/3 cup milk and reserved 1/4 cup cherry juice. Add the flour and milk mixture alternately to the shortening mixture, beating on low speed after each addition until just combined. Stir in the chopped cherries and nuts. Pour batter into prepared pans.",
        "In preheated oven until cake springs back when lightly touched with a finger or a tester comes out clean, 20 to 25 minutes for round cakes (or 30 to 35 minutes for a 9x13 inch pan). Cool cakes in pans on a wire rack for 10 minutes, then invert onto wire rack to cool completely.",
        "To make frosting: beat 3/4 cups butter in a large bowl till fluffy. Gradually add 3 cups sifted confectioners' sugar; beat well. Slowly beat in 1/3 cup milk, 1 1/2 teaspoons vanilla, and remaining 1/4 teaspoon salt. Gradually beat in the remaining 3 cups sifted confectioners' sugar. Beat in additional milk (1 to 2 tablespoons) if needed, to make frosting of spreading consistency. If desired, tint the frosting pink by adding 6 drops of red food coloring.",
        "Once cake is completely cool, frost with butter frosting and decorate with maraschino cherries with stems."
    ],
    "ingredients": [
        "1 (10 ounce) jar maraschino cherries",
        "2 1/4 cups sifted cake flour",
        "2 1/2 teaspoons baking powder",
        "1/2 teaspoon salt, divided",
        "1/2 cup shortening",
        "1 1/3 cups white sugar",
        "3 egg whites, room temperature",
        "2/3 cup milk, room temperature",
        "1/2 cup chopped pecans",
        "3/4 cup butter, room temperature",
        "6 cups sifted confectioners' sugar, divided",
        "1/3 cup milk",
        "6 drops red food coloring",
        "1 1/2 teaspoons vanilla extract",
        "12 maraschino cherries, with stems"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Maraschino Cherry Nut Cake",
    "url": "http://allrecipes.com/recipe/7330/maraschino-cherry-nut-cake/"
}
