{
    "directions": [
        "Place the butter in a mixing bowl, and beat with an electric mixer on high speed until smooth and creamy, about 2 minutes. Gradually beat in 2/3 cup of confectioners' sugar, then add almond extract, eggs, and salt, and beat until the mixture is fluffy and well combined, about 3 more minutes. Reduce mixer speed to medium, and gradually beat in flour until the dough is smooth, about 1 minute. Gently stir in the maraschino cherries.",
        "Form the dough into 2 logs about 1 inch in diameter, roll each log in plastic wrap or waxed paper, and refrigerate until thoroughly chilled, at least 2 hours.",
        "Preheat oven to 350 degrees F (175 degrees C). Line several baking sheets with parchment paper.",
        "Cut each dough log into about 25 slices about 1/2-inch thick, and place the cookies on the prepared baking sheets, leaving about 1/2 inch of space between each cookie.",
        "Bake in the preheated oven until the cookies are set but not browned, 12 to 14 minutes. Remove to cooling racks to cool to room temperature, about 15 minutes.",
        "To make icing, beat egg whites with lemon juice until frothy, about 1 minute, then beat in vanilla extract and confectioners' sugar, a cupful at a time, until the icing is smooth and spreadable. Spread about 1 teaspoon of icing on each cooled cookie, and let the icing harden before stacking."
    ],
    "ingredients": [
        "1 cup unsalted butter, at room temperature",
        "2/3 cup sifted confectioners' sugar",
        "1 1/2 teaspoons almond extract",
        "2 eggs, at room temperature",
        "1/8 teaspoon salt",
        "2 cups all-purpose flour",
        "2/3 cup chopped drained maraschino cherries",
        "Royal Icing:",
        "2 egg whites",
        "2 teaspoons lemon juice",
        "1/2 teaspoon vanilla extract",
        "3 cups sifted confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Maraschino Cherry Almond Cookies",
    "url": "http://allrecipes.com/recipe/212837/maraschino-cherry-almond-cookies/"
}
