{
    "directions": [
        "Blend flour, sugar and salt in processor. Add chilled butter and cut in using on/off turns until mixture resembles coarse meal. Add 2 tablespoons ice water and vanilla extract and process until moist clumps form, adding more water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into rectangle. Wrap dough in plastic and refrigerate at least 1 hour. (Can be prepared 2 days ahead. Let soften slightly at room temperature before rolling out.)",
        "Preheat oven to 375°F. Roll out dough on floured sheet of parchment paper to 16x8-inch rectangle. Transfer dough on paper to large baking sheet. Fold 1-inch border of dough over to form edge on all sides. Fold 1/2 inch of edge over on all sides again, forming thick raised edge; press slightly to adhere. Pierce crust and raised edges all over with fork. Freeze crust 15 minutes.",
        "Whisk egg yolk with 2 teaspoons whipping cream in small bowl. Brush egg glaze over crust edges. Bake crust 15 minutes. Brush edges again with egg glaze. Bake crust until golden brown and baked through, about 15 minutes longer. Cool crust completely on baking sheet.",
        "Bring 6 tablespoons cream to simmer in small saucepan. Remove from heat. Add bittersweet chocolate and whisk until melted and smooth. Let stand until cool, thick and spreadable, about 45 minutes. Spread chocolate over bottom of crust.",
        "Stir white chocolate and remaining 1 tablespoon cream in top of double boiler set over barely simmering water until melted and smooth. Remove from over water. Cool slightly. Drizzle over bittersweet chocolate in galette. Using tip of knife, swirl white chocolate into dark chocolate to marbleize. Let stand at room temperature until chocolate sets, at least 1 hour and up to 6 hours.",
        "Stir red currant jelly and 1 tablespoon water in small saucepan over medium heat until mixture boils. Remove from heat. Arrange strawberry halves in border around edge of chocolate filling. Brush some of jelly glaze over strawberries. (Can be made 3 hours ahead. Let stand at room temperature.) Slice galette crosswise. Garnish with fresh mint sprigs, if desired."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "1/4 cup sugar",
        "1/2 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch pieces",
        "2 tablespoons (or more) ice water",
        "1 teaspoon vanilla extract",
        "1 large egg yolk",
        "2 teaspoons whipping cream",
        "7 tablespoons whipping cream",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "2 ounces good-quality white chocolate (such as Lindt or Baker’s), finely chopped",
        "3 tablespoons red currant jelly",
        "1 tablespoon water",
        "2 1-pint baskets strawberries, hulled, halved lengthwise",
        "Fresh mint sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Strawberry",
        "Spring",
        "Jam or Jelly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Marbled Chocolate and Strawberry Galettes",
    "url": "http://www.epicurious.com/recipes/food/views/marbled-chocolate-and-strawberry-galettes-103301"
}
