{
    "directions": [
        "Make crumb crust with gingersnaps instead of graham crackers as directed in separate recipe. Preheat oven to 550°F.",
        "Beat together cream cheese, sugar, and flour with an electric mixer until smooth and add whole eggs, 1 at a time, then vanilla, beating on low speed until each ingredient is incorporated and scraping down bowl between additions. Transfer 2 1/2 cups filling to another bowl and beat yolks, spices, and pumpkin into remaining filling until smooth.",
        "Put springform pan with crust in a shallow baking pan. Pour half of pumpkin filling into crust, then half of plain. Repeat procedure with remaining fillings (springform pan will be completely full), drizzling the plain so that some of pumpkin filling is still visible. Gently swirl a small spoon once through batters in a figure-eight pattern without touching crust. Bake in baking pan (to catch drips) in middle of oven 12 minutes, or until puffed. Reduce temperature to 200°F and bake 30 minutes (do not open oven). Dome a piece of lightly oiled foil over cake and continue baking until mostly firm (center will still be slightly wobbly when pan is gently shaken), about 1 hour more.",
        "Run a knife around top edge of cake to loosen and cool completely in springform pan on a rack. Chill, loosely covered, at least 6 hours. Remove side of pan and transfer cake to a plate. Bring to room temperature before serving."
    ],
    "ingredients": [
        "1 crumb-crust",
        "1/2 made with finely ground gingersnaps",
        "3 (8-ounces) packages cream cheese, softened",
        "1 3/4 cups sugar",
        "3 tablespoons all-purpose flour",
        "5 large eggs",
        "1/2 teaspoon vanilla",
        "2 large egg yolks",
        "3/4 teaspoon ground cinnamon",
        "1/8 teaspoon ground ginger",
        "1/8 teaspoon ground allspice",
        "1/8 teaspoon freshly grated nutmeg",
        "15-ounce can solid-pack pumpkin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Cheese",
        "Dessert",
        "Bake",
        "Pumpkin",
        "Gourmet"
    ],
    "title": "Marbled Pumpkin Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/marbled-pumpkin-cheesecake-102593"
}
