{
    "directions": [
        "Place white chocolate and mint extract in a small bowl. Bring cream to a simmer in a small saucepan over medium heat.",
        "Meanwhile, whisk salt into egg yolks in a medium bowl. Gradually whisk hot cream into egg mixture until incorporated. Return to saucepan; cook over medium heat, stirring constantly, until custard is thick enough to coat spoon, about 4 minutes. (Scrape bottom of saucepan while you stir to keep eggs from curdling.) Pour custard over white chocolate; let sit a minute or two. Stir until chocolate is melted and mixture is smooth.",
        "Place chocolate in a small bowl. Bring cream and milk to a simmer in a small saucepan over medium heat.",
        "Meanwhile, whisk sugar and salt into egg yolks in a medium bowl. Gradually whisk hot cream mixture into egg mixture until incorporated. Return to saucepan; cook over medium heat, stirring constantly, until custard is thick enough to coat spoon, about 4 minutes. (Scrape bottom of saucepan while you stir to keep eggs from curdling.) Pour custard over chocolate; let sit a minute or two. Stir until chocolate is melted and mixture is smooth.",
        "Spoon a little chocolate custard into small glasses, then top with a little mint custard. Repeat layering until custard is evenly divided among glasses. Swirl with a skewer or the tip of a thin knife to marble, making sure to extend all the way to the sides of the glass. Let chill until cold, at least 2 hours.",
        "Serve pudding topped with cookies.",
        "Do ahead: Pudding can be made 3 days ahead. Cover and keep chilled."
    ],
    "ingredients": [
        "4 ounces white chocolate, chopped",
        "1/4 teaspoons mint extract",
        "1 cup heavy cream",
        "1/4 teaspoons kosher salt",
        "2 large egg yolks",
        "4 ounces bittersweet or semisweet chocolate, chopped",
        "1/2 cup heavy cream",
        "1/2 cup whole milk",
        "2 tablespoons sugar",
        "1/4 teaspoons kosher salt",
        "2 large egg yolks",
        "Chocolate cookies, broken into large pieces (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Kid-Friendly",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Marbled Mint-Chocolate Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/marbled-mint-chocolate-pudding-51263850"
}
