{
    "directions": [
        "For Crust: Preheat oven to 350° F. Mix crumbs, pecans and butter in medium bowl until well blended. Press mixture onto bottom and 1 1/2 inches up sides of 9-inch-diameter springform pan. Bake crust until set, about 8 minutes. Cool completely in pan on rack. Maintain oven temperature. For Filling: Puree sweet potatoes in processor. Measure 1 cup puree; reserve remainder for another use. Beat cream cheese, 1/2 cup sugar and vanilla in large bowl until blended. Add eggs 1 at a time, beating well and scraping down sides of bowl after each addition. Transfer 1 cup cream cheese filling to small bowl. Add remaining 1/4 cup sugar, sweet potato puree, cinnamon and nutmeg to filling in large bowl and mix until smooth. Pour half of sweet potato filling into crust. Drizzle with half of plain filling. Swirl knife through batters to create marbled effect. Repeat layering with remaining sweet potato filling, then remaining plain filling. Swirl batters with knife again. Bake cake until filling is set, about 45 minutes. Cool. Refrigerate overnight. (Can be made 2 days ahead. Keep refrigerated.) Using snall sharp knife, cut around cake and release pan sides. Cut into wedges and serve cold."
    ],
    "ingredients": [
        "1 1/2 cups gingersnap cookie crumbs",
        "1/2 cup (about 2 ounces) finely chopped pecans",
        "1/3 cup unsalted butter, melted",
        "1 16-ounce can sweet potatoes, well drained",
        "2 8-ounce packages light cream cheese, room temperature",
        "3/4 cup sugar",
        "1 teaspoon vanilla extract",
        "3 large eggs",
        "3/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cream Cheese",
        "Sweet Potato/Yam",
        "Fall",
        "South Carolina",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Marbled Sweet-Potato Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/marbled-sweet-potato-cheesecake-2599"
}
