{
    "directions": [
        "Preheat oven to 350°F. Butter 2-quart baking dish. Cook potatoes, turnips, parsnips and pear in large pot of boiling salted water until very tender, about 20 minutes. Drain. Return to pot. Stir over low heat until excess moisture evaporates, about 1 minute. Add cream and 5 tablespoons butter and mash until smooth. Season with salt and pepper.",
        "Meanwhile, cook carrots in another large pot of boiling salted water until tender, about 15 minutes. Drain. Transfer to processor. Add 2 tablespoons butter and 1/8 teaspoon nutmeg and puree until smooth. Season with salt and pepper.",
        "Alternate potato and carrot purees by 1/2 cupfuls in baking dish. Draw knife through purees to marbleize. Melt 1 tablespoon butter. Drizzle over purees. Sprinkle with additional nutmeg. Cover with foil. (Can be made 1 day ahead; chill.) Bake covered puree until heated through, about 35 minutes (or 45 minutes if chilled)."
    ],
    "ingredients": [
        "2 pounds russet potatoes (about 3 large), peeled, cut into 2-inch pieces",
        "8 ounces turnips (about 2 medium), peeled, cut into 2-inch pieces",
        "8 ounces parsnips, peeled, cut into 1-inch pieces",
        "1 medium pear (about 6 ounces), peeled, cored, cut into 1-inch pieces",
        "1/2 cup whipping cream",
        "8 tablespoons (1 stick) butter",
        "1 1/2 pounds carrots (about 6 large), peeled, cut into 1-inch pieces",
        "1/8 teaspoon ground nutmeg",
        "Additional ground nutmeg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Potato",
        "Side",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Pear",
        "Carrot",
        "Parsnip",
        "Turnip",
        "Christmas Eve",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Marbleized Root Vegetable Purée",
    "url": "http://www.epicurious.com/recipes/food/views/marbleized-root-vegetable-puree-2755"
}
