{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Spray 9-inch springform pan with 2 3/4-inch-high sides with vegetable oil spray. Mix graham cracker crumbs and butter in medium bowl until blended. Press crumbs over bottom and 1 inch up sides of prepared pan. Refrigerate crust.",
        "Using electric mixer, beat cheese in large bowl until fluffy. Beat in sour cream, then sugar, triple sec, tequila and lime juice. Beat in eggs.",
        "Pour filling into crust. Bake until outside 2 inches are set and center moves only slightly when pan is shaken, about 50 minutes. Remove from oven; turn off oven.",
        "Whisk sour cream, lime juice and sugar in small bowl to blend. Spread evenly over cheesecake. Return cheesecake to hot oven. Let stand 45 minutes or less (Cheesecake will look very soft, but will set up when chilled.) Refrigerate cake until well chilled, up to 1 day.",
        "Run knife around pan sides. Remove pan sides. Place cake on platter. Arrange lime half-slices and peel around top edge of cheesecake."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 1/4 cups graham cracker crumbs",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "3 8-ounce",
        "1 1/4 cups light sour cream",
        "3/4 cup plus 2 tablespoons sugar",
        "2 1/2 tablespoons triple sec or other orange liqueur",
        "2 1/2 tablespoons tequila",
        "2 1/2 tablespoons fresh lime juice",
        "4 large eggs",
        "3/4 cup light sour cream",
        "1 tablespoon fresh lime juice",
        "1 tablespoon sugar",
        "Very thin lime slices, cut in half",
        "Very thin lime peel strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Tequila",
        "Cheese",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Lime",
        "Summer",
        "Massachusetts"
    ],
    "title": "Margarita Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/margarita-cheesecake-287"
}
