{
    "directions": [
        "Prepare a hot fire in a grill and preheat a grill-top pizza stone for at least 30 minutes, until the thermometer on the stone registers 500ºF (260ºC). Alternatively, preheat a Pizzeria Pronto outdoor pizza oven on high heat for 20 minutes.",
        "In a bowl, combine the tomatoes and the 1 Tbs. olive oil.",
        "On a lightly floured surface, roll out one of the pizza dough balls into a 10-inch (25-cm) round and transfer to a flour-dusted pizza peel. Spread half of the tomato sauce evenly on the dough, leaving a 1/2-inch (12-mm) border uncovered. Sprinkle with half of the Parmigiano-Reggiano cheese and dot with half of the mozzarella.",
        "If grilling the pizza, using a pizza peel, carefully slide the pizza onto the preheated pizza stone. Cover the grill and cook for 3 to 5 minutes. Uncover the grill and turn the pizza 180 degrees. Cover the grill and continue to cook until the crust is golden brown and the cheese is melted, 5 to 7 minutes more.",
        "If using the Pizzeria Pronto pizza oven, transfer the pizza to the oven and reduce the heat to medium-high. Bake until the crust is golden brown and the cheese is melted, 6 to 7 minutes, turning the pizza 180 degrees halfway through cooking.",
        "Using the pizza peel, transfer the pizza to a cutting board. Drizzle lightly with olive oil and top with basil leaves. Cut into slices and serve immediately. Repeat with the remaining ingredients. Makes two 10-inch (25-cm) pizzas.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "2/3 cup (5 1/2 oz./170 g) crushed plum tomatoes",
        "1 Tbs. extra-virgin olive oil, plus more for drizzling",
        "1 batch Food-Processor Pizza Dough, divided into 2 balls",
        "1/2 cup (2 oz./60 g) grated Parmigiano-Reggiano cheese",
        "4 oz. (125 g) fresh mozzarella, torn into bite-sized pieces",
        "Fresh basil leaves, torn into pieces, for topping"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Margherita Pizza",
    "url": "http://www.williams-sonoma.com/recipe/margherita-pizza.html"
}
