{
    "directions": [
        "In a small saucepan bring marinade ingredients to a boil stirring until sugar is dissolved and cool.",
        "Preheat oven to 400°F.",
        "Wrap beets tightly in foil and roast in middle of oven 1 to 1 1/2 hours, or until tender. In a large saucepan of boiling salted water cook carrots until crisp-tender, 6 to 7 minutes, and transfer with a slotted spoon to a bowl.",
        "Unwrap beets carefully and cool. Slip off beet skins and slice beets, transferring to another bowl. Divide marinade between beets and carrots, combining well, and marinate, covered and chilled, at least 4 hours.",
        "In a saucepan of boiling carrot-cooking water cook beans until crisp- tender, 5 to 6 minutes, and drain in a colander. Rinse beans well under cold water and pat dry between paper towels. Vegetables may be prepared up to this point 1 day ahead and chilled, covered.",
        "In a bowl whisk together mustard, vinegar, water, sugar, and salt and add oil in a stream, whisking until dressing is emulsified. Whisk in dill.",
        "Just before serving, toss beans in a bowl with 2 tablespoons dressing and drain beets and carrots. Arrange vegetables decoratively on a platter and drizzle with remaining dressing."
    ],
    "ingredients": [
        "2/3 cup white-wine vinegar",
        "2/3 cup water",
        "1 1/2 tablespoons sugar",
        "2 teaspoons dill seed",
        "2 garlic cloves, forced through a garlic press",
        "1 teaspoon salt",
        "2 pounds beets, scrubbed and trimmed, leaving about 1 inch of stems attached",
        "2 pounds carrots, cut crosswise into 3 sections and each section quartered lengthwise",
        "2 pounds green beans, cut into 1 1/2-inch pieces",
        "3 tablespoons Dijon mustard",
        "2 tablespoons white-wine vinegar",
        "1 tablespoon water",
        "1 tablespoon sugar",
        "3/4 teaspoon salt",
        "1/3 cup olive oil",
        "3 tablespoons finely chopped fresh dill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Mustard",
        "Low Cal",
        "Green Bean",
        "Beet",
        "Carrot",
        "Dill",
        "Gourmet"
    ],
    "title": "Marinated Vegetables with Mustard Dill Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/marinated-vegetables-with-mustard-dill-dressing-10822"
}
