{
    "directions": [
        "Using a long-handled fork char the peppers over an open flame, turning them, for 2 to 3 minutes, or until the skins are blackened. (Or broil the peppers on the rack of a broiler pan under a preheated broiler about 2 inches from the heat, turning them every 5 minutes, for 15 to 25 minutes, or until the skins are blistered and charred.) Transfer the peppers to a bowl and let them steam, covered, until they are cool enough to handle. Keeping the peppers whole, peel them starting at the blossom end, cut the tops, and discard the seeds and ribs. (Wear rubber gloves when handling chilies.)",
        "In a bowl or resealable heavy plastic bag combine the mozzarella, the oil, the garlic, the vinegar, the orégano, the basil, the thyme, and salt and pepper to taste and let the cheese marinate for at least 4 hours at room temperature or chilled overnight. Thread a mozzarella cube, an olive half, and a roasted pepper square onto each of the wooden picks and arrange the brochettes on a platter. The hors d'oeuvres may be made 4 hours in advance and kept covered."
    ],
    "ingredients": [
        "3/4 pound fresh or smoked mozzarella,cut into1/2-inch cubes (about 2 cups)",
        "1/4 cup virgin olive oil",
        "1 garlic clove, minced",
        "1 tablespoon white-wine vinegar",
        "1/2 teaspoon dried orégano, crumbled",
        "1/2 teaspoon dried basil, crumbled",
        "1/4 teaspoon dried thyme, crumbled",
        "1/2 pound (about 25) brine-cured black olives, halved and pitted",
        "2 large red bell peppers, roasted (procedure follows) and cut into 3/4-inch squares",
        "about 50 wooden picks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Olive",
        "Cocktail Party",
        "Vinegar",
        "Mozzarella",
        "Bell Pepper",
        "Gourmet"
    ],
    "title": "Marinated Mozzarella, Roasted Bell Pepper, and Olive Brochettes",
    "url": "http://www.epicurious.com/recipes/food/views/marinated-mozzarella-roasted-bell-pepper-and-olive-brochettes-12362"
}
