{
    "directions": [
        "In a large deep skillet heat 1 inch of the vegetable oil to 375°F. and in it fry the potatoes, peeled, halved lengthwise, and cut crosswise 1/4 inch thick, in 2 batches for 8 minutes, or until they are golden brown. Transfer the potatoes with a slotted spoon to paper towels to drain and sprinkle them with salt to taste. In a small bowl combine the fish with the milk. Put the seasoned flour in a bowl, remove the fish strips from the milk, letting the excess drip off, and dredge them, a few at a time, in the flour, shaking off the excess. Reheat the vegetable oil to 375°F., in it fry the fish in 2 batches for 3 to 5 minutes, or until it is golden brown, and transfer it with a slotted spoon to paper towels to drain. In a large baking dish combine the fish and the potatoes.",
        "In a large skillet cook the garlic in the olive oil over moderate heat, stirring, until it is golden, add the onion, the bell pepper, and the orégano, and cook the mixture over moderately low heat, stirring, for 5 minutes. Add the wine, the vinegar, the sugar, and salt and black pepper to taste, boil the liquid for 2 minutes, and pour the mixture over the fish and potatoes. Chill the mixture, covered, for at least 8 hours or overnight. Let the mixture stand at room temperature for 30 minutes before serving."
    ],
    "ingredients": [
        "vegetable oil for frying the potatoes and the fish",
        "2 russet (baking) potatoes",
        "1 pound skinless flounder or orange roughy fillets, cut into 2- by 1/2-inch strips",
        "1/3 cup milk",
        "all-purpose flour seasoned with salt and pepper for dredging the fish",
        "4 garlic cloves, halved",
        "1/4 cup olive oil",
        "2 1/2 cups thinly sliced red onion",
        "1 green bell pepper, cut into thin rings",
        "1/2 teaspoon dried orégano",
        "3/4 cup dry white wine",
        "1/2 cup white-wine vinegar",
        "1 teaspoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Onion",
        "Potato",
        "Fry",
        "Bell Pepper",
        "Chill",
        "Gourmet"
    ],
    "title": "Marinated Fried Fish Strips and Potatoes with Onions and Green Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/marinated-fried-fish-strips-and-potatoes-with-onions-and-green-peppers-10412"
}
