{
    "directions": [
        "Heat olive oil in a large skillet over medium heat, and cook the onions and garlic until the onions are translucent, about 5 minutes. Pour in water, then whisk in the cream of mushroom soup and chicken granules until the mixture is smooth. Bring to a boil, then stir in potatoes, celery, carrot, and green peas; reduce heat, and simmer until thickened, 30 minutes to an hour. Stir in turkey, then simmer for another 30 minutes.",
        "Place an oven rack at the top position of the oven, and preheat oven to 400 degrees F (200 degrees C).",
        "Whisk the flour, baking powder, salt, basil, and oregano together in a bowl. Cut in the butter with a pastry cutter or fork until the mixture resembles coarse crumbs; mix in the milk and egg to make a soft dough. Turn the dough out onto a floured work surface, and knead until smooth, then roll out to a 9-inch round crust. Spoon the turkey filling into an 8-inch pie dish, and top the pie with the crust. Pinch the crust down at the edges around the pie dish, then cut several vents into the top of the pie.",
        "Bake in the preheated oven on the top rack until the filling is bubbling and the crust is golden brown, about 15 minutes."
    ],
    "ingredients": [
        "1 teaspoon olive oil",
        "1/2 cup chopped onion",
        "1 clove garlic, minced, or to taste",
        "1 1/4 cups water",
        "1 (10.75 ounce) can condensed cream of mushroom soup",
        "2 tablespoons chicken bouillon granules",
        "2 potatoes, peeled and cubed",
        "1/2 cup chopped celery",
        "1 cup peeled chopped carrot",
        "1/2 cup frozen green peas, thawed",
        "1 1/2 cups cubed cooked turkey",
        "2 cups all-purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon salt",
        "1/4 teaspoon dried basil (optional)",
        "1/4 teaspoon dried oregano (optional)",
        "1/2 cup cold butter",
        "3/4 cup milk, or as needed",
        "1 egg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Marie-Eve's Turkey Pot Pie",
    "url": "http://allrecipes.com/recipe/215456/marie-eves-turkey-pot-pie/"
}
