{
    "directions": [
        "Bring stock to a simmer in a stockpot over medium-low heat. Stir crushed saffron into the simmering stock.",
        "Heat olive oil in a paella pan over medium heat. Fry chicken thighs in hot oil until lightly browned, 3 to 5 minutes per side. Add onion and garlic; cook and stir until the onion is translucent, 5 to 7 minutes more. Arrange the chorizo into the pan around the chicken thighs and cook until warmed, 3 to 5 minutes per side.",
        "Pour rice into the paella pan and stir to coat with oil; season with sweet paprika. Stir grated tomato into the rice and cook until the tomato is warmed, 2 to 3 minutes.",
        "Pour chicken stock into the paella pan and bring to a boil while scraping any browned bits of food off the bottom of the pan with a flat-edged wooden spoon. Smooth surface of rice with the wooden spoon in an even layer so it cooks evenly.",
        "Reduce heat to medium-low and continue to cook, without stirring, until the rice has softened but has yet to completely absorb the stock, 15 to 30 minutes.",
        "Place clams and mussels, hinged-side down, into the rice; continue simmering until the mussels and clams open, 5 to 7 minutes.",
        "Nestle prawns into the rice; add bell pepper and peas. Continue cooking until the bottom of the rice is browned and fragrant, about 10 minutes. Remove from heat and cool 5 to 10 minutes. Season with salt and pepper, sprinkle parsley over the paella, and garnish with lemon wedges. Serve with baguette slices."
    ],
    "ingredients": [
        "4 cups chicken stock",
        "20 saffron threads, crushed",
        "3/4 cup olive oil",
        "4 chicken thighs",
        "1 cup chopped onion",
        "4 cloves garlic, minced",
        "4 links chorizo de bilbao (spicy Spanish semi-cured sausage)",
        "2 cups Spanish paella rice",
        "2 teaspoons Spanish sweet paprika",
        "1/2 cup grated peeled roma (plum) tomatoes",
        "8 clams in shell, scrubbed, or more to taste",
        "8 mussels, cleaned and debearded, or more to taste",
        "8 prawns, peeled and deveined (leave tails)",
        "3 red bell peppers, cut into strips",
        "10 ounces peas",
        "salt and ground black pepper to taste",
        "1/2 cup chopped fresh Italian parsley",
        "8 wedges lemon",
        "1 baguette, sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Maria's Classic Paella",
    "url": "http://allrecipes.com/recipe/236902/marias-classic-paella/"
}
