{
    "directions": [
        "Combine first 5 ingredients in spice grinder and process until finely ground. Transfer to blender. Add parsley and next 4 ingredients to blender. With blender running, gradually add oil and blend until coarse puree forms. Season to taste with salt. Do ahead Charmoula can be made 1 day ahead. Transfer to bowl and refrigerate. Let stand at room temperature 1 hour before using.",
        "Place fish on large plate. Pour 3/4 cup charmoula over fish, turning to coat. Cover and refrigerate fish at least 1 hour and up to 1 day. Cover and refrigerate remaining charmoula to use as dressing for salad.",
        "Char bell peppers directly over gas flame or in broiler until blackened on all sides.",
        "Transfer to paper bag and seal tightly; let stand 15 minutes. Peel, seed, and chop peppers. Toast flatbreads directly over gas flame or in broiler until crisp and charred in spots on both sides. When cool enough to handle, tear into bite-size pieces.",
        "Preheat oven to 400°F. Place peppers, torn bread pieces, chickpeas, and next 4 ingredients in large bowl. Add 3/4 cup reserved charmoula; toss to coat. Season with salt and pepper.",
        "Heat olive oil in large ovenproof nonstick skillet over medium-high heat. Add fish with marinade still clinging to surface and cook until brown, about 3 minutes per side. Transfer skillet to oven and roast fish until cooked through, about 8 minutes.",
        "Divide Moroccan salad among 6 plates. Top each portion with sturgeon fillet and serve."
    ],
    "ingredients": [
        "1 tablespoon fennel seeds",
        "2 teaspoons coarsely chopped fresh rosemary",
        "1 teaspoon cumin seeds",
        "1 teaspoon dried crushed red pepper",
        "1 teaspoon whole white peppercorns",
        "1 cup coarsely chopped fresh parsley leaves",
        "1 cup coarsely chopped fresh cilantro leaves",
        "1/3 cup chopped fresh mint",
        "1/4 cup fresh lemon juice",
        "3 garlic cloves, chopped",
        "1 cup olive oil",
        "6 (6- to 7-ounce) sturgeon fillets or steaks",
        "2 large red bell peppers",
        "2 flatbreads (such as pita bread)",
        "1 15 1/2-ounce can chickpeas, drained",
        "1 cup diced seeded peeled cucumber",
        "1/2 cup walnuts, toasted, coarsely chopped",
        "1/4 cup raisins",
        "2 tablespoons drained capers",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Citrus",
        "Fish",
        "Garlic",
        "Herb",
        "Marinate",
        "Roast",
        "High Fiber",
        "Raisin",
        "Walnut",
        "Cucumber",
        "Chickpea",
        "Bell Pepper",
        "Capers",
        "Seed"
    ],
    "title": "Marinated Sturgeon with Moroccan Chickpea Salad",
    "url": "http://www.epicurious.com/recipes/food/views/marinated-sturgeon-with-moroccan-chickpea-salad-236887"
}
