{
    "directions": [
        "Whisk garlic, oil, vinegar, thyme, red pepper flakes, 1 tsp. salt, and 1/2 tsp. black pepper in a medium bowl. Transfer mixture to a resealable container or plastic bag and add scallions, tomatoes, and mushrooms. Marinate until ready to cook, at least 15 minutes.",
        "If using wooden skewers or branches, soak them in water at least 10 minutes. Skewer scallions, tomatoes, and mushrooms, dividing evenly and leaving about 4 inches of empty skewer at the bottom. Reserve leftover marinade.",
        "Prepare a campfire for medium heat. When it's ablaze, carefully place skewers vertically in the ground around the fire; they should be close enough to the flames that the ingredients begin sizzling within a few seconds. Cook, rotating skewers occasionally, until scallions, tomatoes, and mushrooms are caramelized or charred in spots and mushrooms are tender, 10–15 minutes.",
        "Transfer skewers to plates, season with salt and black pepper, drizzle with reserved marinade, and serve.",
        "Vegetables can be marinated and chilled up to 1 day in advance."
    ],
    "ingredients": [
        "2 garlic cloves, finely chopped",
        "1/2 cup extra-virgin olive oil",
        "1/4 cup red wine or Sherry vinegar",
        "3 tablespoons chopped fresh thyme and/or rosemary leaves",
        "Large pinch of crushed red pepper flakes",
        "1 teaspoon kosher salt, plus more to taste",
        "1/2 teaspoon freshly ground black pepper, plus more to taste",
        "6 scallions, cut crosswise into 2-inch pieces",
        "1 pint cherry tomatoes",
        "1 pint cremini, button, or other small mushrooms",
        "4–6 long wooden or metal skewers, or 4–6 long live branches whittled down to sharpened sticks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Tomato",
        "Side",
        "Kid-Friendly",
        "Summer",
        "Grill/Barbecue",
        "Green Onion/Scallion",
        "Sugar Conscious",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Marinated Mushroom, Tomato, and Scallion Skewers",
    "url": "http://www.epicurious.com/recipes/food/views/marinated-mushroom-tomato-and-scallion-skewers-56389758"
}
