{
    "directions": [
        "In a kettle stir together the lemon juice, the oil, the broth, the garlic, the red pepper flakes, the salt, the coriander seeds, the thyme, orégano, the sugar, and pepper to taste, bring the mixture to a boil, and simmer it, stirring occasionally, for 5 minutes. Bring the mixture to a boil, add the leeks, and simmer them for 2 minutes. Add the squash and the celery and simmer the vegetables, stirring gently, for 2 minutes. Add the bell peppers and the green beans and simmer the vegetables, stirring gently, for 2 minutes. Add the mushrooms and simmer the vegetables, stirring gently, for 30 seconds.",
        "Transfer the vegetables with a slotted spoon to a shallow baking dish or bowl, boil the cooking liquid for 2 minutes, or until it is reduced to 1/2 cup, and strain it through a fine sieve onto the vegetables. Let the vegetables marinate, covered and chilled, for at least 3 hours or overnight, season them with salt and pepper, and let them come to room temperature before serving."
    ],
    "ingredients": [
        "1/3 cup fresh lemon juice",
        "1/2 cup olive oil",
        "2 cups chicken broth",
        "3 garlic cloves, crushed lightly with the flat side of a knife",
        "a pinch of dried hot red pepper flakes, or to taste",
        "3/4 teaspoon salt, or to taste",
        "2 teaspoons coriander seeds",
        "2 fresh thyme sprigs or 1/4 teaspoon dried thyme, crumbled",
        "2 fresh oregano sprigs or 1/4 teaspoon dried oregano, crumbled",
        "1 teaspoon sugar",
        "2 leeks (about 1/2 pound), trimmed, washed well, and cut crosswise  into 1-inch pieces",
        "1 yellow squash, trimmed, halved lengthwise, and cut crosswise into  1-inch pieces",
        "4 ribs of celery, trimmed and cut into 1-inch pieces",
        "2 red bell peppers, cut into 1-inch pieces",
        "1/4 pound green beans, trimmed and cut into 1-inch pieces",
        "1/2 pound mushrooms, halved if large and the stems reserved for  another use"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Mushroom",
        "Vegetable",
        "Side",
        "Marinate",
        "Lemon",
        "Leek",
        "Green Bean",
        "Spring",
        "Healthy",
        "Simmer",
        "Gourmet"
    ],
    "title": "Marinated Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/marinated-vegetables-11772"
}
