{
    "directions": [
        "Simmer raisins in vinegar in a small saucepan until raisins are plump, 3 to 5 minutes, then cool.",
        "Cook onion in 1 tablespoon oil in a 12-inch nonstick skillet over moderate heat, stirring occasionally, until softened, 4 to 6 minutes. Remove skillet from heat and transfer half of onion to a 9-inch square glass or ceramic baking dish with a slotted spoon, spreading evenly. Reserve remaining onion.",
        "Cut fish into 6 equal pieces. Pat dry and season with salt and pepper. Spread potato starch on a plate and dredge fish in it, shaking off excess.",
        "Heat remaining 1 1/2 tablespoons oil in skillet over moderately high heat until hot but not smoking, then sauté fish, skin sides down, until lightly browned, 1 1/2 to 3 minutes. Turn fish over and sauté until lightly browned and just cooked through, 1 1/2 to 3 minutes more.",
        "Arrange fish on top of onion in baking dish, then top with reserved onion and drizzle with raisins and vinegar. Cool completely, then marinate, covered and chilled, at least 8 hours. Bring to room temperature.",
        "Tear enough fennel fronds to measure 1 tablespoon. Trim stalks flush with bulb and discard stalks. Quarter bulb lengthwise, then cut lengthwise into paper-thin slices with a mandoline or other manual slicer. Transfer slices to a bowl and toss with radish sprouts.",
        "Whisk together vinegar and oil, then whisk in sugar and salt and pepper to taste. Toss vegetables with half of dressing and divide among 6 plates.",
        "Remove onion from top of fish, reserving it, and put a piece of fish on top of each salad. Mound all of onion and raisins on top of fish, then drizzle with remaining dressing and sprinkle with fennel fronds."
    ],
    "ingredients": [
        "2 tablespoons golden raisins",
        "1/2 cup white balsamic vinegar, or 1/2 cup cider vinegar mixed with 2 tablespoons sugar",
        "1 medium red onion, thinly sliced crosswise",
        "2 1/2 tablespoons olive oil",
        "1 (1-pound) piece halibut fillet with skin (about 1 1/2 inches thick) or 2 (8-ounce) red snapper fillets with skin",
        "2 tablespoons potato starch",
        "1 large fennel bulb (sometimes called anise) with fronds",
        "2 1/2 ounce radish sprouts or watercress sprigs, trimmed (2 cups)",
        "2 tablespoons white balsamic vinegar, or 2 tablespoons cider vinegar mixed with 1 1/2 teaspoons sugar",
        "1/4 cup olive oil",
        "1/4 teaspoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fish",
        "Leafy Green",
        "Vegetable",
        "Marinate",
        "Sauté",
        "Passover",
        "Vinegar",
        "Raisin",
        "Halibut",
        "Fennel",
        "Radish",
        "Spring",
        "Healthy",
        "Kosher",
        "Gourmet"
    ],
    "title": "Marinated Halibut on Radish Sprout and Fennel Salad",
    "url": "http://www.epicurious.com/recipes/food/views/marinated-halibut-on-radish-sprout-and-fennel-salad-104875"
}
