{
    "directions": [
        "Cut eggplant into 1 inch chunks. Thread eggplant and mushrooms onto 8 wooden or metal skewers.  Place vegetable skewers in a nonporous, shallow dish, and spoon the marinade over everything. Cover, and refrigerate for at least 2 hours.",
        "To make marinade: Mix together ground cumin, ground coriander, grated ginger, and 2 cloves crushed garlic in a large skillet or wok. Stir over high heat until fragrant. Remove from heat, and stir in soy sauce, oil, and lemon juice.",
        "To make peanut sauce: In a food processor, grind cumin seeds, coriander seeds, and 3 cloves garlic. Combine with onion, lemon juice, salt, chili powder, coconut milk, and peanut butter in a small saucepan. Stir in water.  Simmer over medium low heat until it becomes a thick sauce.  Transfer peanut sauce to a serving bowl.",
        "Preheat grill to medium heat and lightly oil grate.",
        "Remove skewers from marinade, and place on grill.  Cook for about 10 to 15 minutes, or until vegetables are tender.  Serve immediately with peanut sauce."
    ],
    "ingredients": [
        "2 medium eggplants",
        "8 ounces crimini mushrooms, sliced",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander seed",
        "1 tablespoon fresh ginger root",
        "2 cloves crushed garlic",
        "4 tablespoons soy sauce",
        "8 tablespoons sunflower seed oil",
        "2 tablespoons lemon juice",
        "1/2 teaspoon cumin seeds",
        "1/2 teaspoon coriander seeds",
        "3 cloves garlic",
        "2 tablespoons chopped onion",
        "1 tablespoon lemon juice",
        "1 teaspoon salt",
        "1/4 teaspoon chili powder",
        "1/2 cup coconut milk",
        "1 cup crunchy peanut butter",
        "1 cup water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Marinated Mushroom and Eggplant with Peanut Sauce",
    "url": "http://allrecipes.com/recipe/14579/marinated-mushroom-and-eggplant-with/"
}
