{
    "directions": [
        "Chop tomatoes in processor. Heat oil in heavy medium saucepan over medium heat. Add garlic and cook until soft (do not brown), about 1 1/2 minutes. Stir in tomato paste, then tomatoes, basil and salt. Simmer until sauce thickens, stirring occasionally, about 30 minutes. Set aside.",
        "Beat ricotta in medium bowl until smooth and creamy. Mix in 1 cup Romano cheese, eggs, prosciutto and minced fresh parsley.",
        "Mix eggs and water in blender. Add flour and blend batter until smooth. Let stand 30 minutes. (Can be prepared 1 day ahead. Cover and refrigerate. Bring to room temperature before continuing.)",
        "Heat crepe pan or heavy small skillet over medium-high heat. Brush pan lightly with olive oil. Remove pan from heat. Stir batter and ladle 2 tablespoons into corner of pan, tilting so batter just coats bottom. Return excess batter to bowl. Cook crepe until bottom is set (do not brown), about 5 seconds. Loosen edges with knife. Turn crepe and cook until second side is set (do not brown), about 5 seconds. Repeat with remaining batter, stirring occasionally. (Can be prepared ahead. Layer crepes between sheets of waxed paper and cool completely. Wrap tightly and refrigerate 3 days or freeze 1 month. Bring to room temperature before using.)",
        "Preheat oven to 350°F. Spoon 2 1/2 tablespoons filling down center of crepe. Place 1 mozzarella strip atop filling. Fold both sides of crepe over filling. Arrange seam side down in large baking dish. Repeat with remaining filling and crepes. (Can be prepared ahead. Cover crepes and sauce separately and refrigerate 1 day or freeze up to 2 weeks. Bring crepes to room temperature before baking. Rewarm sauce over low heat, stirring occasionally.)",
        "Stir whole basil leaves into sauce. Pour sauce over crepes. Sprinkle lightly with additional Romano cheese. Cover tightly with foil. Bake until heated through, about 35 minutes."
    ],
    "ingredients": [
        "2 pounds tomatoes, peeled, seeded",
        "2 tablespoons olive oil",
        "3 large garlic cloves, chopped",
        "1 6-ounce can tomato paste",
        "5 fresh basil leaves, cut julienne",
        "1 teaspoon salt",
        "1 1/2 cups whole milk ricotta cheese",
        "1 cup freshly grated Romano cheese",
        "2 eggs, beaten to blend",
        "1/4 pound prosciutto, coarsely chopped",
        "2 tablespoons minced fresh Italian parsley",
        "16 Manicotti Crepes",
        "6 ounces mozzarella cheese, cut into 1/4x1/4x3-inch strips",
        "5 fresh basil leaves",
        "Additional freshly grated Romano",
        "Store extra in the freezer for another use.",
        "Makes about 26",
        "3 eggs",
        "1 cup water",
        "1 1/2 cups unbleached all purpose flour",
        "Olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Food Processor",
        "Cheese",
        "Tomato",
        "Bake",
        "Mozzarella",
        "Ricotta",
        "Basil",
        "Prosciutto",
        "California"
    ],
    "title": "Marilyn's Manicotti",
    "url": "http://www.epicurious.com/recipes/food/views/marilyns-manicotti-1409"
}
