{
    "directions": [
        "Whisk wine, soy sauce, garlic, and 1 teaspoon dry mustard in large glass baking dish. Add tri-tip and turn to coat with marinade. Let stand at room temperature 30 minutes, turning meat occasionally.",
        "Meanwhile, whisk honey, 2 tablespoons water, 1/4 teaspoon salt, and remaining 2 tablespoons dry mustard in small bowl to blend; set sauce aside.",
        "Preheat oven to 450°F. Remove tri-tip from marinade; pat dry with paper towels. Place tri-tip on large rimmed baking sheet; sprinkle with salt and pepper. Arrange green onions and mushrooms around meat; drizzle onions and mushrooms with olive oil. Roast 12 minutes. Turn meat, onions, and mushrooms over; roast until vegetables are tender and instant-read thermometer inserted into center of meat registers 125°F for medium-rare, about 12 minutes longer.",
        "Place mushrooms and green onions on platter. Cut meat into 1/4-inch-thick slices; arrange atop green onions and mushrooms. Pour any pan juices over. Drizzle lightly with mustard sauce. Serve, passing remaining mustard sauce alongside."
    ],
    "ingredients": [
        "1/3 cup dry red wine",
        "2 tablespoons soy sauce",
        "3 garlic gloves, minced",
        "1 teaspoon plus 2 tablespoons dry mustard",
        "1 1 1/2-pound beef tri-tip roast",
        "2 tablespoons honey",
        "2 tablespoons water",
        "1/4 teaspoon salt",
        "3 bunches green onions, root ends trimmed, dark green tops cut off and discarded",
        "1 pound or three 6-ounce packages baby portobello mushrooms",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Mushroom",
        "Mustard",
        "Onion",
        "Roast",
        "Father's Day",
        "Dinner",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Marinated Tri-Tip with Chinese Mustard Sauce and Roasted Green Onions and Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/marinated-tri-tip-with-chinese-mustard-sauce-and-roasted-green-onions-and-mushrooms-237321"
}
