{
    "directions": [
        "Preheat an oven to 400 degrees F (200 degrees C).",
        "Fill a 9x13-inch baking dish with 1/2-inch of water. Place the acorn squash halves cut-side-down into the dish; place the yam pieces around the squash. Cover tightly with aluminum foil.",
        "Bake in the preheated oven until the acorn squash and yam is tender, about 45 minutes.",
        "Meanwhile, combine the balsamic vinegar, apricot jam, and pomegranate juice in a saucepan. Stir in the roasted pepper, garlic, ginger, and five-spice powder. Bring to a boil over medium-high heat, then reduce heat to medium-low, and simmer until the sauce has reduced to half of its original volume, about 15 minutes. Whisk in the rice flour and coconut milk. Return to a simmer, and cook 10 minutes longer. Keep warm.",
        "When the squash is tender, drain off the water and place the yams in a mixing bowl. Scrape the squash into the bowl, and mash with the yams until smooth. Add the roasted pepper sauce, and continue mashing until well combined. Scrape into a serving dish, and sprinkle with chopped walnuts. Garnish with pomegranate seeds and fresh basil to serve."
    ],
    "ingredients": [
        "1 acorn squash, halved and seeded",
        "1 large yam, peeled and cut into 2-inch pieces",
        "1 cup balsamic vinegar",
        "1/2 cup apricot jam",
        "1/4 cup pomegranate juice (optional)",
        "1 (12 ounce) jar roasted red and yellow peppers, drained and chopped",
        "2 tablespoons minced garlic",
        "2 tablespoons minced fresh ginger root",
        "1/2 teaspoon Chinese five-spice powder",
        "2 tablespoons white rice flour",
        "1 (14 ounce) can coconut milk",
        "1/4 cup chopped walnuts",
        "1/4 cup pomegranate seeds",
        "3 leaves fresh basil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mark's Yam and Acorn Squash Holiday Casserole",
    "url": "http://allrecipes.com/recipe/216469/marks-yam-and-acorn-squash-holiday-c/"
}
