{
    "directions": [
        "Position rack in center of oven and preheat to 325°F. Trim any rind and excess fat from upper side of ham, leaving 1/4-inch-thick layer of fat. Using long sharp knife, score fat in 1-inch-wide diamond pattern. Insert 1 clove into center of each scored diamond. Place ham in heavy large roasting pan. Bake until thermometer inserted into center of ham registers 120°F., about 3 hours 45 minutes.",
        "Melt 1 cup marmalade in heavy small saucepan over medium heat. Whisk in 1/4 cup mustard and 2 tablespoons water. Boil until mixture thickens enough to coat spoon without dripping, about 6 minutes. Set mixture aside. Transfer ham to cutting board. Increase oven temperature to 425°F. Place same roasting pan atop burner set on medium heat. Whisk remaining 1 1/2 cups water into pan, scraping up browned bits from bottom. Transfer pan juices to 4-cup glass measuring cup. Freeze pan juices 15 minutes. Spoon fat off top of pan juices. Reserve pan juices.",
        "Line same pan with foil. Return ham to pan. Generously spoon marmalade mixture over ham. Bake ham until glaze is set and begins to caramelize, about 20 minutes. Let ham stand 30 minutes.",
        "Bring 2 cups water to boil in heavy medium saucepan. Add tea bags. Remove from heat; cover and let steep 10 minutes. Discard tea bags. Add 2 cups chicken broth, 1 cup orange juice and 3 tablespoons orange marmalade to tea. Boil mixture until reduced to 3 cups, about 12 minutes. Whisk in 1 tablespoon Dijon mustard and reserved pan juices. Return to boil. Whisk in cornstarch mixture. Boil until sauce thickens slightly, about 4 minutes. Season sauce to taste with pepper. Carve ham and serve with sauce and Pineapple-Mint Relish."
    ],
    "ingredients": [
        "1 16- to 19-pound smoked fully cooked bone-in ham",
        "36 (about) whole cloves",
        "1 cup orange marmalade",
        "1/4 cup Dijon mustard",
        "2 tablespoons plus 1 1/2 cups water",
        "2 cups water",
        "4 orange-spice herb tea bags or black tea bags",
        "2 cups canned low-salt chicken broth",
        "1 cup orange juice",
        "3 tablespoons orange marmalade",
        "1 tablespoon Dijon mustard",
        "1 tablespoon cornstarch dissolved in 1 tablespoon water",
        "Pineapple-Mint Relish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tea",
        "Mustard",
        "Bake",
        "Easter",
        "Ham",
        "Spring",
        "Jam or Jelly"
    ],
    "title": "Marmalade-Glazed Ham with Sweet Orange-Tea Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/marmalade-glazed-ham-with-sweet-orange-tea-sauce-101403"
}
