{
    "directions": [
        "Heat a medium skillet, preferably cast-iron, over medium-high heat. Add the cumin seed and stir until aromatic, about 30 seconds. Turn off the heat, add the coriander seed, and stir for 30 seconds. Scrape the spices into a mortar with a pestle or into a spice grinder and grind until the cumin and coriander are coarsely ground. Mix with the flour, salt, and pepper in a medium large mixing bowl and dredge the chicken pieces in the seasoned flour mixture; pat off the excess flour and reserve the mixture.",
        "Heat the oil in an extra-large skillet over medium-high heat; brown the chicken pieces on both sides, in batches, about 3 minutes per side, then transfer to a 5- to 6-quart slow cooker.",
        "Reduce the heat under the skillet to medium. Add the onions and sauté until tender, about 2 minutes. Add the garlic and the reserved seasoned flour mixture and stir until the flour is lightly toasted, about 3 minutes. Add the wine and chicken broth and stir until the sauce is slightly thickened. Remove from the heat and stir in the lemon zest (but not the juice).",
        "Pour over the chicken and scatter the chopped preserved lemon over the top. Cover the cooker and cook for 2 to 3 hours on high, or 4 to 6 hours on low, until an instant-read thermometer inserted into the thickest part of one of the uppermost pieces of chicken registers 170°F. Keep warm for as long as 4 hours.",
        "Remove the chicken to a platter. Stir the lemon juice, parsley, and olives into the sauce, and spoon over the chicken."
    ],
    "ingredients": [
        "1 tablespoon cumin seed",
        "2 teaspoons coriander seed",
        "1/2 cup flour",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "4 pounds chicken pieces, or 1 cut-up chicken, skin removed",
        "2 tablespoons extra-virgin olive oil",
        "2 onions, chopped",
        "2 cloves garlic, minced",
        "1/2 cup white wine",
        "1 1/2 cups chicken broth",
        "Juice and finely grated zest of 1 lemon",
        "1 preserved lemon, homemade or purchased, finely chopped",
        "1/4 cup chopped fresh Italian (flat-leaf) parsley",
        "1/2 cup pitted kalamata olives",
        "5–6 quart slow cooker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Slow Cooker",
        "Chicken",
        "Lemon",
        "Dinner",
        "Olive"
    ],
    "title": "Slow-Cooker Marrakech Chicken Stew With Preserved Lemon and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/marrakech-chicken-stew-with-preserved-lemon-and-olives"
}
