{
    "directions": [
        "Combine flour, butter, vegetable shortening, sugar and salt in processor. Using on/off turns, blend until mixture resembles coarse meal. Add 3 tablespoons ice water and blend until moist clumps form, adding more water by teaspoonfuls if dough is dry. Gather dough into ball. Flatten into disk. Wrap dough disk in plastic and refrigerate at least 1 hour and up to 1 day.",
        "Preheat oven to 375°F. Roll out dough on lightly floured surface to 13- to 14-inch round. Transfer dough to 9-inch-diameter deep-dish glass pie dish. Fold dough edge over and crimp decoratively, securing dough edge to rim of dish. Pierce crust all over with fork. Freeze crust 15 minutes. Bake until golden brown, pressing with back of fork if crust bubbles or slips, about 30 minutes. Transfer crust to rack and cool.",
        "Whisk sugar, cornstarch, cocoa and salt in heavy medium saucepan to blend. Add egg yolks, milk and cream; whisk until smooth. Whisk over medium heat until mixture thickens and boils, about 6 minutes. Remove from heat. Add chocolate, butter and vanilla and whisk until melted and smooth. Pour filling into crust. Cool on rack.",
        "Place 1 tablespoon water in small cup; sprinkle unflavored gelatin over. Place cup in small skillet; add enough water to skillet to reach depth of 1/2 inch.",
        "Whisk sugar, corn syrup and 1/3 cup water in heavy medium saucepan to blend. Bring to boil over medium heat, stirring until sugar dissolves. Attach candy thermometer to side of pan. Boil without stirring until candy thermometer registers 240°F. While continuing to boil syrup, beat egg whites in large bowl with mixer until stiff peaks form. When thermometer in syrup registers 248°F, slowly beat hot syrup into egg whites. Continue to beat until whites are stiff and glossy, about 4 minutes. Beat in vanilla. Bring water in skillet to simmer. Stir gelatin mixture in cup until gelatin dissolves. Gradually pour gelatin over egg whites and beat until topping is cool, about 8 minutes. Using rubber spatula, gently spread topping over filling, making decorative peaks. Preheat broiler. Broil pie just until topping is light brown, about 1 minute. Chill pie 1 hour. Garnish with chocolate shavings, if desired. (Can be made 1 day ahead. Keep refrigerated. Let stand 1 hour at room temperature before serving.)"
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "5 tablespoons chilled unsalted butter, cut into 1/2-inch pieces",
        "1/4 cup chilled solid vegetable shortening, cut into 1/2-inch pieces",
        "1 tablespoon sugar",
        "1/4 teaspoon salt",
        "3 tablespoons (or more) ice water",
        "1/2 cup sugar",
        "1/4 cup cornstarch",
        "1 tablespoon unsweetened cocoa powder",
        "1/8 teaspoon salt",
        "4 large egg yolks",
        "2 cups whole milk",
        "1/2 cup whipping cream",
        "5 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 tablespoon unsalted butter",
        "1 teaspoon vanilla extract",
        "1 tablespoon plus 1/3 cup water",
        "1/2 teaspoon unflavored gelatin",
        "1 cup sugar",
        "1/3 cup light corn syrup",
        "4 large egg whites (about 1/2 cup)",
        "1 teaspoon vanilla extract",
        "Chocolate shavings (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Marshmallow Black-Bottom Pie",
    "url": "http://www.epicurious.com/recipes/food/views/marshmallow-black-bottom-pie-104585"
}
