{
    "directions": [
        "Preheat a gas grill to 400° to 500°F or a charcoal grill until hot. Melt half of the butter with the olive oil in a cast-iron skillet on the grill. Add the onions, cover the skillet, and move it to a cooler zone to simmer for 15 minutes.",
        "Uncover the skillet, move it to a medium-heat zone, and stir occasionally until the onions caramelize, about 20 minutes. Add the vermouth and garlic and continue heating until the liquid evaporates, stirring constantly for 10 to 15 minutes. Remove the onion mixture from the skillet and transfer it to a large bowl.",
        "Clean the skillet; then spray the sides and bottom with nonstick cooking spray. Add the bread and stir well. Spread the onion mixture in the pan. Melt the remaining butter and pour it over the bread and onion mixture. Sprinkle the cheese on top.",
        "In a medium bowl, beat the eggs slightly and add the half-and-half and salt and pepper. Pour this mixture over the bread, onion, and cheese mixture. Use a spatula to lift the bread to make sure the liquid is infused throughout. Place the skillet on the grill. Using the indirect heat method, cook for 30 to 40 minutes, until puffed and golden brown. When the pudding is done, remove it from the grill, cut it into large triangles, and serve."
    ],
    "ingredients": [
        "8 tablespoons (1 stick) butter",
        "1 tablespoon olive oil",
        "8 cups thinly sliced Vidalia or Texas Sweet onions",
        "1/4 cup dry vermouth (optional)",
        "1 clove garlic, crushed",
        "6 cups French bread in 1-inch chunks",
        "6 cups grated Emmenthaler or Swiss cheese",
        "3 eggs",
        "1 1/2 cups half-and-half",
        "1 teaspoon sea salt or kosher salt, or to taste",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Dairy",
        "Onion",
        "Side",
        "Fourth of July",
        "Vegetarian",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Summer",
        "Tailgating",
        "Family Reunion",
        "Grill",
        "Swiss Cheese",
        "Party",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Marty's Gaelic Gourmet CAM Onion Bread Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/martys-gaelic-gourmet-cam-onion-bread-pudding-359029"
}
