{
    "directions": [
        "Place the water, milk, eggs, melted butter, 1/2 teaspoon of salt, 1 teaspoon of vanilla extract, and flour in the container of a blender, and blend until the mixture forms a smooth batter, about 1 minute. Pour into a bowl, and refrigerate at least 1 hour.",
        "Clean the blender container, then add the cottage cheese, farmers cheese, sour cream, sugar, 1 teaspoon of vanilla extract, and 1 pinch of salt. Pulse the filling mixture a few times to combine, then blend until the filling is smooth, about 2 minutes.",
        "Melt 1 teaspoon of  butter in an 8-inch skillet over medium heat until the foam disappears from the skillet. Pour about 2 tablespoons of batter into the heated skillet, and swirl the pan to coat the bottom completely. Cook until the crepe is opaque and set, 1 to 2 minutes, and set aside, uncooked side down, on a plate lined with wax paper. Repeat with the rest of the batter, buttering the pan every few crepes if needed.",
        "To fill, place a crepe in front of you on a work surface with the cooked side up, and place about 1 1/2 tablespoons of cheese filling about 1 1/2 inches from the top of the crepe. Fold the top edge of the crepe over the filling, and fold the two sides inward to completely enclose the cheese. Roll the crepe over to seal the filling in, making a compact filled roll.",
        "Melt 1 teaspoon of butter, or as needed, in a skillet over medium-low heat. Pan fry the blintzes on both sides until the filling is hot and brown spots appear on the crepe, 1 to 2 minutes per side."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2377&h=1245&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6979316.jpg",
    "ingredients": [
        "1 cup water",
        "¾ cup milk",
        "3  eggs",
        "5 tablespoons melted butter",
        "½ teaspoon salt",
        "1 teaspoon vanilla extract",
        "1 ½ cups all-purpose flour",
        "1 (16 ounce) package cottage cheese",
        "1 (8 ounce) package farmers cheese",
        "¼ cup sour cream",
        "2 tablespoons white sugar",
        "1 teaspoon vanilla extract",
        "1 pinch salt",
        "2 tablespoons butter, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Marylyn's Cheese Blintzes",
    "url": "http://allrecipes.com/recipe/212819/marylyns-cheese-blintzes/"
}