{
    "directions": [
        "Put 1 cup flour with salt and pepper in a large (1-gallon) sealable plastic bag, then seal bag and shake to combine.",
        "Turn chicken pieces in milk in a bowl, then add chicken to flour mixture and seal bag (discard milk). Shake to coat and let stand in bag while oil heats.",
        "Heat oil in skillet over moderately high heat until it registers 360°F on thermometer (see cooks' note, below). Add chicken, skin sides down, and cook, covered, until golden, about 5 minutes. Turn chicken over with tongs and cook, covered, 5 minutes more.",
        "Transfer chicken with tongs to a plate. Pour fat from skillet into a heatproof bowl (to cool before discarding) and add 1/2 cup water to skillet. Return chicken to skillet, skin sides up, and cook, covered, over moderate heat, turning over twice, until chicken is cooked through, about 15 minutes. Transfer chicken to a platter and cover loosely with foil to keep warm.",
        "Pour off and discard all but 1 tablespoon fat from skillet, then stir 1 tablespoon flour into remaining fat and cook over moderate heat, whisking, 2 minutes. Add 1/2 cup water and cook, scraping up brown bits, 2 minutes. Add half-and-half, whisking, and bring to a boil. Reduce heat and simmer, whisking occasionally, until sauce is thick and creamy, about 4 minutes. Season with salt and pepper and spoon over chicken."
    ],
    "ingredients": [
        "1 cup plus 1 tablespoon all-purpose flour",
        "2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "1 (3-pound) chicken, cut into 8 serving pieces",
        "1/2 cup milk",
        "2 cups vegetable oil",
        "1 cup water",
        "1 1/2 cups half-and-half or light cream",
        "Special equipment: a deep 12-inch skillet with a tight-fitting lid (preferably not cast-iron); a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Fry",
        "Family Reunion",
        "Potluck",
        "Gourmet"
    ],
    "title": "Maryland Fried Chicken with Cream Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/maryland-fried-chicken-with-cream-gravy-109307"
}
