{
    "directions": [
        "In a small bowl, stir together the milk and sugar. Sprinkle the yeast over the top and let stand for 10 minutes to dissolve. Stir in cream.",
        "In a separate bowl, stir together the flour, sugar, salt and cardamom. Cut in the butter using a pastry blender or pinching with your fingers until it is a course mealy texture. Stir in the yeast mixture until well blended. Pat into a ball, flatten slightly, then wrap in plastic wrap. Refrigerate for 12 to 24 hours.",
        "To make the filling, mix the almond paste, almonds, sugar, cinnamon and almond extract using an electric mixer until evenly blended. It may be crumbly.",
        "Roll the chilled dough out into a 2 inch wide and 24 inch long rectangle. Spread the filling to within 2 inches of the sides and roll up into a tube. Cover your work surface with sugar, and roll the tube of dough in the sugar to coat thoroughly. Roll and stretch the dough out to form a long rope about 40 inches long. Place on a parchment lined baking sheet and shape into a pretzel shape.",
        "Brush the top of the pretzel with egg white and sprinkle with almonds. Cover loosely with a towel and let rise for 45 minutes.",
        "Preheat the oven to 375 degrees F (190 degrees C). Bake the kringle in the preheated oven until golden brown, 25 to 30 minutes. Cut into slices to serve."
    ],
    "ingredients": [
        "1/2 cup warm milk",
        "1 tablespoon white sugar",
        "1 (.25 ounce) envelope active dry yeast",
        "1 cup heavy cream",
        "3 1/2 cups all-purpose flour",
        "1/4 cup white sugar",
        "1 teaspoon salt",
        "1 teaspoon ground cardamom",
        "1/2 cup butter",
        "1 (8 ounce) can almond paste",
        "1/2 cup crushed sliced almonds",
        "1/2 cup white sugar",
        "1 teaspoon ground cinnamon",
        "1 teaspoon almond extract",
        "1/2 cup white sugar",
        "1 egg white, beaten",
        "1/2 cup sliced almonds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Marzipan Christmas Kringle (Juleskringle)",
    "url": "http://allrecipes.com/recipe/139544/marzipan-christmas-kringle-juleskrin/"
}
