{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Butter 9-inch square pan with 2-inch-high sides. Line bottom with parchment paper. Butter and flour parchment.",
        "Using electric mixer, beat eggs and 1/3 cup sugar on high speed in large bowl until slowly dissolving ribbon forms when beaters are lifted, about 4 minutes. Mix nuts, flour and baking powder in medium bowl. Fold nut mixture into egg mixture. Using clean beaters, beat egg whites in medium bowl until soft peaks form. Gradually add remaining 2 tablespoons sugar and beat until stiff peaks form. Fold whites into batter in 2 additions. Transfer batter to prepared pan. Bake until tester inserted in center comes out clean, about 18 minutes. Cool cake in pan on rack 5 minutes. Cut around cake in pan. Turn cake out onto rack. Peel off parchment; cool cake completely.",
        "Whisk yolks, sugar and flour in medium bowl until well blended. Bring half and half to simmer in heavy medium saucepan. Slowly pour hot half and half into egg mixture, whisking constantly. Return egg mixture to same saucepan and cook until mixture is very thick and boils, whisking constantly. Transfer mixture to medium bowl. Add 8 ounces white chocolate and vanilla extract and stir until chocolate melts and mixture is smooth. Press plastic wrap on surface of pastry cream to prevent skin from forming; cool. (Can be prepared 1 day ahead. Refrigerate. Bring to room temperature before continuing.)",
        "Using electric mixer, beat 1 cup unsalted butter and 1 tablespoon brandy in large bowl until fluffy. Add pastry cream 1/4 cup at a time, beating after each addition until just blended.",
        "Melt jam in heavy small saucepan over medium heat. Stir remaining 4 tablespoons brandy into jam. Cut cake horizontally, into 2 even layers. Place 1 layer on 8-inch cardboard square. Brush half of jam over. Spread 1 cup buttercream over jam. Cover buttercream layer completely with whole strawberries, stem end down. Set aside 1/2 cup buttercream; spoon remaining buttercream over berries, spreading buttercream between and around berries. Spread remaining jam over second cake layer. Place cake, jam side down, atop buttercream. Press cake gently to adhere. Refrigerate cake until buttercream is firm. (Can be prepared 1 day ahead. Cover cake and remaining buttercream separately and chill. Bring buttercream to room temperature before continuing.)",
        "Knead marzipan and 2 drops green coloring in large bowl until color is evenly distributed. Dust work surface with powdered sugar. Roll out marzipan on sugar to 12-inch-diameter circle, sprinkling with powdered sugar as needed to prevent sticking. Spread reserved 1/2 cup buttercream over top of cake. Using rolling pin as aid, drape marzipan over top of cake. Press gently to adhere. Trim marzipan flush with top of cake; reserve trimmings. Brush excess powdered sugar off marzipan. Using long sharp knife, cut 1/3 inch off each side of dessert to expose strawberries. Cut marzipan trimmings into leaf shapes using small cutter.",
        "Melt 2 ounces white chocolate in heavy small saucepan over low heat. Transfer chocolate to small parchment cone. Cut off tip to form small opening. Pipe the word Fraisier atop marzipan layer. Garnish with strawberry halves and marzipan leaves. Refrigerate. (Can be prepared 4 hours ahead.)"
    ],
    "ingredients": [
        "2 large eggs, room temperature",
        "1/3 cup plus 2 tablespoons sugar",
        "1/2 cup ground unsalted pistachios",
        "1/2 cup unbleached all purpose flour",
        "1/4 teaspoon baking powder",
        "4 large egg whites, room temperature",
        "6 large egg yolks",
        "1/3 cup sugar",
        "2 tablespoons unbleached all purpose flour",
        "1 1/2 cups half and half",
        "8 ounces imported white chocolate (such as Lindt), chopped",
        "2 teaspoons vanilla extract",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "5 tablespoons fraise or framboise eau-de-vie (clear strawberry or raspberry brandies) or other brandy",
        "6 tablespoons strawberry jam",
        "3 1-pint baskets strawberries, stemmed",
        "7 ounces marzipan",
        "Green food coloring",
        "Powdered sugar",
        "2 ounces imported white chocolate (such as Lindt), chopped",
        "4 strawberries, cut in half through stem end"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Wedding",
        "Strawberry",
        "Spring",
        "Summer",
        "Shower",
        "Engagement Party",
        "Party",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Marzipan-Topped Strawberry Layer Cake",
    "url": "http://www.epicurious.com/recipes/food/views/marzipan-topped-strawberry-layer-cake-1865"
}
