{
    "directions": [
        "Preheat oven to 350°F. and butter a 9 1/2-inch springform pan.",
        "In a shallow baking pan toast almonds in middle of oven until golden, about 10 minutes. Remove almonds from oven but leave oven on. Cool almonds completely. In a food processor pulse nuts until finely chopped and transfer to a bowl. Break graham crackers into food processor and finely grind. Stir 1 cup cracker crumbs and sugar into almonds. Melt butter and add to crumb mixture, stirring with a fork until combined well. Press crumb mixture evenly onto bottom and 1 inch up side of springform pan.",
        "In a food processor grind together almond paste and sugar until combined well. Add cream cheese and vanilla and blend well. Add eggs 1 at a time, pulsing until just combined after each addition.",
        "Pour filling into crust and bake in middle of oven 50 minutes. Turn off oven and let cheesecake stand in oven 10 minutes. (Cake will not be set in center but will set as it cools. Don't worry if cheesecake cracks; chocolate topping will cover it.) Cool cheesecake in pan on a rack 1 hour.",
        "Run a thin knife around edge of pan to loosen cheesecake but do not remove side of pan. Chill cake, uncovered, at least 4 hours and up to 1 day.",
        "Finely chop chocolate. In a small saucepan bring cream just to a simmer and remove pan from heat. Add chocolate and stir until smooth.",
        "Carefully pour topping onto cake and spread it up to but not over edge. Chill cake, covered, until chocolate is set, at least 2 hours, and up to 1 day.",
        "Just before serving, remove side of pan."
    ],
    "ingredients": [
        "1/2 cup whole blanched almonds",
        "eight 5- by 2 1/2-inch graham crackers",
        "3 tablespoons sugar",
        "1/3 cup (5 1/3 tablespoons) unsalted butter",
        "1/3 cup packed pure almond paste",
        "3/4 cup sugar",
        "three 8-ounce packages cream cheese, softened",
        "1 teaspoon vanilla",
        "5 large eggs",
        "5 ounces semisweet chocolate",
        "1/2 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Cream Cheese",
        "Almond",
        "Gourmet"
    ],
    "title": "Marzipan Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/marzipan-cheesecake-15731"
}
