{
    "directions": [
        "Preheat oven to 350°F with rack in middle. Butter a 9-inch round cake pan (2 inches deep). Line bottom with a round of parchment paper, then butter parchment.",
        "Sift together flour, baking powder, baking soda, and salt.",
        "Beat together butter and sugar in a large bowl with an electric mixer until pale and fluffy. Beat in vanilla. Add eggs 1 at a time, beating well after each addition. With mixer at low speed, beat in buttermilk until just combined. Add flour mixture in 3 batches, mixing after each addition until just combined.",
        "Spread batter in cake pan, smoothing top. Rap pan on counter several times to eliminate air bubbles.",
        "Bake until golden and a wooden pick inserted in center comes out clean, 35 to 40 minutes. Cool in pan on a rack 10 minutes. Run a knife around edge of cake to loosen, then invert onto a plate. Discard paper and reinvert cake onto rack to cool completely.",
        "Bring Sherry and sugar to a boil in a small heavy saucepan, stirring until sugar has dissolved. Put berries in a bowl and pour hot syrup over them, gently tossing to coat. Let stand 15 minutes.",
        "Beat mascarpone and cream with sugar in a large bowl using cleaned beaters until mixture just holds stiff peaks.",
        "Halve cake horizontally with a long serrated knife. Carefully remove top half and reserve. Put bottom half on a plate, then spread evenly with all of cream and replace top half. Serve with berries."
    ],
    "ingredients": [
        "2 cups sifted cake flour (not self-rising; sift before measuring)",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 stick unsalted butter, softened",
        "1 cup sugar",
        "1 teaspoon pure vanilla extract",
        "2 large eggs",
        "1 cup well-shaken buttermilk",
        "1/2 cup Fino (dry) Sherry",
        "1/2 cup sugar",
        "4 cups mixed berries, cut if large",
        "8 ounces mascarpone (1 cup)",
        "1 cup chilled heavy cream",
        "1/4 cup sugar",
        "confectioners sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Berry",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Backyard BBQ",
        "Blackberry",
        "Blueberry",
        "Raspberry",
        "Strawberry",
        "Fortified Wine",
        "Sherry",
        "Summer",
        "Birthday",
        "Shower",
        "Party",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mascarpone-Filled Cake With Sherried Berries",
    "url": "http://www.epicurious.com/recipes/food/views/mascarpone-filled-cake-with-sherried-berries-242873"
}
