{
    "directions": [
        "To cool the crust quickly, place it on a rack, position a fan a few feet away (aiming toward the crust), and turn the fan on medium speed.",
        "Preheat oven to 400°F. Press pie crust onto bottom and up sides of 9-inch-diameter tart pan with removable bottom; fold sides in and press to extend sides 1/4 inch above rim of pan. Pierce crust all over with fork. Bake until golden brown, about 24 minutes. Cool completely on rack.",
        "Meanwhile, grate enough orange peel to measure 1 1/4 teaspoons. Cut off remaining peel and pith from oranges. Slice oranges into thin rounds, then cut rounds crosswise in half. Place orange slices on paper towels to drain slightly.",
        "Combine mascarpone, cream, sugar, 1 tablespoon honey, cardamom, and orange peel in medium bowl. Using electric mixer, beat just until blended and peaks form (do not overbeat or mixture will curdle). Spread filling evenly in cooled crust. Arrange orange slices atop tart in concentric circles; sprinkle with pistachios. Drizzle with remaining 1 tablespoon honey and serve."
    ],
    "ingredients": [
        "1 refrigerated pie crust (half of 15-ounce package)",
        "2 large navel oranges",
        "1 8- to 8.8-ounce container chilled mascarpone cheese*",
        "1/2 cup chilled heavy whipping cream",
        "1/4 cup sugar",
        "2 tablespoons honey, divided",
        "1/4 teaspoon (generous) ground cardamom",
        "2 tablespoons chopped pistachios",
        "*Italian cream cheese; available at many supermarkets and Italian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Citrus",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Orange",
        "Pistachio",
        "Honey",
        "Kidney Friendly",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Mascarpone Tart with Honey, Oranges, and Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/mascarpone-tart-with-honey-oranges-and-pistachios-237299"
}
