{
    "directions": [
        "Tightly wrap outside of 9-inch-diameter springform pan with 2 3/4-inch-high sides with 2 layers of heavy-duty foil. Mix biscotti crumbs and butter in bowl. Press mixture evenly onto bottom (not sides) of prepared pan. Chill 30 minutes.",
        "Preheat oven to 350°F. Using electric mixer, beat cream cheese, mascarpone and 1 1/4 cups sugar in large bowl until smooth. Add eggs 1 at a time; beat just until blended. Spread cheese mixture evenly over crust in pan. Place springform pan in large roasting pan. Pour enough hot water into roasting pan to come halfway up sides of springform pan. Bake until cheesecake is golden and center of cake moves only slightly when pan is shaken, about 1 hour 10 minutes.",
        "Transfer cake to rack; cool 1 hour. Chill overnight. (Cake can be made 2 days ahead. Cover and keep chilled. Remove from refrigerator 30 minutes before serving.)",
        "Mix strawberries, 1/2 cup plus 2 tablespoons sugar and vinegar in large bowl. Let stand at room temperature until juices form, about 30 minutes.",
        "Cut cake into wedges. Spoon strawberries alongside and serve."
    ],
    "ingredients": [
        "1 1/2 cups ground crumbs from purchased almond biscotti (about 6 ounces)",
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "2 pounds cream cheese, room temperature",
        "8 ounces mascarpone cheese*",
        "1 3/4 cups plus 2 tablespoons sugar",
        "2 large eggs",
        "3 cups quartered hulled strawberries (about 1 1/2 12-ounce baskets)",
        "1/4 cup balsamic vinegar",
        "*Italian cream cheese; sold at Italian markets and some supermarkets. If unavailable in your area, blend 8 ounces cream cheese with 1/4 cup whipping cream and 2 1/2 tablespoon sour cream."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit",
        "Dessert",
        "Bake",
        "Vinegar",
        "Cream Cheese",
        "Strawberry",
        "Spring",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mascarpone Cheesecake with Balsamic Strawberries",
    "url": "http://www.epicurious.com/recipes/food/views/mascarpone-cheesecake-with-balsamic-strawberries-2460"
}
