{
    "directions": [
        "Position an oven rack in the middle of the oven. Preheat the oven to 350 degrees F.",
        "Spray a 7 by 10 3/4-inch nonstick baking pan with vegetable cooking spray. Lay a 6 by 18-inch piece of parchment paper in the pan, allowing the excess paper to overhang the sides. Spray the parchment paper lightly with cooking spray.",
        "In a medium bowl, combine the cookie dough, 1/2 of the chopped chocolate-toffee candy pieces and vanilla extract. Using damp fingers, gently press the dough into the prepared pan. Using the tines of a fork, prick the dough all over. Bake for 12 to 14 minutes until the crust is lightly browned. Cool for 15 minutes.",
        "Place the chocolate chips and vegetable oil in a medium bowl. Place the bowl over a pan of simmering water and stir until the chocolate has melted. Cool the chocolate mixture for 10 minutes. Whisk in the mascarpone cheese until the mixture is smooth. Using a spatula, spread the chocolate mixture over the cooled crust. Sprinkle the remaining chocolate-toffee candy pieces and sliced almonds over the chocolate mixture. Refrigerate for at least 2 hours until the chocolate layer is firm.",
        "Peel off the parchment paper and cut into 1 1/2 by 2-inch bars. Serve at room temperature.",
        "*Cook's Note: To toast almonds, arrange in a single layer on a baking sheet. Bake in a preheated 350 degrees F oven for 8 to 10 minutes until lightly browned."
    ],
    "ingredients": [
        "Vegetable cooking spray",
        "1 pound refrigerated sugar cookie dough (recommended: Pillsbury)",
        "2 (1.4-ounces) chocolate-toffee candy bars, coarsely chopped, divided (recommended: Skor)",
        "1/2 teaspoon pure vanilla extract",
        "1 cup semisweet chocolate chips (recommended: Ghirardelli)",
        "1 teaspoon vegetable oil",
        "1 cup (8 ounces) mascarpone cheese, at room temperature",
        "1/4 cup sliced almonds, toasted * see Cook's Note"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cookie Recipes",
        "Chocolate",
        "Cookie",
        "Cheese",
        "Sugar",
        "Dessert"
    ],
    "title": "Mascarpone Chocolate Toffee Bars",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/mascarpone-chocolate-toffee-bars-recipe"
}
