{
    "directions": [
        "Peel the yam, removing all the dark outer bark. Some tubers have woody\nbark running to the core in some areas. Remove it, preserving as much\nflesh as possible. Slice the yam into 3/4 inch discs, halve, then quarter.\nPut in a pot and cover with cold water. Bring to a boil and simmer for\n8 minutes.",
        "Top and tail the plantain, then make a skin-deep incision along the spine.\nPeel and cut into 4 even pieces, crosswise. Add to the pan of simmering\nyam and leave for another 8 minutes. Add a little more warm water if the\nplantain and yam are not sufficiently covered.",
        "In the meantime, measure out the coconut oil and seasoning.",
        "Check if the yam is done by removing a piece and inserting a fork. If you\ncan do so with relative ease, it’s ready. Yam is robust and can withstand\n“overcooking,” so don’t worry if any pieces have boiled inconsistently.\nCheck the plantain by removing one piece and halving it crosswise on a\ncutting board. You want each piece to be the same bright yellow as the\noutside through the cross section.",
        "When both yam and plantain are ready, drain in a colander and return\nthem to the dry pan. Working quickly, add the coconut oil and mash\nthoroughly while hot. It usually takes 2 to 3 minutes to achieve a smooth\nconsistency. Season with the salt and white pepper and mash one last time.\nI like to use a fork for this part.",
        "Ball with an ice cream scoop and serve immediately."
    ],
    "ingredients": [
        "1 pound puna yam",
        "1 black plantain",
        "2 tablespoons extra-virgin coconut oil",
        "1 teaspoon ground white pepper",
        "1 teaspoon fine sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Sweet Potato/Yam",
        "Plantain",
        "Side",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Yam and Plantain Scoop",
    "url": "http://www.epicurious.com/recipes/food/views/mashed-yam-and-plantain"
}
