{
    "directions": [
        "Preheat oven to 425°F with racks in upper and lower thirds.",
        "Wrap each potato in foil, then prick potatoes through foil several times with a fork. Cut off and discard 1/2 inch from top of garlic head, exposing cloves. Put garlic on a double layer of foil, then drizzle with 1 tablespoon oil and sprinkle with 1/4 teaspoon salt. Twist foil tightly to enclose.",
        "Roast potatoes and garlic on rack in upper third of oven until tender, 1 to 1 1/4 hours.",
        "About 30 minutes before potatoes and garlic finish roasting, toss parsnips with 1/4 teaspoon salt and remaining 2 1/2 tablespoons oil in a small baking pan. Spread out in an even layer and roast in lower third of oven, stirring once or twice, until tender and golden, about 25 minutes.",
        "Unwrap garlic and cool to warm, then squeeze cloves into a large bowl and mash well with a fork. Stir in roasted parsnips.",
        "Heat milk, butter, white pepper, and 1 1/4 teaspoons salt in a small saucepan over medium-low heat until butter is melted.",
        "While milk mixture heats, unwrap baked potatoes and force through ricer into bowl with garlic and parsnips. (Ricer will catch skins.)",
        "Pour in hot milk mixture and gently stir with a large heatproof rubber spatula until combined."
    ],
    "ingredients": [
        "3 pounds Yukon Gold potatoes",
        "1 head garlic (3 inches wide)",
        "3 1/2 tablespoons olive oil, divided",
        "1 pound parsnips, peeled, woody cores removed if necessary, and parsnips cut into 1/3-inch pieces",
        "2 cups whole milk",
        "3/4 stick unsalted butter",
        "1/2 teaspoon white pepper",
        "Equipment: a potato ricer or food mill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Garlic",
        "Potato",
        "Side",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "Parsnip",
        "Winter",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Mashed Potatoes with Caramelized Garlic and Parsnips",
    "url": "http://www.epicurious.com/recipes/food/views/mashed-potatoes-with-caramelized-garlic-and-parsnips-240575"
}
