{
    "directions": [
        "Combine ham hock and 4 cups cold water in large saucepan; bring to boil. Reduce heat to medium-low, cover and simmer until ham is tender, about 45 minutes. Transfer hock to plate; cool. Remove meat from bone; chop meat.",
        "If necessary, boil ham broth until reduced to 3 cups. Add kale stems. Cover and simmer over medium heat 10 minutes. Add kale leaves. Cover and simmer 5 minutes. Add mustard greens; cover and simmer until all greens are tender, occasionally submerging greens in broth, about 20 minutes. Uncover; simmer until broth is reduced almost to glaze, about 10 minutes longer. Season with salt and pepper.",
        "Cook potatoes in large pot of boiling salted water until tender, about 30 minutes. Drain potatoes, reserving 1/4 cup cooking liquid. Return potatoes and reserved 1/4 cup cooking liquid to pot. Add butter and 3/4 cup whole milk. Mash potatoes until almost smooth, adding more milk if dry. Season potatoes to taste with salt and pepper.",
        "Spoon potatoes into large bowl. Make well in center of potatoes; spoon greens into well. Sprinkle with chopped ham and green onions and serve."
    ],
    "ingredients": [
        "1 9- to 10-ounce smoked ham hock",
        "4 cups cold water",
        "3/4 pound kale, stems removed and reserved, leaves coarsely chopped",
        "1/4 pound mustard greens, stems discarded, leaves coarsely chopped",
        "3 pounds russet potatoes, peeled, quartered",
        "1/2 cup (1 stick) butter",
        "1 cup (about) whole milk",
        "4 green onions, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Potato",
        "Side",
        "Thanksgiving",
        "Ham",
        "Kale",
        "Fall",
        "Mustard Greens",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Mashed Potatoes with Greens",
    "url": "http://www.epicurious.com/recipes/food/views/mashed-potatoes-with-greens-104293"
}
