{
    "directions": [
        "Arrange a rack in lower third of oven; preheat oven to 425°F. Prick potatoes all over with a fork and place on a foil-lined rimmed baking sheet. Place garlic on a piece of foil and drizzle with oil; season with salt and pepper. Fold edges of foil up and over garlic and crimp to close, creating a tight packet. Place on baking sheet with potatoes and roast until a knife slides easily through flesh of potatoes, 65–75 minutes. Let potatoes and garlic cool slightly.",
        "Halve potatoes lengthwise, then use a fork to scrape flesh into a large saucepan (include skins if you want to add a little texture). Squeeze garlic cloves from skins into pan. Smash mixture with a potato masher until mostly smooth with only a few lumps.",
        "Combine half-and-half and butter in a large measuring cup and pour 1 cup into potato mixture, stirring with a wooden spoon until incorporated and smooth. Stir in another cup half-and-half mixture; season generously with salt and pepper.",
        "If serving immediately, stir in remaining half-and-half mixture and top with chives.",
        "If making ahead, smooth potatoes to make a flat, even surface and pour remaining half-and-half mixture over (don’t stir in). Remove from heat and cover with plastic wrap.",
        "Potatoes can be mashed 3 hours ahead. Store room temperature. Reheat over medium-low, stirring occasionally. Top with chives just before serving."
    ],
    "ingredients": [
        "2 pounds russet potatoes, scrubbed",
        "2 pounds Yukon Gold potatoes, scrubbed",
        "1 head of garlic, halved crosswise",
        "1 tablespoon olive oil",
        "Kosher salt, freshly ground pepper",
        "2 cups half-and-half, warmed",
        "6 tablespoons unsalted butter, melted",
        "2 tablespoons finely chopped chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Thanksgiving",
        "Side",
        "Potato",
        "Chive",
        "Milk/Cream",
        "Garlic"
    ],
    "title": "Mashed Baked Potatoes With Chives",
    "url": "http://www.epicurious.com/recipes/food/views/mashed-baked-potatoes-with-chives"
}
