{
    "directions": [
        "Bring vinegar, mustard seeds, and 1/4 cup water to a simmer in a small pot; cook until seeds are plump, 20-25 minutes. Drain; set aside seeds and cooking liquid separately.",
        "Place a steamer basket inside a large pot. Add water to a depth of 1\". Bring to a boil. Add root vegetables to steamer basket. Cover and cook, adding water by 1/2-cupfuls if needed to maintain level of water in pot, until vegetables are very tender but not mushy, about 45 minutes.",
        "Meanwhile, place bacon in a large skillet; set over medium-low heat and cook until bacon softens and fat begins to render, about 4 minutes. Add onion; increase heat to medium-high and cook, stirring occasionally, until onion and bacon are browned and crisp, about 10 minutes.",
        "Add reserved mustard seeds to bacon mixture and cook until seeds begin to pop, about 1 minute. Turn off heat and stir in brown sugar and reserved mustard seed cooking liquid. Season vinaigrette to taste with salt and pepper.",
        "Drain vegetables and return to pot. Using a fork or potato masher, coarsely mash. Stir in vinaigrette; season to taste with salt and pepper. Transfer to a 13x9x2\" baking dish; cover with foil. DO AHEAD: Vegetable mash can be made 1 day ahead. Chill.",
        "Rewarm vegetable mash, covered, in a 350°F oven until just warmed through, 45-55 minutes. Alternatively, place in a microwave-safe bowl and microwave until warmed through (time will vary).",
        "Stir parsley into mash. Transfer to a bowl; serve warm or at room temperature."
    ],
    "ingredients": [
        "1/2 cup apple cider vinegar",
        "2 tablespoons yellow mustard seeds",
        "4-5 pounds mixed root vegetables (such as parsnips, kohlrabi, celery root, turnips, and rutabagas), peeled, cut into 1\" cubes",
        "1/2 pound thick-cut applewood-smoked bacon, diced",
        "1 large white onion, diced",
        "1 tablespoon (packed) dark brown sugar",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons chopped flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Side",
        "Thanksgiving",
        "High Fiber",
        "Bacon",
        "Root Vegetable",
        "Parsnip",
        "Turnip",
        "Low Cholesterol",
        "Rutabaga",
        "Boil",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mashed Root Vegetables with Bacon Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/mashed-root-vegetables-with-bacon-vinaigrette-51124250"
}
