{
    "directions": [
        "Preheat oven to 350°F. Combine honey, lemon juice, and melted butter in large bowl. Add pears; toss to coat. Arrange pears in single layer on large rimmed baking sheet. Sprinkle with salt and pepper. Roast pears 30 minutes. Turn pears to coat with juices and roast until very tender, about 35 minutes longer. Transfer pears and caramelized liquids to food processor; blend until smooth. (Pear puree can be made 2 days ahead. Cover and refrigerate.)",
        "Cook potatoes and turnips in separate large pots of generously salted water until tender, about 25 minutes. Drain well. Transfer turnips to processor; puree until smooth. Mash potatoes with room-temperature butter in large bowl until smooth. Stir in pureed turnips. Season to taste with salt and pepper. (Can be prepared 6 hours ahead. Cover and refrigerate. Rewarm in microwave before continuing.)",
        "Rewarm pear puree. Place potato-turnip mixture in large serving bowl. Swirl in pear puree and serve."
    ],
    "ingredients": [
        "1/4 cup honey",
        "2 tablespoons fresh lemon juice",
        "2 tablespoons (1/4 stick) butter, melted",
        "8 Bosc pears, peeled, quartered, cored",
        "5 pounds Yukon Gold potatoes, peeled, cut into 2-inch pieces",
        "2 pounds white turnips, peeled, cut into 2-inch pieces",
        "1 1/2 cups (3 sticks) butter, room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fruit",
        "Potato",
        "Vegetable",
        "Side",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "Pear",
        "Turnip",
        "Fall",
        "Boil",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mashed Potatoes and Turnips with Roasted Pear Purée",
    "url": "http://www.epicurious.com/recipes/food/views/mashed-potatoes-and-turnips-with-roasted-pear-puree-231102"
}
