{
    "directions": [
        "Put the yeast in a small bowl, add the warm water, and whisk vigorously for 30 seconds. The yeast should dissolve in the water and the mixture should foam. If it doesn't and the yeast granules float, the yeast is \"dead\" and should be discarded. Begin again with a fresh amount of yeast and water.",
        "Combine the flour and malt in the bowl of a stand mixer fitted with the dough hook.",
        "With the mixer running on the lowest speed, pour in most of the icewater, reserving about 2 tablespoons, followed by the yeast-water mixture. Pour the reserved water into the yeast bowl, swirl it around to dislodge any bits of yeast stuck to the bowl, and add to the mixer. Mix for about 15 seconds, stop the mixer, and add the poolish or tiga.",
        "Continue to mix the dough at the lowest speed for about 1 minute, until most of the dough comes together around the hook. Stop the mixer. Use your fingers to pull away any dough clinging to the hook, and scrape the sides and bottom of the bowl with a bowl scraper or rubber spatula. Check the bottom of the bowl for any unincorporated flour. Turn the dough over and press it into the bottom of the bowl to pick up any stray pieces. If the dough isn't holding together, add small amounts of water (about 1/2 teaspoon to start) and mix until the dough is no longer dry and holds together.",
        "Add the salt and mix on the lowest speed for 1 minute to combine.",
        "Stop the mixer, pull the dough off the hook, and add the oil. Mix the dough for 1 to 2 minutes, stopping the mixer from time to time to pull the dough off the hook and scrape down the sides of the bowl, until all of the oil is absorbed. The dough won't look completely smooth.",
        "Use a bowl scraper to transfer the dough to an unfloured work surface, then knead it for 2 to 3 minutes, until smooth. Cover the dough with a damp dish towel and let rest at room temperature for 20 minutes. Use the dough cutter to loosen the dough and to cut it in half. Weigh the dough, adjusting the quantity as necessary to give you two 13-ounce pieces. Form each piece into a ball. Any remaining dough can be discarded.",
        "Form the dough into balls. Set the balls on a half sheet pan, spacing them about 3 inches apart. Or, if you will be baking the balls on different days, place each ball on a quarter sheet pan. Wrap the pan(s) airtight with a double layer of plastic wrap, sealing the wrap well under the pan(s). Put the pan(s) in a level spot in the refrigerator and refrigerate for 24 to 48 hours."
    ],
    "ingredients": [
        "2.2 grams (3/4 teaspoon) active dry yeast",
        "70 grams (1/4 cup plus 1 tablespoon) warm water (80°F to 85°F)",
        "453 grams flour (3 1/2 cups) with 13 to 14 percent protein, preferably All Trumps, Pendleton Flour Mills Power, Giusto's High Performer, King Arthur Sir Lancelot Unbleached Hi-Gluten, or Tony's California Artisan Flour",
        "10 grams (1 tablespoon plus 1/4 teaspoon) diastatic malt",
        "210 grams (3/4 cup plus 2 tablespoons) ice water, plus more as needed",
        "90 grams Poolish or Tiga",
        "10 grams (2 teaspoons) fine sea salt",
        "5 grams (1 teaspoon) extra virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread"
    ],
    "title": "Master Dough with Starter",
    "url": "http://www.epicurious.com/recipes/food/views/master-dough-with-starter-51255340"
}
