{
    "directions": [
        "Purée onion and garlic in a food processor. Transfer to a large bowl and whisk in eggs, oil, club soda, and lime zest. Stir in matzo meal, cardamom, turmeric, pepper, and 2 tsp. salt. Cover with plastic wrap and chill at least 2 hours and up to 24 hours.",
        "Combine broth and 1 1/2 tsp. salt in a large pot. Cover and bring to a simmer over medium heat.",
        "Meanwhile, set bowl of matzo ball dough next to a bowl of water and a rimmed baking sheet. Coat your hands with water and roll scant 2 Tbsp. dough into a ball; place on sheet. Repeat with remaining dough; you should have about 16 balls.",
        "Bring broth to a rapid simmer. Gently drop in matzo balls, one at a time, then cover with a tight-fitting lid. Return to a rapid simmer, then reduce heat, bring to a gentle simmer, and cook matzo balls, without uncovering, until the centers are cooked through, 35–45 minutes. Add carrots and cook until just tender, 1–2 minutes. Remove from heat and season with salt if necessary. Divide matzo balls and broth among bowls, top with cilantro, and serve lime wedges alongside.",
        "Matzo balls can be cooked 2 days ahead. Transfer matzo balls and broth to separate resealable containers and chill. Gently reheat matzo balls in broth before serving."
    ],
    "ingredients": [
        "1/2 medium onion, coarsely chopped",
        "4 garlic cloves, crushed",
        "4 large eggs",
        "2 tablespoons olive oil or chicken schmaltz",
        "1/4 cup club soda",
        "2 teaspoons finely grated lime zest (from about 2 limes)",
        "1 1/3 cups matzo meal",
        "1 1/2 teaspoons ground cardamom",
        "1 teaspoon ground turmeric",
        "1/4 teaspoon freshly ground black pepper",
        "3 1/2 teaspoons kosher salt, divided, plus more",
        "8 cups low-sodium chicken broth",
        "2 large carrots, peeled, thinly sliced",
        "1 bunch cilantro leaves with tender stems",
        "2 limes, cut into wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Passover",
        "Soup/Stew",
        "Lime",
        "Cardamom",
        "Garlic",
        "Cilantro"
    ],
    "title": "Matzo Ball Soup with Cardamom, Turmeric, and Lime",
    "url": "http://www.epicurious.com/recipes/food/views/matzo-ball-soup-with-cardamom-turmeric-and-lime"
}
