{
    "directions": [
        "Move an oven rack near the top of oven and preheat oven to 475 degrees F (245 degrees C). Preheat a heavy baking sheet in the oven.",
        "Dust a clean work surface and a rolling pin with 1 teaspoon flour, or as needed. Place 1 cup of flour into a mixing bowl; set a timer for about 16 minutes (18 minutes maximum). Start the timer; pour the water, about 1 tablespoon at a time, into the flour. Stir the water and flour together with a fork until the dough forms a rough ball, remove the dough to the prepared work surface, knead rapidly and firmly until smooth, about 30 seconds to 1 minute.",
        "Divide the dough into four equal pieces; cut each piece in half again to get 8 pieces total. Swiftly roll each piece into a ball. Roll each piece of dough out into a 5-inch pancake, dusting the top and rolling pin with flour as needed. Gradually roll the pancakes out to a size of about 8 inches, increasing the size of each by about 1 inch, then letting the dough rest for a few seconds before rolling again to the finished size. Roll from the center out. The bread rounds should be very thin. Using a fork, quickly pierce each bread about 25 times, all over, to prevent rising. The holes should go completely through the bread. Flip the bread over, and pierce each piece another 25 times with the fork.",
        "With at least 5 minutes left on the timer, remove the hot baking sheet from the preheated oven, and place the rounds onto the baking sheet. Place the baking sheet onto the rack near the top of the oven, and bake for 2 minutes; turn the breads over and bake an additional 2 minutes, until the matzot are lightly browned and crisp.",
        "Transfer to a wire rack to cool. Lightly anoint each matzah with olive oil, using a brush, and sprinkle generously with salt."
    ],
    "ingredients": [
        "1 teaspoon all-purpose flour for dusting*",
        "1 cup all-purpose flour*",
        "1/3 cup water, or more if needed",
        "1/2 teaspoon kosher salt, or as needed (optional)",
        "1 teaspoon olive oil, or as needed (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Matzah",
    "url": "http://allrecipes.com/recipe/213682/matzah/"
}
