{
    "directions": [
        "Preheat the oven to 400ºF.",
        "Remove the giblets from the chicken cavity. Warm 2 tablespoons of the oil in a small sauté pan over medium-high heat. Add the gizzard and heart and sear well on all sides. Add the liver and cook, turning as needed, for a few minutes longer. Transfer the giblets to a cutting board and chop finely.",
        "In a bowl, combine the matzo meal, 1/2 to 2/3 cup wine, the eggs, the walnuts, the currants, and the giblets. Add the remaining 2 tablespoons oil, season with salt and pepper, and mix well",
        "Spoon the stuffing into the chicken cavity loosely and sew or skewer closed. Reserve any extra stuffing. Rub the chicken liberally with oil and the lemon juice and sprinkle with salt and pepper. Place on a rack in a roasting​ pan.",
        "Roast the chicken, basting occasionally with the remaining wine and with the pan drippings, until the juices run clear when a thigh is pierced with a knife, about 1 1/2 hours. If you have stuffing that did not fit into the bird, put it in the roasting pan for the last 15 minutes of roasting, where it will cook and take on color.",
        "Transfer the chicken to a serving platter and let rest for about 10 minutes. Scoop out the stuffing into a serving bowl and carve the chicken."
    ],
    "ingredients": [
        "1 roasting chicken with giblets (about 5 pounds)",
        "4 tablespoons olive oil, plus more for rubbing",
        "1 cup matzo meal",
        "1 2/3 cups dry white wine, or as needed",
        "3 eggs, lightly beaten",
        "1/2 cup walnuts, coarsely chopped",
        "2 cups dried currants",
        "Salt and freshly ground black pepper",
        "Juice of 1 lemon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Passover",
        "Chicken",
        "Roast",
        "Kosher",
        "Kosher for Passover",
        "Lemon Juice",
        "Currant",
        "Walnut"
    ],
    "title": "Matzo-Stuffed Roast Chicken for Passover",
    "url": "http://www.epicurious.com/recipes/food/views/matzo-stuffed-roast-chicken-for-passover"
}
