{
    "directions": [
        "Cook onions, carrots, and celery in oil in a wide 3 1/2- to 5-quart heavy pot over moderate heat, stirring occasionally, until vegetables begin to brown, 8 to 10 minutes.",
        "While vegetables are cooking, put matzos in a colander and run under hot water until softened.",
        "Remove pot from heat and transfer half of vegetables to a bowl. Cool vegetables in bowl 5 minutes, then stir in matzos, parsley, egg, salt, and pepper.",
        "Preheat oven to 350°F.",
        "Trim as much excess fat as possible from veal. Cut a large pocket in veal breast: Beginning at center of thickest side, insert a large knife horizontally and cut into center of veal as evenly as possible, leaving a 1-inch border on 3 sides.",
        "Purée onion, garlic, oil, paprika, salt, and pepper in a food processor or blender. Put veal breast on a cutting board and rub inside of pocket with 2 tablespoons purée. Fill pocket loosely with matzo stuffing, leaving a 1-inch border on cut side. Sew pocket closed with carpet needle and kitchen string.",
        "Pat veal dry and rub both sides with remaining purée. Put thyme sprigs over vegetables remaining in pot, then top with veal. Add water and bring to a boil.",
        "Cover pot with lid and braise in middle of oven until meat is very tender, 3 to 3 1/2 hours. Transfer veal with a wide metal spatula to a clean cutting board and let stand, loosely covered with foil, 30 minutes.",
        "Discard thyme sprigs and skim any fat from sauce. Discard string, then cut veal across the grain into 1-inch-thick slices and serve with sauce."
    ],
    "ingredients": [
        "2 medium onions, chopped",
        "3 carrots, cut into 1/4-inch dice",
        "2 celery ribs, cut into 1/4-inch dice",
        "1/4 cup vegetable oil",
        "3 (6- by 6-inch) matzos, broken into 1/2-inch pieces",
        "2 tablespoons chopped fresh flat-leaf parsley leaves",
        "1 large egg, lightly beaten",
        "3/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 (3 1/2- to 4-lb) boneless veal breast (1 1/2 inches thick)",
        "1 small onion, quartered",
        "2 garlic cloves, smashed",
        "1 tablespoon vegetable oil",
        "2 teaspoons paprika (preferably sweet Hungarian)",
        "1 1/2 teaspoons salt",
        "1 teaspoon black pepper",
        "2 fresh thyme sprigs",
        "1 1/2 cups water",
        "Special equipment: a carpet, darning, or upholstery needle; kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Egg",
        "Garlic",
        "Onion",
        "Braise",
        "Stuffing/Dressing",
        "Veal",
        "Winter",
        "Thyme",
        "Gourmet"
    ],
    "title": "Matzo-Stuffed Breast of Veal",
    "url": "http://www.epicurious.com/recipes/food/views/matzo-stuffed-breast-of-veal-107600"
}
