{
    "directions": [
        "Trim off neck flap all the way up to the top of the wishbone. Trim fat and skin from around the back cavity of the chicken.  Reserve  both for schmaltz and grebenes.   Cut chicken into quarters.  Place meat in large pot with onions, and cover with about 4 quarts water.  Bring to a boil, reduce heat , and simmer 2 hours.",
        "Add carrots and celery to the soup; simmer an additional hour. Season to taste with salt.",
        "Remove chicken pieces, and set aside.  You may reserve them for another use, or shred the meat for the soup.  Keep the chicken covered, and at room temperature before shredding.",
        "Dice reserved skin and fat into 1 inch pieces.  Cook in  a heavy bottomed skillet over medium heat, turning occasionally.  Make sure the pan never gets so hot as to cause the rendered fat to smoke.  When the grebenes are crisp and brown, remove them to a cutting board and drain schmaltz into a small nonplastic bowl to cool slightly.  When cool enough to handle, mince the grebenes finely.",
        "To make the matzoh balls, blend fat or oil and eggs together.  Mix matzoh meal and salt together. Combine the two mixtures, and mix well.  Add 4 1/2 tablespoons soup stock or water; mix until uniform.  Stir in minced  grebenes. Cover bowl, and place in refrigerator for 20 minutes.",
        "Bring soup  to a boil. Reduce flame, and drop balls approximately 1 inch in diameter into the slightly boiling water.  Add dill.  Cover pot, and cook 30 to 40 minutes.  DO NOT  REMOVE THE COVER FROM THE POT WHLE COOKING!"
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1352&h=708&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F970243.jpg",
    "ingredients": [
        "4 pounds whole chicken",
        "2  onions, cut into 1-inch cubes",
        "3  carrots, sliced",
        "2 stalks celery, thickly sliced",
        "1 cup chopped fresh dill weed",
        "salt to taste",
        "2 tablespoons vegetable oil",
        "2 tablespoons chicken cracklings (grebenes), finely minced",
        "2  eggs, beaten",
        "½ cup matzo meal",
        "1 teaspoon salt",
        "¼ cup vegetable broth"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Matzoh Ball Soup",
    "url": "http://allrecipes.com/recipe/13147/matzoh-ball-soup/"
}