{
    "directions": [
        "Bring water, salt, and 1 tablespoon butter to a boil in a 3-quart heavy saucepan. Whisk in grits and cook at a bare simmer, covered, stirring frequently, until grits are tender and thick, about 1 hour. Stir in cream and remaining tablespoon butter and remove from heat.",
        "Cook chorizo and ham in 1/2 tablespoon butter in a 12-inch heavy skillet over moderate heat, stirring, until ham is golden, about 3 minutes. Transfer chorizo and ham to a plate with a slotted spoon. Add 1/2 tablespoon butter to skillet and heat until foam subsides. Cook scallops until golden on both sides and just cooked through, about 2 minutes. Transfer scallops to a plate with a slotted spoon. Add another 1/2 tablespoon butter to skillet and cook shrimp, turning, until just cooked through, about 3 minutes. Stir in chorizo, ham, scallops, remaining 1/2 tablespoon butter, and remaining ingredients. Cook, stirring and scraping up any brown bits in skillet, until heated through, then season with salt and pepper.",
        "Serve topping over grits."
    ],
    "ingredients": [
        "4 cups water",
        "1/2 teaspoon salt",
        "2 tablespoons unsalted butter",
        "1 cup old-fashioned stone-ground grits",
        "1/4 cup heavy cream",
        "1 1/2 chorizo links (spicy pork sausage), cut into 1/4-inch-thick slices",
        "4 ounces country ham, cut into julienne strips",
        "2 tablespoons unsalted butter",
        "8 medium sea scallops",
        "12 medium shrimp, peeled, and deveined if desired",
        "2 tomatoes, peeled, seeded, and chopped",
        "1/4 cup sliced scallion",
        "1/4 teaspoon minced garlic",
        "Pinch of Cajun seasoning",
        "1/4 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Pork",
        "Shellfish",
        "Breakfast",
        "Brunch",
        "Side",
        "Sauté",
        "Dinner",
        "Lunch",
        "Meat",
        "Sausage",
        "Seafood",
        "Shrimp",
        "Winter",
        "Hominy/Cornmeal/Masa",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Maverick Grits",
    "url": "http://www.epicurious.com/recipes/food/views/maverick-grits-102993"
}
