{
    "directions": [
        "In a 1 1/2-quart saucepan simmer grapes in water, uncovered, 30 minutes. Pour mixture through a fine sieve into a bowl, pressing hard on solids to extract as much liquid as possible. Transfer liquid to cleaned pan and gently boil until reduced to about 1/2 cup. Keep sauce warm, covered. Sauce may be made 1 day ahead and chilled, covered. Reheat sauce to warm before serving.",
        "Preheat oven to 400°F.",
        "Butter six 1/4-cup ramekins (2 1/2 by 1 1/4 inches) and coat with walnuts, knocking out excess walnuts.",
        "In another 1 1/2-quart saucepan heat milk and butter over moderate heat until butter is melted and bring to a boil. Add flour all at once and whisk vigorously until mixture returns to a boil. Transfer mixture to a bowl and whisk until it no longer emits steam. Whisk in yolk (mixture will be very stiff). Break half of Maytag Blue into small pieces and with a rubber spatula stir into flour mixture.",
        "In a bowl with an electric mixer beat whites until they just hold stiff peaks and whisk half of whites into cheese mixture to lighten. Add remaining whites and whisk gently until incorporated (mixture will be dense).",
        "Divide batter among ramekins and arrange in a roasting pan. Add enough hot water to roasting pan to reach halfway up sides of ramekins and bake soufflés in middle of oven until puffed and golden brown, about 30 minutes.",
        "Cut six 1/2-inch-thick slices from brioches and with a 2 1/2-inch round cutter cut a round from each slice. In a 10- to 12-inch nonstick skillet heat butter over moderately high heat until foam subsides and sauté brioche rounds until golden, about 30 seconds on each side. Break remaining half Maytag Blue into chunks.",
        "Put a brioche toast in center of each of 6 plates. Invert soufflés, 1 at a time, onto a large plate and turn right side up. Top each brioche round with a soufflé. Spoon sauce around soufflés and arrange grapes and remaining cheese on plates."
    ],
    "ingredients": [
        "3 cups Muscat grapes or other grapes (about 1 1/4 pounds)",
        "1/2 cup water",
        "3 tablespoons finely chopped walnuts (preferably black walnuts*)",
        "1/2 cup milk",
        "2 tablespoons unsalted butter",
        "1/4 cup all-purpose flour",
        "1 large egg yolk",
        "1/4 pound Maytag Blue cheese**",
        "2 large egg whites",
        "2 individual brioches (each about 3 inches in diameter)",
        "1 tablespoon unsalted butter",
        "1 cup black Corinth grapes (Champagne grapes)",
        "*available at some specialty foods shops and by mail order from American Spoon Foods, tel. (800) 222-5886",
        "**available at specialty foods and cheese shops and by mail order from Maytag Dairy Farms, tel. (800) 247-2458"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mixer",
        "Egg",
        "Fruit",
        "Bake",
        "Vegetarian",
        "Blue Cheese",
        "Walnut",
        "Fall",
        "Grape"
    ],
    "title": "Maytag Blue Cheese Souffles with Black Corinth Grapes and Muscat Grape Reduction",
    "url": "http://www.epicurious.com/recipes/food/views/maytag-blue-cheese-souffles-with-black-corinth-grapes-and-muscat-grape-reduction-15619"
}
