{
    "directions": [
        "Blend together flour, salt, and butter with your fingertips or a pastry blender (or pulse in a food processor) just until mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Drizzle evenly with 3 tablespoons water and gently stir with a fork (or pulse in processor) until incorporated.",
        "Squeeze a small handful of dough. If it doesn't hold together, add up to 1 tablespoon more water, stirring (or pulsing) until just incorporated, then test again. (Be careful not to overwork dough, or pastry will be tough.)",
        "Turn out dough onto a lightly floured surface and divide into 6 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather dough portions together with scraper and press into a ball, then flatten into a 6-inch disk. Chill, wrapped in plastic wrap, until firm, at least 30 minutes.",
        "Put oven rack in middle position |and preheat oven to 350°F.",
        "Cut potatoes into ¼-inch-thick slices and cover with cold water by 2 inches in a 1-quart saucepan. Simmer, uncovered, until tender, about 10 minutes. Drain and pat dry with paper towels.",
        "Whisk together cream and yolk until combined.",
        "Divide dough into 6 equal pieces. Roll out each piece into a 5-inch round with a floured rolling pin on a lightly floured surface, then fit each into a tartlet pan. Trim excess dough, leaving a 1/4-inch overhang, then fold overhang inward and press against side of pans to reinforce edge. Chill shells until pastry is firm, at least 10 minutes.",
        "Arrange about 4 potato slices, overlapping slightly, in each tart shell and crumble 2 tablespoons cheese into each. Divide cream mixture among tartlets, filling to 1/8 inch from top. Sprinkle each tartlet with 1/4 teaspoon each of thyme and rosemary and season lightly with fleur de sel. (If your sea salt is very coarse, lightly crush before sprinkling.)",
        "Bake tartlets on a baking sheet until bubbling and golden brown, 45 to 50 minutes. Cool in pans on a rack 10 minutes, then remove from pans and serve warm."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1/8 teaspoon salt",
        "1/2 cup cold Plugrá (ultracreamy) butter or other unsalted butter, cut into bits",
        "3 to 4 tablespoons San Pellegrino or tap water",
        "3/4 pound small red potatoes",
        "1 cup heavy cream",
        "1 large egg yolk",
        "1/4 pound Maytag blue cheese, crumbled (3/4 cup)",
        "1 1/2 teaspoons finely chopped fresh thyme",
        "1 1/2 teaspoons finely chopped fresh rosemary",
        "Fleur de sel or other coarse sea salt for sprinkling",
        "Special equipment: a pastry or bench scraper; 6 (4-inch) tartlet pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Potato",
        "Bake",
        "Vegetarian",
        "Blue Cheese",
        "Rosemary",
        "Fall",
        "Thyme",
        "Gourmet"
    ],
    "title": "Maytag Blue Cheese and Potato Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/maytag-blue-cheese-and-potato-tartlets-108663"
}
