{
    "directions": [
        "In a large bowl, combine the meat, all but 2 tablespoons of the parsley, the scallions, bulgur, egg, 2 tablespoons of the oil, the minced garlic, cumin, salt and pepper to taste. Knead well, cover and refrigerate for at least 1 hour and up to 4 hours.",
        "Shape 2-tablespoon-sized portions of the meat mixture into balls. Place on a plate, cover and refrigerate.",
        "In a large, deep skillet or Dutch oven, heat the remaining 3 tablespoons oil and saute the onion over high heat for 4 to 5 minutes, or until it starts to color. Add the chopped garlic and saute for 30 seconds. Add the wine and simmer for 1 minute. Stir in the tomatoes and cinnamon stick. Carefully add the meatballs to the skillet; the sauce should almost cover them. Add the water, bring to a boil and reduce the heat to low.",
        "Cover and simmer for 20 minutes, or until the meatballs are cooked through and the sauce has thickened. Remove the cinnamon stick, sprinkle with the remaining 2tablespoons parsley and serve."
    ],
    "ingredients": [
        "1 pound lean ground beef, veal, lamb or pork or a combination",
        "1 cup finely chopped fresh flat-leaf parsley",
        "4-5 scallions (white plus most of the green parts), finely chopped",
        "1/2 cup coarse bulgur",
        "1 large egg, lightly beaten",
        "1/3 cup olive oil",
        "4 garlic cloves, 2 minced and 2 coarsely chopped",
        "1 teaspoon ground cumin",
        "1/2 teaspoon salt",
        "Freshly ground black pepper",
        "1 large onion, halved lengthwise and sliced into half-moons",
        "1/2 cup dry red wine",
        "2 cups grated ripe tomatoes or canned diced tomatoes with their juice",
        "1 cinnamon stick",
        "1/2 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Tomato",
        "Sauté",
        "Super Bowl",
        "Fall",
        "Family Reunion",
        "Chill",
        "Parsley",
        "Bulgur",
        "Simmer"
    ],
    "title": "Meatballs with Bulgur in Onion and Tomato Sauce (Voli Me Plyguri)",
    "url": "http://www.epicurious.com/recipes/food/views/meatballs-with-bulgur-in-onion-and-tomato-sauce-voli-me-plyguri-104451"
}
