{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray 2 12-cup muffin pans with cooking spray.",
        "Place the chopped bacon and onion in a skillet, and cook over medium-high heat, stirring occasionally, until the onions are translucent and the bacon is half cooked, about 5 minutes. Drain excess fat.",
        "Place bacon mixture into a large bowl, and mix in the turkey, veal, bread crumbs, milk, eggs, steak sauce, brown sugar, garlic powder, basil, ground mustard, cumin, black pepper, sea salt, and sage until thoroughly combined. Fill  the sprayed muffin cups with meatloaf mixture, and make a hole in the center of each muffin with your little finger for even cooking.",
        "Bake in the preheated oven until the juices run clear and the internal temperature is at least 160 degrees F (70 degrees C) when measured with a meat thermometer, about 30 minutes. Brush each muffin with barbecue sauce, return to the oven, and bake 5 additional minutes.",
        "Whisk brown gravy mix and water in a saucepan, and place over medium heat. Continue whisking until the gravy comes to a boil. Reduce heat and allow to simmer until thickened, about 1 minute. To serve, place muffins in a deep serving dish, and pour the brown gravy over them."
    ],
    "ingredients": [
        "3 slices thick-cut bacon, chopped",
        "1 sweet onion, minced",
        "2 1/2 pounds ground turkey",
        "1 pound ground veal",
        "2 cups dry bread crumbs",
        "1/2 cup milk",
        "2 eggs",
        "1/3 cup steak sauce",
        "2 tablespoons light brown sugar",
        "1 tablespoon garlic powder",
        "1 tablespoon dried basil",
        "1 tablespoon dry ground mustard",
        "1 teaspoon ground cumin",
        "1 1/2 teaspoons ground black pepper",
        "1 1/2 teaspoons sea salt",
        "1 1/2 teaspoons crumbled dried sage",
        "1/2 cup barbecue sauce",
        "2 (.75 ounce) packets dry brown gravy mix",
        "2 cups water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Meatloaf Muffins With Brown Gravy",
    "url": "http://allrecipes.com/recipe/216689/meatloaf-muffins-with-brown-gravy/"
}
