{
    "directions": [
        "Soak the breadcrumbs in the heavy cream in a medium bowl.",
        "Meanwhile, saute the onions and garlic with the canola oil in a large saute pan. Once the onions are translucent, add the rosemary and then chill the mixture thoroughly.",
        "Combine the soaked bread crumbs, onion and garlic mixture, pork, sausage, veal, Parmesan, parsley and eggs in the bowl of a large electric mixer. Begin mixing on low speed. When relatively well incorporated, sprinkle with salt and pepper.",
        "Heat a small saute pan to cook a sample of the mixture. Taste for seasoning and make any necessary adjustments.",
        "Form the meatballs with a medium scoop into small balls and chill for 1 hour.",
        "Fill a Dutch oven halfway with canola oil and heat until a deep-fry thermometer inserted in the oil registers 375 degrees F. Bring the Basic Tomato Sauce to a simmer in a separate pot.",
        "Deep-fry the meatballs in the oil until golden brown, then remove to a plate lined with paper towels to drain. Transfer the meatballs to the tomato sauce and simmer until tender and cooked through, 10 to 15 minutes.",
        "Garnish with cheese and parsley and serve.",
        "In a medium saucepan, heat the olive oil over medium heat with the basil, garlic and red pepper flakes until the garlic begins to soften, about 3 minutes. Add the milled tomatoes, bring the mixture to a simmer and cook for 1 minute. Turn off and chill until ready for use."
    ],
    "ingredients": [
        "2 cups panko breadcrumbs, finely processed",
        "1 1/4 cups heavy cream",
        "1 cup small-diced sweet onions",
        "2 cloves garlic, chopped",
        "2 tablespoons canola oil, plus more for deep frying",
        "1 tablespoon fresh rosemary, chopped",
        "1 pound ground pork",
        "1 pound sweet pork sausage, no casing",
        "1 pound ground veal",
        "10 ounces Parmesan, grated, plus more for garnish",
        "1/2 cup fresh parsley, finely minced, plus more for garnish",
        "2 eggs",
        "Kosher salt and freshly ground black pepper",
        "Basic Tomato Sauce, recipe follows",
        "2 tablespoons olive oil",
        "4 fresh basil leaves",
        "1 clove garlic, chopped",
        "Pinch red pepper flakes",
        "Two 32-ounce cans tomatoes, such as San Marzano, drained and put through a food mill or food processor"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Meatballs",
        "Sauce Recipes",
        "Meat",
        "Veal",
        "Tomato",
        "Vegetable",
        "Pork"
    ],
    "title": "Meatballs",
    "url": "http://www.foodnetwork.com/recipes/geoffrey-zakarian/meatballs"
}
