{
    "directions": [
        "Heat the olive oil in a large pot over medium-low heat. Place the pork shoulder in the center of the pot and arrange 4 or 5 garlic cloves around the sides of the pan.",
        "Brown the pork roast on all sides and transfer to a large baking dish; remove garlic cloves from pot with a slotted spoon and transfer to a bowl. Repeat the process, browning pork spareribs, oxtails, and lamb shank, adding about 4 cloves of cracked garlic with each batch of meat, and transferring meats to the baking dish. Transfer each batch of garlic cloves to the bowl when cooked.",
        "While the meats are cooking, strain the cans of tomatoes and their juice. Use a food mill or press the tomatoes through a colander to remove all of the seeds and extra pulp. Discard seeds and pulp and transfer strained tomatoes to a large bowl; set aside.",
        "Cook the sausage in the olive oil in the same pot over medium heat until browned, breaking it up with a wooden spoon as it cooks, until no longer pink, 10 to 12 minutes. Transfer the cooked sausage to a large bowl and refrigerate while you complete the next steps. When all of the sausage is browned, return the reserved garlic cloves to the pot and stir in tomato paste, salt, black pepper, and red pepper flakes.",
        "Stir the tomato paste with a wooden spoon, scraping up the browned bits of meat in the pot. There will be a buildup of juices in the baking dish where the meats are resting; pour this liquid into the pot. Add the Burgundy wine and cook, stirring occasionally, until most of the liquid has evaporated, about 15 minutes.",
        "Pour in the strained tomatoes and juice and stir in the basil. Cover the pan and bring the sauce to a boil, stirring occasionally. Remove the lid and add the cooked pork shoulder, pork ribs, oxtails, and lamb shank. Reduce the heat to low and simmer, stirring occasionally, for 4 to 5 hours. (If you're adding braciole, see Cook's Note.)",
        "Remove the pork shoulder, pork spareribs, oxtails, and lamb shank. When cool enough to handle, remove the meat from the bones and finely chop it. Return meats to the pot of sauce and discard the bones.",
        "Stir the cooked sausage into the sauce; simmer for an additional 1 hour. Taste the sauce and adjust the seasonings."
    ],
    "ingredients": [
        "1/4 cup extra virgin olive oil",
        "1 (2 1/2 pound) pork shoulder roast",
        "24 cloves garlic, peeled and lightly cracked into large pieces (divided)",
        "2 pounds pork spareribs",
        "2 pounds beef oxtails, cut into pieces",
        "1 lamb shank (optional)",
        "8 (28 ounce) cans Italian-style whole peeled tomatoes",
        "1 pound hot Italian sausage, casings removed",
        "1 pound sweet Italian sausage, casings removed",
        "3 (6 ounce) cans tomato paste",
        "2 teaspoons salt, or to taste",
        "fresh ground black pepper to taste",
        "1 pinch crushed red pepper flakes",
        "1/2 cup Burgundy wine or other dry red wine",
        "8 leaves basil, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Meat Gravy",
    "url": "http://allrecipes.com/recipe/222678/meat-gravy/"
}
