{
    "directions": [
        "In a large bowl soak bread crumbs in milk 10 minutes. Finely chop onions. Add onions and remaining meatball ingredients to bread crumb mixture and with your hands blend together until just combined well (do not overmix). Form mixture into walnut-size balls and arrange on large trays or baking sheets.",
        "In a large heavy skillet heat 2 tablespoons oil over moderately high heat until hot but not smoking and brown meatballs in batches without crowding, shaking skillet to maintain round shape and adding remaining oil as necessary. Transfer meatballs as browned (and any browned onions that fall from meatballs) with a slotted spoon to a 7- to 8-quart heavy kettle.",
        "In a large sieve set over a bowl drain tomatoes, reserving juice, and chop. To meatballs add chopped tomatoes with reserved juice, garlic, and oregano and simmer, covered, 30 minutes. Transfer meatballs with a slotted spoon to a bowl and keep warm, loosely covered with foil. Briskly simmer sauce until reduced to about 2 cups, about 25 minutes. Season sauce with salt and pepper and gently stir in meatballs. (Meatballs in sauce may be made 3 days ahead and cooled completely, uncovered, before being chilled, covered. Reheat meatballs in sauce before serving.)",
        "Gently stir parsley into meatballs and sauce."
    ],
    "ingredients": [
        "1 cup fine fresh bread crumbs",
        "1 1/2 cups milk",
        "2 medium onions",
        "2 1/2 pounds ground round",
        "1 1/2 pounds ground pork",
        "1 large egg",
        "1/2 teaspoon freshly grated nutmeg",
        "2 1/2 teaspoons salt",
        "3/4 teaspoon freshly ground black pepper",
        "1/4 cup minced fresh flat-leafed parsley leaves",
        "about 1/2 cup olive oil for browning meatballs",
        "a 28- to 32-ounce can whole plum tomatoes including juice",
        "1 tablespoon minced garlic",
        "1 1/2 teaspoons dried oregano, crumbled",
        "2 tablespoons minced fresh flat-leafed parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pork",
        "Tomato",
        "Super Bowl",
        "Ground Beef",
        "Winter",
        "Gourmet"
    ],
    "title": "Meatballs in Winter Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/meatballs-in-winter-tomato-sauce-14636"
}
