{
    "directions": [
        "Roast poblano chilies over gas flame or in broiler until blackened on all sides. Enclose chilies in paper bag. Let stand 10 minutes. Peel, seed and coarsely chop chilies.",
        "Heat 2 tablespoons olive oil in heavy large skillet over medium-high heat. Add corn kernels and cook until beginning to brown, stirring occasionally, about 5 minutes. Add jalapeño chilies, garlic, cumin and oregano; sauté 2 minutes. Remove from heat. Mix in roasted poblano chilies, canned tomatoes, 1/2 cup reserved juice from canned tomatoes, green onions and cilantro. Season with salt and pepper.",
        "Cook squash in large pot of boiling salted water until crisp-tender, about 4 minutes. Drain. Set aside. Mix cheeses in medium bowl.",
        "Preheat oven to 350°F. Lightly oil 15 x 10 x 2-inch glass baking dish. Combine 5 cups water and 1 1/2 teaspoons salt in heavy large saucepan. Bring to boil. Combine cornmeal and remaining 2 cups water in medium bowl. Gradually whisk cornmeal mixture into boiling salted water. Reduce heat to medium-low. Cook until cornmeal is very tender and mixture is thick, stirring often, about 14 minutes. Remove from heat and mix in yogurt.",
        "Spread 2/3 of cornmeal over bottom of prepared dish (cover remaining cornmeal to keep warm). Arrange squash over cornmeal in dish. Sprinkle squash with salt and pepper. Sprinkle 2 cups cheese over squash. Spoon corn kernel mixture evenly over cheese, spreading with spatula. Spread remaining cornmeal evenly over corn kernel mixture. Arrange tomato slices atop cornmeal, pressing gently. Sprinkle with salt and pepper. Drizzle remaining 1/4 cup juice from canned tomatoes over. Sprinkle remaining cheese evenly over casserole.",
        "Bake casserole uncovered until heated through and top is golden, about 1 hour. (Can be made 1 day ahead. Cool slightly. Cover and refrigerate. Rewarm, covered with foil, in 350°F oven until heated through, about 30 minutes.)",
        "Let casserole stand 15 minutes. Garnish with cilantro sprigs and serve."
    ],
    "ingredients": [
        "1 pound poblano chilies",
        "2 tablespoons olive oil",
        "4 1/2 cups frozen corn kernels",
        "1 to 2 jalapeño chilies, seeded, finely chopped",
        "2 garlic cloves, chopped",
        "1 1/2 teaspoons ground cumin",
        "1 1/2 teaspoons dried oregano",
        "1 14 1/2-ounce can diced tomatoes in juice, drained, 3/4 cup juice reserved",
        "3/4 cup thinly sliced green onions",
        "1/2 cup chopped fresh cilantro",
        "12-pound butternut squash, peeled, halved lengthwise, seeded, cut crosswise into 1/2-inch-thick slices",
        "1 1/2 cups shredded sharp cheddar cheese",
        "1 1/2 cups shredded Monterey Jack cheese",
        "7 cups water",
        "1 1/2 teaspoons salt",
        "2 cups yellow cornmeal",
        "1 cup plain yogurt",
        "2 tomatoes, sliced",
        "Fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Tomato",
        "Side",
        "Bake",
        "Vegetarian",
        "Yogurt",
        "Cinco de Mayo",
        "Casserole/Gratin",
        "Cornmeal",
        "Corn",
        "Hot Pepper",
        "Butternut Squash",
        "Healthy",
        "Jalapeño",
        "Potluck"
    ],
    "title": "Meatless Tamale Pie",
    "url": "http://www.epicurious.com/recipes/food/views/meatless-tamale-pie-5882"
}
