{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the shell pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 13 minutes. Drain well in a colander set in the sink, and set aside.",
        "Melt the butter in a skillet, and cook and stir the mushrooms, onion, and garlic until the onion is translucent, about 7 minutes. Mash the tofu roughly with a fork in a bowl, and mix in the mushroom mixture, bread crumbs, spinach, Parmesan cheese, and Italian seasoning; stir until combined. If mixture seems crumbly, stir in an egg.",
        "Pour enough pasta sauce into the bottom of a 9x13-inch baking dish to coat the bottom. Fill each shell with about 1 1/2 tablespoon of filling, and place into the dish in a single layer. Spoon remaining sauce on top of shells. If there's any remaining filling, scatter that over the sauce, and sprinkle the mozzarella cheese over the top. Cover the dish with aluminum foil.",
        "Bake in the preheated oven until the filling is hot and set and the cheese is melted and bubbling, about 30 minutes."
    ],
    "ingredients": [
        "1 (12 ounce) box jumbo pasta shells",
        "2 tablespoons butter",
        "1 cup sliced mushrooms",
        "1/2 onion, chopped",
        "2 cloves garlic, minced",
        "1 (12 ounce) package firm tofu",
        "1/2 cup dry bread crumbs",
        "1/2 (10 ounce) package frozen chopped spinach, thawed and drained",
        "1/4 cup grated Parmesan cheese",
        "1 teaspoon Italian seasoning",
        "1 egg (optional)",
        "2 cups shredded mozzarella cheese",
        "1 (16 ounce) jar spaghetti sauce, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Meat-Free Stuffed Shells",
    "url": "http://allrecipes.com/recipe/218546/meat-free-stuffed-shells/"
}
