{
    "directions": [
        "Place the turkey legs into a large soup pot, and pour in chicken stock. Bring to a boil, reduce heat to medium-low, then simmer until the turkey meat begins to fall from the bones, 30 to 45 minutes. Remove the turkey legs, then drain and reserve the broth. Separate the turkey meat from the bones and tendons, and set aside.",
        "Place the bacon into the soup pot over medium heat, and cook, stirring occasionally, until the bacon is crisp and  browned, about 10 minutes. Remove the bacon pieces and drain on paper towels; set the bacon aside. Reserve about 2 tablespoons of bacon drippings in the pot. Cook and stir the leeks in the bacon drippings over medium heat until soft and wilted but not brown, about 5 minutes, then add the potato cubes, thyme, salt, black pepper, and reserved broth. Reduce heat, then simmer the mixture until the potatoes are soft, about 20 minutes.",
        "Pour the leek and potato mixture into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot.",
        "Mix in the cream, then stir in the reserved turkey meat. Heat over medium-low heat until the soup is hot; garnish  each serving with a few pieces of bacon."
    ],
    "ingredients": [
        "2 smoked turkey legs",
        "2 (48 fluid ounce) cans chicken broth",
        "6 slices bacon, coarsely chopped",
        "6 large russet potatoes, coarsely chopped",
        "3 large leeks, sliced",
        "1 teaspoon dried thyme leaves",
        "salt and pepper to taste",
        "1 cup heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Meaty Potato Leek Soup",
    "url": "http://allrecipes.com/recipe/216096/meaty-potato-leek-soup/"
}
