{
    "directions": [
        "To make the romesco sauce, put the bread in a bowl, add the vinegar and toss to coat. Let soften for about 10 minutes. In a small, dry fry pan over medium heat, toast the almonds, stirring, until just golden, about 5 minutes. Transfer to a plate and let cool completely.",
        "Drop the garlic cloves into a food processor with the motor running and process until the pieces stop moving. Add the almonds and pulse until grainy. Add the bread and vinegar mixture, the tomatoes with their juices, peppers, paprika and salt and process until smooth. With the motor running, add the olive oil in a slow, steady stream and process just until emulsified or thoroughly mixed. Taste and adjust the seasoning. Cover and refrigerate for 1 hour to allow the flavors to marry. The sauce will keep in the refrigerator for up to 3 days.",
        "To make the meatballs, put the bread in a bowl, add the milk and soak for 10 minutes, turning the bread to moisten it evenly. Squeeze most of the milk from the bread and tear it into small pieces. In a large bowl, combine the bread, ground pork, ground beef, onion, parsley, oregano, cheese, egg, salt and a good grinding of pepper. Blend with a fork, breaking up the ground meat. Using your hands, mix gently but thoroughly. Refrigerate for 1 hour.",
        "Line a rimmed baking sheet with parchment paper. Using an ice cream scoop, form about 18 meatballs the size of golf balls, placing them on the prepared sheet. Refrigerate for 1 hour.",
        "Put the romesco sauce in the top of a double boiler over gently simmering water and cover. Preheat a broiler and place a rack about 3 inches (7.5 cm) from the heat source. Slide the baking sheet in the broiler and brown the meatballs, turning them once or twice with tongs, until golden brown and firm, 8 to 15 minutes. To test the meatballs, cut into one to make sure it is no longer pink at the center. Transfer the meatballs to the warm sauce. Cover and cook for 5 minutes, turning the meatballs occasionally and spooning the sauce over the top. Serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "The Cook and The Butcher,",
        "by Brigit Binns (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "4 slices coarse country bread, crusts removed, bread torn into\n  chunks",
        "6 Tbs. (3 fl. oz./90 ml) red wine vinegar",
        "2/3 cup (3 oz./90 g) slivered almonds",
        "2 garlic cloves",
        "1/2 cup (3 1/2 oz./105 g) canned diced tomatoes with juices",
        "2 canned roasted piquillo peppers, drained",
        "2 tsp. smoked paprika",
        "1/2 tsp. kosher salt",
        "1/2 cup (4 fl. oz./125 ml) extra-virgin olive oil",
        "6 slices sandwich-style white bread, crusts removed",
        "3/4 cup (6 fl. oz./180 ml) milk",
        "1/2 lb. (250 g) ground pork",
        "1/4 lb. (125 g) ground beef chuck (20 percent fat)",
        "1 small white or yellow onion, finely chopped",
        "1/4 cup (1/3 oz./10 g) minced fresh flat-leaf parsley and/or dill",
        "1 Tbs. dried oregano",
        "1/4 cup (1 oz./30 g) grated Parmigiano-Reggiano cheese",
        "1 egg, lightly beaten",
        "1/2 tsp. kosher salt",
        "Freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Meatballs in Romesco Sauce",
    "url": "http://www.williams-sonoma.com/recipe/meatballs-in-romesco-sauce.html"
}
