{
    "directions": [
        "Place the ground beef in a large bowl and sprinkle the hamburger seasoning over the meat. Using your hands, gently mix the ingredients together; do not overmix. Form the mixture into 48 balls, each about 1 1/2 inches in diameter. Set aside.",
        "In a large electric skillet or fry pan over medium-high heat, warm the 2 Tbs. olive oil until almost smoking. Add the onion, salt and black pepper and cook, stirring occasionally, until the onion is tender and lightly caramelized, 8 to 10 minutes. Add the red pepper flakes and cook for 1 minute. Transfer the onion to a plate.",
        "Add more oil to the skillet if needed. Add the meatballs and brown on all sides, 10 to 12 minutes total. Return the onion to the skillet, add the pasta sauce and stir to combine, scraping up the browned bits from the pan bottom. Reduce the heat to medium-low, cover and simmer, stirring occasionally, for 20 minutes.",
        "Cut the rolls in half horizontally; leave one long side intact, if desired. Sprinkle the mozzarella on the bottoms of the rolls. For each sandwich, place 3 to 4 meatballs and sauce on the mozzarella. Sprinkle with the pecorino romano and oregano. Cover the sandwiches with the tops of the rolls and serve immediately. Makes 12 sandwiches.",
        "Williams-Sonoma Kitchen",
        "* Available at Williams-Sonoma stores."
    ],
    "ingredients": [
        "3 lb. ground beef",
        "6 Tbs. hamburger seasoning*",
        "2 Tbs. olive oil, plus more as needed",
        "1 red onion, thinly sliced",
        "Salt and freshly ground black pepper, to taste",
        "1/4 tsp. red pepper flakes",
        "1 jar (26 oz.) pecorino romano pasta sauce*",
        "12 French rolls, warmed",
        "8 oz. mozzarella cheese, grated",
        "6 Tbs. grated pecorino romano cheese",
        "2 Tbs. finely chopped fresh oregano"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Meatball Subs",
    "url": "http://www.williams-sonoma.com/recipe/meatball-subs.html"
}
