{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Spray a 9x13-inch dish with cooking spray.",
        "Heat a large nonstick skillet over medium-high heat and stir in the ground beef and ground pork. Cook and stir until the meat is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Stir in the onion, bell pepper, and celery. Cover and reduce the heat to medium; cook, stirring frequently, until the vegetables have softened and the onion is translucent, about 5 minutes.",
        "Make a well in the center of the skillet and put the minced garlic directly on the bottom of the pan. Cook for 30 to 60 seconds or until fragrant, and then blend the garlic with the meat mixture. Add the carrot, potato, bay leaf, thyme, parsley, Worcestershire sauce, seasoning blend, and salt and pepper.",
        "Dissolve the bouillon cubes in the hot water in a bowl, and pour it into the meat mixture; mix well. Bring to a boil, reduce the heat to low, cover, and simmer until the carrots are soft, 10 to 15 minutes.",
        "Lay one sheet of puff pastry in the prepared baking dish. Gently press the pastry into the corners and up the sides of the dish. With a slotted spoon, transfer the meat into the crust and spread evenly. Avoid adding liquid to the pie. Top with Cheddar cheese.",
        "Whisk together the egg yolk and 1 tablespoon water. Brush the edges of the bottom puff pastry sheet. Lay the second sheet of puff pastry over the baking dish, pressing with a fork to seal the edges. Brush the surface with egg wash and pierce with a fork several times to vent the crust.",
        "Bake in the preheated oven until the pastry is golden brown and the filling is bubbling, about 50 minutes. Check after 15 minutes to prevent over-browning (tent with aluminum foil, if necessary). Remove the pie from the oven and let stand for 10 minutes before serving."
    ],
    "ingredients": [
        "1 pound ground beef",
        "1/2 pound ground pork",
        "1 large onion, chopped",
        "1 green bell pepper, chopped",
        "2 stalks celery, finely diced",
        "3 cloves garlic, minced",
        "1 small carrot, finely chopped",
        "1 large baking potato, peeled and finely chopped",
        "1 bay leaf",
        "1 teaspoon dried thyme leaves",
        "2 tablespoons chopped fresh parsley",
        "1 teaspoon Worcestershire sauce",
        "salt-free seasoning blend to taste",
        "salt and pepper to taste",
        "2 beef bouillon cubes",
        "1 cup hot water",
        "2 cups shredded mild Cheddar cheese",
        "2 sheets frozen puff pastry, thawed",
        "1 egg yolk",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Meat Pie, Southern Version",
    "url": "http://allrecipes.com/recipe/216874/meat-pie-southern-version/"
}
