{
    "directions": [
        "In a large, heavy-bottom sauté pan, heat 2 tablespoons of the oil over medium heat and add the onion, celery, marjoram, and thyme. Season with salt and pepper and cook over medium-low heat, stirring regularly with a wooden spoon, until the vegetables are soft and translucent but not browned. Remove from the heat and transfer to a large mixing bowl to cool.",
        "Preheat the oven to 350˚F.",
        "Once the vegetable mixture is cool, add the beef, veal, eggs, bread crumbs, and about 2 teaspoons salt and 1/2 teaspoon pepper and mix well with scrupulously clean or rubber-gloved hands. Use the remaining 1/2 tablespoon oil to grease a loaf pan and transfer the mixture to the pan, packing it down gently. Cover the loaf with foil and place the loaf pan on a sheet pan. Cook in the oven for 1 hour.",
        "Remove the foil and spread the top of the meat loaf with the tomato paste. Continue to cook for another 30 to 45 minutes, until the instant-read thermometer inserted into the center reaches 150˚F. Remove from the oven and let the meat loaf rest, in the loaf pan, on a wire rack.",
        "While it rests, make the gravy. In a large, heavy-bottom sauté pan, heat the butter until it foams and subsides. Add the diced mushrooms and cook over high heat, stirring occasionally, until their released juices evaporate and the mushrooms begin to squeak against the surface of the pan when stirred. Add the shallots and salt and pepper to taste and continue to cook until the mushrooms get browned and the shallots are translucent or slightly golden, 3 to 5 minutes. Sprinkle the flour over the mushrooms and stir well to evenly coat. Cook over medium heat, stirring more or less constantly, for about 2 minutes, to cook off the raw flour taste, then stir in the stock. Whisk the mixture to pull the stuck flour up from the surface of the pan and into the gravy. Add a splash more stock or water if necessary if the mixture seems too thick, then reduce the heat to low and stir in the cream. Taste and season with salt and pepper as needed.",
        "Serve the meat loaf in slices, with the gravy ladled over or alongside. Accompany with mashed potatoes if you like."
    ],
    "ingredients": [
        "2 1/2 tablespoons canola oil",
        "1 large yellow or white onion, peeled and very finely chopped",
        "3 ribs celery, very finely chopped",
        "2 sprigs fresh marjoram, leaves only, very finely chopped",
        "3 sprigs fresh thyme, leaves only, very finely chopped",
        "Salt and finely ground black pepper to taste",
        "2 pounds ground beef chuck",
        "1 1/3 pounds ground veal",
        "3 eggs, lightly beaten",
        "1 cup panko bread crumbs",
        "1/4 cup tomato paste",
        "3 tablespoons unsalted butter",
        "1 pound cremini mushrooms, diced",
        "2 large or 3 to 4 shallots, peeled and finely chopped (about 1/2 cup)",
        "2 tablespoons all-purpose flour",
        "1 1/4 cups veal stock",
        "1/2 cup heavy cream",
        "Instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Anthony Bourdain",
        "Meatloaf",
        "Ground Beef",
        "Beef",
        "Veal",
        "Mushroom",
        "Dinner"
    ],
    "title": "Meat Loaf With Mushroom Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/meat-loaf-with-mushroom-gravy"
}
