{
    "directions": [
        "Preheat oven to 500 degrees F (260 degrees C).",
        "Combine soft bread crumbs, dry bread crumbs, and milk in a large bowl and allow to soak until the bread crumbs absorb most of the milk, about 10 minutes. Add ground beef, Italian sausage, 1 cup marinara sauce, eggs, garlic, Italian seasoning, and red pepper flakes and mix until thoroughly combined. Form into 16 large meatballs.",
        "Heat 1 cup olive oil in a large pot or Dutch oven over medium-high heat. Cook meatballs until browned, about 10 minutes. Transfer to a baking sheet and bake in the preheated oven until no longer pink in the center, about 10 minutes.",
        "Bring 1 cup marinara sauce to a simmer in a large saucepan over medium heat. Add cooked meatballs and heat through, about 5 minutes.",
        "Heat 1 tablespoon olive oil in a large skillet over medium-high heat; cook and stir onion, red bell pepper, and serrano pepper in the hot oil until onion softens, 5 to 6 minutes. Add Marsala wine, salt, and black pepper; cook until wine has evaporated and onion turns golden, about 10 minutes.",
        "Spread each hoagie bun with 1/4 cup mascarpone cheese and 1 tablespoon garlic basil spread. Place four meatballs and a spoonful of marinara sauce on top. Sprinkle each sandwich with 1 cup mozzarella cheese.",
        "Place sandwiches onto a baking sheet and bake in the preheated oven until cheese is melted and buns are toasted, about 5 minutes. Top each sandwich with 1/4 of the onion mixture; garnish each sandwich with 2 tablespoons of basil and 2 tablespoons of Parmesan cheese."
    ],
    "ingredients": [
        "Meatballs:",
        "1 cup soft bread crumbs",
        "1 cup dry bread crumbs",
        "1/2 cup milk",
        "1 pound ground beef",
        "1 pound sweet Italian sausage",
        "1 cup prepared marinara sauce",
        "2 eggs",
        "1 tablespoon minced garlic",
        "1 tablespoon Italian seasoning",
        "1 teaspoon red pepper flakes",
        "1 cup olive oil for frying",
        "1 cup prepared marinara sauce",
        "Filling:",
        "1 tablespoon olive oil",
        "1 onion, sliced",
        "1 red bell pepper, sliced",
        "1 serrano pepper, sliced",
        "2 tablespoons Marsala wine",
        "salt and ground black pepper to taste",
        "Assembly:",
        "4 Italian-style hoagie buns, split lengthwise",
        "1 cup mascarpone cheese, divided",
        "1/4 cup garlic basil spread (see footnote for recipe link)",
        "4 cups shredded mozzarella cheese, divided",
        "1/2 cup chopped fresh basil, divided",
        "1/2 cup grated Parmesan cheese, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Meatball Grinder",
    "url": "http://allrecipes.com/recipe/230485/meatball-grinder/"
}
