{
    "directions": [
        "Preheat the oven to 375 degrees F.",
        "Combine the meat, panko, milk, bell peppers, onion, garlic, herbs, Worcestershire sauce, coriander, onion powder, salt, black pepper, white pepper and eggs in a large mixing bowl. By hand, fold all the ingredients together until thoroughly mixed. Remove a small amount of the mixture and sear it in clarified butter in a skillet over medium heat until cooked through, 4 to 5 minutes, to test for flavor and consistency. The meat may appear under-seasoned; this is okay.",
        "In a separate mixing bowl, combine the mushrooms and Bistro Sauce and mix thoroughly. Place the mushrooms in a fine-mesh sieve set over a bowl and let the excess sauce drain off and collect in a bowl; reserve for the glaze.",
        "Line a sheet pan with the bacon in a crisscross weave pattern. Put approximately half the meatloaf mix into the pan and spread out evenly. Make a vein of mushrooms that runs down the entire center of the pan. Take the rest of the meatloaf mix and cover the mushrooms in an even layer. Fold the bacon over the meatloaf. Flip the meatloaf over onto a lined sheet pan.",
        "Bake the meatloaf for 20 minutes. Lower the oven temperature to 350 degrees F. Cover the meatloaf with foil and continue baking until the internal temperature reaches 165 degrees F, about 20 additional minutes. Combine the reserved Bistro Sauce with the ketchup and refrigerate until ready to serve. Top the meatloaf with the sauce before serving.",
        "Combine the tomatoes, soda, soy sauce, Worcestershire sauce, garlic powder, pepper, sugar, Italian seasoning, salt, sriracha, raisins and 1/2 cup water in a large saucepan over medium heat. Cook until reduced by two-thirds, 45 minutes to 1 hour."
    ],
    "ingredients": [
        "5 pounds 80-percent beef 20-percent pork ground meat blend",
        "1 1/4 cups panko breadcrumbs",
        "1/2 cup milk",
        "1/2 cup small-dice green bell pepper",
        "1/2 cup small-dice red bell pepper",
        "1/2 cup small-dice sweet onion",
        "1/4 cup minced garlic",
        "1/4 cup minced mixed fresh parsley and chives",
        "1/4 cup Worcestershire sauce",
        "2 tablespoons ground coriander",
        "2 tablespoons onion powder",
        "1 tablespoons kosher salt",
        "1/2 tablespoon ground black pepper",
        "1/2 tablespoon ground white pepper",
        "2 eggs",
        "Clarified butter, for searing",
        "1 quart sliced crimini mushrooms",
        "1/2 cup Bistro Sauce, recipe follows",
        "16 strips bacon",
        "2 cups ketchup",
        "One 102-ounce (#10 can) tomato fillets",
        "8 cups soda, such as Coca-Cola",
        "2 cups soy sauce",
        "2 cups Worcestershire sauce",
        "1/2 cup garlic powder",
        "1/2 cup ground black pepper",
        "1/2 cup sugar",
        "1/4 cup Italian seasoning",
        "1/4 cup kosher salt",
        "2 tablespoons sriracha",
        "1 pound raisins"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Meatloaf",
        "Meat",
        "Bacon Recipes",
        "Main Dish Recipes"
    ],
    "title": "Meatloaf",
    "url": "http://www.foodnetwork.com/recipes/meatloaf"
}
