{
    "directions": [
        "To make the pizza dough, in a small bowl, dissolve the yeast and sugar in the warm water and let stand until foamy, about 5 minutes.",
        "In the bowl of a food processor fitted with the dough blade, combine the 2 cups flour and the salt and process with 3 or 4 pulses. With the motor running on the dough speed, slowly add the yeast mixture, allowing each addition to be absorbed before adding more. Slowly drizzle in the 1 Tbs. olive oil and continue processing until the dough forms a ball and cleans the sides of the bowl, about 1 minute, then process for 1 minute more.",
        "Coat the inside of a large bowl with olive oil and place the dough in the bowl. Cover with plastic wrap and let the dough rise in a warm place until doubled in size, about 1 hour. Transfer the dough to a lightly floured work surface. Divide the dough into 3 equal pieces and roll each into a ball. Place on a flour-dusted baking sheet and cover tightly with plastic wrap. Let stand at room temperature for 30 to 45 minutes.",
        "Meanwhile, using the bread crumbs, milk, beef, pork, meatball starter and egg, prepare the meatballs according to the meatball starter package instructions. In a large nonstick fry pan over medium heat, warm the olive oil. Working in batches, brown the meatballs on all sides, 8 to 10 minutes per batch. Transfer to a large plate. Pour the tomato sauce into the same pan, add the meatballs and simmer for 5 to 7 minutes. Transfer the meatballs to a large plate and cut each one in half.",
        "Place a pizza stone in a convection or regular oven. Preheat the oven to 450ºF for 20 minutes.",
        "On a floured work surface, roll out 1 ball of dough into an 11-inch round about 1/8 inch thick, dusting with flour as needed. Transfer to a well-floured pizza peel and spread 1/3 cup of the tomato sauce on the dough. Top with 1 cup of the mozzarella cheese and place one-third of the meatballs, cut side down, on top.",
        "Carefully slide the pizza onto the preheated pizza stone. Bake until the crust is crisp and the cheese is bubbly, about 12 minutes. Using the pizza peel, transfer the pizza to a cutting board.",
        "Repeat with the remaining 2 balls of dough, sauce and toppings. Lightly sprinkle the pizzas with the basil, oregano and Parmigiano-Reggiano cheese. Cut into slices and serve immediately. Makes three 11-inch pizzas."
    ],
    "ingredients": [
        "2 tsp. active dry yeast",
        "1 tsp. sugar",
        "1 cup warm water (105º to 110ºF)",
        "2 cups bread flour, plus more for dusting",
        "1 1/2 tsp. kosher salt",
        "1 Tbs. olive oil, plus more for coating bowl",
        "",
        "1/2 cup fresh bread crumbs",
        "2 Tbs. milk",
        "1/2 lb. ground beef",
        "1/2 lb. ground pork",
        "6 Tbs. meatball starter",
        "1 egg, lightly beaten",
        "1 Tbs. olive oil",
        "1 1/2 cups prepared tomato sauce",
        "",
        "3 cups shredded mozzarella cheese",
        "1/3 cup julienned fresh basil",
        "1 1/2 Tbs. fresh oregano leaves",
        "1/2 cup grated Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Meatball Pizzas",
    "url": "http://www.williams-sonoma.com/recipe/meatball-pizzas.html"
}
