{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x9-inch baking dish.",
        "Place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Mash the potatoes with a potato masher, and set aside.",
        "Heat olive oil in a skillet over medium heat. Cook and stir the onion and garlic until the onion is translucent, about 5 minutes. Set the onion and garlic aside.",
        "In a large bowl, mix the ground beef, bread crumbs, parsley, salt, black pepper, onion and garlic mixture, eggs, chicken broth, and Romano cheese until thoroughly combined. In a second bowl, mix the mashed potatoes and ricotta cheese.",
        "Spoon half the meat mixture into the prepared baking dish, and smooth into an even layer with a spoon. Spread the mashed potato mixture over the meat, leaving a 1/2-inch border around the edge of the meat; sprinkle 1 cup  mozzarella cheese over the mashed potato layer. Cover the cheese with the remaining meat mixture in an even layer; press the edges down to seal in the mashed potatoes. Sprinkle loaf with additional 2 tablespoons of mozzarella cheese, if desired.",
        "Bake in the preheated oven until the loaf is browned and the meat is no longer pink, about 1 hour. An instant-read meat thermometer inserted into the center of the loaf should read at least 160 degrees F (70 degrees C). Let the loaf stand for 10 minutes before serving."
    ],
    "ingredients": [
        "3 potatoes, peeled and cubed",
        "1/4 cup olive oil",
        "1 sweet onion, finely chopped",
        "3 cloves garlic, minced",
        "1 1/2 pounds ground beef",
        "1 cup Italian seasoned bread crumbs",
        "1 tablespoon fresh parsley, minced",
        "1 teaspoon salt (optional)",
        "1 teaspoon ground black pepper",
        "2 eggs, beaten",
        "1/2 cup chicken broth",
        "1/2 cup Romano cheese, grated",
        "1 (8 ounce) container ricotta cheese",
        "1 cup shredded mozzarella cheese",
        "2 tablespoons shredded mozzarella cheese (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Meatloaf With a Twist",
    "url": "http://allrecipes.com/recipe/217154/meatloaf-with-a-twist/"
}
