{
    "directions": [
        "Blend parsley, eggs, Worcestershire sauce, basil leaves, garlic, kosher salt, black pepper, and Italian seasoning in a food processor until herbs are finely chopped.",
        "Heat 1 teaspoon olive oil in a skillet over medium-high heat. Cook and stir onion in hot oil until translucent and nearly caramelized, about 10 minutes. Remove from heat.",
        "Stir egg mixture, onion, mozzarella cheese, Parmesan cheese, and ricotta cheese together in a large bowl. Add ground beef, Italian sausage, and fresh bread crumbs to egg mixture; mix. Shape into 1 1/2-inch meatballs.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Heat 1 cup olive oil in a large nonstick pan over medium-high heat. Cook meatballs in oil until seared evenly all around, 4 to 5 minutes per meatball; transfer to a nonstick baking sheet.",
        "Bake meatballs in preheated oven until cooked through, 15 minutes.",
        "Heat marinara sauce in a large pot over medium heat. Transfer meatballs to marinara sauce using a slotted spoon. Bring mixture to a boil, reduce heat to low, and simmer for a least 1 hour."
    ],
    "ingredients": [
        "1/2 cup chopped fresh flat-leaf parsley",
        "2 large eggs",
        "3 tablespoons Worcestershire sauce",
        "6 leaves fresh basil, or to taste",
        "3 cloves garlic, minced",
        "1 1/2 teaspoons kosher salt",
        "1 teaspoon ground black pepper",
        "1 teaspoon Italian seasoning",
        "1 teaspoon olive oil",
        "1 large yellow onion, finely chopped",
        "1 cup shredded mozzarella cheese",
        "2/3 cup freshly grated Parmesan cheese",
        "3 tablespoons ricotta cheese",
        "2 pounds ground beef chuck",
        "1 pound Italian pork sausage",
        "2 cups fresh bread crumbs",
        "1 cup olive oil for frying",
        "6 cups bottled marinara sauce, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Meatballs Divine",
    "url": "http://allrecipes.com/recipe/234184/meatballs-divine/"
}
