{
    "directions": [
        "Mix all meats, panko, 1/2 cup water, 6 tablespoons cheese, egg, egg yolk, 1/4 cup parsley, 1 teaspoon salt, and 1/2 teaspoon black pepper in large bowl. Form into eighteen 2-inch-meatballs.",
        "Heat vegetable oil in large skillet over medium-high heat. Working in batches, fry meatballs until brown all over. Transfer to plate. Pour off drippings from skillet. Reduce heat to medium. Add olive oil to skillet. Add onion, garlic, basil, and fennel seeds. Sauté until onion begins to brown, about 5 minutes. Add all tomatoes with juices. Bring to boil, scraping up browned bits. Reduce heat to low, cover with lid slightly ajar, and simmer, stirring occasionally, about 30 minutes.",
        "Puree sauce in processor until almost smooth. Return to same skillet. Add meatballs. Cover with lid slightly ajar and simmer until meatballs are cooked through, stirring occasionally, about 30 minutes longer. DO AHEAD: Can be made 1 day ahead. Cover; chill.",
        "Place arugula leaves on bottom of each roll, if desired. Top each with 1 meatball. Drizzle meatballs with some of sauce and sprinkle with remaining 2 tablespoons parsley and 2 tablespoons. cheese. Cover with tops of rolls.",
        "*Sold in the Asian foods section of some supermarkets and at Asian markets."
    ],
    "ingredients": [
        "1/2 pound ground beef",
        "1/2 pound ground pork",
        "1/2 pound ground veal",
        "1/2 cup panko (Japanese breadcrumbs)*",
        "1/2 cup water",
        "8 tablespoons freshly grated Pecorino Romano cheese, divided",
        "1 large egg",
        "1 large egg yolk",
        "1/4 cup plus 2 tablespoons chopped fresh parsley",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/4 cup vegetable oil",
        "2 tablespoons olive oil",
        "1 cup chopped onion",
        "6 garlic cloves, chopped",
        "1/4 cup (packed) fresh basil leaves",
        "1 1/2 teaspoons fennel seeds",
        "1 28-ounce can whole peeled tomatoes",
        "1 14.5-ounce can whole peeled tomatoes",
        "Arugula leaves (optional)",
        "18 small soft rolls, split horizontally"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Cheese",
        "Garlic",
        "Onion",
        "Pork",
        "Tomato",
        "Fry",
        "Kid-Friendly",
        "High Fiber",
        "Basil",
        "Veal"
    ],
    "title": "Meatball Sliders",
    "url": "http://www.epicurious.com/recipes/food/views/meatball-sliders-239792"
}
