{
    "directions": [
        "Preheat oven to 450 degrees F.",
        "Place ground sirloin in a large mixing bowl and punch a well into the center of meat. Fill well with the egg, bread crumbs, onion, garlic, red pepper flakes, Worcestershire, parsley, cheese, and a little salt and pepper. Mix up meatball ingredients until well combined, yet not over-mixed. Divide mix into 4 equal parts, roll each part into 4 balls and space equally onto a nonstick baking sheet. Place meatballs in oven and roast about 12 minutes. Break a meatball open and make sure meat is cooked through before removing from the oven.",
        "Heat a medium saucepan over medium heat. Add oil and garlic. When garlic starts sizzling, add herbs and crushed pepper. Allow oil to infuse for half a minute, then stir in the tomatoes and season sauce with salt and pepper. Bring sauce to a bubble, reduce heat, and simmer until meatballs are removed from oven.",
        "Combine meatballs and sauce and pile into sub rolls, 4 meatballs per sub. Top with shredded cheese and place under subs under broiler to melt cheese. Top with shredded basil or arugula and serve with a pile of Oven Fries.",
        "Drizzle potatoes with a generous pour of extra-virgin olive oil. Toss potatoes with seasoning blend or coarse salt and pepper. Place potatoes on a nonstick baking sheet and roast 20 minutes or until just tender. Give the baking sheet a good shake after 10 minutes to avoid sticking."
    ],
    "ingredients": [
        "1 1/2 pounds ground sirloin",
        "1 large egg, beaten",
        "1 cup (3 handfuls), Italian bread crumbs",
        "1 medium onion, chopped fine",
        "4 cloves garlic, crushed and minced",
        "1/2 teaspoon crushed red pepper flakes",
        "2 teaspoons (several drops) Worcestershire sauce,",
        "1/4 cup (a couple of handfuls) flat-leaf parsley leaves, chopped",
        "1/4 cup (a couple of handfuls) grated Parmigiano or Romano",
        "Coarse salt and black pepper",
        "2 tablespoons extra-virgin olive oil, (2 turns around the pan)",
        "4 cloves garlic, crushed and chopped",
        "1/2 teaspoon crushed red pepper flakes",
        "A handful flat-leaf parsley leaves, chopped, about 2 tablespoons",
        "1/2 teaspoon dried oregano",
        "One 28-ounce can crushed tomatoes",
        "One 14-ounce can chunky style crushed tomatoes",
        "Salt and freshly ground black pepper",
        "4 semolina crusty sub rolls, with or without sesame seeds",
        "One 10-ounce bag (2 1/2 cups) shredded Provolone or Italian 4-cheese blend",
        "Shredded basil (sweet) or shredded arugula (spicy) leaves, for garnish",
        "Oven Fries, as an accompaniment, recipe follows",
        "4 medium white skinned potatoes, each cut into 8 wedges lengthwise",
        "Extra-virgin olive oil, to coat",
        "Grill seasoning blend or coarse salt and black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian Meatball",
        "Italian",
        "Meatballs",
        "European Recipes",
        "Sandwich",
        "Cheese",
        "Provolone Recipes",
        "Tomato",
        "Vegetable",
        "Beef",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Meatball Subs",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/meatball-subs-recipe"
}
