{
    "directions": [
        "Combine bread, milk, onion, garlic, salt, oregano, and pepper in large bowl. Mash with fork until thick paste forms. Mix in beef, pork, tomatoes, eggs, and mint (mixture will be soft). Using 1/4 cupful for each, form mixture into 2-inch balls. Place on baking sheet; chill while making sauce.",
        "Line heavy small skillet with foil; add chiles and garlic. Cook over medium-high heat until skins begin to blister and blacken, turning frequently, about 15 minutes. Cool garlic slightly, then peel. Working in batches, puree tomatoes with juices, whole chiles, and garlic in blender until almost smooth. (Meatballs and puree can be prepared 6 hours ahead. Keep meatballs refrigerated. Cover and refrigerate puree.)",
        "Heat oil in heavy large wide pot over medium-high heat. Add tomato puree, 1 cup water, and salt; bring to boil. Carefully add meatballs; bring to simmer. Reduce heat, cover, and simmer until meatballs are cooked through, stirring occasionally, about 30 minutes. Uncover and boil gently until liquid is reduced to sauce consistency, stirring occasionally, about 18 minutes.",
        "Spoon Mexican White Rice into 6 shallow bowls. Top rice with meatballs and tomato-serrano sauce and serve."
    ],
    "ingredients": [
        "4 4x4-inch crustless squares firm white sandwich bread, torn into small pieces",
        "1/3 cup whole milk",
        "1/4 cup finely chopped white onion",
        "3 garlic cloves, minced",
        "2 teaspoons fine sea salt",
        "1 teaspoon dried Mexican oregano",
        "1/2 teaspoon ground black pepper",
        "1 pound lean ground beef",
        "1 pound lean ground pork",
        "1 cup finely chopped seeded tomatoes (about 4 medium)",
        "2 large eggs",
        "1/4 cup chopped fresh mint",
        "4 medium serrano chiles, stemmed",
        "2 garlic cloves, unpeeled",
        "4 14 1/2-ounce cans diced tomatoes in juice",
        "1/4 cup canola oil",
        "1 cup water",
        "1 teaspoon fine sea salt",
        "Mexican White Rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Tomato",
        "Mint",
        "Ground Beef",
        "Hot Pepper",
        "Simmer"
    ],
    "title": "Meatballs in Tomato-Serrano Chile Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/meatballs-in-tomato-serrano-chile-sauce-108051"
}
