{
    "directions": [
        "Preheat an oven to 350°F (180°F).",
        "To make the relish, coat a large skillet with olive oil and place over medium heat. Sauté the onion, garlic and bay leaves until aromatic and starting to soften, about 3 minutes. Add the red peppers and a large pinch of salt and cook until softened. Add the tomatoes and stir in the parsley, ketchup and Worcestershire; season to taste with additional salt and pepper. Simmer the relish for 5 minutes to pull all the flavors together. Remove from the heat and let cool to room temperature.",
        "To make the meatloaf, tear the bread into small pieces, place in a large bowl with the cream and let the bread soak up the liquid. Add the beef, pork and half of the relish. Mix well and season generously with salt and pepper.",
        "Line a baking sheet with parchment paper. Transfer the meatloaf mixture to the baking sheet. Using your hands, form it into a loaf about 5 inches (13 cm) wide and running the length of the baking sheet. (This creates more surface area and more crust, and it makes the meatloaf easier to slice and serve than if it were cooked in a loaf pan.) Using the edge of your hand, make a long indentation in the center of the loaf, and pour in the rest of the relish.",
        "Bake the meatloaf until the juices run clear and the meat is tender, 1 to 1 1/2 hours. When it is done, the meatloaf should spring back lightly when pressed and the internal temperature should be 155°F (68°C). Remove the meatloaf from the oven and let it cool a bit before slicing.",
        "To make the sauce, while the meatloaf is cooling, pour the drippings from the baking sheet into a blender; you should have about 1 cup (8 fl. oz./250 ml). Add the ketchup. Blend until well incorporated and thickened.",
        "To make the salad, toss together the watercress, basil, dill, radishes and fennel. Top with shavings of Parmesan and serve alongside the meatloaf. Serves 6.",
        "Adapted from",
        "Inside the Test Kitchen: 120 New Recipes, Perfected,",
        "by Tyler Florence (Clarkson Potter, 2104)"
    ],
    "ingredients": [
        "Extra-virgin olive oil as needed",
        "1 onion, finely diced",
        "2 garlic cloves, minced",
        "2 bay leaves",
        "2 red bell peppers, seeded and finely diced",
        "Kosher salt, to taste",
        "2 ripe tomatoes, halved, seeded and finely diced",
        "1/4 cup (1/3 oz./10 g) chopped fresh flat-leaf parsley",
        "1 1/2 cups (12 fl. oz./375 ml) ketchup",
        "1 Tbs. Worcestershire sauce",
        "Freshly ground pepper, to taste",
        "4 slices buttermilk or white bread, crusts removed",
        "1 cup (8 fl. oz./250 ml) heavy cream",
        "1 1/2 lb. (24 oz./750 g) ground beef",
        "1 lb. (16 oz./500 g) ground pork",
        "Kosher salt and freshly ground pepper, to taste",
        "Reserved drippings from meatloaf pan",
        "1/2 cup (4 fl. oz./125 ml) ketchup",
        "1 bunch watercress",
        "10 basil leaves, torn",
        "1/4 bunch fresh dill, stems removed",
        "4 radishes, shaved",
        "1/2 fennel bulb, shaved",
        "Shavings of Parmesan cheese, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Meatloaf with Tomato Relish",
    "url": "http://www.williams-sonoma.com/recipe/meatloaf-with-tomato-relish.html"
}
