{
    "directions": [
        "In a 9-inch heavy well-seasoned skillet (preferably cast-iron) cook onion and bell pepper in 2 tablespoons oil over moderately low heat, stirring occasionally, until softened and cool mixture. In a large bowl combine well onion mixture, ground meat, bread crumbs, salt, nutmeg, and parsley. Form level tablespoons of mixture into balls (about 90). In skillet heat 1 tablespoon oil over moderately high heat until hot but not smoking and brown meatballs in batches (about 16 at a time), shaking skillet frequently so that meatballs maintain their shape and adding remaining 3 tablespoons oil as necessary. Transfer meatballs with a slotted spoon as browned to a bowl.",
        "In a heavy kettle (at least 6 quarts) cook garlic in oil over moderately low heat, stirring, until fragrant, about 15 seconds. Add tomatoes with juice and oregano and simmer, breaking up tomatoes.",
        "Add meatballs and simmer, covered, gently stirring occasionally, 25 minutes, or until meatballs are tender and sauce is thickened slightly. Transfer meatballs with slotted spoon to heated serving dish. If sauce seems thin, boil gently, stirring frequently, until thickened to desired consistency. Season sauce with salt and pepper and spoon over meatballs. Meatballs and sauce may be made 2 days ahead, cooled, uncovered, and chilled, covered. Reheat meatballs before serving."
    ],
    "ingredients": [
        "1 large onion, chopped fine",
        "1 large green bell pepper, chopped fine",
        "1/4 cup plus 2 tablespoons olive oil",
        "2 pounds ground beef (not lean)",
        "1/2 pound ground pork (not lean)",
        "2/3 cup fine dry bread crumbs",
        "2 1/2 teaspoons salt",
        "1/4 teaspoon freshly grated nutmeg",
        "1/4 cup minced fresh parsley leaves",
        "for sauce",
        "4 large garlic cloves, minced",
        "1 tablespoon olive oil",
        "a 33 1/2 ounce can whole tomatoes, including juice",
        "3/4 teaspoon dried oregano, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Herb",
        "Onion",
        "Pork",
        "Tomato",
        "Appetizer",
        "Bell Pepper",
        "Winter",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Meatballs in Tomato Garlic Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/meatballs-in-tomato-garlic-sauce-11428"
}
