{
    "directions": [
        "Heat the EVOO in a Dutch oven or medium soup pot over medium-high heat. Add the pancetta and cook until crisp. Add the garlic, celery, carrots, bay leaf, onions and herb bundle and season with a little salt and more pepper. Cook until soft, 7 to 8 minutes. Add the tomato paste and cook, stirring, for 1 minute. Deglaze with the wine, stirring and scraping up any browned bits from the bottom of the pot with a wooden spoon. Stir for 1 minute more. Add the stock and bring to a low boil.",
        "Add a few ladles of the soup to a food processor along with 1 can of beans and puree until smooth. Return the puree to the soup and stir to combine. Add the remaining can of beans and the kale and cook until the kale is wilted. Season with a hint of nutmeg. Add the cheese rind and simmer for 15 minutes at a low bubble to let the flavors combine. Adjust the seasonings.",
        "Remove the cheese rind, herb bundle and bay leaf from the soup. Ladle the soup into shallow bowls and top with shaved Parmigiano-Reggiano and a drizzle of EVOO. Serve with bread for mopping."
    ],
    "ingredients": [
        "3 tablespoons EVOO, plus more for drizzling",
        "5 ounces pancetta, finely diced",
        "4 cloves garlic, finely chopped or grated",
        "2 to 3 small stalks celery, finely diced",
        "2 medium carrots, finely diced",
        "1 large fresh bay leaf",
        "1 onion, finely diced",
        "Herb bundle of fresh parsley, sage, rosemary and thyme tied with kitchen string",
        "Kosher salt and freshly ground pepper",
        "2 tablespoons tomato paste",
        "1/2 cup dry white wine",
        "6 cups chicken stock",
        "Two 15-ounce cans cannellini beans",
        "1 small bunch Tuscan kale, stems and ribs removed and leaves finely shredded or chopped",
        "Freshly grated nutmeg",
        "1 rind from a wedge of Parmigiano-Reggiano",
        "Shaved Parmigiano-Reggiano, for serving",
        "Crusty bread, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Bean Soup",
        "Beans and Legumes",
        "Soup",
        "Bacon Recipes",
        "Meat"
    ],
    "title": "Mediterranean Bean and Bacon Soup",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/mediterranean-bean-and-bacon-soup-recipe"
}
