{
    "directions": [
        "Soak squid in milk for 1 to 5 hours; the longer the better. When the squid has finished soaking, strain, and discard the milk.",
        "Heat 2 tablespoons olive oil in a large pot over medium heat. Stir in the garlic, onions, carrots, tomatoes, and diced fennel. Cook and stir until the vegetables soften, about 10 minutes. Stir in tomato paste, and cook an additional 10 minutes. Pour in wine, and increase heat to high. Once the mixture comes to a boil, add the chicken stock, parsley, tarragon, thyme, bay leaves, peppercorns, and saffron. Return to a boil, then reduce heat to medium, and simmer until the liquid has reduced to 1 1/2 cups, about 15 minutes. Strain out the liquid, and discard the solids.",
        "Heat 2 tablespoons olive oil in a large pot over medium heat. Stir in garlic, and cook until fragrant, about 45 seconds. Add sun-dried tomatoes and fennel; cook for 2 minutes. Pour in the strained saffron broth and chopped thyme; increase heat to medium-high and bring to a boil. Place oysters on top of the fennel, cover, and cook for 1 minute. Set the clams and mussels into the pot, cover, and cook until the shellfish begin to open, about 4 minutes. Stir in the drained squid, recover, and cook for 1 minute, just until the squid firms.",
        "While the shellfish are cooking, season the sea bass fillets with salt and pepper. Heat the remaining 2 tablespoons olive oil in a large skillet over medium-high heat. Place fish into skillet, skin-side down. Cover, and cook until the skin is crispy and the flesh of the fish has firmed and is no longer translucent.",
        "Pour the fennel-seafood mixture onto a serving platter and place the sea bass fillets on top. Garnish with parsley sprigs and serve."
    ],
    "ingredients": [
        "20 baby squid (tubes and tentacles), cleaned",
        "3 cups milk",
        "2 tablespoons extra-virgin olive oil",
        "8 cloves garlic, minced",
        "2 small onions, chopped",
        "2 large carrots, chopped",
        "2 tomatoes, chopped",
        "1 small fennel bulb, diced",
        "1/2 cup tomato paste",
        "1 cup dry white wine",
        "3 cups chicken stock",
        "1/2 bunch fresh parsley",
        "1/2 bunch fresh tarragon",
        "1/2 bunch fresh thyme",
        "2 bay leaves",
        "1 teaspoon black peppercorns",
        "1 tablespoon loosely packed saffron threads",
        "2 tablespoons extra-virgin olive oil",
        "6 cloves garlic, minced",
        "1/2 cup oil-packed sun-dried tomatoes, drained and cut into strips",
        "6 baby fennel bulbs, halved",
        "1/2 bunch fresh thyme, chopped",
        "10 fresh oysters in shells, well scrubbed",
        "20 littleneck clams",
        "20 fresh mussels",
        "6 (6 ounce) fillets fresh sea bass",
        "salt and pepper to taste",
        "2 tablespoons extra-virgin olive oil",
        "6 sprigs parsley, for garnish"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mediterranean Seafood Medley",
    "url": "http://allrecipes.com/recipe/140992/mediterranean-seafood-medley/"
}
