{
    "directions": [
        "Heat oven to 350°. Coat a 9\" pie plate with cooking spray. Line bottom of plate with potato slices. Cut remaining slices in half and arrange around side of plate. Bake 12 to 15 minutes. Remove from oven and set aside. Coat a sauté pan with cooking spray and sauté onion over low heat until tender, about 5 minutes. Add spinach to pan and let wilt, about 2 to 3 minutes. Remove from heat. Drain excess fluid from onion and spinach mixture. Stir in olives. In a bowl, beat eggs and egg whites. Stir in ricotta and feta. Add half the basil or dill and set aside. Spoon onion and spinach mixture into pie plate over potatoes. Layer on egg mixture, then slices of tomato. Bake 20 to 25 minutes or until egg is set and a knife inserted into pie comes out clean. Sprinkle grated cheeses evenly over top of pie and top with remaining basil or dill. Return to oven for 5 minutes or until cheese melts. Remove from oven and let sit for 5 minutes. Cut pie into 4 wedges. Serve immediately."
    ],
    "ingredients": [
        "Olive-oil cooking spray",
        "2 medium potatoes, peeled and sliced in 1/8-inch rounds",
        "1/2 cup diced onion",
        "8 oz (about 8 cups) baby spinach",
        "3 kalamata olives, pitted and chopped",
        "2 whole eggs",
        "3 egg whites",
        "1 cup nonfat ricotta or fat-free cottage cheese",
        "1 tbsp feta, crumbled",
        "3 tbsp finely chopped fresh basil or dill, or 3 tsp dried basil or dill, divided into 2 equal portions",
        "3 Roma tomatoes, sliced into 1/4-inch rounds",
        "1 1/2 tbsp grated Asiago or Parmesan",
        "1 1/2 tbsp grated lowfat mozzarella"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Vegetable",
        "Breakfast",
        "Brunch",
        "Bake",
        "Low Fat",
        "Vegetarian",
        "Feta",
        "Ricotta",
        "Spinach",
        "Spring",
        "Summer",
        "Healthy",
        "Cottage Cheese",
        "Self",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Mediterranean Vegetable-Cheese Pie",
    "url": "http://www.epicurious.com/recipes/food/views/mediterranean-vegetable-cheese-pie-232426"
}
