{
    "directions": [
        "Preheat broiler. Brush eggplant with olive oil. Sprinkle with salt and pepper. Broil until brown and just cooked through, about 2 minutes per side. Transfer to paper towels and drain.",
        "Preheat oven to 425°F. Combine onions and potatoes on large baking sheet. Drizzle with 3 tablespoons oil; toss to coat. Season with salt and pepper. Place peppers on medium baking sheet. Add 1 tablespoon oil; toss to coat. Season with salt and pepper. Roast vegetables until tender and light golden, stirring occasionally, about 35 minutes for peppers and about 1 hour for potatoes and onions. Transfer to large bowl. Place zucchini on medium baking sheet. Add 1 tablespoon oil; toss to coat. Season with salt and pepper. Bake until crisp-tender, about 20 minutes. Transfer to bowl with vegetables. Cut eggplant into 1-inch squares and add to vegetables in bowl.",
        "Combine mustard and vinegar in small bowl. Gradually mix in remaining 4 tablespoons olive oil. Add basil. Add dressing to salad and mix to coat. (Can be made 1 day ahead. Cover; chill. Bring to room temperature before continuing.)",
        "Mix radicchio, arugula and cheese into salad. Season with salt and pepper."
    ],
    "ingredients": [
        "1 1 1/2-pound eggplant, cut lengthwise into 1-inch-wide slices",
        "Olive oil",
        "2 large red onions, cut into 1-inch pieces",
        "2 pounds red-skinned potatoes, cut into 1 x 3/4-inch pieces",
        "9 tablespoons olive oil",
        "2 large red bell peppers, cut into 1 1/2-inch squares",
        "4 zucchini, halved lengthwise, cut crosswise into 1 1/2-inch pieces",
        "2 tablespoons Dijon mustard",
        "2 tablespoons balsamic vinegar",
        "3/4 cup chopped fresh basil",
        "2 heads radicchio, cut into 1 1/2-inch pieces",
        "2 1/2-ounce packages arugula, cut into bite-size pieces",
        "1 1/2 cups coarsely grated Pecorino Romano cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Potato",
        "Vegetable",
        "Side",
        "Broil",
        "Roast",
        "Vegetarian",
        "Buffet",
        "Parmesan",
        "Eggplant",
        "Arugula",
        "Bell Pepper",
        "Summer",
        "Healthy",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Mediterranean Roasted Vegetable Salad",
    "url": "http://www.epicurious.com/recipes/food/views/mediterranean-roasted-vegetable-salad-1977"
}
