{
    "directions": [
        "Put oven racks in upper and lower thirds of oven and preheat oven to 425°F.",
        "Toss eggplant and zucchini with 5 tablespoons oil, 3/4 teaspoon salt, and 3/4 teaspoon pepper in a bowl, then spread in 2 oiled large shallow (1-inch-deep) baking pans. Roast vegetables in oven, stirring occasionally and switching position of pans halfway through baking, until vegetables are golden brown and tender, 20 to 25 minutes total. Combine vegetables in 1 pan and cool, reserving other pan for cooling barley.",
        "Heat 2 tablespoons oil in a 3- to 4-quart heavy pot over moderately high heat until hot but not smoking, then cook scallion, cumin, coriander, and cayenne, stirring, until fragrant, about 1 minute. Add barley and cook, stirring until well coated with oil, 2 minutes more. Add broth and water and bring to a boil. Reduce heat and simmer, covered, until all of liquid is absorbed and barley is tender, 30 to 40 minutes. Remove from heat and let stand, covered, 5 minutes. Transfer to reserved shallow baking pan and spread to quickly cool, uncovered, to room temperature, about 20 minutes.",
        "Whisk together lemon juice, garlic, sugar, and remaining 1/4 teaspoon salt, 1/4 teaspoon pepper, and 3 tablespoons oil in a large bowl. Add barley, roasted vegetables, and remaining ingredients to bowl with dressing and toss until combined well. Serve with cheese slices."
    ],
    "ingredients": [
        "1 1/2 pound eggplant, cut into 1/2-inch cubes",
        "3/4 pound zucchini, cut into 1/2-inch cubes",
        "10 tablespoons extra-virgin olive oil",
        "1 teaspoon salt",
        "1 teaspoon black pepper",
        "1 cup chopped scallion (from 1 bunch)",
        "1 1/2 teaspoons ground cumin",
        "1/2 teaspoon ground coriander",
        "1/4 teaspoon cayenne",
        "1 1/4 cups pearl barley (8 oz)",
        "1 (14-oz) can reduced-sodium chicken broth (1 3/4 cups)",
        "3/4 cup water",
        "2 tablespoons fresh lemon juice",
        "1 garlic clove, minced",
        "1/4 teaspoon sugar",
        "1/2 pound cherry tomatoes, quartered",
        "1/3 cup Kalamata or other brine-cured black olives, pitted and halved",
        "1/2 cup thinly sliced red onion, rinsed and drained if desired",
        "1 cup chopped fresh flat-leaf parsley",
        "1/2 cup chopped fresh mint",
        "Accompaniment: 1 (1/2-lb) piece ricotta salata, cut crosswise into thin slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Olive",
        "Onion",
        "Tomato",
        "Vegetable",
        "Side",
        "Roast",
        "Picnic",
        "Backyard BBQ",
        "Barley",
        "Eggplant",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mediterranean Eggplant and Barley Salad",
    "url": "http://www.epicurious.com/recipes/food/views/mediterranean-eggplant-and-barley-salad-235753"
}
