{
    "directions": [
        "Preheat oven to 400°F with rack in upper third.",
        "Quarter escarole lengthwise, leaving base attached, and rinse well. Cook in a medium pot of boiling salted water (2 tablespoons salt for 4 quarts water) 6 minutes. Drain and cool.",
        "Meanwhile, bring 1 quart water to a boil with 1 1/2 teaspoons salt in a medium saucepan. Add rice and parboil, uncovered, 10 minutes (rice will not be tender). Reserve 1/2 cup cooking liquid, then drain rice in a sieve.",
        "Cook pine nuts in 1/4 cup oil in a 12-inch heavy skillet over medium heat, stirring, until pale golden, about 3 minutes. Add garlic and cook, stirring, until it begins to brown, about 1 minute. Add peppers, raisins, capers, 1/2 teaspoon pepper, and 1/4 teaspoon salt and cook, stirring occasionally, until raisins begin to plump, about 3 minutes. Remove from heat and add rice. Cool slightly, then stir in egg and 1/4 cup cheese.",
        "Cut off and discard base from 1 escarole quarter, then gently spread leaves to create a 4-inch-wide area. With base end nearest you, place one fourth of rice mixture in center of bottom half of escarole. Fold base of leaves over rice, then fold in sides and roll up rice in escarole. Put, seam side down, in a 2-quart flameproof shallow baking dish, then repeat with remaining escarole and rice.",
        "Drizzle with reserved cooking liquid and remaining tablespoon oil, then sprinkle with remaining 3/4 cup cheese. Cover tightly with foil and bake until rice is tender, about 30 minutes.",
        "Remove foil and turn on broiler, then broil 4 to 6 inches from heat until cheese is browned, 4 to 7 minutes."
    ],
    "ingredients": [
        "1 large head escarole (1 1/4 pound)",
        "3/4 cup Arborio rice",
        "1/2 cup pine nuts",
        "1/4 cup plus 1 tablespoon extra-virgin olive oil, divided",
        "2 garlic cloves, finely chopped",
        "1 (12-ounce) jar roasted red peppers, rinsed and coarsely chopped",
        "1/3 cup golden raisins",
        "3 tablespoons chopped rinsed capers",
        "1 large egg, lightly beaten",
        "1 cup grated Parmigiano-Reggiano, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Vegetarian",
        "Dinner",
        "Parmesan",
        "Bell Pepper",
        "Escarole",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Mediterranean Rice-Stuffed Escarole",
    "url": "http://www.epicurious.com/recipes/food/views/mediterranean-rice-stuffed-escarole-241999"
}
