{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Toss red pepper halves with 1 tablespoon of olive oil. Place them on a baking sheet and roast until the peppers are very soft and crisp at the edges, about 20 minutes. Allow peppers to cool, then dice into 1/4-inch cubes. Set aside in a large mixing bowl.",
        "Combine lentils and cold water in a saucepan and bring to a boil over high heat. Reduce the heat to low, add a pinch of salt, and simmer, covered, until the lentils are just tender to the bite, about 20 minutes. Remove from heat, drain, and cool. Transfer cooled lentils to the mixing bowl.",
        "Gently mix in the onion, celery, carrots, and parsley. Add 1/2 teaspoon sea salt and freshly ground pepper.",
        "Combine the Dijon mustard, chopped shallots, 1/2 teaspoon sea salt, lemon juice, white wine vinegar, and balsamic vinegar in a blender. Blend on High for 10 seconds. Gradually add olive oil and blend again until the dressing is fully emulsified and smooth. Pour 1/2 cup dressing over lentils and stir gently with a wooden spoon. Taste the salad and add remaining dressing if desired."
    ],
    "ingredients": [
        "1 1/2 large red bell peppers, halved and seeded",
        "1 tablespoon extra virgin olive oil",
        "1 cup French green lentils",
        "3 cups cold water",
        "1 pinch sea salt",
        "1 small onion, finely diced",
        "2 stalks celery, finely diced",
        "2 carrots, peeled and finely diced",
        "1/2 cup finely chopped flat-leaf parsley",
        "1/2 teaspoon sea salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 tablespoon Dijon mustard",
        "2 small shallots, coarsely chopped",
        "1/2 teaspoon sea salt",
        "5 tablespoons fresh lemon juice",
        "1 1/2 tablespoons white wine vinegar",
        "1 1/2 tablespoons balsamic vinegar",
        "1/2 cup extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mediterranean Style Roasted Red Pepper and Lentil Salad",
    "url": "http://allrecipes.com/recipe/223278/mediterranean-style-roasted-red-peppe/"
}
