{
    "directions": [
        "Separate garlic cloves, leaving skins intact. In a large kettle cover potatoes with salted water by 2 inches and add garlic. Simmer potatoes and garlic until potatoes are just tender, about 20 minutes. Drain potatoes and garlic in a colander and, when cool enough to handle, cut potatoes into 1/4-inch-thick slices. Peel garlic and in a blender puree with water, vinegar, oil, mustard, and salt and pepper to taste. Potatoes may be prepared and dressing made 1 day ahead and chilled separately, covered.",
        "Cut beans into 1-inch pieces. Have ready a bowl of ice and cold water. In a large saucepan of boiling salted water cook beans until crisp-tender, about 3 minutes for haricots verts or 6 minutes for regular green beans. In a colander drain beans and plunge into ice water to stop cooking. Pat beans dry. Cut bell pepper into 1/4-inch dice and halve cucumber lengthwise. Seed cucumber and diagonally cut into 1/4-inch-thick slices. Pit and chop olives. Vegetables and olives may be prepared up to this point 4 hours ahead and chilled separately, covered.",
        "Drain tuna and transfer with potatoes, beans, bell pepper, cucumber, and olives to a large bowl.",
        "Just before serving, toss salad with dressing and crumble feta on top."
    ],
    "ingredients": [
        "1 large head garlic",
        "1 1/2 pounds small red potatoes (each about 1 1/2 inches in diameter)",
        "1/4 cup water",
        "3 tablespoons balsamic vinegar",
        "2 teaspoons extra-virgin olive oil",
        "1 teaspoon Dijon mustard",
        "3/4 pound haricots verts (thin French green beans) or regular green beans",
        "1 red bell pepper",
        "1/2 English cucumber",
        "10 Kalamata or other brine-cured black olives",
        "two 6-ounce cans solid white tuna in water",
        "1/3 cup crumbled feta (about 2 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Olive",
        "Potato",
        "Feta",
        "Tuna",
        "Summer",
        "Gourmet"
    ],
    "title": "Mediterranean Tuna, Potato, Olive, and Feta Salad with Garlic Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/mediterranean-tuna-potato-olive-and-feta-salad-with-garlic-dressing-15296"
}
