{
    "directions": [
        "Coat a heavy-bottomed sauté pan or saucepan with cooking spray and place over high heat. Add mushrooms and sauté until semisoft, about 40 seconds. Season with salt. Stir in tomatoes and sauté another 30 seconds or so. Add chives and stir. Pour in just enough Cabernet Sauvignon to cover bottom of pan (deglazing the pan with wine keeps food from sticking and helps blend flavors). Reduce until liquid becomes syrupy. Stir in demi-glace. Bring mixture to a simmer and reduce until it coats back of spoon.",
        "Heat oven to 400°F. Thoroughly coat a heavy-bottomed pan with cooking spray and place on burner over high heat. Season fillets with salt and pepper. Sauté both sides until brown and slightly crusty, about 1 minute per side. Place meat in a shallow pan in oven for 5 minutes, which will cook the meat to medium, or adjust cooking time to desired degree of doneness. Transfer each fillet to a plate and ladle fricassee on top. Serve immediately."
    ],
    "ingredients": [
        "Vegetable-oil cooking spray",
        "1/2 lb shiitake mushrooms (about 1 cup), stemmed and cut into thin strips",
        "1/2 lb (about 3) Roma tomatoes, cored and cut into thin strips",
        "1 tsp fresh chives, cut into 1D4-inch pieces",
        "1 cup Cabernet Sauvignon",
        "1 pint demi-glace (found at gourmet and butcher shops)",
        "Vegetable-oil cooking spray",
        "6 lean beef tenderloin fillets (4 oz each), fat trimmed to 1/8 inch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Tomato",
        "Sauté",
        "Low Fat",
        "Beef Tenderloin",
        "Red Wine",
        "Fall",
        "Spring",
        "Winter",
        "Healthy",
        "Chive",
        "Self"
    ],
    "title": "Medicine Lodge Filet Mignon \"Fricassée\"",
    "url": "http://www.epicurious.com/recipes/food/views/medicine-lodge-filet-mignon-fricassee-232427"
}
