{
    "directions": [
        "Preheat oven to 425°F. Spray large rimmed baking sheet with nonstick spray. Mix thyme and next 3 ingredients in large bowl. Transfer half of herb mixture to small bowl; set aside. Add oil to herb mixture in large bowl. Transfer 1 1/2 tablespoons herb-oil mixture to medium bowl; add beets and toss to coat. Add remaining vegetables to herb-oil mixture in large bowl; toss to coat. Transfer vegetables and beets to prepared baking sheet, placing beets in 1 corner to avoid coloring other vegetables. Sprinkle vegetables with salt and pepper. Roast until brown and tender, stirring once, about 40 minutes.",
        "Mix broth and balsamic vinegar into reserved herb mixture in small bowl. Pour over roasted vegetables. Roast until liquid evaporates and vegetables are slightly glazed, about 5 minutes. Serve hot or at room temperature.",
        "*Available at specialty foods stores and some supermarkets."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh marjoram",
        "1 teaspoon chopped fresh rosemary",
        "2 garlic cloves, minced",
        "1/4 cup extra-virgin olive oil",
        "12 unpeeled baby beets (each about 1 inch in diameter), trimmed",
        "1 pound turnips (about 4), peeled, each cut into 6 wedges",
        "1 3/4 pounds rutabagas (about 4), peeled, each cut into 10 wedges",
        "2 pounds carrots, peeled, halved lengthwise, cut into 2-inch lengths (about 4 1/2 cups)",
        "2 1/2 pounds parsnips, peeled, halved lengthwise, cut into 2-inch lengths (about 5 cups)",
        "8 ounces cipolline onions* or boiling onions, peeled",
        "1/3 cup canned low-salt chicken broth",
        "2 tablespoons balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Wheat/Gluten-Free",
        "Rosemary",
        "Beet",
        "Carrot",
        "Parsnip",
        "Turnip",
        "Fall",
        "Thyme",
        "Rutabaga",
        "Christmas Eve"
    ],
    "title": "Medley of Root Vegetables with Cipoline Onions and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/medley-of-root-vegetables-with-cipoline-onions-and-herbs-105820"
}
