{
    "directions": [
        "In a small bowl combine yeast, water and 1 tablespoon sugar and let stand until foamy, about 5 minutes. In a large bowl whisk together remaining sugar, 4 cup flour, and salt and add yeast mixture, butter, milk, sour cream, and eggs, stirring until combined well. Stir in 3 cups flour and turn dough out onto a lightly floured surface. Knead dough 8 to 10 minutes, adding enough of the remaining cup flour to form a soft but slightly sticky dough. Form dough into a ball and transfer to a buttered bowl, turning to coat dough completely with butter. Let dough rise in warm place, covered with a kitchen towel, until doubled in bulk, about 1 hour.",
        "In a small heatproof bowl combine currants or raisins with boiling water to cover and let stand 20 minutes. Drain currants or raisins well. In a small bowl stir together sugar and cinnamon.",
        "Butter two 13- by 9-inch baking pans.",
        "Punch down dough and turn out onto a lightly floured surface. Divide dough into 4 pieces. Roll out 1 piece of dough into a 10-inch circle (about 1/4 inch thick) and cut into 12 wedges. Sprinkle each wedge with about 1 teaspoon currants and about 1/2 teaspoon cinnamon sugar.",
        "Beginning with outer, curved edge, roll up each wedge toward tip and curve ends gently to form a crescent. Transfer crescent, tips down, to a baking sheet and form more crescents with remaining dough and filling in same manner. (Crescents should be arranged in 3 rows of 8 in each pan for a total of 48.) Cover each pan with a kitchen towel. Let crescents rise in a warm place until almost doubles in bulk, about 1 hour.",
        "Preheat oven to 350°F.",
        "bake rolls in middle of oven 20 to 25 minutes, or until golden brown. Serve rolls warm."
    ],
    "ingredients": [
        "two 1/4-ounce packages (5 teaspoons total) active dry yeast",
        "1/2 cup warm water (105°-115°F.)",
        "1 cup plus 1 tablespoon sugar",
        "7 to 8 cups all-purpose flour",
        "1/2 teaspoons salt",
        "1/2 stick (1/4 cup) unsalted butter, melted and cooled",
        "3/4 cup milk, heated to lukewarm",
        "1/2 cup sour cream",
        "4 large eggs, beaten lightly",
        "1 cup dried currants or raisins",
        "1/2 cup sugar",
        "1 teaspoon cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Dairy",
        "Egg",
        "Fruit",
        "Breakfast",
        "Brunch",
        "Bake",
        "Currant",
        "Spring",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Meena's Cinnamon and Currant Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/meenas-cinnamon-and-currant-rolls-14105"
}
