{
    "directions": [
        "Preheat oven to 425°F.",
        "Wrap beets tightly in foil and roast in middle of oven 1 to 1 1/2 hours, or until tender. Unwrap beets carefully and cool until they can be handled. Slip off and discard skins and stems. Cut each beet into 6 wedges. Beets may be prepared up to this point 1 day ahead and chilled, covered.",
        "Have ready a large bowl of ice and cold water. In a large saucepan of salted boiling water blanch turnips 3 to 6 minutes (depending on size), or until barely tender, and transfer with a slotted spoon to ice water. Return water in pan to a boil and blanch carrots 5 minutes, or until barely tender. Transfer carrots with a slotted spoon to ice water and drain turnips and carrots in a colander. If using baby turnips, cut each in half.",
        "Return water in pan to a boil and blanch onions 3 minutes, or until barely tender. Drain onions in another colander until cool enough to handle and peel. Vegetables may be prepared up to this point 1 day ahead, patted dry, and chilled, covered. Bring vegetables to room temperature before proceeding.",
        "In a large non-stick skillet heat butter over moderately high heat until foam subsides and sauté turnips and carrots with pepper and salt to taste, stirring, until tender and golden, about 4 minutes. Transfer turnips and carrots with slotted spoon to a bowl and keep warm, covered. Add oil to skillet and heat over moderately high heat until hot but not smoking. Sauté onions with pepper and salt to taste, stirring, until tender and golden brown, about 4 minutes, and with slotted spoon add to turnip mixture. Stir parsley into vegetable mixture.",
        "In oil remaining in skillet cook beets with pepper and salt to taste over moderate heat, stirring, until heated through.",
        "Serve beets with other vegetables (but do not toss together)."
    ],
    "ingredients": [
        "8 medium beets, scrubbed and trimmed, leaving about 1 inch of stems attached",
        "9 baby turnips with tops, peeled and tops trimmed to 1/4 inch, or 3 medium turnips, peeled and cut into 6 wedges",
        "18 baby carrots with tops, peeled and tops trimmed to 1/4 inch, or 3 large carrots, peeled and cut into 3- by 1/2-inch sticks",
        "3/4 pound assorted red and yellow pearl onions (about 2 1/2 cups)",
        "3 tablespoons unsalted butter",
        "1 tablespoon olive oil",
        "1/4 cup loosely packed fresh flat-leafed parsley leaves, washed well, dried, and chopped",
        "freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Vegetable",
        "Side",
        "Roast",
        "Sauté",
        "Vegetarian",
        "High Fiber",
        "Beet",
        "Carrot",
        "Turnip",
        "Winter",
        "Healthy",
        "Gourmet"
    ],
    "title": "Melange of Winter Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/melange-of-winter-vegetables-13610"
}
