{
    "directions": [
        "To make the balsamic reduction, put the balsamic, Marsala and red wine in a heavy-based saucepan over medium-low heat. Cook until reduced by two-thirds and thickened to the consistency of honey (this will take 2 to 3 hours). Remove from the heat and set aside.",
        "Put the pistachios and almonds in a small frying pan over medium heat. Cook for 5 minutes, stirring continuously, until lightly brown. Transfer the nuts to a large bowl and allow to cool.",
        "Put the lime zest and juice in a small bowl and add the olive oil. Whisk well using a fork or whisk.",
        "Put the tomatoes, cantaloupe, and watermelon in a large bowl. Pour over the lime vinaigrette and toss lightly.",
        "Arrange the prosciutto or smoked fish (if using) over the top, crumble over the feta, and drizzle with the balsamic reduction. Season with sea salt and freshly ground black pepper and garnish with the toasted nuts and basil leaves."
    ],
    "ingredients": [
        "3 tablespoons shelled pistachios",
        "3 tablespoons almonds",
        "Finely grated zest and juice of 4 limes",
        "1 scant cup olive oil (200 ml/7 fl oz)",
        "1/2 cup cherry tomatoes, halved",
        "1/4 canteloupe (250 grams), cut into 1/2-inch cubes",
        "1/4 watermelon (250 grams), cut into 1/2-inch cubes",
        "7 oz (200 grams) prosciutto or smoked fish (optional), torn into bite-size pieces",
        "1 1/3 cups crumbled marinated feta cheese (200 grams/7 oz)",
        "1 large handful basil, leaves picked",
        "4 cups balsamic vinegar",
        "1/2 cup Marsala",
        "1/2 cup red wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Melon",
        "Cantaloupe",
        "Feta",
        "Basil",
        "Side",
        "Summer",
        "Prosciutto",
        "Red Wine",
        "Tomato",
        "Watermelon",
        "Salad"
    ],
    "title": "Melon, Basil, and Feta Salad With Balsamic–Red Wine Reduction",
    "url": "http://www.epicurious.com/recipes/food/views/melon-basil-and-feta-salad-with-balsamicred-wine-reduction"
}
