{
    "directions": [
        "Bring sugar and 1/4 cup water to a boil in a small saucepan over medium heat, stirring to dissolve sugar. Add mint sprigs and chile. Scrape in seeds from vanilla bean; add bean. Remove syrup from heat; cover and let steep for 15 minutes for flavors to infuse.",
        "Strain syrup through a fine-mesh sieve into a small bowl; stir in lime juice. DO AHEAD: Syrup can be made 1 week ahead. Keep chilled.",
        "Arrange melon slices in a 13x9x2\" glass baking dish. Pour syrup over melon in baking dish. Cover with plastic wrap and chill for 2 hours to allow flavors to meld.",
        "Divide melon slices among plates, overlapping them decoratively. Pour remaining syrup in dish into a small pitcher. DO AHEAD: Melon carpaccio can be made up to 5 hours ahead. Cover and chill melon and remaining syrup separately.",
        "Drizzle some of syrup over melon. Place a scoop of sorbet in center of each plate, if using; garnish with mint leaves and lime zest."
    ],
    "ingredients": [
        "1/2 cup sugar",
        "4 sprigs mint plus small leaves for garnish",
        "1/2 teaspoon thinly sliced fresh red chile (such as jalapeño or Fresno)",
        "1/2 vanilla bean, split lengthwise",
        "1/2 cup fresh lime juice",
        "1/2 5-pounds melon (such as honeydew), peeled, halved, seeded, cut crosswise into 1/4\" slices",
        "Coconut, mango, or lemon sorbet (optional)",
        "1/2 teaspoon lime zest"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Low Cal",
        "Lime",
        "Melon",
        "Summer",
        "Healthy",
        "Low Cholesterol",
        "Fat Free",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Melon Carpaccio with Lime",
    "url": "http://www.epicurious.com/recipes/food/views/melon-carpaccio-with-lime-51104700"
}
