{
    "directions": [
        "Preheat an oven to 400 degrees F (200 degrees C). Grease a baking sheet or line it with parchment paper.",
        "Bring 2 tablespoons of water and 1/4 cup of butter to a boil in a saucepan. Reduce the heat to low and add 1/2 cup of flour, stirring vigorously until the mixture forms a ball. Transfer the mixture to a mixing bowl or stand mixer and beat in the eggs, one at a time.",
        "Pipe the mixture onto the baking sheet using a pastry bag, a plastic zipper bag with the corner cut off, or just shaping it with a spatula. You should have six 4-inch fingers or 12 smaller eclairs. Bake the pastries in the hot oven until they are puffed and golden (30 to 50 minutes, depending on their size). Remove from the oven and allow the shells to cool.",
        "To make the custard, mix the 6 1/2 tablespoons of white sugar, 5 tablespoons of flour, and salt in a saucepan. Stir in the milk and bring the mixture to a boil over medium heat. Pour the hot milk mixture in a steady stream into the beaten egg, whisking constantly. Return the mixture to the saucepan and bring just to a boil, stirring constantly. Remove from heat and transfer to a mixing bowl to cool. Stir in the almond extract; cover the surface with plastic wrap and refrigerate until you're ready to fill the eclairs.",
        "For the glaze, combine the chocolate, 1 tablespoon of butter, and 2 tablespoons of water in a saucepan. Heat gently until the mixture has melted. Remove from the heat and stir in 1/2 cup of confectioners' sugar. If the icing is too thick, add a little more water. For creamier glaze, substitute milk for 2 tablespoons of water.",
        "Cut the tops off of the cooled shells and fill them with the custard. Replace tops, and glaze them with the chocolate icing."
    ],
    "ingredients": [
        "Eclair Shells (Pate a Choux):",
        "2 tablespoons water",
        "1/4 cup butter",
        "1/2 cup all-purpose flour",
        "2 eggs",
        "Custard:",
        "6 1/2 tablespoons white sugar",
        "5 tablespoons all-purpose flour",
        "1 teaspoon salt",
        "1 1/2 cups milk",
        "1 egg, lightly beaten",
        "2 teaspoons almond extract (optional)",
        "Chocolate Icing:",
        "1 (1 ounce) square unsweetened chocolate",
        "1 tablespoon butter",
        "2 tablespoons water",
        "1/2 cup confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mel's Eclairs",
    "url": "http://allrecipes.com/recipe/20303/mels-eclairs/"
}
