{
    "directions": [
        "Flatten flank steak slightly with a meat mallet. Rub shichimi togarashi into both sides of steak, wrap the steak in plastic wrap, and refrigerate for 8 hours or overnight.",
        "Combine orange juice, soy sauce, lime juice, orange zest, and lime zest together in a resealable plastic bag. Remove flank steak from plastic wrap and place the steak in the resealable plastic bag, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 2 hours.",
        "Preheat an outdoor grill for high heat, and lightly oil the grate.",
        "Remove steak from marinade and pour marinade into a small bowl.",
        "Cook steak on the preheated grill, basting with the marinade every 5 minutes, until it starts to firm and is seared on the outside and reddish-pink and juicy in the center, 8 to 10 minutes per side. An instant-read thermometer inserted into the center should read 135 degrees F (57 degrees C).",
        "Cut steak in half lengthwise and cut across the grain into thin slices.",
        "Whisk cornstarch, chili powder, salt, paprika, brown sugar, cayenne pepper, red pepper flakes, onion powder, garlic powder, and ground cumin together in a bowl.",
        "Heat oil in a large skillet over medium-high heat. Saute onion and red bell pepper in hot oil until soft, 5 to 10 minutes. Add sliced steak, chili powder mixture, and water to the skillet. Cook until sauce thickens and meat is glossy, 3 to 5 minutes."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2592&h=1357&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2824413.jpg",
    "ingredients": [
        "1  flank steak",
        "¼ cup shichimi togarashi (optional)",
        "¼ cup orange juice",
        "¼ cup low-sodium soy sauce",
        "2 tablespoons lime juice",
        "½  orange, zested",
        "½  lime, zested",
        "1 tablespoon cornstarch",
        "1 tablespoon chili powder, or more to taste",
        "1 teaspoon kosher salt",
        "1 teaspoon smoked paprika",
        "1 teaspoon brown sugar",
        "1 teaspoon cayenne pepper",
        "1 teaspoon red pepper flakes",
        "½ teaspoon onion powder",
        "½ teaspoon garlic powder",
        "½ teaspoon ground cumin",
        "1 tablespoon olive oil",
        "1  onion, cut into slices and separated",
        "1  red bell pepper, cut into thin strips",
        "¾ cup water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Melt-in-Your-Mouth Beef Fajitas",
    "url": "http://allrecipes.com/recipe/236164/melt-in-your-mouth-beef-fajitas/"
}