{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Beat butter in a bowl using an electric mixer until fluffy, about 2 minutes. Beat white sugar, baking powder, and salt into butter until just combined. Beat egg, milk, and vanilla extract into butter-sugar mixture; add flour and mix until dough is just combined. Cover bowl with plastic wrap and refrigerate until dough is slightly chilled, about 10 minutes.",
        "Scoop dough into balls slightly larger than golf balls; flatten into cookies. Arrange cookies on a baking sheet.",
        "Bake in the preheated oven until edges are golden brown, 10 to 20 minutes. Cool on baking sheet for about 5 minutes before transferring to a wire rack to cool completely, at least 30 minutes.",
        "Butter a microwave-safe plate. Place marshmallows on the prepared plate.",
        "Microwave marshmallows until slightly puffed, 10 to 15 seconds. Gently press marshmallows until bottoms slightly ooze.",
        "Whisk confectioners' sugar and water together in a bowl until icing is slightly thicker than drizzle-consistency. Pour icing over cookies so it runs over the edges, reserving about 1 tablespoon.",
        "Melt chocolate chips in a microwave-safe glass or ceramic bowl, about 30 seconds. Pour melted chocolate into a piping bag with a small tip or a plastic bag with a corner snipped.",
        "Press 1 marshmallow close to an edge of each cookie to be the snowman's head. Draw 'stick arms' onto the icing using the melted chocolate.",
        "Divide the reserved 1 tablespoon icing into 2 small bowls. Mix red food coloring into 1 of the bowls and orange food coloring into the other bowl. Decorate the snowmen with scarves or ties using the red icing and yellow icing."
    ],
    "ingredients": [
        "Sugar Cookie:",
        "3/4 cup butter, softened",
        "3/4 cup white sugar",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1 egg",
        "1 tablespoon milk",
        "1 teaspoon vanilla extract",
        "2 cups all-purpose flour",
        "Decorations:",
        "12 large marshmallows",
        "3 cups confectioners' sugar",
        "1/4 cup water",
        "1/2 cup chocolate chips",
        "1 drop red food coloring, or as desired",
        "1 drop yellow food coloring, or as desired"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Melted SnowMan Cookie",
    "url": "http://allrecipes.com/recipe/235460/melted-snowman-cookie/"
}
