{
    "directions": [
        "Preheat grill to medium-high.",
        "Whisk all the ingredients for the Memphis-style rub in a small bowl and set aside.",
        "Place 2 to 3 chicken thighs on a large 12x18-inch piece of Reynolds Wrap(R) Non-Stick Foil. Generously sprinkle Memphis-style rub on all sides of the chicken, gently pressing it down.",
        "Wrap up the chicken thighs in the foil. Repeat with the remaining chicken thighs.",
        "Place foil-wrapped chicken thighs onto the grill.",
        "Cover the grill and grill the chicken thighs for 15 to 20 minutes (longer or shorter depending on thickness of chicken) until tender and juices run clear or meat thermometer reads 165 degrees F. After the chicken is cooked through, carefully place the foil packet on a large plate. Carefully open foil with a pair of tongs and then, if desired, place chicken thighs directly onto grill to get nice grill marks and some char.",
        "Let chicken thighs rest for 15 to 20 minutes or until cool enough to handle. Chop chicken into pieces.",
        "Boil a pot of water, add the pasta and cook until al dente, about 10 to 12 minutes depending on the pasta shape you use. Drain.",
        "Melt butter in a large skillet over medium-high heat. Whisk in flour and chicken broth. Let thicken for 3 to 5 minutes. Add cheeses to the skillet and stir with a spatula until melted and smooth.",
        "Add the pasta to the cheese sauce and stir to incorporate.",
        "Add the chicken pieces to the mac 'n cheese and stir to incorporate. Season with salt and pepper to taste."
    ],
    "ingredients": [
        "Memphis-Style Rub:",
        "1 tablespoon chili powder",
        "1 tablespoon dark brown sugar",
        "1 teaspoon paprika",
        "1/2 teaspoon salt",
        "1/2 teaspoon pepper",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon cayenne pepper",
        "Chicken Mac 'n Cheese:",
        "1 1/2 pounds boneless skinless chicken thighs",
        "2 1/2 cups cavatappi pasta, or similar shape such as rotini pasta",
        "2 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour",
        "1/2 cup chicken broth",
        "1 cup shredded extra-sharp orange Cheddar cheese",
        "1 cup shredded extra-sharp white Cheddar cheese",
        "1/2 teaspoon salt and pepper",
        "Reynolds Wrap® Non-Stick Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Memphis-Style Chicken Mac 'n Cheese",
    "url": "http://allrecipes.com/recipe/247442/memphis-style-chicken-mac-n-cheese/"
}
