{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Butter a 9x13-inch baking dish.",
        "Melt 2 tablespoons of the butter in a large skillet over medium heat. Add onions, sugar, and salt. Cook, stirring often, until onions are caramel colored, 15 to 20 minutes. If mixture is too dry, add an additional tablespoon of butter. Set aside.",
        "Bring a large pot of lightly salted water to a boil. Add macaroni and cook until al dente, 8 to 10 minutes. Drain, cover and set aside.",
        "Melt 1 tablespoon of the butter in a small skillet over medium heat. Stir in the bread crumbs and toast lightly for a few minutes, stirring constantly.",
        "Melt the remaining 3 tablespoons butter in a large pot over medium heat. Dissolve the dry mustard in an equal amount of water and add to the pot along with the garlic, and cayenne pepper. Stir until fragrant, about 30 seconds. Sprinkle in the flour and cook until golden, about 1 minute. Slowly whisk in the milk and broth. Bring to a simmer stirring constantly until the mixture is slightly thickened, about 5 minutes.",
        "Remove the pan from the heat and stir in the Cheddar and Parmesan cheeses until melted. Stir in the onions and season with salt and pepper. Add the drained macaroni and stir until blended. Pour into the prepared baking dish and top with bread crumbs.",
        "Bake until golden brown and bubbling around the edges, 25 to 30 minutes. Let cool for 10 minutes before serving."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/560x315/793985.jpg",
    "ingredients": [
        "6 tablespoons butter, divided",
        "1 large Vidalia or other sweet onion, thinly sliced",
        "1/2 teaspoon sugar",
        "1 pinch salt",
        "1 (8 ounce) box uncooked macaroni",
        "1 cup plain bread crumbs",
        "1/2 teaspoon dried mustard",
        "1 clove garlic, minced",
        "1 pinch cayenne pepper",
        "3 tablespoons all-purpose flour",
        "1 3/4 cups milk",
        "3/4 cup low-sodium chicken broth",
        "8 ounces grated sharp white Cheddar cheese",
        "1/2 cup grated Parmesan cheese",
        "salt and black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mena's Baked Macaroni and Cheese with Caramelized Onion",
    "url": "http://allrecipes.com/recipe/142500/menas-baked-macaroni-and-cheese-with/"
}