{
    "directions": [
        "Place 1 tablespoon olive oil into a pressure cooker over medium-high heat. Add the lamb and cook until evenly browned on all sides. Remove the lamb. Add cooking rack; place lamb on rack. Pour in 4 cups water. Close cover securely; place pressure regulator on vent pipe. Bring cooker to full pressure over high heat. Reduce heat to medium-high; cook for 40 minutes. (Pressure regulator should maintain a slow steady rocking motion; adjust heat if needed.)",
        "Remove pressure cooker from heat, and allow pressure to drop on its own. Remove lamb, separate meat from bones, and keep warm. Discard bones. Pour pan broth into a bowl, and set aside.",
        "Meanwhile, place remaining four cups water, 1 tablespoon olive oil, and rice into a saucepan; bring to a boil over medium-high heat. Stir, reduce heat, cover, and simmer until all moisture is absorbed, about 20 minutes.",
        "Place remaining 2 tablespoons olive oil into a skillet over medium heat. Stir in the pine nuts; cook and stir until deep brown, about 5 minutes.",
        "Pour 2 cups of the reserved broth into a large pan. Pour in the goat's milk. Add the lamb to the milk mixture. Simmer over medium heat allowing the lamb to absorb some of the liquid, about 30 minutes.",
        "To serve, arrange the pita bread over the bottom of a large platter. Spoon rice over the bread. Place the lamb on top of the rice, and drizzle with any remaining milk mixture. Sprinkle pine nuts over the top."
    ],
    "ingredients": [
        "4 tablespoons olive oil",
        "2 pounds boneless lamb shoulder, cut into 2 inch pieces",
        "8 cups water",
        "2 cups uncooked white rice",
        "1/4 cup pine nuts",
        "6 pita bread rounds",
        "1 cup salted goat's milk (jameed el-kasih)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mensaf (Jordanian Lamb Stew)",
    "url": "http://allrecipes.com/recipe/143424/mensaf-jordanian-lamb-stew/"
}
