{
    "directions": [
        "Preheat oven to 350°F. Butter 9-inch-diameter springform pan with 23/4-inch-high sides. Blend crumbs and sugar in processor. Add melted butter; process until crumbs are evenly moistened. Press crumb mixture over bottom and up sides of pan. Bake crust until slightly crisp, about 12 minutes. Cool crust completely, then freeze 15 minutes.",
        "Microwave peach ice cream on low in three 10-second intervals until slightly softened. Drop ice cream by large spoonfuls over bottom of crust; spread over crust. Place pan in freezer 15 minutes. Microwave raspberry sorbet on low in three 10-second intervals until slightly softened. Spoon sorbet in large dollops atop peach ice cream, then spread in even layer. Return pan to freezer 15 minutes. Repeat procedure with vanilla ice cream. Freeze until filling is firm, about 4 hours.",
        "Using electric mixer, beat egg whites in large bowl until foamy. Add cream of tartar and salt; beat until soft peaks form. Gradually add sugar and beat until stiff and glossy, about 5 minutes. Beat in vanilla. Spoon meringue atop cake, mounding in center and spreading completely to edge of pan. Using rubber spatula or knife, swirl meringue decoratively, creating pointy tips. Freeze 2 hours. (Can be made 2 days ahead. Cover and keep frozen.)",
        "Preheat broiler. Broil cake just until meringue begins to turn light golden, about 2 minutes. Carefully remove pan sides. Place cake on platter. Serve within 10 minutes with Raspberry-Peach Compote."
    ],
    "ingredients": [
        "3 cups graham cracker crumbs",
        "3/4 cup powdered sugar",
        "3/4 cup (1 1/2 sticks) unsalted butter, melted",
        "1 pint peach ice cream",
        "1 pint raspberry sorbet",
        "1 pint vanilla ice cream",
        "4 large egg whites",
        "1/4 teaspoon cream of tartar",
        "Pinch of salt",
        "1/2 cup superfine sugar",
        "3/4 teaspoon vanilla extract",
        "Raspberry-Peach Compote"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dairy",
        "Egg",
        "Dessert",
        "Broil",
        "Raspberry",
        "Peach",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Meringue-Topped Raspberry and Peach Ice Cream Cake",
    "url": "http://www.epicurious.com/recipes/food/views/meringue-topped-raspberry-and-peach-ice-cream-cake-109596"
}
