{
    "directions": [
        "Preheat oven to 175°F and line 2 large baking sheets with parchment paper.",
        "Beat whites with salt in a standing electric mixer at high speed (or with a handheld mixer in 2 batches) until they just hold stiff peaks. Gradually add sugar, beating at high speed until whites hold stiff, glossy peaks.",
        "Spoon half of meringue into pastry bag and pipe 1-inch-wide kisses onto 1 baking sheet, about 1/2 inch apart. Pipe more kisses onto second sheet in same manner. (All kisses will fit on 2 baking sheets.)",
        "Bake meringues in upper and lower thirds of oven until crisp but still white, about 2 hours.",
        "Turn off oven and cool meringues in oven 1 hour, then cool completely on sheets on a rack..",
        "Sprinkle gelatin over 2 tablespoons pulp in a small heatproof cup and let stand 1 minute to soften.",
        "Melt softened gelatin in cup in a pan of simmering water, then stir into remaining pulp.",
        "Beat heavy cream with confectioners sugar using cleaned beaters until it just holds soft peaks, then beat in sour cream until mixture holds stiff peaks. Fold pulp into cream and chill fool, covered, at least 4 hours and up to 1 day.",
        "Serve fool with meringues."
    ],
    "ingredients": [
        "8 large egg whites",
        "3/4 teaspoon salt",
        "2 cups superfine granulated sugar",
        "1 1/2 teaspoons unflavored gelatin",
        "3/4 cup thawed frozen passion-fruit pulp",
        "1 cup chilled heavy cream",
        "3/4 cup confectioners sugar",
        "1/2 cup sour cream",
        "Special equipment: a large pastry bag fitted with a 1/4-inch plain tip and parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Summer",
        "Passion Fruit",
        "Gourmet",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Meringue Kisses with Passion-Fruit Fool",
    "url": "http://www.epicurious.com/recipes/food/views/meringue-kisses-with-passion-fruit-fool-105137"
}
