{
    "directions": [
        "Put oven racks in upper and lower thirds of oven and preheat oven to 425°F.",
        "Oil 2 large baking sheets and dust with flour, knocking off excess. Trace 2 (8-inch) rounds on each baking sheet with a fingertip, using an inverted plate or a saucepan lid as a guide.",
        "Whisk together flour and granulated sugar in a small bowl. Beat egg whites with a pinch of salt in a bowl using an electric mixer at medium-high speed until they just hold stiff peaks. Fold in sugar mixture gently but thoroughly, then fold in nuts. Divide meringue among circles, spreading to fill in circles thinly and evenly.",
        "Bake meringues in upper and lower thirds of oven, switching position of sheets halfway through baking, until golden brown, 8 to 10 minutes total (meringue will be soft). Loosen meringue rounds with a large metal spatula and transfer to racks to cool.",
        "While meringues cool, heat chocolate, water, and coffee in a small heavy saucepan over moderately low heat, stirring until smooth. Cool to lukewarm, then spread chocolate evenly over tops of meringue rounds. Cool at room temperature until chocolate is set, about 3 hours.",
        "Beat cream with confectioners sugar and kirsch in a bowl with cleaned beaters until it holds stiff peaks. Arrange 1 meringue round, chocolate side up, on a cake stand or plate, then spread 1/3 cup whipped cream over it. Top with a second round and spread with 1/3 cup whipped cream. Repeat, then top with remaining meringue round. Frost top and side of torte with remaining whipped cream."
    ],
    "ingredients": [
        "Vegetable oil for greasing",
        "3 tablespoons all-purpose flour plus additional for dusting",
        "1/2 cup granulated sugar",
        "5 large egg whites, at room temperature for 30 minutes",
        "3 oz almonds or hazelnuts, toasted (see cooks' note, below), chopped, and finely ground in a food processor (3/4 cup)",
        "5 1/2 oz fine-quality bittersweet chocolate (not unsweetened), chopped",
        "1/4 cup water",
        "1 teaspoon instant-coffee granules",
        "1 1/2 cups chilled heavy cream",
        "3 tablespoons confectioners sugar",
        "1 tablespoon kirsch or Cognac",
        "Garnish: grated bittersweet chocolate or chocolate curls"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Winter",
        "Hazelnut",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Meringue, Chocolate, and Kirsch Cream Layer Cake",
    "url": "http://www.epicurious.com/recipes/food/views/meringue-chocolate-and-kirsch-cream-layer-cake-108902"
}
