{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Lightly brush a 15- by 10-inch shallow baking pan (1/2 inch to 1 inch deep) with vegetable oil and line bottom and sides of pan with parchment paper, then lightly oil parchment.",
        "Beat whites with salt in a bowl with an electric mixer at medium speed until they just hold soft peaks. Add superfine sugar a little at a time, beating, then increase speed to high and continue to beat until whites hold stiff, glossy peaks, about 2 minutes. Spread meringue evenly in baking pan and bake until top is pale golden and crisp, 20 to 25 minutes (interior of meringue will be soft). Put a sheet of parchment over meringue and invert a rack over parchment, then flip meringue onto rack and remove parchment (from baking pan) from top. Cool meringue completely, about 15 minutes.",
        "Finely grind sugar with anise seeds in coffee/spice grinder. Beat cream in a bowl with cleaned beaters until it just holds soft peaks, then add anise sugar, beating until cream just holds stiff peaks.",
        "Slide meringue (still on parchment) off rack and arrange with a long side nearest you, then spread anise cream evenly over bottom two thirds of meringue, leaving a 1-inch border on each short end. Using parchment as an aid and rolling away from you, roll up meringue. Carefully transfer roulade with 2 metal spatulas to a platter and discard paper."
    ],
    "ingredients": [
        "Vegetable oil for greasing pan",
        "5 large egg whites",
        "1/8 teaspoon salt",
        "1 1/4 cups superfine granulated sugar",
        "2 tablespoons regular granulated sugar",
        "1 1/2 teaspoons anise seeds",
        "1 1/2 cups chilled heavy cream",
        "Special equipment: parchment paper; an electric coffee/spice grinder",
        "Accompaniment: baked figs in lemon syrup"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Anise",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Meringue Roulade with Anise Cream",
    "url": "http://www.epicurious.com/recipes/food/views/meringue-roulade-with-anise-cream-231016"
}
