{
    "directions": [
        "Preheat the oven to 225 degrees F (110 degrees C). Line 2 cookie sheets with parchment paper or aluminum foil.",
        "In a large glass or metal bowl, use an electric mixer to whip egg whites until foamy. Add cream of tartar, salt, and vanilla. Continue whipping until the whites hold soft peaks. Gradually sprinkle in the sugar so that it does not sink to the bottom, and continue whipping until the mixture holds stiff shiny peaks.",
        "Place a round tip into a pastry bag, and fill the bag half way with the meringue. To pipe the mushroom caps, squeeze out round mounds of meringue onto one of the prepared cookie sheets. Pull the bag off to the side to avoid making peaks on the top.  For the stems, press out a tiny bit of meringue onto the other sheet, then pull the bag straight up. They should resemble candy kisses. Do not worry about making all of the pieces exactly the same. The mushrooms will look more natural if the pieces are different sizes.  Dust the mushroom caps lightly with cocoa using a small sifter or strainer.",
        "Bake for 1 hour in the preheated oven, or until the caps are dry enough to easily remove from the cookie sheets. Set aside to cool completely. Melt the coating chocolate in a metal bowl over simmering water, or in a glass bowl in the microwave, stirring occasionally until smooth.",
        "Poke a small hole in the bottom of a mushroom cap. Spread chocolate over the bottom of the cap. Dip the tip of a stem in chocolate, and press lightly into the hole. When the chocolate sets, they will hold together. Repeat with remaining pieces. Store at room temperature in a dry place or tin."
    ],
    "ingredients": [
        "1/2 cup egg whites",
        "1/4 teaspoon cream of tartar",
        "1/4 teaspoon salt",
        "1 teaspoon vanilla extract",
        "1 cup white sugar",
        "1 tablespoon unsweetened cocoa powder",
        "4 ounces chocolate confectioners' coating"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Meringue Mushrooms",
    "url": "http://allrecipes.com/recipe/40322/meringue-mushrooms/"
}
