{
    "directions": [
        "Remove the turkey from refrigerator and allow it to stand at room temperature for about 45 minutes to an hour.",
        "While turkey is reaching room temperature, place a rack in the lowest position in an oven.  Line a large turkey roasting pan with heavy duty aluminum foil, and spray the lined pan with cooking spray.  Preheat oven to 425 degrees F (220 degrees C).",
        "Remove the giblets and neck from the turkey cavity, and set aside.  Wash and dry the turkey with paper towels, and rub the turkey with vegetable oil.  Sprinkle the turkey, inside and out, with lemon pepper seasoning.  Sprinkle the inside of the cavity with salt, and place the quartered onion, parsley sprigs, rosemary, and oranges in the cavity.  Sprinkle the area under the neck skin with lemon pepper seasoning, and stuff the area with a few slices of onion. Loosely tie the legs, and fold the wings underneath the turkey.",
        "Place the prepared turkey into the roasting pan.  Surround the turkey with the giblets and neck, remainder of sliced onion, and carrot.  Mix the white wine, cognac, chicken broth, and tomato juice in a saucepan and heat over medium heat until liquid is hot but not boiling.   Pour half the liquid into the turkey cavity and the other half into the pan.  Cover the turkey with more aluminum foil, making a tent so the foil doesn't contact the turkey skin.  Crimp the foil firmly over the edges of the pan to completely seal the turkey in the foil tent.",
        "Roast in the oven for 1 hour.  Remove the turkey from the oven, slit the foil tent, and fold the foil back to expose the turkey skin. Reduce oven temperature to 400 degrees F (205 degrees C) and roast the turkey for 1 more hour, until no longer pink at the bone and the juices run clear.  An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). Remove the turkey from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area 10 to 15 minutes before slicing."
    ],
    "ingredients": [
        "1 (12 pound) turkey, thawed if purchased frozen",
        "1 tablespoon vegetable oil",
        "1 teaspoon lemon pepper seasoning",
        "2 teaspoons salt",
        "1 onion, quartered",
        "8 sprigs fresh parsley",
        "1 teaspoon dried rosemary",
        "2 oranges, quartered",
        "1 large onion, sliced",
        "1 carrot, sliced",
        "1 cup white wine",
        "1/2 cup cognac",
        "1 (14.5 ounce) can chicken broth",
        "1/2 cup tomato juice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Merritt Family Two Hour Turkey",
    "url": "http://allrecipes.com/recipe/182923/merritt-family-two-hour-turkey/"
}
