{
    "directions": [
        "In a medium skillet, brown the sausage over medium heat.  Remove from pan, and drain on paper towels to remove some of the fat.  Discard fat in pan.",
        "In a large skillet, heat vegetable oil over high heat.  Brown chicken pieces in hot oil.  Turn frequently until golden brown on all sides.  Transfer chicken to a dish, leaving oil in pan.  Set chicken aside, but keep warm.",
        "Make a roux by whisking flour into the hot vegetable oil.  Turn heat down to low.  Continue cooking flour and oil mixture, stirring constantly, until it reaches a dark brown color. This may take 30 to 45 minutes;  the darker the roux, the better the final gumbo.",
        "When the roux is a dark brown color, quickly add the sausage, onion, green onion tops, green pepper, parsley, and garlic.  Cook over low heat until the vegetables are wilted, about 10 minutes, stirring constantly.",
        "Stir in 2 cups water and spices.  Add chicken parts.  Add rest of the water slowly.  Bring mixture to a boil, and reduce heat.  Simmer for about 45 minutes, until chicken is done and tender.",
        "Remove chicken pieces, and save for another use.  Add shrimp to gumbo; cook for about 8 to 10 minutes more.  Remove bay leaves.  Taste, and adjust seasoning.  Serve gumbo in deep bowls.  Sprinkle file powder over individual servings, and stir in."
    ],
    "ingredients": [
        "1 pound smoked sausage, cut into 1/4 inch rounds",
        "1/2 cup vegetable oil",
        "1 (4 pound) chicken, cut into parts",
        "2/3 cup all-purpose flour",
        "2 cups chopped onion",
        "1/2 cup chopped green onions",
        "2/3 cup green bell pepper, finely chopped",
        "2 tablespoons chopped fresh parsley",
        "1 tablespoon minced garlic",
        "2 pounds medium shrimp - peeled and deveined",
        "8 cups water",
        "salt to taste",
        "ground black pepper to taste",
        "1/8 teaspoon cayenne pepper",
        "1 teaspoon dried thyme",
        "2 bay leaves",
        "file powder"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Merwin's Shrimp Gumbo",
    "url": "http://allrecipes.com/recipe/12717/merwins-shrimp-gumbo/"
}
