{
    "directions": [
        "Preheat oven to 400°F. Whisk first 5 ingredients in small bowl. Season dressing generously with salt and pepper.",
        "Spread almonds on plate. Whisk egg and 1 tablespoon water in small bowl; sprinkle with freshly ground black pepper. Turn goat cheese rounds in egg mixture, then coat with sliced almonds, covering all sides. Place on rimmed baking sheet. DO AHEAD: Dressing and goat cheese rounds can be made 4 hours ahead. Cover separately and chill. Bring dressing to room temperature and whisk before using.",
        "Bake goat cheese rounds until cheese is warm but not melted, about 10 minutes.",
        "Combine greens, cherries, and fennel in large bowl. Add dressing and toss to coat. Divide salad among 6 plates. Place 1 cheese round on each plate and serve."
    ],
    "ingredients": [
        "2 tablespoons roasted almond oil or olive oil",
        "2 tablespoons finely chopped shallot",
        "2 tablespoons chopped fresh tarragon",
        "1 tablespoon fresh lemon juice",
        "3/4 teaspoon finely grated lemon peel",
        "3/4 cup sliced almonds (about 3 ounces)",
        "1 large egg",
        "1 tablespoon water",
        "1 11-ounce log soft fresh goat cheese, cut crosswise into 6 rounds",
        "6 cups (packed) mixed baby greens or baby spinach",
        "1 cup halved pitted fresh Bing cherries or other dark sweet cherries (about 7 ounces whole unpitted cherries)",
        "1/2 cup 2x1/4-inch strips fresh fennel bulb"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Bake",
        "Vegetarian",
        "High Fiber",
        "Graduation",
        "Father's Day",
        "Goat Cheese",
        "Cherry",
        "Spring",
        "Summer",
        "Shower",
        "Lettuce",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Mesclun and Cherry Salad with Warm Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/mesclun-and-cherry-salad-with-warm-goat-cheese-242512"
}
