{
    "directions": [
        "In a small sauté pan over moderate heat, melt the butter until it begins to bubble slightly. Add the garlic and sauté, stirring occasionally, until golden brown and slightly crisp, about 2 minutes. Pour the garlic and butter into a small bowl and let cool. Do not clean the pan.",
        "In a small bowl or measuring cup, combine the shallots, lemon juice, olive oil, and Dijon mustard. Whisk to combine then season to taste with fine sea salt and freshly ground black pepper.",
        "Return the small sauté pan to the stove over low heat and toast the pine nuts, stirring occasionally, until aromatic and light golden brown, about 3 minutes. Transfer to a plate and let cool.",
        "In a large bowl, layer the mesclun, pepper, beets, tomatoes, cranberries, and pine nuts. Add the dill, dried onion flakes, and fried garlic, including the butter from the bowl. Shake the dressing thoroughly then drizzle it over the salad and toss to combine. Season to taste with salt and pepper, crumble goat cheese over top, and serve."
    ],
    "ingredients": [
        "1 tablespoon unsalted butter",
        "4 cloves garlic, thinly sliced",
        "2 large shallots, minced",
        "Juice of 1 large lemon",
        "3 tablespoons extra-virgin olive oil",
        "2 tablespoons Dijon mustard",
        "1/2 cup pine nuts",
        "About 10 cups mesclun",
        "1 large orange bell pepper, seeded and coarsely chopped",
        "4 cooked beets, thinly sliced",
        "1 pint cherry tomatoes, halved",
        "1/2 cup dried cranberries",
        "1 tablespoon minced fresh dill or 1 teaspoon dried",
        "1/8 teaspoon dried onion flakes",
        "4 ounces fresh goat cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Cheese",
        "Garlic",
        "Leafy Green",
        "Tomato",
        "Dinner",
        "Lunch",
        "Goat Cheese",
        "Cranberry",
        "Pine Nut",
        "Bell Pepper",
        "Beet",
        "Summer",
        "Healthy",
        "Lettuce",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mesclun Salad with Veggies, Goat Cheese, and Crispy Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/mesclun-salad-with-veggies-goat-cheese-and-crispy-garlic-51103600"
}
