{
    "directions": [
        "Sprinkle yeast over warm water in small bowl; stir to dissolve. Let stand 5 minutes. Stir in 2 tablespoons oil. Mix 2 1/2 cups flour and salt in processor using on/off turns. With machine running, pour yeast mixture through feed tube and process until combined, about 10 seconds. Knead dough on lightly floured surface until smooth and elastic, adding more flour to dough if sticky, about 5 minutes.",
        "Brush large bowl with olive oil. Add dough, turning to coat entire surface. Cover and let rise in warm draft-free area until doubled in volume, about 1 1/2 hours. (Can be prepared 1 day ahead. Punch dough down; cover and refrigerate. Bring to room temperature before continuing with recipe.)",
        "Prepare covered barbecue grill (medium-high heat). Brush 14-inch pizza pan with 1-inch-high sides with olive oil. Punch dough down and knead 2 minutes. Roll dough out on lightly floured surface to 16-inch round. Transfer to prepared pan. Spread sauce over dough; sprinkle with black and green olives. Top with both cheeses, then mushrooms and bell peppers. Drizzle with 1 tablespoon oil. Sprinkle with minced herbs if desired.",
        "Add mesquite chips to fire. Open bottom barbecue vent. Place pizza on rack on lowest rung. Cover, leaving top vent half open. Bake until crust is golden brown, checking occasionally, about 15 minutes. Serve immediately."
    ],
    "ingredients": [
        "1 envelope dry yeast",
        "3/4 cup plus 2 tablespoons warm water (105°F. to 115°F.)",
        "2 tablespoons olive oil",
        "2 1/2 cups (or more) bread flour",
        "1 teaspoon salt",
        "Olive oil",
        "1 cup prepared pizza sauce",
        "3/4 cup pitted black olives, halved",
        "1/4 cup pitted green olives, halved",
        "12 ounces mozzarella cheese, shredded (about 3 1/2 cups)",
        "1/2 cup grated Parmesan cheese",
        "1/3 pound mushrooms, sliced",
        "1/2 green bell pepper, cut julienne",
        "1/2 red bell pepper, cut julienne",
        "1 tablespoon olive oil",
        "Minced fresh herbs such as oregano, basil and rosemary (optional)",
        "1/2 cup mesquite chips soaked in water 30 minutes and drained"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Olive",
        "Pepper",
        "Vegetarian",
        "Summer",
        "Grill/Barbecue",
        "New York"
    ],
    "title": "Mesquite-Grilled Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/mesquite-grilled-pizza-2026"
}
