{
    "directions": [
        "Pre-heat electric pressure cooker; add 1 tablespoon oil to the pot.",
        "Mix flour, paprika, salt, pepper, cumin, oregano, and garlic powder together in a mixing bowl. Toss cubed beef with flour mixture. Brown beef cubes in 3 batches in preheated cooker about 8 minutes per batch, adding an additional tablespoon of oil after each batch. As beef browns, transfer it to a dish.",
        "Add minced garlic and 1 can of Hunt's(R) diced tomatoes to the empty pot; scrape and stir to release the browned bits from the bottom. Add beef broth and bay leaves; transfer browned beef back to the pot. Seal pressure cooker, close the vent, and set the timer to cook at pressure for 10 minutes. At the end of 10 minutes, allow pressure to naturally release.",
        "Once the pressure has fully released, open lid and add the remaining can of Hunt's(R) diced tomatoes, crushed red pepper flakes, quartered potatoes, carrots, corn, and onion. Close the lid and vent. Cook under pressure for an additional 15 minutes.",
        "At the end of 15 minutes, use quick release to vent the pressure cooker. Stir in the diced cabbage, close the lid.  Let pressure cooker stand with both the lid and vent closed for 10 minutes before serving."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil, divided",
        "1/4 cup flour",
        "1/2 teaspoon paprika",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "1/4 teaspoon cumin",
        "1/4 teaspoon dried Mexican oregano",
        "1/4 teaspoon garlic powder",
        "2 pounds beef chuck roast, cubed",
        "2 cloves garlic, crushed and minced",
        "2 (14.5 ounce) cans Hunt's® Diced Tomatoes, divided",
        "1 quart beef broth",
        "2 bay leaves",
        "1/2 teaspoon crushed red pepper flakes, or to taste",
        "3 large red potatoes, quartered",
        "2 large carrots, peeled and sliced",
        "2 cups frozen corn",
        "1/2 onion, diced",
        "1/2 head cabbage, coarsely chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mexican Beef and Vegetable Stew",
    "url": "http://allrecipes.com/recipe/256295/mexican-beef-and-vegetable-stew/"
}
