{
    "directions": [
        "Place tomatoes in medium bowl. Add enough boiling water to cover; steep until soft, about 15 minutes. Drain tomatoes. Slice tomatoes into matchstick-size strips and place in small bowl. Add 2 tablespoons oil and vinegar; toss to coat. Season to taste with salt and pepper. (Tomatoes can be prepared 1 day ahead. Cover and let stand at room temperature.)",
        "Line baking pan with paper towels. Cook chorizo in large nonstick skillet over medium heat until brown, crumbling with back of fork, about 10 minutes. Using slotted spoon, transfer chorizo to prepared baking pan to drain.",
        "Preheat oven to 350°F. Lightly oil baking sheet. Drain tomatoes, reserving vinaigrette. Sprinkle garlic over 2 tortillas. Sprinkle 1/4 of cheese, 1/4 of chorizo, 1/4 of sun-dried tomatoes, 1 teaspoon pine nuts and 1 teaspoon oregano atop each. Place remaining 2 tortillas atop pizzas. Heat 1 tablespoon plus 1 teaspoon oil in large skillet over medium heat. Place 1 pizza in skillet and cook until golden brown on bottom, about 4 minutes. Turn pizza, bottom side up, onto prepared baking sheet. Repeat with remaining oil and pizza.",
        "Sprinkle remaining cheese, chorizo and sun-dried tomatoes equally atop pizzas. Place 6 poblano chili rings atop each pizza. Brush reserved vinaigrette over chili rings. Sprinkle remaining 2 teaspoons pine nuts over pizzas. Bake pizzas until bottoms are brown and cheese melts, about 10 minutes. Transfer pizzas to cutting board. Cut each pizza into 12 wedges and serve."
    ],
    "ingredients": [
        "2 ounces sun-dried tomatoes (do not use oil-packed)",
        "4 tablespoons plus 2 teaspoons olive oil",
        "2 tablespoons balsamic vinegar",
        "3/4 pound pork chorizo, casings removed",
        "1 garlic clove, minced",
        "4 9-inch flour tortillas",
        "1 1/2 cups grated Monterey Jack cheese",
        "4 teaspoons pine nuts, toasted",
        "2 teaspoons dried oregano",
        "1 poblano chili,* sliced into 12 rings",
        "*A fresh green chili, often called a pasilla, available at Latin American markets and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pork",
        "Tomato",
        "Appetizer",
        "Bake",
        "Super Bowl",
        "Lunch",
        "Sausage",
        "Hot Pepper",
        "Sugar Conscious",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Mexican Pizza with Chorizo, Monterey Jack Cheese and Sun-Dried Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/mexican-pizza-with-chorizo-monterey-jack-cheese-and-sun-dried-tomatoes-3011"
}
