{
    "directions": [
        "In a dry heavy skillet cook 1 cup of the sugar over moderate heat until it begins to melt and continue cooking it, stirring with a fork, until it is melted completely and is a golden caramel. Pour the caramel into a 1 1/2-quart ring mold. Using potholders to hold the mold tilt and rotate the mold to coat the bottom and let the caramel cool.",
        "Preheat the oven to 350°F. In a bowl with an electric mixer beat the egg whites with the salt until they are foamy, add the cream of tartar, and beat the whites until they just hold stiff peaks. Beat in the remaining 3/4 cup sugar, a little at a time, and beat the meringue until it holds stiff glossy peaks. Spoon the meringue into the ring mold, rapping the mold sharply on a hard surface to expel any air bubbles, and smooth the top. (The meringue will fill the mold completely.) Transfer the mold to a deep baking pan, add enough hot water to the pan to reach 1 inch up the side of the mold, and bake the meringue in the middle of the oven for 1 hour. (The meringue will rise completely and will deflate as it cools.) Turn off the oven and let the meringue stand in the oven for 15 minutes. Transfer the mold to a rack and let it cool completely. The meringue may be made 1 day in advance and kept covered and chilled. Invert the meringue onto a deep serving plate, letting the melted caramel drip over the top and down the sides. Some of the caramel will remain, hardened, in the bottom of the mold. Put the mold in a skillet of simmering water and heat the caramel, stirring occasionally, until it has melted. Spoon the Kahlúa custard sauce around the meringue, drizzle the meringue decoratively with the melted caramel, and crumble some of the sesame pumpkin-seed brittle over it. Serve the remaining custard sauce separately.",
        "In a small heavy saucepan bring the half-and-half just to a boil with the vanilla bean and remove the pan from the heat. In a bowl whisk together the egg yolks and the sugar until the mixture is combined well and add the half-and-half mixture in a slow stream, whisking. Transfer the mixture to a heavy saucepan and cook it over moderate heat, stirring constantly with a wooden spoon, until it thickens slightly and registers 175°F. on a candy thermometer. (The sauce will thicken as it cools.) Strain the custard sauce through a fine sieve into a metal bowl set in a larger bowl of ice and cold water, let it cool, stirring, and stir in the Kahlúa. Chill the sauce, covered, for at least 2 hours, or until it is very cold. The sauce may be made 2 days in advance and kept covered and chilled. Makes about 2 cups.",
        "In a dry heavy skillet cook the sugar over moderate heat until it begins to melt and continue cooking it, stirring with a fork, until it is melted completely and is a golden caramel. Remove the skillet from the heat, stir in the pepitas and the sesame seeds, and, working quickly, pour the mixture onto a sheet of foil. Let the brittle cool and break it into small pieces. The brittle may be made 1 week in advance and kept in an airtight container. Makes about 1/2 pound."
    ],
    "ingredients": [
        "1 3/4 cups sugar",
        "6 large egg whites",
        "1/4 teaspoon cream of tartar",
        "2 cups half-and-half",
        "1 vanilla bean, split lengthwise",
        "6 large egg yolks",
        "1/2 cup sugar",
        "3 tablespoons Kahlúa, or to taste",
        "1 cup sugar",
        "3 tablespoons pepitas (hulled green pumpkin seeds, available at natural foods stores and some Hispanic markets), chopped",
        "1 1/2 teaspoons sesame seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Kahlúa",
        "Pumpkin",
        "Fall",
        "Sesame",
        "Gourmet"
    ],
    "title": "Mexican Floating Island with Kahlua Custard Sauce and Sesame Pumpkin-Seed Brittle",
    "url": "http://www.epicurious.com/recipes/food/views/mexican-floating-island-with-kahlua-custard-sauce-and-sesame-pumpkin-seed-brittle-13159"
}
