{
    "directions": [
        "In a large bowl, mix together the ground beef and pork, eggs, bread crumbs, 1 teaspoon of salt, pepper, 2 cloves of minced garlic, and water using your hands. Form into 1 inch meatballs, and set aside on a piece of waxed paper.",
        "Pour the diced tomatoes into the container of a blender along with the chipotle peppers. Blend until smooth, and set aside.",
        "Heat the oil in a large Dutch oven over medium heat. Add the onion; cook and stir until tender. Stir in the remaining garlic and cumin, and cook for a few minutes to release the aromas. Pour in the tomato mixture and chicken broth. Season with the remaining teaspoon of salt, and mix well. Bring to a boil, then simmer over low heat while you brown the meatballs.",
        "Heat a large skillet over medium-high heat. Spray with cooking spray. Add meatballs, but do not crowd them. Fry them in two batches if necessary. Cook, stirring occasionally until browned on the outside. Remove from the skillet, and place into the pot of simmering sauce. Let the meatballs simmer in the sauce for about 30 minutes. Longer will not hurt them.",
        "For special occasions, serve the meatballs in a chafing dish with the sauce, and garnish with cilantro."
    ],
    "ingredients": [
        "1 1/2 pounds ground beef",
        "1 1/2 pounds ground pork",
        "2 eggs",
        "1 1/2 cups plain dried bread crumbs",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "2 cloves garlic, minced",
        "1/2 cup water",
        "2 (28 ounce) cans diced tomatoes with juice",
        "3 chipotle peppers in adobo sauce",
        "4 teaspoons vegetable oil",
        "2 small onions, minced",
        "4 cloves garlic, minced",
        "2 teaspoons ground cumin",
        "2 cups chicken broth",
        "1 teaspoon salt",
        "1/2 cup chopped fresh cilantro, for garnish (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mexican Style Meatballs",
    "url": "http://allrecipes.com/recipe/72577/mexican-style-meatballs/"
}
