{
    "directions": [
        "Lay 4 chiles on their sides on racks of gas burners and turn flames on high. Roast chiles, turning with tongs, until skins are blackened and chiles are tender, 4 to 6 minutes. (Or broil all 12 chiles on rack of a broiler pan about 2 inches from heat, turning, until skins are blackened, 8 to 10 minutes.) Transfer immediately to a large bowl and cover with plastic wrap. Roast remaining 8 chiles in same manner, then let stand 20 minutes.",
        "When cool enough to handle, peel chiles, then open flat and discard seeds and stems, wiping with paper towels or dunking in a bowl of water briefly, if necessary, to remove seeds. If chiles taste very spicy, cut out ribs with scissors to make them milder.",
        "Purée tomatoes with juice, garlic, cilantro, sugar, and salt in a blender. Heat oil in a 10-inch nonstick skillet over moderate heat until hot but not smoking, then add sauce (be careful of splattering) and simmer, stirring, until thickened and reduced to about 1 cup, about 6 minutes.",
        "Gently simmer cream, with epazote if using, in a small heavy saucepan, covered, 10 minutes. If using epazote, pour cream through a fine-mesh sieve into a bowl, pressing on and discarding epazote. Return cream to pan. Whisk in goat cheese and salt and heat over low heat, whisking until smooth.",
        "Blanch spinach in batches in a large pot of boiling salted water 1 minute, transferring with a slotted spoon to a large bowl of cold water to cool. Drain in a colander, pressing on spinach with back of a spoon to remove excess water, then coarsely chop.",
        "Heat oil in cleaned nonstick skillet over moderately high heat until hot but not smoking, then sauté spinach and raisins, stirring, 2 minutes. Stir in salt and transfer filling to a plate.",
        "Preheat oven to 350°F.",
        "Heat oil in cleaned nonstick skillet over moderately high heat until hot but not smoking, then fry tortillas 2 halves at a time, turning over once, until just crisp, about 1 minute total. Transfer tortillas to paper towels to drain.",
        "Spread 1/4 cup tomato sauce over bottom of casserole dish. Arrange half of tortillas on top, then spread another 1/4 cup tomato sauce on top and sprinkle evenly with black beans. Arrange 4 poblanos flat over black beans to cover, then spread half of spinach filling evenly over chiles and drizzle with 1/4 cup goat cheese sauce. Make another layer with 4 chiles, remaining spinach filling, and another 1/4 cup of goat cheese sauce, then cover with remaining 4 chiles.",
        "Cover chiles with remaining tomato sauce, spreading evenly, then top with remaining tortillas. Cover tortillas with remaining goat cheese sauce, spreading evenly.",
        "Bake lasagne, covered with foil, in middle of oven until bubbling and heated through, 25 to 30 minutes.",
        "Preheat broiler. Remove foil and broil about 3 inches from heat until top is bubbling and beginning to brown, about 2 minutes.",
        "Available at Latino markets and Kitchen/Market (888-468-4433)"
    ],
    "ingredients": [
        "12 medium to large fresh poblano chiles (2 1/4 lb)",
        "1 (14- to 16-oz) can whole tomatoes including juice",
        "3 large garlic cloves, chopped",
        "1/4 cup chopped fresh cilantro",
        "1/4 teaspoon sugar",
        "1/4 teaspoon salt, or to taste",
        "2 tablespoons olive oil",
        "1 cup heavy cream",
        "2 teaspoons dried epazote* (optional)",
        "8 oz soft mild goat cheese",
        "1/4 teaspoon salt, or to taste",
        "4 (3/4-lb) bunches spinach, coarse stems discarded",
        "2 tablespoons olive oil",
        "1/4 cup raisins",
        "1/4 teaspoon salt, or to taste",
        "3 tablespoons olive oil",
        "6 (6-inch) corn tortillas, halved",
        "1 cup cooked black beans, rinsed and drained if canned",
        "Special equipment: a 2- to 2 1/2-quart shallow flameproof casserole dish (about 2 inches deep; not glass)",
        "Garnish: toasted pine nuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Cheese",
        "Leafy Green",
        "Pepper",
        "Tomato",
        "Fry",
        "Sauté",
        "Vegetarian",
        "Goat Cheese",
        "Spinach",
        "Fall",
        "Winter",
        "Gourmet"
    ],
    "title": "Mexican Poblano, Spinach, and Black Bean \"Lasagne\" with Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/mexican-poblano-spinach-and-black-bean-lasagne-with-goat-cheese-107413"
}
