{
    "directions": [
        "Preheat the oven to 375 degrees F. Line a baking sheet with foil.",
        "Toss the chorizo with 1 tablespoon of the oil on the prepared baking sheet, and bake, turning the chorizo halfway through, until fully cooked, 25 to 30 minutes. When cool enough to handle, carefully peel off the casing without breaking up the sausage.",
        "Meanwhile, cut open the avocado, scoop out the flesh and add it to a food processor. Add the cilantro, sour cream, lime juice, 3/4 teaspoon salt and a few grinds of pepper, and puree until very smooth. Transfer the avocado crema to a small bowl, cover and refrigerate until ready to use.",
        "Place a tortilla on a work surface, and spread with 2 tablespoons of the refried beans, leaving a 1/2-inch border. Sprinkle 1/4 of the Cheddar evenly on top, leaving the 1/2-inch border. Place a cooked chorizo link on the bottom edge of the tortilla, and roll up tightly. Skewer the outside edge with a toothpick to keep it closed. Repeat with the remaining tortillas, beans, Cheddar and chorizo.",
        "Heat the remaining 2 tablespoons oil in a large skillet over medium heat. Place the 4 tortilla rolls in the skillet. If they start browning too quickly, turn the heat down to medium-low. As one side becomes golden brown, turn the rolls a quarter turn. Repeat until the rolls are crisp and golden brown all over, about 5 minutes total.",
        "Transfer the rolls to a cutting board, and let cool for 30 seconds. Cut each into 6 even pieces with a serrated knife. Arrange the pieces, cut-side down, on a platter. Top each with a dollop of avocado crema and some pico de gallo."
    ],
    "ingredients": [
        "4 links fresh Mexican chorizo (about 1 pound)",
        "3 tablespoons vegetable oil",
        "1 ripe avocado",
        "1/4 cup picked fresh cilantro leaves",
        "1/4 cup sour cream",
        "Juice of 1 lime",
        "Kosher salt and freshly ground black pepper",
        "Four 6-inch flour tortillas",
        "1/2 cup canned refried beans",
        "3/4 cup shredded sharp Cheddar",
        "Prepared pico de gallo, strained, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chorizo",
        "Sausage Recipes",
        "Appetizer"
    ],
    "title": "Mexican Chorizo Pigs in Blankets",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/mexican-chorizo-pigs-in-blankets"
}
