{
    "directions": [
        "Place paella pan or large flat-bottomed pan over medium-high heat. Cook and crumble chorizo sausage, stirring to break up chunks, until browned, about 5 minutes. Add chicken; cook and stir with sausage until chicken is no longer pink instead and is browned. Transfer chicken and sausage to a plate.",
        "Reduce heat to medium and add 2 cups of the cauliflower rice. Cook, stirring for 5 minutes to brown the cauliflower slightly (this brings out a nutty flavor). Add the diced onion and bell pepper. Season with a pinch of salt, and pepper to taste. Add the minced garlic. Cook 2 minutes longer.",
        "Pour canned tomatoes into pan. Add bay leaves, thyme leaves, saffron, and basil. Mix well. Transfer sausage and chicken mixture back to pan. Add water, tomato paste, and bouillon. Stir to combine all ingredients. Bring to a boil; reduce heat to medium-low and cover. Simmer 15 minutes.",
        "Remove lid and fold in peas and remaining 1 cup of cauliflower rice. Place frozen tilapia filets on top of the paella mixture, cover and steam for another 10 minutes. Remove lid and check for doneness. Gently break apart fillets with wooden spoon, and stir to incorporate chunks of fish into paella.",
        "Serve from the pot at the table!"
    ],
    "ingredients": [
        "1 pound chorizo sausage",
        "1 skinless, boneless chicken breast",
        "3 cups cauliflower rice, divided",
        "1 medium onion, diced",
        "1 large yellow or orange bell pepper, seeded and chopped",
        "1 pinch salt",
        "ground black pepper to taste",
        "3 cloves garlic, finely minced",
        "1 (14.5 ounce) can Hunt's® Diced Tomatoes",
        "2 bay leaves",
        "1 1/2 teaspoons fresh thyme leaves",
        "1/2 teaspoon crushed saffron threads",
        "1/2 teaspoon dried basil",
        "1/2 cup water",
        "2 tablespoons tomato paste",
        "2 cubes chicken bouillon",
        "1 cup frozen peas",
        "3 frozen tilapia fillets"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mexican Paella with Cauliflower Rice",
    "url": "http://allrecipes.com/recipe/256305/mexican-paella-with-cauliflower-rice/"
}
