{
    "directions": [
        "Preheat oven to 275°F. Bring ancho chiles and 4 cups water to a boil over medium-high. Remove from heat and let cool.",
        "Meanwhile, toast peanuts on a rimmed baking sheet, tossing once, until golden brown, 15–20 minutes. Let cool.",
        "Toast cumin seeds and peppercorns in a dry small skillet, tossing occasionally, until very fragrant, about 2 minutes. Let cool, then finely grind in spice mill or with mortar and pestle with garlic powder and cinnamon.",
        "Purée ancho chiles and soaking liquid, peanuts, spice mixture, and chocolate in a blender until smooth. Strain through a fine-mesh sieve into a Dutch oven or other large heavy pot, reserving any solids. Return solids in sieve to blender and add 3 cups water. Process until smooth and strain back into Dutch oven; discard any solids.",
        "Heat oil in a large skillet over medium-high. Season meat generously with salt. Cook, turning occasionally, until browned all over, 12–15 minutes total. Carefully add meat to Dutch oven and add bay leaves. Bring liquid to a simmer over medium-high. As soon as it just begins to bubble, lower heat, cover pan tightly with foil, then lid. Braise meat until meat shrinks off of bones and is fork-tender, 3–3 1/2 hours (check periodically to make sure liquid is at a gentle simmer).",
        "Meanwhile, purée chiles de árbol, tomatoes, broth, and oregano in a clean blender until smooth. Strain through clean sieve into a large saucepan and bring to a simmer over medium heat; cook 10 minutes to let flavors meld. Season with salt; keep sauce warm.",
        "Increase oven to 400°F. Let meat cool, uncovered, in braising liquid 30 minutes. Transfer meat to a rimmed baking sheet and roast until edges begin to brown, 13–17 minutes. Pull or slice meat into servings. Divide among shallow bowls along with tomato-chile sauce.",
        "Serve meat with onion, cilantro, lime wedges, and tortillas alongside."
    ],
    "ingredients": [
        "4 ounces ancho chiles (about 10), seeds removed",
        "1/2 cup raw peanuts",
        "1 1/2 teaspoons cumin seeds",
        "1 teaspoon black peppercorns",
        "1 1/2 teaspoons garlic powder",
        "1/2 teaspoon ground cinnamon",
        "1/4 disk Abuelita Mexican chocolate or 1 1/2 ounces dark chocolate",
        "2 tablespoons vegetable oil",
        "5 pounds bone-in goat or lamb shoulder",
        "Kosher salt",
        "2 bay leaves",
        "2 chiles de árbol, seeds removed",
        "1/2 (15-ounce) can fire-roasted tomatoes",
        "4 cups low-sodium chicken broth",
        "1/2 teaspoon dried oregano",
        "Chopped white onion, chopped cilantro, lime wedges, and warm corn tortillas (for serving)",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Lamb",
        "Braise",
        "Chile Pepper",
        "Cumin",
        "Taco",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Braised Birria",
    "url": "http://www.epicurious.com/recipes/food/views/mexican-braised-lamb-birrieria"
}
