{
    "directions": [
        "Preheat oven to 350°F. Spray rimmed baking sheet with nonstick spray. Whisk all ingredients except pecans in medium bowl. Stir in pecans. Spread in single layer on sheet, rounded side up. Bake until just browned and dry, about 30 minutes. Cool on sheet. Separate nuts, removing excess coating. DO AHEAD Can be made 2 days ahead. Store airtight at room temperature.",
        "Preheat oven to 350°F. Blend first 4 ingredients in processor. Add melted butter; process until crumbs are moistened. Press crumbs into 9-inch-diameter tart pan with removable bottom, to within 1/8 inch of top. Bake until set, about 20 minutes. Cool on rack.",
        "Bring cream to simmer in medium saucepan. Remove from heat. Add chocolates; whisk until melted. Add butter, 1 piece at a time; whisk until smooth. Whisk in vanilla, cinnamon, and salt. Pour filling into crust. Chill until filling begins to set, about 15 to 20 minutes.",
        "Arrange nuts in concentric circles atop tart. Chill until set, about 4 hours. DO AHEAD Can be made 1 day ahead. Cover loosely with foil and keep chilled. Serve tart with whipped cream."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 large egg white",
        "2 tablespoons sugar",
        "1 tablespoon golden brown sugar",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "1/8 teaspoon cayenne pepper",
        "1 1/2 cups pecan halves",
        "1 cup chocolate wafer cookie crumbs (about half of one 9-ounce package cookies, finely ground in processor)",
        "1/4 cup sugar",
        "1/2 teaspoon ground cinnamon",
        "1/8 teaspoon salt",
        "5 tablespoons unsalted butter, melted",
        "1 cup heavy whipping cream",
        "4 ounces bittersweet or semisweet chocolate, chopped",
        "1 (3.1-ounce) disk Mexican chocolate (such as Ibarra), chopped",
        "1/4 cup (1/2 stick) unsalted butter, cut into 4 pieces, room temperature",
        "2 teaspoons vanilla extract",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon salt",
        "Lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Pecan",
        "Spice",
        "Chill",
        "Cinnamon",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mexican Chocolate Tart with Cinnamon-Spiced Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/mexican-chocolate-tart-with-cinnamon-spiced-pecans-237114"
}
