{
    "directions": [
        "In a small saucepan heat 1/2 cup water to 110°F. and transfer to a large bowl. Stir in yeast and sugar and let stand 5 minutes, or until foamy. Stir in remaining water and dough ingredients to form a dough and on a lightly floured surface knead until smooth and elastic, about 10 minutes.",
        "Put dough in a lightly oiled deep bowl, turning to coat, and let rise, covered loosely, in a warm place until doubled in bulk, about 1 hour. (Alternatively, let dough rise, covered loosely, in refrigerator overnight, or until doubled in bulk.)",
        "In a 4-quart saucepan of boiling water blanch tomatillos 1 minute and drain in a colander. Cut each tomatillo into 8 wedges. In a large heavy skillet cook onion and garlic in oil over moderate heat, stirring occasionally, until onion is pale golden. Add tomatillos and cook over moderate heat, stirring occasionally, until tomatillos are softened and mixture is reduced to about 1 1/4 cups. Cool mixture slightly and in a food processor purée until smooth. Transfer sauce to a bowl and stir in coriander, lime juice, and salt to taste.",
        "In a large heavy skillet cook sausage over moderately high heat, stirring and breaking up lumps, until cooked through and browned. Transfer sausage with a slotted spoon to paper towels to drain.",
        "Preheat oven to 525°F. and adjust oven rack on top shelf. Sprinkle a 16-inch perforated pizza pan with additonal cornmeal.",
        "Punch down dough and on a lightly floured work surface with a floured rolling pin roll out into a 17-inch circle. Fit dough into pan, forming an edge, and bake 5 minutes.",
        "Spread sauce over partially cooked dough, leaving a 1/2-inch border around edge, and sprinkle with sausage, cheese, chilies, scallions, olives, and beans.",
        "Bake pizza 10 minutes, or until cheese is melted and crust is pale golden.",
        "Using a long-handled fork char the peppers over an open flame, turning them, for 2 to 3 minutes, or until the skins are blackened. (Or broil the peppers on the rack of a broiler pan under a preheated broiler about 2 inches from the heat, turning them every 5 minutes, for 15 to 25 minutes, or until the skins are blistered and charred.) Transfer the peppers to a bowl and let them steam, covered, until they are cool enough to handle. Keeping the peppers whole, peel them starting at the blossom end, cut off the tops, and discard the seeds and ribs. (Wear rubber gloves when handling chilies.)"
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons warm water",
        "a 1/4-ounce package active dry yeast (2 1/2 teaspoons)",
        "1/2 teaspoon sugar",
        "3 tablespoons peanut oil",
        "2 1/3 cups all-purpose flour",
        "2/3 cup cornmeal plus additional for sprinkling pizza pan",
        "1 teaspoon salt",
        "1/2 teaspoon ground cumin",
        "1 1/2 pounds fresh tomatillos*, husks discarded",
        "1 small onion, sliced thin",
        "2 garlic cloves, sliced thin",
        "2 tablespoons peanut oil",
        "1/4 cup packed fresh coriander sprigs, washed well, spun dry, and chopped",
        "1 tablespoon fresh lime juice",
        "1 pound fresh chorizo* or other spicy fresh pork sausage, casings discarded",
        "3/4 pound Colby, Cheddar, Monterey jack, or a mixture grated coarse (about 1 1/2 cups)",
        "2 fresh poblano chilies*, roasted (procedure follows) and cut into thin strips (wear rubber gloves)",
        "2 scallions, sliced thin",
        "1/4 cup thinly sliced drained pimento-stuffed green olives",
        "1/4 cup cooked black beans, rinsed if canned",
        "*available at Mexican markets, some specialty foods shops, and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Bean",
        "Cheese",
        "Appetizer",
        "Bake",
        "Kid-Friendly",
        "Sausage",
        "Tomatillo",
        "Gourmet",
        "Denver",
        "Colorado"
    ],
    "title": "Mexican Pizza Webb",
    "url": "http://www.epicurious.com/recipes/food/views/mexican-pizza-webb-11986"
}
