{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 3-inch deep cast iron skillet.",
        "Heat refried beans in a small pot until warmed through, about 5 minutes. Stir in pepper, paprika, and salt. Remove from heat.",
        "Heat oil in a large skillet over medium heat. Add green bell pepper, red bell pepper, and onion; cook and stir until soft, 5 to 10 minutes. Transfer to a plate.",
        "Combine ground beef and chorizo in the skillet; cook and stir until browned, about 5 minutes. Carefully drain excess grease. Stir in chipotle peppers with sauce, 1 1/2 teaspoon chili powder, and 1 teaspoon cumin. Simmer until flavors combine, 5 to 10 minutes. Remove from heat.",
        "Place 1 tortilla in the bottom of the prepared skillet. Layer some of the refried beans, bell pepper mixture, ground beef mixture, 1/3 cup Cheddar cheese, and 1/3 cup Monterey Jack cheese on top. Repeat layers twice more, ending with remaining Cheddar cheese and Monterey Jack cheese.",
        "Bake in the preheated oven until cheese starts to brown, 30 to 45 minutes. Remove from oven and let cool before slicing, 2 to 5 minutes. Garnish with salsa, guacamole, and sour cream."
    ],
    "ingredients": [
        "1 (16 ounce) can refried beans (refritos)",
        "1 teaspoon ground black pepper",
        "1 teaspoon ground paprika",
        "1 pinch salt",
        "1 tablespoon vegetable oil",
        "1 green bell pepper, sliced, or more to taste",
        "1 red bell pepper, sliced",
        "1/2 onion, chopped",
        "1/2 pound ground beef",
        "1/2 pound Mexican chorizo, crumbled",
        "1 (7 ounce) can chipotle peppers in adobo sauce",
        "1 tablespoon chili powder, divided",
        "2 teaspoons ground cumin, divided",
        "3 (10 inch) flour tortillas",
        "1 cup shredded sharp Cheddar cheese, divided",
        "1 cup shredded Monterey Jack cheese, divided",
        "1/4 cup salsa (optional)",
        "1/4 cup guacamole (optional)",
        "1/4 cup sour cream (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mexican Deep-Dish Pizza",
    "url": "http://allrecipes.com/recipe/254252/mexican-deep-dish-pizza/"
}
