{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Butter cake pan well and dust with flour, knocking out excess.",
        "Melt butter (2 sticks) in a 3-quart heavy saucepan over moderately low heat, then whisk in cocoa. Add water and whisk until smooth, then remove from heat. Whisk in separately sugar, eggs, buttermilk, and vanilla.",
        "Sift together flour, baking soda, cinnamon, and salt into a bowl, then sift again into cocoa mixture and whisk until just combined (don't worry if there are lumps).",
        "Pour batter into cake pan and bake until a wooden pick or skewer comes out with a few crumbs adhering, 45 to 55 minutes. (Leave oven on.)",
        "Cool cake in pan on a rack 20 minutes, then loosen edges with a thin knife and invert onto a plate.",
        "Spread pecans in 1 layer in a shallow baking pan (1 inch deep) and bake until fragrant and a shade darker, 6 to 8 minutes. Cool pecans slightly in pan on a rack, about 5 minutes.",
        "Melt butter in a 2-quart heavy saucepan over low heat, then stir in half-and-half and confectioners sugar. Add chocolate and cook, stirring, until smooth. Remove from heat and stir in pecans and salt. Cool glaze until slightly thickened, about 5 minutes.",
        "Spoon glaze over top and sides of cake (cake will still be warm) and spread with a small offset spatula or knife to cover completely."
    ],
    "ingredients": [
        "2 sticks (1 cup) unsalted butter",
        "1/2 cup Dutch-process unsweetened cocoa powder",
        "3/4 cup water",
        "2 cups granulated sugar",
        "2 large eggs",
        "1/2 cup well-shaken buttermilk",
        "2 tablespoons vanilla",
        "2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon cinnamon",
        "1/4 teaspoon salt",
        "2 cups chopped pecans (71/2 ounces)",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/2 cup half-and-half",
        "1/2 cup confectioners sugar",
        "5 ounces fine-quality bittersweet chocolate (not unsweetened), finely chopped",
        "1/4 teaspoon salt",
        "Special equipment: a 9-inch tube pan or 12-cup bundt pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Bake",
        "Cinco de Mayo",
        "Pecan",
        "Cinnamon",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mexican Chocolate Cake",
    "url": "http://www.epicurious.com/recipes/food/views/mexican-chocolate-cake-109342"
}
