{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray a large disposable aluminum roasting pan with cooking spray.",
        "Brown ground beef in a large skillet over medium heat, breaking the meat into crumbles as it browns, 10 to 12 minutes. Drain excess grease and stir in taco seasoning and half the enchilada sauce. Reserve remaining enchilada sauce for later use. Bring beef mixture to a boil, reduce heat to low, and simmer until thickened, about 5 minutes. Set meat aside.",
        "Layer one package of tortillas into the bottom of the prepared aluminum roasting pan and spread refried beans evenly in a layer over the tortillas. Arrange 1 more package of halved tortillas over the beans, and top with slices of queso fresco. Spread 1 package of reduced-fat Mexican cheese blend over queso fresco slices. Lay half the sliced nopalitos in a criss-cross pattern over the shredded cheese.",
        "Top nopalito layer with 1 more package of tortillas and spread beef mixture over the tortillas; top with remaining package of tortillas. Finish casserole with remaining enchilada sauce and remaining 1 package cheese blend. Top the cheese with remaining nopalito slices arranged in a criss-cross pattern.",
        "Bake in the preheated oven until casserole is bubbling and the cheese topping is melted and starting to brown, 25 to 30 minutes. Serve in squares."
    ],
    "ingredients": [
        "cooking spray",
        "4 pounds ground beef",
        "2 envelopes taco seasoning mix",
        "1 (28 ounce) can enchilada sauce, divided",
        "4 (15 ounce) packages flour tortillas, cut in half - divided",
        "2 (16 ounce) cans fat-free refried beans",
        "2 (12 ounce) packages queso fresco (Mexican cheese), thinly sliced - divided",
        "2 (16 ounce) packages shredded reduced-fat Mexican cheese blend, divided",
        "1 (16 ounce) jar nopalitos (sliced cactus), drained - divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mexican Lasagna with Cactus",
    "url": "http://allrecipes.com/recipe/222012/mexican-lasagna-with-cactus/"
}
