{
    "directions": [
        "Place a stockpot over medium heat and coat with 2 tablespoons of the olive oil. Add the onions, garlic, jalapenos, and tomatoes; cook, stirring for 15 minutes until the vegetables are cooked down and pulpy. Pour in the stock, season with salt and pepper, and simmer for 20 minutes.",
        "Meanwhile, heat 1-inch of canola oil in a skillet over medium-high flame. When the oil begins to smoke, add the tortilla strips in batches and fry until they are crisp on all sides. Remove to a paper towel-lined platter and sprinkle with salt while they are still hot.",
        "Ladle the hot soup into 4 soup bowls and put a pile of shredded chicken on top of each. Top with the diced avocado and fried tortilla strips (and cheese if using). Garnish with cilantro and serve with lime wedges.",
        "Place the chicken and vegetables in a large stockpot over medium heat. Pour in only enough cold water to cover (about 3 quarts); too much will make the broth taste weak. Toss in the thyme, bay leaves, and peppercorns, and allow it to slowly come to a boil. Lower the heat to medium-low and gently simmer for 1 to 1 1/2 hours, partially covered, until the chicken is done. As it cooks, skim any impurities that rise to the surface; add a little more water if necessary to keep the chicken covered while simmering.",
        "Carefully remove the chicken to a cutting board. When its cool enough to handle, discard the skin and bones; hand-shred the meat into a storage container.",
        "Carefully strain the stock through a fine sieve into another pot to remove the vegetable solids. Use the stock immediately or if you plan on storing it, place the pot in a sink full of ice water and stir to cool down the stock. Cover and refrigerate for up to one week or freeze.",
        "Yield: 2 quarts"
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "2 medium white onions, diced",
        "2 garlic cloves, minced",
        "2 jalapenos, seeded and minced",
        "3 ripe medium tomatoes, chopped",
        "1 quart chicken stock, recipe follows",
        "Salt and freshly ground black pepper",
        "Canola oil, for pan-frying",
        "8 corn tortillas, cut into 1/8-inch-thick strips",
        "1 1/2 cups shredded cooked chicken",
        "2 avocados, halved, pitted, peeled, and diced",
        "1 cup shredded Jack cheese, optional",
        "1/2 cup coarsely chopped fresh cilantro leaves, for garnish",
        "1 lime, cut in wedges, for serving",
        "1 whole free-range chicken (about 3 1/2 pounds), rinsed, giblets discarded",
        "2 carrots, cut in large chunks",
        "3 celery stalks, cut in large chunks",
        "2 large white onions, quartered",
        "1 head of garlic, halved",
        "1 turnip, halved",
        "1/4 bunch fresh thyme leaves",
        "2 bay leaves",
        "1 teaspoon whole black peppercorns"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Mexican Chicken",
        "Chicken",
        "Poultry Recipes",
        "Chicken Soup",
        "Soup",
        "Tortilla Soup",
        "Avocado",
        "Vegetable",
        "Fruit",
        "Lime Recipes",
        "Jalapeno Recipes",
        "Main Dish Recipes",
        "Appetizer",
        "Sauteing Recipes"
    ],
    "title": "Mexican Tortilla Chicken Soup",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/mexican-tortilla-chicken-soup-recipe"
}
