{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.",
        "In a large bowl, whisk the flour, 1/3 cup of sugar, 1 1/2 teaspoons of salt, and baking powder together. Cut the shortening into the flour mixture until it resembles coarse crumbs; stir the water in, about 2 tablespoons at a time, just until you can gather the dough together. Knead the dough a few times in the bowl, then scrape it out onto a floured surface. Cut the dough in quarters, and cut each quarter into thirds to make 12 equal portions. Roll the portions into balls. Cover the dough balls with a cloth, and allow to rest while you make the filling.",
        "Mix the pumpkin, 2 eggs, 1 cup of sugar, 1 teaspoon of salt, cinnamon, ginger, and cloves together until smooth. On a floured surface, roll each dough ball out into a thin circle about 6 inches across; spoon about 1/3 cup of filling into the center of the dough circle. Fold the dough over the filling to make a half-moon shaped pie, and crimp the  edges of the crust together with a fork, leaving little fork lines in the dough. Gently lay the empanadas onto the prepared baking sheets. Brush the top of each pie with beaten egg.",
        "Bake in the preheated oven until the filling is hot and the crusts are shiny and browned, about 20 minutes."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1/3 cup white sugar",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon baking powder",
        "1 cup vegetable shortening",
        "1 cup warm water",
        "4 cups canned pure pumpkin",
        "2 eggs",
        "1 cup white sugar",
        "1 teaspoon salt",
        "1 1/2 teaspoons ground cinnamon",
        "1 teaspoon ground ginger",
        "1/2 teaspoon ground cloves",
        "1 beaten egg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mexican Pumpkin Empanadas",
    "url": "http://allrecipes.com/recipe/216489/mexican-pumpkin-empanadas/"
}
