{
    "directions": [
        "Preheat the oven to 325°F. Butter an 8 1/2-inch springform pan and line it with a round of wax paper. Butter the paper and dust the pan with flour, knocking out the excess. In a food processor blend together the almonds, the brown sugar, the cinnamon, and the salt until the almonds are ground fine, add the chocolate, and blend the mixture until the chocolate is ground fine. Add the egg yolks and the vanilla, blend the mixture until it is combined well (it will be very thick), and transfer it to a bowl. In another bowl with an electric mixture beat the egg whites with a pinch of salt until they hold soft peaks, beat in the granulated sugar gradually, and beat the meringue until it just holds stiff peaks. Whisk about one third of the meringue into the chocolate mixture to lighten it and fold in the remaining meringue gently but thoroughly. Pour the batter into the pan, smoothing the top, and bake the torte in the middle of the oven for 45 to 55 minutes, or until a tester comes out clean. Let the torte cool in the pan on a rack for 5 minutes, run a thin knife around the edge, and remove the side of the pan. Invert the torte onto the rack, discarding the wax paper, and let it cool.",
        "In a metal bowl set over barely simmering water combine the chocolate, the butter, the cream, and the corn syrup, stir the mixture until it is smooth, and let the glaze cool until it is just lukewarm.",
        "Set the torte on the rack over wax paper and pour the glaze over it, smoothing the glaze with a spatula and letting the excess drip down the side.",
        "In a bowl whisk together the confectioners' sugar and 1 teaspoon of the milk and add enough of the remaining milk, drop by drop, to form a thick icing.",
        "Transfer the icing to a small pastry bag fitted with a 1/8-inch plain tip and pipe it decoratively on the torte. Transfer the torte to a serving plate and let it stand for 2 hours, or until the glaze is set."
    ],
    "ingredients": [
        "1 cup (about 5 ounces) natural (with skins) whole almonds, toasted and cooled completely",
        "1/3 cup firmly packed light brown sugar",
        "1 tablespoon cinnamon",
        "3/4 teaspoon salt",
        "5 ounce fine-quality bittersweet chocolate (not unsweetened), chopped",
        "5 large eggs, separated",
        "1 teaspoon vanilla",
        "1/3 cup granulated sugar",
        "4 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "2 tablespoons unsalted butter",
        "2 tablespoons heavy cream",
        "1 tablespoon light corn syrup",
        "1/3 cup confectioners' sugar",
        "1 to 1 1/2 teaspoons milk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Bake",
        "Almond",
        "Cinnamon",
        "Gourmet"
    ],
    "title": "Mexican Chocolate Torte",
    "url": "http://www.epicurious.com/recipes/food/views/mexican-chocolate-torte-11559"
}
