{
    "directions": [
        "Preheat oven to 350°F. Line bottom of 8-inch square baking pan with parchment. Finely grind almonds, chocolate, orange peel and cinnamon in processor. In medium bowl of electric mixer, beat yolks and 3 tablespoons sugar until light yellow and slightly thickened, about 3 minutes. Mix in nut mixture (mixture will be very thick). Using clean dry bowl and beater, beat egg whites in large bowl until soft peaks form. Add remaining 3 tablespoons sugar and beat until stiff but not dry. Mix half of whites into chocolate mixture to lighten. Gently fold in remaining whites.",
        "Transfer batter to prepared pan. Bake until tester inserted into center comes out clean, about 35 minutes. Cool in pan on rack. Turn out cake and remove paper. (Can be prepared 1 day ahead. Wrap tightly; store at room temperature.)",
        "Melt chocolate in heavy small saucepan over low heat, stirring until smooth. Mix in half and half and 1/4 teaspoon cinnamon and stir until smooth. Cool. (Can be prepared 1 day ahead. Let stand at room temperature.)",
        "Whip cream and sugar until peaks form. Cut cake into squares and place on plates. Top each square with mound of whipped cream. Sprinkle with cinnamon and drizzle with chocolate sauce. Arrange orange slices in front of cake squares."
    ],
    "ingredients": [
        "1 2/3 cups sliced almonds, toasted (about 6 ounces)",
        "4 1/2 ounces semisweet chocolate, chopped",
        "2 1/2 teaspoons grated orange peel",
        "1 teaspoon ground cinnamon",
        "5 eggs, separated",
        "6 tablespoons sugar",
        "4 ounces semisweet chocolate, chopped",
        "1/2 cup half and half",
        "1/4 teaspoon ground cinnamon",
        "1/2 cup chilled whipping cream",
        "1 1/2 tablespoons sugar",
        "Ground cinnamon",
        "3 oranges, peel and white pith removed, sliced into rounds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Cinco de Mayo",
        "Orange",
        "Almond",
        "Spring",
        "Cinnamon"
    ],
    "title": "Mexican Chocolate and Almond Cake",
    "url": "http://www.epicurious.com/recipes/food/views/mexican-chocolate-and-almond-cake-1315"
}
