{
    "directions": [
        "Preheat a Breville pizza maker on the preheat setting for 30 minutes.",
        "Meanwhile, in a large nonstick fry pan over medium heat, warm 2 tsp. of the olive oil. Add the shallots and cook, stirring occasionally, until tender, 3 to 4 minutes. Add the spinach, season with salt and pepper and cook until the spinach is just wilted, 1 to 2 minutes. Transfer to a bowl and let cool.",
        "In a small bowl, combine 1 Tbs. of the olive oil and the garlic. In another bowl, toss the lemon slices with the remaining 1 tsp. olive oil.",
        "On a lightly floured surface, roll out half of the dough into a 10-inch (25-cm) round. Prick the dough all over with the tines of a fork. Transfer the dough to a floured pizza peel. Lightly brush the dough with half of the garlic oil. Top with half",
        "each",
        "of the spinach mixture, lemon slices, cheese and chili peppers.",
        "Transfer the pizza to the pizza maker. Bake on the classic setting according to the manufacturer’s instructions until the crust is crisp and the cheese is lightly browned, 10 to 11 minutes.",
        "Using the pizza peel, transfer the pizza to a cutting board. Preheat the pizza maker again, assemble the remaining pizza and bake. Cut the pizzas into slices and serve immediately. Makes two 10-inch (25-cm) pizzas.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "2 Tbs. olive oil",
        "2 shallots, thinly sliced",
        "4 cups (4 oz./125 g) packed baby spinach",
        "Kosher salt and freshly ground pepper, to taste",
        "1 small garlic clove, minced",
        "1 Meyer lemon, very thinly sliced",
        "1 batch Thin Crust Pizza Dough",
        "2/3 cup (3.5 oz./105 g) crumbled goat cheese",
        "Crumbled dried whole chili peppers as needed"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Meyer Lemon, Spinach and Goat Cheese Pizza",
    "url": "http://www.williams-sonoma.com/recipe/meyer-lemon-goat-cheese-pizza.html"
}
