{
    "directions": [
        "Preheat an oven to 350°F (180°C). Butter an 8-inch (20-cm) square baking pan.",
        "In a food processor, combine the flour, the 1/4 cup (1 oz./30 g) confectioners’ sugar and the salt and pulse a few times until blended. Add 6 Tbs. (3 oz./90 g) of the butter and pulse 6 to 8 times until the mixture forms large, coarse crumbs the size of small peas. Stir in the pine nuts.",
        "Press the crumb mixture into the bottom and 1 inch (2.5 cm) up the sides of the prepared pan. Bake until the crust is golden and the top feels firm when lightly touched, about 15 minutes. Reduce the oven temperature to 325°F (165°C).",
        "In the top of a double boiler, whisk together the whole eggs, egg yolks, lemon juice and granulated sugar until the sugar dissolves. Place over but not touching barely simmering water in the bottom pan and add the remaining 6 Tbs. (3 oz./90 g) butter. Using a large spoon, stir constantly until the butter melts and the mixture is thick enough to coat the back of the spoon and registers 160°F (71°C) on an instant-read thermometer, about 12 minutes. Remove from over the water and strain the lemon curd through a medium-mesh sieve placed over a bowl. Stir in the lemon zest. Let cool for 10 minutes.",
        "Pour the lemon curd over the baked crust. Bake until the center is set, 13 to 17 minutes. Transfer the pan to a wire rack and let cool for about 20 minutes, then cover and refrigerate until chilled, at least 3 hours or up to overnight. The filling will thicken as it cools.",
        "Just before serving, sift a thick layer of confectioners’ sugar over the top. Cut into squares and serve. Makes 9 to 12 squares.",
        "Adapted from Williams-Sonoma",
        "Dessert of the Day,",
        "by Kim Laidlaw (Weldon Owen, 2013)."
    ],
    "ingredients": [
        "3/4 cup (4 oz./125 g) all-purpose flour",
        "1/4 cup (1 oz./30 g) confectioners’ sugar, plus more for dusting",
        "1/8 tsp. kosher salt",
        "12 Tbs. (1 1/2 sticks) (6 oz./180 g) cold unsalted butter, cut into\n  pieces",
        "2 Tbs. pine nuts, lightly toasted",
        "3 whole eggs plus 3 egg yolks",
        "3/4 cup (6 fl. oz./180 ml) fresh Meyer lemon juice, strained\n  (about 5 lemons)",
        "1 cup (8 oz./250 g) granulated sugar",
        "1 tsp. grated Meyer lemon zest"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Meyer Lemon Squares",
    "url": "http://www.williams-sonoma.com/recipe/meyer-lemon-squares.html"
}
