{
    "directions": [
        "Position rack in top third of oven and preheat to 425°F. Line large baking sheet with parchment paper. Whisk self-rising flour and 1/2 cup sugar in large bowl. Using fingertips, rub in chilled butter until pieces are size of small peas. Add dried wild blueberries and toss to coat. Mix 1 cup buttermilk and finely grated lemon peel in glass measuring cup. Pour buttermilk mixture into dry ingredients and stir until dough begins to form (some of flour will not be incorporated). Transfer dough to lightly floured work surface and gather together. Knead dough briefly, about 5 turns. Divide dough in half. Form each dough half into ball and flatten into 1-inch-thick disk. Cut each disk into 6 wedges.",
        "Transfer scones to prepared baking sheet, spacing 1 inch apart. Brush tops with remaining 1 tablespoon buttermilk and sprinkle with remaining 1 1/2 tablespoons sugar. Bake until scones are golden brown on top and toothpick inserted into center comes out clean, about 25 minutes."
    ],
    "ingredients": [
        "3 cups self-rising flour",
        "1/2 cup plus 1 1/2 tablespoons sugar",
        "3/4 cup (11/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 1/2 cups dried wild blueberries (about 10 ounces)",
        "1 cup plus 1 tablespoon buttermilk",
        "1 1/2 tablespoons finely grated Meyer lemon peel or regular lemon peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Citrus",
        "Dairy",
        "Fruit",
        "Breakfast",
        "Brunch",
        "Bake",
        "Quick & Easy",
        "Blueberry",
        "Lemon",
        "Shower",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Meyer Lemon and Dried Blueberry Scones",
    "url": "http://www.epicurious.com/recipes/food/views/meyer-lemon-and-dried-blueberry-scones-236780"
}
