{
    "directions": [
        "Prepare the cake: Butter and flour a 10-cup fluted Bundt pan.",
        "Heat the cranberries in a pot heat the cranberries until they start to release their juices. Add 3/4 cup granulated sugar, and cook over medium heat until until juicy and the mixture reduces to 1 1/4 cups, about 15 minutes. Let cool completely.",
        "Position a rack in the middle of the oven and preheat to 350 degrees F.",
        "Whisk the milk, whole eggs and yolks, and vanilla in a medium bowl; set aside.",
        "Whisk the 3 cups flour, the remaining 1 3/4 cups sugar, the lemon zest, baking powder and salt in a large bowl. Add the 3 1/4 sticks butter and beat with a mixer on low speed until moistened. Add half of the milk mixture, increase the speed to medium and beat 1 minute. Add the remaining milk mixture in two batches, beating between each addition. Scrape down the sides of the bowl and beat again, about 30 seconds.",
        "Transfer 2/3 of the batter to the pan. Spoon the cranberry mixture in a ring around the middle of the batter (do not let it touch the pan). Top with the remaining batter and smooth evenly. Bake until a toothpick inserted into the center of the cake comes out clean, 55 to 60 minutes.",
        "Meanwhile, make the syrup: Dissolve the 1/4 cup granulated sugar in 1/2 cup lemon juice in a saucepan over low heat. Remove the cake from the oven, poke the surface all over with a skewer and pour the syrup on top. Let cool in the pan for 10 minutes. Carefully invert the cake onto a parchment-lined rack to cool completely. Wrap tightly in plastic wrap and let sit overnight.",
        "When ready to serve, whisk the confectioners' sugar and the remaining 2 tablespoons lemon juice until smooth. Spoon over the cake.",
        "Photograph by Steve Giralt"
    ],
    "ingredients": [
        "3 1/4 sticks unsalted butter, cubed and at room temperature, plus more for the pan",
        "3 cups cake flour, sifted, plus more for the pan",
        "1 12 ounce bag fresh or frozen cranberries, thawed if frozen",
        "2 1/2 cups granulated sugar",
        "6 tablespoons whole milk",
        "4 large eggs, plus 2 egg yolks",
        "2 teaspoons vanilla extract",
        "2 tablespoons finely grated Meyer lemon zest",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/4 cup granulated sugar",
        "1/2 cup plus 2 tablespoons Meyer lemon juice",
        "1 1/2 cups confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Cake",
        "Bundt Cake",
        "Fruit",
        "Lemon Recipes",
        "Cranberry",
        "Holiday"
    ],
    "title": "Meyer Lemon-Cranberry Bundt Cake",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/meyer-lemon-cranberry-bundt-cake-recipe"
}
