{
    "directions": [
        "Cut the stem end off each lemon. Keep the blossom end intact, as it contains pectin that will help thicken the jelly. Slice each lemon as thinly as possible, preferably on a mandoline. Place the slices in a large nonreactive saucepan and add 3 quarts water. Set over medium heat and bring to a boil. Cook, uncovered, stirring occasionally, for 30 minutes. Remove from the heat and let stand for about 30 minutes.",
        "Suspend a jelly bag over a deep nonreactive bowl and pour the lemon mixture into the bag. Let the bag stand overnight. Do not squeeze the bag or the jelly will be cloudy.",
        "Have ready 7 or 8 hot, sterilized half-pint jars and their lids. Place 2 or 3 small plates in the freezer.",
        "Measure the liquid; you should have about 5 cups. Pour the liquid into a nonreactive saucepan and add the lemon juice. Set over medium-high heat and bring to a boil, then add the sugar and boil rapidly, stirring frequently, until the jelly is thick enough to sheet off the back of a spoon, about 10 minutes. Remove from the heat. To test if the jelly is ready, put 1 tsp. of the jelly on a chilled plate and place in the freezer for 2 minutes. The jelly is ready if it wrinkles when nudged gently with a finger. If it doesn’t, continue to cook for 1 to 2 minutes more, remove from the heat and test again on a clean chilled plate.",
        "Ladle the hot jelly into the jars, leaving 1/4 inch of headspace. Remove any air bubbles and adjust the headspace, if necessary. Wipe the rims clean and seal tightly with the lids.",
        "Process the jars in a boiling-water bath for 10 minutes. The sealed jars can be stored in a cool, dark place for up to 1 year. If a seal has failed, store the jar in the refrigerator for up to 1 month. Makes 7 or 8 half-pint jars.",
        "Variation:",
        "To make Meyer Lemon Jelly with Lemon Verbena, add 20 fresh lemon verbena leaves (still attached to the stems) to the lemon mixture along with the sugar. Once the mixture has jelled, discard the lemon verbena.",
        "Adapted from",
        "The Art of Preserving,",
        "by Lisa Atwood, Rebecca Courchesne & Rick Field (Weldon Owen, 2010)."
    ],
    "ingredients": [
        "2 lb. Meyer lemons",
        "2 cups fresh Meyer lemon juice",
        "6 cups sugar"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Meyer Lemon Jelly",
    "url": "http://www.williams-sonoma.com/recipe/meyer-lemon-jelly.html"
}
