{
    "directions": [
        "Place 1 tablespoon garbanzo beans in small bowl and reserve for garnish. Combine remaining garbanzo beans, lemon juice, 2 tablespoons water, 2 tablespoons oil, garlic, cumin, and 1 teaspoon paprika in processor and blend until smooth. Transfer to small bowl. Season to taste with salt and pepper. Sprinkle reserved garbanzo beans over. DO AHEAD: Can be made 1 day ahead. Cover and chill. Let stand at room temperature 1 hour before using.",
        "Drizzle hummus lightly with oil and sprinkle lightly with paprika.",
        "Combine all ingredients in medium bowl and toss to blend. Season to taste with salt and pepper. DO AHEAD: Can be made 4 hours ahead. Cover and refrigerate.",
        "Arrange cucumber slices on plate; sprinkle with salt and pepper. Spoon yogurt over. Sprinkle with feta cheese and oregano. DO AHEAD: Can be made 1 hour ahead. Cover and refrigerate.",
        "Place marinated artichokes in small bowl. Arrange bowls of hummus, shrimp salad, and artichokes and plate with cucumber salad on large platter. Garnish with lemon wedges.",
        "Toast pita breads in toaster, then cut into wedges. Arrange pita wedges on platter with salads and serve.",
        "Greek-style yogurt is a thick yogurt; sold at some supermarkets and at specialty foods stores (such as Trader Joe's and Whole Foods markets) and Greek markets."
    ],
    "ingredients": [
        "1 15- to 16-ounce can garbanzo beans (chickpeas), drained",
        "2 tablespoons fresh lemon juice",
        "2 tablespoons water",
        "2 tablespoons extra-virgin olive oil plus additional for drizzling",
        "2 garlic cloves, peeled",
        "2 teaspoons ground cumin",
        "1 teaspoon paprika plus additional for sprinkling",
        "16 cooked peeled large shrimp with tails left intact",
        "16 unpitted Kalamata olives",
        "1 cup diced seeded tomatoes (about 3 medium)",
        "2 tablespoons chopped fresh Italian parsley",
        "2 tablespoons extra-virgin olive oil",
        "1 tablespoon (packed) finely grated lemon peel",
        "1 tablespoon fresh lemon juice",
        "1/2 unpeeled English hothouse cucumber, thinly sliced into rounds",
        "1/2 cup plain nonfat or low-fat yogurt (preferably Greek-style*), whisked to loosen",
        "3/4 cup crumbled feta cheese (about 3 ounces)",
        "1 teaspoon dried oregano or mint",
        "1 6-ounce jar marinated artichoke hearts, drained",
        "2 lemons, cut into wedges",
        "4 to 6 pita breads"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Salad",
        "Olive",
        "Vegetable",
        "Appetizer",
        "Low Fat",
        "Yogurt",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Feta",
        "Shrimp",
        "Cucumber",
        "Legume",
        "Chickpea",
        "Healthy",
        "Party",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Meze Platter with Hummus, Shrimp Salad, and Cucumber Salad",
    "url": "http://www.epicurious.com/recipes/food/views/meze-platter-with-hummus-shrimp-salad-and-cucumber-salad-354301"
}
