{
    "directions": [
        "Bring 5 quarts water to a boil in an 8-quart heavy pot. Boil beans, uncovered, 1 1/2 minutes, then turn off heat and let them soak 50 minutes.",
        "While beans soak, do all the really disgusting work with the meat. Put pork rind in a 3-quart saucepan three-fourths full of cold water and bring to a boil. Boil pork rind 1 minute. Drain and rinse under cold running water, then do it again. (Sometimes you know it's ready because it grows nipples.) After draining, cut the truly repulsive boiled pork rind into pieces that are big enough to identify (about 2 inches), so you can fish them out before serving.",
        "Scrape off and discard fat from confit duck legs and shred meat (the more it shreds the better). [Editors' note: Those who have no problem with identifiable meat in their food might want to keep the shredding to a minimum.]",
        "Put parsley stems, thyme, whole cloves, and 8 garlic cloves in cheesecloth and tie into a bundle to make a bouquet garni.",
        "First seasoning of beans: Add rind pieces, bacon halves, 1 cup onion, bouquet garni, and salt to beans. Simmer, covered, 1 1/4 hours, skimming regularly. Cool, uncovered.",
        "While beans simmer, brown mutton bones. Do this by heating goose fat in enameled cast-iron pot over moderate heat until it smokes, then cook mutton bones, stirring occasionally, until browned, about 5 minutes. Set them aside on a plate. Drop remaining 2 cups onion into pot and brown that, too. This can take as long as 15 minutes. Stir regularly.",
        "Peel seed, and chop tomatoes.",
        "Flavoring the meat: Add browned bones and shredded duck to onion. Add bay leaves, beef stock, tomatoes, remaining 4 garlic cloves, white wine, and pepper. Simmer, covered, 1 1/2 hours. Cool to room temperature,uncovered.",
        "Put pot with meat and pot with beans in refrigerator, covered, overnight.",
        "Poke holes in sausage with a fork and grill it slowly in a well-seasoned ridged grill pan over moderately low heat 20 minutes (to get the fat out). (Sausage should still be slightly undercooked on the inside when you're done.) Transfer to a cutting board and cool slightly. Slice into thin (1/4-inch) rounds.",
        "Remove and discard bones and bay leaves from meat pot. Remove duck with a slotted spoon and put on a plate. Reserve cooking liquid remaining in pot.",
        "Remove bacon from beans and cut into tiny, fat-free pieces. Put pieces on a plate and discard remaining bacon fat. Discard pork rind and bouquet garni from beans.",
        "Julia Child says: \"Now is the time to drain the beans and dump them into the ample, leftover meat cooking juices.\" In my experience, there is nothing left to drain. What you are looking at, when you stare into the bean pot, is a fairly solid wall of beans, with some gluey goop in between. So, pour reserved meat cooking juices into bean pot. Bring to a simmer over moderately high heat, stirring occasionally, and simmer 5 minutes, skimming any scum. Then turn off heat and let sit another 5 minutes.",
        "Preheat oven to 375°F.",
        "Spread a layer of beans on bottom of enameled cast-iron pot. Layer half of sausage and bacon on top, then another layer of beans, then half of duck (and any mutton), then another layer of beans, et cetera, ending with a layer of beans. Then add enough remaining liquid from bean pot until beans are submerged. Sprinkle with bread crumbs and parsley.",
        "Bring the whole thing to a simmer, uncovered, over moderately low heat. Then stick it in oven 20 minutes. Break through bread crumbs in several places with a spoon, allowing the liquid to mess up the look of the thing. Then reduce heat to 350°F and leave it in another 40 minutes. Serve very hot."
    ],
    "ingredients": [
        "2 1/2 pounds dried white beans such as Great Northern",
        "1/2 pound fresh pork rind",
        "2 1/2 pounds confit duck legs",
        "6 fresh parsley stems (without leaves)",
        "4 fresh thyme sprigs",
        "5 whole cloves",
        "12 garlic cloves",
        "1 (1-pound) piece smoked salted slab bacon, halved crosswise",
        "3 cups chopped onion (1 pound)",
        "1 teaspoon salt",
        "1 pound meaty mutton or lamb bones, cracked by butcher",
        "1 cup rendered goose fat",
        "6 large tomatoes (3 pounds)",
        "5 bay leaves (not California)",
        "1 quart beef stock (not canned broth)",
        "1 (750-ml) bottle dry white wine",
        "2 teaspoons black pepper",
        "2 1/2 pounds fresh garlic-pork sausage (not sweet or very spicy) such as saucisson à l'ail au vin rouge,saucisse de canard à l'armagnac, or a mixture of the two",
        "1 1/2 cups plain dry bread crumbs",
        "1 cup chopped fresh flat-leaf parsley",
        "Special equipment: a small square of cheesecloth and a wide 10-quart enameled cast-iron pot"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Duck",
        "Lamb",
        "Tomato",
        "Bake",
        "Dinner",
        "Casserole/Gratin",
        "Bacon",
        "Sausage",
        "Goose",
        "White Wine",
        "Spring",
        "Winter",
        "Simmer",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Michael Lewis's Cassoulet de Canard",
    "url": "http://www.epicurious.com/recipes/food/views/michael-lewiss-cassoulet-de-canard-104755"
}
