{
    "directions": [
        "In a small bowl, stir together the BBQ seasoning, smoked sea salt and granulated honey.",
        "Rub the short ribs all over with the oil and coat completely with about 6 Tbs. of the spice mixture; reserve the remaining mixture.",
        "Pour the beer into the base of a 10-quart stovetop pressure cooker and add the short ribs. Close and lock the lid and bring up to high pressure over high heat. Reduce the heat to medium-low and cook for 1 hour. Remove from the heat. To release the pressure, run cold water over the lid, then remove the lid. Transfer the ribs to a steel grill fry pan and reserve the cooking sauce.",
        "Prepare a grill for indirect grilling over medium-high heat. If using a gas grill, set a smoker box filled with hickory chips over direct heat.",
        "Set the fry pan on the grill over indirect heat. Cover the grill and cook for 10 minutes. Turn the ribs over, cover the grill and cook for 10 minutes more, adding additional hickory chips as needed.",
        "Transfer the ribs to a cutting board, cover loosely with aluminum foil and let rest for 10 minutes. Thinly slice the ribs and mop with some of the cooking sauce. Sprinkle with the remaining spice mixture, if desired. Serve immediately with white sandwich bread, cheddar cheese and extra sauce for dipping. Serves 4 to 6.",
        "Recipe by Chef Michael Voltaggio, inspired by Smitty’s Market, Lockhart, TX"
    ],
    "ingredients": [
        "1/4 cup BBQ seasoning",
        "1/4 cup hickory smoked sea salt",
        "2 Tbs. granulated honey",
        "2 lb. boneless short rib plate or 2 lb. individual boneless short ribs",
        "1/4 cup vegetable oil",
        "4 bottles (each 12 fl. oz.) Lone Star or other lager beer",
        "White sandwich bread for serving",
        "Cheddar cheese slices for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Michael Voltaggio’s Texas Short Ribs",
    "url": "http://www.williams-sonoma.com/recipe/michael-voltaggios-texas-short-ribs.html"
}
