{
    "directions": [
        "Spray the inside of a microwave-safe 2-quart 8-inch square baking dish with cooking spray.",
        "Whisk together the flour, 1/2 cup of the brown sugar, 1/4 cup of the cocoa powder, baking soda and 1/2 teaspoon salt in a large bowl. Break up some of the larger brown sugar clumps with your fingers. Make a well in the center, add the buttermilk and oil and stir until everything is just combined. Scrape the batter into the prepared baking dish with a rubber spatula. Smooth the top.",
        "Put 1 cup water in a microwave-safe 2-cup or larger measuring cup. Microwave on high (at 100 percent power) until steaming hot, 2 minutes in an 1,100-watt oven or 3 minutes in a 700-watt oven. Add the remaining 1/2 cup brown sugar and 1/4 cup cocoa powder, the vanilla and 1/4 teaspoon salt, and whisk to dissolve the sugar. Pour over the batter in the baking dish. Do not stir in.",
        "Microwave the cake on high (at 100 percent power) until the top is mostly set and dry to the touch, 8 minutes in an 1,100- or a 700-watt oven. (If the cake is slightly wet in the center, that's OK; it will continue cooking as it sits.) Let cool for at least 30 minutes.",
        "When you cut into the cake, you will notice a gooey chocolate pudding layer at the bottom; be sure to scoop some with each serving. Serve the cake warm or at room temperature with ice cream."
    ],
    "ingredients": [
        "Nonstick cooking spray",
        "3/4 cup all-purpose flour",
        "1 cup packed light brown sugar",
        "1/2 cup unsweetened cocoa powder (not Dutch process)",
        "1/2 teaspoon baking soda",
        "Kosher salt",
        "2/3 cup buttermilk",
        "1/4 cup vegetable oil",
        "1 teaspoon pure vanilla extract",
        "Vanilla ice cream, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cake",
        "Cake",
        "Chocolate",
        "Dessert"
    ],
    "title": "Microwave Chocolate Pudding Cake",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/microwave-chocolate-pudding-cake"
}
