{
    "directions": [
        "1. Cut a slice from broccoli raab base and taste to determine toughness. If fairly tender, trim only 1/2 inch or so from stalks; if tough, trim more. Wash vegetable in several changes of water, lifting out so debris settles. Without drying, spread in microwavable serving dish. Cover with plastic wrap and cook for 2 minutes. Toss, then continue cooking until not quite done, 1 to 2 minutes more. Pierce plastic and allow to cool.",
        "2. Peel carrots. Place in microwavable dish. Cover with plastic wrap. Cook just until carrots lose their raw crunch but are not cooked through — 1 1/2 to 2 minutes. Pierce plastic and cool slightly.",
        "3. In a small dish, mix sherry, vinegar, honey, salt and hot pepper to taste, stirring to blend. Add peanut and sesame oils.",
        "4. Line up broccoli raab stems on cutting board. Cut apart from tops (the florets and leaves). Squeeze tops dry, then blot with towel. Cut into very thin shreds; return to dish. Slice stems on a sharp angle to form long oblongs 1/8 inch thick; add to dish. Cut carrots the same way and add to dish. Toss with dressing. Season. Chill."
    ],
    "ingredients": [
        "1 hearty bunch broccoli raab (1 pound plus)",
        "About 1 pound fairly thin medium carrots (weighed without tops)",
        "1 tablespoon sweet sherry or sweet vermouth",
        "1 tablespoon cider vinegar or balsamic vinegar",
        "1 1/2 tablespoons honey",
        "1/2 teaspoon kosher salt",
        "1/8 to 1/4 teaspoon ground hot pepper",
        "2 tablespoons peanut or corn oil",
        "1 tablespoon Asian (dark) sesame oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Quick & Easy",
        "Broccoli",
        "Carrot",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Micro-Quick Hot-Sweet Salad of Broccoli Raab and Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/micro-quick-hot-sweet-salad-of-broccoli-raab-and-carrots-106236"
}
