{
    "directions": [
        "Preheat oven to 400°F. Divide bread between 2 large baking sheets. Bake until golden, stirring occasionally, about 25 minutes. Transfer to large bowl.",
        "Melt butter in heavy large skillet over high heat. Add onions and cook until golden brown, stirring occasionally, about 20 minutes. Reduce heat to medium. Add mushrooms; stir until mushrooms begin to soften and release juices, about 5 minutes. Add celery and stir 2 minutes. Mix contents of skillet into bread cubes. Mix in chestnuts, thyme, rosemary and nutmeg. Season to taste with salt and pepper. (Can be prepared one day ahead. Cover and refrigerate.)",
        "Mix 1/2 cup chicken broth into stuffing. Fill main turkey cavity with stuffing. Mix enough chicken broth into remaining stuffing to moisten (about 1/2 to 3/4 cup chicken broth, depending on amount of remaining stuffing). Spoon remaining stuffing into buttered baking dish. Cover stuffing with buttered aluminum foil. Bake stuffing in a dish alongside turkey until heated through, about 45 minutes.",
        "Preheat oven to 350°F. Butter 15x10x2-inch baking dish. Mix 1 1/2 cups broth into stuffing. Transfer to prepared dish. Cover with buttered foil. Bake until heated through, about 1 hour 15 minutes."
    ],
    "ingredients": [
        "1 1/2 1-pound loaves old-fashioned white bread, cut into 1/2-inch cubes (about 16 cups)",
        "1/2 cup (1 stick) butter",
        "3 large onions, chopped",
        "1 pound mushrooms, sliced",
        "5 celery stalks, chopped",
        "1 1/2 pounds fresh chestnuts, roasted, shelled, chopped (about 3 cups) or 3 cups steamed chestnuts in jar, very coarsely chopped (about 15 ounces)",
        "1/4 cup chopped fresh thyme or 2 teaspoons dried",
        "3 tablespoons chopped fresh rosemary or 2 teaspoons dried",
        "1/2 teaspoon ground nutmeg",
        "1 1/2 cups (about) canned low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Chestnut"
    ],
    "title": "Mid-Atlantic Mushroom and Chestnut Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/mid-atlantic-mushroom-and-chestnut-stuffing-810"
}
