{
    "directions": [
        "Toast all seeds in small skillet over medium heat until aromatic and slightly darker in color, stirring often, about 2 minutes. Cool. Finely grind seeds in spice mill or coffee grinder. Place cilantro and all remaining ingredients in blender. Add 1 teaspoon ground seeds and process until smooth sauce forms, scraping down sides frequently. Season to taste with salt and pepper. Cover sauce and chill. Reserve remaining ground seeds for meatballs. DO AHEAD: Can be made 1 day ahead. Keep refrigerated. Store remaining ground seeds in airtight container at room temperature.",
        "Heat 1 tablespoon oil in heavy small skillet over medium heat. Add onion and garlic and sauté until soft, stirring frequently, about 7 minutes (do not brown). Cool. Toss breadcrumbs with milk in small bowl to moisten. Place cooled onion mixture, breadcrumb mixture, reserved ground seeds from cilantro-yogurt sauce, jalapeño, and yogurt in processor. Using on/off turns, process until coarse puree forms. Transfer mixture to medium bowl. Add bison, egg, cilantro, sage, 1 teaspoon coarse salt, pepper, and allspice. Using hands or fork, mix until just blended. Using damp hands, form bison mixture into 1 1/4-inch balls. DO AHEAD: Can be made 6 hours ahead. Cover and chill.",
        "Preheat oven to 300°F. Heat remaining 2 tablespoons oil in heavy large nonstick skillet over medium heat. Working in 2 batches, cook meatballs until browned on all sides, about 8 minutes per batch. Transfer meatballs to rimmed baking sheet. Place in oven to keep warm up to 15 minutes.",
        "Serve meatballs with cilantro-yogurt sauce for dipping.",
        "*A thick yogurt; sold at some supermarkets, specialty foods stores (such as Trader Joe's and Whole Foods), and Greek markets. If unavailable, place plain whole-milk yogurt in cheesecloth-lined strainer set over large bowl. Cover and chill 4 hours to drain."
    ],
    "ingredients": [
        "1 teaspoon fennel seeds",
        "1 teaspoon cumin seeds",
        "1/2 teaspoon coriander seeds",
        "1 1/2 cups chopped fresh cilantro",
        "1/2 cup whole-milk Greek-style yogurt*",
        "3 green onions, chopped",
        "2 tablespoons chopped fresh mint",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon olive oil",
        "1 teaspoon chopped fresh sage",
        "1 teaspoon sugar",
        "3 tablespoons olive oil, divided",
        "1 cup finely chopped onion",
        "6 garlic cloves, minced",
        "1/2 cup fresh breadcrumbs made from crustless French bread",
        "1 tablespoon whole milk",
        "2 tablespoons minced seeded jalapeño chile (about 1 large)",
        "2 tablespoons whole-milk Greek-style yogurt",
        "1 1/4 pounds ground bison (often labeled buffalo)",
        "1 large egg, beaten to blend",
        "1/4 cup chopped fresh cilantro",
        "1 teaspoon chopped fresh sage",
        "1 teaspoon coarse kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/4 teaspoon ground allspice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Yogurt",
        "Low Cal",
        "Mint",
        "Buffalo",
        "Pan-Fry",
        "Healthy",
        "Jalapeño",
        "Cilantro"
    ],
    "title": "Middle Eastern Bison Meatballs with Cilantro-Yogurt Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/middle-eastern-bison-meatballs-with-cilantro-yogurt-sauce-241339"
}
