{
    "directions": [
        "Bring water, sugar, and lemon juice to a simmer in a 2- to 2 1/2-quart saucepan, stirring until sugar is dissolved, then add quince. Cut out a round of parchment or wax paper to fit just inside saucepan and cover quince directly with parchment or wax paper. Simmer, gently stirring once or twice, until quince is tender, about 35 minutes. Drain quince in a sieve set over a bowl and reserve 1/2 cup syrup for sauce.",
        "Pat lamb dry. Stir together salt, pepper, cumin, coriander, and cinnamon in a small bowl, then sprinkle spice mixture all over lamb. Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking. Cook lamb 4 minutes, then turn over and cook 3 minutes more for medium-rare. Transfer lamb to a cutting board and let stand 5 minutes.",
        "Reduce heat to moderate and add reserved quince syrup to skillet, then boil, scraping up any brown bits, until liquid is reduced by almost half, about 2 minutes. Transfer sauce to a gravy boat or small bowl and stir in lemon juice and salt to taste.",
        "Thinly slice lamb and serve with quince and sauce."
    ],
    "ingredients": [
        "2 1/2 cups water",
        "3/4 cup sugar",
        "1 teaspoon fresh lemon juice",
        "1 quince (about 10 oz), peeled, quartered, cored, and cut into 1/2-inch pieces",
        "2 (3/4-inch-thick) bone-in lamb steaks from leg (1 1/2 lb total), trimmed of excess fat",
        "3/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon ground coriander",
        "1/8 teaspoon ground cinnamon",
        "1 tablespoon olive oil",
        "1 teaspoon fresh lemon juice, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Lamb",
        "Quick & Easy",
        "Quince",
        "Fall",
        "Winter",
        "Simmer",
        "Gourmet"
    ],
    "title": "Middle Eastern Spiced Lamb Steaks with Poached Quince",
    "url": "http://www.epicurious.com/recipes/food/views/middle-eastern-spiced-lamb-steaks-with-poached-quince-231185"
}
