{
    "directions": [
        "In a bowl whisk together the yogurt, the lemon juice, the garlic paste, the thyme, and pepper to taste.",
        "Arrange the chicken, pricked in several places with a fork, in one layer in a large shallow dish, pour the marinade over it, and let the chicken marinate, covered and chilled, turning it once, for at least 3 hours or, preferably overnight",
        "In a bowl whisk together the yogurt, the garlic paste, the lemon juice, the parsley, the mint, and salt and pepper to taste.",
        "On an oiled grill set about 6 inches over glowing coals or in an oiled ridged grill pan set over moderately high eat grill the chicken (discard the marinade) turning it, for 12 to 15 minutes on each side, or until it is cooked through. While the chicken is cooking, in a skillet cook the onion in the oil over moderate heat, stirring, until it is softened and lightly golden. Remove the skillet from the heat, add the tomato and the sesame seeds, and season the mixture with salt and pepper. Transfer the chicken to a cutting board and cut it diagonally into thin slices. Cut off a small piece of each pita loaf to form an opening and heat the pita loaves on the grill, turning them once, for several seconds, or until they are just softened. Divide the chicken, the onion mixture, and the sauce among the pita loaves."
    ],
    "ingredients": [
        "1 cup plain yogurt",
        "1/2 cup fresh lemon juice",
        "1 garlic clove, minced and mashed to a paste with a pinch of salt",
        "1/2 teaspoon dried thyme, crumbled",
        "8 skinless boneless chicken thighs (about 1 1/2 pounds)",
        "1/3 cup plain yogurt",
        "1 garlic clove, minced and mashed to a paste with 1/4 teaspoon salt",
        "2 teaspoons fresh lemon juice, or to taste",
        "1 tablespoon finely chopped fresh parsley leaves",
        "2 teaspoons finely chopped fresh mint leaves, or to taste",
        "1 small red onion, sliced thin",
        "1 1/2 tablespoons olive oil",
        "1 tomato, minced",
        "1 tablespoon sesame seeds, toasted lightly",
        "6 whole-wheat pita loaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Chicken",
        "Dairy",
        "Herb",
        "Poultry",
        "Marinate",
        "Yogurt",
        "Summer",
        "Gourmet"
    ],
    "title": "Middle Eastern Grilled Chicken Pita Sandwiches with Yogurt Mint Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/middle-eastern-grilled-chicken-pita-sandwiches-with-yogurt-mint-sauce-12158"
}
