{
    "directions": [
        "Cut off and reserve the stem ends of the zucchini and with a zucchini corer hollow out the zucchini, being careful not to pierce the skins and leaving 1/4-inch-thick shells. Chop the zucchini flesh and reserve it.",
        "In a heavy skillet heat the oil over moderately high heat until it is hot but not smoking and in it sauté the lamb with the allspice, the mint, salt and pepper to taste, stirring, until it is no longer pink. Transfer the lamb with a slotted spoon to a sieve to drain, pour off all but 1 tablespoon of the fat from the skillet, and in the skillet sauté the onion, stirring, until it is softened. Stir in the garlic, the reserved zucchini flesh, and salt and pepper to taste and sauté the mixture until it is golden. Remove the skillet from the heat, stir in the lamb mixture, the pine nuts, and 2 tablespoons of the yogurt, and let the filling cool. Stuff the zucchini with the filling and put the reserved stem ends back in place over the cut ends, securing them with wooden picks. Arrange the zucchini on a steamer rack set over simmering water, steam them, covered, for 20 to 25 minutes, or until they are tender, and let them cool slightly.",
        "In the top of a double-boiler set over simmering water whisk together the remaining yogurt and the cornstarch mixture, stirred, cook the sauce, stirring, for 5 minutes, or until it is thickened, and let it cool slightly.",
        "Cut the zucchini crosswise into 1-inch rounds, arrange the rounds on a platter, and spoon a dollop of the sauce onto each round. Sprinkle the zucchini rounds with the sesame seeds and serve them at room temperature."
    ],
    "ingredients": [
        "four 6-ounce straight zucchini, scrubbed",
        "1 tablespoon olive oil",
        "1/2 pound ground lamb",
        "1 teaspoon allspice",
        "1 teaspoon crumbled dried mint",
        "1 cup chopped onion",
        "1 garlic clove, minced",
        "2 tablespoons pine nuts, toasted lightly",
        "1 cup plain yogurt",
        "2 tablespoons cornstarch, dissolved in 2 tablespoons cold water",
        "1 tablespoon sesame seeds, toasted lightly"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Steam",
        "Cocktail Party",
        "Yogurt",
        "Zucchini",
        "Summer",
        "Party",
        "Gourmet"
    ],
    "title": "Middle Eastern Lamb-Stuffed Zucchini with Yogurt Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/middle-eastern-lamb-stuffed-zucchini-with-yogurt-sauce-12758"
}
