{
    "directions": [
        "In a small non-stick skillet cook onion and garlic in oil over moderately low heat, stirring, until softened. Transfer mixture to a bowl and stir in mint, salt, allspice, and cinnamon. Add lamb, bread crumbs, egg, and currants and combine well. Form level tablespoons of lamb mixture into 1 1/4-inch meatballs, arranging on a tray as formed.",
        "In a small bowl roll half of meatballs, 1 at a time, in black sesame seeds until coated, transferring to a rack set in a shallow baking pan. Coat remaining meatballs with white sesame seeds in same manner, transferring to rack. Meatballs may be prepared up to this point 1 day ahead and chilled, covered loosely.",
        "Preheat oven to 450°F.",
        "Bake meatballs in upper third of oven 8 to 10 minutes, or until golden and just cooked through.",
        "In a fine sieve set over a bowl drain yogurt, covered and chilled, 3 hours. Discard whey in bowl and transfer yogurt cheese to bowl. Yogurt cheese may be made 2 days ahead and chilled, covered.",
        "Into yogurt cheese stir mint and salt. Makes about 1 1/2 cups."
    ],
    "ingredients": [
        "1/3 cup minced onion",
        "1 large garlic clove, minced",
        "1 1/2 teaspoons olive oil",
        "1/2 teaspoon dried mint, crumbled",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground allspice",
        "a pinch cinnamon",
        "1 pound ground lamb (10% fat)",
        "1 cup fine fresh bread crumbs",
        "1 large egg, beaten lightly",
        "2 tablespoons dried currants",
        "1/4 cup black sesame seeds*",
        "1/4 cup white sesame seeds, toasted lightly",
        "Accompaniment:",
        "2 cups plain yogurt",
        "1/4 cup packed fresh mint leaves, chopped",
        "1/2 teaspoon salt, or to taste",
        "*available at Asian markets and some specialty foods shops and supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Lamb",
        "Side",
        "Super Bowl",
        "Yogurt",
        "Dinner",
        "Fall",
        "Gourmet"
    ],
    "title": "Middle Eastern Sesame Lamb Meatballs with Minted Yogurt Dip",
    "url": "http://www.epicurious.com/recipes/food/views/middle-eastern-sesame-lamb-meatballs-with-minted-yogurt-dip-13076"
}
