{
    "directions": [
        "1. To make the syrup: Stir the sugar, water, lemon juice, and if using, the corn syrup, cinnamon sticks, and/or cloves over low heat until the sugar dissolves, about 5 minutes. Stop stirring, increase the heat to medium, and cook until the mixture is slightly syrupy, about 5 minutes (it will register 225 degrees on a candy thermometer). Discard the cinnamon sticks and whole cloves. Let cool.",
        "2. To make the filling: Combine all the filling ingredients.",
        "3. Preheat the oven to 350 degrees. Grease a 12-by-9-inch or 13-by-9-inch baking pan or 15-by-10-inch jelly roll pan.",
        "4. Place a sheet of phyllo in the prepared pan and lightly brush with butter. Repeat with 7 more sheets. Spread with half of the filling. Top with 8 more sheets, brushing each with butter. Use any torn sheets in the middle layer. Spread with the remaining nut mixture and end with a top layer of 8 sheets, continuing to brush each with butter. Trim any overhanging edges.",
        "5. Using a sharp knife, cut 6 equal lengthwise strips (about 1 3/4 inches wide) through the top layer of pastry. Make 1 1/2-inch-wide diagonal cuts across the strips to form diamond shapes.",
        "6. Just before baking, lightly sprinkle the top of the pastry with cold water. This inhibits the pastry from curling. Bake for 20 minutes. Reduce the heat to 300 degrees and bake until golden brown, about 15 additional minutes.",
        "7. Cut through the scored lines. Drizzle the cooled syrup slowly over the hot baklava and let cool for at least 4 hours. Cover and store at room temperature for up to 1 week. If the baklava dries out while being stored, drizzle with a little additional hot syrup.",
        "Instead of brushing each layer of phyllo with butter, cut the unbaked baklava into diamonds all the way through, drizzle with 1 cup vegetable oil, and let stand for 10 minutes before baking.",
        "Using the almonds and cardamom in the filling: Omit the lemon juice and cinnamon from the syrup and add 1/4 cup rose water or 1 tablespoon orange blossom water after it has cooled.",
        "For the filling, use 2 cups blanched almonds, 2 cups unsalted pistachios, 1/4 cup sugar, 1 teaspoon ground cardamom, and 1 teaspoon ground cinnamon. Crush 1/4 teaspoon saffron threads and let steep in 3 tablespoons of the melted butter for 15 minutes and use to brush the top sheet of phyllo."
    ],
    "ingredients": [
        "3 cups sugar, or 2 cups sugar and 1 cup honey",
        "1 1/2 cups water",
        "2 tablespoons lemon juice",
        "2 tablespoons light corn syrup (optional)",
        "2 (3-inch) sticks cinnamon (optional)",
        "4 to 6 whole cloves, or 1/2 teaspoon ground cardamom (optional)",
        "1 pound blanched almonds, pistachios, walnuts, or any combination, finely chopped or coarsely ground (about 4 cups)",
        "1/4 cup sugar",
        "1 to 2 teaspoons ground cinnamon",
        "1/4 teaspoon ground cloves or cardamom (optional)",
        "1 pound (about 24 sheets) phyllo dough",
        "About 1 cup (2 sticks) melted butter or vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Nut",
        "Dessert",
        "Bake",
        "Rosh Hashanah/Yom Kippur",
        "Almond",
        "Spice",
        "Fall",
        "Kosher",
        "Party",
        "Phyllo/Puff Pastry Dough",
        "Pastry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Middle Eastern Nut-Filled Multilayered Pastry (Baklava)",
    "url": "http://www.epicurious.com/recipes/food/views/middle-eastern-nut-filled-multilayered-pastry-baklava-103991"
}
