{
    "directions": [
        "Preheat oven to 250°F. Arrange bread slices on oven rack and bake until very dry but not brown, about 30 minutes. Transfer bread to very large bowl.",
        "Coarsely crumble bread. Mix in cherries, raisins, currants and prunes. Melt butter in heavy large skillet over medium-low heat. Add onions and sauté until golden and tender, about 15 minutes. Add to stuffing. Mix in thyme. Season with salt and pepper. (Can be made 1 day ahead. Cover and chill.) Mix in eggs.",
        "Mix 3/4 cup broth into stuffing. Fill main turkey cavity with stuffing. Mix enough broth into remaining stuffing to moisten (about 3/4 to 1 cup broth, depending on amount of remaining stuffing). Spoon remaining stuffing into buttered baking dish. Cover with buttered foil. Bake stuffing in dish alongside turkey until heated through, about 30 minutes. Uncover and bake until top is crisp, about 15 minutes.",
        "Preheat oven to 350°F.Butter 13 x 9 x 2-inch baking dish. Mix 2 3/4 cups broth into stuffing. Transfer to prepared dish. Cover with buttered foil and bake until heated through, about 45 minutes. Uncover and bake until top is crisp, about 15 minutes."
    ],
    "ingredients": [
        "1 24-ounce loaf day-old sliced whole wheat bread, ends discarded",
        "1 cup dried tart cherries",
        "1 cup golden raisins",
        "1/2 cup dried currants",
        "1/2 cup coarsely chopped pitted prunes",
        "3 tablespoons butter",
        "2 medium onions, chopped",
        "1 1/2 tablespoons chopped fresh thyme or 1/1/2 teaspoons dried",
        "2 eggs, beaten to blend",
        "2 3/4 cups (about) canned low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "High Fiber",
        "Stuffing/Dressing",
        "Currant",
        "Raisin",
        "Cherry",
        "Thyme"
    ],
    "title": "Midwestern Whole Wheat Dried Fruit Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/midwestern-whole-wheat-dried-fruit-stuffing-814"
}
