{
    "directions": [
        "Trim fat from beef chuck roast and place the fat into a large saucepan with vegetable oil over medium heat. Cook, stirring occasionally, until the fat chunks are lightly browned, about 15 minutes. Add beef bones to the fat. Pour in enough water to cover the bones and stir in vinegar. Bring liquid to a boil and reduce heat to low; simmer until stock has reduced to about 1 1/2 cups of liquid, about 2 hours.",
        "Preheat an outdoor grill for medium-high heat and lightly oil the grate.",
        "Cut beef chuck roast into 3/4-inch thick slices and cook on the preheated grill until browned, 3 minutes on 1 side and 2 minutes on the other side; cut beef slices into 1/2-inch cubes.",
        "Cook and stir bacon in a large skillet over medium-high heat until evenly browned, about 10 minutes; drain on paper towels.",
        "Transfer beef cubes into a large soup pot over medium heat. Add bacon, diced tomatoes, black beans, kidney beans, cannellini beans, onions, garlic, tomato paste, green bell pepper, red bell pepper, jalapeno peppers, serrano peppers, chili powder, smoked paprika, cumin, chocolate, anchovy paste, and bay leaf.",
        "Strain broth from beef bones; discard bones. Skim excess fat from the broth and pour broth over the chili ingredients. Use a large spoon to make a well 2 inches deep in the meat, broth, and vegetables, and pour stout beer into the hole; bring to a simmer.",
        "Place cover on soup pot and cook until beef is tender and flavors have blended, about 3 hours.",
        "For a thicker chili, dip about 3 tablespoons of liquid from the pot and whisk with cornstarch in a bowl; stir cornstarch mixture into chili and simmer until thickened, about 5 minutes."
    ],
    "ingredients": [
        "2 pounds beef chuck roast",
        "1 tablespoon vegetable oil",
        "1 pound beef soup bones",
        "6 cups water, or as needed to cover",
        "1 teaspoon vinegar",
        "6 slices bacon, minced",
        "3 (28 ounce) cans diced tomatoes, drained",
        "3 (15 ounce) cans black beans, rinsed and drained",
        "3 (15 ounce) cans kidney beans, rinsed and drained",
        "3 (15 ounce) cans cannellini beans, drained and rinsed",
        "4 yellow onions, diced",
        "1 whole head garlic, minced",
        "1 (6 ounce) can tomato paste",
        "1 green bell pepper, diced",
        "1 red bell pepper, diced",
        "2 jalapeno peppers, seeded and chopped",
        "2 serrano peppers, seeded and chopped - or more to taste",
        "1/2 cup chili powder, or more to taste",
        "2 tablespoons smoked paprika",
        "2 tablespoons ground cumin",
        "2 1/2 (1 ounce) squares dark unsweetened chocolate",
        "1/4 (2 ounce) package anchovy paste",
        "1 bay leaf",
        "2 (12 fluid ounce) cans or bottles stout beer, or more to taste",
        "1 tablespoon cornstarch (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mike's 3-Bean Chili",
    "url": "http://allrecipes.com/recipe/229954/mikes-3-bean-chili/"
}
