{
    "directions": [
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 5 minutes. Drain, rinse, and set aside.",
        "Whisk together the hoisin sauce, sherry, tangerine zest, and ground ginger in a small bowl.",
        "Heat 2 teaspoons vegetable oil in a large wok or skillet over high heat.  Add one half of the beef slices to the pan; cook, stirring constantly, until the meat is nicely browned, 2 to 3 minutes.  Remove meat to a platter with a slotted spoon.  Repeat with the remaining beef.",
        "Heat the remaining 2 teaspoons of oil in the pan.  Stir in the butternut squash, mushrooms, and onion.  Cook, stirring constantly, until vegetables are crisp-tender and slightly brown on the edges, 5 to 7 minutes.  Add the cabbage, and cook and stir until slightly wilted, about 2 additional minutes.",
        "Reduce the heat to medium.  Stir the cooked beef, tangerine sections, and hoisin mixture into the vegetables.  Cook until heated through, 2 to 3 minutes. Serve over Chinese noodles."
    ],
    "ingredients": [
        "1 (8 ounce) package dry Chinese noodles",
        "1/4 cup hoisin sauce",
        "1/4 cup dry sherry",
        "1 teaspoon tangerine zest",
        "1/4 teaspoon ground ginger",
        "4 teaspoons vegetable oil",
        "1 pound flank beef steak, cut diagonally into 2 inch strips",
        "2 teaspoons vegetable oil",
        "1/2 small butternut squash - peeled, seeded, and thinly sliced",
        "1 cup sliced fresh mushrooms",
        "1 large red onion, cut into 2 inch strips",
        "3 cups cabbage, thinly sliced",
        "1 tangerine, sectioned and seeded"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mild Thai Beef with a Tangerine Sauce",
    "url": "http://allrecipes.com/recipe/188545/mild-thai-beef-with-a-tangerine-sauce/"
}
