{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C). Position an oven rack in the lower part of the oven and place a baking stone on it.",
        "Place the apples into a large mixing bowl, and toss with the lemon juice.",
        "Stir the potato starch, 3/4 cup sugar, cinnamon, and nutmeg together in a bowl.",
        "Roll out half of the pie crust pastry on a lightly floured surface and fit it into a 10 inch pie plate. Pile half the apples into the crust, and dot with half the butter pieces. Sprinkle half of the potato starch-cinnamon sugar mixture over the apples. Pile the remaining apples into the pie plate. Sprinkle with the remaining butter pieces and sugar mixture. Roll out the remaining pie crust pastry, and place carefully over the apples. Pinch and crimp the edges to seal the crusts. Use a fork to poke holes in the top crust in a few places. Brush the top crust with milk, and sprinkle with 1 tablespoon sugar.",
        "Place the pie in the preheated oven on the baking stone. Immediately lower the heat to 350 degrees F (175 degrees C). Bake until the crust is golden brown, about 60 minutes. Check half way through the baking time, and cover the edges with aluminum foil for the last 30 minutes if necessary to prevent over-browning. Cool 3 hours on a wire rack before serving."
    ],
    "ingredients": [
        "8 large Golden Delicious apples - peeled, cored and cut into 1/8 inch slices",
        "1 tablespoon fresh lemon juice",
        "3 tablespoons potato starch",
        "3/4 cup white sugar",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon freshly grated nutmeg",
        "1/4 cup cold unsalted butter, cut into 1/4-inch pieces",
        "1 recipe pastry for a 10-inch double crust pie",
        "2 teaspoons milk",
        "1 tablespoon white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mile-High Apple Pie",
    "url": "http://allrecipes.com/recipe/152214/mile-high-apple-pie/"
}
