{
    "directions": [
        "Heat 1 teaspoon olive oil in a large saucepan over medium heat; cook and stir 1/4 cup onion and 2 garlic cloves in the hot oil until onion is slightly transparent, about 5 minutes. Increase heat to medium-high; add beef broth, tomato sauce, oregano, basil, sugar, parsley, thyme, savory, red pepper flakes, and marjoram. Simmer mixture, stirring occasionally, until flavors have blended, 15 to 20 minutes.",
        "Heat 1 teaspoon olive oil in a large saucepan over medium-high heat; cook and stir 1/4 cup onion and 1 garlic clove in the hot oil until onion is tender and slightly transparent, about 5 minutes. Cook and stir ground beef into onion mixture until browned and crumbly, 10 to 15 minutes. Drain excess grease.",
        "Stir ground beef mixture and green bell pepper into tomato sauce mixture; simmer for 15 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Pour meat sauce, water, mostaccioli, and shredded mozzarella cheese into a 3-quart glass baking dish; stir well. Cover dish with aluminum foil.",
        "Bake in the preheated oven for 20 minutes. Remove aluminum foil and lay mozzarella cheese slices over mostaccioli mixture. Bake until cheese is melted and bubbling, about 10 minutes."
    ],
    "ingredients": [
        "2 teaspoons olive oil, divided",
        "1/2 cup finely chopped onion, divided",
        "3 cloves garlic, minced, divided",
        "2 cups beef broth",
        "2 (15 ounce) cans tomato sauce",
        "1 tablespoon dried oregano",
        "1 tablespoon dried basil",
        "2 teaspoons white sugar",
        "1 1/2 teaspoons dried parsley",
        "1/2 teaspoon thyme",
        "1/2 teaspoon dried savory",
        "1/2 teaspoon red pepper flakes",
        "1/4 teaspoon ground marjoram",
        "1 pound ground beef",
        "1/2 cup diced green bell pepper",
        "2 cups water",
        "1 (16 ounce) package mostaccioli pasta",
        "1 cup shredded mozzarella cheese",
        "1 (8 ounce) package fresh mozzarella cheese, sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Miles of Mozzarella Baked Mostaccioli",
    "url": "http://allrecipes.com/recipe/233311/miles-of-mozzarella-baked-mostaccioli/"
}
