{
    "directions": [
        "Preheat oven to 400°F.",
        "Pat halibut dry and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper. In large, heavy skillet over moderately high heat, heat vegetable oil until hot but not smoking. Add fish, skin side up, milk, cream, and wine. Bring to light simmer, cover, and place in oven until just cooked through, 7 to 10 minutes. Remove halibut from liquid, cover, and keep warm. Reserve poaching liquid.",
        "While halibut is in the oven, cook asparagus in 8-quart pot boiling salted water until tender, about 3 minutes. Using slotted spoon or tongs, remove asparagus from water and transfer to large bowl. Drizzle with 2 tablespoons olive oil, sprinkle with 3/4 teaspoon salt and 1/2 teaspoon pepper, and toss gently to coat. Cover and keep warm.",
        "In heavy 10-inch skillet, heat remaining 2 teaspoons olive oil until hot but not smoking. Add morels and sauté 5 to 6 minutes. Remove from heat and add sherry vinegar and thyme, stirring to scrape up any morels that might stick to bottom of skillet. Sprinkle with remaining 1/4 teaspoon salt and remaining 1/8 tablespoon pepper.",
        "Place poaching liquid over high heat and simmer until reduced by half. Remove from heat and stir in butter.",
        "Divide asparagus between 8 plates. Peel skin off halibut and place 1 filet on top of asparagus on each plate. Divide morels among plates. Spoon sauce over fish and serve immediately."
    ],
    "ingredients": [
        "8 (4 ounce) halibut filets with skin",
        "1 1/2 teaspoons sea salt",
        "3/4 teaspoon plus scant 1/8 teaspoon freshly ground black pepper",
        "2 teaspoons vegetable oil",
        "1/2 cup whole milk",
        "1/2 cup heavy cream",
        "4 tablespoons (1/4 cup) white wine, preferably white Burgundy",
        "24 thick asparagus spears, peeled and trimmed",
        "2 tablespoons plus 2 teaspoons extra-virgin olive oil",
        "4 ounces fresh morels,* trimmed, washed well, patted dry, and halved or quartered if large",
        "1/4 cup sherry vinegar",
        "2 tablespoons fresh thyme leaves, chopped",
        "2 tablespoons unsalted butter",
        "*If fresh morels are unavailable, fresh chanterelles make a good substitute. Alternatively use 1 1/2 ounces dried morels. Soak in 1 cup warm water until softened, about 20 minutes. Lift from soaking liquid, then rinse well and pat dry."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fish",
        "Herb",
        "Mushroom",
        "Vegetable",
        "Poach",
        "Sauté",
        "Spring",
        "Summer"
    ],
    "title": "Milk-Poached Alaskan Halibut with Asparagus and Morel Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/milk-poached-alaskan-halibut-with-asparagus-and-morel-mushrooms-238384"
}
