{
    "directions": [
        "Preheat oven to 350°F. Whisk first 4 ingredients in medium bowl. Using electric mixer, beat powdered sugar, dark brown sugar, and butter in large bowl to blend.",
        "Add peanut butter; beat until creamy. Gradually beat in vegetable oil and vanilla extract, then egg. Add dry ingredients; mix just until blended. Stir in milk chocolate chips.",
        "Drop cookie dough by level tablespoonfuls onto ungreased baking sheets, spacing about 1 1/2 inches apart. Bake cookies until puffed and golden brown, about 12 minutes. Cool slightly, then transfer cookies to rack to cool completely.",
        "Place chocolate, peanut butter, powdered sugar, and kosher salt in medium bowl. Bring whipping cream to boil in heavy small saucepan. Pour hot cream over chocolate mixture; stir until mixture is melted and smooth. Chill until filling is thick and spreadable, about 1 hour.",
        "Spread about 1 rounded teaspoonful chocolate-peanut butter filling on flat side of 1 cookie. Top with second cookie, forming sandwich. Repeat with remaining filling and cookies. (Cookie sandwiches can be made 1 day ahead. Store in airtight container at room temperature.)"
    ],
    "ingredients": [
        "1 3/4 cups all purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon coarse kosher salt",
        "1/2 cup plus 1/3 cup powdered sugar",
        "1/2 cup plus 1 tablespoon (packed) dark brown sugar",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "1/2 cup creamy peanut butter",
        "1/2 cup vegetable oil",
        "1 1/2 teaspoons vanilla extract",
        "1 large egg",
        "1 1/3 cups (about 8 ounces) milk chocolate chips",
        "3 ounces high-quality milk chocolate (such as Lindt or Perugina), chopped",
        "1/4 cup creamy peanut butter",
        "2 tablespoons powdered sugar",
        "1/4 teaspoon coarse kosher salt",
        "6 tablespoons whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Kid-Friendly",
        "Peanut",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Milk Chocolate-Peanut Butter Sandwich Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/milk-chocolate-peanut-butter-sandwich-cookies-233945"
}
