{
    "directions": [
        "Whisk cornstarch and 1 cup milk in a medium bowl; set slurry aside.",
        "Heat cream, honey, sugar, salt, and remaining 2 cups milk in a medium saucepan over medium, whisking occasionally, until mixture just begins to boil, 8–10 minutes. Whisking constantly, gradually add reserved slurry and cook, still whisking, until pudding thickens and comes to a boil, about 1 minute. Scrape into a large bowl and cover with plastic wrap, pressing directly against surface. Chill until cold, at least 4 hours.",
        "Pudding can be made 2 days ahead. Keep chilled.",
        "Bring sugar, corn syrup, and 1/4 cup water to a boil in a medium saucepan over medium-high heat, stirring to dissolve sugar. Cook, swirling pan occasionally (do not stir), until caramel turns golden amber. Remove from heat, add cinnamon stick, and stir in 1/4 cup water (be careful as caramel will bubble vigorously); stir to combine and loosen. Stir in rose water, then gently toss figs in caramel. Remove cinnamon stick.",
        "Whisk chilled pudding until smooth and creamy. Divide among bowls; serve topped with warm caramel and figs."
    ],
    "ingredients": [
        "1/3 cup cornstarch",
        "3 cups whole milk, divided",
        "1 cup heavy cream",
        "3 tablespoons honey",
        "3 tablespoons sugar",
        "Pinch of kosher salt",
        "1 cup sugar",
        "2 tablespoons light corn syrup",
        "1 3\" cinnamon stick",
        "1/2 teaspoon rose water",
        "8 fresh black figs, quartered"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Kid-Friendly",
        "Fig",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Milk Pudding with Rose Water Caramel and Figs",
    "url": "http://www.epicurious.com/recipes/food/views/milk-pudding-with-rose-water-caramel-and-figs-56390105"
}
