{
    "directions": [
        "Butter eight 3/4-cup soufflé dishes; sprinkle with sugar, tilting cups to coat completely and tapping out any excess. Arrange prepared soufflé dishes on large baking sheet.",
        "Combine chocolate and cream in large metal bowl. Set bowl over saucepan of barely simmering water and stir until chocolate is melted and mixture is smooth. Remove bowl from over water. Stir egg yolks and salt into chocolate mixture. Using electric mixer, beat egg whites in another large bowl until soft peaks form. Gradually add 2 tablespoons sugar, beating until semi-firm peaks form. Using rubber spatula, fold 1/4 of beaten egg whites into chocolate mixture to lighten. Fold remaining egg whites into chocolate mixture in 2 additions. Divide chocolate mixture among prepared soufflé dishes, filling dishes completely. DO AHEAD: Can be made 2 days ahead. Refrigerate uncovered until cold, then cover and keep chilled.",
        "Using electric mixer, beat egg white in medium bowl until soft peaks form. Gradually add honey, beating until soft peaks form, about 3 minutes.",
        "Combine cream and amaretto in another medium bowl and beat until thick and soft peaks form. Fold whipped cream mixture and almonds into meringue. DO AHEAD: Can be made 2 hours ahead. Cover and chill.",
        "Position rack in center of oven and preheat to 400°F. Bake soufflés on baking sheet until puffed and tops feel firm, about 16 minutes if at room temperature and about 18 minutes if chilled.",
        "Serve soufflés immediately, passing nougat whip alongside."
    ],
    "ingredients": [
        "12 ounces high-quality milk chocolate (such as Lindt, Perugina, or Valrhona), chopped",
        "1/2 cup heavy whipping cream",
        "2 large egg yolks",
        "Pinch of salt",
        "6 large egg whites, room temperature",
        "2 tablespoons sugar",
        "1 large egg white, room temperature",
        "1 1/2 tablespoons honey",
        "1/3 cup chilled heavy whipping cream",
        "1 tablespoon amaretto or other almond liqueur",
        "1/4 cup whole almonds, toasted , chopped",
        "Special equipment: 8 3/4-cup soufflé dishes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Valentine's Day",
        "High Fiber",
        "Almond",
        "Amaretto",
        "Chill",
        "Honey",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Milk Chocolate Soufflés with Nougat Whip",
    "url": "http://www.epicurious.com/recipes/food/views/milk-chocolate-souffles-with-nougat-whip-357238"
}
