{
    "directions": [
        "Blend first 4 ingredients in processor until nuts are finely chopped. Using on/off turns, add butter; process until mixture resembles coarse meal. Mix yolk and 1 1/2 teaspoons cream in bowl. Add to flour mixture; process until moist clumps form. If dough is dry, add more cream by teaspoonfuls to moisten. Gather dough into ball. Flatten into disk. Wrap in plastic; chill 4 hours.",
        "Preheat oven to 350°F. Spray eighteen 3-inch tartlet pans with oil spray. Press 1 tablespoon dough onto bottom and up sides of each pan. Arrange tartlet pans on heavy large baking sheet. Bake until crusts are golden, piercing with fork if bubbles form, about 10 minutes. Transfer pans to rack; cool completely.",
        "Melt 9 ounces chocolate in top of double boiler over simmering water, stirring often. Remove from heat. Bring cream just to simmer in small saucepan. Pour hot cream into chocolate; stir until very smooth. Stir in chopped pecans. Transfer filling to small bowl. Cover; chill until filling is consistency of thick pudding, about 2 hours.",
        "Using small knife, loosen crusts from pans. Turn crusts out. Spread 1 teaspoon preserves in each crust. Spoon 1 tablespoon filling over. Garnish with nut halves and grated chocolate. Chill until filling is firm, about 1 hour. (Can be made 1 day ahead. Cover; chill.) Serve cold."
    ],
    "ingredients": [
        "1 1/4 cups all purpose flour",
        "1/3 cup pecans, toasted",
        "1/4 cup sugar",
        "Pinch of salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into pieces",
        "1 large egg yolk",
        "1 1/2 teaspoons (or more) whipping cream",
        "Nonstick vegetable oil spray",
        "9 ounces imported milk chocolate (such as Lindt), finely chopped",
        "1/3 cup plus 1 tablespoon whipping cream",
        "3 tablespoons finely chopped toasted pecans",
        "1/4 cup (about) apricot preserves",
        "Pecan halves",
        "Grated milk chocolate"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Apricot",
        "Pecan",
        "Chill",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Milk Chocolate-Pecan Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/milk-chocolate-pecan-tartlets-1218"
}
