{
    "directions": [
        "1. Put the chocolate in a heatproof glass bowl and melt slowly in the microwave. Alternatively, you can set the bowl over a pan of simmering water (don't let the bowl touch the water) and stir until the chocolate is completely melted and just warm. Set aside.",
        "2. Using a handheld electric mixer, whip the cream in a medium bowl until it forms soft peaks; set aside.",
        "3. Combine the egg whites and sugar in a heat-proof bowl and place over a pan of simmering water. Whisk continually until the whites are just hot, about 2 minutes. Remove from the heat and transfer to a large bowl. Beat the egg white-sugar mixture with a handheld electric mixer until stiff peaks form and the egg whites are shiny and glossy, 3 to 5 minutes.",
        "4. Fold the cream into the melted chocolate, then carefully fold the meringue into the chocolate mixture. Pour the chocolate mixture into a 9 x 13-inch pan and put in the freezer until firm, at least 3 hours or overnight until frozen.",
        "1. Heat the oven to 350°F. Combine the eggs, oil, sugar, salt, flour, star anise, baking powder, and baking soda in a large bowl. Mix until just incorporated; add the carrots.",
        "2. Line an 8 X 4-inch (or 4-cup) loaf pan with parchment or use a nonstick baking pan. Pour the cake batter into the pan and bake for 45 minutes, or until the center springs back when lightly touched.",
        "3. When cool enough to handle, unmold onto a baking rack (run a small knife around the edges if necessary to release the cake from the pan) and let cool. Cut into 2-inch slices then cut each slice in half and set aside.",
        "In a small saucepan, heat the carrot juice over medium heat, then add the cornstarch, and whisk until the carrot juice mixture thickens, about 2 minutes. Remove from the heat. Chill for 1 hour or until cold. Season with sugar and salt to taste.",
        "Ladle a small amount of carrot soup in a shallow bowl. Place 5 to 8 carrot cake pieces on top of the carrot soup. Place 3 to 4 small scoops of the chocolate semifreddo on top the carrot cake. Garnish with carrot greens, if desired."
    ],
    "ingredients": [
        "8 ounces milk chocolate, chopped",
        "1 cup heavy cream",
        "2 egg whites",
        "1 cup sugar",
        "2 large eggs",
        "2 tablespoons olive oil",
        "1/2 cup plus 2 tablespoons sugar",
        "1/4 teaspoon coarse salt",
        "3/4 cup whole-wheat flour",
        "1 1/2 teaspoons ground star anise",
        "1/8 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "2 cups shredded carrots, with greens reserved (for garnish, optional)",
        "2 cups fresh carrot juice",
        "2 tablespoons cornstarch",
        "1 tablespoon sugar",
        "Pinch coarse salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Bake",
        "Carrot",
        "Fall",
        "Anise",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Milk Chocolate Semifreddo with Star Anise Carrot Cake",
    "url": "http://www.epicurious.com/recipes/food/views/milk-chocolate-semifreddo-with-star-anise-carrot-cake-361390"
}
