{
    "directions": [
        "Bring milk, 1/2 cup granulated sugar, and salt to a simmer in a 4-quart heavy saucepan. Whisk in semolina, a little at a time, and simmer, whisking constantly, until mixture is the consistency of loose mashed potatoes, about 4 minutes. Remove from heat. Whisk together yolks and vanilla in a large bowl until combined, then whisk in hot semolina mixture, a little at a time, to temper yolks. Cool, stirring occasionally, 15 minutes.",
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Pulse nuts in a food processor with cinnamon and 2 tablespoons granulated sugar until finely chopped.",
        "Put phyllo sheets (in a stack) on a cutting board and trim with a sharp knife into a 13- by 9-inch stack. Cover phyllo with 2 overlapping sheets of plastic wrap and then a dampened kitchen towel.",
        "Brush a 13- by 9-inch baking pan with 1 tablespoon melted butter. Put 1 sheet of phyllo in pan (keep remaining sheets covered) and brush with butter, then sprinkle with a rounded teaspoon granulated sugar. Repeat with 9 more sheets, then spread walnut mixture evenly on top. Make 10 more phyllo layers over walnut mixture, buttering and sugaring each sheet.",
        "Beat whites in a bowl with an electric mixer at medium speed until they just hold stiff peaks. Stir one fourth of whites into semolina mixture to lighten, then fold in remaining whites gently but thoroughly.",
        "Spread egg mixture evenly over phyllo. Bake until filling is golden and puffed around edges, about 35 minutes. Cool pie in pan on a rack about 1 hour before cutting into squares. Serve warm or at room temperature, dusted with confectioners sugar."
    ],
    "ingredients": [
        "5 cups whole milk",
        "About 1 cup plus 2 tablespoons granulated sugar",
        "1/2 teaspoon salt",
        "1 cup semolina flour (5-1/2 oz; see cooks' note, below)",
        "3 large eggs, separated",
        "1 teaspoon vanilla",
        "4 oz walnuts (1 cup plus 2 tablespoons)",
        "1 teaspoon cinnamon",
        "20 (17- by 12-inch) sheets phyllo dough, thawed if frozen",
        "1 stick (1/2 cup) unsalted butter, melted",
        "Confectioners sugar for dusting"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Walnut",
        "Semolina",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Milk Pie",
    "url": "http://www.epicurious.com/recipes/food/views/milk-pie-234922"
}
