{
    "directions": [
        "Place pork in large bowl. Mix 1 tablespoon coarse salt and cinnamon in small bowl. Sprinkle salt mixture over pork, tossing to coat evenly. Cover and chill overnight.",
        "Preheat oven to 350°F. Melt butter in heavy medium saucepan over medium heat. Whisk in flour. Reduce heat to medium-low and cook 2 minutes, whisking often (do not allow roux to brown). Remove from heat; cover and let stand until ready to use.",
        "Using on/off turns, blend onion, carrot, and celery in processor until finely chopped. Cook pancetta in large ovenproof pot over medium-high heat until beginning to brown and fat is rendered, about 6 minutes. Add vegetables to pot and sauté until beginning to brown, about 6 minutes. Add pork and sauté until brown, about 7 minutes. Add wine and bring to boil, stirring up browned bits. Add milk and bring to simmer. Add tomato puree, then whisk in roux. Simmer 5 minutes, whisking occasionally.",
        "Cover pot. Place in oven and braise pork until very tender, about 2 hours. Uncover; let pork cool briefly. Chill pork, uncovered, until cold, then cover and chill overnight.",
        "Rewarm pork over low heat, stirring often. Season to taste with salt and pepper.",
        "Place 1 gnocchi square in center of each plate. Top with pork and sauce.",
        "An Italian bacon cured in salt; available in the refrigerated deli case of many supermarkets and at Italian markets."
    ],
    "ingredients": [
        "2 1/2 pounds 1-inch cubes trimmed pork shoulder (such as boneless pork butt)",
        "1 tablespoon coarse kosher salt",
        "1/2 teaspoon ground cinnamon",
        "1/2 cup (1 stick) butter",
        "1/2 cup all purpose flour",
        "1 medium white onion, chopped",
        "1 large carrot, chopped",
        "1 large celery stalk, chopped",
        "1/4 pound pancetta (Italian bacon),* chopped",
        "2 cups dry white wine",
        "4 cups whole milk",
        "2 28-ounce cans plum tomatoes in juice, pureed with juice in blender in batches until smooth",
        "Semolina Gnocchi"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Pork",
        "Appetizer",
        "Braise",
        "Father's Day",
        "Dinner",
        "Semolina",
        "Texas",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Milk Braised Pork Shoulder with Semolina Gnocchi",
    "url": "http://www.epicurious.com/recipes/food/views/milk-braised-pork-shoulder-with-semolina-gnocchi-354860"
}
