{
    "directions": [
        "Position rack in bottom third of oven and preheat to 350°F. Line bottom of 9-inch-diameter cake pan with 2-inch-high sides with parchment paper. Melt butter in saucepan over medium heat. Remove from heat. Spoon off foam from top of butter and discard. Spoon clear yellow butter into small metal bowl, leaving water and milk solids in bottom of pan. Add vanilla to butter in bowl; set clarified butter aside.",
        "Sift flour and cocoa powder together 3 times into medium bowl. Whisk eggs and sugar in large metal bowl to blend. Place bowl with egg mixture in large skillet of barely simmering water; whisk constantly until egg mixture is lukewarm (105°F), about 2 minutes. Remove bowl from water. Place bowl with clarified butter in hot water in same skillet over low heat to keep warm.",
        "Using electric mixer, beat egg mixture until cool and tripled in volume, about 5 minutes. Sift 1/3 of flour-cocoa mixture over egg mixture and gently fold in with rubber spatula. Fold in remaining flour-cocoa mixture in 2 more additions. Fold 1 cup of cake batter into warm clarified butter until incorporated. Using rubber spatula, gently fold butter-cake batter mixture into remaining cake batter.",
        "Transfer batter to prepared pan. Bake until tester inserted into center of cake comes out clean and top springs back slightly when gently pressed, about 30 minutes. Cool completely in pan on rack. (Can be made 1 day ahead. Cover; store at room temperature.)",
        "Run knife between pan sides and cake to loosen. Invert cake onto rack; remove parchment. Using long serrated knife, trim top of cake horizontally, forming 3/4-inch-high cake layer. Using bottom of 8-inch-diameter springform pan as guide, trim around sides of cake to form 8-inch round cake. Set cake aside.",
        "Line bottom of 8-inch-diameter springform pan with parchment paper. Pour enough water into large skillet to reach depth of 1 inch; bring to simmer. Remove skillet from heat. Place gianduja in medium metal bowl; set bowl in hot water in skillet. Stir until gianduja is melted and smooth. Stir in cereal and nuts. Spread crunch evenly over parchment in pan. Place cake atop crunch layer, pressing to adhere. Chill until crunch is firm, about 1 hour.",
        "Place gianduja in metal bowl. Pour enough water into large skillet to reach depth of 1 inch; bring to simmer. Remove from heat; place bowl with gianduja in hot water in skillet. Stir until gianduja is smooth. Remove bowl from water; cool gianduja to lukewarm.",
        "Using electric mixer, beat cream and salt in another bowl until very soft peaks form (when bowl is tilted, cream should be fluffy but still pourable and flow to one side). Mix 3 tablespoons water into melted gianduja. Pour whipped cream over and fold into gianduja just until incorporated (mousse will be very soft).",
        "Brush top of chilled cake with liqueur. Spread mousse over cake in pan. Cover and chill overnight. (Can be prepared 2 days ahead. Keep chilled.)",
        "Run knife between cake and pan sides to loosen. Soak kitchen towel in hot water; wring out water. Wrap hot wet towel around pan sides and hold 30 seconds. Carefully remove pan sides from cake; smooth mousse with knife if necessary. Place cake on pan bottom on rack set over baking sheet. Sift cocoa powder lightly over top of cake. Using stencils such as snowflakes or stars, sift powdered sugar over top of cake. Transfer to platter and serve.",
        "*Many supermarkets sell pre-husked hazelnuts. if you can't find them, here's how to husk whole hazelnuts: Scatter nuts on rimmed baking sheet and toast at 350°F until skins darken, 12 to 15 minutes. Wrap warm hazelnuts in kitchen towel and rub together to remove skins."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter",
        "1 teaspoon vanilla extract",
        "1/3 cup sifted all purpose flour (sifted, then measured)",
        "1/3 cup sifted unsweetened cocoa powder (preferably Dutch-process; sifted, then measured)",
        "4 large eggs",
        "2/3 cup sugar",
        "5 ounces imported gianduja bars (hazelnut-flavored milk chocolate, such as Callebaut), chopped",
        "1 cup crisp rice cereal",
        "1/3 cup hazelnuts, toasted, husked, finely chopped*",
        "10 ounces imported gianduja bars (hazelnut-flavored milk chocolate, such as Callebaut), chopped",
        "1 1/4 cups chilled heavy whipping cream",
        "1/8 teaspoon (scant) salt",
        "3 tablespoons water",
        "3 tablespoons Tuaca (sweet citrus-flavored liqueur) or Frangelico (hazelnut-flavored liqueur)",
        "Additional unsweetened cocoa powder",
        "Powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Vanilla",
        "Frangelico",
        "Winter",
        "Hazelnut",
        "Double Boiler",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Milk Chocolate Mousse Cake with Hazelnut Crunch Crust",
    "url": "http://www.epicurious.com/recipes/food/views/milk-chocolate-mousse-cake-with-hazelnut-crunch-crust-231260"
}
