{
    "directions": [
        "1. Combine 3 cups water and millet in a medium saucepan and bring to a boil over high heat. Cover, reduce the heat to low, and simmer slowly until it's like a thick, coarse, hot breakfast cereal, about 30 minutes. Uncover and stir well to incorporate any last bits of water. Scrape the millet into a large bowl and cool for 10 minutes.",
        "2. Meanwhile, put the sun-dried tomatoes and garlic in a small heat-proof bowl. Cover with boiling water and steep for 10 minutes.",
        "3. Place the pine nuts in a dry medium skillet set over medium-low heat. Toast until lightly browned and fragrant, about 5 minutes, stirring often. Pour them into the bowl with the millet.",
        "4. Drain the sun-dried tomatoes and garlic in a fine-mesh sieve and add them to the bowl with the millet. Add the olives, cheese, caper berries, oregano, and marjoram. Stir well, mashing the ingredients together. You want texture here, bits of this and that scattered throughout the burgers, not a baby-food puree. Use dampened hands to form the mixture into 6 round, even patties.",
        "5. Melt the butter in the olive oil over medium heat in a large skillet, preferably nonstick. Slip the patties into the skillet and cook until mottled brown and somewhat crisp, about 4 minutes. Flip them and continue cooking until set throughout, mottled brown on the other side, and now nicely crisp, about 4 more minutes. If your skillet isn't large enough to hold all 6 patties at once, work in two batches, using 1 tablespoon olive oil and 1 tablespoon unsalted butter for each batch."
    ],
    "ingredients": [
        "3 cups (720 ml) water",
        "1 cup millet",
        "10 chopped sun-dried tomatoes",
        "1 garlic clove",
        "1/4 cup pine nuts",
        "1/3 cup pitted green olives, chopped",
        "1/4 cup packed grated Pecorino-Romano or Parmigiano-Reggiano",
        "4 large caper berries, stemmed and then minced",
        "2 teaspoons minced fresh oregano leaves or 1 teaspoon dried oregano",
        "2 teaspoons minced fresh marjoram leaves or 1 teaspoon dried marjoram",
        "2 tablespoons unsalted butter",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Olive",
        "Tomato",
        "Fry",
        "Vegetarian",
        "Party",
        "Advance Prep Required"
    ],
    "title": "Millet Burgers with Olives, Sun-Dried Tomatoes, and Pecorino",
    "url": "http://www.epicurious.com/recipes/food/views/millet-burgers-with-olives-sun-dried-tomatoes-and-pecorino-51118800"
}
