{
    "directions": [
        "Preheat an oven to 450 degrees F (230 degrees C).",
        "Season inside of chicken cavity and the back generously with salt and black pepper. Squeeze lemon halves into cavity and drop squeezed peels inside. Stuff cavity with garlic cloves and fresh thyme; add a bay leaf to cavity.",
        "Drizzle 1 tablespoon olive oil into a heavy roasting pan. Place sourdough slices into pan and press slices lightly into olive oil to help coat bottom of bread. Drizzle 1 more tablespoon olive oil on top of bread slices. Place chicken on top of bread slices and tie legs together with kitchen twine. Brush outside of chicken with 1 tablespoon olive oil and season entire outside with salt.",
        "Bake chicken in the preheated oven for 1 hour.",
        "Mix creme fraiche, grated shallot, and Aleppo pepper together in a small bowl. Stir 2 tablespoons lemon juice and lemon zest into sauce. Refrigerate until needed.",
        "Lift chicken off bread slices using a tongs and flip the bread slices over (they will be very brown). Place chicken back onto the bread slices. Generously brush the outside of the chicken with creme fraiche sauce, putting enough on to drip down onto bread slices.",
        "Return chicken to oven and bake for 10 more minutes to brown the glaze. Repeat, brushing more creme fraiche sauce generously onto the chicken. More is more. Bake 10 more minutes. Remove chicken from oven and let stand for 10 minutes. An instant-read meat thermometer inserted into the thickest part of a thigh, not touching bone, should read 165 degrees F (75 degrees C).",
        "Pour remaining creme fraiche glaze into a small skillet, place over medium heat, and bring to a boil. Stir constantly, cooking until the shallot is cooked and sauce reduces slightly, 1 or 2 minutes. Turn off heat.",
        "Transfer chicken to a cutting board and cut bread pieces in half crosswise. Cut chicken up into 8 serving pieces (drumsticks, thighs, wings, and breasts) and serve with pieces of drippings-soaked toasted bread. Drizzle thickened creme fraiche sauce over chicken and garnish with chopped chive blossoms."
    ],
    "ingredients": [
        "1 (4.5 pound) whole chicken",
        "salt and ground black pepper to taste",
        "1 lemon, halved",
        "3 cloves garlic, peeled (optional)",
        "1 bunch fresh thyme",
        "1 bay leaf",
        "2 tablespoons olive oil, or as needed - divided",
        "3 thick slices day-old sourdough French bread",
        "1 tablespoon olive oil",
        "1 cup creme fraiche",
        "1 tablespoon peeled and grated shallot",
        "1 teaspoon Aleppo pepper",
        "lemon juice, or to taste",
        "1 teaspoon lemon zest",
        "3 chive blossoms for garnish, chopped (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Million Dollar Chicken",
    "url": "http://allrecipes.com/recipe/233953/million-dollar-chicken/"
}
