{
    "directions": [
        "Using the back of a large spoon, cream 1/2 cup butter or margarine until it is light.  Mix in the confectioners' sugar, then 1/4 tsp. vanilla.  Now work in the flour.  Knead the dough on an unfloured surface until it is smooth.",
        "Spray a shortbread pan (8 piece pan) very lightly with a non-stick spray.  Put the ball of dough in the middle of the pan, and working from the inside out, firmly press the dough into the pan.  Prick the entire surface with a fork, and bake in the pan at 325 degrees F (165 degrees C) for 30-35 minutes or until lightly browned.",
        "Let short bread cool in its pan for 10 minutes before you loosen the edges with a knife and flip the pan upside down onto  a cutting board.   If shortbread does not come out right away, tap one edge of the pan against the board.   Do not cut!!  Allow shortbread to cool.",
        "Cut strips of waxed paper and lay them over the edges of the shortbread pan, being sure to cover the rim completely.  Return baked shortbread to pan.",
        "To Make the Toffee:  Mix the 1 cup less 2 T. sugar, cream of tartar and cream in a small heavy saucepan.  Bring to a boil over med-high heat, stiffing constantly, and cook for 2-3 minutes.  Add the butter.",
        "Continue to cook and stir the candy until it turns a pale brown and reaches the soft crack stage.  This is usually 285-290 degrees F (approx. 150 degrees C) on a candy thermometer.  Another way to test it is to drop a small amount of molten candy into a cup of ice water.  If it hardens to a crunchy blob, the candy is ready.  Take the pan for the heat and let it cool.  Stir in 1/2 t. vanilla.",
        "Now pour the toffee onto the shortbread.  Use as much of the toffee as you like.  Let the toffee cool until it is just warm to the touch.  Turn the shortbread onto a cutting board and peel off the waxed paper strips.  Using a serrated knife, slowly cut the shortbread into serving pieces.  Turn the pieces toffee side up to cool completely.",
        "To Make Top Chocolate Layer:   Melt the chocolate  in a small pan over a tiny flame.  Cool it slightly then spread a layer of chocolate on top of the toffee layer on the shortbread.  Place the finished cookies chocolate side up on a plate and place in the refrigerator to finish hardening.    Remove millionaires shortbread 1/2 hour before you plan to eat them.  When you serve these fabulous cookies, turn the cookies over so that the chocolate side is down and the pretty side is up."
    ],
    "ingredients": [
        "1/2 cup unsalted butter, softened",
        "1/3 cup confectioners' sugar",
        "1/4 teaspoon vanilla extract",
        "1 cup all-purpose flour",
        "7/8 cup granulated sugar",
        "1 dash cream of tartar",
        "1/2 cup heavy cream",
        "4 tablespoons butter",
        "4 (1 ounce) squares semisweet chocolate",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Millionares Shortbread",
    "url": "http://allrecipes.com/recipe/10409/millionares-shortbread/"
}
