{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Butter 2 (8-inch) square nonstick pans and coat with flour, tapping off excess. Place the flour, sugar and salt in a food processor and pulse once. Add butter and pulse until mixture resembles peas. Press the shortbread mixture into prepared pans and bake until golden brown around the edges, about 20 minutes. Remove from the oven and let cool completely.",
        "In a heavy-bottomed saucepan over medium-low heat, combine the condensed milk and 2 tablespoons of butter. Slowly bring the mixture to a boil, stirring continuously. Continue stirring over the heat until mixture becomes thick and amber in color, about 15 minutes. Pour the caramel over the cooked shortbread and spread evenly using an offset spatula. Cool to room temperature.",
        "In a glass bowl set over a saucepan of simmering water, melt the chocolate. Once chocolate has melted, pour it over the cooled caramel layer. Cool at room temperature for about 10 minutes, and then place in the refrigerator to cool completely, allowing chocolate to slightly harden but not get hard. Cut into 2-inch squares and enjoy, or store in an airtight container, at room temperature, or my favorite - keep in the refrigerator for a yummy sweet and cool treat!"
    ],
    "ingredients": [
        "2 sticks butter, cut into small pieces, plus more for preparing pans",
        "2 cups all-purpose flour, plus more for preparing pans",
        "2/3 cup sugar",
        "1/2 teaspoon salt",
        "2 (14-ounce) cans sweetened condensed milk",
        "2 tablespoons butter",
        "3/4 pound good-quality milk chocolate"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Dairy Recipes",
        "Chocolate",
        "Sugar",
        "Recipes for Parties"
    ],
    "title": "Millionaire's Shortbread",
    "url": "http://www.foodnetwork.com/recipes/claire-robinson/millionaires-shortbread-recipe"
}
