{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place cranberries in a large saucepan and pour water over them. Simmer on low heat until cranberries begin to split. Remove from heat and pour into a large ovenproof baking dish.",
        "To cranberries add apples, raisins, gooseberries, cherries, brandy, lemon rind, orange rind, vinegar, sugar, cloves, nutmeg, cinnamon, and allspice. Stir this mixture thoroughly and cover dish.",
        "Place dish  in preheated oven. Heat for 30 minutes, stirring occasionally.",
        "Sterilize enough canning jars and lids to fit all mincemeat.",
        "Place a wire rack in the bottom of a large stock pot and fill halfway with water. Bring water to a rolling boil.",
        "Pack mincemeat into sterilized jars, ensuring that there are no spaces or air bubbles. Fill jars all the way to the top and screw on lids. Carefully lower jars into boiling water using a holder. Make sure jars have at least 2 inches of space between them. Pour more boiling water over jars if necessary, so that they are covered by 2 inches of water. Cover pot and process for 30 minutes.",
        "Carefully lift jars out of water using a holder, and place on a wooden or cloth-covered surface, at least 2 inches apart. Allow to cool, then check seal by pressing on jar lid. A properly sealed lid will not move up or down at all. Mincemeat should be aged for 2 or 3 months before using."
    ],
    "ingredients": [
        "2 pounds cranberries",
        "1 quart water",
        "9 apples - peeled, cored and ground",
        "2 pounds raisins",
        "3 (16 ounce) cans gooseberries",
        "3 (16 ounce) cans pitted sour red pie cherries",
        "2 cups brandy",
        "2 tablespoons lemon zest",
        "2 tablespoons orange zest",
        "2 cups distilled white vinegar",
        "4 cups white sugar",
        "1 tablespoon ground cloves",
        "1 tablespoon ground nutmeg",
        "2 tablespoons ground cinnamon",
        "2 tablespoons ground allspice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mincemeat III",
    "url": "http://allrecipes.com/recipe/17523/mincemeat-iii/"
}
