{
    "directions": [
        "In a large bowl let the white beans soak in enough water to cover them by 2 inches overnight or quick-soak them. Drain the white beans, in a saucepan combine them with enough water to cover them by 2 inches, and simmer them, uncovered, adding more water if necessary to keep them barely covered, for 45 minutes to 1 hour, or until they are tender. Add the salt and simmer the white beans for 5 minutes more. Remove the pan from the heat and let the white beans stand, uncovered.",
        "In a heavy kettle cook the pancetta in the oil over moderate heat, stirring, until it is crisp and pale golden, add the onion, and cook the mixture, stirring, until the onion is softened. Add the carrots, the celery, and the garlic and cook the mixture, stirring, for 4 minutes. Add the zucchini, the green beans, and the potatoes, peeled and cut into 3/4-inch dice, and cook the mixture, stirring, for 4 minutes. Add the cabbage and the kale and cook the mixture, stirring, until the cabbage is wilted. Add the tomatoes and the broth and simmer the soup, covered, for 1 hour.",
        "Drain the white beans, reserving the liquid, in a blender or food processor purée half of them with 1 cup of the reserved liquid, and stir the purée and the remaining white beans into the soup. Simmer the soup, uncovered, for 15 minutes, thin it if desired with some of the remaining reserve liquid, and season it with salt and pepper. The soup may be made 3 days in advance and kept covered and chilled. Reheat the soup, thinning it with water as desired. Serve the soup with the Parmesan, the bruschetta, and the sausages."
    ],
    "ingredients": [
        "1/2 pound (about 1 1/4 cups) dried white beans such as Great Northern, picked over and rinsed",
        "1/2 teaspoon salt",
        "1/4 pound pancetta (Italian cured pork belly, available at Italian markets and specialty foods shops) or sliced lean bacon, chopped",
        "1/3 cup olive oil",
        "1 onion, chopped",
        "1 large carrot, cut into 1/2-inch dice",
        "1 rib of celery, cut into 1/2-inch dice",
        "3 garlic cloves, chopped fine",
        "2 zucchini, scrubbed and cut into 1/2-inch dice",
        "1/4 pound green beans, trimmed and cut into 1/2-inch pieces",
        "1/2 pound boiling potatoes",
        "4 cups shredded green cabbage (preferably Savoy)",
        "1/2 pound kale, rinsed, drained, stems discarded, and the leaves chopped (about 6 cups)",
        "a 28-ounce can tomatoes, chopped coarse and drained well",
        "4 1/2 cups chicken broth (preferably low-salt)",
        "freshly grated Parmesan, garlic bruschetta , and dry-cured sausages as accompaniments"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Leafy Green",
        "Pork",
        "Tomato",
        "High Fiber",
        "Kale",
        "Zucchini",
        "Fall",
        "Gourmet"
    ],
    "title": "Minestrone",
    "url": "http://www.epicurious.com/recipes/food/views/minestrone-11569"
}
