{
    "directions": [
        "1. Place 12 ounces fingerling or baby red potatoes in a medium saucepan and cover with cold water. Bring to a boil and cook until the potatoes are tender when pierced with a fork, about 10 minutes. Spread them out on a baking sheet to cool, then slice the potatoes into 1/2-inch coins.",
        "2. Bring a large pot of water to a boil and add 1 teaspoon salt. Prepare a bowl of ice water. Add 8 ounces green beans, cut in half, and 1 pound asparagus, trimmed and cut into 1-inch pieces so they're about the size of the pasta you're using, and blanch the vegetables just until they're bright green, 1 to 2 minutes. Scoop the vegetables out of the hot water with a spider or a strainer, rinse them with cold water, and submerge them in the ice water until completely cool, then drain, pat dry, and set aside.",
        "3. Add 1 pound gemelli or tubetti (or any short pasta you choose) to the boiling water and cook until al dente. Drain the pasta and put it in a large bowl to cool a bit.",
        "4. Toss in the potatoes, asparagus, green beans, 1/2 cup pesto, one 15 1/2-ounce can cannellini beans (drained and rinsed), one 6-ounce jar roasted peppers, sliced into strips, and salt and pepper to taste. If preparing ahead of time, combine all of the ingredients 1 to 2 hours before serving."
    ],
    "ingredients": [
        "12 ounces fingerling or baby red potatoes",
        "8 ounces green beans, cut in half",
        "1 pound asparagus, trimmed and cut into 1-inch pieces",
        "1 pound gemelli or tubetti (or any short pasta you choose)",
        "1/2 cup pesto",
        "one 15 1/2-ounce can cannellini beans (drained and rinsed)",
        "one 6-ounce jar roasted peppers, sliced into strips",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Pasta",
        "Potato",
        "Vegetable",
        "Vegetarian",
        "Dinner",
        "Asparagus",
        "Green Bean",
        "Legume",
        "Bell Pepper",
        "Root Vegetable",
        "Summer",
        "Advance Prep Required",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Minestrone Salad",
    "url": "http://www.epicurious.com/recipes/food/views/minestrone-salad-51180400"
}
