{
    "directions": [
        "In a large saucepan heat 1 tablespoon oil over moderately high heat until hot but not smoking and sauté onion, carrot, and potato with salt to taste until vegetables are lightly browned. Add tomatoes and their liquid, broth, and pasta and simmer, stirring to break up tomatoes, 10 minutes, or until pasta and vegetables are tender.",
        "In a skillet sauté garlic in remaining tablespoon oil over moderately high heat until golden and discard with a slotted spoon. In garlic-flavored oil fry bread, seasoned with salt, over moderate heat, stirring occasionally, until golden on all sides. Remove skillet from heat and add parsley and Parmesan, tossing croutons to coat well.",
        "Add zucchini and half the croutons to tomato mixture and simmer, stirring occasionally, 5 minutes, or until zucchini is almost tender and croutons are dissolved. Stir in romaine and cook 1 minutes.",
        "Serve soup sprinkled with remaining croutons."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 small onion, cut into 1/4-inch-thick slices",
        "1 carrot, cut into 1/4-inch-thick slices",
        "1 small red potato, cut into 1/2-inch dice",
        "a 14- to 16-ounce can peeled whole tomatoes including their juice",
        "1 1/4 cups low-salt chicken broth",
        "1 ounce (about 2 tablespoons) dried ditalini or other small macaroni-type pasta",
        "1 large garlic clove, sliced",
        "2 slices homemade-type white bread, cut into 1/2-inch cubes",
        "1 teaspoon minced fresh parsley leaves",
        "1 tablespoon freshly grated Parmesan cheese",
        "1 small zucchini (about 6 ounces), washed and cut into 1/2-inch dice",
        "1 cup chopped romaine lettuce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Leafy Green",
        "Pasta",
        "Tomato",
        "Vegetable",
        "Quick & Easy",
        "Parmesan",
        "Zucchini",
        "Winter",
        "Gourmet"
    ],
    "title": "Minestrone with Garlic and Parmesan Croutons",
    "url": "http://www.epicurious.com/recipes/food/views/minestrone-with-garlic-and-parmesan-croutons-11022"
}
