{
    "directions": [
        "Combine flour, white sugar, and salt in a large bowl. Cut in cubed butter using a pastry blender, 2 knives, or your fingertips until mixture resembles coarse meal. Stir in water until dough just comes together into a ball.",
        "Form the dough into a disc. Cover tightly with plastic wrap and chill for at least 1 hour.",
        "Preheat oven to 375 degrees F (190 degrees C). Grease a muffin tin with butter.",
        "Roll out dough to 1/4-inch thickness on a well floured surface. Cut out nine 3 1/2-inch rounds using a biscuit cutter or floured glass. Press rounds into the muffin tin, pushing dough up the sides in the shape of a cup. Transfer to the refrigerator.",
        "Core apples by slicing around the core on 4 sides. Cut apples into very thin half moons using a mandolin or a very sharp knife. Toss apple slices with lemon juice in a microwave-safe bowl.",
        "Combine 1/4 cup brown sugar and 2 tablespoons melted butter in a small bowl; pour over apples and toss to combine. Microwave apples until pliable enough to roll, about 1 minute.",
        "Lay 10 apple slices in a horizontal line on a flat work surface with the skin side facing you; arrange slices so that each slice overlaps the previous slice by half. Roll up the slices tightly from one end to the other. Arrange 2 to 8 additional slices around the outside of each apple rose to reach desired size. Repeat with remaining slices to form 8 more apple roses.",
        "Combine remaining 1/4 cup brown sugar and 2 tablespoons melted butter in a small bowl; brush over the bottom of each dough cup. Place an apple rose in each cup.",
        "Bake in the preheated oven until dough turns golden and apples are cooked through, 25 to 30 minutes.",
        "Pour strawberry preserves into a microwave-safe bowl. Heat in the microwave until liquid, about 30 seconds. Brush preserves over each apple rose."
    ],
    "ingredients": [
        "Pie Dough:",
        "1 1/4 cups all-purpose flour",
        "1 tablespoon white sugar",
        "1/4 teaspoon salt",
        "1/2 cup very cold butter, cut into 1/2-inch cubes",
        "3 tablespoons ice-cold water",
        "Filling:",
        "2 Pink Lady apples",
        "3 tablespoons lemon juice",
        "1/2 cup brown sugar, divided",
        "1/4 cup unsalted butter, melted, divided",
        "1/4 cup strawberry preserves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mini Rose Apple Pies",
    "url": "http://allrecipes.com/recipe/256422/mini-rose-apple-pies/"
}
