{
    "directions": [
        "In a small saucepan heat milk with sugar, butter, and salt over low heat until mixture is lukewarm, or registers between 110°F. and 115°F. on a candy thermometer, and transfer to a bowl.",
        "Sprinkle yeast over milk mixture and let stand until foamy, about 5 minutes. Whisk in egg and stir in 2 1/2 cups flour, stirring until mixture forms a dough.",
        "On a floured surface knead dough, kneading in enough of remaining 1/2 cup flour to form a soft dough, 8 to 10 minutes. Form dough into a ball and transfer to a well-buttered bowl. Turn dough to coat with butter. Cover bowl with plastic wrap and let dough rise in a warm place until doubled in bulk, about 1 hour.",
        "Butter 32 miniature (1/8-cup) muffin tins. Turn dough out on a floured surface. Working with about one third of dough at a time, cut off pieces about the size of large marbles. Form pieces into balls and put 3 balls into each tin. Let rolls rise, covered loosely, in a warm place until almost doubled in bulk, 30 to 40 minutes.",
        "While rolls are rising, preheat oven to 400°F.",
        "Brush rolls lightly with egg wash and sprinkle with seeds. Bake rolls in middle of oven until golden, about 10 minutes. Rolls may be made 2 weeks ahead and frozen, double-wrapped in resealable plastic bags, with excess air pressed out. Reheat rolls, wrapped in foil, in middle of a preheated 350°F. oven 15 to 20 minutes, or until heated through."
    ],
    "ingredients": [
        "3/4 cup milk",
        "3 tablespoons sugar",
        "3 tablespoons unsalted butter",
        "1 1/2 teaspoons salt",
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "1 large egg",
        "2 1/2 to 3 cups all-purpose flour",
        "an egg wash made by beating 1 large egg with 2 teaspoons water",
        "poppy seeds and/or lightly toasted sesame seeds for sprinkling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Milk/Cream",
        "Dairy",
        "Egg",
        "Bake",
        "Wedding",
        "Gourmet"
    ],
    "title": "Miniature Cloverleaf Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/miniature-cloverleaf-rolls-12052"
}
