{
    "directions": [
        "Whisk together flour and salt in a bowl until combined.",
        "Beat together butter and sugar in a large bowl with an electric mixer at medium-high speed until pale and fluffy, about 2 minutes in a stand mixer (preferably fitted with paddle attachment) or 4 minutes with a handheld. Add whole eggs, yolks, and chocolate, beating until combined. Reduce speed to low, then add flour mixture and mix until combined well.",
        "Put oven racks in upper and lower thirds of oven and preheat oven to 350°F.",
        "Drop 1/2 teaspoons of batter 1 inch apart on 2 ungreased baking sheets. Bake, switching position of sheets halfway through baking, until cookies are puffed up, 7 to 8 minutes total, then transfer with a metal spatula to racks to cool completely. Cool baking sheets and make more cookies with remaining dough on cooled sheets.",
        "Whisk together eggs, confectioners sugar, butter, and chocolate in top of a double boiler or a large metal bowl set over a pot of simmering water and cook, whisking, until a thermometer registers 170°F. Remove top of double boiler (or bowl) from pot and set in a larger bowl of ice and cold water, then stir occasionally until cold. Remove from ice water and beat with cleaned beaters at medium-high speed until pale and fluffy, about 3 minutes.",
        "Spread 1/2 teaspoon filling on flat side of 1 cookie, then place flat side of a second cookie over filling to form a sandwich. Fill remaining cookies in same manner."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1 1/2 sticks (3/4 cup) unsalted butter, softened",
        "2/3 cup sugar",
        "2 whole large eggs plus 2 large egg yolks",
        "3 oz fine-quality semisweet chocolate, finely chopped, melted, and cooled",
        "2 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped, melted, and cooled",
        "2 large eggs",
        "1 cup confectioners sugar",
        "1 1/2 sticks (3/4 cup) unsalted butter, cut into bits",
        "4 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Christmas",
        "Oscars",
        "Edible Gift",
        "Engagement Party",
        "Candy Thermometer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mini Chocolate Sandwich Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/mini-chocolate-sandwich-cookies-231212"
}
