{
    "directions": [
        "For the dough: Whisk the egg with 3 tablespoons cold water in a small bowl. Pulse the flour, 1/3 of the butter, Parmesan, vinegar, 1/2 teaspoon salt and 1/4 teaspoon pepper in a food processor until the mixture looks like fine meal. Add the remaining butter and pulse until the mixture is in pea-size pieces. Add the egg and pulse until the dough begins to come together.",
        "Divide the dough in half; place each half on a sheet of plastic wrap and pat into a disk. Wrap the disks tightly and refrigerate until firm, at least 1 hour up to overnight, or freeze for up to 2 months.",
        "For the filling: Meanwhile, add the oil to a large Dutch oven or pot over medium-high heat. Add the onion, celery and thyme and cook, stirring, until soft, about 5 minutes. Add the mushrooms, 1 teaspoon salt and a few grinds of pepper and cook, stirring, until soft, about 4 minutes. Add the flour and cook, stirring, 2 minutes. Add the broth, peas and carrots and sour cream. Bring to a boil, then reduce the heat to medium-low and simmer until thick, about 3 minutes. Stir in the chicken and parsley and add salt and pepper to taste. Allow the mixture to cool completely. (The filling can be made a day ahead.)",
        "Preheat the oven to 375 degrees F. Line two baking sheets with parchment.",
        "Roll 1 disk of dough between two sheets of parchment to about 1/8-inch thick. Using a 4-inch round cookie cutter, cut into nine rounds. Gather the scraps, reroll and cut out 3 more rounds. Cover the rounds with a clean, damp towel to prevent the dough from drying out. Repeat with the remaining disk of dough, for a total of 24 rounds. (If the dough gets too warm while you're working with it, chill it until it's easier to work with.)",
        "Place 1 round of dough on a clean, lightly-floured work surface and roll out to about 4 1/2 inches. Place 1/3 cup of filling in the center and brush the edges with beaten egg. Roll another round of dough out to 4 1/2 inches and drape over the filling; seal the edges and crimp with a fork. Brush the entire pot pie with more egg, cut a few slits in the top, sprinkle with some pepper and place on a prepared baking sheet. Repeat with the remaining dough and filling.",
        "Bake the pot pies until they're golden brown and the filling begins to bubble, 20 to 24 minutes. Let cool slightly before serving.",
        "Alternatively, freeze the unbaked pot pies for up to 1 month, then bake, from frozen, in the oven, preheated to 375 degrees F, until they're golden brown and the filling begins to bubble, 20 to 24 minutes. Let cool slightly and serve."
    ],
    "ingredients": [
        "1 large egg",
        "3 cups whole-wheat pastry flour, plus more for the work surface",
        "10 tablespoons cold unsalted butter, cut into small pieces",
        "3 tablespoons grated Parmesan",
        "1 tablespoon apple cider vinegar",
        "Kosher salt and freshly ground black pepper",
        "2 tablespoons olive oil",
        "1/2 medium onion, chopped",
        "2 stalks celery, chopped",
        "1 teaspoon chopped fresh thyme",
        "1/2 pound white mushrooms, sliced",
        "Kosher salt and freshly ground black pepper",
        "4 tablespoons whole-wheat pastry flour",
        "2 cups low-sodium chicken broth",
        "1 cup frozen peas and carrots, thawed",
        "1/3 cup reduced-fat sour cream",
        "1 cup shredded rotisserie chicken, skin and bones discarded",
        "1/2 cup loosely-packed fresh parsley leaves, chopped",
        "1 large egg, lightly beaten"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Pot Pie Recipes",
        "Vegetable",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes",
        "High Fiber"
    ],
    "title": "Mini Whole-Wheat Chicken Pot Pies",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/mini-whole-wheat-chicken-pot-pies"
}
