{
    "directions": [
        "Make the cupcakes: Preheat the oven to 325 degrees F. Line a 24-cup mini-muffin pan with paper liners. Combine the chocolate, cocoa powder and brown sugar in a large bowl; add the hot coffee and whisk until smooth. Let cool to room temperature.",
        "Whisk the flour, granulated sugar, salt and baking soda in a medium bowl. Whisk the egg, egg yolk, vegetable oil, buttermilk and vanilla into the melted chocolate mixture. Add the flour mixture and whisk until smooth. Spoon a scant tablespoon of batter into each mini-muffin cup. Bake until a toothpick inserted into the centers comes out clean, about 15 minutes. Let cool a few minutes in the pan, then remove to a rack to cool completely.",
        "Meanwhile, make the frosting: Combine the heavy cream, corn syrup, butter and salt in a medium saucepan and bring to a simmer. Remove from the heat; add the chocolate and whisk until smooth, then let cool to room temperature. Fill a large bowl halfway with ice water. Transfer the chocolate mixture to a medium bowl; then carefully place it in the ice water and let sit, stirring every few minutes, until the frosting is thick enough to spread, about 15 minutes.",
        "Transfer the frosting to a pastry bag fitted with a large star tip and pipe onto the cupcakes.",
        "Photograph by Ryan Dausch"
    ],
    "ingredients": [
        "2 ounces bittersweet chocolate, finely chopped",
        "1/4 cup Dutch-process unsweetened cocoa powder",
        "1/4 cup packed light brown sugar",
        "1/4 cup hot brewed coffee",
        "1/2 cup all-purpose flour",
        "1/4 cup granulated sugar",
        "1/2 teaspoon salt",
        "1/4 teaspoon baking soda",
        "1 large egg plus 1 egg yolk",
        "1/4 cup vegetable oil",
        "1/4 cup buttermilk",
        "1 teaspoon pure vanilla extract",
        "For the frosting:",
        "1 cup heavy cream",
        "2 tablespoons light corn syrup",
        "2 tablespoons unsalted butter",
        "Pinch of salt",
        "8 ounces chopped bittersweet or semisweet chocolate"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cupcake",
        "Chocolate",
        "Cupcake",
        "Dessert"
    ],
    "title": "Mini Chocolate Ganache Cupcakes",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/mini-chocolate-ganache-cupcakes"
}
