{
    "directions": [
        "Bring a large saucepan of water to a boil. Reduce heat to medium-low; season lightly with salt. When water is at a gentle simmer, add shrimp. Poach until just opaque in the center, 2-4 minutes. Drain; transfer shrimp to a medium bowl of ice water to cool. Drain; wipe out bowl.",
        "Whisk mayonnaise, celery, chives, oil, lemon juice, and horseradish in a medium bowl to blend; season to taste with salt and pepper. Chop shrimp into small pieces (about 1/3\"); add to bowl with mayonnaise mixture. Stir to coat. DO AHEAD: Shrimp salad can be made 1 day ahead. Cover and chill.",
        "Preheat oven to 375°F. Using a small serrated knife, make a 1/2\"-deep cut across the top of each dinner roll and gently pry open roll with your fingers to create a mini New England-style hot dog bun. Lightly brush inside of rolls with butter; place on a rimmed baking sheet. Toast until light golden, about 8 minutes. Let cool slightly.",
        "Divide shrimp mixture among rolls, pressing into cut across top; garnish with celery leaves or crushed potato chips."
    ],
    "ingredients": [
        "Kosher salt",
        "1 pound medium shrimp, shelled, deveined",
        "1/4 cup plus 1 tablespoons mayonnaise",
        "1 small celery stalk, peeled, finely chopped (about 3 tablespoons)",
        "1 tablespoon finely chopped fresh chives",
        "1 tablespoon grapeseed oil",
        "2 teaspoons fresh lemon juice",
        "2 teaspoons prepared horseradish",
        "Freshly ground black pepper",
        "24 mini soft dinner rolls (each about 1 1/2 x 1 1/2\"; such as Martin's potato rolls or King's Hawaiian)",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "1/2 cup celery leaves or crushed potato chips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Cocktail Party",
        "Thanksgiving",
        "High Fiber",
        "New Year's Eve",
        "Mayonnaise",
        "Shrimp",
        "Shower",
        "Party",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mini Shrimp Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/mini-shrimp-rolls-51117280"
}
