{
    "directions": [
        "Mix pork, veal, 1 tablespoon parsley, half of garlic, egg, bread, 1 1/4 teaspoons salt, and 1/2 teaspoon pepper in medium bowl to blend. Shape meat mixture into 1-inch balls. Dust meatballs with flour. Set aside.",
        "Heat oil in heavy large skillet over medium-high heat. Add meatballs and sauté until browned on all sides, about 10 minutes. Using slotted spoon, transfer meatballs to plate. Add onion to skillet; reduce heat to medium and sauté until tender, about 2 minutes. Stir in paprika, then 1 cup broth and wine. Return meatballs with any accumulated juices to skillet. Bring to simmer. Cover and cook until meatballs are tender, about 25 minutes. Uncover; add 2 tablespoons parsley, remaining garlic, and saffron. Simmer until sauce thickens, turning meatballs occasionally, about 10 minutes. Season sauce to taste with salt and pepper. (Can be made 1 day ahead. Cool slightly, then cover and refrigerate. Bring to simmer, thinning with broth if necessary.)",
        "Place meatballs with sauce on platter. Top with 1 tablespoon parsley."
    ],
    "ingredients": [
        "8 ounces ground pork",
        "8 ounces ground veal",
        "4 tablespoons chopped fresh Italian parsley",
        "2 garlic cloves, minced",
        "1 large egg, beaten to blend",
        "1 1/2-inch-thick slice French bread, crust removed, soaked in water 3 minutes and squeezed dry",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon ground black pepper",
        "All purpose flour",
        "1/4 cup extra-virgin olive oil",
        "1/4 cup chopped onion",
        "1/2 teaspoon Hungarian sweet paprika",
        "1 cup (or more) low-salt chicken broth",
        "1/4 cup dry white wine",
        "1/4 teaspoon crumbled saffron threads"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Sauté",
        "Veal",
        "Saffron",
        "White Wine",
        "Fall"
    ],
    "title": "Mini Meatballs in Saffron Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/mini-meatballs-in-saffron-sauce-107129"
}
