{
    "directions": [
        "Place an oven rack in the center of the oven. Preheat the oven to 400 degrees F. Spray a 12-count mini-muffin pan with vegetable oil cooking spray. Set aside.",
        "For the pot pie filling: Melt the butter in a 1-quart saucepan over medium-low heat. Add the flour and whisk until smooth, 1 to 2 minutes. Gradually add the milk, whisking constantly to prevent lumps. Simmer over medium-low heat, whisking constantly, until the sauce is thick and smooth, about 6 minutes. Remove the pan from the heat and stir in the salt, pepper, Parmesan, chicken and broccoli.",
        "For assembly: On a lightly-floured work surface, roll out the dough 1/8-inch thick. Using the 3-inch round cookie cutter, cut out 12 pieces of dough. Using the 2-inch round cookie cutter, cut out another 12 pieces of dough. Press the large rounds of dough into the bottom of the prepared pan. Spoon the sauce into the pastry.",
        "Combine the egg and 1 teaspoon water in a small bowl, using a fork. Brush the edges of the pastry with the egg mixture and place the remaining pieces of dough on top. Lightly press the edges of the dough together to seal. Press around the edges of the pies using the tines of a fork. Brush the tops of each pie with the beaten egg. Cut a 1/2-inch-long slit into the top of the pies using a paring knife. Bake until the tops are golden and the filling is bubbling, 15 to 18 minutes. Cool for 10 minutes and serve."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter, at room temperature",
        "Vegetable oil cooking spray",
        "2 tablespoons all-purpose flour",
        "3/4 cup whole milk, at room temperature",
        "1 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 cup grated Parmesan",
        "1 small store-bought rotisserie chicken breast, chopped into 1/4-inch pieces (about 3/4 cup meat)",
        "1 cup broccoli florets, cut into 1/4 to 1/2-inch pieces, steamed (about 2 ounces)",
        "All-purpose flour, for dusting",
        "Two 10-inch round unfold-and-bake frozen pie crusts, thawed",
        "1 large egg"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Appetizer",
        "Appetizer",
        "Pot Pie Recipes",
        "Broccoli",
        "Vegetable"
    ],
    "title": "Mini Chicken and Broccoli Pot Pies",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/mini-chicken-and-broccoli-pot-pies-recipe"
}
