{
    "directions": [
        "Pizza dough: Mix all the ingredients together in a large bowl and knead the dough for 5 minutes. Let it rest for 1 hour. Divide the dough into 4 equally sized balls. Let balls rest for 30 minutes, then flatten each with a rolling pin and place on an oven tray.",
        "Leek Fondue with Maille(R) Honey Dijon mustard: Slice the leek as thinly as possible and wash it. Melt the butter in a sauce pan then add the sliced leek. Cook the leek gently for 10 minutes. Add the whipping cream and the Maille(R) Honey Dijon mustard. Cook gently for 5 minutes. Once cooked add the whisky. Season with salt and freshly ground pepper, then chill.",
        "Vegetables: Boil potatoes until tender. Peel and cut the potatoes in thin slices. Sprinkle on Parmesan cheese. Slice the cherry tomatoes in half.",
        "Assembly: Cover the flattened pizza dough with the Maille(R) Honey Dijon mustard leek fondue. Top with the slices of potatoes and sliced cherry tomatoes. Cook the pizzas at 430 degrees F for 8 minutes. Top with a few leaves of arugula and a splash of balsamic vinegar. Serve hot."
    ],
    "ingredients": [
        "Pizza dough:",
        "1 1/2 cups all-purpose flour",
        "3/4 cup slightly warm water",
        "1 1/2 tablespoons olive oil",
        "1 tablespoon salt",
        "1/4 ounce active dry yeast",
        "Leek Fondue with Maille® Honey Dijon mustard:",
        "1 leek (white part only)",
        "1 1/2 tablespoons butter",
        "2 tablespoons Maille® Honey Dijon mustard",
        "1 cup whipping cream",
        "1 tablespoon whisky",
        "Salt and fresh ground pepper",
        "Vegetables:",
        "2 potatoes",
        "8 red cherry tomatoes",
        "1 cup Parmesan cheese",
        "Handful of arugula leaves",
        "Balsamic vinegar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mini Veggie Pizza with Maille® Honey Dijon Mustard",
    "url": "http://allrecipes.com/recipe/229532/mini-veggie-pizza-with-maille-hone/"
}
