{
    "directions": [
        "Line rimmed baking sheet with parchment paper. Place pie crust on floured work surface. Using 1 1/2- to 1 3/4-inch cookie cutter or biscuit cutter dipped in flour, cut out 24 rounds; transfer to prepared sheet, spacing 1/2 inch apart. Place in freezer until dough is firm, about 30 minutes. DO AHEAD: Can be made 1 day ahead. Cover; keep frozen.",
        "Toss zucchini with 1 teaspoon salt in medium bowl. Let stand 15 minutes. Drain and pat dry. Place zucchini in another medium bowl; toss with 2 tablespoons olive oil and thyme. Sprinkle zucchini with pepper.",
        "Preheat oven to 400°F. Spread goat cheese generously over each frozen dough round. Fold 3 to 4 zucchini slices in half and place in concentric circle atop 1 dough round, creating flower-like pattern. Repeat with remaining zucchini and dough (reserve any remaining zucchini for another use). Sprinkle with Parmesan. Bake until crusts are light golden, about 20 minutes. Transfer to platter. Drizzle lightly with additional olive oil. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 refrigerated pie crust (half of 15-ounce package)",
        "2 1/2 pounds 1-inch-diameter zucchini, cut into 1/16- to 1/8-inch-thick rounds",
        "1 teaspoon salt",
        "2 tablespoons extra-virgin olive oil plus additional for drizzling",
        "2 teaspoons chopped fresh lemon thyme or regular thyme",
        "3 ounces soft fresh goat cheese, room temperature",
        "1/4 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Bake",
        "Sauté",
        "Cocktail Party",
        "Fourth of July",
        "Picnic",
        "Vegetarian",
        "Quick & Easy",
        "High Fiber",
        "Father's Day",
        "Dinner",
        "Goat Cheese",
        "Parmesan",
        "Zucchini",
        "Summer",
        "Party",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mini Zucchini and Goat Cheese Tarts",
    "url": "http://www.epicurious.com/recipes/food/views/mini-zucchini-and-goat-cheese-tarts-242506"
}
