{
    "directions": [
        "For the cakes: Preheat the oven to 350 degrees F.",
        "Chop 6 of the maraschino cherries and toss with a small amount of flour to coat in a small bowl. Set aside.",
        "In a large bowl, stir together the flour, sugar and salt and set aside. In another bowl, mix the buttermilk, cherry syrup, baking soda, vanilla and egg with a fork and set aside.",
        "Bring 1 cup water to a boil in a small pan. Meanwhile, in a medium saucepan, melt the butter over medium heat; add the cocoa and whisk to combine. Add the boiling water to the cocoa mixture and allow to bubble for a moment, then turn off the heat.",
        "Pour the cocoa mixture into the flour mixture. Stir together for a moment to cool the chocolate, then pour in the egg mixture. Mix in the flour-coated cherries.",
        "Divide the batter among the cavities of a 6-cavity nonstick mini Bundt pan and bake until an inserted cake tester comes out clean, 20 to 25 minutes. Let the cakes cool in the pan briefly before removing them to a cooling rack placed over a baking sheet.",
        "For the chocolate ganache: Heat the cream in a small saucepan until very hot, then add the vanilla. Pour the hot cream over the chocolate in a heatproof bowl; stir completely to melt the chocolate.",
        "Pour the ganache over the cakes. Chop the remaining 6 cherries and sprinkle them over the top. Allow the ganache to set before serving."
    ],
    "ingredients": [
        "12 maraschino cherries",
        "1 cup all-purpose flour, plus more for coating the cherries",
        "1 cup sugar",
        "1/8 teaspoon kosher salt",
        "1/4 cup buttermilk",
        "2 tablespoons cherry syrup",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon vanilla extract",
        "1 large egg",
        "1 stick (8 tablespoons) salted butter",
        "2 heaping tablespoons cocoa powder",
        "1 cup heavy cream",
        "1 teaspoon vanilla extract",
        "8 ounces semisweet chocolate, broken into pieces"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Bundt Cake",
        "Cake",
        "Cherry",
        "Fruit",
        "Chocolate"
    ],
    "title": "Mini Chocolate-Cherry Bundt Cakes",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/mini-chocolate-cherry-bundt-cakes"
}
