{
    "directions": [
        "Preheat oven to 350°F. Butter a 9-inch square cake pan and line bottom with parchment or wax paper. Butter paper and dust pan with flour, knocking out excess.",
        "Whisk together yolks, 1/2 cup sugar, milk, and extract in a large bowl until combined well, then whisk in flour and salt.",
        "Beat whites with an electric mixer at high speed until they just hold soft peaks. Gradually add remaining 1/4 cup sugar, mixing at low speed until whites just hold stiff peaks. Stir about one third of whites into batter to lighten, then fold in remaining whites gently but thoroughly.",
        "Pour batter into cake pan, spreading evenly, and bake in middle of oven until pale golden and a tester comes out clean, 14 to 16 minutes. Cool cake completely in pan on a rack.",
        "Whisk together powdered egg whites and warm water in a small bowl until combined well. Put superfine sugar in another small bowl.",
        "Holding 1 cherry by stem, brush evenly with some egg white and spoon sugar over it to coat. Transfer to a rack to dry and coat remaining cherries in same manner.",
        "Beat cream with kirsch and sugar using cleaned beaters until it holds stiff peaks.",
        "Cut out 20 rounds from cake with cookie cutter and transfer to a platter. Top each round with a teaspoon of kirsch cream, then top cream with a cherry."
    ],
    "ingredients": [
        "4 large egg yolks",
        "3/4 cup granulated sugar",
        "2 tablespoons milk",
        "1/2 teaspoon almond extract",
        "1/2 cup all-purpose flour",
        "1/4 teaspoon salt",
        "2 large egg whites",
        "4 teaspoons powdered egg whites",
        "1/4 cup warm water",
        "3/4 cup superfine granulated sugar",
        "20 sweet cherries with stems attached",
        "1/2 cup chilled heavy cream",
        "1 tablespoon kirsch",
        "1 teaspoon granulated sugar",
        "Special equipment: a 1- to 1 1/2-inch round cookie cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit",
        "Dessert",
        "Bake",
        "Cherry",
        "Almond",
        "Kirsch",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Miniature Almond Cakes with Sugared Cherries and Kirsch Cream",
    "url": "http://www.epicurious.com/recipes/food/views/miniature-almond-cakes-with-sugared-cherries-and-kirsch-cream-105129"
}
