{
    "directions": [
        "In a bowl whisk together the sugar, the cornstarch, the whole egg, and the yolk until the mixture is combined well and add the milk, scalded, in a stream, whisking. In a saucepan bring the mixture to a boil over moderate heat, whisking, boil it, whisking, for 2 minutes, and stir in the unsweetened chocolate, stirring until the custard is smooth. Let the custard cool, its surface covered with plastic wrap, and chill it until it is cold. Stir in the cream and freeze the custard in an ice-cream freezer according to the manufacturer's instructions until it is almost firm. Transfer the ice cream to a metal bowl and freeze it until it is firm but not solid.",
        "Scoop out 1 portion with a 1 1/2-inch ice-cream scoop and level it with a knife. Press a cherry half into the center of the scoop and turn out the scoop into an ice-cube tray without the divider or a metal pan, turning it flat side up. Make 11 more cherry-filled scoops in the same manner, turning them out into 2 more ice-cube trays. Smooth the ice cream remaining in the bowl and freeze it and the prepared ice-cream scoops until the ice cream is firm but not solid. Working with 1 tray of scoops at a time, scoop out 1 portion of the ice cream from the bowl with the scoop, leveling it as before, and press the leveled side against the leveled side of 1 of the cherry-filled scoops. Smooth the edges of the scoops to form a smooth ball and transfer the ball to the tray. Working quickly, make 11 more balls with the remaining ice cream in the same manner and freeze them until they are firm but not solid.",
        "In a bowl combine well the almonds and the bittersweet chocolate, roll the ice cream balls in the mixture, pressing the coating gently to make it adhere, and transfer the confections to the foil cups. The confections may be made 5 days in advance and kept covered and frozen."
    ],
    "ingredients": [
        "1/2 cup sugar",
        "1 1/2 teaspoons cornstarch",
        "1 large whole egg",
        "1 large egg yolk",
        "3/4 cup milk",
        "3 ounces unsweetened chocolate, chopped fine",
        "1 cup well-chilled heavy cream",
        "6 glacéed cherries, halved",
        "1/3 cup blanched almonds, chopped coarse, toasted lightly, and cooled",
        "half of a 3-ounce fine-quality bittersweet chocolate bar, shaved with a vegetable peeler",
        "twelve 1 1/2-inch foil cups"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Chocolate",
        "Dessert",
        "Freeze/Chill",
        "Kid-Friendly",
        "Frozen Dessert",
        "Cherry",
        "Almond",
        "Gourmet"
    ],
    "title": "Miniature Tartufi",
    "url": "http://www.epicurious.com/recipes/food/views/miniature-tartufi-10367"
}
