{
    "directions": [
        "Preheat the oven to 375 degrees F.",
        "Place the potatoes on a rimmed baking sheet and toss with the olive oil and sprinkle with 3/4 teaspoon salt. Bake until a knife inserted into the potatoes goes in with little to no resistance, about 1 hour. Allow to cool slightly.",
        "In a medium skillet, cook the bacon over medium-low heat until the fat is rendered and the bacon is crispy, about 10 minutes. Drain well and place half of the bacon into a bowl. Add the panko, 2 tablespoons chives and 2 tablespoons Parmesan. Mix to combine and set aside.",
        "In another bowl, combine the sour cream, butter, heavy cream, the remaining bacon, 1/4 cup Parmesan, 2 tablespoons chives and 1/4 teaspoon salt. Set aside.",
        "When the potatoes are cool enough to handle but still warm, cut off the top third of each potato. Remove the skin from the tops. Using a 1 teaspoon measure or a melon baller, scoop out some of the insides of the cooked potatoes, leaving 1/4-inch borders around the edges. This creates little boats. Place the scooped insides and the peeled tops of the potatoes in a medium bowl and mash using a potato masher or the back of a fork. Add the reserved bacon and sour cream mixture. Using a rubber spatula, mix together the filling until well combine. Spoon the filling back into the potato boats until slightly overfilled and mounded on top. Top with a sprinkling of the panko mixture and a drizzle of olive oil. Bake until the filling is heated through and the topping is golden brown, 10 to 12 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 pounds medium Yukon gold potatoes (12 to 14 potatoes)",
        "2 tablespoons extra-virgin olive oil, plus more for drizzling",
        "1 teaspoon kosher salt",
        "6 ounces bacon, chopped fine",
        "1/3 cup panko breadcrumbs",
        "1/4 cup chopped fresh chives",
        "1/4 cup freshly grated Parmesan, plus 2 tablespoons",
        "1/4 cup sour cream, at room temperature",
        "2 tablespoons unsalted butter, melted",
        "1 tablespoon heavy cream, at room temperature"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baked Potato",
        "Potato",
        "Vegetable",
        "Bacon Recipes",
        "Meat",
        "Cheese",
        "Parmesan Cheese Recipes"
    ],
    "title": "Mini Twice-Baked Potatoes",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/mini-twice-baked-potatoes"
}
