{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). (If using a countertop induction oven, preheat on the \"Combo 3\" setting).",
        "Cook bacon in a large skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; crumble into small pieces.",
        "Toss potatoes with vegetable oil to coat; season with salt and pepper. Spread potatoes on a baking sheet.",
        "Bake potatoes in the preheated oven until tender, about 30 minutes in the conventional oven and 20 minutes in the countertop induction oven. Cool potatoes until easily handled, about 5 minutes.",
        "Slice off the top 1/4 of each potato lengthwise. Scoop flesh into a bowl using a melon baller or small spoon, leaving about 1/8 inch of flesh on the skin.",
        "Mash melted butter and mascarpone cheese into the potato flesh in the bowl. Beat with a hand mixer until fluffy, about 30 seconds. Stir in bacon, green onions, and Cheddar cheese. Fill potato skins with potato mixture; return to the baking sheet.",
        "Bake filled potatoes in the preheated oven until warmed through, about 5 minutes. Turn on the oven's broiler; broil potatoes until cheese is bubbly and browned, 3 to 4 minutes. Remove from the oven.",
        "Season shrimp with Creole seasoning; transfer to a grill pan.",
        "Grill shrimp over high heat until opaque, about 3 minutes. (If using a countertop induction oven, cook shrimp on the \"Grill setting\" until opaque, about 3 minutes.) Top each potato with 1 shrimp."
    ],
    "ingredients": [
        "6 slices bacon",
        "1 1/2 pounds baby potatoes",
        "1 tablespoon vegetable oil",
        "salt and ground black pepper to taste",
        "3 tablespoons butter, melted",
        "3 tablespoons mascarpone cheese",
        "3 green onions, finely chopped",
        "3 tablespoons shredded Cheddar cheese",
        "1/2 pound shrimp, peeled and deveined",
        "1 pinch Creole seasoning, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mini Twice-Baked Potatoes",
    "url": "http://allrecipes.com/recipe/256376/mini-twice-baked-potatoes/"
}
