{
    "directions": [
        "In a deep pot over medium heat add oil, chopped carrots, celery and onions and bay leaves. Season with salt and pepper. Cover pot and cook veggies 5 or 6 minutes, stirring occasionally.",
        "While the veggies cook, combine meat, egg, garlic, grated cheese, bread crumbs, salt, pepper, nutmeg.",
        "Uncover your soup pot and add broth and water to the pot. Increase heat to high and bring soup to a boil. When soup boils, reduce heat a bit and start to roll meat mixture into small balls, dropping them straight into the pot. You are making meat dumplings that will cook in the broth. When you are done rolling the meat, add pasta to the soup and stir. Cover and simmer soup 10 minutes. When pasta is tender, stir in chopped spinach in batches. When spinach has wilted into the soup, the soup is done and ready to serve. Adjust your seasonings. Serve soup with crusty bread or grilled 4 cheese sandwiches.",
        "In a small skillet over medium low heat, combine oil, butter and garlic. Cook garlic in butter and oil gently for 2 or 3 minutes. Remove garlic butter mixture from heat.",
        "Place a large nonstick skillet on the stove over medium high heat. Using a pastry brush, brush 1 side of 4 slices of bread with garlic oil and place buttered side down in skillet. Top each slice with equal amounts of the 4 cheeses, distributing them equally over the 4 slices. Top each sandwich with another slice of bread brushed with garlic butter, buttered side up. Flip the grill cheese sandwiches a few times until cheeses are melted and gooey and bread is toasty and golden. Cut grilled 4 cheese sandwiches from corner to corner and serve."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil, 2 turns of the pan in a slow stream",
        "2 carrots, peeled and chopped",
        "2 ribs celery, chopped",
        "1 medium onion, chopped",
        "2 bay leaves, fresh or dried",
        "Salt and freshly ground black pepper",
        "1 pound ground beef, pork and veal combined",
        "1 egg, beaten",
        "2 cloves garlic, minced",
        "1/2 cup grated Parmigiano-Reggiano or Romano, a couple of handfuls",
        "1/2 cup plain bread crumbs, a couple of handfuls",
        "1/2 teaspoon freshly grated or ground nutmeg",
        "6 cups chicken stock or broth",
        "2 cups water",
        "1 1/2 cups dried pasta, rings, broken fettuccini or ditalini",
        "1 pound triple washed fresh spinach, coarsely chopped",
        "Grilled 4 Cheese Sandwiches, recipe follows*",
        "Recipe courtesy Rachael Ray",
        "2 tablespoons extra-virgin olive oil, 2 turns of the pan",
        "3 tablespoons butter",
        "1 clove garlic, cracked away from skin",
        "8 slices crusty Italian semolina bread",
        "1 cup shredded provolone",
        "1 cup shredded mozzarella",
        "1/2 cup grated Parmesan or Romano",
        "1 cup shredded Asiago"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Meatballs",
        "Soup",
        "Pasta Recipes",
        "Spinach",
        "Vegetable",
        "Cheese",
        "Mozzarella Recipes",
        "Meat",
        "Pork",
        "Provolone Recipes",
        "Carrot Recipes",
        "Veal",
        "Celery",
        "Beef"
    ],
    "title": "Mini Meatball Soup",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/mini-meatball-soup-recipe"
}
