{
    "directions": [
        "Preheat the oven to 375° F.",
        "In a medium sauté pan place 1 1/2 tablespoons of the olive oil, and heat for a minute over medium heat. Add the onion, carrot, and celery, and sauté the vegetables until they are softened, about 5 to 7 minutes. Add the lentils and bay leaf and sauté for 3 minutes, coating all the lentils. Increase the heat and add the red wine. Bring to a simmer and cook uncovered, stirring, until the mixture becomes dry. Meanwhile, in a saucepan bring the chicken stock to a simmer, then turn off the heat and cover to keep warm. Add the warm chicken stock to the lentils (like cooking risotto) 1/2 a cup at a time, letting the lentils absorb the liquid with each addition. Repeat, stirring the mixture constantly. After 28 to 30 minutes the lentils should be slightly chewy and tender. Season to taste with salt and pepper.",
        "While the lentils are cooking, rinse and pat the lamb dry and rub it with a tablespoon of olive oil. Season the meat with salt and pepper, then press the rosemary into the flesh.",
        "Place the lamb in a small roasting pan in the middle of the oven, and roast for 30 to 35 minutes, or until the thermometer inserted in the thickest part of the meat registers 140° F.",
        "While both the lentils and the meat are cooking, prepare the spinach. In a medium sauté pan, heat the remaining 1 tablespoon of olive oil for a minute over medium heat. Add the garlic and sauté until just translucent but not brown. Add the spinach and sauté for 2 minutes, then cover and cook for an additional 2 minutes, or until completely wilted. Season with salt and pepper.",
        "Slice the rack in half. On two large dinner plates, arrange a bed of lentils and a side of spinach, then place the lamb on top of the lentils and serve."
    ],
    "ingredients": [
        "3 1/2 tablespoons olive oil",
        "1/2 yellow onion, finely chopped",
        "1/2 medium carrot, finely chopped",
        "1/2 stalk celery, tough fibers removed and finely chopped",
        "1 cup Beluga lentils (or French green lentils)",
        "1 bay leaf",
        "1 cup red wine",
        "2 cups chicken stock",
        "Sea salt and pepper",
        "1-pound (4-rib) Frenched rack of lamb, trimmed of all but a thin layer of fat",
        "1 tablespoon finely chopped fresh rosemary",
        "3 large cloves garlic, sliced",
        "4 cups washed and torn spinach"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Lamb",
        "Vegetable",
        "Roast",
        "Sauté",
        "Easter",
        "Valentine's Day",
        "Mother's Day",
        "Dinner",
        "Meat",
        "Rack of Lamb",
        "Spinach",
        "Legume",
        "Lentil",
        "Spring",
        "Winter",
        "Anniversary"
    ],
    "title": "Mini Rack of Lamb with Nutty Beluga Lentils and Sautéed Garlic Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/mini-rack-of-lamb-with-nutty-beluga-lentils-and-sauteed-garlic-spinach-351789"
}
