{
    "directions": [
        "Melt butter and honey in a small saucepan over medium heat or in a microwave-safe bowl. Pulse graham crackers in a food processor until fine crumbs form. With the motor running, drizzle in butter-honey mixture and process until well combined. Transfer mixture to a medium bowl; set aside.",
        "Using an electric mixer on high speed, beat cream cheese in a large bowl until creamy, about 3 minutes. Add condensed milk and beat until smooth. Add key lime juice and lemon juice and beat to combine. Beat in 2 Tbsp. key lime zest.",
        "Using a whisk or electric mixer on medium-high speed, whip cream in another medium bowl to very soft peaks. Sprinkle powdered sugar over cream and continue to whip until it holds stiff peaks. Gently fold 1/2 cup cream into key lime mixture; cover remaining cream and chill.",
        "Line muffin pan with paper liners. Pour key lime mixture into a pastry bag or plastic bag with the corner snipped off and pipe batter evenly into tins. Top each with 1 1/2 Tbsp. cracker crumb mixture, breaking up crumbs to completely cover, then press down gently to adhere. Freeze until set, at least 3 hours.",
        "Remove pies from molds, turn upside down, and remove paper liners. Spread reserved cream over pies and top with remaining 1 Tbsp. key lime zest.",
        "Pies (without topping) can be made 2 weeks ahead; cover and freeze."
    ],
    "ingredients": [
        "5 tablespoons unsalted butter",
        "1 tablespoon honey",
        "1 cup graham cracker crumbs (from about 8 crackers)",
        "1 (8-ounce) package cream cheese, softened",
        "1 (14-ounce) can sweetened condensed milk",
        "3 tablespoons finely grated key lime zest, divided",
        "1/3 cup fresh key lime juice",
        "2 tablespoons fresh lemon juice",
        "3/4 cup chilled heavy cream",
        "2 tablespoons powdered sugar",
        "A standard 12-cup muffin pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Frozen Dessert",
        "Lime",
        "Lime Juice",
        "Pie",
        "Cream Cheese",
        "Milk/Cream",
        "Summer",
        "Freeze/Chill",
        "Muffin",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mini Frozen Key Lime Pies",
    "url": "http://www.epicurious.com/recipes/food/views/mini-frozen-key-lime-pies"
}
