{
    "directions": [
        "Sandwich 2 1/2 tablespoons ice milk between 2 snaps, pressing snaps together gently, and put sandwich on a tray in a freezer. Form 11 more sandwiches in same manner and freeze on tray, covered, until hard. Ice-milk sandwiches may be made 1 week ahead and kept frozen, individually wrapped in plastic wrap.",
        "In a saucepan whisk together sugar and cornstarch and whisk in milk. Bring mixture to a boil over moderate heat, stirring frequently, and boil, stirring constantly, 1 minute. Remove pan from heat.",
        "In a small bowl stir about one fourth milk mixture into yolks and pour into remaining milk mixture, whisking constantly. Cook mixture over low heat, stirring constantly, until slightly thickened and a thermometer registers 160°F. (Do not boil mixture or it will curdle.) Stir in crème de menthe and transfer mixture to a bowl. Chill mixture about 1 hour, or until cool.",
        "In a small heavy saucepan melt chocolate over low heat, stirring occasionally and cool slightly. Put chocolate in a small sealable plastic bag and seal bag, pressing out excess air. Squeeze chocolate to one corner of bag and snip off 1/8 inch from corner to form a makeshift pastry bag. Freeze milk mixture in an ice-cream maker and with motor running add chocolate in a thin stream during last few minutes of freezing time. Makes 3 1/2 cups ice milk.",
        "In a bowl whisk together flour, sugar, cocoa powder, baking powder, and salt and with fingers blend in butter until incorporated. Stir in egg until mixture is combined well. Cover dough in bowl and chill until firm, about 1 hour.",
        "Preheat oven to 400°F. and lightly grease a large baking sheet.",
        "Spoon level tablespoons of dough onto a sheet of wax paper and cut each in half. With floured hands roll each piece of dough into a ball and arrange, evenly spaced, on baking sheet. Flatten each ball with floured metal spatula into a disk about 2 inches in diameter and bake in middle of oven 7 to 8 minutes, or until cookies are set but not hard. Cool cookies on racks. (Cookies will continue to crisp as they cool.) Makes about 26 cocoa snaps."
    ],
    "ingredients": [
        "about 2 cups mint chocolate chip ice milk, softened lightly",
        "1/2 cup sugar",
        "1 tablespoon cornstarch",
        "2 1/3 cups low-fat (1%) milk",
        "2 large egg yolks, beaten lightly",
        "1 tablespoon green or white crème de menthe",
        "1 ounce fine-quality bittersweet chocolate (not unsweetened), chopped",
        "24 cocoa snaps",
        "1/2 cup all-purpose flour",
        "1/2 cup sugar",
        "1/4 cup unsweetened cocoa powder",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt",
        "2 tablespoons unsalted butter, softened",
        "1 large egg, beaten lightly"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Chocolate",
        "Dessert",
        "Bake",
        "Low Sodium",
        "Frozen Dessert",
        "Mint",
        "Chartreuse",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mint Chocolate Chip Ice-Milk Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/mint-chocolate-chip-ice-milk-sandwiches-12449"
}
