{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Lightly spray 12 muffin cups.",
        "Heat butter and chocolate together in a small saucepan over low heat until melted, about 5 minutes. Remove from heat; set aside to cool slightly, about 5 minutes.",
        "Combine 1 cup plus 2 tablespoons flour, baking soda, and salt together in a small bowl.",
        "Mix milk, vinegar, and peppermint extract together in another small bowl.",
        "Beat sugar and eggs together in large bowl with an electric mixer on medium speed until pale, about 3 minutes. Add melted chocolate and beat well to combine. Pour in 1/2 cup boiling water and beat until batter is well-blended. Add flour mixture; beat on low speed until incorporated. Add milk mixture and blend well. Fill muffin cups 3/4-full with batter.",
        "Bake in the preheated oven until a toothpick inserted into a cupcake comes out clean, 25 to 30 minutes. Transfer cupcakes to wire rack and cool to room temperature, about 45 minutes.",
        "Combine 2 tablespoons cold water and gelatin in a small saucepan over low heat. Stir constantly until gelatin dissolves, about 5 minutes. Remove from heat and let cool slightly, but not until set, about 5 minutes.",
        "Combine 1 cup plus 3 tablespoons heavy cream, 1/4 cup plus 2 teaspoons confectioners' sugar, vanilla extract, and green food coloring in a large bowl. Whip with an electric mixer on low speed until slightly thickened, about 5 minutes. Beat in dissolved gelatin slowly. Increase speed to high and beat until frosting is stiff, about 3 minutes.",
        "Spread frosting over cooled cupcakes. Remove and discard cream filling from chocolate sandwich cookies; crush cookies. Scatter cookie crumbs over cupcakes."
    ],
    "ingredients": [
        "Cupcakes:",
        "cooking spray",
        "1/4 cup unsalted butter",
        "2 (1 ounce) squares semisweet chocolate",
        "1 cup all-purpose flour",
        "2 tablespoons all-purpose flour",
        "3/4 teaspoon baking soda",
        "1/8 teaspoon salt",
        "2 tablespoons milk",
        "1/2 teaspoon distilled white vinegar",
        "1/2 drop pure peppermint extract",
        "1 cup white sugar",
        "1 egg",
        "1/2 cup boiling water",
        "Whipped Cream Frosting:",
        "2 tablespoons cold water, or more as needed",
        "1 (.25 ounce) package unflavored gelatin",
        "1 cup heavy whipping cream",
        "3 tablespoons heavy whipping cream",
        "1/4 cup confectioners' sugar",
        "2 teaspoons confectioners' sugar",
        "1/2 teaspoon imitation vanilla extract",
        "1 drop green food coloring",
        "6 chocolate sandwich cookies (such as Oreo®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mint Devil's Food Cupcakes",
    "url": "http://allrecipes.com/recipe/245742/mint-devils-food-cupcakes/"
}
