{
    "directions": [
        "In a stove-top teapot, add the tea leaves and cover with the 3 tablespoons of water. Bring to a quick boil and immediately pour off the water, being carefully that no tea leaves escape. (This gets rid of the some of the bitterness, and allows the tea to seep longer with mint.)",
        "Add the sugar to the wet grounds and cover with the remaining 3 cups of water. Over medium heat, with the lid open or off, bring to a boil.",
        "Pour half of the liquid into a bowl or Pyrex measuring cup; reserve. Stuff the mint into the teapot, pressing it against the bottom of the pot with a spoon to gently and slightly crush the leaves. Return the reserved liquid to the teapot.",
        "Simmer over low heat for a few minutes to let the mint infuse. Pour a glassful into a clear drinking glass and then back into the pot, from as high as possible without spilling to aerate the tea and blend the flavors. Repeat this two or three more times, as the color of tea changes from clear to a cloudy caramel.",
        "Begin tasting for sweetness and flavor. Add more sugar if desired, or let it simmer another few minutes to make it stronger. Continue to pour glassfuls in and out of the pot until satisfied with both the sweetness and strength of the tea.",
        "Serve in small clear tea glasses. Do not pour tea into them from the teapot, but from the glass used for mixing and testing (this will help trap any sediment).",
        "If adding pine nuts, sprinkle into the glasses of tea before serving."
    ],
    "ingredients": [
        "1 tablespoon loose-leaf gunpowder green tea",
        "3 cups plus 3 tablespoons cool water",
        "1/4 to 1/2 cup sugar",
        "1 large handful of fresh mint, rinsed and picked over",
        "4 tablespoons pine nuts, dry roasted (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tea",
        "Non-Alcoholic",
        "Ramadan",
        "Mint",
        "Simmer",
        "Boil",
        "Drink"
    ],
    "title": "Mint Tea",
    "url": "http://www.epicurious.com/recipes/food/views/mint-tea-51173820"
}
