{
    "directions": [
        "In a large saucepan cover beets with salted water by 1 inch and simmer, covered, until tender, about 35 mintues. Drain beets in a colander and cool until they can be handled. Slip off and discard skins and stems. Beets may be prepared up to this point 3 days ahead and chilled, covered.",
        "In a very small saucepan simmer sauce ingredients, stirring occasionally, until reduced to about 1/4 cup. Remove pan from heat and let sauce stand, covered, 15 minutes. Pour sauce through a fine sieve into a small bowl and cool. Sauce may be made 3 days ahead and chilled, covered. Bring sauce to room temperature before serving.",
        "In a bowl whisk together flour, mint, and salt and add water, whisking until combined (batter will be lumpy).",
        "Cut beets into 1/4-inch-thick slices. In a deep 9-inch skillet heat oil over moderately high heat until 375°F. on a deep-fat thermometer. Working in batches, dip beet slices in batter and fry, without crowding, until golden and crisp, about 1 minute on each side, making sure oil returns to 375°F. before adding next batch. Transfer beets as fried to paper towels and drain. Beets may be made 2 hours ahead and reheated on a baking sheet in a 425°F. oven 10 minutes.",
        "Serve beets with sauce on the side for dipping."
    ],
    "ingredients": [
        "4 medium beets (about 1 1/2 pounds total), scrubbed and trimmed, leaving about 1 inch of stems attached",
        "1/2 cup balsamic vinegar",
        "3 tablespoons finely chopped fresh mint leaves (wash and dry before chopping)",
        "2 tablespoons sugar",
        "3/4 cup all-purpose flour",
        "1/4 cup finely chopped fresh mint leaves (wash and dry before  chopping)",
        "1/4 teaspoon salt",
        "3/4 cup plus 1 tablespoon water",
        "2 cups vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Side",
        "Fry",
        "Vegetarian",
        "Vinegar",
        "Mint",
        "Beet",
        "Winter",
        "Gourmet",
        "Kidney Friendly",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Minted Fried Beets with Balsamic Vinegar Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/minted-fried-beets-with-balsamic-vinegar-sauce-13616"
}
