{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Line a baking sheet with foil.",
        "Cook mint leaves in a pot of boiling water for about 10 seconds.",
        "Transfer mint leaves to a bowl of ice water; soak for 30 seconds, drain and squeeze dry.",
        "Combine blanched mint with garlic, olive oil, bread crumbs, salt, black pepper, and cayenne pepper in a food processor or blender. Blend for 20 to 30 seconds until fine and crumbly.",
        "Transfer mint mixture to a large bowl; stir in Parmigiano-Reggiano cheese, set aside.",
        "Combine 1/4 cup Dijon mustard and 2 teaspoons honey in a small bowl, set aside.",
        "Combine extra-virgin olive oil, rice vinegar, 2 teaspoons honey, 1 teaspoon Dijon mustard, salt, and black pepper in a jar with a lid. Shake vinaigrette vigorously until combined, about 30 seconds. Set vinaigrette aside.",
        "Slice  1/2 to 1-inch slits between each bone of the lamb racks to assure the meat roasts evenly.",
        "Season each rack with salt and black pepper on all sides.",
        "Heat vegetable oil in skillet over high heat. Brown each lamb rack for 2 to 3 minutes on each side.",
        "Transfer lamb racks to the foil-lined baking sheet.",
        "Brush each rack with mustard and honey mixture. Sprinkle mint mixture over the top and sides of each rack.",
        "Bake in the preheated oven until browned on top and medium rare in the center, about 20 minutes. An instant-read thermometer inserted into the center should read 125 to 130 degrees F (52 to 54 degrees C). Remove from oven and allow lamb to rest for 10 minutes before serving, drizzled with honey mustard vinaigrette."
    ],
    "ingredients": [
        "1 cup fresh mint leaves",
        "2 cloves garlic, sliced",
        "2 tablespoons olive oil",
        "1/2 cup plain bread crumbs",
        "salt and ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "1 1/2 tablespoons finely grated Parmigiano-Reggiano cheese",
        "1/4 cup Dijon mustard",
        "2 teaspoons honey",
        "2 tablespoons extra virgin olive oil",
        "2 teaspoons rice vinegar",
        "2 teaspoons honey",
        "1 teaspoon Dijon mustard",
        "1 pinch salt and freshly ground black pepper to taste",
        "2 (1 1/4 pound) racks of lamb, trimmed",
        "1 teaspoon vegetable oil",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mint Crusted Rack of Lamb",
    "url": "http://allrecipes.com/recipe/221005/mint-crusted-rack-of-lamb/"
}
