{
    "directions": [
        "Heat a dry small heavy skillet over moderate heat until hot and toast coriander seeds, stirring, until fragrant and a little darker, about 2 minutes. With a mortar and pestle or in a spice grinder or cleaned electric coffee grinder, grind coriander to a coarse powder. In a bowl, whisk together coriander and remaining dressing ingredients.Dressing may be made 1 day ahead and chilled, covered",
        "With a Japanese rotary slicer or other thin-slicing device, slice onion crosswise into thin spirals or rings. In a bowl of ice and cold water, soak onion (separate rings if necessary) 15 minutes.",
        "Trim stalks from fennel and with slicing device, thinly slice fennel bulb crosswise.",
        "With a sharp knife, cut a slice from top and bottom of each orange to expose flesh and arrange cut side down on a cutting board. cutting from top to bottom, remove peel and pith. Cut oranges crosswise into 1/4-inch-thick slices.",
        "Drain onion well and pat dry between paper towels.",
        "Arrange fennel, onion and orange decoratively on a platter and scatter with mint. Whisk dressing and drizzle over salad."
    ],
    "ingredients": [
        "1 teaspoon coriander seeds",
        "2 tablespoons fresh orange juice",
        "2 tablespoons Sherry vinegar or red-wine vinegar",
        "3/4 teaspoon salt",
        "3 tablespoons olive oil",
        "1 medium-large red onion",
        "1 large fennel bulb (sometimes called anise, about 1 pound)",
        "3 large navel oranges",
        "1/4 cup loosely packed fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fruit",
        "Onion",
        "Side",
        "Vegetarian",
        "Quick & Easy",
        "Orange",
        "Mint",
        "Fennel",
        "Summer",
        "Healthy",
        "Vegan",
        "Gourmet",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Minted Orange, Fennel and Red Onion Salad",
    "url": "http://www.epicurious.com/recipes/food/views/minted-orange-fennel-and-red-onion-salad-10100"
}
