{
    "directions": [
        "Cut Asian eggplants diagonally into 1/3-inch-thick slices or quarter common eggplants lengthwise and then cut diagonally into 1/3-inch-thick slices. Cut yellow squash diagonally into 1/4-inch-thick slices. Trim radish tops to 1/4 inch and halve large radishes lengthwise.",
        "In a 12-inch non-stick skillet heat 3 tablespoons oil over moderate heat until hot but not smoking and cook half of eggplant until golden on each side. Transfer eggplant to a bowl and cover with foil to keep warm. Cook remaining eggplant with remaining 3 tablespoons oil in same manner and transfer to bowl. In oil remaining in skillet cook garlic, stirring, 30 seconds, and add to bowl with eggplant.",
        "In a steamer set over boiling water steam squash, covered, until crisp-tender, about 2 to 3 minutes. Transfer squash to bowl with eggplant and keep warm. In steamer steam radishes, covered, until crisp-tender but still pink, about 1 to 2 minutes. Transfer radishes to bowl and add parsley and mint. Season vegetables with coarse salt, pepper, and lemon juice and toss to combine."
    ],
    "ingredients": [
        "3 long, thin Asian eggplants (about 3/4 pound total) or 3/4 pound common eggplant",
        "3/4 pound yellow squash (about 2 medium)",
        "2 bunches radishes (about 20)",
        "6 tablespoons extra-virgin olive oil",
        "1 large garlic clove, minced",
        "2 tablespoons chopped fresh flat-leafed parsley leaves (wash and dry before chopping)",
        "1 1/2 tablespoons chopped fresh mint leaves (wash and dry before chopping)",
        "1/2 teaspoon coarse salt",
        "1 teaspoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Steam",
        "Easter",
        "Vegetarian",
        "Mint",
        "Cucumber",
        "Eggplant",
        "Radish",
        "Spring",
        "Yellow Squash",
        "Parsley",
        "Gourmet",
        "Sugar Conscious",
        "Vegan",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Minted Spring Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/minted-spring-vegetables-13703"
}
