{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line a muffin tin with greased liners.",
        "Combine boiling water and cocoa powder in a small bowl; whisk until smooth. Allow to cool, about 10 minutes.",
        "Sift flour, baking soda, baking powder, and salt together in a bowl.",
        "Combine 1/2 cup butter and 1 cup plus 2 tablespoons white sugar in a large bowl; beat together with an electric mixer on medium speed until creamy. Beat in eggs one at a time until smooth. Mix in vanilla extract. Mix in the flour mixture in 3 additions, alternating with the cocoa mixture. Fold peppermint candies into the batter.",
        "Scoop batter into the muffin tin.",
        "Bake in the preheated oven until cupcakes are firm to the touch or a toothpick inserted into the center of a cupcake comes out clean, 15 to 18 minutes. Remove cupcakes from the pan and set on a rack to cool, about 30 minutes.",
        "Combine shortening and 1/2 cup butter in a large bowl. Beat with an electric mixer on medium speed until smooth. Add peppermint extract. Add confectioners' sugar, 1/2 cup at a time, beating thoroughly after each addition. Beat in milk, a tablespoon at a time, until buttercream is desired consistency. Fold in food coloring a little at a time to reach desired shade of green.",
        "Transfer buttercream to a piping bag fitted with a round or star tip. Frost each cupcake with buttercream."
    ],
    "ingredients": [
        "Cupcakes:",
        "1 cup boiling water",
        "1/2 cup unsweetened cocoa powder",
        "1 1/3 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/4 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/2 cup butter, at room temperature",
        "1 cup white sugar",
        "2 tablespoons white sugar",
        "2 eggs",
        "1 teaspoon vanilla extract",
        "2 tablespoons crushed peppermint candies",
        "Mint Buttercream:",
        "1/2 cup shortening",
        "1/2 cup butter, at room temperature",
        "1 1/4 teaspoons peppermint extract",
        "3 cups confectioners' sugar, divided",
        "3 tablespoons milk, divided",
        "3 drops green food coloring paste, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mint Chocolate Cupcakes",
    "url": "http://allrecipes.com/recipe/245407/mint-chocolate-cupcakes/"
}
