{
    "directions": [
        "Preheat the oven to 350°F. Cut the fennel into thin wedges and place on a baking sheet. Drizzle with olive oil, season, and squeeze the lemon juice over it. Roast in the oven for 15 to 20 minutes, until softened and lightly charred, turning once during cooking.",
        "Meanwhile, make the dressing by putting all the ingredients (except the olive oil) into a blender and pulsing them a few times. Slowly add the olive oil while you are pulsing, but don't overdo it, as you want to keep some texture. Taste and adjust the seasoning as necessary.",
        "For the beef, heat 1 tablespoon of olive oil in a non-stick frying pan until almost smoking. Season the fillet with salt and pepper until almost smoking. Season with fillet with salt and pepper and carefully add to the hot pan. Cook for 2 minutes on each side for rare; 3-4 medium; 4-5 for well done, then transfer to a plate or board, loosely cover with foil and allow to rest for a few minutes.",
        "Arrange the fennel wedges on a serving platter. Slice the beef thinly and place in and around the fennel. Drizzle the arugula dressing over the top."
    ],
    "ingredients": [
        "1 firm bulb of fennel",
        "Olive oil",
        "Sea salt and freshly ground black pepper",
        "A squeeze of lemon juice",
        "4 salted anchovies",
        "1 tablespoon capers",
        "1 sun-dried tomato (in olive oil)",
        "1 small clove of garlic, peeled and crushed",
        "4 green or Kalamata olives, pitted",
        "1 bag (approx. 2 1/2 ounces) of arugula",
        "1 ripe beefsteak tomato",
        "Juice and zest of 1/2 a lemon",
        "1 tablespoon extra-virgin olive oil",
        "Olive oil",
        "1/2 pound minute steak",
        "Sea salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Quick & Easy",
        "Dinner",
        "Steak",
        "Kid-Friendly",
        "Fennel",
        "Arugula",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Minute Steak with Roasted Fennel and Arugula and Caper Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/minute-steak-with-roasted-fennel-and-arugula-and-caper-dressing"
}
