{
    "directions": [
        "Combine first 3 ingredients in processor. Add butter, cut in using on/off turns until mixture resembles coarse meal. Add water; blend just until moist clumps form. Knead dough gently until smooth. Cover; chill 20 minutes.",
        "Roll out dough on floured surface to 13-inch round. Fit into 9-inch-diameter tart pan with removable bottom. Trim edges. Chill until firm, about 30 minutes.",
        "Preheat oven to 375°F. Line dough with foil. Fill with pie weights or dried beans. Bake until crust sets, about 15 minutes. Remove weights and foil. Bake crust until pale golden, about 20 minutes longer. Transfer to rack and cool. Reduce oven temperature to 300°F.",
        "Combine first 5 ingredients in heavy large skillet. Stir over low heat until sugar dissolves, about 10 minutes. Remove from heat; stir in nuts. Cool slightly. Add yolks and stir.",
        "Pour filling into crust. Bake until filling looks dry and crusty and center is softly set, about 30 minutes. Increase oven temperature to 325°F. Continue baking until center is set, about 15 minutes longer. Transfer to rack; cool completely. (Can be made 1 day ahead. Cover and chill. Bring to room temperature before continuing.) Serve with whipped cream."
    ],
    "ingredients": [
        "1 1/3 cups all purpose flour",
        "1/3 cup sugar",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
        "5 tablespoons cold water",
        "1 1/2 cups packed golden brown sugar",
        "1/4 cup (1/2 stick) unsalted butter",
        "3 tablespoons whipping cream",
        "1 tablespoon grated peeled fresh ginger",
        "1 1/2 cups sliced almonds",
        "4 large egg yolks",
        "Whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Ginger",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Almond",
        "Fall",
        "Shower",
        "Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mirabelle Ginger Tart",
    "url": "http://www.epicurious.com/recipes/food/views/mirabelle-ginger-tart-5003"
}
