{
    "directions": [
        "PREHEAT the oven to 350° F. Lightly grease an 8\" by 8\" baking sheet or cake pan with vegetable cooking spray and set aside.",
        "SPREAD the oats, nuts, and flaxseed meal on a sheet pan and bake until very light golden brown and fragrant, 10 to 12 minutes. Transfer to a large bowl.",
        "BRING the water to a boil in a medium saucepan. Remove from the heat and add the 7-grain cereal; set aside until the water is absorbed, 2 minutes. Add the peanut butter and honey, stir well, and place over medium-low heat. Cook, stirring constantly, until the mixture is thick and glossy and pulls away from the sides of the pan, 1 1/2 to 2 minutes.",
        "SPOON the fruit and salt into the hot peanut-butter mixture and immediately pour into the bowl with the grains. With a large rubber spatula, work the peanut butter-fruit mixture into the grains until evenly coated. (The mixture will become very sticky; it may be necessary to work the mixture with your hands.)",
        "TRANSFER the mixture to the prepared pan, working it out to the edges with your fingers and pressing to a uniform 1/2-inch thickness. Refrigerate until firm, at least 2 hours.",
        "CUT the cooled cake into bars measuring 1 1/2\" by 1 1/4\" and serve immediately, or wrap individually in plastic wrap. (The bars will keep room temperature for up to two days, and refrigerated for up yo four days.)"
    ],
    "ingredients": [
        "2 c. rolled oats",
        "1/4 c. sesame seeds",
        "2 Tbsp. almonds, chopped",
        "1 Tbsp. cashews, chopped",
        "1 Tbsp. flaxseed meal, optional",
        "1/2 c. water",
        "1/2 c. 7-grain cereal",
        "3/4 c. creamy organic peanut butter",
        "1/2 c. honey",
        "1 c. mixed dried fruit (raisins, cranberries, cherries, apricots), cut into 1/2- inch pieces if large",
        "Pinch kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Tree Nut",
        "Almond",
        "Cashew",
        "Oat",
        "Chill",
        "Healthy"
    ],
    "title": "Miraval Multigrain Nutrition Bar",
    "url": "http://www.epicurious.com/recipes/food/views/miraval-multigrain-nutrition-bar-51153000"
}
