{
    "directions": [
        "Bring water and rice to a boil in a saucepan. Reduce heat to low, cover, and simmer until most of the water has been absorbed, about 20 minutes. Place snow peas on top of the rice and steam, covered, until crisp-tender, about 5 minutes. Transfer snow peas to a bowl to stop cooking.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Line a baking dish with aluminum foil and coat with cooking spray. Arrange salmon fillets in the dish.",
        "Whisk brown sugar, soy sauce, water, and miso together in a small bowl. Spoon over salmon.",
        "Broil salmon in the preheated oven, basting it frequently with the topping mixture, until it is golden brown and flakes easily with a fork, 10 to 15 minutes.",
        "Melt 1 tablespoon butter in a small saucepan over medium-high heat. Add ginger and shallots; cook and stir until shallots are translucent, 2 to 3 minutes. Add 1/2 cup sake; bring to a boil and cook until reduced by 2/3, about 3 minutes. Add heavy cream; bring to a boil and cook until sauce is reduced by half, about 2 minutes.",
        "Whisk in cubes of butter one at a time until incorporated and sauce is thick and creamy. Remove from heat. Whisk in remaining 1 tablespoon sake and lime juice. Season with salt.",
        "Spoon some sake sauce onto 4 serving plates. Place rice in the middle of each and top with a piece of salmon. Arrange snow peas around each plate. Garnish with chives."
    ],
    "ingredients": [
        "2 cups water",
        "1 cup short-grain white rice",
        "1 cup snow peas",
        "cooking spray",
        "4 (6 ounce) 1-inch thick salmon fillets",
        "1/4 cup brown sugar, packed",
        "2 tablespoons low-sodium soy sauce",
        "2 tablespoons hot water",
        "2 tablespoons miso (soybean paste)",
        "Sake Butter Sauce:",
        "1 tablespoon unsalted butter",
        "2 tablespoons peeled, matchstick-cut fresh ginger",
        "1 tablespoon minced shallots",
        "1/2 cup sake (Japanese rice wine, such as Momokawa®)",
        "1 tablespoon heavy whipping cream",
        "1/2 cup cold unsalted butter, cubed",
        "1 tablespoon sake (Japanese rice wine, such as Momokawa®)",
        "1/2 teaspoon fresh lime juice",
        "kosher salt to taste",
        "1 tablespoon chopped fresh chives"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Miso Salmon with Sake Butter",
    "url": "http://allrecipes.com/recipe/246750/miso-salmon-with-sake-butter/"
}
