{
    "directions": [
        "Set a 6- to 8-quart pot of heavily salted water over high heat; cover and bring to a boil. Meanwhile, heat a large skillet over medium heat. Add bacon and garlic; cook, stirring often, until bacon is crisp and garlic is deep golden brown, 6 to 8 minutes. Remove pan from heat, discard garlic, and pour off all but about 1 tablespoon fat; add red-pepper flakes to skillet and reserve.",
        "Add spaghetti to boiling water, stir quickly, return to a boil, and cook according to package directions. Add broccoli rabe to the boiling water in the last 3 minutes of cooking time (if the stems seem especially thick and tough, add the broccoli rabe in the last 4 to 5 minutes). Cook pasta and broccoli rabe until spaghetti is al dente and rabe is crisp tender; drain in colander.",
        "In a large bowl, whisk together eggs and egg yolk, miso, 1/4 teaspoon salt, and 1 teaspoon coarsely ground black pepper until smooth.",
        "Once the pasta and rabe are drained, heat the skillet with the bacon and fat over medium heat until warmed. Add the pasta mixture and toss with tongs until combined. Transfer the pasta mixture to the bowl with the egg mixture and toss well to coat. Add half the cheese and toss to combine. Add the rest of the cheese and toss until the pasta is coated in a silky, cheesy sauce.",
        "Divide pasta among four bowls, top with more Parmigiano and cracked black pepper, and serve immediately."
    ],
    "ingredients": [
        "1/4 teaspoon kosher salt, plus more for pasta water",
        "1 pound spaghetti",
        "1 pound broccoli rabe, trimmed and cut into 2-inch pieces",
        "1/2 pound bacon (about 7 slices), cut crosswise into 1/4-inch-thick strips",
        "4 garlic cloves, smashed and peeled",
        "1/4 teaspoon red-pepper flakes",
        "2 large eggs, plus 1 large egg yolk",
        "2 1/2 tablespoons white or yellow miso paste",
        "1 teaspoon coarsely ground black pepper, plus more for serving",
        "1 1/4 cups finely grated Parmigiano-Reggiano (about 1/4 pound), plus more for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Quick & Easy",
        "Dinner",
        "Bacon",
        "Broccoli Rabe",
        "22-Minute Meals",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Miso Carbonara with Broccoli Rabe and Red-Pepper Flakes",
    "url": "http://www.epicurious.com/recipes/food/views/miso-carbonara-with-broccoli-rabe-and-red-pepper-flakes-51261020"
}
