{
    "directions": [
        "Peel and chop 1 onion quarter, then pulse in a food processor until finely chopped. Add miso and purée until smooth. Add 1/2 stick softened butter and 1/2 teaspoon pepper and purée until combined (mixture will appear curdled).",
        "Put oven rack in lowest position and preheat oven to 350°F.",
        "Rinse turkey inside and out, then pat dry. Working from large cavity end, gently run your fingers between skin and meat of breast to loosen skin, being careful not to tear skin. Push miso butter under skin, including thighs and drumsticks, and massage skin from outside to spread miso evenly (see Kitchen Notebook, page 230). Sprinkle large cavity with salt and remaining 1/2 teaspoon pepper. Fold neck skin under body and secure with metal picks or skewers, then stuff large cavity with remaining 3 onion quarters. Tie drumsticks together with string and tuck wings under body.",
        "Put turkey on rack in roasting pan and roast 30 minutes.",
        "Melt remaining 1/2 stick softened butter and brush over turkey, then add water (1 cup) to roasting pan. Tent turkey with foil and roast, basting every 30 minutes and adding more water to pan if necessary, until thermometer inserted into fleshy part of a thigh (do not touch bone) registers 170°F, 2 to 2 1/2 hours more (total roasting time: 2 1/2 to 3 hours). Remove foil for last 30 minutes of roasting if turkey is pale. Transfer turkey to a platter (reserve roasting pan) and let stand, loosely covered, 25 minutes (temperature will rise to 180°F while turkey stands). Remove picks from turkey.",
        "Pour pan juices through a fine-mesh sieve into a 2-quart glass measure, then skim off and reserve fat. (If there is less than 1/2 cup fat, add enough melted butter to total 1/2 cup.) Pour pan juices and 8 cups turkey stock into a 3-quart saucepan and bring to a simmer. Straddle roasting pan across 2 burners, then add remaining cup turkey stock and deglaze roasting pan by boiling over moderately high heat, stirring and scraping up brown bits, 1 minute. Pour through sieve into remaining stock and bring to a simmer.",
        "Cook flour and 1/2 cup reserved fat in a 4-quart heavy pot over moderately low heat, whisking, 5 minutes. Add hot stock mixture in a fast stream, whisking constantly to prevent lumps, then simmer, whisking occasionally, until gravy is thickened, about 10 minutes. Stir in any turkey juices accumulated on platter and season gravy with salt and pepper."
    ],
    "ingredients": [
        "1 medium onion, quartered but left unpeeled",
        "1/2 cup miso (white or red fermented-soybean paste)",
        "1 stick (1/2 cup) unsalted butter, softened, plus additional melted butter (from 1/2 stick) if turkey drippings yield less than 1/2 cup fat",
        "1 teaspoon black pepper",
        "1 (12- to 14-lb) turkey, any feathers and quills removed with tweezers or needlenose pliers, and neck and giblets reserved for another use if desired",
        "1/2 teaspoon salt",
        "1 cup water",
        "9 cupsturkey stock",
        "3/4 cup all-purpose flour",
        "Special equipment: 2 small metal picks or skewers; kitchen string; a 19- by 13-inch flameproof roasting pan with a rack; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "Soy",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Dinner",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Miso-Rubbed Turkey with Turkey Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/miso-rubbed-turkey-with-turkey-gravy-232984"
}
