{
    "directions": [
        "Season salmon fillets with salt. Cover and refrigerate for 1 hour.",
        "Wipe the excess salt from the salmon fillets, and wrap the fillets with 2 layers of cheesecloth. Mix 1 cup miso, 1/4 cup sake, and mirin together in a bowl. Spread both sides of the wrapped fillets with the miso mixture. Place the salmon in an air-tight container, and refrigerate for at least 5 hours, or overnight.",
        "Heat a small saucepan of water over medium-high heat. Add the spinach, and cook until wilted, 1 to 2 minutes. Drain in a colander, and allow to cool. Place spinach in a food processor.  Process until smooth, adding water if the spinach becomes too dry. Set aside.",
        "Mix the remaining 1/2 cup of miso with sugar, egg yolks, and 2 tablespoons sake in the top of a double boiler over barely simmering water, stirring frequently and scraping down the sides with a rubber spatula until thickened. Set aside to cool, then stir in the pureed spinach.",
        "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Lightly grease a baking sheet. Unwrap the cheesecloth, and scrape off excess miso from the salmon fillets. Arrange fillets on the prepared baking sheet.",
        "Broil in the preheated oven until the salmon is golden, about 4 minutes. Flip the fillet over, then brush with the spinach sauce. Continue broiling until the salmon is cooked through and easily flaked with a fork, about 4 minutes more."
    ],
    "ingredients": [
        "1 1/2 pounds salmon fillet, cut into 4 portions",
        "5 teaspoons salt",
        "1 cup white miso paste",
        "1/4 cup sake",
        "1/4 cup mirin (Japanese sweet wine)",
        "1/4 pound spinach leaves",
        "1 tablespoon water, or as needed",
        "1/2 cup white miso paste",
        "1 tablespoon white sugar",
        "2 egg yolks",
        "2 tablespoons sake"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Miso Salmon (Sake Misozuke) with Spinach Sauce",
    "url": "http://allrecipes.com/recipe/214700/miso-salmon-sake-misozuke-with-spin/"
}
