{
    "directions": [
        "Line a large shallow (1-inch-deep) baking pan with plastic wrap and arrange salmon fillets, skin sides down, in it. Stir together miso and sake and spread over flesh sides of salmon to completely cover. Cover with plastic wrap and chill 24 to 48 hours.",
        "Heat 3 tablespoons oil in a 12-inch nonstick skillet over high heat until hot but not smoking, then saut\u2029 shiitakes with salt to taste, stirring occasionally, until golden brown and nearly dry, 15 to 20 minutes. Transfer to paper towels.",
        "While mushrooms are cooking, remove zest from navel oranges and lemons in long, thin strips, preferably with a 5-holed citrus zester.",
        "Heat remaining 1/2 cup oil in a 10-inch skillet over moderately low heat until hot and cook zests in 4 batches, stirring frequently, until curly and crisp, about 1 minute.",
        "Transfer to paper towels with mushrooms. When mushrooms and zests are cool, transfer to a bowl. Just before serving, toss together with cilantro and chives.",
        "Preheat oven to 500°F.",
        "Gently scrape miso from salmon with a rubber spatula and discard miso. Arrange salmon fillets, skin sides down, in 2 well-greased large shallow (1-inch-deep) baking pans (tail ends may hang over ends of pans slightly). Roast salmon in upper and lower thirds of oven, switching position of pans after 10 minutes, until edges begin to brown and salmon is just cooked through, 15 to 20 minutes total.",
        "Transfer each salmon fillet to a platter using 2 large metal spatulas. (If fillets break as you’re transferring them, simply piece them together on the platter.) Pour orange and lemon juices over salmon and sprinkle with shiitake mixture."
    ],
    "ingredients": [
        "2 (3-lb) whole salmon fillets with skin, any small bones removed with tweezers",
        "500 grams shiro miso (white fermented-soybean paste)",
        "2 tablespoons sake or white wine",
        "3 tablespoons plus 1/2 cup olive oil",
        "1 lb fresh shiitake mushrooms, stems discarded and caps thinly sliced",
        "3 navel oranges",
        "3 large lemons",
        "1 cup fresh cilantro leaves",
        "1/2 cup (1/2-inch) lengths of fresh chives",
        "1/2 cup fresh orange juice (preferably from juice oranges)",
        "3 tablespoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Marinate",
        "Roast",
        "Lemon",
        "Orange",
        "Salmon",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Miso-Marinated Salmon with Citrus and Shiitakes",
    "url": "http://www.epicurious.com/recipes/food/views/miso-marinated-salmon-with-citrus-and-shiitakes-103374"
}
