{
    "directions": [
        "Preheat the oven to 400°F and line a baking sheet with parchment. Slice the Brussels sprouts in half lengthwise. Cut the delicata squash in half lengthwise and scoop out the seeds. Slice each half into 1/2-inch-thick half-moons. You can leave the peel on the squash, as it is edible.",
        "In a bowl, whisk together the olive oil, miso, harissa, honey, and vinegar. In a large bowl, combine the Brussels sprouts and squash with 1/3 cup of the harissa miso mixture. Use your hands to coat the vegetables evenly. Spread the vegetables out on the prepared baking sheet and roast until the squash is tender and the Brussels sprouts are slightly crisp, 25 to 30 minutes. Toss the veggies halfway through cooking.",
        "While the veggies roast, heat a small dry skillet over medium-high. Add the almonds and toast until they are golden brown, shaking the pan often, 3 to 5 minutes. Pour them from the pan to a plate, and when they’re cool enough to handle, roughly chop them.",
        "Divide the roasted vegetables among the bowls and sprinkle toasted almonds and minced cilantro on top. Serve with the remaining miso harissa sauce on the side.",
        "Keep extra miso-harissa sauce in an airtight container in the fridge for up to 1 week."
    ],
    "ingredients": [
        "1/2 pound Brussels sprouts, trimmed",
        "1-pound delicata squash",
        "1/4 cup extra-virgin olive oil",
        "1/4 cup white miso",
        "1 tablespoon harissa paste",
        "2 teaspoons honey",
        "3 tablespoons unseasoned rice vinegar",
        "1/4 cup toasted almonds, roughly chopped",
        "Minced cilantro for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Salad",
        "Winter",
        "Squash",
        "Brussel Sprout",
        "Fall",
        "Almond",
        "Quick & Easy",
        "Healthy",
        "Quick and Healthy",
        "Wheat/Gluten-Free"
    ],
    "title": "Miso-Harissa Delicata Squash and Brussels Sprouts Salad",
    "url": "http://www.epicurious.com/recipes/food/views/miso-harissa-delicata-squash-and-brussels-sprouts-salad"
}
