{
    "directions": [
        "Preheat your oven to 325 degrees. Butter an 8-inch round pie pan and line with parchment paper.",
        "Sift together the flour, cocoa, baking powder, and salt. In a double boiler over hot water, carefully melt the butter and chocolate, stirring to mix. In a large bowl, whisk the eggs, sugar, vanilla, and sour cream together. Add the melted chocolate and mix completely. Fold in the flour mixture and stir only until the batter is uniformly brown.",
        "Pour the batter into the prepared pan. Bake for 30 to 40 minutes, just until the batter is set and no longer jiggles when touched. Do not overbake; it should be moist and slightly gooey.",
        "Purée the berries and pass through a sieve (if you are using fresh berries, you may wish to reserve a few to use as a garnish when serving). Mix the cornstarch with a little cold water until smooth. Place the berry purée, the cornstarch, and the sugar in a saucepan and heat to simmer. Cook one minute, then cool. Chill before using.",
        "After removing the pie from oven, allow it to cool completely in the pan. Carefully turn it out of the pan, remove the parchment paper, and dust lightly with confectioners' sugar. Serve warm or room temperature with raspberry coulis."
    ],
    "ingredients": [
        "Unsalted butter, for the pan",
        "1/4 cup all-purpose flour",
        "3 tablespoons cocoa",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) unsalted butter, cold",
        "4 ounces (4 squares) bittersweet chocolate, chopped",
        "3 large eggs",
        "1 cup sugar",
        "1 teaspoon vanilla extract",
        "1/4 cup sour cream",
        "Confectioners' sugar, to garnish",
        "1 pound fresh or frozen raspberries (if frozen, thaw completely)",
        "1 tablespoon cornstarch",
        "2 tablespoons sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Raspberry",
        "Sour Cream",
        "Kidney Friendly"
    ],
    "title": "Miss Milton's Lovely Fudge Pie",
    "url": "http://www.epicurious.com/recipes/food/views/miss-miltons-lovely-fudge-pie-109559"
}
