{
    "directions": [
        "Working in batches by type, cook beans in a large pot of boiling salted water until crisp-tender, 1–4 minutes. Transfer with a slotted spoon to a large bowl of ice water; let cool. Drain and pat dry.",
        "Heat 1 tablespoon oil in a small skillet over medium and cook shallot, stirring occasionally, until tender, about 3 minutes. Add ginger, lemongrass, garlic, and coriander and cook, stirring, until very fragrant, about 1 minute. Transfer to a large bowl; season with salt and pepper.",
        "Heat 1 tablespoon oil in same skillet over medium-high. Cook peanuts, tossing often, until golden brown and fragrant, about 2 minutes. Transfer to paper towels; let cool, then coarsely chop. Set aside 1 tablespoon peanuts for serving.",
        "Whisk kaffir lime leaves, lime zest, lime juice, sugar, 1/2 teaspoon salt, and remaining 3 tablespoons oil into shallot mixture. Add beans, remaining peanuts, and 1/3 cup cilantro and toss to coat; season with salt and pepper. Serve topped with more cilantro and reserved peanuts."
    ],
    "ingredients": [
        "2 pounds mixed snap beans (such as green, wax, haricots verts, and/or Romano), trimmed",
        "1/2 teaspoon kosher salt, plus more",
        "5 tablespoons olive oil, divided",
        "1/2 large shallot, finely chopped",
        "1 (1\" piece) ginger, peeled, finely grated",
        "1 lemongrass stalk, tough outer layers removed, finely grated on a Microplane",
        "2 garlic cloves, finely grated",
        "1/2 teaspoon ground coriander",
        "Freshly ground black pepper",
        "1/3 cup salted, roasted peanuts",
        "3 kaffir lime leaves, finely chopped",
        "1 teaspoon finely grated lime zest",
        "3 tablespoons fresh lime juice",
        "1/4 teaspoon sugar",
        "1/3 cup (packed) cilantro leaves with tender stems, plus more for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Side",
        "Kid-Friendly",
        "Lime",
        "Peanut",
        "Summer",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Sugar Snap Pea",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mixed Beans with Peanuts, Ginger, and Lime",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-beans-with-peanuts-ginger-and-lime-56389867"
}
