{
    "directions": [
        "Place sugar, next 8 ingredients, and 1 1/2 teaspoons freshly ground black pepper in large bowl. Whisk until salt dissolves. Mix in green onions.",
        "Sprinkle pork, beef, and chicken on all sides very lightly with coarse salt and pepper. Let stand 30 minutes. Arrange pork rib racks in single layer on large rimmed baking sheet. Arrange beef short ribs in single layer in 13 x 9 x 2-inch metal baking pan. Arrange chicken in another 13 x 9 x 2-inch metal baking pan. Pour 3/4 cup marinade each over pork, beef, and chicken; turn to coat. Marinate 1 hour at room temperature. Cover, chill, and reserve remaining marinade for grilling.",
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 350°F. Add beef broth to pan with short ribs; turn ribs, meat side down, in broth. Cover pork, beef, and chicken pans tightly with foil. Place pork on lower rack. Place beef and chicken on upper rack. Bake pork and chicken until tender, about 45 minutes. Remove both from oven; open foil. Continue to bake beef until tender, about 1 1/4 hours longer (2 hours total). Remove from oven; open foil.",
        "Pour pan juices from pork, beef, and chicken into medium saucepan. Spoon off fat. Boil until reduced to scant 2 cups sauce, 25 to 30 minutes. Add bourbon; return sauce to boil, then remove from heat. Season with salt, pepper, and more hot chili sauce, if desired. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Rewarm before serving.",
        "Coat grill racks with nonstick spray and prepare barbecue (medium-high heat). Cut pork racks between bones into ribs. Brush all meat with some of reserved marinade. Grill pork, beef, and chicken until slightly charred, brushing with more marinade and turning occasionally, 12 to 15 minutes.",
        "Mound pork, beef, and chicken on platter. Pass bourbon sauce alongside."
    ],
    "ingredients": [
        "1 1/4 cups (packed) dark brown sugar",
        "18 garlic cloves, peeled, pressed",
        "1 cup mild-flavored (light) molasses",
        "3/4 cup tamari soy sauce (do not use low-sodium)",
        "6 tablespoons unseasoned rice vinegar",
        "3 tablespoons chili powder",
        "2 tablespoons chopped peeled fresh ginger",
        "1 tablespoon (or more) hot chili sauce (such as sriracha)",
        "3/4 teaspoon coarse kosher salt",
        "9 green onions, chopped",
        "2 racks meaty baby back pork ribs (about 5 pounds)",
        "8 meaty beef short ribs (about 4 pounds), top membranes trimmed",
        "8 chicken thighs with skin and bones",
        "1 cup beef broth",
        "2 tablespoons bourbon",
        "Nonstick vegetable oil spray",
        "Ingredient info: Look for tamari at supermarkets and natural foods stores. Sriracha can be found in the asian foods section of supermarkets and at asian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Beef",
        "Chicken",
        "Pork",
        "Backyard BBQ",
        "Dinner",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Mixed Grill with Sweet and Spicy Bourbon Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-grill-with-sweet-and-spicy-bourbon-sauce-362937"
}
