{
    "directions": [
        "Pour half and half into medium saucepan. Scrape in seeds from vanilla bean; add bean and bring cream to simmer. Remove from heat; cover and steep 15 minutes. Blend sugar and flour in medium bowl. Whisk in eggs, then warm half and half mixture; return to same pan. Add almond paste. Whisk over medium heat until almond paste dissolves and custard boils, about 10 minutes. Remove from heat. Add white chocolate and butter; whisk until melted and smooth. Press plastic wrap onto custard; chill 3 hours. Remove vanilla bean. Beat cream to peaks; fold into custard in 3 additions. Cover; chill at least 6 hours. (Can be made 2 days ahead. Keep chilled.)",
        "Preheat oven to 325°F. Butter and flour two 10-inch-diameter cake pans with 2-inch-high sides. Sift flour, 3/4 cup sugar, baking powder, and salt into large bowl. Using electric mixer, beat 1/2 cup lukewarm water into dry ingredients; beat in oil, egg yolks, both extracts, and peel. Using clean dry beaters, beat whites in medium bowl until soft peaks form. Gradually add remaining 1/2 cup sugar, beating until stiff but not dry. Fold whites into batter in 3 additions. Measure 4 2/3 cups batter into 1 prepared pan and 3 1/3 cups batter into second pan.",
        "Bake cakes until tester inserted into center comes out clean, about 25 minutes for thinner cake and 30 minutes for larger cake. Cool cakes in pans on racks 10 minutes. Cut around cakes and turn out onto racks; cool completely.",
        "Place thinner cake on 9-inch-diameter tart pan bottom. Spread with 1/2 cup preserves, leaving 1/2-inch plain border. Spoon 1 1/2 cups filling in dollops atop preserves; spread evenly. Chill until filling is firm, about 15 minutes.",
        "Cut larger cake horizontally in half. Place 1 half, cut side down, atop chilled filling. Spread with 1/2 cup preserves, leaving 1/2-inch plain border. Spoon 1 1/2 cups filling in dollops atop preserves; spread evenly. Top with remaining cake layer, cut side down . Cover cake and remaining filling; chill 3 hours.",
        "Beat cream cheese, butter, sugar, and both extracts in large bowl to blend. Beat in 3/4 cup remaining filling. Spread 1 cup frosting thinly over sides and top of cake. Spread cake with remaining frosting, building high rim around top edge. (Can be made 1 day ahead. Cover with cake dome and chill.)",
        "Mound berries on top of cake. Brush top of berries with warm jelly to glaze. Serve immediately, or chill up to 6 hours."
    ],
    "ingredients": [
        "1 cup half and half",
        "1 vanilla bean, split lengthwise",
        "1/3 cup sugar",
        "1/4 cup all purpose flour",
        "2 large eggs",
        "1/2 7-ounce roll almond paste (scant 1/2 cup packed), diced",
        "6 ounces good-quality white chocolate (such as Lindt or Baker's), finely chopped",
        "2 tablespoons (1/4 stick) unsalted butter",
        "2/3 cup chilled heavy whipping cream",
        "1 1/2 cups cake flour",
        "1 1/4 cups sugar",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup lukewarm water",
        "1/2 cup vegetable oil",
        "5 large eggs, separated",
        "1 tablespoon vanilla extract",
        "1/2 teaspoon almond extract",
        "2 teaspoons grated lemon peel",
        "1 cup raspberry preserves",
        "2 1/2 8-ounce packages cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 1/2 cups powdered sugar",
        "1 tablespoon vanilla extract",
        "3/4 teaspoon almond extract",
        "Assorted fresh berries (such as strawberries and blueberries)",
        "Currant jelly, warmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Berry",
        "Dessert",
        "Bake",
        "Wedding",
        "Cream Cheese",
        "Almond",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mixed-Berry Chiffon Cake with Almond Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-berry-chiffon-cake-with-almond-cream-cheese-frosting-106656"
}
