{
    "directions": [
        "In a blender chop shallot, garlic, peppercorns, and aniseed. Add vinegar and salt and pepper to taste and blend well. With motor running, add oil in a stream and blend dressing until emulsified. The vinaigrette may be made 1 week in advance and kept covered and chilled. In a large bowl toss greens with vinaigrette until coated well.",
        "Divide salad among 4 plates and serve with goat cheese crostini.",
        "In a small bowl stir together goat cheese, chives, and salt and pepper to taste until combined well. Goat cheese mixture may be made 2 days in advance and kept covered and chilled.",
        "Preheat oven to 350°F.",
        "Toast bread on a baking sheet in middle of oven until golden, about 10 minutes. The toasts may be made 2 days in advance, cooled, and kept in an airtight container.",
        "Preheat boiler.",
        "Spread goat cheese mixture on toasts and sprinkle with Parmesan. Broil crostini on the baking sheet 2 inches from heat until cheese is browned in spots, about 2 minutes."
    ],
    "ingredients": [
        "1 shallot, quartered",
        "2 garlic cloves, halved",
        "1 teaspoon freeze-dried green peppercorns",
        "1/2 teaspoon aniseed",
        "1 tablespoon white-wine vinegar",
        "1/4 cup olive oil (preferably extra-virgin)",
        "8 cups mixed baby greens",
        "3 ounces soft mild goat cheese such as Montrachet, at room temperature",
        "1 tablespoon snipped fresh chives",
        "four 3/4-inch-thick slices French or Italian bread",
        "1 tablespoon freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Quick & Easy",
        "Goat Cheese",
        "Spring",
        "Anise",
        "Chive",
        "Gourmet"
    ],
    "title": "Mixed Baby Greens with Aniseed Vinaigrette and Goat Cheese Crostini",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-baby-greens-with-aniseed-vinaigrette-and-goat-cheese-crostini-11537"
}
