{
    "directions": [
        "Finely grind pecans in processor. Add 2 1/4 cups flour, 1/2 cup sugar, grated orange peel and salt and process until well blended. Add butter and process until mixture resembles coarse meal. Using on/off turns, blend in enough water by tablespoonfuls to form moist clumps. Gather dough together and divide into 2 pieces, 1 slightly larger than the other. Flatten into disks; wrap each disk in plastic and chill 1 hour. (Dough can be prepared 2 days ahead. Keep refrigerated. Let dough soften slightly at room temperature before rolling out.)",
        "Position rack in bottom third of oven and preheat to 375°F. Combine 1 1/3 cups sugar, orange marmalade, cornstarch, orange peel and allspice in large bowl. Add all berries and toss gently.",
        "Roll out larger dough disk on floured surface to 13-inch round. Transfer dough to 9-inch-diameter glass pie dish. Trim overhang to 1 1/2 inches.",
        "Roll out remaining dough disk on floured surface to 12-inch round. Cut dough into fourteen 1/2-inch-wide strips.",
        "Mound filling in crust. Arrange 7 dough strips atop filling, spacing evenly. Form lattice by placing remaining dough strips atop and at right angle to first 7 strips. Trim ends of dough strips even with overhang of bottom crust. Fold strip ends and overhang under, pressing to seal and forming high-standing rim. Brush lattice with egg glaze. Sprinkle with remaining 1 tablespoon sugar.",
        "Line baking sheet with foil; place on bottom of oven under rack to catch any drippings. Place pie on rack and bake until crust is golden brown and filling bubbles thickly, covering crust edge with aluminum foil if browning too quickly, about 1 hour 15 minutes. Transfer pie to rack to cool. Serve pie slightly warm or at room temperature."
    ],
    "ingredients": [
        "1/2 cup pecans, toasted",
        "2 1/4 cups all purpose flour",
        "1/2 cup sugar",
        "1 tablespoon grated orange peel",
        "3/4 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch pieces",
        "5 tablespoons (about) ice water",
        "1 1/3 cups plus 1 tablespoon sugar",
        "1/4 cup orange marmalade",
        "1/4 cup cornstarch",
        "1 tablespoon grated orange peel",
        "1/4 teaspoon ground allspice",
        "1 3/4 cups frozen unsweetened raspberries, thawed, drained",
        "1 1/2 cups frozen unsweetened blueberries, thawed, drained",
        "1 1/4 cups fresh cranberries or frozen, thawed",
        "1 egg, beaten to blend (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Blueberry",
        "Cranberry",
        "Raspberry",
        "Orange",
        "Pecan",
        "Fall",
        "Jam or Jelly",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mixed Berry Pie with Pecan-Orange Lattice Crust",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-berry-pie-with-pecan-orange-lattice-crust-100326"
}
