{
    "directions": [
        "Mix all ingredients in small bowl to blend. DO AHEAD: Can be made 2 weeks ahead. Store in airtight container at cool room temperature.",
        "Remove top rack from grill. Place foil drip pan in center of bottom rack; fill halfway with water (if using 2-burner gas grill, place drip pan on 1 unlit burner).",
        "Prepare barbecue (medium heat). Sprinkle ribs with salt and 3 tablespoons spice rub. If using charcoal grill, light briquettes in chimney and pour half onto rack on each side of drip pan (you'll need to light more briquettes in chimney to replenish 1 or more times during grilling). If using 3-burner gas grill, light burners on left and right, leaving center burner off. If using 2-burner gas grill, light burner on side opposite drip pan.",
        "Drain wood chips. If using gas grill, stack 2 mini loaf pans and fill with 1 cup drained wood chips. Stack remaining 2 mini pans and fill with 1 cup drained wood chips. Place pans on flame. If using charcoal, scatter 2 cups drained chips over coals. Brush top grill rack with oil; return to barbecue.",
        "Place ribs on grill rack over drip pan. Cover barbecue; grill until meat is coming away from bones, turning and repositioning every 30 minutes and adding more wood chips to pans as needed, about 1 1/2 hours. Maintain barbecue temperature at 350°F, opening vents wider for more heat or partially closing for less heat. Transfer ribs to rimmed baking sheet; cool.",
        "DO AHEAD: Ribs can be made 1 day ahead. Cover and chill. Remove drip pan from barbecue.",
        "Lightly brush grill racks with oil. Prepare barbecue (medium heat). Sprinkle chicken with salt and remaining spice rub. Place chicken, sausages, and ribs on grill racks; cover and grill 7 minutes, turning occasionally. Brush ribs with 1 cup cherry cola sauce; cover and grill until chicken is cooked through and ribs are glazed, turning frequently, about 5 minutes longer. Transfer sausages to platter; transfer ribs and chicken to cutting board. Cut pork between bones; cut chicken crosswise into 3/4-inch-wide strips. Transfer to platter with sausages. Serve with remaining cherry cola sauce.",
        "* Hot smoked Spanish paprika is available at specialty foods stores and from tienda.com; smoked paprika is now available in the spice section of some supermarkets.",
        "Surprisingly, an offdry Riesling is excellent with the sweet and spicy flavors in this menu. We like the 2006 Riesling ($14) from Koehler Winery in California's Santa Ynez Valley. Its citrus and green apple flavors are a nice foil for the smoky chiles here. For a more classic pairing, go for beer: Try a hoppy, malty IPA (India Pale Ale), like Northern California's Lagunitas IPA ($9 for a six-pack)."
    ],
    "ingredients": [
        "2 tablespoons smoked paprika or hot smoked Spanish paprika*",
        "2 1/2 teaspoons dried basil",
        "2 1/2 teaspoons dried thyme",
        "1 1/2 teaspoons garlic powder",
        "1 1/2 teaspoons onion powder",
        "1 teaspoon freshly ground black pepper",
        "1 13x9x2-inch disposable aluminum pan (to catch drips)",
        "4 to 4 1/2 pounds baby back pork ribs, cut into 4 slabs",
        "2 cups (or more) wood chips (cherry, alder, apple, or hickory), soaked in water 1 hour",
        "4 6x31/4x2-inch disposable mini loaf pans (for wood chips if using gas grill)",
        "Vegetable oil (for brushing)",
        "4 skinless boneless chicken breast halves, pounded with mallet to 3/4-inch thickness",
        "8 fully cooked smoked sausages (such as chicken-apple), pierced in several places with fork",
        "Cherry Cola Barbecue Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fourth of July",
        "Backyard BBQ",
        "Dinner",
        "Pork Rib",
        "Poultry Sausage",
        "Spice",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mixed Grill with Cherry Cola Barbecue Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-grill-with-cherry-cola-barbecue-sauce-242715"
}
