{
    "directions": [
        "In a small bowl whisk together the garlic, the vinegars, the rosemary, the basil, the orégano, the red pepper flakes, and salt and pepper to taste, add the oil in a stream, whisking, and whisk the marinade until it is emulsified.",
        "In a large saucepan of boiling water blanch the carrots and the fennel for 3 to 4 minutes, or until they are crisp-tender, drain them, and plunge them into a bowl of ice and cold water. Let the vegetables cool and drain them well. In a large bowl toss together the carrots, the fennel, the roasted peppers, the peperoncini, the olives, the sun-dried tomatoes, the bocconcini, the pepperoni, the artichoke hearts, the marinade, the minced parsley until the antipasto is combined well and chill the antipasto, covered, for at least 4 hours or overnight. Transfer the antipasto to a platter, garnish it with the parsley sprigs, and serve it at room temperature."
    ],
    "ingredients": [
        "1 large garlic clove, minced",
        "2 tablespoons balsamic vinegar",
        "2 tablespoons red-wine vinegar",
        "1/2 teaspoon crumbled dried rosemary",
        "1 teaspoon dried basil, crumbled",
        "1 teaspoon dried orégano, crumbled",
        "1/4 teaspoon dried hot red pepper flakes, or to taste",
        "1/2 cup olive oil",
        "3 large carrots, cut diagonally into 1/4-inch-thick slices",
        "2 small fennel bulbs (about 1 1/2 pounds), cut crosswise into 1/4-inch-thick slices (about 3 cups)",
        "2 red bell peppers, roasted and cut into strips",
        "2 yellow bell peppers, roasted and cut into strips",
        "a 12-ounce jar peperoncini (pickled Tuscan peppers), rinsed and  drained well",
        "3/4 pound black or green brine-cured olives or a combination",
        "1/4 pound sun-dried tomatoes packed in oil, drained and cut into  strips",
        "3/4 pound marinated or plain bocconcini (small mozzarella balls, available at specialty foods shops and some supermarkets)",
        "1/2 pound pepperoni or soppressata (hard Italian sausage, available at Italian markets, some butcher shops, and, some specialty foods  shops), cut crosswise into 1/4-inch-thick slices and the slices  quartered",
        "two 7-ounce jars marinated artichoke hearts, rinsed and drained well",
        "1/3 cup minced fresh parsley leaves plus, if desired, parsley sprigs for  garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Pepper",
        "Tomato",
        "Appetizer",
        "Buffet",
        "Mozzarella",
        "Meat",
        "Artichoke",
        "Fennel",
        "Carrot",
        "Gourmet"
    ],
    "title": "Mixed Antipasto",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-antipasto-13345"
}
