{
    "directions": [
        "Preheat oven to 425°F. Spray 13 x 9 x 2-inch glass baking dish with vegetable oil spray.",
        "Heat 1/2 teaspoon oil in large nonstick skillet over medium-high heat. Add garlic and oregano and stir 30 seconds. Add crushed tomatoes and wine and bring to boil. Reduce heat and simmer until slightly thickened, about 6 minutes. Season with salt and pepper. Set tomato sauce aside.",
        "Heat 1/2 teaspoon oil in another large nonstick skillet over medium-high heat. Add mushrooms; sauté until mushrooms begin to release juices, about 9 minutes. Season with salt and pepper. Set aside.",
        "Spread 1/3 cup tomato sauce over bottom of prepared dish. Arrange 3 lasagna noodles crosswise in dish. Spread 3/4 cup Parmesan Sauce over. Arrange 1/3 of mushrooms over sauce. Spoon 1/2 cup tomato sauce over mushrooms. Repeat layering 2 more times. Top with 3 lasagna noodles. Spread remaining Parmesan Sauce over. Drizzle with remaining tomato sauce. Sprinkle with Parmesan cheese.",
        "Cover lasagna with foil. Bake 20 minutes. Uncover and bake until noodles are tender and top is golden, about 25 minutes longer. Let stand 10 minutes."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 teaspoon olive oil",
        "1 1/2 tablespoons minced garlic",
        "2 1/2 teaspoons dried oregano",
        "1 28-ounce can crushed tomatoes",
        "1/3 cup dry white wine",
        "1 1/2 pounds mixed fresh mushrooms (such as button, crimini and small stemmed portobello), sliced",
        "12 noodles from one 8-ounce package no-boil or oven-ready lasagna noodles",
        "Parmesan Sauce",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Pasta",
        "Tomato",
        "Vegetarian",
        "Back to School",
        "Dinner",
        "Parmesan",
        "Fall",
        "Winter",
        "Noodle"
    ],
    "title": "Mixed-Mushroom Lasagna with Parmesan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-mushroom-lasagna-with-parmesan-sauce-4992"
}
