{
    "directions": [
        "Cook frozen mixed berries and 6 tablespoons sugar in heavy medium saucepan over medium heat until mixture resembles jam and is reduced to 1 cup, stirring frequently, about 15 minutes. Cool jam mixture.",
        "Strain syrup from thawed raspberries through sieve set over bowl, pressing gently on solids. Discard solids. Add raspberry liqueur to raspberry syrup in bowl. Using sharp knife, trim 1 biscuit to 3-inch (about) length. Quickly dip biscuit into syrup, turning to coat lightly. Place rounded end up and sugared side against side of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Repeat with as many biscuits as necessary to cover sides of pan. Dip more biscuits in syrup and arrange on bottom of pan, covering completely and trimming to fit.",
        "In bowl, whisk mascarpone with 6 tablespoons sugar and vanilla to blend. Set aside. Thinly slice enough strawberries to measure 1/2 cup. Gently spread half of jam mixture over biscuits in bottom of pan. Spoon half of mascarpone mixture over; smooth top. Sprinkle with sliced strawberries, 1/2 cup fresh raspberries and 1/2 cup blueberries. Dip more biscuits into syrup; arrange over fruit in pan, covering completely and trimming to fit. Gently spread remaining jam mixture over biscuits. Spoon remaining mascarpone mixture over; smooth top. Cover; chill at least 4 hours or overnight.",
        "Release pan sides. Transfer cake to platter. Arrange remaining fresh berries decoratively atop cake and serve."
    ],
    "ingredients": [
        "1 12-ounce package unsweetened frozen mixed berries",
        "12 tablespoons sugar",
        "1 10-ounce package frozen raspberries in syrup, thawed",
        "1/4 cup raspberry liqueur",
        "3 4.40-ounce packages Champagne biscuits (4-inch-long ladyfinger-like biscuits)",
        "3 8-ounce containers mascarpone cheese*",
        "2 teaspoons vanilla extract",
        "1 1-pint basket strawberries, hulled",
        "2 1/2-pint baskets raspberries",
        "1 1/2-pint basket blueberries",
        "*Italian cream cheese available at Italian markets and specialty foods stores. If unavailable, blend 1 1/2 pounds cream cheese with 1/2 cup whipping cream and 6 tablespoons sour cream. Use 3 cups for recipe"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dessert",
        "Summer"
    ],
    "title": "Mixed Berry Tiramisu",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-berry-tiramisu-2328"
}
