{
    "directions": [
        "Cut ends off kumquats, then cut into 1/4-inch-thick rounds, removing seeds. Place kumquat slices in medium saucepan; pour enough cold water over to cover by 2 inches. Bring to boil over medium-high heat. Immediately remove from heat; strain. Return kumquat slices to pan; repeat blanching 2 more times. Transfer kumquat slices to medium bowl. Combine 2 cups sugar and 1 cup water in same saucepan. Scrape in seeds from vanilla bean; add bean. Stir over medium heat until sugar dissolves, then bring to boil, brushing down pan sides with wet pastry brush. Add kumquat slices; press gently to submerge. Reduce heat so that mixture barely simmers. Cover surface with parchment round. Cook without stirring until kumquats are translucent, 15 to 18 minutes. Remove from heat; let stand 15 minutes.",
        "Using slotted spoon, transfer kumquat slices to medium bowl. Add lemon slices and lemon juice to syrup in pan, pressing to submerge. Bring to boil. Reduce heat so that syrup barely simmers. Cover surface with parchment round. Cook without stirring until lemon slices are translucent, occasionally pressing on parchment to submerge slices, 40 to 45 minutes. Remove from heat; let stand 15 minutes. Transfer lemon slices to cutting board; cut each into quarters. Add lemon quarters and syrup to bowl with kumquat slices. DO AHEAD: Can be made 2 days ahead. Cover; chill.",
        "Cut off peel and white pith from blood oranges. Working over bowl to catch juices and using small knife, cut between membranes to release segments. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Drain syrup from kumquat-lemon mixture, reserving syrup. Drain orange segments. Combine fruit in medium bowl, adding some syrup if mixture is dry."
    ],
    "ingredients": [
        "15 medium kumquats",
        "2 cups sugar",
        "1/2 vanilla bean, split lengthwise",
        "30 very thin Meyer lemon slices or regular lemon slices (about 1/16 inch thick; from about 2 to 3 medium)",
        "2 tablespoons fresh Meyer lemon juice or regular fresh lemon juice",
        "6 blood oranges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Fruit Juice",
        "Citrus",
        "Fruit",
        "Dessert",
        "Low Fat",
        "Vegetarian",
        "Low Cal",
        "Lemon",
        "Orange",
        "Low Cholesterol",
        "Vegan",
        "Kumquat",
        "Boil",
        "Lemon Juice",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mixed Citrus \"Marmalade\"",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-citrus-marmalade-357522"
}
