{
    "directions": [
        "Line rimmed baking sheet with plastic wrap. Whisk first 5 ingredients in medium bowl. Stir in milk and butter, then green onions. Let stand at least 1 hour and up to 2 hours. Using wet hands, shape mixture, 1 tablespoon at a time, into 18 dumplings, arranging on sheet. DO AHEAD: Can be made 1 day ahead. Cover; chill.",
        "Heat oil in large pot over medium heat. Add onion, garlic, bay leaves, and thyme. Sauté until onion is tender, about 5 minutes. Add sausage; sauté until fat renders, 3 to 4 minutes. Add broth, tomatoes with juice, hot sauce, and allspice; bring to simmer, stirring occasionally. DO AHEAD: Can be made 1 day ahead. Chill uncovered until cold, then cover and keep chilled. Return to simmer before continuing.",
        "Add greens to simmering soup. Cook greens uncovered 10 minutes, stirring occasionally. Drop in dumplings. Cover; reduce heat to low. Simmer until dumplings are tender and cooked through, 20 to 25 minutes. Season soup with salt and pepper. Ladle soup and dumplings into bowl."
    ],
    "ingredients": [
        "3/4 cup all purpose flour",
        "3/4 cup yellow cornmeal",
        "1 tablespoon sugar",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "3/4 cup whole milk",
        "1 1/2 tablespoons butter, melted",
        "1/2 cup chopped green onions",
        "2 tablespoons extra-virgin olive oil",
        "1 1/2 cups chopped onion",
        "4 large garlic cloves, pressed",
        "4 Turkish bay leaves",
        "1 tablespoon chopped fresh thyme",
        "1 pound andouille sausages, sliced into 1/4-inch-thick rounds",
        "6 cups low-salt chicken broth",
        "2 14.5-ounce cans diced tomatoes in juice",
        "1 teaspoon hot pepper sauce",
        "1/8 teaspoon ground allspice",
        "1 12-ounce bag mixed turnip, mustard, and collard greens, any thick stems cut away (about 12 cups packed)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Leafy Green",
        "Sauté",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Sausage",
        "Cornmeal",
        "Turnip",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mixed-Greens and Sausage Soup with Cornmeal Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-greens-and-sausage-soup-with-cornmeal-dumplings-362971"
}
