{
    "directions": [
        "Whisk flour, sugar, and salt in medium bowl to blend. Add butter and rub in with fingertips until mixture resembles coarse meal. Add 2 tablespoons ice water and stir with fork until mixture is evenly moistened, adding more ice water by teaspoonfuls if mixture is dry. Gather dough into ball; flatten into disk. Wrap dough in plastic and chill at least 1 hour. DO AHEAD: Can be made 2 days ahead. Keep chilled. Soften dough slightly at room temperature before rolling out.",
        "Blend flour, sugar, crystallized ginger, orange peel, and salt in processor. Add butter; using on/off turns, blend until coarse crumbs form. Blend in milk (mixture will resemble moist coarse crumbs). Transfer mixture to medium bowl. Stir in almonds. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Position rack in center of oven and preheat to 400°F. Place rimmed baking sheet in bottom of oven to catch any possible spills from pie. Roll out dough on lightly floured surface to 12-inch round. Transfer to 9-inch-diameter glass pie dish. Turn pie crust edge under, forming high-standing rim extending 1/4 inch above sides of pie dish; crimp edge decoratively. Freeze crust while making filling.",
        "Gently toss blueberries, raspberries, blackberries, 1/2 cup sugar, and lemon juice in large bowl. Let stand 10 minutes. Mix cornstarch and remaining 2 tablespoons sugar in small bowl. Add to berry mixture and toss gently to coat. Transfer berry mixture to crust, mounding slightly in center. Bake 30 minutes.",
        "Remove pie from oven and reduce oven temperature to 375°F. Sprinkle streusel topping evenly over berry pie filling. Return pie to oven and bake until crust is golden brown and berry juices are bubbling thickly, about 40 minutes. Transfer pie to rack and cool completely."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "2 teaspoons sugar",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/4-inch cubes",
        "2 tablespoons (or more) ice water",
        "3/4 cup all purpose flour",
        "1/2 cup sugar",
        "2 tablespoons finely chopped crystallized ginger",
        "1 teaspoon finely grated orange peel",
        "1/4 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/4-inch cubes",
        "1 tablespoon whole milk",
        "1 cup sliced almonds",
        "3 cups fresh blueberries (17 ounces)",
        "2 cups fresh raspberries (9 to 10 ounces)",
        "1 cup fresh blackberries (5 to 6 ounces)",
        "1/2 cup plus 2 tablespoons sugar",
        "1 tablespoon fresh lemon juice",
        "3 tablespoons cornstarch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Berry",
        "Ginger",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Graduation",
        "Orange",
        "Almond",
        "Potluck",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mixed Berry Pie with Ginger, Orange, and Almond Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-berry-pie-with-ginger-orange-and-almond-streusel-353426"
}
