{
    "directions": [
        "Butter baking pan and line with parchment, leaving a 1\" overhang on both long sides. Roll out 1 disc of dough on a lightly floured work surface to a 13\" square. Roll dough loosely around rolling pin, then unfurl into baking pan. Gently lift and settle dough into bottom and up sides of pan. Trim any excess dough that extends past top lip of pan. Chill.",
        "Roll out second disc to a 13\" square. Transfer to parchment or a large cutting board. Using a ruler or straight edge, cut dough into 10 (1\"-wide) strips for lattice, or use a round cookie cutter or glass to cut into circles. Chill both crusts while you prepare the filling.",
        "Place racks in center and bottom of oven; preheat to 425°F. Place a rimmed baking sheet on bottom rack to preheat.",
        "Bring berries, preserves, cornstarch, lemon juice, and salt to a simmer in a small saucepan over medium heat and cook, stirring frequently to avoid scorching, until berries are broken down and mixture has thickened, about 7 minutes. Transfer to a large heatproof bowl and chill 15 minutes.",
        "Pour cooled berry mixture evenly over bottom crust. Arrange strips in a lattice pattern or overlap circles on top. Fold excess dough from top lip of pan down over itself to create a border. Crimp slightly, if desired. Chill 15 minutes. Beat egg and milk in a small bowl, if using.",
        "Brush top crust with egg wash and sprinkle with sugar, if using. Transfer baking pan to preheated baking sheet. Bake bar until crust begins to turn golden, about 25 minutes. Rotate sheet, move to center rack, and reduce oven temperature to 350°F. Continue baking, covering loosely with foil if crust gets too dark, until crust is golden brown and thickened juices are bubbling, 30–35 minutes more. Let cool completely on a wire rack. Lift bar out of pan using parchment overhang and cut into 16 squares.",
        "Bars can be made 3 days ahead; store in an airtight container at room temperature."
    ],
    "ingredients": [
        "Butter or nonstick vegetable oil spray (for pan)",
        "1 batch Our Favorite Pie Dough, divided into 2 discs, chilled",
        "All-purpose flour (for rolling)",
        "3 cups mixed berries, preferably a mix of blueberries and hulled, quartered strawberries",
        "1 cup blueberry preserves",
        "3 tablespoons cornstarch",
        "2 teaspoons fresh lemon juice",
        "1/8 teaspoon kosher salt",
        "1 large egg (optional)",
        "2 teaspoons milk (optional)",
        "1 teaspoon coarse sugar (optional)",
        "An 8x8x2\" baking pan (preferably metal)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pie",
        "Blueberry",
        "Strawberry",
        "Berry",
        "Potluck",
        "Summer",
        "Backyard BBQ",
        "Wedding",
        "Picnic"
    ],
    "title": "Mixed Berry Pie Bars",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-berry-pie-bars"
}
