{
    "directions": [
        "Wash all the pulses in cold water, then soak them in cold water overnight.",
        "Wash the rice in several changes of cold water until the water remains reasonably clear. Drain the rice, tip into a bowl and add enough cold water to cover the rice. Add 1 teaspoon of salt. Leave to soak for 2 hours.",
        "Peel and chop the onion.",
        "Spread out the herbs and pinch off the leaves and tender stalks to separate them from the tougher stalks, discarding wilting and yellowing leaves. Wash them in plenty of cold water and use a salad spinner or shake well to get rid of excess water. Chop the herbs finely with a sharp, wide-bladed knife, reducing the mountain of leaves you started off with to a small mound. Set aside. If you chop the herbs in advance, keep them fresh by covering with a damp tea towel in the fridge.",
        "Use a large, heavy-based saucepan (pulses expand considerably when cooked, so be sure your pan is big enough). Put the pan on a medium to high heat, add the butter, then add the oil and fry the chopped onion until soft and golden.",
        "Drain the pulses and add them to the pan. Stir to coat the pulses thoroughly in oil. Add 1 litre/1 3/4 pints of the boiling water and bring back to the boil. Do not add salt at this stage. Cover the pan with a lid and reduce the heat. Simmer for approximately 1 1/2 hours until all the pulses are very tender. You should be able to squash any of the beans of peas between your thumb and forefinger.",
        "Drain the rice and add to the pan. Crumble the stock cubes and add to the pan with the rest of the water. Simmer for 30 minutes until the rice is completely cooked (you should not be able to see whole grains of rice), stirring occasionally to prevent the mixture from sticking to the bottom of the pan.",
        "Add the herbs and the turmeric. Taste and adjust the seasoning. Simmer gently on a low heat for a further 30 minutes, stirring frequently. It is important to cook this aash slowly so that the herbs' aroma can develop and diffuse into the mixture.",
        "Heat 3 tablespoons of the oil in a small frying pan/skillet, add the sliced onion and fry until light brown. Add the chopped garlic, stir and set aside. Heat the butter with the remaining oil in a separate small pan. Add the dried mint, stir and remove from the heat immediately.",
        "Pour the aash into a large soup bowl and garnish with the fried onion and mint."
    ],
    "ingredients": [
        "50 g/2 oz mung beans",
        "50 g/2 oz split peas",
        "50 g/2 oz green lentils",
        "50 g/2 oz red kidney beans",
        "50 g/2 oz black-eyed beans (or white beans such as cannellini)",
        "50 g/2 oz chick peas",
        "50 g/2 oz rice (any variety)",
        "Salt and black pepper",
        "1 large onion",
        "150 g/5 oz spinach or (beetroot/beet leaves)",
        "100 g/ 3 1/2 oz fresh dill",
        "100 g/ 3 1/2 oz fresh coriander/cilantro",
        "100 g/ 3 1/2 oz fresh parsley",
        "100 g/ 3 1/2 oz fresh chives (or green parts of spring onions/scallions)",
        "50 g/2 oz fresh tarragon (or 2 tablespoons dried)",
        "30 g/ 1 oz fresh marzeh (summer savory) (optional)",
        "50 g/2 oz butter",
        "4 tablespoons sunflower oil",
        "2 litres/3 1/2 pints boiling water",
        "3 chicken/vegetable stock cubes",
        "1 teaspoon turmeric",
        "4 tablespoons sunflower oil",
        "1 medium onion, peeled and thinly sliced",
        "2 large cloves of garlic, finely chopped",
        "20 g/ 3/4 oz butter",
        "1 tablespoon dried mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Rice",
        "Appetizer",
        "Side",
        "Vegetarian",
        "Ramadan",
        "Dinner",
        "Lunch",
        "Chickpea",
        "Lentil",
        "Healthy",
        "Persian New Year",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Mixed Pulses and Herb Soup",
    "url": "http://www.epicurious.com/recipes/food/views/mixed-pulses-and-herb-soup-366151"
}
