{
    "directions": [
        "Preheat an oven to 375 degrees F (190 degrees C). Whisk together the all-purpose flour, wheat flour, sugar, salt, and baking powder in a mixing bowl. Whisk together the water, honey, and yogurt until smooth. Stir the yogurt mixture into the flour until a crumbly dough forms.",
        "Roll out 2/3 of the dough to fit a 8 inch pie plate. Bake the bottom crust in the preheated oven for 15 minutes. Meanwhile, roll out the top crust into a 10 inch circle. Cut into 1/2 inch strips with a sharp paring knife or pastry wheel. Set aside.",
        "Combine lemon juice, egg white, sugar, and butter in a saucepan and bring to a simmer. Stir in the blueberries and return to a low boil. Stir continuously until the berries burst.",
        "Place boysenberries and sliced strawberries into the baked pie shell, then pour the hot blueberry mixture on top and gently stir. Dot with butter, if desired. Add the pastry strips one at a time, weaving a lattice. Fold the ends of the lattice strips under the edge of the bottom crust and flute the crust. Brush lattice with egg wash, milk, or water, and sprinkle with sugar (optional).",
        "Return assembled pie to the oven and bake until the crust is golden brown, 15 to 20 minutes. Allow the pie to cool for 1 hour and 30 minutes before serving."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "2 cups whole wheat flour",
        "2 tablespoons white sugar",
        "1 1/2 teaspoons salt",
        "1 tablespoon baking powder",
        "1/2 cup ice water",
        "2 tablespoons honey",
        "1 1/4 cups plain yogurt",
        "1 pint fresh blueberries",
        "1 pint fresh boysenberries",
        "1/2 pint fresh strawberries",
        "1 tablespoon all-purpose flour",
        "1 egg white",
        "1 1/2 teaspoons butter",
        "1 tablespoon lemon juice",
        "1/2 cup white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mixed Berry Pie with Honey Whole Wheat Crust",
    "url": "http://allrecipes.com/recipe/202262/mixed-berry-pie-with-honey-whole-whea/"
}
