{
    "directions": [
        "First make the brownie crust.  Begin by melting butter in medium saucepan over low heat.  Add 2 ounces chopped chocolate to the butter; stir until chocolate melts, and remove from heat.  Whisk in   1/3 cup flour, 1/3 cup sugar, 1 large egg, 1/2 teaspoon vanilla extract, and pinch of salt.  Spread batter in thin layer on bottom of greased and floured 8 x 8 x 2 inch pan.",
        "Bake at 350 degrees F (175 degrees C) until tester toothpick inserted into center comes out with only moist crumbs attached, about 10 minutes.  Cool.",
        "Next make the filling.  In a small saucepan, stir cream and coffee powder over medium-high heat until coffee powder dissolves.  Cool.",
        "Beat cream cheese and 2/3 cup sugar in large bowl until light and fluffy.  Beat in 1 egg and yolk.  Add 1/4 cup sour cream, 1 tablespoon flour, 1/2 teaspoon vanilla, and the coffee mixture; beat until smooth.  Stir in chocolate chips.  Spoon filling evenly over brownie crust.",
        "Reduce oven temperature to 325 degrees F (165 degrees C).  Bake about 35 minutes, or until filling puffs slightly around the edges and center is set.  Cool completely on rack.  Cover pan with foil, and chill overnight.",
        "Now make the topping.  In a small saucepan, stir 1 cup sour cream and confectioners' sugar over low heat until sugar dissolves; do not boil.  Spread topping evenly over filling.  Cool slightly.  Cover and chill until topping sets, at least 2 hours.  Cut dessert into 24 bars.  Serve cold."
    ],
    "ingredients": [
        "1/4 cup unsalted butter",
        "2 (1 ounce) squares semisweet chocolate, chopped",
        "1/3 cup all-purpose flour",
        "1/3 cup white sugar",
        "1 egg",
        "1/2 teaspoon vanilla extract",
        "1 pinch salt",
        "1/3 cup heavy whipping cream",
        "1 (8 ounce) package cream cheese, softened",
        "2/3 cup white sugar",
        "1 egg",
        "1 egg yolk",
        "1/4 cup sour cream",
        "1 tablespoon all-purpose flour",
        "1/2 teaspoon vanilla extract",
        "1/3 cup mini semi-sweet chocolate chips",
        "1 1/2 tablespoons instant coffee powder",
        "1/3 cup confectioners' sugar",
        "1 cup sour cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mocha Cheesecake Brownie Bars",
    "url": "http://allrecipes.com/recipe/10850/mocha-cheesecake-brownie-bars/"
}
