{
    "directions": [
        "Combine first 4 ingredients in processor. Using on/off turns, cut in butter and shortening until mixture resembles coarse meal. Blend in orange juice and enough water by tablespoonfuls to form moist clumps. Gather dough into ball; flatten into disk. Wrap in plastic and chill 1 hour. (Can be prepared 1 day ahead. Keep refrigerated. Soften dough slightly at room temperature before rolling.) Preheat oven to 350° F. Roll out dough on lightly floured surface to 12-inch-diameter round. Transfer to 9-inch-diameter glass pie dish. Trim edges and crimp decoratively. Freeze 15 minutes. Line crust with foil; fill with dried beans or pie weights. Bake 15 minutes. Remove foil and beans. Bake crust until pale golden, about 10 minutes. Cool on rack.",
        "Melt butter in heavy small saucepan over medium heat. Stir in cocoa, then cream and espresso powder. Pour into large bowl. Add corn syrup, sugar, eggs, vanilla and salt; whisk until well blended. Stir in pecans. Pour filling into pie crust. Bake until puffed and set, about 1 hour. Transfer to rack and cool completely. (Can be made 1 day ahead. Cover and let stand at room temperature.)",
        "Cut pie into wedges. Transfer to plates. Serve with dollops of Coffee Whipped Cream."
    ],
    "ingredients": [
        "1 1/4 cups all purpose flour",
        "1 tablespoon grated orange peel",
        "1 teaspoon sugar",
        "1/4 teaspoon salt",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into small pieces",
        "1/4 cup solid vegetable shortening, cut into small pieces",
        "1 tablespoon orange juice",
        "2 tablespoons (about) ice water",
        "3 tablespoons unsalted butter",
        "3 tablespoons unsweetened cocoa powder",
        "1 tablespoon whipping cream",
        "2 teaspoons instant espresso powder or instant coffee powder",
        "1 cup light corn syrup",
        "1 cup sugar",
        "3 large eggs",
        "2 teaspoons vanilla extract",
        "1/4 teaspoon salt",
        "1 1/2 cups coarsely chopped pecans (about 6 ounces)",
        "1 cup chilled whipping cream",
        "3 tablespoons coffee liqueur",
        "1 tablespoon powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Liqueur",
        "Milk/Cream",
        "Food Processor",
        "Chocolate",
        "Nut",
        "Dessert",
        "Thanksgiving",
        "Pecan",
        "Fall",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mocha Pecan Pie with Coffee Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/mocha-pecan-pie-with-coffee-whipped-cream-2617"
}
