{
    "directions": [
        "Combine 3 tablespoons water and sugar in small saucepan. Bring to boil over medium-high heat, stirring until sugar dissolves. Remove from heat. Mix in Cognac. Cool.",
        "Combine milk and espresso powder in heavy medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring to simmer. Remove from heat. Discard bean. Using electric mixer, beat yolks and sugar in large bowl until very thick, about 3 minutes. Sift in cornstarch; beat to blend well. Gradually beat hot milk mixture into egg mixture. Return mixture to saucepan. Whisk over medium heat until mixture comes to boil, about 3 minutes. Remove from heat. Add chocolate. Whisk until chocolate melts and mixture is smooth. Transfer to medium bowl. Place plastic wrap directly onto surface of pastry cream. Refrigerate until cold, about 3 hours. (Can be made 2 days ahead. Cover syrup and store at room temperature. Keep pastry cream refrigerated.)",
        "Whisk cold pastry cream until smooth. Using electric mixer, beat whipping cream in large bowl until medium-stiff peaks form. Transfer 1 1/2 cups whipped cream to another medium bowl; set aside to use as topping. Stir 1/3 of remaining whipped cream from large bowl into pastry cream to lighten. Fold remaining whipped cream from large bowl into pastry cream in 2 additions.",
        "Place 1 cake layer in bottom of 8-inch-diameter, 3-quart trifle bowl. Brush 1/4 of syrup over cake. Spread 3 tablespoons raspberry preserves over cake. Spread 1 cup pastry cream over. Arrange 1/2 cup fresh or frozen raspberries atop pastry cream. Repeat layering 3 times with remaining cake layers, syrup, preserves, pastry cream and 1 1/2 cups fresh or frozen raspberries.",
        "Spread reserved 1 1/2 cups whipped cream over trifle. Top whipped cream with 2 cups fresh raspberries. Lightly brush red currant jelly mixture over raspberries. Sprinkle with 1 1/2 teaspoons sugar. Garnish with red currant bunches or grape clusters, if desired. Cover and refrigerate at least 3 hours. (Can be prepared 8 hours ahead. Keep refrigerated.)"
    ],
    "ingredients": [
        "3 tablespoons water",
        "2 tablespoons sugar",
        "3 tablespoons Cognac or other brandy",
        "2 cups whole milk",
        "1 tablespoon instant espresso powder",
        "1 vanilla bean, split lengthwise",
        "6 large egg yolks",
        "3/4 cup sugar",
        "1/4 cup cornstarch",
        "3 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 3/4 cups chilled whipping cream",
        "2 purchased 8-inch-diameter, 1- to 1 1/4-inch-thick round sponge cakes, each cut horizontally in half",
        "3/4 cup raspberry preserves (about 10 ounces)",
        "2 cups fresh or frozen raspberries (unthawed)",
        "2 cups fresh raspberries",
        "2 tablespoons red currant jelly, melted with 1 tablespoon water",
        "1 1/2 teaspoons sugar",
        "Red currant bunches or red grape clusters (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Mixer",
        "Fruit",
        "Dessert",
        "Christmas",
        "Vegetarian",
        "Raspberry",
        "Cognac/Armagnac",
        "Chill"
    ],
    "title": "Mocha and Raspberry Trifle",
    "url": "http://www.epicurious.com/recipes/food/views/mocha-and-raspberry-trifle-5745"
}
