{
    "directions": [
        "Preheat oven to 350°F. Line 1 large cookie sheet with parchment. Brush lightly with vegetable oil. Finely grind hazelnuts in processor. Add sugar and flour; blend to powder. With machine running, add egg white and vanilla; blend to paste.",
        "Spoon mixture into pastry bag fitted with no. 4 (3/8-inch-diameter) round tip. Pipe 3/4- to 1-inch-diameter mound onto parchment about 1/2 inch high and spacing 1 inch apart. Dip finger into water and gently press top of cookie to flatten center slightly. Bake until golden brown, about 12 minutes (cookies will spread to about 1 1/2 inches.) Turn parchment (cookies will adhere) over onto work surface. Brush parchment with just enough water to moisten. Let stand until parchment can easily be pulled off cookies, about 2 minutes. Peel off parchment.",
        "Bring cream and butter to simmer in heavy medium saucepan over medium heat. Add instant coffee granules; stir to dissolve. Reduce heat to low. Add chocolate; stir until melted. Mix in vanilla. Pour into bowl. Chill until firm enough to spread, stirring occasionally, about 45 minutes.",
        "Line cookie sheet with foil. Using icing spatula, spread 1 heaping teaspoon ganache onto flat side of each cookie, mounding to dome in center. Place ganache side up on prepared cookie sheet. Repeat with remaining cookies. Chill until ganache sets, 20 minutes.",
        "Line cookie sheet with aluminum foil. Melt bittersweet chocolate with vegetable shortening in top of double boiler over simmering water, stirring until smooth. Remove from over water. Grasp 1 cookie between thumb and index finger. Dip ganache portion into melted chocolate. Shake of excess. Turn chocolate side up and place on foil-lined cookie sheet. Top with raspberry or hazelnut. Repeat with remaining cookies. Refrigerate until chocolate sets, about 30 minutes.",
        "Melt white chocolate in top of double boiler over simmering water, stirring until smooth. Dip spoon into chocolate. Wave from side to side over cookies, forming decorative pattern. Refrigerate until white chocolate sets, about 15 minutes. Place cookies in single layer in airtight containers; chill overnight. (Can be prepared 3 days ahead.) let stand 10 minutes at room temperature before serving."
    ],
    "ingredients": [
        "1/2 cup hazelnuts, lightly toasted (about 2 1/2 ounces)",
        "1/2 cup sugar",
        "1 tablespoon all purpose flour",
        "1 large egg white",
        "1 teaspoon vanilla extract",
        "1/4 cup plus 2 tablespoons whipping cream",
        "3 tablespoons unsalted butter",
        "1 teaspoon instant coffee granules",
        "9 ounces imported milk chocolate (such as Lindt), chopped",
        "1 teaspoon vanilla extract",
        "9 ounces bittersweet (not unsweetened) or semisweet chocolate,chopped",
        "1 tablespoon solid vegetable shortening",
        "30 (about) small raspberries or hazelnuts",
        "3 ounces imported white chocolate (such as Lindt), chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Coffee",
        "Food Processor",
        "Chocolate",
        "Dessert",
        "Bake",
        "Christmas",
        "Raspberry",
        "Winter",
        "Hazelnut",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mocha-Hazelnut Macaroon Domes",
    "url": "http://www.epicurious.com/recipes/food/views/mocha-hazelnut-macaroon-domes-2862"
}
