{
    "directions": [
        "Place crusts on 2 rimless baking sheets and chill while preparing filling.",
        "Place 1/3 of apples in processor. Using on/off turns, chop into small pieces. Transfer chopped apples to large saucepan. Repeat chopping remaining apples in 2 more batches in processor; add to saucepan. Place all dried fruit in processor. Using on/off turns, chop until beginning to stick together. Add dried fruits to saucepan with apples. Add sugar, molasses, rum, brandy, cornstarch, butter, orange peel, lemon peel, spices, and sea salt; stir to blend. Simmer over medium-low heat until mixture is very thick, stirring often to prevent scorching, 10 to 12 minutes. Remove from heat. Transfer pie filling to large bowl and cool completely, about 1 hour.",
        "Position rack in bottom third of oven; preheat to 375°F. Transfer 1 crust to 9-inch glass pie dish, leaving dough overhang. Spread cooled filling in crust. Cut second crust into 1/2-inch-wide strips. Arrange 6 dough strips atop filling, spacing 1 inch apart. Place 6 dough strips at 45-degree angle to first strips, forming diamond lattice pattern. Trim strip ends even with bottom crust. Fold crust edge and strips in; press edge with tines of fork to seal. (Feeling ambitious? Click here for tips on making a woven lattice crust.) Whisk cream and sugar in small bowl to blend for glaze. Brush glaze over lattice.",
        "Bake pie 15 minutes. Reduce oven temperature to 350°F and continue to bake until crust is golden brown and filling is bubbling, 50 to 60 minutes. Transfer pie to rack and cool completely for filling to set. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate. Let stand at room temperature 2 hours before serving. If desired, rewarm pie in 325°F oven 10 to 15 minutes before serving.",
        "Serve pie warm or at room temperature."
    ],
    "ingredients": [
        "2 12-inch round Pie Crusts",
        "1 1/2 pounds Granny Smith apples (about 3 large), peeled, quartered, cored, cut into 1/2-inch cubes",
        "1 cup dried currants",
        "3/4 cup golden raisins",
        "3/4 cup sweetened dried cranberries",
        "3/4 cup diced dried apricots",
        "1/2 cup dried tart or sweet cherries",
        "1 cup sugar",
        "2 tablespoons mild-flavored (light) molasses",
        "2 tablespoons dark rum",
        "2 tablespoons brandy",
        "2 tablespoons cornstarch",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 teaspoon finely grated orange peel",
        "3/4 teaspoon finely grated lemon peel",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground allspice",
        "Large pinch of ground cloves",
        "Large pinch of fine sea salt",
        "1 tablespoon heavy whipping cream",
        "1 tablespoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Food Processor",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "High Fiber",
        "Dried Fruit",
        "Raisin",
        "Apple",
        "Brandy",
        "Fall",
        "Chill",
        "Cinnamon",
        "Clove",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mock Mincemeat Pie",
    "url": "http://www.epicurious.com/recipes/food/views/mock-mincemeat-pie-355850"
}
