{
    "directions": [
        "Combine first 17 ingredients in heavy large saucepan or Dutch oven. Cook over low heat until apples are very tender and mixture is thick, stirring occasionally, about 1 1/2 hours. Cool filling completely. (Can be prepared up to 1 week ahead. Cover and refrigerate.)",
        "Position rack in lowest third of oven and preheat to 400°F. Roll out 1 pie crust disk on lightly floured surface to 13-inch-diameter round (about 1/8 inch thick). Roll up dough on rolling pin and transfer to 9-inch-diameter glass pie plate. Gently press into place. Trim edges of crust, leaving 3/4-inch overhang. Fold overhang under crust so that crust is flush with edge of pie pan. Crimp edges with fork to make decorative border. Spoon filling into crustlined pan, gently pressing flat.",
        "Roll out second disk on lightly floured surface to 13-inch round. Cut out about 28 three-inch leaves using cookie cutter. Press leaves lightly with tines of fork to form vein pattern. Brush bottom of 1 leaf with milk. Place leaf atop mince, overlapping crust slightly and pressing to adhere to crust. Continue placing leaves atop pie in concentric circles, overlapping edges slightly until top of pie is covered. Brush crust with milk. Bake until crust is golden brown and mince bubbles, about 40 minutes. Cool completely. Serve pie with rum raisin ice cream if desired."
    ],
    "ingredients": [
        "3 1/2 pounds small pippin apples (about 7), peeled, cored, chopped",
        "1/2 cup chopped pitted prunes",
        "1/2 cup golden raisins",
        "1/2 cup dried currants",
        "1/2 cup firmly packed dark brown sugar",
        "1/4 cup unsulfured (light) molasses",
        "1/4 cup brandy",
        "1/4 cup orange juice",
        "1/4 cup (1/2 stick) unsalted butter, cut into pieces",
        "2 tablespoons dark rum",
        "1 tablespoon grated orange peel",
        "1 teaspoon grated lemon peel",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon ground nutmeg",
        "Pinch of salt",
        "2 Buttermilk Pie Crust Dough disks",
        "Milk",
        "Rum raisin ice cream (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Currant",
        "Prune",
        "Raisin",
        "Apple",
        "Spice",
        "Brandy",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Modern Mince Pie",
    "url": "http://www.epicurious.com/recipes/food/views/modern-mince-pie-2694"
}
