{
    "directions": [
        "Submerge the chicken livers in the milk and soak overnight in the refrigerator. Strain and pat dry with a paper towel.",
        "Bring a large pot of salted water to a boil. Submerge the eggs and boil for 6 minutes. Strain and peel the eggs under cold running water.",
        "Thinly slice 1 carrot and cut the slices into thin julienne.",
        "Peel the tough outer leaves from the leeks and halve them lengthwise, starting 1/2 inch from their base to keep them intact. Rinse them with cold water to wash any sand from their layers. Bunch the leeks and tie together with butcher's twine. Place in a large pot with the remaining carrots, the bay leaf, and thyme and cover with cold salted water. Bring to a simmer and cook for 20 minutes, or until the carrots are tender. Strain, and discard the thyme and bay leaf.",
        "Transfer the carrots to a blender with 5 tablespoons water, the mustard, and vinegar. Puree until smooth, then stream in the olive oil until emulsified. Season with salt and pepper.",
        "Untie the leeks, pat dry with paper towels, and brush them with carrot dressing; sprinkle with salt and pepper.",
        "In a large sauté pan over medium heat, sear the bacon on both sides until crispy, about 6 minutes total. Strain off all but 1 tablespoon fat, transfer the bacon to a cutting board, and cut the strips crosswise into 1/2-inch pieces. Season the chicken livers on all sides with salt and pepper. Return the sauté pan with the bacon fat to high heat and add the livers in a single layer. Sear the livers on both sides until cooked through but still light pink in the center, about 5 minutes total. Scoop onto a cutting board and slice the livers in half.",
        "Spoon the carrot vinaigrette into the center of 6 salad plates and top each with a fanned-out seasoned leek and 1 egg. Divide the bacon, chicken livers, julienned carrot, and chives on top."
    ],
    "ingredients": [
        "8 ounces chicken livers (about 12), trimmed",
        "2 cups milk",
        "Salt",
        "6 eggs",
        "4 small carrots (about 1 pound), peeled",
        "6 small leeks",
        "1 bay leaf",
        "2 sprigs thyme",
        "1/4 cup Dijon mustard",
        "2 tablespoons sherry vinegar",
        "5 tablespoons olive oil",
        "Freshly ground white pepper",
        "Six (1/4-inch-thick) slices of bacon",
        "1/2 bunch chives, cut into 1-inch batons"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Egg",
        "Bacon",
        "Leek"
    ],
    "title": "Modern Salade Lyonnaise with Leeks, Lardons, and Oeuf Mollet",
    "url": "http://www.epicurious.com/recipes/food/views/modern-salade-lyonnaise-with-leeks-lardons-and-oeuf-mollet-51199020"
}
