{
    "directions": [
        "Combine all of the marinade ingredients in a medium bowl, reserving 1 Tbsp. olive oil.",
        "Put the pork loin in a large ziplock bag with the marinade, seal and massage the marinade into the pork. Put the bag in the fridge and marinate for at least 5 hours or overnight.",
        "Preheat the oven to 425°F.",
        "Heat reserved​ 1 Tbsp. oil in a large ovenproof frying pan over medium heat. Remove the pork from the bag and allow the excess marinade to drip away. Cook the pork, turning frequently, for 5 minutes, or until golden brown on all sides.",
        "Put the pan in the oven and cook for 7 minutes, or until a thermometer inserted into the meat reads 143–149°F. Remove from the oven and rest for 10 minutes before slicing.",
        "Put the apple, cabbage, garlic, chile, spring onion, and cilantro in a medium bowl. Pour over the vinegar, season with salt and pepper, and toss to combine.",
        "Assembling a taco is a very personal thing so I’m not going to tell you how to make yours, but here’s how I do mine:",
        "I preheat the oven to 350°F. I wrap my tortillas in foil with the dry herbs and stick them in the oven.",
        "I get my warm tortilla, put down a layer of avocado slices, then a layer of pork, and then spoon on the epic slaw. I wrap it up and there’s no holding back. So get in there like a shot of tequila and make a mess!"
    ],
    "ingredients": [
        "1 large handful cilantro leaves, finely chopped",
        "1 handful mint leaves, finely chopped",
        "1/2 cup finely chopped parsley",
        "1/2 cup fresh oregano leaves",
        "8 garlic cloves, crushed (about 1/2 cup)",
        "1 red chile, finely chopped (keep the seeds if you like it hot)",
        "Zest and juice of 4 limes",
        "Zest and juice of 2 oranges",
        "Zest and juice of 2 lemons",
        "1 teaspoon ground cumin",
        "3/4 cup plus 3 tablespoons olive oil",
        "1 (6 1/2–7-pound) pork loin",
        "2 green apples, coarsely grated",
        "1/3 head red cabbage, coarsely grated",
        "1 garlic clove, crushed",
        "1 red chile, finely chopped (keep the seeds if you like it hot)",
        "8 spring onions (scallions), finely sliced",
        "1 handful cilantro, leaves picked",
        "1 1/4 cups white wine vinegar or apple cider vinegar",
        "12 tortillas",
        "1 teaspoon mixed dried herbs",
        "3 avocados, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Taco",
        "Pork",
        "Oregano",
        "Orange Juice",
        "Cilantro",
        "Cabbage",
        "Apple",
        "Garlic",
        "Dinner",
        "Lunch",
        "Summer",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Mojo Pork Tacos With Sweet Apple Slaw",
    "url": "http://www.epicurious.com/recipes/food/views/mojo-pork-tacos-with-sweet-apple-slaw"
}
