{
    "directions": [
        "Put pork butt, fat side up, on a work surface, then halve horizontally with a sharp large knife.",
        "Stir together water, salt, brown sugar, and Instacure in storage tub until solids are dissolved, about 3 minutes, then add molasses and stir until dissolved. Add ice and stir until cure is cold (ice may not be completely melted; keeping liquid cold slows salt absorption).",
        "Add pork to cure, then weight with a large plate to keep submerged. Chill, tub covered with a lid or plastic wrap, 36 hours.",
        "Rinse pork and pat dry, then discard brine. Sprinkle pork evenly with pepper (if using).",
        "Prepare grill and smoke bacon: See preceding recipe.",
        "Cut bacon crosswise into 1/8-inch-thick slices with a sharp knife, then fry in a heavy skillet over moderately low heat, turning, until browned. Transfer to paper towels to drain.",
        "Available at The Sausage Maker (888-490-8525)."
    ],
    "ingredients": [
        "1 (4- to 6-lb) boneless pork shoulder Boston roast (Boston butt)",
        "6 cups water",
        "1 cup kosher salt",
        "2/3 cup packed dark brown sugar",
        "2 1/2 tablespoons Instacure No. 1*",
        "1/2 cup mild molasses",
        "3 cups ice cubes",
        "4 tablespoons coarsely ground black pepper (optional)",
        "Special equipment: 1- to 2-gallon plastic storage tub or stainless-steel bowl; a 221/2-inch covered kettle grill with a hinged top rack; a 12- by 8- by 2-inch disposable aluminum roasting pan; 3 lb hardwood sawdust*; charcoal briquettes; a chimney starter; long metal tongs; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Side",
        "Summer",
        "Grill/Barbecue",
        "Molasses",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Molasses-Cured Pork Shoulder Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/molasses-cured-pork-shoulder-bacon-106607"
}
