{
    "directions": [
        "For cookies: Preheat oven to 325°F. Butter 2 large nonstick cookie sheets. Bring first 5 ingredients to simmer in heavy small saucepan over medium heat, stirring constantly. Remove from heat. Whisk in vanilla, then flour. Cool cookie mixture 10 minutes.",
        "Drop mixture by level tablespoonfuls onto cookie sheets, spacing 6-inches apart and forming 3 cookies on each sheet. Using buttered fingertips, press out each round to 4 1/2-inch diameter.",
        "Bake 1 sheet until cookies are deep brown, about 12 minutes. Cool cookies on sheet just until firm enough to lift without breaking, about 2 minutes. Working quickly, lift 1 cookie from sheet. Drape cookie top side up over inverted 3/4-cup custard dish. Gently flatten cookie on dish bottom; crimp sides to form fluted cup. Repeat with remaining 2 cookies, returning cookie sheet to oven briefly if cookies harden. Repeat baking and molding process with remaining cookies. Cool. Gently remove cookies from dishes.",
        "For fruit: Stir first 3 ingredients in heavy small saucepan over medium heat until sugar dissolves. Increase heat and boil 3 minutes. Refrigerate ginger syrup until cold. (Cookies and syrup can be prepared 1 week ahead. Store cookies at room temperature in airtight container. Keep sauce refrigerated.) Place fruit in bowl. Add half of ginger syrup and toss well.",
        "Place 1 cookie on each of 6 plates. Fill each with 3 scoops of sorbet and spoon fruit and remaining syrup over."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter",
        "1/4 cup sugar",
        "1/4 cup light unsulfured molasses",
        "1/2 teaspoon grated lemon peel",
        "1/2 teaspoon ground ginger",
        "1 teaspoon vanilla extract",
        "1/2 cup all purpose flour, sifted",
        "1/2 cup sugar",
        "1/2 cup water",
        "1/4 cup minced crystallized ginger",
        "1 1-pint basket strawberries, hulled, quartered",
        "1 1/2-pint basket blueberries",
        "2 peaches, peeled, pitted, sliced",
        "2 pints purchased lemon sorbet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Frozen Dessert",
        "Blueberry",
        "Strawberry",
        "Lemon",
        "Peach",
        "Summer",
        "Molasses",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Molasses Cookie Baskets with Lemon Sorbet and Gingered Fruit",
    "url": "http://www.epicurious.com/recipes/food/views/molasses-cookie-baskets-with-lemon-sorbet-and-gingered-fruit-2399"
}
