{
    "directions": [
        "Stir sugar, molasses and butter in heavy 2- to 3-quart saucepan over low heat until butter melts. Cool mixture to lukewarm.",
        "Stir egg, vinegar and vanilla into molasses mixture. Combine 3 cups flour and next 6 ingredients and gradually stir into molasses mixture. Cover and chill 1 1/2 hours to firm. (Can be prepared 3 days ahead.)",
        "Invert baking sheets and cover undersides with foil. Brush with melted butter and dust with flour, shaking off excess. Form dough into 1-inch balls. Arrange on foil, spacing 3 inches apart. Flatten each cookie into 3-inch round (saucepan bottom wrapped in plastic works well.) Chill 1 1/2 hours.",
        "Preheat oven to 325°F. Bake cookies until honey colored, about 14 minutes. Slide foil onto work surface. Gently press each cookie with spatula to flatten. Cool. (Can be prepared 2 days ahead. Store in airtight container.)",
        "Blend 1 1/4 cups sugar and 3 1/2 tablespoons ginger in processor until ginger is minced, stopping occasionally to scrape down sides of work bowl, about 2 minutes. Add 2 tablespoons marmalade and 2 tablespoons butter. Process until thick and well blended, about 1 1/2 minutes. Transfer mixture to small bowl. Repeat with remaining sugar, ginger, marmalade and butter. Add to bowl. (Can be prepared 1 day ahead and refrigerated. Bring to room temperature before continuing.)",
        "Spread 1 tablespoon filling on bottom of cookie, smoothing to edges. Press bottom of another cookie firmly onto filling. Repeat with remaining cookies. (Can be prepared 6 hours ahead. Store uncovered to retain crispness.)"
    ],
    "ingredients": [
        "2/3 cup firmly packed light brown sugar",
        "1/2 cup light molasses",
        "1/2 cup (1 stick) unsalted butter",
        "1 extra-large egg",
        "1 tablespoon cider vinegar",
        "2 teaspoons vanilla",
        "3 cups sifted all purpose flour",
        "3/4 teaspoon ground ginger",
        "3/4 teaspoon baking soda",
        "3/4 teaspoon cinnamon",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground cloves",
        "1/4 teaspoon ground cardamom",
        "Melted butter",
        "All purpose flour",
        "2 1/2 cups powdered sugar",
        "7 tablespoons chopped crystallized ginger (3 ounces)",
        "4 tablespoons ginger marmalade",
        "4 tablespoons well-chilled unsalted butter, cut into 4 pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Food Processor",
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "Party",
        "Molasses",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Molasses Jumbos with Ginger Filling",
    "url": "http://www.epicurious.com/recipes/food/views/molasses-jumbos-with-ginger-filling-235643"
}
