{
    "directions": [
        "Combine broth, carrots, celery, onion, and bay leaves in large saucepan. Add reserved neck, heart, and gizzard. Bring to boil; reduce heat to medium-low and simmer until stock is reduced to 3 1/4 cups, about 1 hour. Strain turkey stock into medium bowl. (Can be made 1 day ahead. Cover stock and refrigerate.)",
        "Line very large (about 16-quart) bowl with two 30-gallon plastic bags, one inside the other. Rinse turkey inside and out. Place turkey in plastic-lined bowl. Combine 7 quarts water, salt, sugar, molasses, 1 bunch thyme, and 1/2 bunch sage in large bowl or pot. Stir until salt and sugar dissolve. Mix in ice cubes. Pour brine over turkey in plastic bags. Gather tops of bags together, eliminating air space above brine; seal bags. Refrigerate turkey in brine 18 to 20 hours.",
        "Set rack at lowest position in oven and preheat to 350°F. Remove turkey from brine. Drain very well; discard brine. Pat turkey dry inside and out. Place turkey on small rack set in large roasting pan. Fill main cavity with remaining 1 bunch thyme and 1/2 bunch sage, onions, and garlic. Stir oil, pepper, chopped thyme, and chopped sage in small bowl to form paste; smear all over outside of turkey. Tuck wing tips under; tie legs together loosely to hold shape.",
        "Roast turkey 1 hour, tenting loosely with foil if browning quickly. Turn pan around; roast turkey 30 minutes. Pour 1 cup broth over turkey; re-tent loosely with foil. Roast turkey, basting with 1 cup broth every 30 minutes until thermometer inserted into thickest part of thigh registers 175°F, about 2 hours longer. Transfer turkey to platter. Remove vegetables and herbs from main cavity and discard. Spoon any juices from cavity into roasting pan. Let turkey stand 30 minutes (internal temperature will increase 5 to 10 degrees).",
        "Strain pan juices into bowl. Spoon off fat, reserving 2 tablespoons. Heat reserved 2 tablespoons turkey fat in heavy large saucepan over medium-high heat. Add onion and thyme. Sauté until onion browns, about 10 minutes. Add turkey stock, gingersnaps, 3 tablespoons cider vinegar, and Worcestershire sauce. Add 2 cups degreased pan juices and bring to boil, whisking to dissolve gingersnaps. Reduce heat to medium-low and simmer until gravy thickens, about 4 minutes. Season gravy to taste with salt and pepper, adding remaining tablespoon vinegar and cream, if desired.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "5 cups low-salt chicken broth",
        "2 medium carrots, chopped",
        "2 large celery stalks, chopped",
        "1 onion, halved",
        "2 small bay leaves",
        "Neck, heart, and gizzard reserved from 18- to 20-pound turkey",
        "1 18- to 20-pound turkey",
        "7 quarts water",
        "2 cups coarse salt (about 9 ounces)",
        "1 cup (packed) dark brown sugar",
        "1 cup mild-flavored (light) molasses",
        "2 bunches fresh thyme",
        "1 bunch fresh sage",
        "2 quarts ice cubes",
        "2 large onions, halved",
        "1 head of garlic, halved horizontally",
        "3 tablespoons olive oil",
        "1 tablespoon ground black pepper",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh sage",
        "4 cups (about) low-salt chicken broth",
        "1 cup finely chopped onion",
        "1 tablespoon chopped fresh thyme",
        "20 gingersnap cookies, coarsely crumbled (about 1 3/4 cups)",
        "3 to 4 tablespoons apple cider vinegar",
        "1 teaspoon Worcestershire sauce",
        "1/4 cup whipping cream (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Fall",
        "Brine",
        "Molasses"
    ],
    "title": "Molasses-Brined Turkey with Gingersnap Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/molasses-brined-turkey-with-gingersnap-gravy-107284"
}
