{
    "directions": [
        "Poach the chicken in 2 quarts water with the onion, garlic, and salt. When cooked through, transfer the chicken to a plate and reserve the cooking liquid. Pour the liquid through a fine-mesh sieve and reserve. Remove and reserve the meat from the bones, discarding the bones and skin.",
        "On a comal or in a cast-iron skillet over moderately high heat, dry-roast the chiles, flipping occasionally, until they start to blister and change color. Transfer the chiles to a bowl of hot water and soak for 15 minutes. Drain the chiles and reserve the water then transfer the chiles to a blender or food processor and blend until smooth, adding the reserved water as needed. Push the purée through a small mesh sieve and set aside.",
        "On a comal or in a cast-iron skillet over moderate heat, dry-roast the tomatoes, tomatillos, onion, and garlic. Remove from heat and let cool. Once cool enough to handle, peel the tomatoes and the garlic.",
        "In a small skillet, over moderately low heat, heat 1 tablespoon of the lard. Add the peppercorns, cloves, cinnamon, coriander, and anise seeds and toast until fragrant. Remove from the heat.",
        "Using the remaining 4 tablespoons of lard, fry the raisins until they plump and change color. Remove with a slotted spoon. Continue the frying process with the almonds, pumpkin seeds, sesame seeds, tortillas, bread, and reserved chile seeds, adding more lard if needed.",
        "In a blender or food processor, purée the roasted vegetables, spices, and fried ingredients in small batches, adding water as needed, to form a smooth purée. Strain through a fine-mesh sieve and set aside.",
        "In a Dutch oven over moderate heat, heat the canola oil until hot but not smoking. Fry the chile purée, stirring constantly until it changes color, about 8 minutes. Add the reserved vegetable and spice mixture. Reduce the heat and simmer, stirring occasionally until the mole thickens, about 1 hour. Add about 2 cups of the reserved chicken broth and simmer for 30 minutes. The mole should be thick enough to coat the back of a spoon. Add the chocolate and cook for 10 to 12 minutes. Season to taste with salt and sugar, and add more chocolate if needed.",
        "To serve, ladle mole over the chicken until it is completely covered, then garnish with toasted sesame seeds."
    ],
    "ingredients": [
        "8 bone-in, skin-on chicken breasts or legs, rinsed, dried",
        "1 medium onion, halved",
        "5 cloves garlic",
        "Kosher salt",
        "8 dried mulato chiles, wiped clean, seeds and veins removed, and seeds reserved",
        "5 dried ancho chiles, wiped clean, seeds and veins removed, and seeds reserved",
        "6 dried pasilla chiles, wiped clean, seeds and veins removed, and seeds reserved",
        "2 dried chipotle chiles, wiped clean, seeds and veins removed, and seeds reserved",
        "4 Roma tomatoes, cut into quarters",
        "6 tomatillos, husked, rinsed, and cut into quarters",
        "1 medium onion, halved",
        "3 cloves garlic, unpeeled",
        "5 tablespoons lard or shortening, or more as needed",
        "10 whole black peppercorns",
        "3 whole cloves",
        "1 (3-inch) stick Mexican canela or cinnamon",
        "1/2 teaspoon whole coriander seeds",
        "1/2 teaspoon whole anise seeds",
        "2 teaspoons black raisins",
        "20 whole almonds, blanched",
        "2 ounces pumpkin seeds",
        "1/2 cup sesame seeds",
        "2 stale corn tortillas",
        "3 stale baguettes, cut into 1-inch slices",
        "1 tablespoon canola oil",
        "4 ounces Mexican chocolate, or more to taste, coarsely chopped",
        "Kosher salt",
        "Up to 1/2 cup of sugar, as needed",
        "1/4 cup sesame seeds, lightly toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Chicken",
        "Chocolate",
        "Nut",
        "Tomato",
        "Dinner",
        "Tomatillo",
        "Seed",
        "Simmer",
        "Chile Pepper",
        "Dairy Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Mole Poblano",
    "url": "http://www.epicurious.com/recipes/food/views/mole-poblano-51110440"
}
