{
    "directions": [
        "Preheat the oven to 300°F.",
        "To prepare the ice cream, place the cherries and sherry in a mixing bowl and let soak for 20 minutes. Place the cream in a saucepan, add the half-and-half, sugar, vanilla bean and seeds, almond extract, almonds, and cherries with their soaking liquid, and bring to a boil. Whisk the egg yolks in a mixing bowl and slowly add the cream mixture while continuing to whisk vigorously. Return to the saucepan and cook over low heat while whisking continuously, until the mixture coats the back of a wooden spoon. Remove from the heat and let cool completely. Strain into an ice cream machine and freeze according to the manufacturer's directions (discard the cherries and almonds).",
        "To prepare the cake, melt the chocolate in a double boiler and keep warm. Meanwhile, in a small saucepan over medium heat, heat the butter until golden brown, 8 to 10 minutes. Set aside.",
        "In the bowl of a food processor, place the chiles, sugar, canela, cloves, and pumpkin seeds and grind until superfine. In the bowl of an electric mixer fitted with a whisk, whisk together the eggs and vanilla extract on low speed. Add the chile mixture and whisk for 10 minutes longer. Add the melted chocolate, whisk to incorporate, and slowly add the butter until combined.",
        "Pour the batter into 8 lightly oiled 4-ounce ramekins and place in a water bath. Transfer to the oven and bake for 13 to 14 minutes; the cakes will feel only slightly firm. Remove the ramekins and keep refrigerated until 1 hour before serving. Cakes are even better slightly warmed in the oven.",
        "To prepare the anglaise, place the cream, sugar, vanilla, and tamarind in the saucepan and slowly bring to a boil, breaking up the tamarind with a wooden spoon. Whisk the egg yolks in a mixing bowl and slowly add the cream mixture while whisking vigorously. Return to the saucepan and cook over low heat, while whisking continuously, until the mixture coats the back of a wooden spoon. Strain and let cool; keep covered.",
        "To prepare the caramel, heat the sugar and 1 cup of water in a heavy saucepan over high heat. When the sugar turns from golden brown to amber, turn off the heat and slowly whisk in the orange juice, the caramel may turn hard but it will melt again when reheated. Turn the heat back on to medium and cook for 20 minutes, stirring occasionally. Let cool completely.",
        "To serve, place the ramekins in a shallow pan of very hot water for 1 minute. Invert the ramekins and tap on the bottom to turn out the cakes. Transfer to serving plates and bring to room temperature. Top with a scoop of the ice cream and spoon the anglaise and caramel around the cakes."
    ],
    "ingredients": [
        "4 ounces cherries, pitted",
        "1 cup dry sherry",
        "2 cups heavy cream",
        "1 cup half-and-half",
        "3/4 cup sugar",
        "1/2 fresh vanilla bean, split in half lengthwise and seeds scraped",
        "1/4 teaspoon almond extract",
        "1/2 cup toasted sliced almonds",
        "8 large egg yolks",
        "11 ounces bittersweet chocolate, such as Hawaiian Vintage Chocolate",
        "10 tablespoons (1 1/4 sticks) unsalted butter",
        "1/2 dried pasilla chile, seeded",
        "1/2 dried ancho chile, seeded",
        "10 tablespoons sugar",
        "1/2 tablespoon canela or 3/4 teaspoon cinnamon",
        "1/4 teaspoon ground cloves",
        "2 tablespoons pumpkin seeds",
        "9 large eggs",
        "1/2 tablespoon pure vanilla extract",
        "1 cup heavy cream",
        "3 tablespoons sugar",
        "1/4 teaspoon pure vanilla extract",
        "1/4 cup tamarind paste",
        "2 large egg yolks",
        "1/2 cup sugar",
        "1 3/4 cups freshly squeezed orange juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Orange",
        "Cherry",
        "Almond",
        "Vanilla",
        "Hot Pepper",
        "Sherry",
        "Tamarind"
    ],
    "title": "Mole Cake with Cherry-Almond Ice Cream, Tamarind Anglaise, and Orange Caramel",
    "url": "http://www.epicurious.com/recipes/food/views/mole-cake-with-cherry-almond-ice-cream-tamarind-anglaise-and-orange-caramel-104140"
}
