{
    "directions": [
        "Combine cherries with juices, 1/2 cup sugar, kirsch, and cinnamon in heavy medium saucepan. Stir over medium heat until sugar dissolves. Simmer until sauce thickens and is slightly reduced, about 10 minutes. Using slotted spoon, remove 1/4 cup cherries from sauce; drain well. Transfer to work surface and chop coarsely; reserve chopped cherries for cakes. Set aside cherry sauce.",
        "Butter two 3/4-cup ramekins or custard cups. Whisk cocoa and remaining 1/4 cup sugar in small bowl to blend. Stir chocolate and butter in heavy small saucepan over low heat until chocolate melts and mixture is smooth. Remove from heat; whisk in cocoa mixture. Whisk in egg yolks, then whole egg and flour. Fold in reserved 1/4 cup chopped cherries. Divide batter between prepared ramekins. (Sauce and cake batter can be made 1 day ahead. Cover separately; chill.)",
        "Preheat oven to 350°F. Bake cakes uncovered until edges are set but center is still shiny and tester inserted into center comes out with some wet batter attached, about 22 minutes.",
        "Warm sauce over low heat. Cut around cakes to loosen; turn out onto plates. Spoon sauce alongside. Sift powdered sugar over; garnish with mint."
    ],
    "ingredients": [
        "1 16-ounce bag frozen pitted dark sweet cherries, halved, thawed, undrained",
        "3/4 cup sugar",
        "1/4 cup kirsch (clear cherry brandy) or regular brandy",
        "1/4 teaspoon ground cinnamon",
        "2 tablespoons unsweetened cocoa powder",
        "2 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/4 cup (1/2 stick) unsalted butter, cut into small pieces",
        "2 large egg yolks",
        "1 large egg",
        "2 teaspoons all purpose flour",
        "Powdered sugar",
        "Fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Cherry",
        "Winter",
        "Ramekin"
    ],
    "title": "Molten Chocolate Cakes with Cherries",
    "url": "http://www.epicurious.com/recipes/food/views/molten-chocolate-cakes-with-cherries-104736"
}
