{
    "directions": [
        "In a large bowl, mix together 1 cup brown sugar, soy sauce, orange juice, brown mustard, honey, Worcestershire sauce, black pepper, and cumin until thoroughly combined and the sugar has dissolved. Place the pork chops into the marinade, and spoon marinade to cover the chops. Let stand at room temperature for 45 minutes to 1 hour.",
        "Preheat an outdoor grill for medium-high heat, and lightly oil the grate.",
        "Remove the chops from the marinade, and discard marinade. Shake any excess drops of liquid from the chops, and grill until they are browned, no longer pink inside, and show good grill marks, about 8 minutes per side. Squeeze lime juice over the chops as they grill. An instant-read meat thermometer inserted into the thickest part of a chop should read at least 145 degrees F (63 degrees C).",
        "Melt butter in a large skillet over high heat, then stir in 1 tablespoon of brown sugar and cinnamon; bring the mixture to a boil, stirring to dissolve the sugar. Stir in the apple and pear slices, and cook, stirring often, until the fruit is coated with the butter mixture and softened but not mushy, about 5 minutes. Transfer the apple and pear slices to a grilling basket.",
        "Grill the fruit on the outdoor grill until the slices are browned, about 5 more minutes. Serve grilled fruit with pork chops."
    ],
    "ingredients": [
        "1 cup light brown sugar",
        "1 cup soy sauce",
        "1 cup orange juice",
        "1/2 cup spicy brown mustard",
        "1/3 cup honey",
        "2 tablespoons Worcestershire sauce",
        "2 tablespoons ground black pepper",
        "1 tablespoon ground cumin",
        "8 pork chops, 1/2 to 1 inch thick",
        "1 lime, juiced",
        "1/2 cup butter",
        "1 tablespoon light brown sugar, or to taste",
        "2 tablespoons ground cinnamon",
        "4 large green apples - peeled, cored, and cut into eighths",
        "4 Bartlett pears - peeled, cored, and cut into eighths"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Momma Pritchett's Grilled Pork Chops and Apple-Pear Topping",
    "url": "http://allrecipes.com/recipe/218073/momma-pritchetts-grilled-pork-chops/"
}
