{
    "directions": [
        "Sprinkle the yeast over 1 cup of warm water in a bowl. The water should be no more than 100 degrees F (40 degrees C). Let stand for 10 minutes until the yeast softens and begins to form a creamy foam.",
        "Stir in 1 1/2 cups of flour, vegetable oil, and table salt, to make a thick, smooth batter. Stir in 1 1/4 cups of flour, and knead the dough on a well-floured surface until elastic, about 5 minutes. Form the dough into a ball, cover it with a cloth, and let it rest for 1 hour.",
        "Line a baking sheet with parchment paper.",
        "Cut the dough ball into 12 even pieces, and roll each out into a rope about 18 inches long and as thick as a pencil. To shape into pretzels, form a dough piece into a \"U\" shape, then cross the two tails to make a loop. Spread the two tail ends apart, bring them up, and press the ends into the top of the loop, to form the pretzel shape. Let the formed pretzels rest for 30 minutes on the prepared baking sheet.",
        "Preheat an oven to 475 degrees F (245 degrees C).",
        "Fill a large saucepan about half full of water, bring to a boil, and stir in the baking soda. Working one at a time, drop each pretzel into the boiling water, and let cook for 1 minute, to give the pretzel a skin. Place the boiled pretzels onto the prepared baking sheet, and sprinkle each one with coarse salt.",
        "Bake in the preheated oven until the pretzels are golden brown, about 12 minutes."
    ],
    "ingredients": [
        "1 (.25 ounce) package active dry yeast",
        "1 cup warm water (100 degrees F/40 degrees C)",
        "1 1/2 cups all-purpose flour",
        "2 tablespoons vegetable oil",
        "1/2 teaspoon table salt",
        "1 1/4 cups all-purpose flour",
        "2 tablespoons baking soda",
        "2 tablespoons coarse salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mom's Pretzels",
    "url": "http://allrecipes.com/recipe/84220/moms-pretzels/"
}
