{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 9-inch cake pans. In a bowl, sift cake flour with baking soda.",
        "Mash the vegetable shortening with 1 1/2 cup of sugar in a large bowl until thoroughly combined, and stir in the eggs, one at a time. Pour the red food coloring into a small bowl, and fill the empty food coloring container with water; add the water to the food coloring. Stir in cocoa powder to make a paste, and mix the paste into the shortening mixture.",
        "Stir the buttermilk, salt, vanilla extract, and apple cider vinegar in a bowl, and mix into the colored shortening mixture, alternating with the flour mixture, until well combined. Scrape the batter into the prepared cake pans.",
        "Bake in the preheated oven until a toothpick inserted into the center of a cake comes out clean, 30 to 35 minutes. Allow the cakes to cool completely.",
        "To make frosting, whisk together the milk and all-purpose flour in a saucepan until the mixture is free of lumps, and bring to a simmer over medium-low heat. Cook, whisking constantly, until the mixture is thick, about 1 minute. Pour the thickened sauce into a mixing bowl, and chill until completely cooled, at least 30 minutes. When cold, place the butter into the mixture, and beat with an electric mixer to combine; add the vanilla extract and 2 cups of sugar to the bowl, and beat with the mixer set on Medium speed until the frosting is light and fluffy, about 3 minutes."
    ],
    "ingredients": [
        "2 1/4 cups sifted cake flour",
        "1 teaspoon baking soda",
        "1/2 cup vegetable shortening (such as Crisco®)",
        "1 1/2 cups white sugar",
        "2 eggs",
        "1 (1 ounce) bottle red food coloring",
        "1 fluid ounce water",
        "2 tablespoons unsweetened cocoa powder",
        "1 cup buttermilk",
        "1 teaspoon salt",
        "1 teaspoon vanilla extract",
        "1 tablespoon apple cider vinegar",
        "2 cups milk",
        "1/4 cup all-purpose flour",
        "2 cups butter, softened",
        "2 teaspoons vanilla extract",
        "2 cups white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mom's Signature Red Velvet Cake",
    "url": "http://allrecipes.com/recipe/218310/moms-signature-red-velvet-cake/"
}
