{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.",
        "Mix tomato sauce and sloppy joe seasoning together in a bowl.",
        "Finely chop the usable 'meat' from the removed tops of each red bell pepper. Heat olive oil in a skillet over medium heat; cook and stir red pepper pieces and garlic until fragrant, 1 to 2 minutes.",
        "Cook and stir ground beef and 1/2 cup beef broth into the red pepper-garlic mixture until ground beef crumbles are browned, 8 to 10 minutes. Drain off excess fat from the cooked ground beef. Add instant rice, 1/2 cup beef broth, and Worcestershire sauce; stir to combine. Simmer until the rice becomes tender and absorbs most of the liquid, about 10 minutes. Add about 1/2 cup of the tomato sauce mixture, 1/2 cup Parmesan cheese, salt, and black pepper to the beef mixture; stir to combine.",
        "Ladle about half the remaining tomato sauce mixture into the bottom of the prepared baking dish. Stuff each of the red bell peppers with ground beef mixture; arrange in the baking dish. Ladle the remaining tomato sauce mixture over each bell pepper. Cover the baking dish with aluminum foil.",
        "Bake in the preheated oven until filling is cooked through, about 25 minutes. Sprinkle remaining 1/2 cup Parmesan cheese over the peppers. Bake until cheese is melted and bubbling, about 10 more minutes."
    ],
    "ingredients": [
        "2 (15 ounce) cans tomato sauce",
        "1 (1.3 ounce) envelope sloppy joe seasoning",
        "5 red bell peppers, tops removed and set aside and seeds removed",
        "2 teaspoons olive oil",
        "3 cloves garlic, finely chopped",
        "1 pound ground beef",
        "1/2 cup beef broth",
        "1/2 cup instant rice",
        "1/2 cup beef broth",
        "1 teaspoon Worcestershire sauce",
        "1/2 cup shredded Parmesan cheese",
        "salt and ground black pepper to taste",
        "1/2 cup shredded Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mom's Sloppy Joe Stuffed Peppers",
    "url": "http://allrecipes.com/recipe/223215/moms-sloppy-joe-stuffed-peppers/"
}
