{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "Cut the eggplant in half and scoop out the center, leaving enough meat inside the skin so that it holds its shape when baked. Boil the scooped-out center part until very soft, about 10 to 12 minutes.",
        "Meanwhile, in a medium saute pan heat 1 tablespoon olive oil over medium heat. Season the beef with salt and pepper. Add the seasoned ground beef to the pan and saute until all of its liquid is evaporated and the beef begins to brown slightly. Drain the beef, removing the extra, unnecessary fat. Let cool briefly and chop the cooked beef so that there are no large chunks of meat. In another medium saute pan over medium heat add the remaining 2 tablespoons olive oil and saute the onions, peppers and garlic together.",
        "In a bowl mix together the cooked eggplant, vegetables, cooked beef, herbs, 1 cup of the cheese, bread crumbs, and the egg.",
        "Fill the scooped-out eggplant halves with this mixture, dividing it evenly among the 2 halves.",
        "Top with chopped tomatoes and the remaining 1/4 cup of grated cheese, season with salt and pepper, place on an oiled oven tray or baking dish, and bake for 50 minutes in preheated oven. Let cool briefly, slice widthwise and serve."
    ],
    "ingredients": [
        "1 large eggplant",
        "3 tablespoons extra-virgin olive oil, divided",
        "1/2 pound ground beef",
        "Salt and freshly ground black pepper",
        "1 onion, small diced",
        "1 red pepper, small diced",
        "3 cloves garlic, minced",
        "1/2 cup freshly chopped parsley leaves",
        "1/2 cup freshly chopped basil leaves, chopped",
        "1 1/4 cup grated Pecorino Romano, divided",
        "1/4 cup bread crumbs",
        "1 egg",
        "2 chopped tomatoes"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Side Dish Recipes",
        "Easy Recipes",
        "Easy Baking",
        "American",
        "Italian",
        "Vegetable",
        "Eggplant Recipes",
        "Beef",
        "Meat",
        "Cheese",
        "Summer"
    ],
    "title": "Mom's Stuffed Eggplant",
    "url": "http://www.foodnetwork.com/recipes/michael-chiarello/moms-stuffed-eggplant-recipe"
}
