{
    "directions": [
        "Halve the onions through the stem and cut the halves into 1/2-inch-thick half-moons. Set aside.",
        "Season the chuck roast with the 3/4 tsp. salt and the 1/2 tsp. pepper. Spread the flour on a plate. Coat the roast with the flour, shaking off the excess.",
        "In a Dutch oven over medium-high heat, warm 2 Tbs. of the bacon fat. Add the roast and cook, turning occasionally, until browned on both sides, about 5 minutes total. Transfer to a plate.",
        "Add the remaining 1 Tbs. bacon fat to the pot and heat over medium-high heat. Add the onions, cover and cook, stirring occasionally, until the onions soften, about 6 minutes. Stir in the garlic and paprika and cook until the garlic is fragrant, 1 to 2 minutes. Stir in the stock, tomatoes and the 2 Tbs. parsley. Return the beef to the pot, nestling it in the onions. Bring the liquid to a boil, reduce the heat to medium-low, cover and simmer until the beef is fork-tender, about 2 hours.",
        "Transfer the pot roast to a deep serving platter. Season the onion mixture with salt and pepper. Skim off any fat from the surface. Spoon the onion mixture around the roast and garnish with parsley. Serve immediately. Serves 4 to 6.",
        "Variation:",
        "To make beef paprikash, simply add sour cream to the sauce: Transfer the pot roast to a platter and skim the fat from the sauce as directed. Stir 1 cup sour cream into the sauce and cook just until it is heated through; do not allow it to boil. Season with salt and pepper. Pot roast also makes excellent hot sandwiches. Slice the roast and serve it along with plenty of the saucy onions on crusty rolls.",
        "Adapted from Williams-Sonoma",
        "Comfort Food,",
        "by Rick Rodgers (Oxmoor House, 2009)."
    ],
    "ingredients": [
        "3 yellow onions",
        "1 beef chuck roast, about 2 1/2 lb.",
        "3/4 tsp. kosher salt, plus more, to taste",
        "1/2 tsp. freshly ground pepper, plus more, to taste",
        "1/4 cup all-purpose flour",
        "3 Tbs. rendered bacon fat or canola oil",
        "4 garlic cloves, chopped",
        "1 tsp. sweet paprika, preferably Hungarian or Spanish",
        "1 1/2 cups beef stock or broth",
        "1 1/2 cups canned plum tomatoes, drained and chopped",
        "2 Tbs. chopped fresh flat-leaf parsley, plus more for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Mom’s Home-Style Pot Roast",
    "url": "http://www.williams-sonoma.com/recipe/moms-home-style-pot-roast.html"
}
