{
    "directions": [
        "Heat the olive oil in a large heavy pot or Dutch oven over medium-high heat until the oil is shimmering, and place the onion and beef into the hot oil. Sprinkle with 1 teaspoon of the steak seasoning, stir the meat and onions well, and sprinkle with 1 more teaspoon of seasoning. Add the celery, and cook and stir until the meat is browned, about 10 minutes.",
        "Pour in 2 cups of water to just cover the meat, onion, and celery, bring to a boil, and stir and scrape the browned bits of flavor from the bottom of the pan. Cover, reduce heat, and simmer until the beef is very tender, about 2 hours. Remove the meat and celery pieces from the pan, set the meat aside, and discard the celery.",
        "In a bowl, whisk together the gravy mix with 4 cups of water. Add the mixture to the juices in the pot, bring to a boil, and stir the meat back into the gravy mixture. Stir in the turnip and carrots, cover, and simmer for 20 minutes. Stir in the potatoes, cover, and simmer an additional 20 minutes.",
        "To make dumplings, mix the flour, baking powder, and salt in a bowl. Cut the shortening into the flour mixture with a pastry cutter or two knives until the mixture looks crumbly. Pour in the milk, and lightly stir the mixture just until it combines to form a dough.",
        "Remove 2 cups of gravy from the pot, and reserve. Drop the dumplings by heaping tablespoon onto the meat and vegetables in the pot, cover, and simmer for 20 minutes. Do not peek until the time is up. Pour the reserved gravy back over the dumplings, stir lightly, and serve."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "1 onion, coarsely chopped",
        "2 pounds cubed beef stew meat",
        "2 teaspoons steak seasoning (such as Montreal Steak Seasoning®), divided",
        "2 stalks celery, each cut into 4 pieces",
        "2 cups water, or to cover",
        "4 (.85 ounce) packages dry brown gravy mix",
        "4 cups water",
        "1 small turnip, peeled and quartered",
        "4 carrots, peeled and quartered",
        "7 potatoes, peeled and quartered",
        "1 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "3/4 teaspoon salt",
        "3 tablespoons shortening",
        "3/4 cup milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mom's Hearty Beef Stew with Dumplings",
    "url": "http://allrecipes.com/recipe/213078/moms-hearty-beef-stew-with-dumplings/"
}
