{
    "directions": [
        "Place 1 cup milk with shortening in a saucepan. Stir constantly over medium heat until shortening melts. Do not allow to boil. Remove from heat and let cool slightly. In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.",
        "Pour milk and margarine into a large bowl. Add remaining cup of milk and dissolved yeast. In a separate bowl, sift together sugar, 4 cups flour, baking powder, baking soda and salt. Gradually flour mixture to milk mixture, using a wire whisk or electric mixer. Place uncovered bowl on stove. Allow dough to rise 2 to 2 1/2 hours until doubled in bulk.",
        "Stir remaining 1 1/2 cups flour into dough and mix well. Turn dough out onto a lightly floured surface and divide  in half. Roll out until 1/8 inch thick. Brush with melted margarine and cut with biscuit cutter . Fold each roll in half and dip in melted margarine, place on greased cookie sheets. For immediate use continue to let rolls rise 2 hours or until doubled in bulk. Refrigerate or freeze rolls if you do not plan to use at once.",
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Bake in a preheated oven for 15 to 20 minutes until golden brown. When using frozen rolls, remove from freezer at least 4 hours before serving.  When using refrigerated rolls, allow 3 hours for rolls to rise."
    ],
    "ingredients": [
        "2 cups milk, divided",
        "10 tablespoons shortening",
        "1 (.25 ounce) package active dry yeast",
        "1/4 cup warm water (110 degrees F/45 degrees C)",
        "10 tablespoons white sugar",
        "4 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1 1/2 teaspoons salt",
        "1 1/2 cups all-purpose flour",
        "1/2 cup margarine, melted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Monica's Never Fail Rolls",
    "url": "http://allrecipes.com/recipe/23405/monicas-never-fail-rolls/"
}
