{
    "directions": [
        "Trim the beef roast of excess fat and tissue, and cut into 4 or 5 large chunks. In a cup or small bowl, mix together 2 teaspoons of salt, 1/2 teaspoon of pepper, 1 tablespoon of chili powder, and 1 tablespoon of ground cumin. Rub this mixture into the meat, and let stand at room temperature for 15 minutes.",
        "Heat 3 tablespoon of olive oil in a large deep skillet or Dutch oven over medium-high heat. Sear the meat on all sides. Remove meat from the pan, and pour in the remaining olive oil. Reduce heat to medium, and add onions, garlic, Anaheim peppers, poblano peppers, jalapeno peppers, green pepper, carrot and celery. Cook, stirring frequently, for about 5 minutes to release the flavors.",
        "Add roma tomatoes to the pan, and season with remaining chili powder, cumin, salt and pepper, as well as the dried chile pepper. Bring to a simmer and cook for 5 minutes.",
        "Return the meat to the pan, and stir in the beef broth. Bring to a boil, then simmer over low heat for 3 to 3 1/2 hours, until meat is very tender. Taste and adjust seasonings if necessary. Remove meat from the pot, shred, and return to the pot. Reheat if necessary before serving."
    ],
    "ingredients": [
        "4 pounds tri tip roast",
        "3 teaspoons salt, divided",
        "3/4 teaspoon ground black pepper, divided",
        "3 tablespoons chili powder, divided",
        "3 tablespoons ground cumin, divided",
        "1/3 cup olive oil, divided",
        "2 large onions, chopped",
        "4 cloves garlic, chopped",
        "2 Anaheim chile peppers, chopped",
        "1 poblano chile pepper, chopped",
        "2 jalapeno chile peppers, chopped",
        "1 green bell pepper, seeded and chopped",
        "1 carrot, chopped",
        "2 stalks celery, chopped",
        "4 roma (plum) tomatoes, chopped",
        "1 whole dried red chile pepper, seeded and chopped",
        "1 (14 ounce) can beef broth"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Monkey Meat",
    "url": "http://allrecipes.com/recipe/70188/monkey-meat/"
}
