{
    "directions": [
        "Mix salsa, eggs, onion, 1/4 cup barbeque sauce, 1/4 cup mustard, 1/4 cup ketchup, Parmesan cheese, sriracha sauce, soy sauce, malt vinegar, meatloaf seasoning mix, salt, garlic powder, and black pepper together in a large bowl. Stir beef and sausage into salsa mixture until thoroughly mixed. Add enough bread crumbs to bring meatloaf mixture together.",
        "Line a container with plastic wrap. Pack meatloaf mixture into the container. Chill until set, 3 to 4 hours.",
        "Preheat smoker to 250 degrees F (121 degrees C) according to manufacturer's directions.",
        "Line a wire rack with aluminum foil. Position in a cake pan lined with aluminum foil. Use plastic wrap to lift meatloaf onto the prepared wire rack.",
        "Smoke meatloaf until no longer pink in the center, about 3 hours.",
        "Combine barbeque glaze, 2 tablespoons barbeque sauce, 2 tablespoons mustard, 2 tablespoons ketchup, and Worcestershire sauce in a small bowl. Baste meatloaf with topping.",
        "Continue smoking until an instant-read thermometer inserted into the center reads 185 degrees F (85 degrees C), 1 to 2 hours more."
    ],
    "ingredients": [
        "1 (8 ounce) jar chunky salsa",
        "4 eggs",
        "1 onion, chopped",
        "1/4 cup barbeque sauce",
        "1/4 cup mustard",
        "1/4 cup ketchup",
        "1/4 cup Parmesan cheese",
        "2 tablespoons sriracha sauce",
        "2 tablespoons soy sauce",
        "2 tablespoons malt vinegar",
        "1 (1.25 ounce) packet meatloaf seasoning mix",
        "1 tablespoon salt",
        "1 tablespoon garlic powder",
        "1 tablespoon ground black pepper",
        "5 pounds ground beef, broken into small chunks",
        "2 pounds sausage, broken into small chunks",
        "1 cup bread crumbs, or more as needed",
        "Topping:",
        "2 tablespoons barbeque glaze (such as Jack Daniel's®)",
        "2 tablespoons barbeque sauce",
        "2 tablespoons mustard",
        "2 tablespoons ketchup",
        "1 teaspoon Worcestershire sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Monster Smoked Meatloaf",
    "url": "http://allrecipes.com/recipe/247279/monster-smoked-meatloaf/"
}
