{
    "directions": [
        "Preheat oven to 375  degrees F (190 degrees C). Grease 2 14-inch pizza pans.",
        "In large bowl, beat together the butter, white sugar, brown sugar, and vanilla until light and fluffy. Add eggs one at a time, mixing well with each addition. In a separate bowl, sift together the flour, salt, and baking soda. Add the dry ingredients slowly into the butter mixture, beating until well blended. Stir in chocolate chips and butterscotch chips.",
        "Divide the dough in half and spread each into a prepared pizza pan. Bake in the preheated oven for 20 to 25 minutes. Cool cookies in the pizza pans on a cooling rack.",
        "When the cookies are completely cooled, spread a layer of hot fudge on the top of one, and a layer of butterscotch topping on the other. Freeze the cookies for 4 hours or overnight to set.",
        "Remove the cookies from the freezer, and place tightly spaced scoops of softened vanilla ice cream on the hot fudge topped cookie. Carefully place the other cookie on top of the ice cream, butterscotch side down. Gently press down on the top cookie to even out the ice cream and seal the sandwich. Drizzle the remaining hot fudge and butterscotch sauces decoratively on top of the cookie sandwich. Place in the freezer to set for one hour before serving."
    ],
    "ingredients": [
        "2 cups butter, softened",
        "1 1/2 cups white sugar",
        "1 1/2 cups packed brown sugar",
        "2 teaspoons vanilla extract",
        "4 eggs",
        "4 1/2 cups all-purpose flour",
        "2 teaspoons salt",
        "2 teaspoons baking soda",
        "2 cups semisweet chocolate chips",
        "2 cups butterscotch chips",
        "1/2 gallon vanilla ice cream",
        "1 (12 ounce) jar hot fudge topping",
        "1 (12 ounce) jar butterscotch topping"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Monster Ice Cream Sandwich",
    "url": "http://allrecipes.com/recipe/104480/monster-ice-cream-sandwich/"
}
