{
    "directions": [
        "In large bowl, stir together flour and 1 cup boiling water until water is absorbed. Add 1/2 cup cold water and knead until smooth dough forms. Cover bowl tightly with plastic wrap and let rest 1 hour.",
        "In large nonreactive bowl, toss together pork, 2 tablespoons soy sauce, 3 tablespoons rice wine, pepper, and cornstarch. Let marinate 30 minutes.",
        "Meanwhile, in small bowl, combine dried black mushrooms and boiling water to cover. Let stand until tender, about 10 minutes. Drain, squeezing out excess liquid, rinse to remove any grit, discard stems, and coarsely chop caps. Set aside.",
        "In small bowl, stir together remaining 2 tablespoons soy sauce, remaining 1 tablespoon rice wine, oyster sauce, and sugar. Set aside.",
        "In small sauté pan over moderate heat, heat sesame oil until hot but not smoking. Add eggs and scramble until softly set, about 1 minute. Transfer to small bowl and set aside.",
        "On lightly floured work surface, roll dough into long, even cylinder 1 to 1 1/2 inches in diameter. Using sharp knife, cut cylinder crosswise into about 30 (3/4- to 1-inch) slices. Using rolling pin, roll each slice out to 3 1/2-inch-diameter circle (about 1/8 inch thick). Brush 1 circle with sesame oil and top with 2nd circle. Repeat with remaining circles to form 15 \"sandwiches.\" Roll each \"sandwich\" out to 6-inch diameter. (Pancakes can be made ahead up to this point and frozen, layered between parchment or waxed paper, up to 1 month.)",
        "Heat wok or heavy large sauté pan over moderate heat. Brush pan lightly with peanut oil and cook pancake \"sandwiches\" in batches until lightly golden, about 3 minutes per side, brushing pan with oil between each batch. Transfer each \"sandwich\" as done to large plate and immediately peel apart 2 halves. Cover with moist towel while cooking remaining pancakes. Keep warm until ready to serve.",
        "In wok or heavy large sauté pan over moderately high heat, heat peanut oil until hot but not smoking. Add ginger, garlic, half of scallions (reserve remainder for garnish), and pork and stir-fry until pork is cooked through and caramelized, about 5 minutes. Add black mushrooms, cabbage, shiitake mushrooms, and cucumber and stir-fry until vegetables are tender, 2 to 3 minutes. Add eggs and soy sauce-rice wine-oyster sauce mixture and stir-fry until heated through, about 1 minute.",
        "Transfer to serving bowl and garnish with remaining scallions. To serve, divide pork mixture among pancakes and roll up to enclose mixture."
    ],
    "ingredients": [
        "3 2/3 cups all-purpose flour",
        "12 ounces pork butt, trimmed and thinly sliced across grain",
        "4 tablespoons light soy sauce",
        "4 tablespoons Shaohsing rice wine",
        "1/4 teaspoon ground white pepper",
        "2 tablespoons cornstarch",
        "1/2 ounce dried Chinese black mushrooms (also known as black fungus or wood ear mushrooms; about 2/3 cup)",
        "3 tablespoons oyster sauce",
        "2 tablespoons sugar",
        "1 teaspoon Asian toasted sesame oil",
        "2 large eggs, lightly beaten",
        "1 tablespoon Asian toasted-sesame oil",
        "2 tablespoons peanut oil",
        "1/4 cup peanut oil",
        "1 (1/4-inch) piece fresh ginger, minced (about 1 teaspoon)",
        "2 cloves garlic, minced",
        "4 scallions (white and green parts), thinly sliced on diagonal",
        "8 ounces Napa cabbage, quartered lengthwise, cored, and cut crosswise into 1 1/2-inch triangles (about 5 cups)",
        "4 ounces fresh shiitake mushrooms, stems discarded and caps thinly sliced (about 1 1/2 cups)",
        "1 English or kirby cucumber, cut crosswise into 2-inch lengths, then thinly sliced lengthwise (about 1 cup)",
        "1 teaspoon Asian toasted sesame oil",
        "2 large eggs, lightly beaten"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Egg",
        "Ginger",
        "Mushroom",
        "Pork",
        "Marinate",
        "Stir-Fry",
        "Lunar New Year",
        "Cucumber",
        "Cabbage",
        "Sesame"
    ],
    "title": "Moo-Shu Pork",
    "url": "http://www.epicurious.com/recipes/food/views/moo-shu-pork-243065"
}
