{
    "directions": [
        "Place morels in small bowl. Pour 1 1/2 cups boiling water over; let soak until mushrooms soften, at least 30 minutes and up to 4 hours. Drain mushrooms, reserving soaking liquid. Rinse mushrooms under cold water to remove any excess dirt.",
        "Preheat oven to 350°F. Mix 1 teaspoon thyme, rosemary, salt, and pepper in small bowl. Rub herb mixture all over short ribs. Heat oil in heavy large ovenproof pot over medium-high heat. Working in batches, add ribs to pot and cook until brown on all sides, about 10 minutes per batch. Transfer ribs to bowl.",
        "Pour off all but 2 tablespoons fat from pot. Reduce heat to medium. Add onion, carrot, garlic, and prosciutto to pot; sauté until vegetables begin to soften, about 5 minutes. Add wine and bring to boil, scraping up any browned bits from bottom of pot. Add broth, bay leaf, reserved morels, morel soaking liquid (leaving any sediment behind), and remaining 1 teaspoon thyme to pot. Return ribs to pot, meat side down; bring to boil. Cover pot tightly; transfer to oven and bake until ribs are very tender, about 1 hour 45 minutes. Remove from oven. (Short ribs can be braised 1 day ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep chilled. Rewarm slightly over medium heat before continuing.)",
        "Preheat oven to 450°F. Transfer ribs to large roasting pan, bone side down. Remove 5 large morels from pot and finely chop. Place in medium bowl. Add butter and mix with fork to blend. Mix in breadcrumbs. Season with salt and pepper. Spread 1 teaspoon mustard over top of each rib. Spread breadcrumb mixture over top of each rib, pressing to adhere. Bake until topping is crisp and golden, about 10 minutes.",
        "Meanwhile, spoon off any fat from top of sauce in pot and discard. Boil sauce until slightly thickened and reduced to generous 2 cups, about 10 minutes. Season with salt and pepper.",
        "Spoon polenta into bowls. Top with short ribs. Spoon sauce over and serve."
    ],
    "ingredients": [
        "1 ounce dried morel mushrooms",
        "1 1/2 cups boiling water",
        "2 teaspoons chopped fresh thyme",
        "1 teaspoon chopped fresh rosemary",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "3 1/2 to 4 pounds meaty short ribs",
        "2 tablespoons olive oil",
        "1 large onion, chopped",
        "1 medium carrot, peeled, chopped",
        "3 large garlic cloves, minced",
        "1 1/2 ounces prosciutto , finely chopped",
        "1 cup dry white wine",
        "2 cups canned low-salt chicken broth",
        "1 bay leaf",
        "2 tablespoons (1/4 stick) butter, room temperature",
        "2 cups fresh breadcrumbs from crustless day-old French bread",
        "1/4 cup (about) Dijon mustard",
        "Polenta"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Bake",
        "Braise",
        "Dinner",
        "Meat",
        "Beef Rib",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Morel-Crusted Ribs with Polenta",
    "url": "http://www.epicurious.com/recipes/food/views/morel-crusted-ribs-with-polenta-106045"
}
