{
    "directions": [
        "Place lamb in shallow bowl or glass baking dish; coat with 1 tablespoon oil. Add wine, orange juice, ginger, and orange peel to bowl. Mix to coat. Mix cumin, coriander, and cinnamon in small bowl. Sprinkle spice mixture over lamb, turning to coat evenly. Sprinkle with 2 tablespoons cilantro. Cover and marinate at room temperature 1 hour or chill up to 4 hours.",
        "Preheat oven to 400°F. Heat 1 tablespoon oil in large ovenproof skillet over medium-high heat. Remove lamb from marinade, reserving marinade. Add lamb to skillet; sprinkle with salt and pepper. Cook until light brown, about 3 minutes per side. Push lamb to 1 side of skillet. Add onions and garlic to skillet; sauté until onions are light brown, about 3 minutes. Pour reserved marinade over lamb. Transfer to oven; roast until instant-read thermometer inserted into center registers 130°F for medium-rare, about 15 minutes. Remove lamb from pan, reserving onions and garlic in skillet. Let lamb rest 5 minutes. Slice lamb, transfer to platter, and tent with foil to keep warm.",
        "Place garbanzo beans and broth in medium saucepan; simmer over medium heat 10 minutes. Using slotted spoon, add onions and garlic from skillet to garbanzo bean mixture. Stir; simmer 5 minutes. Remove from heat; add 2 tablespoons cilantro. Using potato masher, mash to coarse puree. Season with salt and pepper.",
        "Place scoop of garbanzo bean mash on each plate. Top with lamb slices. Drizzle with juices from skillet and serve."
    ],
    "ingredients": [
        "1 1 1/2-pound piece butterflied boneless leg of lamb, trimmed",
        "2 tablespoons olive oil, divided",
        "1/2 cup dry red wine",
        "6 tablespoons fresh orange juice",
        "1 tablespoon grated peeled fresh ginger",
        "2 teaspoons finely grated orange peel",
        "2 teaspoons ground cumin",
        "1 teaspoon ground coriander",
        "1 teaspoon ground cinnamon",
        "4 tablespoons chopped fresh cilantro, divided",
        "2 cups chopped red onions",
        "6 garlic cloves, chopped",
        "2 15 1/2-ounce cans garbanzo beans (chickpeas), rinsed, drained",
        "1 cup low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Roast",
        "Thanksgiving",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Chickpea",
        "Fall",
        "Healthy",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Moroccan Lamb with Garbanzo Bean Mash",
    "url": "http://www.epicurious.com/recipes/food/views/moroccan-lamb-with-garbanzo-bean-mash-240363"
}
