{
    "directions": [
        "Whisk 1/4 cup olive oil, garlic, turmeric, cumin seeds, salt, and pepper together in a bowl and pour into a resealable plastic bag or container. Add chicken, coat with the paste and seal bag or container. Marinate in the refrigerator, 4 hours to overnight.",
        "Heat 2 tablespoons olive oil in a large stockpot over medium-high heat. Add onion; cook and stir until soft and translucent, 5 to 7 minutes. Remove chicken from marinade, discarding marinade. Add chicken thighs skin-side down to stockpot and cook until browned, about 4 minutes. Flip chicken thighs and cook until browned on second side, about 3 minutes more.",
        "Lower heat to medium and add water to cover chicken halfway, cover stockpot, and cook for 20 minutes. Uncover stockpot, sprinkle saffron threads onto chicken, and top with preserved lemon slices. Replace cover and cook until chicken is no longer pink at the bone and juices run clear, about 5 minutes more. An instant-read thermometer inserted near the bone should read at least 165 degrees F (74 degrees C). Uncover stockpot and transfer chicken to a serving platter.",
        "Continue simmering liquid in stockpot until thickened to sauce consistency, 5 to 7 minutes. Spoon sauce over chicken; top with olives, artichokes, and parsley."
    ],
    "ingredients": [
        "Paste:",
        "1/4 cup olive oil, or to taste",
        "3 cloves garlic, minced",
        "1 teaspoon ground turmeric",
        "1 teaspoon cumin seeds",
        "salt and ground black pepper to taste",
        "4 large chicken thighs",
        "2 tablespoons olive oil, or as needed",
        "1 white onion, chopped",
        "2 cups water, or as needed",
        "16 saffron threads",
        "1/2 preserved lemon, pulp discarded and thinly sliced",
        "1/4 cup olives, or to taste (optional)",
        "2 artichoke bottoms, chopped (optional)",
        "1/4 cup coarsely chopped parsley (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Moroccan Chicken with Saffron and Preserved Lemon",
    "url": "http://allrecipes.com/recipe/246488/moroccan-chicken-with-saffron-and-pre/"
}
