{
    "directions": [
        "Heat grill pan over moderate heat until hot.",
        "Meanwhile, simmer all sauce ingredients except butter in a 1-quart saucepan, uncovered, stirring occasionally, 2 minutes. Set aside while cooking chicken.",
        "Cook cumin, paprika, and pepper in oil in a small skillet over moderately low heat, stirring, until fragrant, about 2 minutes. Transfer to a small bowl, reserving skillet for sauce (do not clean). Brush some spiced oil on 1 side of each paillard, then sprinkle with some salt. Arrange 2 paillards in grill pan, oiled sides down, and brush tops with some of spiced oil, then sprinkle with some salt. Grill 2 minutes, then turn over and grill until just cooked through, about 3 minutes more. Transfer to a platter and cover with foil. Grill remaining paillards in same manner, transferring to platter.",
        "Pour sauce through a medium-mesh sieve into reserved small skillet, discarding solids. Add any juices from chicken accumulated on platter to sauce and bring to a boil. Remove from heat, then add butter and swirl skillet until butter is just incorporated. Season sauce with salt and spoon over chicken."
    ],
    "ingredients": [
        "1/4 cup orange juice",
        "1 tablespoon mild honey",
        "1 teaspoon fresh lemon juice",
        "1 (3-inch) cinnamon stick",
        "1/4 teaspoon dried hot red pepper flakes",
        "2 tablespoons unsalted butter",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon paprika (not hot)",
        "1/4 teaspoon black pepper",
        "2 tablespoons olive oil",
        "1 3/4 lb boneless chicken breast slices (1/4 inch thick; see cooks' note, below)",
        "1 1/4 teaspoons salt",
        "Special equipment: a well-seasoned large (2-burner) ridged grill pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Chicken",
        "Quick & Easy",
        "Spice",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Moroccan-Spiced Chicken Paillards",
    "url": "http://www.epicurious.com/recipes/food/views/moroccan-spiced-chicken-paillards-233792"
}
