{
    "directions": [
        "Mix first 6 ingredients in large bowl. Add lamb and toss to coat. Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Working in batches, add lamb to skillet and cook until browned on all sides, turning occasionally and adding 2 more tablespoons oil to skillet between batches, about 8 minutes per batch. Transfer lamb to another large bowl after each batch.",
        "Add onion and tomato paste to drippings in skillet. Reduce heat to medium; sauté until onion is soft, about 5 minutes. Add broth, garbanzo beans, apricots, tomatoes, cinnamon sticks, ginger, and lemon peel and bring to boil, scraping up browned bits. Return lamb to skillet and bring to boil. Reduce heat to low, cover, and simmer until lamb is just tender, about 1 hour. Uncover and simmer until sauce thickens enough to coat spoon, about 20 minutes. Season with salt and pepper. (Can be prepared 1 day ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep chilled. Rewarm over medium-low heat, stirring occasionally.)",
        "Transfer lamb and sauce to bowl. Sprinkle with cilantro and serve."
    ],
    "ingredients": [
        "1 tablespoon ground cumin",
        "2 teaspoons ground coriander",
        "1 1/2 teaspoons salt",
        "1 teaspoon fennel seeds",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon ground black pepper",
        "2 1/2 pounds trimmed boned lamb shoulder, cut into 1 1/2- to 2-inch pieces",
        "4 tablespoons olive oil, divided",
        "1 large onion, finely chopped",
        "1 tablespoon tomato paste",
        "2 cups low-salt chicken broth",
        "1 15 1/2-ounce can garbanzo beans (chickpeas), drained",
        "1 cup dried apricots (about 5 ounces)",
        "2 large plum tomatoes, chopped",
        "2 cinnamon sticks",
        "1 tablespoon minced peeled fresh ginger",
        "2 teaspoons (packed) grated lemon peel",
        "2 tablespoons chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Ginger",
        "Lamb",
        "Tomato",
        "Stew",
        "Dinner",
        "Apricot",
        "Chickpea",
        "Winter",
        "Cinnamon",
        "Coriander",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Moroccan Slow-Cooked Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/moroccan-slow-cooked-lamb-231597"
}
