{
    "directions": [
        "Heat oil in heavy large skillet over medium heat. Add onion and sauté until tender, about 10 minutes. Mix in cinnamon, ginger, turmeric, and saffron; stir 1 minute. Sprinkle flour over; stir 1 minute. Add broth; bring to simmer. Sprinkle chicken with salt; add to broth mixture. Gently simmer chicken uncovered until cooked through, reducing heat if necessary to prevent boiling, about 20 minutes. Stir in raisins. Set skillet aside until chicken is cool enough to handle.",
        "Transfer chicken to plate. Shred chicken coarsely and return to skillet. If sauce is thin, simmer over medium heat until sauce coats chicken thickly. Stir in cilantro and parsley. Season filling with salt and pepper. Cool filling completely. DO AHEAD: Can be made 2 days ahead. Cover; chill.",
        "Finely grind almonds, powdered sugar, 1/2 teaspoon coarse salt, and cinnamon in mini processor.",
        "Stack 10 phyllo sheets on work surface. Invert 9-inch glass pie dish onto stack. Cut around dish through phyllo, making ten 10-inch rounds. Remove dish. Cover rounds with plastic wrap and damp kitchen towel.",
        "Brush same pie dish with melted butter. Place 1 phyllo round on work surface; brush with butter and sprinkle with scant 1 tablespoon almonds. Top with another phyllo round, brush with butter and sprinkle with scant 1 tablespoon almonds. Repeat stacking with 3 more phyllo rounds, butter, and almonds. Fit phyllo stack into prepared pie dish. Brush with butter. Spoon filling evenly over. Place 1 phyllo round on work surface. Brush with butter and sprinkle with scant 1 tablespoon almonds. Top with another phyllo round, brush with butter and sprinkle with scant 1 tablespoon almonds. Repeat with 2 phyllo rounds, butter, and almonds. Place stack atop filling; top with remaining phyllo round. Tuck in edges. Drizzle more butter over top. Cut 4 slits through top phyllo stack to allow steam to escape. DO AHEAD: Can be made 6 hours ahead. Cover and chill.",
        "Preheat oven to 375°F. Place pie on rimmed baking sheet. Bake uncovered until phyllo is golden and filling is heated through, about 40 minutes. Cool 15 minutes. Cut into wedges."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 large onion, chopped",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground ginger",
        "1/2 teaspoon turmeric",
        "1/8 teaspoon crumbled saffron threads",
        "1 tablespoon all purpose flour",
        "2 cups low-salt chicken broth",
        "1 1/2 pounds skinless boneless chicken thighs",
        "1/4 cup chopped golden raisins",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons chopped fresh Italian parsley",
        "1/2 cup slivered almonds",
        "3 tablespoons powdered sugar",
        "1/2 teaspoon coarse kosher salt",
        "1/4 teaspoon ground cinnamon",
        "10 sheets (about 17x12 inches) fresh phyllo pastry or frozen, thawed",
        "1/2 cup (about) unsalted butter, melted (for brushing)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chicken",
        "Bake",
        "Sauté",
        "High Fiber",
        "Father's Day",
        "Dinner",
        "Raisin",
        "Almond",
        "Winter",
        "Cinnamon",
        "Phyllo/Puff Pastry Dough",
        "Butter",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Moroccan-Style Chicken Pie",
    "url": "http://www.epicurious.com/recipes/food/views/moroccan-style-chicken-pie-351511"
}
