{
    "directions": [
        "Whisk first 9 ingredients in medium bowl to blend. Transfer 1/2 cup marinade to small bowl; cover, chill, and reserve as basting sauce. Add lamb to remaining marinade in medium bowl; toss to coat. Marinate 2 hours at room temperature or cover and refrigerate overnight.",
        "Prepare barbecue (medium-high heat). Remove lamb from marinade. Thread lamb cubes onto 8 skewers, dividing equally. Thread apricots and onion chunks alternately on remaining 8 skewers. Brush all skewers with some of reserved 1/2 cup marinade. Sprinkle onion-apricot skewers with salt and pepper. Grill onion-apricot skewers until onions soften and begin to brown, occasionally turning and basting with marinade and moving skewers to cooler part of barbecue if necessary to keep apricots from burning, about 10 minutes. Grill lamb to desired doneness, turning occasionally, about 8 minutes for medium-rare.",
        "Mound Golden Couscous on platter. Top with skewers and serve."
    ],
    "ingredients": [
        "3/4 cup olive oil",
        "2/3 cup fresh lemon juice",
        "6 large garlic cloves, minced",
        "2 tablespoons chopped fresh mint",
        "4 teaspoons salt",
        "4 teaspoons grated lemon peel",
        "2 teaspoons ground black pepper",
        "2 teaspoons ground coriander",
        "1 teaspoon ground cumin",
        "4 pounds well-trimmed boneless leg of lamb, cut into 2-inch cubes",
        "16 12-inch-long metal skewers",
        "32 whole dried apricots (preferably Mediterranean), soaked in boiling water 5 minutes, drained",
        "4 red onions, each cut into 8 chunks",
        "Golden Couscous"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Backyard BBQ",
        "Dinner",
        "Apricot",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Couscous",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Moroccan Lamb Kebabs with Golden Couscous",
    "url": "http://www.epicurious.com/recipes/food/views/moroccan-lamb-kebabs-with-golden-couscous-108302"
}
