{
    "directions": [
        "Put one-third of the wings in a large bowl, sprinkle with 1 teaspoon baking powder and toss until evenly coated. Use tongs to spread the wings on a wire rack set over a rimmed baking sheet. Repeat with the remaining chicken wings and baking powder in two batches. Liberally sprinkle both sides of the wings with salt and pepper and refrigerate for at least 1 hour, or preferably overnight.",
        "Preheat the oven to 450 degrees F. Meanwhile, make the harissa: Tear open the chiles and discard the seeds. (You may leave the seeds in if you prefer a spicy harissa.) Tear the chiles into large pieces and place them in a medium bowl. Pour 4 cups boiling water over the chiles and let stand until softened, about 20 minutes.",
        "Put the coriander and cumin seeds in a small skillet and cook, swirling often, over medium heat, until the seeds are fragrant and lightly toasted, 2 to 3 minutes. Transfer the spices to a blender, add the oil, garlic, lemon juice and 1 tablespoon kosher salt, then puree until smooth. Using tongs, add the chiles to the blender along with 1 cup of their soaking liquid (discard the rest) and puree until very smooth, about 2 minutes on high. Season the harissa with pepper and set aside while you finish the wings.",
        "Bake the wings, turning once halfway through, until golden brown and cooked through, 40 to 45 minutes.",
        "For the salad: Use a vegetable peeler to remove the zest from 1 orange, avoiding the white pith, and cut it into very thin strips; transfer to a medium bowl. Using a knife, remove the white pith from both oranges, then cut the fruit crosswise into 1/4-inch-thick rounds. Add the orange rounds to the bowl along with the olives, mint and oil and toss to combine. Slice the radishes into thin wedges and toss with the orange mixture; let stand for 15 minutes.",
        "Transfer the hot wings to a large bowl and pour 1 1/2 cups of the harissa over, tossing to coat evenly. Transfer the wings to a platter and serve with the orange, olive and radish salad on the side. Serve the remaining harissa on the side for dipping or reserve for another use."
    ],
    "ingredients": [
        "4 pounds chicken wings, split at the joint, wingtips removed and discarded",
        "3 teaspoons baking powder",
        "Kosher salt and freshly ground pepper",
        "10 dried New Mexico chiles (2 ounces), stems removed",
        "8 dried guajillo chiles (1 1/2 ounces), stems removed",
        "1/2 teaspoon whole coriander seeds",
        "1/2 teaspoon whole cumin seeds",
        "1/4 cup vegetable oil",
        "6 cloves garlic, roughly chopped",
        "Juice of 1 lemon (about 2 tablespoons)",
        "2 oranges",
        "1/2 cup salt-cured black olives, pitted and halved",
        "1/3 cup fresh mint leaves, thinly sliced",
        "2 tablespoons extra-virgin olive oil",
        "1 bunch radishes, greens discarded"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "African",
        "Chicken Wing",
        "Chile Peppers",
        "Vegetable",
        "Chicken",
        "Poultry Recipes",
        "Appetizer",
        "Main Dish Recipes"
    ],
    "title": "Moroccan Harissa Chicken Wings",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/moroccan-harissa-chicken-wings"
}
