{
    "directions": [
        "Whisk first 4 ingredients in medium bowl. Season to taste with coarse salt and pepper. DO AHEAD: Can be made 2 days ahead. Cover and chill.",
        "Bring 8 cups water to boil in heavy large saucepan. Sprinkle with coarse salt. Add carrots; cook until just tender, about 4 minutes. Using skimmer or large slotted spoon, transfer carrots to large bowl of ice water. Return water to boil. Add turnip; cook until just tender, about 3 minutes. Using skimmer, transfer turnip to bowl with carrots. Reserve cooking liquid.",
        "Melt butter in heavy large pot over medium heat. Add next 7 ingredients. Sprinkle with coarse salt and pepper. Cook until onions are soft, stirring often, about 8 minutes. Add wine; simmer until reduced by half, about 5 minutes. Stir in flour. Add carrots, turnip, beans, spinach, and 2 cups reserved cooking liquid. Bring to simmer; cook until vegetables are heated through, adding more cooking liquid for desired consistency. Season stew to taste with coarse salt, pepper, and lemon juice.",
        "Divide stew among bowls. Spoon dollop of yogurt sauce over and serve.",
        "A thick yogurt; sold at some supermarkets and at specialty foods stores (such as Trader Joe's and Whole Foods markets) and Greek markets. If unavailable, place regular yogurt in cheesecloth-lined strainer set over large bowl. Cover and chill overnight to drain.",
        "** A spicy North African red chile paste; available at some specialty foods stores and at Middle Eastern markets."
    ],
    "ingredients": [
        "1 cup (8 ounces) Greek-style yogurt*",
        "1 tablespoon extra-virgin olive oil",
        "1 teaspoon harissa sauce**",
        "1 garlic clove, minced",
        "Coarse kosher salt",
        "Coarse kosher salt",
        "1 pound carrots, peeled, cut into 1/2-to 3/4-inch pieces",
        "1 3/4-pound turnip, peeled, cut into 1/2-to 3/4-inch pieces",
        "3 tablespoons butter",
        "1/2 pound spring onions or green onions, coarsely chopped (about 1 3/4 cups)",
        "2 tablespoons chopped fresh Italian parsley",
        "2 tablespoons chopped fresh mint",
        "2 garlic cloves, minced",
        "1 teaspoon paprika",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground coriander",
        "1/2 cup dry white wine",
        "2 teaspoons all purpose flour",
        "1 15-ounce can garbanzo beans (chickpeas), drained, rinsed",
        "1 5-ounce bag baby spinach",
        "1 to 3 teaspoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Stew",
        "Vegetarian",
        "Yogurt",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Spinach",
        "Chickpea",
        "Carrot",
        "Turnip",
        "Family Reunion",
        "Healthy",
        "Green Onion/Scallion",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Moroccan-Style Vegetable Stew with Harissa Yogurt Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/moroccan-style-vegetable-stew-with-harissa-yogurt-sauce-352047"
}
