{
    "directions": [
        "Cook onions in medium pot of boiling water 2 minutes. Drain, rinse under cold water and peel.",
        "Heat vegetable oil in heavy large dutch oven over medium-high heat. Working in batches, season lamb with salt and pepper, add to Dutch oven and brown, about 4 minutes per batch. Using slotted spoon, transfer lamb to bowl after each batch is browned. Return all lamb and any juices to Dutch oven. Mix in chopped fresh parsley, chopped cilantro, ground cinnamon, ginger and saffron. Add 1 cup water and 1/2 cup pearl onions. Reduce heat to medium-low. Cover and simmer until lamb is tender, about 1 hour.",
        "Using slotted spoon, transfer lamb and pearl onions to bowl. Reserve 3 dates for garnish; add remaining dates and honey to sauce in Dutch oven. Simmer sauce 5 minutes, mashing dates to coarse puree with back of fork. Add remaining pearl onions and simmer until almost tender, about 5 minutes. Mix in remaining 1/2 cup water if necessary to thin sauce. Return lamb mixture to Dutch oven; simmer until heated through about 5 minutes.",
        "Season tagine to taste with salt and pepper. Transfer to platter. Top with slivered almonds and reserved dates."
    ],
    "ingredients": [
        "10 ounces pearl onions",
        "2 tablespoons vegetable oil",
        "3 pounds boneless lamb shoulder or stew meat, cut into 1 1/2-inch pieces",
        "5 tablespoons chopped fresh parsley",
        "1/4 cup chopped fresh cilantro",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground ginger",
        "1/8 teaspoon crushed saffron threads",
        "1 1/2 cups (about) water",
        "8 ounces pitted dates",
        "2 tablespoons honey",
        "2 tablespoons slivered almonds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fruit",
        "Herb",
        "Lamb",
        "Onion",
        "Stew",
        "Date",
        "Spice",
        "Spring",
        "Winter"
    ],
    "title": "Moroccan Lamb Tagine with Dates and Pearl Onions",
    "url": "http://www.epicurious.com/recipes/food/views/moroccan-lamb-tagine-with-dates-and-pearl-onions-361"
}
