{
    "directions": [
        "Mix paprika, cumin, salt, cayenne, cinnamon, turmeric, and black pepper together in a small bowl.",
        "Pat chicken thighs dry and place them in a resealable plastic bag. Sprinkle paprika mixture over chicken thighs; massage the bag to coat chicken evenly.",
        "Heat oil in a tagine over medium heat. Add chicken; cook until browned, 2 to 4 minutes per side. Transfer to a plate. Cook and stir fennel, onion, and garlic in the tagine. Stir in half of the garbanzo beans, chicken broth, 1/2 cup green olives, harissa, 1/2 of the preserved lemon, and ginger.",
        "Lay chicken over garbanzo bean mixture; sprinkle remaining olives on top. Scatter cherry tomatoes on top. Cover and simmer over medium-low heat until chicken is tender, 45 minutes to 1 hour.",
        "Combine remaining garbanzo beans with 2 tablespoons of broth from the tagine in a food processor or blender; blend into a thin paste.",
        "Transfer chicken to a serving dish. Stir garbanzo bean paste into the tagine. Simmer until flavors combine, about 5 minutes. Spoon broth mixture over chicken.",
        "Garnish with remaining preserved lemon and toasted almonds."
    ],
    "ingredients": [
        "1 teaspoon ground paprika",
        "1 teaspoon ground cumin",
        "1 teaspoon salt",
        "1/2 teaspoon ground cayenne",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground turmeric",
        "ground black pepper",
        "4 (6 ounce) bone-in chicken thighs, skin removed",
        "2 tablespoons olive oil",
        "1 fennel bulb, trimmed and thinly sliced",
        "1 large red onion, thinly sliced",
        "3 cloves garlic, minced, or more to taste",
        "1 (15 ounce) can garbanzo beans, drained, divided",
        "1 cup chicken broth",
        "1 cup pitted green olives, divided",
        "3 tablespoons harissa, or to taste",
        "1/2 preserved lemon, thinly sliced, divided",
        "1 teaspoon grated ginger root (optional)",
        "5 cherry tomatoes, halved, or more to taste",
        "1/4 cup toasted almonds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Moroccan Chicken Tagine with Preserved Lemons, Fennel, Olives, and Harissa",
    "url": "http://allrecipes.com/recipe/256727/moroccan-chicken-tagine-with-preserve/"
}
