{
    "directions": [
        "Cover eggs with cold water by 1 1/2 inches in a 1 1/2- to 2-quart saucepan and bring to a rolling boil, partially covered. Reduce heat to low and cook eggs, covered, 30 seconds. Remove from heat and let eggs stand in hot water, covered, 15 minutes. Rinse eggs under cold water 5 minutes to stop cooking. Peel eggs and quarter lengthwise.",
        "Meanwhile, toast cumin seeds in a dry 12-inch heavy skillet over moderate heat, stirring, until fragrant and a few shades darker, about 4 minutes. Transfer to a bowl to cool, then grind to a powder in grinder. Transfer to a small serving bowl.",
        "Cook peppers, onion, potatoes, salt, and pepper in oil in same skillet over moderate heat, covered, stirring occasionally, until vegetables are browned and very tender, 15 to 20 minutes. Season with salt and pepper.",
        "Cut off an end of each roll and pull out some of bread from center to form a wide deep pocket in each roll. Put 2 egg quarters in bottom of each pocket and fill with vegetable mixture. Top filling in each sandwich with 2 of remaining egg quarters and sprinkle with some of cumin.",
        "Serve sandwiches with remaining cumin and oil and harissa for seasoning."
    ],
    "ingredients": [
        "4 large eggs",
        "1 tablespoon cumin seeds",
        "1/2 lb Italian frying peppers, cut into 2- by 1/4-inch strips",
        "1 large onion, halved lengthwise, then cut lengthwise into 1/4-inch-thick slices",
        "3/4 lb boiling potatoes, peeled and thinly sliced crosswise",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "3 tablespoons extra-virgin olive oil",
        "4 Portuguese, challah, or kaiser rolls (about 4 inches in diameter)",
        "Special equipment: an electric coffee/spice grinder",
        "Accompaniments: extra-virgin olive oil; harissa (spicy North African condiment) or cayenne (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Onion",
        "Pepper",
        "Potato",
        "Quick & Easy",
        "Gourmet"
    ],
    "title": "Moroccan-Style Potato and Egg Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/moroccan-style-potato-and-egg-sandwiches-237207"
}
