{
    "directions": [
        "1. Add the bulgur to a large pot of lightly salted boiling water. Reduce the heat and simmer the bulgur for 10 to 12 minutes or until just tender. Drain the bulgur in a colander. Allow to cool and then transfer to a small shallow bowl.",
        "2. Add the lemon juice, parsley, tomato, and 1 tablespoon of the olive oil and toss until all the grains are coated with the dressing. Season to taste with salt and pepper. Cover and refrigerate.",
        "3. Preheat the oven to 350°F.",
        "4. Heat the remaining 1 tablespoon olive oil in a medium-sized, heavy-bottomed casserole or Dutch oven over medium-high heat. When the oil is almost smoking, add the lamb and sear for 8 to 12minutes or until nicely browned on all sides.",
        "5. While the lamb is browning, add the onions, carrots, and celery to the pan along with the thyme. Stir the vegetables occasionally.",
        "6. Add the red wine and cook until reduced to a few tablespoons. Add enough water to cover the lamb and bring to a boil, stirring the bottom of the pan with a wooden spoon to dissolve any browned solids into the liquid.",
        "7. Remove from the heat and cover the casserole with a tight-fitting lid. Place in the center of the oven and cook for 1 hour or until the meat is tender and almost falling off the bone. Set aside and allow to cool. When cool, refrigerate the lamb until serving. Discard the vegetables and herbs.",
        "8. Pour the vegetable oil into a small, deep saucepan to a depth of 1H inches. Heat over medium heat until a deep-frying thermometer registers 325°F.",
        "9. Fry the garlic slices in the oil for 1 to 2 minutes or until they turn golden. Watch carefully because they fry very quickly. Remove from the oil with a slotted spoon to a paper towel to drain. Transfer to a flat plate, season with salt, and allow to cool completely. As they cool, the fried garlic slices will become very crispy.",
        "10. To serve, pull or cut the meat from the bone and cut into small pieces. Place some of the tabbouleh on each of 6 small plates along with some of the lamb. Top each serving with crispy garlic."
    ],
    "ingredients": [
        "1/2 cup bulgur",
        "1 tablespoon fresh lemon juice",
        "3 tablespoons finely chopped flatleaf parsley",
        "2 tablespoons finely diced tomato",
        "2 tablespoons olive oil",
        "Salt and freshly ground black pepper",
        "1 pound lamb shank or shoulder",
        "1 cup chopped onions",
        "1/2 cup chopped carrots",
        "1/2 cup chopped celery",
        "3 tablespoons fresh thyme leaves",
        "2 cups dry red wine",
        "Vegetable oil",
        "2 cloves garlic, sliced paper thin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Dinner",
        "Lamb Shank",
        "Winter",
        "Bulgur",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Moroccan Lamb with Tabbouleh and Crispy Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/moroccan-lamb-with-tabbouleh-and-crispy-garlic-363297"
}
