{
    "directions": [
        "Heat 2 tablespoons olive oil in heavy large wide pot over medium heat.",
        "Add onions and garlic. Cover and cook until onions are soft, about 10 minutes. Add paprika, salt, turmeric, coriander, fennel, pepper, cumin, and ginger; stir 1 minute. Add tomatoes, 1 cup water, and 3 tablespoons lemon juice; bring to boil. Arrange all chicken in single layer in pot; spoon some sauce over. Bring to boil. Reduce heat to medium-low, cover, and simmer 15 minutes. Turn chicken over, cover, and simmer until chicken is tender, about 20 minutes longer.",
        "Meanwhile, preheat oven to 400°F. Brush large rimmed baking sheet with olive oil. Place eggplant and remaining 4 tablespoons olive oil in large bowl; toss to coat. Spread eggplant out on prepared baking sheet and bake until soft and brown, stirring occasionally, about 25 minutes. (Chicken and eggplant can be made 1 day ahead. Cool slightly. Refrigerate separately until cold, then cover and keep refrigerated.)",
        "Stir eggplant and marjoram into chicken. Simmer uncovered 10 minutes to heat through and blend flavors. Season stew to taste with more lemon juice, if desired, and salt and pepper. Transfer chicken to large shallow bowl. Sprinkle with almonds and cilantro."
    ],
    "ingredients": [
        "6 tablespoons olive oil, divided",
        "3 cups sliced onions",
        "6 large garlic cloves, minced",
        "1 tablespoon Hungarian sweet paprika",
        "1 1/2 teaspoons coarse kosher salt",
        "1 teaspoon turmeric",
        "1 teaspoon ground coriander",
        "1 teaspoon fennel seeds, ground",
        "1 teaspoon freshly ground black pepper",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground ginger",
        "2 cups drained canned diced tomatoes (from 28-ounce can)",
        "1 cup water",
        "3 tablespoons (or more) fresh lemon juice",
        "8 chicken thighs with bones, skinned",
        "8 chicken drumsticks, skinned",
        "1 large eggplant, unpeeled, cut into 1-inch cubes",
        "1 tablespoon chopped fresh marjoram",
        "1/2 cup whole blanched almonds or slivered almonds, toasted",
        "Chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Nut",
        "Poultry",
        "Tomato",
        "Quick & Easy",
        "Dinner",
        "Lemon",
        "Almond",
        "Eggplant",
        "Winter",
        "Clove",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Moroccan Chicken with Eggplant, Tomatoes, and Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/moroccan-chicken-with-eggplant-tomatoes-and-almonds-109146"
}
