{
    "directions": [
        "Heat olive oil in heavy large skillet over medium-high heat. Sprinkle chicken with salt and pepper, add to skillet and brown, about 7 minutes per side. Transfer chicken to plate. Pour off all but thin film of fat from skillet. Add onions, reduce heat to medium and sauté until very tender and beginning to brown, about 10 minutes. Add squash and stir 2 minutes. Add cinnamon, cumin and saffron and stir until fragrant, about 30 seconds. Add chicken stock and bring to boil, scraping up browned bits. Add chicken with any drippings on plate, kumquats, pitted prunes and honey.",
        "Cover skillet and simmer until chicken is cooked through, turning occasionally, about 30 minutes. Uncover and boil until liquid thickens to sauce consistency if necessary. Season to taste with salt and pepper. (Can be made 1 day ahead. Cover and chill. Rewarm covered over medium heat.)",
        "Mound rice or couscous on plates. Spoon chicken and sauce over. Sprinkle with cilantro and serve."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 4-pound chicken, cut into 8 pieces",
        "2 onions, chopped",
        "1 1-pound butternut squash, peeled, seeded, cut into 3/4-inch pieces",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground cumin",
        "1/4 teaspoon saffron threads",
        "2 cups chicken stock or canned low-salt broth",
        "4 ounces kumquats, quartered lengthwise, seeded",
        "4 ounces pitted prunes",
        "2 tablespoons honey",
        "Freshly cooked rice or couscous",
        "Chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Prune",
        "Saffron",
        "Butternut Squash",
        "Kumquat",
        "Cinnamon"
    ],
    "title": "Moroccan Chicken with Kumquats and Prunes",
    "url": "http://www.epicurious.com/recipes/food/views/moroccan-chicken-with-kumquats-and-prunes-2665"
}
