{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray four 10-ounce ramekins with cooking spray.",
        "Heat a large skillet over medium-high heat. Add oil to pan; swirl to coat.",
        "Sprinkle lamb evenly with 1/2 teaspoon cumin and 1/4 teaspoon salt. Cook and stir lamb in the hot oil until browned on all sides, about 4 minutes. Transfer lamb to a bowl. Cook and stir onion in the same skillet until slightly softened, about 3 minutes; add garlic and cook until fragrant, about 30 seconds.",
        "Stir tomato paste into onion mixture until evenly coated, about 30 seconds. Pour broth and water into onion mixture; bring to a boil, scraping skillet with a wooden spoon to loosen browned bits of food. Return lamb to skillet.",
        "Stir remaining 1/2 teaspoon cumin, olives, raisins, honey, cayenne pepper, turmeric, and 1/8 teaspoon cinnamon into lamb mixture. Reduce heat and simmer, stirring occasionally, until lamb is fully cooked and flavors have blended, about 30 minutes. Remove from heat and stir in peas.",
        "Place sweet potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 10 minutes. Drain and cool for 5 minutes. Transfer sweet potatoes to a bowl and sprinkle with 1/4 teaspoon salt and 3/8 teaspoon cinnamon. Beat potato mixture with a hand mixer on high speed until smooth. Add egg; beat until incorporated.",
        "Spoon lamb mixture into each ramekin; spread sweet potato mixture over lamb mixture. Place ramekins on a baking sheet.",
        "Bake in the preheated oven until bubbling, about 25 minutes."
    ],
    "ingredients": [
        "cooking spray",
        "1 tablespoon olive oil",
        "1 pound cubed lamb stew meat",
        "1 teaspoon ground cumin, divided",
        "1/2 teaspoon salt, divided",
        "1 1/2 cups chopped onion",
        "4 garlic cloves, minced",
        "1 tablespoon tomato paste",
        "1 1/2 (10.5 ounce) cans low-sodium chicken broth",
        "1/2 cup water",
        "2 tablespoons olives, or to taste",
        "1/3 cup raisins",
        "2 tablespoons honey",
        "1/2 teaspoon cayenne pepper",
        "1/4 teaspoon ground turmeric",
        "1/2 teaspoon ground cinnamon, divided",
        "1 cup frozen green peas",
        "4 cups peeled and chopped sweet potatoes",
        "1 large egg, lightly beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Moroccan Shepherd's Pie",
    "url": "http://allrecipes.com/recipe/233779/moroccan-shepherds-pie/"
}
