{
    "directions": [
        "Cook onion in oil along with salt, cumin, ginger, turmeric, pepper, and coriander in a 3-quart heavy saucepan over moderate heat, stirring, until softened, about 5 minutes. Add chicken, broth, water, and cinnamon stick and simmer, covered, turning chicken over once, until meat is very tender, about 45 minutes total. Transfer chicken with tongs to a bowl, reserving cooking liquid.",
        "When cool enough to handle, shred chicken, discarding skin and bones, and transfer to a large bowl. Transfer cooking liquid to a 2-cup glass measure (do not clean saucepan) and let stand 1 minute, then skim off fat and discard cinnamon stick. Return liquid to saucepan and simmer over moderately high heat, uncovered, until reduced to about 1/4 cup (liquid will look like a glaze in bottom of pan), about 8 minutes, then stir into shredded chicken along with almonds.",
        "Reserve 2 tablespoons beaten egg in a cup for egg wash. Lightly season remaining egg with salt and pepper, then cook in 1/2 tablespoon butter in an 8- to 10-inch nonstick skillet over moderately high heat, stirring, until just set but still slightly soft. Stir scrambled egg into filling.",
        "Put oven racks in upper and lower thirds of oven and preheat oven to 450°F.",
        "Put 1 phyllo sheet on a work surface, keeping remaining phyllo covered with overlapping sheets of plastic wrap and a damp kitchen towel, and brush generously with some melted butter. Evenly sift 1/4 teaspoon cinnamon over buttered phyllo using a fine-mesh sieve, then top with another phyllo sheet and generously brush with butter.",
        "Halve buttered phyllo stack crosswise, then arrange 1 half with a long side nearest you. Spread 1/4 cup chicken filling in a narrow strip along edge nearest you, then roll up filling tightly in phyllo, leaving ends open. Transfer roll, seam side down, to a cutting board set inside a baking pan (to help contain mustard seeds when sprinkling). Make another roll with remaining half stack. Make 6 more rolls in same manner, transferring to cutting board.",
        "Lightly brush top of rolls with egg wash and immediately sprinkle with mustard seeds, pressing lightly on seeds to help adhere. Cut each roll crosswise into 4 pieces and arrange pieces 1 inch apart on 2 baking sheets. Bake, switching position of sheets halfway through baking, until phyllo is golden brown, about 12 minutes total.",
        "Transfer rolls to a rack to cool slightly."
    ],
    "ingredients": [
        "1 small onion, finely chopped",
        "1 tablespoon olive oil",
        "Scant teaspoon salt",
        "3/4 teaspoon ground cumin",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon turmeric",
        "1/2 teaspoon black pepper",
        "1/4 teaspoon ground coriander",
        "1 1/4 pound chicken thighs (with skin and bones)",
        "3/4 cup low-sodium chicken broth",
        "1/2 cup water",
        "1 (3-inch) cinnamon stick",
        "1/4 cup sliced almonds, toasted , cooled, and coarsely chopped",
        "2 large eggs, lightly beaten",
        "1 stick (1/2 cup) unsalted butter, melted",
        "8 (17- by 12-inch) phyllo sheets, thawed if frozen",
        "1 teaspoon ground cinnamon",
        "2 teaspoons brown mustard seeds",
        "Accompaniment: spiced tomato sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Egg",
        "Bake",
        "Cocktail Party",
        "Almond",
        "Spice",
        "Cinnamon",
        "Phyllo/Puff Pastry Dough",
        "Gourmet"
    ],
    "title": "Moroccan-Style Chicken Phyllo Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/moroccan-style-chicken-phyllo-rolls-108864"
}
