{
    "directions": [
        "Sprinkle the yeast over the water in a large bowl, and stir gently to moisten the yeast. Stir in salt, sugar, margarine, and 4 eggs, and beat well. Gradually mix in the flour, 1 cup at a time, up to 12 cups, until the dough becomes slightly tacky but not wet. Turn the dough out onto a floured surface, and knead until smooth and elastic, 8 to 10 minutes.",
        "Grease baking sheets, or line them with parchment paper and set aside.",
        "Cut the bread dough into 4 equal-sized pieces (or 2 pieces to make 2 large loaves). Cut each piece into thirds for  3-strand braided loaves. Working on a floured surface, roll the small dough pieces into ropes about the thickness of your thumb and about 12 inches long. Ropes should be fatter in the middle and thinner at the ends. Pinch 3 ropes together at the top and braid them. Starting with the strand to the right, move it to the left over the middle strand (that strand becomes the new middle strand.) Take the strand farthest to the left, and move it over the new middle strand. Continue braiding, alternating sides each time, until the loaf is braided, and pinch the ends together and fold them underneath for a neat look. Repeat for the remaining loaves.",
        "Place the loaves onto the prepared baking sheets, and let rise until double in size, 1 to 1 1/2 hours.",
        "Preheat an oven to 350 degrees F (175 degrees C). Whisk 1 egg with vanilla extract in a small bowl, and brush the loaves with the egg wash. Sprinkle each loaf with about 1 tablespoon of sesame seeds.",
        "Bake in the preheated oven until the tops are shiny and golden brown, about 30 minutes. Let cool before slicing."
    ],
    "ingredients": [
        "4 (.25 ounce) packages quick-rise yeast",
        "4 cups warm water (110 degrees F/45 degrees C)",
        "2 tablespoons salt",
        "3/4 cup white sugar",
        "1 cup pareve margarine, melted",
        "4 eggs",
        "12 cups bread flour, or as needed",
        "1 egg",
        "1/2 teaspoon vanilla extract",
        "1/4 cup sesame seeds, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Most Amazing Challah",
    "url": "http://allrecipes.com/recipe/152915/most-amazing-challah/"
}
