{
    "directions": [
        "Combine 1 1/2 cup flour, sugar, undissolved yeast, and salt in a large bowl. Over low heat in a small saucepan, heat evaporated milk, butter, and water until very warm (120 degrees to 130 degrees F).",
        "Gradually stir warm milk mixture into flour mixture. Beat 2 minutes at medium speed with electric mixer, scraping bowl occasionally. Add eggs and 1/2 cup flour; beat 2 minutes at high speed, scraping bowl occasionally. With a mixing spoon, add enough flour to make a stiff dough. Cover tightly with plastic wrap; refrigerate 2 hours or overnight.",
        "Lightly oil two baking sheets.",
        "Remove dough from refrigerator. Punch dough down. Place on a lightly floured surface. Roll to 21- by 12-inch rectangle. Sprinkle cinnamon and nutmeg on rolled out dough. Spread Mott's Applesauce to within 1/2 inch of edges. Fold crosswise into thirds to form a 12- by 7-inch rectangle. Press edges to seal.",
        "Cut dough into 12 (1-inch) strips. Holding ends of each strip, twist three times and pinch together ends of each twisted strip to form a wreath. Place wreaths on prepared baking sheets. Cover; let rise in warm, draft-free place until nearly doubled in size, about 30 to 45 minutes.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Bake 6 minutes; then switch positions of sheets so wreaths brown evenly. Continue baking 6 to 9 more minutes or until done. Remove wreaths from baking sheets; let cool on wire racks. Frost wreaths, if desired.",
        "Frosting: Combine confectioners' sugar, 4 teaspoons evaporated milk, and vanilla. Stir until smooth, adding another teaspoon of evaporated milk if needed for desired consistency."
    ],
    "ingredients": [
        "3 1/2 cups all-purpose flour, divided",
        "1/4 cup sugar",
        "1 (.25 ounce) package active dry yeast",
        "1 teaspoon salt",
        "3/4 cup evaporated milk",
        "1/4 cup butter or margarine",
        "1/4 cup water",
        "2 eggs",
        "Apple Filling:",
        "1 cup Mott's® Natural Applesauce",
        "2 tablespoons ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "Frosting (optional):",
        "1 cup confectioners' sugar",
        "4 teaspoons evaporated milk, or as needed",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mott's Applesauce Wreaths",
    "url": "http://allrecipes.com/recipe/240274/motts-applesauce-wreaths/"
}
