{
    "directions": [
        "Lay the slices of eggplant on paper towels, sprinkle lightly with salt, and set aside for 30 minutes to draw out the moisture. Then in a skillet over high heat, heat the olive oil. Quickly fry the eggplant until browned. Set aside on paper towels to drain.",
        "In a large skillet over medium heat, melt the butter and add the ground beef, salt and pepper to taste, onions, and garlic. After the beef is browned, sprinkle in the cinnamon, nutmeg, fines herbs and parsley. Pour in the tomato sauce and wine, and mix well. Simmer for 20 minutes.  Allow to cool, and then stir in beaten egg.",
        "To make the bechamel sauce, begin by scalding the milk in a saucepan. Melt the butter in a large skillet over medium heat. Whisk in flour until smooth. Lower heat; gradually pour in the hot milk, whisking constantly until it thickens. Season with salt, and white pepper.",
        "Arrange a layer of eggplant in a greased 9x13 inch baking dish. Cover eggplant with all of the meat mixture, and then sprinkle 1/2 cup of Parmesan cheese over the meat. Cover with remaining eggplant, and sprinkle another 1/2 cup of cheese on top. Pour the bechamel sauce over the top, and sprinkle with the nutmeg. Sprinkle with the remaining cheese.",
        "Bake for 1 hour at 350 degrees F (175 degrees C)."
    ],
    "ingredients": [
        "3 eggplants, peeled and cut lengthwise into 1/2 inch thick slices",
        "salt",
        "1/4 cup olive oil",
        "1 tablespoon butter",
        "1 pound lean ground beef",
        "salt to taste",
        "ground black pepper to taste",
        "2 onions, chopped",
        "1 clove garlic, minced",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/2 teaspoon fines herbs",
        "2 tablespoons dried parsley",
        "1 (8 ounce) can tomato sauce",
        "1/2 cup red wine",
        "1 egg, beaten",
        "4 cups milk",
        "1/2 cup butter",
        "6 tablespoons all-purpose flour",
        "salt to taste",
        "ground white pepper, to taste",
        "1 1/2 cups freshly grated Parmesan cheese",
        "1/4 teaspoon ground nutmeg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Moussaka",
    "url": "http://allrecipes.com/recipe/19644/moussaka/"
}
