{
    "directions": [
        "Preheat broiler on high and set oven rack 4 inches from heat. Line broiler pan or rimmed baking sheet with foil.",
        "In a medium saucepan, prepare polenta according to package directions.",
        "While polenta is cooking, prepare the pork chops. Place chops flat on cutting board and, using a sharp paring knife, make a horizontal slit 3 to 4 inches deep and 3 to 4 inches long in the side of each chop. Spread each mozzarella slice with 1 teaspoon anchovy paste. Stuff a piece of mozzarella inside each chop, press the pork closed, and secure with a toothpick.",
        "Rub the chops with 1 tablespoon oil, season with 1 teaspoon salt and 1/2 teaspoon pepper, and place on the foil-lined pan. Broil until cooked through, about 5 minutes per side.",
        "Meanwhile, in a large skillet over medium-high heat, warm remaining 1/4 cup oil. Add garlic, tomatoes, and broth. Cover and cook until tomatoes softened and just beginning to burst, 5 to 6 minutes. Remove cover and discard garlic. Stir in 1 tablespoon butter, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Taste and adjust seasoning.",
        "When the polenta is cooked, whisk in enough milk to thin the polenta to your desired consistency. Taste and adjust seasoning.",
        "Serve pork chops over polenta, topped with tomato pan sauce and parsley."
    ],
    "ingredients": [
        "1 cup quick-cooking polenta",
        "4 (1-inch) thick bone-in pork chops (about 2 1/2 pounds total)",
        "4 (1/4-inch) thick slices smoked mozzarella (about 3 1/2 ounces)",
        "4 teaspoons anchovy paste, divided",
        "1/4 cup plus 1 tablespoon extra-virgin olive oil, divided",
        "2 1/2 teaspoons kosher salt, divided",
        "1 1/4 teaspoons freshly ground black pepper, divided",
        "4 garlic cloves, smashed",
        "2 pints grape tomatoes (about 3 1/2 cups)",
        "1/2 cup low-sodium chicken or vegetable broth",
        "3 tablespoons unsalted butter, divided",
        "1/2 cup milk",
        "Chopped flat-leaf parsley, for serving",
        "toothpicks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Quick & Easy",
        "Dinner",
        "Mozzarella",
        "Pork Chop",
        "Hominy/Cornmeal/Masa",
        "22-Minute Meals",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Mozzarella-Stuffed Pork Chops with Polenta and Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/mozzarella-stuffed-pork-chops-with-polenta-and-tomatoes-51261030"
}
