{
    "directions": [
        "Mix flour and salt in large bowl. Place 1/2 cup warm water in small bowl. Sprinkle yeast over water and stir to blend. Let stand until dissolved, about 10 minutes. Pour yeast mixture into bowl with flour. Add oil and honey. Using flexible spatula, stir until coarse dough forms. Knead dough in bowl with 1 hand until smooth and elastic, about 6 minutes. Cover bowl; let dough stand 30 minutes. Refrigerate dough in bowl, still covered, at least 2 hours (dough will rise very little). (Can be made 2 days ahead; keep refrigerated.)",
        "Heat 2 tablespoons oil in heavy medium skillet over medium-high heat. Add onion and sauté until golden, about 12 minutes. Add vinegar and Worcestershire sauce. Reduce heat to medium-low; simmer until liquid cooks away and onion is very tender, about 4 minutes; season onion with salt and pepper.",
        "Heat remaining 1/2 cup oil in heavy small skillet over medium-low heat. Add garlic and sauté just until garlic begins to brown, about 4 minutes. Using slotted spoon, transfer garlic to custard cup. Pour oil into separate small bowl.",
        "Char bell pepper over gas flame or in broiler until blackened on all sides. Enclose in paper bag; let stand 10 minutes. Peel, seed, and slice thinly. (Onion, garlic, garlic oil, and pepper can be made 1 day ahead. Cover separately; chill.)",
        "Place chilled dough ball on work surface. Cover with plastic wrap; let stand at room temperature until malleable, about 1 hour.",
        "Position rack in bottom third of oven. Place heavy large baking sheet on rack (invert sheet if rimmed). Preheat oven to 500°F at least 30 minutes. Roll out dough on lightly floured surface to 12-inch round, allowing dough to rest a few minutes if it springs back. Sprinkle flour on pizza paddle or another rimless baking sheet. Slide under dough. Brush 1 tablespoon reserved garlic oil over dough, leaving 1/2-inch plain border. Sprinkle with mozzarella, then reserved garlic and balsamic onion. Top with pepper strips in spoke pattern. Sprinkle with Parmesan. Slide knife under dough to loosen from paddle, if sticking.",
        "Position paddle at far edge of hot baking sheet in oven. Tilt paddle and pull back slowly, allowing pizza to slide onto sheet. Bake 6 minutes. Rotate pizza half a turn. Bake until crust is deep brown, about 6 minutes longer. Arrange prosciutto atop pizza. Bake until prosciutto softens, about 30 seconds. Using paddle, transfer pizza to board. Sprinkle with thyme. Cut into 8 wedges. Serve, passing more vinegar and garlic oil separately."
    ],
    "ingredients": [
        "1 1/2 cups unbleached all purpose flour",
        "1 1/2 teaspoons coarse salt",
        "1/2 cup warm water (105°F to 115°F)",
        "1 teaspoon dry yeast",
        "1 1/2 tablespoons olive oil",
        "1 tablespoon honey",
        "2 tablespoons plus 1/2 cup olive oil",
        "1 12-ounce red onion, thinly sliced",
        "2 tablespoons balsamic vinegar",
        "2 teaspoons Worcestershire sauce",
        "4 large garlic cloves, chopped",
        "1 large red bell pepper",
        "All purpose flour",
        "1 cup (packed) coarsely grated whole-milk mozzarella cheese",
        "3 tablespoons coarsely grated Parmesan cheese",
        "4 thin slices prosciutto, sliced crosswise into thin strips",
        "2 teaspoons chopped fresh thyme",
        "Balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Bake",
        "Vinegar",
        "Mozzarella",
        "Parmesan",
        "Bell Pepper",
        "Prosciutto"
    ],
    "title": "Mozzarella and Prosciutto Pizza with Balsamic Onions",
    "url": "http://www.epicurious.com/recipes/food/views/mozzarella-and-prosciutto-pizza-with-balsamic-onions-107084"
}
