{
    "directions": [
        "Mix warm water with sugar in a large mixing bowl until the sugar has dissolved. Sprinkle yeast over the surface of the water, and let stand until the yeast begins to form a creamy layer on the water. Stir the yeast into the water. Stir in salt, and 1 cup of bread flour, and beat the flour in to form a loose batter. Stir in 1 more cup of flour, and mix in the mozzarella cheese, milk, and basil. Mix in the remaining 2 cups of flour in 1/2-cup additions.",
        "Turn the dough out onto a well-floured work surface, and knead until the dough is thoroughly mixed, but still sticky, 5 to 8 minutes. Add flour into the dough as you knead, if necessary. Form the dough into a ball, and place into an oiled bowl. Turn the dough over in the bowl to oil the surface of the dough, and cover with a cloth. Allow to rise until double, about 1 hour.",
        "With your fist, press firmly on the dough to deflate the large bubbles. Turn the dough out onto a well-floured work surface, and knead the dough just long enough to eliminate the remaining bubbles in the dough, about 1 minute. Cut the dough into 2 equal pieces, and form each half into a round ball. Spray a baking sheet with nonstick cooking spray, and place the balls onto the baking sheet. With a sharp knife, slash an X into the top of each loaf. Cover the loaves with a towel, and let rise until doubled, about 25 minutes.",
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Bake the loaves until browned, about 25 minutes. To serve, cut each loaf into 8 wedges."
    ],
    "ingredients": [
        "2 cups warm water (100 degrees F/40 degrees C)",
        "1 tablespoon white sugar",
        "1 tablespoon active dry yeast",
        "1 tablespoon salt",
        "4 cups bread flour, or as needed",
        "1 cup shredded mozzarella cheese",
        "1/4 cup milk",
        "1 tablespoon dried basil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mozzarella Basil Bread",
    "url": "http://allrecipes.com/recipe/215618/mozzarella-basil-bread/"
}
