{
    "directions": [
        "Whisk together the cocoa powder, Mexican oregano, basil, marjoram, cumin, hot chili powder, garlic powder, hickory salt, black pepper, and cayenne pepper. Combine the seasoning mix with the buffalo meat, chorizo, and pork; cover and refrigerate overnight.",
        "Heat a heavy skillet over medium heat, and fry the bacon until crisp. Remove the bacon with a slotted spoon to a large, heavy pot. In the same skillet, cook and stir the onion, habanero peppers, jalapeno peppers, garlic, and New Mexico chile powder in the bacon grease until onions are translucent; add the onion mixture to the pot.",
        "In the same skillet, fry the seasoned meat in small batches until well browned, adding lard as needed; remove the meats to the pot. Stir the diced tomatoes with green chiles, salsa, tomato paste, picante sauce, diced green chiles, and dark beer into the pot. Simmer until the meat is easily pierced with a fork, 2 to 3 hours. If the chili seems too dry, add dark beer as needed."
    ],
    "ingredients": [
        "1 teaspoon unsweetened cocoa powder",
        "1 teaspoon dried Mexican oregano",
        "1 teaspoon dried basil",
        "1 teaspoon dried marjoram",
        "2 teaspoons ground cumin",
        "1 tablespoon hot chili powder",
        "1 teaspoon garlic powder",
        "2 teaspoons hickory smoked salt",
        "1 teaspoon ground black pepper",
        "2 teaspoons cayenne pepper",
        "2 pounds buffalo stew meat, cubed",
        "2 pounds chorizo sausage, chopped",
        "2 pounds pork stew meat, cubed",
        "2 slices hickory-smoked bacon, diced",
        "3 sweet onions, coarsely chopped",
        "2 habanero peppers, seeded and chopped",
        "4 jalapeno peppers, seeded and chopped",
        "7 cloves garlic, minced",
        "2 teaspoons New Mexico chile powder",
        "1 tablespoon lard, or more as needed",
        "3 (10 ounce) cans diced tomatoes with green chile peppers (such as RO*TEL®), undrained",
        "2 (7.75 ounce) cans salsa (such as El Pato® Salsa de Chile Fresco)",
        "1 (6 ounce) can tomato paste",
        "1 (16 ounce) jar picante sauce (such as Pace® Picante Sauce)",
        "2 (4 ounce) cans diced green chiles (such as Ortega® Diced Green Chiles)",
        "1 (12 fluid ounce) bottle dark beer, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mr. Bill's New Mexico Buffalo Chili",
    "url": "http://allrecipes.com/recipe/189266/mr-bills-new-mexico-buffalo-chili/"
}
