{
    "directions": [
        "Place 2 tablespoons of soy sauce, 2 tablespoons of white wine, 1 teaspoon of sesame oil, and 2 teaspoons of cornstarch in a nonreactive bowl, and stir until smooth. Stir the pork strips into the marinade until thoroughly coated, and refrigerate for 1 hour.",
        "Pour hot water over the shiitake mushrooms in a bowl, and allow to soften for 15 to 20 minutes. Drain, pat dry, remove any hard stem pieces, and finely chop the mushrooms. Combine the mushrooms, green onions, garlic, and ginger in a bowl, and set aside.",
        "Remove the leaves from the Napa cabbage, and tear the green leafy portions from the central stalks of the leaves. Slice the stalks the long way into thin slices, then cut them into 1-inch pieces. Finely chop the green leafy portions, and set aside the sliced stems and chopped leaves in separate bowls.",
        "In a small bowl, stir together 3 tablespoons of soy sauce, 3 tablespoons of white wine, 1/2 teaspoon of cornstarch, sugar, and ground black pepper. Set the mixture aside.",
        "Heat vegetable oil and 1 teaspoon of sesame oil in a wok over medium-high heat, and cook and stir the marinated pork until cooked through, no longer pink, and the edges have begun to brown, about 5 minutes. Remove the pork to a bowl.",
        "Pour the beaten eggs into the hot wok, adding more vegetable oil if necessary, and cook and stir until the eggs are scrambled, firm, and well-broken up, about 2 minutes. Stir in the mushroom mixture, and cook and stir 1 to 2 minutes; then stir in the Napa cabbage stem pieces. Cook and stir until the stem pieces are hot but still crunchy, about 1 minute, and then add the chopped cabbage leaves. Pour in 2 tablespoons of white wine, cook and stir the mixture until hot, about 1 more minute, then mix in the cooked pork and the reserved cornstarch mixture. Stir everything together until slightly thickened and hot, about 2 minutes.",
        "Mix the hoisin sauce, 1 tablespoon of soy sauce, and 1 teaspoon of sesame oil in a small bowl until thoroughly combined. To serve, spread about 1 tablespoon of hoisin mixture on each pancake, top with about 1/2 cup of the pork mixture, roll, and serve."
    ],
    "ingredients": [
        "2 tablespoons soy sauce",
        "2 tablespoons white wine",
        "1 teaspoon sesame oil",
        "2 teaspoons cornstarch",
        "1 pound pork tenderloin, cut into thin strips",
        "1 3/4 ounces dried shiitake mushrooms",
        "1/2 cup sliced green onions",
        "3 tablespoons minced garlic",
        "2 tablespoons peeled and minced fresh ginger",
        "1 head Napa cabbage",
        "3 tablespoons soy sauce",
        "3 tablespoons white wine",
        "1/2 teaspoon cornstarch",
        "1/2 teaspoon white sugar",
        "1/4 teaspoon ground black pepper",
        "1 tablespoon vegetable oil, plus more if needed",
        "1 teaspoon sesame oil",
        "2 large eggs, beaten",
        "2 tablespoons white wine",
        "1 cup hoisin sauce",
        "1 tablespoon soy sauce",
        "1 teaspoon sesame oil",
        "16 frozen Chinese moo shu pancakes, thawed and warmed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mu Shu Pork",
    "url": "http://allrecipes.com/recipe/175631/mu-shu-pork/"
}
