{
    "directions": [
        "Bring milk just to simmer in small saucepan; remove from heat. Melt butter in heavy medium saucepan over medium heat. Whisk in flour; cook roux 2 minutes, whisking constantly (do not brown). Gradually whisk in warm milk. Cook until sauce is smooth and thick enough to drop from whisk in thin ribbon, whisking constantly, about 8 minutes. Remove from heat. Mix in cumin and season generously with salt and pepper; transfer to medium bowl. Cool 10 minutes. (Soufflé base can be made ahead. Press plastic wrap onto surface. Let stand 2 hours or chill 1 day. Bring to room temperature before using.)",
        "Preheat oven to 400°F. Butter 4- to 5-cup soufflé dish; coat inside with panko. Whisk egg yolks into soufflé base 1 at a time; stir in cheese cubes. Beat egg whites and pinch of salt in another medium bowl until stiff but not dry.",
        "Fold egg whites into soufflé base in 3 additions; transfer to prepared dish.",
        "Bake soufflé until puffed, brown on top, and firm but jiggly to touch, about 28 minutes. Spoon soufflé onto 4 plates. Arrange salad alongside and serve.",
        "*Available at some supermarkets and at Asian markets."
    ],
    "ingredients": [
        "1 1/4 cups whole milk",
        "1 1/2 tablespoons butter",
        "3 tablespoons all purpose flour",
        "1/4 teaspoon ground cumin",
        "Panko (Japanese breadcrumbs)*",
        "3 large eggs, separated",
        "1 cup 1/3-inch cubes rindless French Muenster cheese (about 4 ounces)",
        "Red Bell Pepper and Tomato Salad"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Egg",
        "Pepper",
        "Tomato",
        "Appetizer",
        "Bake",
        "Lunch",
        "Fall",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Kosher"
    ],
    "title": "Muenster Cheese Soufflé with Red Bell Pepper and Tomato Salad",
    "url": "http://www.epicurious.com/recipes/food/views/muenster-cheese-souffle-with-red-bell-pepper-and-tomato-salad-234121"
}
