{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Place bacon in a large, deep, cast iron skillet. Cook over medium high heat until evenly brown, then crumble and set aside, reserving the bacon fat in the skillet.",
        "Meanwhile, stir together the bread crumbs, parsley, Cajun seasoning, salt, garlic powder, onion powder, paprika, and black pepper in a shallow dish. Whisk together the egg and hot pepper sauce in a separate bowl, and set aside.",
        "Cut a pocket into the side of the chicken breasts using a thin bladed knife. Stuff each breast with a slice of Muenster cheese, and 1/4 of the crumbled bacon; reserve the remaining bacon for later. Secure the chicken breast pockets with a toothpick or skewer, then dip into the egg mixture, letting excess egg drip off before pressing into the bread crumb mixture.",
        "Reheat the bacon fat in the cast iron skillet over medium heat. Once hot, add the chicken breasts, and cook until golden brown on one side (about 2 minutes), then turn the breasts over, and place the skillet into the preheated oven. Bake until the chicken is no longer pink in the center, and registers 165 degrees F ( 75 degrees C) on a meat thermometer, 20 to 25 minutes.",
        "When the chicken has cooked, top each piece with a slice of provolone cheese, and sprinkle with the remaining bacon. Return to the oven, and cook until the cheese has melted, about 1 minute more."
    ],
    "ingredients": [
        "6 slices bacon",
        "1 cup dry bread crumbs",
        "1 tablespoon dried parsley",
        "2 teaspoons Cajun seasoning (such as Emeril's Essence™)",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons garlic powder",
        "1 teaspoon onion powder",
        "1 teaspoon paprika",
        "1/2 teaspoon ground black pepper",
        "2 large eggs",
        "1 tablespoon hot pepper sauce",
        "3 slices Muenster cheese",
        "3 (6 ounce) skinless, boneless chicken breast halves",
        "3 slices provolone cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Muenster-Bacon Stuffed Chicken Breast",
    "url": "http://allrecipes.com/recipe/163590/muenster-bacon-stuffed-chicken-breast/"
}
