{
    "directions": [
        "In a medium bowl, mix jumbo black olives, green olives, celery, red onion, garlic, basil, parsley, olive oil, oregano, salt and freshly ground black pepper. Cover and chill in the refrigerator until using.",
        "Preheat oven to 500 degrees F (260 degrees C). Sprinkle pizza crust with olive oil, salt and garlic powder.",
        "Place the crust directly on the oven rack. Bake for about 5 minutes. Do not allow crust to become overly browned or crisp. Remove from heat and allow to cool.",
        "In a medium bowl, mix together mozzarella cheese, Provolone cheese, Parmesan cheese, hard salami, mortadella and prosciutto. Stir in the olive mixture.",
        "Preheat the broiler. Spread the cheese and vegetable mixture over the baked pizza crust.",
        "Broil 5 minutes, or until cheeses are melted and meats are lightly browned. Cut into 3 inch squares and serve immediately."
    ],
    "ingredients": [
        "8 jumbo black olives, pitted",
        "8 pitted green olives",
        "2 tablespoons chopped celery",
        "2 tablespoons chopped red onion",
        "2 cloves chopped garlic",
        "6 leaves chopped fresh basil",
        "1 tablespoon chopped fresh parsley",
        "2 tablespoons olive oil",
        "1/2 teaspoon dried oregano",
        "salt and freshly ground black pepper to taste",
        "1 (16 ounce) package ready made pizza crust",
        "1 tablespoon olive oil",
        "1/2 teaspoon garlic powder to taste",
        "salt to taste",
        "2 ounces shredded mozzarella cheese",
        "2 ounces shredded provolone cheese",
        "2 ounces grated Parmesan cheese",
        "2 ounces thinly sliced hard salami, cut into strips",
        "2 ounces thinly sliced mortadella, cut into strips",
        "4 ounces thinly sliced prosciutto, cut into strips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Muffaletta Pizza",
    "url": "http://allrecipes.com/recipe/26871/muffaletta-pizza/"
}
