{
    "directions": [
        "Place cereal in large bowl. Pour 2 cups boiling water over. Let stand until mixture cools to between 105°F. and 115°F., about 20 minutes.",
        "Sprinkle yeast over cereal. Add 1 cup bread flour, oil, sugar and salt and stir until smooth. Gradually mix in enough remaining bread flour to form dough. Cover dough; let rest 15 minutes.",
        "Turn out dough onto floured surface. Knead until smooth and elastic, adding more flour if sticky, about 10 minutes. Oil large bowl. Add dough to bowl; turn to coat. Cover bowl with clean kitchen towel. Let dough rise in warm area until doubled, about 1 hour.",
        "Mix all seeds in bowl. Punch down dough. Turn out onto lightly oiled surface. Knead briefly. Shape into 12x4-inch loaf.Sprinkle baking sheet with 2 teaspoons seeds. Place loaf atop seeds. Cover with towel. Let rise in warm area until almost doubled, about 30 minutes.",
        "Position 1 oven rack in center and 1 just below center in oven. Place baking pan on lower rack and preheat oven to 425°F. Brush loaf with water. Sprinkle with remaining seed mixture. Using sharp knife, cut 3 diagonal slashes in surface of loaf. Place baking sheet with loaf in oven. Immediately pour 2 cups water into hot pan on lower rack in oven (water will steam).",
        "Bake loaf until golden and crusty and tester inserted into center comes out clean, about 35 minutes. Transfer to rack and cool.(Can be made 1 day ahead. Wrap in plastic; store at room temperature.)",
        "*Available at natural foods stores."
    ],
    "ingredients": [
        "1/2 cup unsweetened multi-grain cereal (such as 7-grain)",
        "2 cups boiling water",
        "1 envelope dry yeast",
        "4 1/3 cups (about) bread flour",
        "1 tablespoon olive oil",
        "1 tablespoon dark brown sugar",
        "1 1/2 teaspoons salt",
        "2 teaspoons sesame seeds",
        "2 teaspoons flax seeds*",
        "2 teaspoons poppy seeds",
        "2 cups water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Bake"
    ],
    "title": "Multi-Grain Bread with Sesame, Flax and Poppy Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/multi-grain-bread-with-sesame-flax-and-poppy-seeds-523"
}
