{
    "directions": [
        "Preheat oven to 450°F. Toss squash with 1 1/2 tablespoons oil in large bowl. Sprinkle generously with salt and pepper. Transfer squash to large rimmed baking sheet. Roast until tender and brown around edges, using metal spatula to turn occasionally, 30 to 35 minutes. Remove from oven and set aside.",
        "Heat 1 tablespoon oil in large nonstick skillet over medium-high heat. Add lamb and onions; sauté until lamb browns and onions soften, 7 to 8 minutes. Add garlic and next 3 ingredients; stir 1 minute. Stir in tomatoes, then broth and bring to boil, scraping up any browned bits. Reduce heat; simmer until mixture thickens, about 5 minutes. Stir in squash. Season with salt and pepper.",
        "Cook pasta in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain, reserving 1 cup cooking liquid. Return pasta to pot. Add lamb mixture, half of cilantro, and half of cheese; toss. Add reserved cooking liquid by 1/3 cupfuls to moisten. Season with salt and pepper. Transfer pasta to bowl. Sprinkle with remaining cilantro and cheese."
    ],
    "ingredients": [
        "4 8-ounce packages fresh peeled cubed butternut squash (5 to 6 cups)",
        "2 1/2 tablespoons olive oil, divided",
        "8 ounces ground lamb",
        "2 1/2 cups chopped onions",
        "3 large garlic cloves, minced",
        "2 teaspoons ground cumin",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon cayenne pepper",
        "1 cup canned crushed tomatoes with added puree (from 28-ounce can)",
        "2 cups low-salt chicken broth",
        "8 ounces multi-grain penne pasta (such as barilla)",
        "1/2 cup chopped fresh cilantro, divided",
        "1/2 cup grated kasseri cheese, divided",
        "Ingredient info: Look for kasseri, a firm white cheese made from sheep's milk, at supermarkets and Greek markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Lamb",
        "Pasta",
        "Quick & Easy",
        "High Fiber",
        "Dinner",
        "Ground Lamb",
        "Squash",
        "Fall",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Multi-Grain Pasta with Butternut Squash, Ground Lamb, and Kasseri",
    "url": "http://www.epicurious.com/recipes/food/views/multi-grain-pasta-with-butternut-squash-ground-lamb-and-kasseri-362950"
}
