{
    "directions": [
        "Combine 3 cups flour and next 6 ingredients in bowl of heavy-duty stand mixer fitted with paddle attachment. Warm 1 cup water and buttermilk in small saucepan over low heat just until instant-read thermometer inserted into mixture registers 95°F. Add buttermilk mixture, oil, and honey to flour mixture; mix on low speed until dough forms coarse ball, about 2 minutes. Let dough rest in bowl 5 minutes (dough will be sticky). Replace paddle attachment on mixer with dough hook. Mix on medium speed until dough is smooth, elastic, and slightly tacky but not sticky, adding more flour by tablespoonfuls as needed, about 4 minutes.",
        "Lightly oil large bowl. Shape dough into ball; place in bowl, turning to coat with oil. Cover with plastic; chill overnight (dough will rise slowly; do not punch down).",
        "Let dough rise, covered, in draft-free area at room temperature 1 1/2 to 2 hours before shaping (dough may not double). Line 2 rimmed baking sheets with parchment paper. Transfer dough to floured surface; divide into 18 equal pieces. Roll each piece into smooth ball. Place on prepared baking sheets, spacing apart. Spray dough balls with nonstick spray. Cover loosely with plastic wrap and let rise in warm draft-free area until puffed (rolls may not double in volume), about 1 hour.",
        "Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 400°F. Brush rolls with egg glaze. Sprinkle with poppy seeds. Bake 10 minutes. Reverse sheets and continue to bake until rolls are lightly browned and firm to touch, 10 to 12 minutes longer. Cool rolls completely on rack. DO AHEAD: Wrap in foil, then enclose in resealable plastic bags and freeze up to 2 weeks. Thaw at room temperature. If desired, rewarm rolls wrapped in foil in 350°F oven about 10 minutes."
    ],
    "ingredients": [
        "3 cups (or more) whole wheat flour",
        "1/3 cup old-fashioned oats",
        "1/3 cup cornmeal",
        "1/3 cup wheat bran",
        "2 1/2 tablespoons golden brown sugar",
        "2 teaspoons quick-rising dry yeast",
        "1 1/2 teaspoons coarse kosher salt",
        "1 cup water",
        "1/2 cup buttermilk",
        "1 tablespoon vegetable oil",
        "1 tablespoon honey or agave syrup",
        "Nonstick vegetable oil spray",
        "1 large egg, beaten to blend with",
        "2 tablespoons water (for glaze)",
        "Poppy seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Egg",
        "Breakfast",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Low Cal",
        "High Fiber",
        "Oat",
        "Healthy",
        "Low Cholesterol",
        "Honey",
        "Christmas Eve",
        "Buttermilk",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Multi-Grain Dinner Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/multi-grain-dinner-rolls-355787"
}
