{
    "directions": [
        "1. Roast the chiles as for rajas (see note) and cut them into 1/2-inch dice.",
        "2. Heat a heavy pan (preferably cast iron) over medium-high heat until very hot.",
        "3. In a bowl, toss the corn with 1 teaspoon of the olive oil and a sprinkling of salt. Spread the corn in the hot pan and let it blacken slightly, without stirring, for 30 seconds. Have a lid ready in case the kernels begin to pop. Remove the roasted corn from the pan.",
        "4. In the same pan, heat 2 teaspoons of the olive oil. Add the onion and diced chiles and cook, stirring often, until the onion is soft and beginning to brown. Season lightly with salt and remove from the pan.",
        "5. Reduce the heat and add the remaining olive oil. Add the garlic and mushrooms. Cook, stirring often, until the mushrooms are cooked through, 2 to 3 minutes. Return the corn and chiles to the pan and stir to reheat.",
        "6. Turn off the heat and stir in the epazote, if using, black pepper, and queso fresco.",
        "7. To assemble the tacos, spoon some vegetables onto a tortilla. Top with a generous tablespoon of salsa and sprinkle about 1 teaspoon of cotixa cheese over all. Top with a cilantro sprig."
    ],
    "ingredients": [
        "2 Anaheim chiles",
        "1 poblano chile",
        "1 cup fresh corn kernels (about 1 ear)",
        "1 1/2 tablespoons olive oil",
        "Kosher salt",
        "1/2 white onion, peeled and cut into 1/2-inch dice",
        "1 large clove garlic, thinly sliced",
        "6 ounces cremini or white button mushrooms, trimmed and quartered",
        "6 fresh epazote leaves, chopped (about 1 tablespoon, optional)",
        "Fresh-ground black pepper",
        "1/2 cup queso fresco, cut into small cubes",
        "6 warm corn tortillas",
        "Salsa quemada",
        "1/4 cup grated cotixa or añejo cheese",
        "Cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Onion",
        "Roast",
        "Vegetarian",
        "Cinco de Mayo",
        "Dinner",
        "Corn",
        "Tortillas",
        "Chile Pepper",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Mushroom, Rajas, and Corn Taco with Queso Fresco",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-rajas-and-corn-taco-with-queso-fresco-358750"
}
