{
    "directions": [
        "In a small bowl soak dried mushrooms (if using) in the boiling water 20 minutes and transfer to a cutting board, reserving liquid. Discard stems of shiitake (if using) and slice mushrooms thin. Strain reserved liquid through a fine sieve lined with a dampened paper towel into another small bowl.",
        "In a heavy kettle (at least 5 quarts) cook garlic in oil over moderate heat, stirring, until golden. Add onions and cook, stirring, until pale golden. Add white mushrooms, dried mushrooms (if using), and soy sauce and sauté over moderately high heat, stirring, until liquid mushrooms give off is evaporated. Add Sherry and boil until evaporated.",
        "Add broth, water, strained mushroom-soaking liquid, barley, carrots, and dried herbs to mushroom mixture and simmer, covered, 1 hour. Season soup with salt and pepper. Soup may be prepared up to this point 4 days ahead (cool uncovered before chilling covered.)",
        "Just before serving, stir in parsley."
    ],
    "ingredients": [
        "1 ounce dried shiitake mushrooms or other dried mushrooms such as porcini, morels, or chanterelles if desired",
        "1 cup boiling-hot water if using dried mushrooms",
        "6 garlic cloves, chopped fine",
        "1/4 cup olive oil",
        "3 medium onions, chopped fine",
        "2 pounds white mushrooms, sliced thin",
        "1 tablespoon soy sauce",
        "1/2 cup medium-dry Sherry",
        "5 cups chicken broth",
        "5 cups water",
        "1 cup pearl barley",
        "8 carrots, sliced diagonally 1/2 inch thick",
        "1/2 teaspoon dried thyme, crumbled",
        "1/2 teaspoon dried rosemary, crumbled",
        "1/3 cup minced fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Herb",
        "Mushroom",
        "Onion",
        "Barley",
        "Carrot",
        "Sherry",
        "Winter",
        "Gourmet"
    ],
    "title": "Mushroom Barley Soup",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-barley-soup-11525"
}
