{
    "directions": [
        "Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Add mushrooms and sauté until soft and dry, about 5 minutes. Add remaining 1 tablespoon butter to skillet, then shallot. Sauté until shallot is soft, about 4 minutes longer. Add nutmeg. Season mushroom filling with salt and pepper. Cool.",
        "Line baking sheet with parchment paper. Roll out puff pastry onto lightly floured surface to 12x15-inch rectangle. Cut one 12x5-inch rectangle, two 11x1/2-inch strips and two 5x1/2-inch strips from pastry. Place rectangle on prepared baking sheet. Pierce all over with fork. Using pastry brush, brush all strips with egg. Place short strips, egg side down, atop ends of pastry to form raised crust edge; place long strips, egg side down, atop long sides of pastry. (Mushroom filling and tart shell can be prepared 1 day ahead. Cover separately and refrigerate.)",
        "Preheat oven to 400°F. Bake tart shell until golden, about 15 minutes. Maintain oven temperature. Spread cheese evenly over bottom of hot tart shell. Top with mushrooms. Sprinkle with thyme, salt, and pepper. Drizzle with cream. Bake until heated through, about 10 minutes. Serve hot."
    ],
    "ingredients": [
        "3 tablespoons unsalted butter",
        "8 ounces button mushrooms, cut into 1/2-inch pieces",
        "1 large shallot, minced",
        "1/8 teaspoon ground nutmeg",
        "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed",
        "1 large egg, beaten to blend",
        "3 ounces soft fresh goat cheese (such as Montrachet), room temperature",
        "1 teaspoon minced fresh thyme",
        "2 tablespoons whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Appetizer",
        "Bake",
        "Goat Cheese",
        "Phyllo/Puff Pastry Dough"
    ],
    "title": "Mushroom and Goat Cheese Tart",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-and-goat-cheese-tart-105063"
}
