{
    "directions": [
        "Blend flour, salt, and sugar in processor. Add butter; using on/off turns, process until coarse meal forms. Whisk 1 egg and 1 teaspoon cold water in small bowl; add to flour mixture. Using on/off turns, process just until moist clumps form. Transfer to work surface and knead gently until dough comes together, about 4 turns. Form into ball; flatten into disk. Wrap in plastic and chill 1 hour. Do ahead Dough can be made 1 day ahead. Keep chilled.",
        "Butter 9 1/2-inch round fluted tart pan with removable bottom. Roll out dough on lightly floured surface to 12-inch round. Transfer dough to pan, pressing onto bottom and up sides of pan; trim any excess dough. Chill 1 hour.",
        "Preheat oven to 400°F. Butter large square of foil and press, butter side down, onto crust. Fill with pie weights or dried beans. Bake 20 minutes. Remove foil and weights. Using fork, pierce bottom of crust all over (about 10 times). Bake until golden, about 10 minutes. Brush lightly with egg white. Cool. Do ahead Can be baked 6 hours ahead. Let stand at room temperature.",
        "Melt butter in large nonstick skillet over medium heat. Add shallots; sauté until soft, about 2 minutes. Add mushrooms; sprinkle with salt and pepper. Increase heat to high and sauté until liquid is absorbed and mushrooms are tender, about 8 minutes. Sprinkle with 2 1/2 teaspoons thyme and cook 1 minute. Transfer mixture to plate. Cool mushrooms completely.",
        "Preheat oven to 350°F. Place cooled crust in pan on baking sheet. Sprinkle with remaining 2 1/2 teaspoons thyme. Drain mushrooms, if needed. Scatter mushrooms over thyme. Whisk cream, eggs, salt, and pepper in medium bowl. Pour egg mixture over mushrooms. Sprinkle with green onions and cheese.",
        "Bake quiche until custard is set, about 25 minutes. Cool 15 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1 teaspoon salt",
        "1 teaspoon sugar",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 large egg",
        "1 teaspoon cold water",
        "1 large egg white, lightly beaten",
        "1 1/2 tablespoons unsalted butter",
        "1/3 cup chopped shallots (about 2 medium)",
        "1/2 pound mushrooms, cut into 1/4-inch slices",
        "5 teaspoons chopped fresh thyme, divided",
        "3/4 cup whipping cream",
        "2 large eggs",
        "Pinch of salt",
        "Pinch of ground black pepper",
        "2 green onions (white and pale green parts only), thinly sliced",
        "2 tablespoons finely grated Gruyère cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Egg",
        "Mushroom",
        "Onion",
        "Breakfast",
        "Bake",
        "Thyme",
        "Shallot",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mushroom-Shallot Quiche",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-shallot-quiche-236171"
}
