{
    "directions": [
        "In the medium saucepan, melt 2 tablespoons/28 g of the butter over medium heat and add the onion. Cook until the onion is soft and translucent, then add the mushrooms and the remaining butter. Let the mixture sweat for about 8 minutes, taking care that the onion doesn't take on any brown color. Stir in the chicken stock and the parsley and bring to a boil. Immediately reduce the heat and simmer for about an hour.",
        "After an hour, remove the parsley and discard. Let the soup cool for a few minutes, then transfer to the blender and carefully blend at high speed until smooth. Do I have to remind you to do this in stages, with the blender's lid firmly held down, and with the weight of your body keeping that thing from flying off and allowing boiling hot mushroom purée to erupt all over your kitchen?",
        "When blended, return the mix to the pot, season with salt and pepper, and bring up to a simmer again. Add the sherry, mix well, and serve immediately.",
        "To astound your guests with a Wild Mushroom Soup, simply replace some of those button mushrooms with a few dried cèpes or morels, which have been soaked until soft, drained, and squeezed. Not too many; the dried mushrooms will have a much stronger taste, and you don't want to overwhelm the soup. Pan sear, on high heat, a single small, pretty, fresh chanterelle or morel for each portion, and then slice into a cute fan and float on top in each bowl.",
        "And if you really want to ratchet your soup into pretentious (but delicious), drizzle a few tiny drops of truffle oil over the surface just before serving. Why the hell not? Everybody else is doing it."
    ],
    "ingredients": [
        "6 tbsp/75 g butter",
        "1 small onion, thinly sliced",
        "12 ounces/340 g button mushrooms",
        "4 cups/900 ml light chicken stock or broth",
        "1 sprig of flat parsley",
        "Salt and pepper",
        "N/A freshly ground black pepper",
        "2 ounces/56 ml high-quality sherry (don't use the cheap grocery-store variety; it's salty and unappetizing and will ruin your soup)",
        "Medium saucepan",
        "Wooden spoon",
        "Blender"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Mushroom",
        "Onion",
        "Sherry",
        "Fall"
    ],
    "title": "Mushroom Soup",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-soup-231145"
}
