{
    "directions": [
        "Mince enough onion to measure 1/2 cup and finely chop mushrooms. In a 9- to 10-inch heavy skillet cook onion in butter over moderate heat, stirring, until softened. Add mushrooms, Sherry, nutmeg, and salt and pepper to taste and sauté over moderately high heat, stirring, until liquid mushrooms give off is evaporated. Cool mushroom mixture.",
        "On a lightly floured surface roll out 1 sheet of pastry into a 13-inch square and, using Brie as a guide, cut out 1 round the size of the Brie. Cut out a mushroom shape from scraps for decoration.",
        "Horizontally halve Brie. Roll out remaining sheet of pastry into a 13-inch square and transfer to a shallow baking pan. Center bottom half of Brie, cut side up, on pastry square and spread mushroom mixture on top. Cover mushroom mixture with remaining half of Brie, cut side down.",
        "Without stretching pastry, wrap it snugly up over Brie and trim excess to leave a 1-inch border of pastry on top of Brie. In a small bowl lightly beat egg and brush onto border. Top Brie with pastry round, pressing edges of dough together gently but firmly to seal. Brush top of pastry with some egg and arrange pastry mushroom on it. Lightly brush mushroom with some egg, being careful not to let egg drip over edge of mushroom (which would prevent it from rising). With back of a sharp small knife gently score side of pastry with vertical marks, being careful not to cut through dough. Chill Brie, uncovered, 30 minutes. Brie may be made up to this point 1 day ahead and chilled, loosely covered.",
        "Preheat oven to 425°F.",
        "Bake Brie in middle of oven until pastry is puffed and golden, about 20 minutes. Let Brie stand in pan on a rack 15 minutes and transfer with a spatula to a serving plate.",
        "Serve Brie with bread or crackers."
    ],
    "ingredients": [
        "1 small onion",
        "1/2 pound mushrooms",
        "2 tablespoons unsalted butter",
        "1 tablespoon dry Sherry",
        "1/2 teaspoon freshly grated nutmeg",
        "a 17 1/4-ounce package frozen puff pastry sheets, thawed according to package directions",
        "a chilled 14- to 17-ounce wheel Brie",
        "1 large egg",
        "Accompaniment: French bread slices or crackers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Oscars",
        "Buffet",
        "Brie",
        "Fall",
        "Phyllo/Puff Pastry Dough",
        "Gourmet"
    ],
    "title": "Mushroom-Stuffed Brie en Croûte",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-stuffed-brie-en-croute-15732"
}
