{
    "directions": [
        "In a large (12- to 14-inch) non-stick skillet heat 2 tablespoons oil over moderately high heat until hot but not smoking and sauté radicchio, stirring, until wilted and golden. In a food processor pulse quartered mushrooms until chopped fine. Add chopped mushrooms to radicchio with salt and pepper to taste and sauté, stirring, until liquid mushrooms give off is evaporated.",
        "In a heavy saucepan melt butter over moderately low heat and whisk in flour until smooth. Cook roux, whisking, 3 minutes. Whisk in milk in a stream and salt and pepper to taste and simmer, whisking occasionally, 5 minutes, or until thick. Stir sauce into mushroom mixture. Mushroom sauce may be made 3 days ahead and chilled, its surface covered with plastic wrap.",
        "In cleaned skillet cook garlic in remaining 2 tablespoons oil over moderately low heat until softened. Add sliced mushrooms and sauté over moderately high heat, stirring, until golden and liquid mushrooms give off is evaporated. Stir in parsley and salt and pepper to taste. Remove skillet from heat and cool. Stir in lemon juice.",
        "Reserve 1/2 cup smoked mozzarella for topping. In a bowl combine remaining smoked mozzarella with plain mozzarella.",
        "Preheat oven to 375°F.",
        "Pour 1 cup mushroom sauce into a baking dish, 13 by 9 by 2 inches (sauce will not cover bottom completely), and cover with 3 lasagne sheets, making sure they do not touch each other. Spread about 1 cup sauce over pasta. Top sauce with one third of sliced mushroom mixture and half of mixed cheeses. Make 1 more layer in same manner, beginning and ending with pasta. Spread remaining sauce evenly over top pasta layer, making sure pasta is completely covered. Spread remaining sliced mushroom mixture evenly over sauce and sprinkle with reserved smoked mozzarella.",
        "Cover dish tightly with foil, tenting slightly to prevent foil from touching top layer, and bake in middle of oven 30 minutes. Remove foil and bake lasagne 10 minutes more, or until top is bubbling and golden. Let lasagne stand 5 minutes before serving."
    ],
    "ingredients": [
        "4 tablespoons vegetable oil",
        "1 1/2 pounds radicchio, chopped",
        "2 1/4 pounds white mushrooms, half sliced thin and half quartered",
        "1/2 stick (1/4 cup) unsalted butter",
        "4 tablespoons all-purpose flour",
        "2 1/2 cups milk",
        "2 garlic cloves, minced",
        "1 cup fresh flat-leafed parsley leaves, washed well, spun dry, and chopped fine",
        "2 teaspoons fresh lemon juice, or to taste",
        "8 ounces smoked mozzarella, grated (about 2 cups)",
        "4 ounces plain mozzarella, grated (about 1 cup)",
        "nine 7- by 3 1/2-inch sheets dry no-boil lasagne pasta"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Mushroom",
        "Vegetable",
        "Bake",
        "Vegetarian",
        "Mozzarella",
        "Winter",
        "Gourmet"
    ],
    "title": "Mushroom, Radicchio, and Smoked Mozzarella Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-radicchio-and-smoked-mozzarella-lasagne-13477"
}
