{
    "directions": [
        "Soak porcini in 1 1/2 cups hot water in a bowl until softened, about 20 minutes. Lift porcini out, squeezing liquid back into bowl. Rinse to remove any grit and coarsely chop. Pour soaking liquid through a sieve lined with a coffee filter or a dampened paper towel into a 3- to 4-quart saucepan, then add broth, soy sauce, and remaining 21/4 cups water to pan and bring to a simmer.",
        "Meanwhile, heat oil with 1 tablespoon butter in a 4- to 5-quart heavy pot over moderately high heat until foam subsides, then sauté onion, stirring, until just softened, about 5 minutes. Add garlic and fresh mushrooms and sauté, stirring, until mushrooms are browned and any liquid they give off is evaporated, about 8 minutes. Stir in porcini and cook, stirring, 1 minute, then add rice and cook, stirring, 1 minute. Add wine and cook, stirring, until absorbed, about 1 minute.",
        "Stir 1 cup simmering broth into rice and cook, stirring constantly and keeping at a strong simmer, until absorbed. Continue cooking and adding broth, about 1 cup at a time, stirring frequently and letting each addition be absorbed before adding next, until rice is tender and creamy looking but still al dente, 18 to 20 minutes. Thin with some of remaining broth if necessary. (You will have about 1 cup left over.) Remove from heat. Stir in cheese, salt, pepper, and remaining 5 tablespoons butter until butter is melted.",
        "If reserving some risotto to make one of the following recipes, set aside 3 cups and cool to room temperature, then chill, covered with plastic wrap.",
        "Stir parsley into remaining risotto and serve immediately."
    ],
    "ingredients": [
        "1 oz (28 g) dried porcini (1 cup)",
        "3 3/4 cups hot water",
        "5 1/4 cups reduced-sodium chicken broth (42 fl oz)",
        "1 tablespoon soy sauce",
        "1 tablespoon olive oil",
        "3/4 stick (6 tablespoons) unsalted butter",
        "1 small onion, finely chopped (1 cup)",
        "2 garlic cloves, finely chopped",
        "3/4 lb fresh cremini mushrooms, trimmed and thinly sliced",
        "1 lb Arborio rice (2 1/3 cups)",
        "2/3 cup dry white wine",
        "1 oz finely grated Parmigiano-Reggiano (1/2 cup)",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/4 cup chopped fresh flat-leaf parsley",
        "Special equipment: parchment paper (if reserving some risotto for another recipe)",
        "Garnish: Parmigiano-Reggiano shavings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Rice",
        "Sauté",
        "Dinner",
        "Fall",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Mushroom Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-risotto-231798"
}
