{
    "directions": [
        "1. Melt the butter and olive oil together in a large skillet, well sprayed with cooking spray, over medium heat for about 1 minute. Add the onion and sauté, stirring often, for about 4 minutes, or until the onion begins to soften. Raise the heat slightly and add the mushroom caps. Continue cooking, stirring often, for 5 to 6 minutes more.",
        "2. Pour the vegetable stock into a medium saucepan or Dutch oven, preferably nonstick, and warm over medium-low heat.",
        "3. Pour the wine into a food processor and add the garlic, flour, golden miso, dark miso, nutritional yeast, and mustard. Buzz together to form a paste.",
        "4. Whisk the paste into the warmed, but not hot, vegetable stock. Gently bring to a boil, then reduce to a simmer. Take a ladleful of this liquid and swirl it into the sautéed mushroom mixture, stirring well to scrape up any little flavorful bits from the bottom of the skillet. Add the mushrooms, onions, and liquid to the pot with the stock, scraping the sauté pan clean.",
        "5. Reduce the heat to very low and let the sauce simmer very gently, stirring occasionally, for about 30 minutes. Correct the seasonings with salt (you'll need little, if any, since miso is salty) and a lot of pepper. Serve hot, ladled over whatever good thing you are serving."
    ],
    "ingredients": [
        "1 teaspoon of butter or Better (see tips, below)",
        "1 teaspoon olive oil",
        "Cooking spray",
        "1/4 medium onion, finely chopped",
        "2 cups sliced mushroom caps (about 1/3 pound)",
        "3 1/4 cups vegetable stock (see tips, below)",
        "3/4 cup dry white wine",
        "2 cloves garlic, peeled and quartered",
        "1/4 cup unbleached all-purpose flour",
        "1 tablespoon golden miso (sweet white miso)",
        "1 tablespoon dark miso (traditional red miso)",
        "3 tablespoons nutritional yeast (see tips, below)",
        "1 teaspoon Dijon mustard",
        "Salt and freshly ground black pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Mushroom",
        "Mustard",
        "Soy",
        "Vegetarian"
    ],
    "title": "Mushroom-Miso-Mustard Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-miso-mustard-gravy-231051"
}
