{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan. Tear the pumpernickel into pieces, and place into the work bowl of a food processor. Pulse several times to chop the bread into crumbs.",
        "Lightly mix the pumpernickel crumbs, ground chuck, ground pork, egg, onion, diced tomatoes, 1/4 cup of the reserved juice from the tomatoes, green pepper, onion powder, garlic salt, black pepper, Worcestershire sauce, and soy sauce together in a bowl until the mixture is very well combined. Do not over mix, or the meat loaf will be tough.",
        "Place half the meat mixture into the bottom of the prepared loaf pan, and gently press to smooth the top. Place 3 slices of Swiss cheese over the meat mixture, and spread the sliced mushrooms evenly over the cheese. Top the mushrooms with the remaining 3 slices of Swiss cheese, and spread the rest of the meat mixture in an even layer over the cheese. Press the top gently to smooth.",
        "Bake the meatloaf in the preheated oven for 45 minutes, then remove from oven and spread with the chili sauce in an even layer. Return the meatloaf to the oven and bake until the juices run clear and the chili sauce has thickened into a glaze, about 15 more minutes. Let the meatloaf stand for 10 minutes before slicing."
    ],
    "ingredients": [
        "2 slices pumpernickel bread",
        "1 pound ground chuck",
        "1 pound ground pork",
        "1 egg",
        "1/2 cup finely chopped sweet onion",
        "1/3 cup petite-cut diced tomatoes with sweet onions, drained and juice reserved",
        "1/4 cup finely chopped green pepper",
        "1 tablespoon onion powder",
        "1/2 teaspoon garlic salt",
        "1/2 teaspoon ground black pepper",
        "2 dashes Worcestershire sauce",
        "2 dashes soy sauce",
        "6 slices deli-sliced Swiss cheese",
        "1 (4.5 ounce) can sliced mushrooms, drained",
        "1/2 cup bottled sweet chili sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mushroom and Swiss Burger Meatloaf",
    "url": "http://allrecipes.com/recipe/213136/mushroom-and-swiss-burger-meatloaf/"
}
