{
    "directions": [
        "Heat 2 tablespoons olive oil in a large skillet over medium heat. Add the bacon and cook until crisp, about 8 minutes. Add the mushrooms, 1/2 teaspoon salt, and pepper to taste; cook until the mushrooms are soft, about 4 minutes. Add the garlic and cook 1 minute. Remove from the heat and stir in the breadcrumbs and all but 2 tablespoons parsley. Let cool.",
        "Soak 10 to 12 toothpicks in water to prevent them from burning. Rinse the pork and pat dry. Butterfly the pork: Make a 1-inch-deep incision down the length of each tenderloin; do not cut all the way through. Open the meat like a book so the tenderloins lie flat.",
        "Cover the pork with plastic wrap; pound with the flat side of a meat mallet until about 1/2 inch thick, starting from the middle and working outward. Spread the mushroom mixture over the 2 tenderloins. Starting with a long side, tightly roll up each tenderloin. Secure the seams with the toothpicks.",
        "Preheat a grill to medium high; brush the grates with olive oil. Brush the pork rolls with olive oil and season with salt and pepper. Grill, turning, until a thermometer inserted into the center of the pork registers 140 degrees F, 25 to 30 minutes. Transfer to a cutting board to rest, about 10 minutes.",
        "Mix the remaining 3 tablespoons olive oil and 2 tablespoons parsley, the lemon zest, and salt and pepper to taste in a bowl. Remove the toothpicks and slice the pork rolls. Top with parsley oil.",
        "Photograph by Con Poulos"
    ],
    "ingredients": [
        "5 tablespoons extra-virgin olive oil, plus more for brushing",
        "4 slices bacon, chopped",
        "8 ounces cremini mushrooms, thinly sliced",
        "Kosher salt and freshly ground pepper",
        "1 clove garlic, finely chopped",
        "1 tablespoon breadcrumbs",
        "1/2 cup chopped fresh parsley",
        "2 pork tenderloins (2 to 2 1/2 pounds total), trimmed",
        "1/2 teaspoon grated lemon zest"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy Grilling Recipes",
        "Grilling",
        "Healthy",
        "Meat",
        "Pork",
        "Pork Tenderloin",
        "Mushroom",
        "Vegetable",
        "Diabetes-Friendly",
        "Low Sodium",
        "Low Calorie"
    ],
    "title": "Mushroom-Stuffed Pork Tenderloin",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/mushroom-stuffed-pork-tenderloin-recipe"
}
