{
    "directions": [
        "Place porcini in 1 cup hot water. Let soak until soft, about 20 minutes. Strain, reserving soaking liquid. Coarsely chop porcini.",
        "Melt 2 tablespoons butter in large pot over medium-high heat. Add onion and carrot and sauté until soft, about 5 minutes. Add 1 pound crimini mushrooms;sprinkle with salt. Sauté until mushrooms are soft and browned, about 5 minutes. Add porcini and sauté 3 minutes. Add 3 cups broth and reserved porcini soaking liquid and bring to boil. Reduce heat to medium-low; cover and simmer until mushrooms are soft and flavors blend, about 20 minutes. Cool slightly. Working in batches, puree in blender until smooth, adding more broth by 1/2 cupfuls as needed. Return soup to pot.",
        "Mix parsley, oil, hazelnuts, orange peel, and garlic in small bowl. Set gremolata aside.",
        "Melt remaining 2 tablespoons butter in heavy large saucepan over medium-high heat. Add 12 ounces assorted mushrooms and sauté until soft and browned, about 10 minutes. Season to taste with salt and pepper. Divide soup among bowls. Top with sautéed mushrooms and gremolata.",
        "Available in the produce section of many supermarkets and at specialty foods stores and Italian markets."
    ],
    "ingredients": [
        "1 1/2-ounce package dried porcini mushrooms*",
        "1 cup hot water",
        "4 tablespoons butter, divided",
        "1 1/4 cups chopped onion",
        "1 cup sliced peeled carrot (about 1 large)",
        "1 pound crimini (baby bella) mushrooms, sliced (about 6 cups)",
        "3 cups (or more) vegetable broth",
        "1/2 cup coarsely chopped fresh parsley",
        "1/3 cup plus 1 tablespoon olive oil",
        "1/4 cup hazelnuts, toasted , husked, finely chopped",
        "2 teaspoons finely grated orange peel",
        "1 garlic clove, chopped",
        "12 ounces assorted fresh wild mushrooms (such as chanterelle, crimini, and stemmed shiitake), sliced (about 5 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Mushroom",
        "Vegetable",
        "Sauté",
        "Vegetarian",
        "High Fiber",
        "Lunch",
        "Carrot",
        "Fall",
        "Hazelnut",
        "Potluck",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Mushroom Soup with Hazelnut Gremolata",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-soup-with-hazelnut-gremolata-350094"
}
