{
    "directions": [
        "Bring water to a boil in a 1- to 1 1/2-quart heavy saucepan, then stir in kasha. Cover and reduce heat to low, then cook until kasha is tender and water is absorbed, about 10 minutes. Transfer to a bowl and cool.",
        "Break one third of mushrooms into a food processor and pulse until finely chopped, then transfer to a bowl. Repeat with remaining 2 batches of mushrooms, transferring to bowl.",
        "Cook onion and bell pepper in butter in a 12-inch heavy skillet over medium heat, stirring occasionally, until softened, about 5 minutes. Add chopped mushrooms, garlic, 3/4 teaspoon salt, and 1/2 teaspoon pepper and cook over medium-high heat, stirring occasionally, until any liquid mushrooms give off is evaporated and mushrooms begin to brown, 8 to 10 minutes. Transfer mixture to a large bowl, then stir in kasha, parsley, soy sauce, and 1/2 cup bread crumbs until combined well. Cool 10 minutes, then stir in egg until combined well.",
        "Line a platter with foil. Spread remaining cup bread crumbs in a shallow baking dish.",
        "Form one fourth of mushroom mixture (about 3/4 cup) into a 3/4-inch-thick patty (3 1/2 inches in diameter), then dredge in bread crumbs, knocking off excess, and transfer to platter. Form and dredge 3 more patties, transferring to platter. Chill patties, loosely covered with plastic wrap, 1 hour.",
        "Heat oil in cleaned 12-inch heavy skillet over medium-high heat until it shimmers, then fry patties, turning over once, until deep golden, about 4 minutes total. Transfer patties to paper towels to drain (patties will be soft).",
        "Meanwhile, whisk together mayonnaise and chipotle sauce.",
        "Spread bread with chipotle mayonnaise and sandwich each mushroom patty between 2 slices."
    ],
    "ingredients": [
        "2/3 cup water",
        "1/3 cup coarse kasha (whole roasted buckwheat groats)",
        "1 pound portabella mushrooms, stems discarded",
        "1 cup finely chopped onion",
        "1 cup finely chopped red bell pepper",
        "3 tablespoons unsalted butter",
        "2 garlic cloves, finely chopped",
        "3 tablespoons finely chopped flat-leaf parsley",
        "1 teaspoon soy sauce",
        "1 1/2 cups fine dry bread crumbs, divided",
        "1 large egg, lightly beaten",
        "1/4 cup olive oil",
        "1/2 cup mayonnaise",
        "1 tablespoon Tabasco chipotle sauce, or to taste",
        "8 large oval slices rye bread, cut into 4 1/2-inch rounds if desired, lightly toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Mushroom",
        "Onion",
        "Pepper",
        "Fry",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Mayonnaise",
        "Summer",
        "Healthy",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Mushroom Kasha Burgers with Chipotle Mayonnaise",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-kasha-burgers-with-chipotle-mayonnaise-239295"
}
