{
    "directions": [
        "In large heavy sauté pan over moderate heat, heat 3 tablespoons oil until hot but not smoking. Add 1/2 of garlic and sauté until softened, about 2 minutes. Add mushrooms, 1/2 teaspoon salt, and 1/4 teaspoon pepper and sauté until mushrooms begin to give off liquid, about 5 minutes. Transfer to colander and let drain until ready to use.",
        "In medium saucepan over low heat, bring stock to simmer. Cover and keep simmering.",
        "In large heavy pot over moderate heat, heat 1/4 cup oil until hot but not smoking. Add onion and remaining garlic and sauté until softened, about 4 minutes. Add rice and sauté 4 minutes.",
        "Add wine and cook, stirring constantly, until absorbed, about 2 minutes. Stir 1/2 cup simmering stock into rice and cook, stirring constantly, until absorbed. Continue cooking and adding stock, about 1/2 cup at a time, stirring constantly and letting each addition be absorbed before adding next, until rice is tender and creamy-looking but still al dente, about 18 minutes. (You will have about 1 cup stock left over.)",
        "Remove from heat and stir in drained mushrooms, thyme, 1/4 teaspoon salt, and 1/4 teaspoon pepper. Cool to room temperature, then refrigerate, covered, until cold, about 4 hours. (Risotto can be made ahead and refrigerated, covered, up to 24 hours.)",
        "Preheat oven to 250°F.",
        "Transfer 1 cup flour, eggs, and bread crumbs to 3 separate shallow bowls. Stir 1/4 teaspoon salt and 1/4 teaspoon pepper into flour. Stir remaining 1/4 teaspoon salt and 1/4 teaspoon pepper into bread crumbs.",
        "Stir remaining 2 tablespoons flour into risotto, then, using wet hands, shape into 12 (1/2-inch-thick) patties.",
        "In heavy large sauté pan over moderate heat, heat 1/4 cup oil until hot but not smoking. Working in batches of 4 and adding 2 tablespoons oil after each batch, dredge cakes in flour (tapping off excess), then egg (letting excess drip off), then bread crumbs, and fry until golden brown, about 2 minutes per side. Keep warm in oven while frying remaining batches.",
        "Serve warm with salad."
    ],
    "ingredients": [
        "3/4 cup plus 3 tablespoons vegetable oil",
        "3 large cloves garlic, minced",
        "12 ounces white mushrooms, thinly sliced",
        "1 1/4 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "6 cups chicken stock or low-sodium chicken broth",
        "1 medium Spanish onion, finely diced",
        "1 1/4 cups arborio rice (12 ounces)",
        "1/2 cup dry white wine",
        "1/4 cup fresh thyme leaves",
        "1 cup plus 2 tablespoons all-purpose flour",
        "3 eggs, lightly beaten",
        "1 1/2 cups plain bread crumbs",
        "Accompaniment: Roasted Tomato and Arugula Salad"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Rice",
        "Tomato",
        "Appetizer",
        "Fry",
        "Roast",
        "Hanukkah",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Vegan",
        "Thyme",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mushroom and Thyme Risotto Cakes with Roasted Tomato and Arugula Salad",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-and-thyme-risotto-cakes-with-roasted-tomato-and-arugula-salad-350837"
}
