{
    "directions": [
        "Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Add mushrooms and onion and sauté until mushrooms are tender and juices evaporate, about 9 minutes. Mix in sage. Season to taste with salt and pepper. Cool.",
        "Combine flour, milk powder, baking powder and 1 teaspoon salt in processor. Add 3/4 cup water and 2 1/2 tablespoons butter; blend until soft sticky dough forms, about 2 minutes. Transfer dough to large bowl. Add mushroom mixture. Using hands, mix dough until well combined. Let dough stand uncovered 20 minutes.",
        "Turn dough out onto generously floured work surface. Divide dough into 8 pieces. Roll out each piece on work surface to 6-inch round.",
        "Preheat oven to 250°F. Heat 1 tablespoon oil in heavy large skillet over medium-high heat. Add 1 flatbread and cod cook until brown and cooked through, about 2 minutes per side. Transfer to baking sheet; keep warm in oven. Repeat with remaining flatbreads, adding more oil to skillet as necessary. Cut breads into quarters. Serve with Tricolor Roasted Peppers."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter",
        "8 ounces assorted mushrooms (such as crimini and stemmed shiitake), sliced",
        "3/4 cup chopped red onion",
        "1 tablespoon chopped fresh sage",
        "2 1/2 cups all purpose flour",
        "3/4 cup nonfat dry milk powder",
        "2 1/2 teaspoons baking powder",
        "1 teaspoon salt",
        "3/4 cup cold water",
        "2 1/2 tablespoons butter, room temperature",
        "3 tablespoons (about) olive oil",
        "Tricolor Roasted Peppersl"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Mushroom",
        "Onion",
        "Pepper",
        "Low Carb",
        "Low Fat",
        "Summer"
    ],
    "title": "Mushroom Flatbreads with Tricolor Roasted Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-flatbreads-with-tricolor-roasted-peppers-4205"
}
