{
    "directions": [
        "Bring 1 cup water to a boil. Add dried mushrooms, cover and let stand about 20 minutes. Squeeze dry; strain liquid (a coffee filter is handy for this) and reserve.",
        "In a food processor, mince garlic and rehydrated mushrooms. Add fresh mushrooms and thyme; continue to process until all is minced.",
        "Heat oil in a 12-inch skillet over medium-high heat. Add mushroom mixture; saute until nearly all moisture has evaporated, 5 to 7 minutes. Turn off heat, stir in cheese, and season with salt and pepper. Set aside.",
        "Mix honey and vinegar in a small bowl.",
        "Adjust oven rack to lowest position and heat oven to 425 degrees.",
        "Set breasts, skin side down, on a large, heavy, lipped cookie sheet. Brush with half of the honey-vinegar; generously salt and pepper. Turn breasts over. Push fingers under skin to make a pocket; stuff with mushroom mixture. Again brush with honey-vinegar and season with salt and pepper. Being careful not to crowd, arrange breasts on cookie sheet so thickest ends point outward. (Can now be covered and refrigerated overnight; return to room temperature before roasting.)",
        "Roast until golden brown, adding water if necessary to keep pan drippings from burning, until a meat thermometer registers 160 degrees in the thickest portion of the largest piece, 30 to 45 minutes. Transfer chicken to a platter.",
        "Scrape pan juices into a medium saucepan. Add reserved mushroom-soaking liquid and enough water to equal 1 1/2 cups of liquid. Bring to a simmer. Add cornstarch mixture; continue to simmer until it thickens a bit.",
        "Arrange a breast on each of 8 plates; drizzle with sauce, and serve."
    ],
    "ingredients": [
        "1 ounce dried mushrooms (the variety of your choice)",
        "4 large garlic cloves",
        "1 pound portobello or white mushrooms, cleaned, stems trimmed, then coarsely chopped",
        "1 teaspoon dried thyme leaves",
        "2 tablespoons olive oil",
        "6 ounces mild goat cheese",
        "1 pinch Salt and pepper, to taste",
        "1/4 cup honey",
        "1/4 cup balsamic vinegar",
        "8 split skin-on chicken breasts (10 to 12 ounces each), rib bones and excess fat trimmed away with poultry scissors, rinsed and patted dry",
        "1 teaspoon cornstarch dissolved in",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mushroom-Stuffed Chicken Breasts in a Balsamic Pan Sauce",
    "url": "http://allrecipes.com/recipe/83752/mushroom-stuffed-chicken-breasts-in-a/"
}
