{
    "directions": [
        "Pour boiling-hot water over porcini in a bowl and let stand until softened, about 20 minutes. Lift out porcini, squeezing excess liquid back into bowl, and rinse to remove any grit. Finely chop porcini. Pour soaking liquid through a sieve lined with a dampened paper towel into another bowl and reserve.",
        "Trim leek, reserving about 5 inches of green leaves, and rinse greens well. Halve rest of leek lengthwise, then rinse well under cold water and pat dry. Coarsely chop greens and finely chop white and pale green parts, reserving greens separately.",
        "Finely grate enough cheese to measure 1/4 cup, then cut off and reserve rind. Reserve remaining piece of cheese.",
        "Pulse cremini caps, shiitake caps, 1/3 cup chopped porcini, white and pale green parts of leek, garlic, and 1/2 teaspoon salt in a food processor until finely minced.",
        "Heat butter in a 12-inch nonstick skillet over moderate heat until foam subsides, then cook mushroom mixture, stirring constantly, until liquid mushrooms give off is evaporated and mushrooms are golden, about 10 minutes. Transfer to a bowl and cool completely. Stir in 1/4 cup grated cheese, 1 tablespoon parsley, and salt and pepper to taste.",
        "Tuck parsley and thyme sprigs into celery and tie together tightly with string to make a bouquet garni. Bring cold water, beef broth, bouquet garni, cracked peppercorns, cremini stems, shiitake stems, leek greens, remaining chopped porcini, porcini soaking liquid, cheese rind, and remaining 1/4 teaspoon salt to a simmer in a 3-quart heavy saucepan, stirring occasionally. Reduce heat and cook at a bare simmer, partially covered, 45 minutes.",
        "Pour broth through a large sieve lined with a double thickness of rinsed and squeezed cheesecloth (or dampened paper towels) into a large bowl, pressing on and discarding solids. Return broth to saucepan.",
        "Set smooth rollers of pasta maker at widest setting. Cut pasta dough into 4 pieces and keep 3 pieces covered. Flatten unwrapped piece of dough into a rectangle and feed through rollers. Fold rectangle in half and feed through rollers 8 more times, folding in half each time and dusting with flour as necessary to prevent sticking.",
        "Turn dial to next (narrower) setting and feed dough through without folding. Continue to feed dough through without folding, making space between rollers narrower each time, until narrowest setting is used. (Cut sheet of dough in half if it gets too long.)",
        "Cut out as many rounds as possible from sheet with cookie cutter (reserve trimmings for another use, such as chicken noodle soup). Transfer rounds in 1 layer to a lightly floured wax-paper-lined baking sheet and cover with plastic wrap.",
        "Working with 5 pasta rounds at a time, put 1/4 teaspoon filling in center of each round, keeping remaining rounds covered tightly with plastic wrap. Moisten edges of filling-topped rounds with a fingertip dipped in water and fold in half, letting bottom edge protrude slightly beyond top edge, then press top edge to bottom half to seal. Holding straight edge of half-moon against nail of your little finger, wrap half-moon around fingertip (which will cause curved edge to flip up), overlapping corners and pinching to seal. Transfer tortellini to a dry kitchen towel (not terry cloth).",
        "Roll out and cut remaining dough and make more tortellini in same manner, working with 1 piece at a time.",
        "Bring broth to a boil and season with salt and pepper. Add tortellini and cook at a strong simmer, stirring gently once or twice, until tender, 3 to 5 minutes.",
        "Ladle broth with 8 to 10 tortellini per person into bowls and serve remaining piece of Parmigiano-Reggiano on the side for grating."
    ],
    "ingredients": [
        "2 cups boiling-hot water",
        "1 1/2 oz dried porcini mushrooms (1 1/2 cups)",
        "1 large leek",
        "1 piece Parmigiano-Reggiano with rind (at least 6 oz)",
        "1/2 lb fresh cremini mushrooms, caps and stems chopped separately",
        "1/4 lb fresh shiitake mushrooms, caps and stems chopped separately",
        "2 teaspoons minced garlic",
        "3/4 teaspoon salt",
        "2 tablespoons unsalted butter",
        "1 tablespoon finely chopped fresh flat-leaf parsley plus 2 fresh flat-leaf parsley sprigs",
        "2 fresh thyme sprigs",
        "1 (3- to 4-inch) piece celery rib",
        "4 cups cold water",
        "4 cups beef broth",
        "8 black peppercorns, cracked",
        "Fresh pasta dough at room temperature",
        "All-purpose flour for dusting",
        "Garnish: small fresh flat-leaf parsley leaves",
        "Special equipment: kitchen string; cheesecloth; a pasta maker; a 2-inch round cookie cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Mushroom",
        "Pasta",
        "Appetizer",
        "Parmesan",
        "Celery",
        "Leek",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Mushroom Tortellini in Mushroom Broth",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-tortellini-in-mushroom-broth-107733"
}
