{
    "directions": [
        "Cook squash in a small saucepan of boiling salted water until just tender, about 2 minutes, then drain in a sieve.",
        "Cook onion and garlic in oil in a large heavy skillet over moderately low heat, stirring, until onion is softened, about 3 minutes. Add jalapeños and cook, stirring, 1 minute. Stir in mushrooms, salt, and broth and simmer, covered, until mushrooms are tender, 5 to 8 minutes. Simmer, uncovered, stirring occasionally, until liquid is evaporated, about 3 minutes, then stir in squash and salt to taste. Cool filling completely.",
        "Heat a dry griddle or heavy skillet (preferably cast-iron) over moderately low heat until hot, then toast pasilla de Oaxaca chile, pressing down with tongs, 15 to 20 seconds on each side. Halve chile lengthwise and discard stem, ribs, and seeds.",
        "Heat griddle over moderately high heat until hot, then toast garlic until lightly blackened, 2 to 3 minutes on each side. Cool garlic slightly and peel.",
        "Simmer tomatillos, onion, water, chile, garlic, and salt in a large saucepan, covered, until tomatillos are very tender, about 20 minutes, and cool slightly. Remove 1 chile half and reserve, then purée sauce in a blender until smooth (use caution when blending hot liquids), adding as much of reserved chile half as necessary to achieve desired spiciness. Return sauce to pan and season with salt.",
        "Preheat oven to 400°F.",
        "Divide dough into 8 equal pieces (2 ounces each) and form each into a disk. Roll out 1 piece on a lightly floured surface into a 6- to 7-inch round (1/8 inch thick). Spoon about 1/3 cup filling onto center and brush edge of pastry lightly with egg wash. Fold dough in half to form a half-moon, enclosing filling, and press edges together to seal. Crimp edge decoratively and transfer empanada with a spatula to a large baking sheet. Make 7 more empanadas in same manner.",
        "Lightly brush empanadas all over with some of remaining egg wash and sprinkle each with 1/4 teaspoon sea salt. Bake in middle of oven until golden, 25 to 30 minutes.",
        "While empanadas are baking, reheat sauce. Cut each empanada in half with a serrated knife and serve with about 3 tablespoons sauce spooned around it.",
        "Available at Latino markets and Kitchen/Market (888-468-4433)."
    ],
    "ingredients": [
        "1 cup diced (1/4-inch) butternut squash",
        "1/2 cup finely chopped white onion",
        "6 small garlic cloves, minced",
        "1/4 cup olive oil",
        "2 (2- to 3-inch) fresh jalapeño chiles, seeds and ribs discarded and chiles finely chopped",
        "1 pound fresh exotic mushrooms such as chanterelles, porcini, or hedgehogs (all one kind, not a mixture), trimmed and coarsely chopped",
        "1/2 teaspoon salt",
        "1/3 cup chicken broth",
        "1 dried pasilla de Oaxaca chile*",
        "3 garlic cloves, left unpeeled",
        "1 pound fresh tomatillos, husks discarded and tomatillos rinsed and quartered",
        "1/4 cup finely chopped white onion",
        "1/4 cup water",
        "1/2 teaspoon salt",
        "1/3 Café Azul's pastry dough (1 pound)",
        "1 large egg, lightly beaten with 1 tablespoon water",
        "2 teaspoons coarse sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Mushroom",
        "Vegetable",
        "Bake",
        "Lunch",
        "Hot Pepper",
        "Butternut Squash",
        "Fall",
        "Tomatillo",
        "Jalapeño",
        "Pastry",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mushroom and Butternut Squash Empañadas",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-and-butternut-squash-empanadas-107182"
}
