{
    "directions": [
        "Preheat oven to 425°F. Heat 1 tablespoon butter and 1 tablespoon oil in a large skillet over medium-high. Add half of mushrooms, season with salt and pepper, and cook, stirring occasionally, until browned and starting to crisp, 8–10 minutes. Transfer to a medium bowl. Repeat with 1 tablespoon butter, 1 tablespoon oil, and remaining mushrooms. Return all mushrooms to skillet (reserve bowl) and add shallot, wine, and remaining 1 tablespoon butter. Cook, stirring occasionally, until skillet is dry, about 5 minutes. Return mushrooms to bowl.",
        "Combine ricotta and cream in a small bowl; season with salt and pepper.",
        "Working in batches, cook pasta in a large pot of boiling salted water, stirring occasionally, until just softened, about 30 seconds. (If using dried noodles, cook until al dente.) Transfer noodles to a large rimmed baking sheet as you go, brushing with oil and overlapping as needed.",
        "Spread a thin layer of ricotta mixture in a small baking dish and top with a pasta sheet (if using dried, use 2 noodles side by side). Spread a large spoonful of ricotta mixture over pasta, scatter some mushrooms over, then a few pieces of burrata. Top evenly with some Parmesan and 1 teaspoon marjoram leaves. Repeat layering process (starting with noodles and ending with marjoram) 5 more times; finish with the last of the Parmesan and a grind or two of pepper.",
        "Cover lasagnette with foil and bake until warmed through, 10–15 minutes. Remove foil and continue baking until golden brown, 15–20 minutes. Let cool at least 5 minutes.",
        "Meanwhile, toss kale in a large bowl with vinegar and remaining 1 tablespoon oil to coat and massage leaves just to soften slightly; season with salt and pepper. Serve lasagnette with kale alongside.",
        "Lasagnette can be assembled 1 day ahead. Cover and chill."
    ],
    "ingredients": [
        "3 tablespoons unsalted butter, divided",
        "3 tablespoons olive oil, divided, plus more for brushing",
        "1 1/2 pounds mixed mushrooms (such as chanterelle, crimini, and maitake), cut into bite-size pieces",
        "Kosher salt, freshly ground pepper",
        "1 large shallot, finely chopped",
        "1/3 cup dry white wine",
        "1 cup ricotta",
        "1/4 cup heavy cream",
        "6 fresh pasta sheets (about 7x5\") or 12 dried lasagna noodles",
        "8 ounces burrata or fresh mozzarella, torn into large pieces",
        "1 1/2 ounces Parmesan, finely grated",
        "6 teaspoons marjoram leaves",
        "1/2 bunch Tuscan kale, ribs and stems removed, leaves torn",
        "1 tablespoon white wine vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Pasta",
        "Bake",
        "Kid-Friendly",
        "Parmesan",
        "Ricotta",
        "Kale",
        "Anniversary",
        "Dinner"
    ],
    "title": "Mushroom and Burrata Lasagnette",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-and-burrata-lasagnette-56390115"
}
