{
    "directions": [
        "Quarter 1 1/2 pounds white mushrooms (about 9 cups quartered), then pulse in a food processor in 2 batches until finely chopped. Melt 1/2 stick butter in a 5- to 6-quart heavy pot over moderately high heat until foam subsides, then sauté chopped mushrooms, stirring occasionally, until liquid from mushrooms is evaporated, 10 to 15 minutes. Add Madeira and boil, stirring occasionally, until all of liquid is evaporated, 5 to 8 minutes. Add water and dried porcini and bring to a boil, then reduce heat and simmer, uncovered, stirring occasionally, 45 minutes. Pour through a sieve lined with a coffee filter or dampened paper towel into a large bowl, pressing hard on solids and then discarding them. Skim off any fat.",
        "If stock measures less than 8 cups, add water. If more, boil, uncovered, in cleaned pot until reduced to 8 cups.",
        "Cut remaining 2 lb mushrooms into 1/4-inch-thick slices (about 11 cups sliced). Peel potato and cut crosswise into 1/4-inch-thick slices, then transfer to a bowl and cover with water. Heat remaining 6 tablespoons butter in a 5- to 6-quart heavy pot over moderately high heat until foam subsides, then cook mushrooms with 1 teaspoon salt, stirring occasionally, until mushrooms are very tender but not browned, about 15 minutes (mushrooms will exude liquid). Drain potato and add to mushrooms along with mushroom stock. Bring to a boil, then reduce heat and simmer, uncovered, until potato is very tender, about 10 minutes. Add cream and bring just to a boil, then remove from heat.",
        "Transfer soup to a large metal bowl, then purée in batches in a blender until very smooth, about 1 minute per batch (use caution when blending hot liquids). Return soup as puréed to cleaned pot and bring to a boil. Stir in white pepper and remaining 1 1/2 teaspoons salt. Season with additional salt if desired."
    ],
    "ingredients": [
        "3 1/2 lb fresh white mushrooms",
        "1 1/4 sticks (1/2 cup plus 2 tablespoons) unsalted butter",
        "3/4 cup Sercial Madeira",
        "9 cups water",
        "1/2 oz (14 g) dried porcini (3/4 cup)",
        "1 (1/2-lb) russet (baking) potato",
        "2 1/2 teaspoons salt",
        "1/3 cup heavy cream",
        "1 teaspoon white pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Mushroom",
        "Potato",
        "Appetizer",
        "Vegetarian",
        "Fortified Wine",
        "Winter",
        "Simmer",
        "Gourmet",
        "Massachusetts",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mushroom Soup",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-soup-233785"
}
