{
    "directions": [
        "Heat 2 tablespoons oil in heavy large skillet over medium heat. Add shallots and garlic; sauté 4 minutes. Increase heat to high. Add mushrooms; sauté until tender and golden, about 15 minutes. Add Sherry wine vinegar, then Sherry; boil until almost all liquid evaporates, about 6 minutes. Season with salt and pepper. Cool. Mix in 2 tablespoons parsley.",
        "Place 1 phyllo sheet on work surface. Brush with 2 teaspoons oil. Top with second phyllo sheet; brush with 2 teaspoons oil. Top with third phyllo sheet. Sprinkle cheese along 1 long side of phyllo, 1 inch in from edge. Spoon mushroom mixture over cheese. Fold short ends over. Starting at long filled side, roll phyllo up tightly. Place seam side down on baking sheet. Brush with remaining 2 teaspoons oil. Using long sharp knife, score top of strudel through phyllo, making 8 evenly spaced cuts. (Can be prepared 4 hours ahead. Cover; chill.)",
        "Preheat oven to 375°F. Bake strudel until golden brown, about 50 minutes.",
        "Meanwhile, boil balsamic vinegar and molasses in heavy small saucepan over medium heat until reduced to 2 1/2 tablespoons, about 10 minutes. Cool.",
        "Using serrated knife, cut hot strudel at score marks into 8 rounds. Drizzle balsamic syrup onto each of 4 plates. Place 2 slices of strudel over syrup on each plate."
    ],
    "ingredients": [
        "2 tablespoons plus 6 teaspoons olive oil",
        "1/2 cup thinly sliced shallots",
        "4 garlic cloves, minced",
        "1 pound mushrooms, chopped",
        "1/4 cup Sherry wine vinegar",
        "1/3 cup dry Sherry",
        "2 tablespoons finely chopped fresh parsley",
        "3 fresh phyllo pastry sheets or frozen, thawed",
        "1/2 cup crumbled soft fresh goat cheese (such as Montrachet)",
        "1/2 cup balsamic vinegar",
        "1 tablespoon mild-flavored (light) molasses"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Appetizer",
        "Bake",
        "Sauté",
        "Vegetarian",
        "Vinegar",
        "Goat Cheese",
        "Sherry",
        "Fall",
        "Phyllo/Puff Pastry Dough"
    ],
    "title": "Mushroom and Goat Cheese Strudel with Balsamic Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-and-goat-cheese-strudel-with-balsamic-syrup-102424"
}
