{
    "directions": [
        "Blend milk, eggs, 2 tablespoons melted butter, and salt in blender 5 seconds. Add flour, 1/2 cup at a time, blending batter until smooth after each addition. Let rest 1 to 2 hours. Reblend batter 5 seconds before using.",
        "Heat nonstick skillet with 7- to 8-inch-diameter bottom over medium-high heat; brush with melted butter. Pour 3 tablespoons batter into skillet; swirl skillet to coat bottom evenly. Cook until bottom of crepe is golden, about 30 seconds. Loosen edges gently with spatula and turn crepe over. Cook until bottom is brown in spots, about 30 seconds. Turn crepe out onto paper towel. Repeat, making about 16 crepes and stacking between paper towels. (Can be made 2 days ahead. Wrap and chill.)",
        "Heat oil in large skillet over medium-high heat. Add onions and sauté until translucent, about 3 minutes. Add mushrooms, epazote, and garlic. Sauté until mushrooms are brown and mushroom liquid has evaporated, about 10 minutes. Season with salt and pepper.",
        "Char chiles directly over gas flame or in broiler until blackened on all sides. Enclose in paper bag 10 minutes. Peel, seed, and thinly slice chiles.",
        "Melt butter in medium saucepan over medium heat. Add onion; sauté until soft, about 2 minutes. Add garlic; stir 30 seconds. Stir in flour (mixture may be firm). Sauté 1 minute longer. Whisk in warm milk and bring to boil, whisking constantly. Reduce heat to medium-low; simmer until sauce thickens, whisking occasionally, about 5 minutes. Pour sauce into blender. Add cream and half of roasted chiles (reserve remaining chiles for garnish). Blend sauce until smooth. Season with salt and pepper. (Can be made 1 day ahead. Cover and chill. Whisk over medium heat until just warm before continuing.)",
        "Brush small baking sheet with oil. Arrange 1 crepe, brown spots up, on work surface. Place 2 packed tablespoons filling in center. Fold crepe in half. Fold in half again, forming triangle. Place filled crepe on prepared sheet. Repeat with 11 more crepes and all of filling. (Can be made 1 day ahead. Cover with foil and chill.)",
        "Preheat oven to 350°F. Pour 1/4 cup sauce into center of each of 6 ovenproof plates. Top each with 2 filled crepes. Pour 1/4 cup sauce over. Sprinkle with cheese. Bake until cheese melts, about 12 minutes.",
        "Meanwhile, heat 3 tablespoons oil in heavy medium skillet over medium-high heat. Add reserved poblano chiles and corn; sauté until heated through, about 2 minutes. Sprinkle with salt.",
        "Garnish crepes with sautéed chiles and corn, then cilantro sprigs, and serve.",
        "*Light yellow, semi-soft mild cheese that is different from the aged Spanish cheese of the same name. Substitute mild cheddar, Monterey Jack, or Muenster."
    ],
    "ingredients": [
        "2 cups whole milk",
        "3 large eggs",
        "2 tablespoons (1/4 stick) unsalted butter, melted, cooled",
        "1 teaspoon fine sea salt",
        "2 cups sifted all purpose flour",
        "Additional melted butter",
        "1/3 cup corn oil",
        "2 cups chopped white onions",
        "1 pound fresh shiitake mushrooms, stemmed, caps thinly sliced",
        "2 tablespoons minced freshepazote or fresh cilantro",
        "4 teaspoons finely chopped garlic",
        "6 large fresh poblano chiles",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1/4 cup chopped white onion",
        "1 small garlic clove, minced",
        "3 tablespoons all purpose flour",
        "2 cups warm whole milk",
        "1/2 cup whipping cream",
        "1 cup coarsely grated queso manchego* or Muenster cheese (about 4 ounces)",
        "3 tablespoons corn oil",
        "1/2 cup fresh corn kernels",
        "Fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Cheese",
        "Mushroom",
        "Bake",
        "Sauté",
        "Vegetarian",
        "Cinco de Mayo",
        "Buffet",
        "Hot Pepper"
    ],
    "title": "Mushroom Crepes with Poblano Chile Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-crepes-with-poblano-chile-sauce-108023"
}
