{
    "directions": [
        "Preheat oven to 400°F. Combine both broths, Port and garlic in heavy small saucepan. Boil until sauce is reduced to 3/4 cup, about 20 minutes. Set aside.",
        "Meanwhile, melt 2 tablespoons butter in large skillet over medium-high heat. Add shallots and sauté until translucent, about 1 minute. Add mushrooms and leek and sauté until tender, about 6 minutes. Stir in cream. Cook mixture until vegetables are soft and most of cream is absorbed, about 5 minutes. Cool.",
        "Insert handle of wooden spoon lengthwise into cut end of each tenderloin, forming 1/2- to 3/4-inch-diameter hole. Transfer mushroom mixture to pastry bag fitted with large plain tip. Force mixture into center of each tenderloin, filling hole completely. Rub tenderloins with marjoram. Sprinkle with salt and pepper.",
        "Heat oil in large ovenproof skillet over high heat. Add tenderloins to skillet and cook until brown on all sides, about 6 minutes total. Transfer skillet to oven. Roast tenderloins until cooked through, about 8 minutes. Remove skillet from oven. Transfer tenderloins to platter; tent with foil to keep warm. Return skillet to stove. Whisk in sauce. Bring to boil, scraping up any browned bits. Remove from heat. Whisk in 4 tablespoons butter.",
        "Cut tenderloins crosswise into slices. Spoon Celery Root Mashed Potatoes onto plates. Arrange tenderloin slices around mashed potatoes. Drizzle sauce over and serve."
    ],
    "ingredients": [
        "1 cup canned low-salt chicken broth",
        "1 cup canned beef broth",
        "1/2 cup ruby Port",
        "2 teaspoons minced garlic",
        "6 tablespoons (3/4 stick) butter",
        "1/4 cup chopped shallots",
        "8 ounces shiitake mushrooms, stemmed, finely chopped",
        "1 1/2 cups chopped leek (white and pale green parts only)",
        "1/2 cup whipping cream",
        "2 1 1/4-pound pork tenderloins (from center or thick end), trimmed, each cut crosswise in half",
        "2 1/2 tablespoons chopped fresh marjoram or 2 1/2 teaspoons dried",
        "1 tablespoon olive oil",
        "Celery Root Mashed Potatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Onion",
        "Pork",
        "Roast",
        "Sauté",
        "Leek",
        "Root Vegetable",
        "Port",
        "Winter",
        "Canada"
    ],
    "title": "Mushroom-Stuffed Pork Tenderloin with Celery Root Mashed Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-stuffed-pork-tenderloin-with-celery-root-mashed-potatoes-5224"
}
