{
    "directions": [
        "Put the dried mushrooms in a bowl and cover them with 2 cups of boiling water. Allow them to soak for 1 hour. Strain the mushrooms through a cheesecloth-lined sieve into a bowl. Reserve the liquid. Coarsely chop the mushrooms and set aside.",
        "Melt the butter in a large, heavy stockpot or Dutch oven over mediumhigh heat. Add the onions and sauté until softened and translucent, about 8 minutes. Add the garlic and sauté until fragrant, about 2 minutes more. Add the fresh mushrooms, celery, carrot, and half of the parsley, and sauté until the mushrooms are golden and the celery and carrots are beginning to soften, about 10 minutes. Stir in the fl our until well blended. Stir in the mushroom soaking liquid, soaked mushrooms, beef broth, and 4 cups of water. Stir in the barley, salt, and pepper to taste.",
        "Bring the mixture to a boil, stirring frequently. Reduce the heat to low and simmer until the barley is tender, about 30 to 40 minutes. If the soup is too thick, add a little more water. Adjust the seasoning with more salt and pepper if necessary. Sprinkle with the remaining parsley before serving."
    ],
    "ingredients": [
        "1/2 ounce dried Polish mushrooms or dried porcini mushrooms*",
        "6 tablespoons unsalted butter",
        "1 medium onion, diced",
        "3 cloves garlic, minced",
        "3/4 pound fresh mushrooms, trimmed and thinly sliced",
        "2 stalks celery with leaves, diced",
        "1 large carrot, peeled and diced",
        "1/4 cup chopped fresh parsley",
        "1 tablespoon all-purpose flour",
        "1 quart low-sodium beef broth",
        "3/4 cup barley, rinsed",
        "2 teaspoons kosher salt",
        "Freshly ground black pepper",
        "*Using a blend of fresh mushrooms is also nice. Try shiitake, cremini, or button."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Mushroom",
        "Kid-Friendly",
        "Lunch",
        "Barley",
        "Healthy",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Mushroom Barley Soup",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-barley-soup-51186260"
}
