{
    "directions": [
        "Bring the broth to a simmer in a heavy medium saucepan. Add the porcini mushrooms. Set aside until the mushrooms are tender, about 5 minutes. Keep the broth warm over very low heat.",
        "Melt the butter in a heavy large saucepan over medium heat. Add olive oil. Add the onions and saute until tender, about 8 minutes. Add the white mushrooms and garlic. Using a slotted spoon, transfer the porcini mushrooms to a cutting board. Finely chop the mushrooms and add to the saucepan. Saute until the mushrooms are tender and the juices evaporate, about 5 minutes. Stir in the rice and let it toast for a few minutes. Add the wine; cook until the liquid is absorbed, stirring often, about 2 minutes. Add 1 cup of hot broth; simmer over medium-low heat until the liquid is absorbed, stirring often, about 3 minutes. Continue to cook until the rice is just tender and the mixture is creamy, adding more broth by cupfuls and stirring often, about 28 minutes (the rice will absorb 6 to 8 cups of broth). Stir in the peas. Mix in the Parmesan. Season with salt and pepper, to taste."
    ],
    "ingredients": [
        "8 cups canned low-salt chicken broth",
        "1/2-ounce dried porcini mushrooms",
        "1/4 cup unsalted butter",
        "2 tablespoons olive oil",
        "2 cups finely chopped onions",
        "10 ounces white mushrooms, finely chopped",
        "2 garlic cloves, minced",
        "1 1/2 cups Arborio rice or short-grain white rice",
        "2/3 cup dry white wine",
        "3/4 cup frozen peas, thawed",
        "2/3 cup grated Parmesan",
        "Salt and freshly ground black pepper, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Mushroom",
        "Risotto Recipes",
        "Vegetable",
        "Comfort Food",
        "European Recipes",
        "Italian",
        "Grain Recipes",
        "Beans and Legumes",
        "Pea Recipes",
        "Rice Recipes",
        "Cheese",
        "Parmesan Cheese Recipes",
        "Meat",
        "Appetizer",
        "Main Dish Recipes",
        "Fall",
        "Winter",
        "Sauteing Recipes"
    ],
    "title": "Mushroom Risotto with Peas",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/mushroom-risotto-with-peas-recipe"
}
