{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Place chicken breasts in a baking dish and coat with balsamic vinegar.",
        "Bake the chicken breasts in the preheated until no longer pink in the center and the juices run clear, about 45 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Slice chicken into small pieces. Set aside.",
        "In the meantime, bring the water and vegetable stock to a low boil in a saucepan, then turn off the heat. Heat the olive oil in a large, heavy-bottomed saucepan over medium-high heat. Add the onion and garlic; cook and stir until the onion begins to turn golden brown at the edges, about 2 minutes. Season with salt and pepper, then add mushrooms, cooking until mushrooms are tender. Pour the 1% milk and the evaporated milk into the same saucepan and heat for 2 minutes. Stir in the barley. Reduce the heat to medium and stir in 1 cup of the boiling vegetable broth; continue stirring until the barley has absorbed the liquid and turned creamy. Repeat this process until there is only 1 cup of broth left. Stir in the chicken with the last cup of broth. When finished, the barley should be tender, yet slightly firm, about 45 minutes. Stir in the butter, Parmesan cheese, and Romano cheese before serving."
    ],
    "ingredients": [
        "2 skinless, boneless chicken breast halves",
        "2 tablespoons balsamic vinegar",
        "3 1/2 cups water",
        "1 1/2 cups vegetable stock",
        "1 tablespoon olive oil",
        "1 large chopped onion",
        "1 clove garlic, minced",
        "salt and pepper to taste",
        "1 1/2 cups sliced fresh mushrooms",
        "1 cup 1% milk",
        "1/4 cup fat-free evaporated milk",
        "1 cup pearl barley",
        "1 teaspoon butter",
        "1/2 cup grated Parmesan cheese",
        "1/2 cup grated Romano cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mushroom Chicken Barley Risotto",
    "url": "http://allrecipes.com/recipe/200337/mushroom-chicken-barley-risotto/"
}
