{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Heat butter in a skillet over medium heat; cook and stir the onion and mushrooms with salt and pepper until the mushrooms are dark and juicy, about 5 minutes. Remove skillet from heat and stir in the bread crumbs. Set aside.",
        "Place each chicken breast half between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to an thickness of about 1/4 inch. Lay a flattened chicken breast out onto a work surface, and place a slice of ham on the chicken. Spoon about 3 tablespoons of the mushroom stuffing onto the chicken breast, and top with about 2 1/2 tablespoons of the Havarti cheese. Roll the chicken breast around the stuffing, wrap 2 slices of bacon firmly around each roll, and secure with toothpicks. Place the rolls into a 9x13-inch baking dish.",
        "Bake in the preheated oven until the chicken is no longer pink and the stuffing is melted and hot, about 35 minutes. An instant-read thermometer inserted into the center of a roll should read at least 165 degrees F (74 degrees C). Remove the chicken rolls from the oven, and place an oven rack about 6 inches from the oven's broiler heat source. Turn on the broiler, and broil the rolls until the bacon is brown, 5 to 10 more minutes."
    ],
    "ingredients": [
        "1/4 cup butter",
        "1 large onion, finely chopped",
        "1/2 pound button mushrooms, chopped",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 cup Italian seasoned bread crumbs",
        "12 skinless, boneless chicken breast halves",
        "12 slices Black Forest ham",
        "2 cups shredded Havarti-pepper cheese",
        "24 slices bacon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Mushroom Melt Stuffed Chicken",
    "url": "http://allrecipes.com/recipe/214491/mushroom-melt-stuffed-chicken/"
}
