{
    "directions": [
        "Heat the chicken broth in a medium saucepan and keep warm over low heat.",
        "Heat 1 tablespoon of oil in a large skillet over medium heat. Add 1/2 onion and 1 clove garlic, cook, stirring, until translucent, about 5 minutes. Add the fresh mushrooms, herbs and butter. Saute for 3 to 5 minutes until lightly browned, season with salt and pepper. Drizzle in truffle oil then add the dried porcini mushrooms which were reconstituted in1 cup of warm chicken broth. Season again with salt and fresh cracked pepper. Saute 1 minute then remove from heat and set aside.",
        "Coat a saucepan with remaining 2 tablespoons of oil. Saute the remaining 1/2 onion and garlic clove. Add the rice and stir quickly until it is well-coated and opaque, 1 minute. This step cooks the starchy coating and prevents the grains from sticking. Stir in wine and cook until it is nearly all evaporated.",
        "Now, with a ladle, add 1 cup of the warm broth and cook, stirring, until the rice has absorbed the liquid. Add the remaining broth, 1 cup at a time. Continue to cook and stir, allowing the rice to absorb each addition of broth before adding more. The risotto should be slightly firm and creamy, not mushy. Transfer the mushrooms to the rice mixture. Stir in Parmesan cheese, cook briefly until melted. Top with a drizzle of truffle oil and chopped parsley before serving."
    ],
    "ingredients": [
        "8 cups chicken broth, low sodium",
        "3 tablespoons olive oil, divided",
        "1 onion, diced, divided",
        "2 garlic cloves, minced, divided",
        "1 pound fresh portobello and crimini mushrooms, sliced",
        "2 bay leaves",
        "2 tablespoons fresh thyme, chopped",
        "2 tablespoons fresh Italian parsley, chopped",
        "2 tablespoons butter",
        "Salt and pepper",
        "1 tablespoon truffle oil",
        "1-ounce dried porcini mushrooms, wiped of grit",
        "2 cups Arborio rice",
        "1/2 cup dry white wine",
        "1/2 cup fresh Parmesan cheese, grated",
        "Fresh Italian parsley, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Mushroom",
        "Risotto Recipes",
        "Vegetable",
        "Italian",
        "Rice Recipes",
        "Cheese",
        "Appetizer",
        "Sauteing Recipes"
    ],
    "title": "Mushroom Risotto",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/mushroom-risotto-recipe"
}
