{
    "directions": [
        "Bring 2 cups water and porcini mushrooms to boil in small saucepan. Remove from heat, cover, and soak 20 minutes. Using slotted spoon, transfer mushrooms to work surface; slice thinly. Reserve cooking liquid.",
        "Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add garlic; stir 30 seconds. Add crimini mushrooms and thyme; sprinkle with sea salt and sauté until mushrooms are browned, stirring often, about 12 minutes. Add Sherry; stir until liquid is absorbed, about 1 minute. Set mushroom mixture aside.",
        "Heat 1 1/2 tablespoons oil in another heavy large skillet over medium-high heat. Add onion; cook until translucent and beginning to brown, stirring often, about 6 minutes. Add leeks; reduce heat to medium, sprinkle with sea salt, and sauté until vegetables are soft and golden, stirring often, about 15 minutes.",
        "Bring broth to simmer in large pot over medium-high heat. Pour in reserved mushroom cooking liquid, leaving sediment behind. Add all mushrooms, onion mixture, and cayenne. Simmer 1 minute to heat through. Season to taste with salt. DO AHEAD: Can be made 1 day ahead. Cool, cover, and chill.",
        "Puree cottage cheese in mini processor until smooth. Using electric mixer, beat 3 tablespoons butter and eggs in medium bowl. Add cottage cheese, 1/2 cup flour, 1 teaspoon sea salt, and nutmeg; beat on low speed just to blend. Stir in 1/2 cup flour, cheese, and parsley.",
        "Bring large pot of salted water to boil. Using teaspoon, scoop piece of dough about size of cherry. Holding spoon just above boiling water, use second spoon to push dough into water. Working quickly, repeat about 10 more times. When dumplings rise to surface, simmer until cooked through, 2 1/2 to 3 minutes. Using slotted spoon, transfer dumplings to large plate. Repeat with remaining dough. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate.",
        "Melt 3 tablespoons butter in large skillet over medium heat. Working in 2 batches, add dumplings to skillet. Cook until brown in spots, 2 to 3 minutes per side.",
        "Bring soup to simmer. Divide dumplings among wide shallow bowls. Divide soup among bowls and serve.",
        "Available in the produce section of many supermarkets and at specialty foods stores and Italian markets."
    ],
    "ingredients": [
        "2 cups water",
        "3/4 ounce dried porcini mushrooms*",
        "3 1/2 tablespoons extra-virgin olive oil, divided",
        "4 garlic cloves, minced",
        "1 pound crimini (baby bella) mushrooms, sliced",
        "1 teaspoon finely chopped fresh thyme",
        "Fine sea salt",
        "3 tablespoons dry Sherry",
        "1 1/2 cups chopped onion",
        "3 cups thinly sliced leeks (white and pale green parts only; about 2 large)",
        "8 cups Light Vegetable Broth or good-quality canned vegetable broth (such as Swanson)",
        "Pinch of cayenne pepper",
        "3/4 cup (scant) low-fat cottage cheese",
        "6 tablespoons (3/4 stick) butter, room temperature, divided",
        "2 large eggs, room temperature",
        "1 cup all purpose flour, divided",
        "1 teaspoon fine sea salt",
        "Pinch of ground nutmeg",
        "1/4 cup finely grated Parmesan cheese",
        "3/4 cup finely chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Egg",
        "Garlic",
        "Mushroom",
        "Onion",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Parmesan",
        "Leek",
        "Sherry",
        "Cottage Cheese",
        "Parsley"
    ],
    "title": "Mushroom and Leek Soup with Parsley Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-and-leek-soup-with-parsley-dumplings-357310"
}
