{
    "directions": [
        "Preheat oven to 400°F.",
        "Mince mushrooms and squeeze them dry in the corner of a towel.",
        "Sauté with minced shallots or green onions in butter and oil over moderately high heat, stirring frequently. Cook until pieces separate and the liquid has evaporated. Season to taste with salt and pepper. Blend in cream cheese.",
        "Spread a sheet of strudel or filo dough on a damp towel, narrow end toward you. Brush with melted butter and sprinkle on bread crumbs. Repeat with second and third sheets, stacking them on top of the first sheet, then butter, but do not crumb fourth sheet. Put half the mushroom mixture on narrower edge of the dough, leaving a 2- to 3-inch border at the sides. Fold in the sides, then, using the edge of the towel, roll. Prepare the second strudel.",
        "Put strudels on buttered baking sheet and brush with melted butter. Bake in oven until brown (about 20 minutes). The strudel cuts easily with shears. Strudel can be made and baked ahead, stored in the refrigerator or in the freezer overnight, and then reheated."
    ],
    "ingredients": [
        "2 lbs. mushrooms",
        "1/4 cup minced shallots or green onions",
        "6 tbsp butter",
        "2 tbsp oil",
        "Salt and pepper",
        "2 8-oz packages cream cheese",
        "8 sheets frozen strudel or filo dough, 16 inches x 22 inches",
        "3/4 cup melted butter",
        "Bread crumbs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Appetizer",
        "Side",
        "Bake",
        "Christmas",
        "Cocktail Party",
        "Easter",
        "Thanksgiving",
        "Quick & Easy",
        "Cream Cheese",
        "Birthday",
        "Shallot",
        "Phyllo/Puff Pastry Dough",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mushroom Strudel",
    "url": "http://www.epicurious.com/recipes/food/views/mushroom-strudel-234217"
}
