{
    "directions": [
        "Preheat oven to 450°F.",
        "Halve potatoes lengthwise and trim a 1/4-inch-thick slice from side opposite cut side of each potato half to form 8 flat slabs (1/2 to 3/4 inch thick). Discard trimmings, then coat potato slabs with 2 tablespoons oil and sprinkle with all of salt. Arrange in 1 layer in a large shallow baking pan (1 inch deep) and roast in middle of oven, turning over once halfway through roasting, until golden brown and tender, 25 to 30 minutes total.",
        "Shortly before potatoes are done, cook shallot, garlic, and red pepper flakes in 2 tablespoons oil in a deep 12-inch heavy skillet over moderate heat, stirring, until softened, about 3 minutes. Add wine and water and bring to a simmer. Add mussels and cook, covered, over moderately high heat until they just open wide, checking frequently after 3 minutes and transferring opened mussels to a bowl. Discard any mussels that remain unopened after 6 minutes.",
        "Whisk parsley and remaining 2 tablespoons oil into mussel broth and season with salt and pepper.",
        "Divide potatoes among 4 shallow bowls and top with mussels and broth."
    ],
    "ingredients": [
        "4 large Yukon Gold or russet (baking) potatoes (2 pounds total)",
        "6 tablespoons extra-virgin olive oil",
        "1/2 tablespoon kosher salt",
        "1/3 cup finely chopped shallot",
        "3 garlic cloves, minced",
        "Rounded 1/4 teaspoon dried hot red pepper flakes",
        "1 cup dry white wine",
        "3/4 cup water",
        "2 pounds mussels (preferably cultivated), scrubbed well and beards removed",
        "3 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Shellfish",
        "Roast",
        "Quick & Easy",
        "Lunch",
        "Mussel",
        "White Wine",
        "Simmer",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mussels with Roasted Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/mussels-with-roasted-potatoes-108086"
}
