{
    "directions": [
        "In a food processor or blender blend the butter with the roasted peppers, the garlic, the red pepper flakes, and salt to taste until the mixture is smooth. The red pepper butter may be made 2 days in advance and kept covered and chilled.",
        "Scrub the mussels well in several changes of cold water, scrape off the beards, and rinse the mussels. In a large kettle combine 4 cups water, the white wine, the Sherry, the fennel bulb, the shallot, the red pepper flakes, the fennel seeds, the thyme, and the salt and boil the mixture, covered, for 3 minutes. Add the mussels, boil them, covered, shaking the kettle occasionally, for 4 to 6 minutes, or until the shells have opened, and discard any unopened mussels. Arrange the mussels, the fennel bulb, and the shallot in shallow bowls, ladle the hot broth over them, and spoon about 1 tablespoon of the red pepper butter in the center of each serving. Serve the remaining red pepper butter separately.",
        "<font size=\"4\">Using a long-handled fork char the peppers over an open flame, turning them, for 2 to 3 minutes, or until the skins are blackened. (Or broil the peppers on a rack of a broiler pan under a preheated broiler about 2 inches from the heat, turning them every 5 minutes, for 15 to 25 minutes, or until the skins are blistered and charred.) Transfer the peppers to a bowl and let them steam, covered, until they are cool enough to handle. Keeping the peppers whole, peel them starting at the blossom end, cut off the tops, and discard the seeds and ribs. ( Wear rubber gloves when handling chilies.)</font>"
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter, softened",
        "2 red bell peppers, roasted (procedure follows)",
        "1 garlic clove, chopped, if desired",
        "1/4 teaspoon dried hot red pepper flakes",
        "3 1/2 pounds mussels",
        "1 1/2 cups dry white wine",
        "1/4 cup medium-dry Sherry",
        "2 cups thinly sliced fennel bulb",
        "1 1/2 cups thinly sliced shallot",
        "1/4 teaspoon dried hot red pepper flakes",
        "1 teaspoon fennel seeds",
        "2 fresh thyme sprigs or 1/4 teaspoon dried",
        "1/2 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Steam",
        "Mussel",
        "Fennel",
        "Bell Pepper",
        "White Wine",
        "Thyme",
        "Shallot",
        "Gourmet"
    ],
    "title": "Mussels with Fennel and Roasted Red Pepper Butter",
    "url": "http://www.epicurious.com/recipes/food/views/mussels-with-fennel-and-roasted-red-pepper-butter-11500"
}
