{
    "directions": [
        "Bring stock and saffron to simmer in medium saucepan. Remove from heat; cover to keep warm.",
        "Heat olive oil in heavy large pot over medium heat. Add shallots; sauté until tender, about 2 minutes. Add rice and garlic; stir 1 minute. Add white wine and stir until absorbed, about 2 minutes. Add 1/2 cup saffron stock and simmer until absorbed, stirring frequently. Add remaining stock 1/2 cup at a time, allowing stock to be absorbed before adding more and stirring frequently until rice is cooked halfway, about 10 minutes. Add clam juice, mussels, littleneck clams, shrimp and chopped tomatoes. Cover and simmer until rice is tender, mussels and clams open, shrimp are cooked through and liquid is absorbed, about 10 minutes (discard any mussels and clams that do not open). Divide seafood and saffron risotto equally among 4 bowls. Sprinkle with sliced green onions. Garnish with lemon wedges. Serve, passing Green Olive Relish separately."
    ],
    "ingredients": [
        "2 cups chicken stock or canned low-salt chicken broth",
        "1/4 teaspoon saffron threads",
        "2 tablespoons extra-virgin olive oil",
        "1/4 cup chopped shallots",
        "1 cup arborio rice or medium-grain white rice",
        "4 garlic cloves, minced",
        "1/2 cup dry white wine",
        "1 cup bottled clam juice",
        "20 mussels, scrubbed, debearded",
        "12 littleneck clams, scrubbed",
        "12 uncooked large shrimp, peeled, deveined, tails left intact",
        "3/4 cup chopped tomatoes",
        "1/4 cup sliced green onions",
        "Lemon wedges",
        "Green Olive Relish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Rice",
        "Shellfish",
        "Sauté",
        "Dinner",
        "Seafood",
        "Clam",
        "Mussel",
        "Shrimp",
        "Saffron",
        "Fall",
        "Party",
        "Simmer",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mussels, Clams and Shrimp with Saffron Risotto and Green Olive Relish",
    "url": "http://www.epicurious.com/recipes/food/views/mussels-clams-and-shrimp-with-saffron-risotto-and-green-olive-relish-103885"
}
