{
    "directions": [
        "Prepare grill.",
        "Preheat a large griddle or 12-inch cast-iron skillet on a rack over very hot coals.",
        "When griddle or skillet is very hot, add mussels and cook, stirring occasionally if using skillet, until mussels are opened, about 3 minutes. Discard any unopened mussels.",
        "While mussels are cooking, in a small saucepan heat butter and salsa over moderately high heat until mixture sizzles. Remove pan from heat and stir in lime juice, salt, and epazote.",
        "Drizzle sauce over mussels.",
        "Heat a dry comal or flat iron griddle over moderately low heat until hot and pan-roast garlic and tomato, turning them occasionally to ensure even roasting, until browned and soft throughout, about 25 to 30 minutes. Discard garlic skins and tomato stem.",
        "In a heavy skillet heat oil over moderately high heat until hot but not smoking and, using tongs, fry chiles, 1 or 2 at a time, turning them, until puffed and just beginning to brown, about 10 seconds. Transfer chiles as fried, letting excess oil drip into skillet, to paper towels to drain and, wearing rubber gloves, discard stems.",
        "In a blender purée garlic, tomato, chiles, water, and salt until very smooth. (Salsa may be made 2 days ahead and chilled, covered.) Makes about 2 cups."
    ],
    "ingredients": [
        "2 pounds small mussels (preferably cultivated), scrubbed well and beards pulled off",
        "2 sticks (1 cup) unsalted butter",
        "1/4 cup Veracruz salsa",
        "1 tablespoon fresh lime juice",
        "1/4 teaspoon coarse salt, or to taste",
        "6 fresh epazote leaves* if desired, chopped",
        "2 garlic cloves, unpeeled",
        "1 plum tomato",
        "1 tablespoon corn oil",
        "12 morita chiles* with seeds or 8 dried chipotle chiles* with seeds",
        "1 1/2 cups hot water",
        "1/4 teaspoon coarse salt, or to taste",
        "available at Mexican markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Tomato",
        "Lime",
        "Mussel",
        "Hot Pepper",
        "Summer"
    ],
    "title": "Mussels à la Plancha",
    "url": "http://www.epicurious.com/recipes/food/views/mussels-a-la-plancha-12686"
}
