{
    "directions": [
        "Wash leeks in a bowl of cold water, agitating them, then lift out leeks and pat dry.",
        "Cook leeks in butter in a wide 5-quart heavy pot over moderate heat, stirring occasionally, until softened, 5 to 7 minutes. Add thyme and cook, stirring, 1 minute. Stir in beer and water, then increase heat to moderately high and bring to a boil. Add mussels and return liquid to a boil, partially covered. Cook, completely covered, stirring occasionally, just until mussels open wide, checking frequently after 4 minutes and transferring to a large bowl. (Discard any mussels that remain unopened after 8 minutes.)",
        "Working over a bowl, remove mussels from shells and put in bowl (discard shells along with any clinging leeks). Pour any cooking liquid accumulated in bowl back into pot.",
        "Pour cooking liquid through a sieve lined with a double layer of cheesecloth or dampened paper towels into a 2-quart heavy saucepan. Stir in half-and-half, salt, and white pepper, then heat over moderately low heat until hot (do not let boil). Stir in mussels and heat until just warmed through.",
        "Meanwhile, halve avocado, then peel 1 half (wrap remaining half tightly in plastic wrap and reserve for another use). Cut into 1/2-inch cubes, then toss gently with tomatoes and dill in a bowl.",
        "Divide soup among 6 shallow bowls and spoon some avocado mixture into each. Serve immediately."
    ],
    "ingredients": [
        "1 1/2 pounds leeks (3 medium; white and pale green parts only), quartered lengthwise, then sliced crosswise",
        "2 tablespoons unsalted butter",
        "4 (3-inch) sprigs fresh thyme",
        "1 (12-ounce) bottle lager",
        "1 1/2 cups water",
        "3 pounds mussels (preferably cultivated), scrubbed well and beards removed if attached",
        "1 cup half-and-half",
        "1/4 teaspoon salt",
        "1/4 teaspoon coarsely ground white pepper",
        "1 (8-ounce) firm-ripe avocado",
        "18 very small grape or pear tomatoes (1/4 pound), halved",
        "3 tablespoons coarsely chopped fresh dill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Herb",
        "Shellfish",
        "Tomato",
        "Appetizer",
        "Seafood",
        "Mussel",
        "Avocado",
        "Leek",
        "Dill",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Mussel Soup with Avocado, Tomato, and Dill",
    "url": "http://www.epicurious.com/recipes/food/views/mussel-soup-with-avocado-tomato-and-dill-237584"
}
