{
    "directions": [
        "Clean the mussels: Scrub them well under cold running water. Debeard them, if necessary, pulling out any wiry fronds coming through the seams of the shells.",
        "In a large pot or deep sauté pan, combine the white wine, half the shallot, and the bay leaf. Place the mussels on top and cover with a lid. Bring to a boil over high heat to steam open the mussels, 3 to 4 minutes. You may want to give them a stir after 2 minutes to disperse the heat evenly among the mussels. When the mussels have opened (if there are a few that don't, this is an indication that they are dead or bad — discard them), transfer them to four shallow bowls.",
        "Strain the cooking liquid, through either a coffee filter or several layers of cheesecloth, into a clean pan, add the olive oil, remaining shallot, and garlic, and bring to a boil over high heat. Reduce the mixture slightly; it will condense to an opaque liquid. Taste. If it's too salty, add a little water. Sprinkle the herbs and spoon the sauce over the mussels. Serve promptly, with a tangy baguette torn into large pieces, which you can use to soak up the broth when you're finished with the mussels."
    ],
    "ingredients": [
        "Special Equipment: Coffee filter or cheesecloth",
        "3 pounds mussels",
        "1 1/2 cups white wine",
        "4 shallot lobes, sliced thin",
        "1 bay leaf",
        "2 tablespoons olive oil",
        "2 cloves garlic, sliced thin",
        "1 tablespoon chopped flat-leaf parsley leaves (about 3 sprigs)",
        "1/2 tablespoon chopped chervil leaves (about 4 sprigs)",
        "2 teaspoons chopped tarragon leaves (about 2 branches)",
        "1 teaspoon thinly sliced chive blades (about 3 blades)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Shellfish",
        "Steam",
        "Mussel",
        "White Wine",
        "Spring",
        "Tarragon",
        "Chive",
        "Parsley"
    ],
    "title": "Mussels with Garlic and Fines Herbes",
    "url": "http://www.epicurious.com/recipes/food/views/mussels-with-garlic-and-fines-herbes-101374"
}
