{
    "directions": [
        "Combine mussels and wine in large pot. Cover; bring to boil. Boil until mussels open, about 5 minutes (discard any that do not open). Using tongs, transfer to large bowl. Pour cooking liquid through strainer set over 8-cup measuring cup. Add enough clam juice to cooking liquid to measure 5 cups. Remove mussels from shells; place in small bowl. Discard shells. Cover mussels and chill until ready to use, up to 8 hours. Melt 2 tablespoons butter in large saucepan over medium heat. Add 1 1/2 cups fennel cubes and carrot; sauté until fennel is slightly softened, about 10 minutes. Add shallots; sauté until soft, about 4 minutes. Add clam juice mixture, rice, tomato paste, thyme, and bay leaf. Bring to boil. Reduce heat to medium-low; partially cover and simmer until rice is tender, stirring occasionally, about 25 minutes. Discard bay leaf. Cool slightly. Working in batches, puree in blender. Return to saucepan.",
        "Meanwhile, melt 1 tablespoon butter in small nonstick skillet over medium heat. Add 1 cup fennel cubes; sauté until crisptender, about 7 minutes. Season with salt and pepper. Remove from heat. do ahead Bisque mixture and sautéed fennel can be made 8 hours ahead. Cool slightly. Chill bisque mixture uncovered until cold, then cover and keep chilled. Cover and chill fennel. Bring bisque mixture to simmer before continuing.",
        "Add whipping cream, brandy, and mussels to bisque mixture; bring to simmer. Season to taste with salt and pepper. Ladle bisque into 6 bowls. Sprinkle sautéed fennel cubes atop bisque. Garnish with chopped fennel fronds and parsley, if desired.",
        "Try a crisp white wine with the bisque. We like the very affordable Snoqualmie 2007 Sauvignon Blanc ($8) from Washington State."
    ],
    "ingredients": [
        "2 pounds mussels, scrubbed, debearded",
        "1 cup dry white wine",
        "4 cups (about) bottled clam juice or low-salt chicken broth",
        "3 tablespoons butter, divided",
        "2 1/2 cups 1/2-inch cubes fresh fennel bulbs, divided, fennel fronds chopped and reserved for garnish",
        "1/4 cup 1/4-inch cubes peeled carrot",
        "1/2 cup chopped shallots (about 2 large)",
        "1/4 cup long-grain rice",
        "1 teaspoon tomato paste",
        "1/2 teaspoon dried thyme",
        "1 bay leaf",
        "1 cup heavy whipping cream",
        "1 tablespoon brandy",
        "Chopped fresh parsley (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Sauté",
        "Dinner",
        "Lunch",
        "Mussel",
        "Fennel",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mussel and Fennel Bisque",
    "url": "http://www.epicurious.com/recipes/food/views/mussel-and-fennel-bisque-351036"
}
