{
    "directions": [
        "Preheat oven to 375°F. Combine bread cubes, Parmesan, and oil in medium bowl; sprinkle with salt and toss to coat. Spread bread cubes evenly on rimmed baking sheet. Bake until bread cubes are crisp and golden around edges, about 15 minutes. Remove from oven and cool.",
        "Mix parsley, chives, tarragon, and chervil, if desired, in small bowl. Whisk crème fraîche and both mustards in another small bowl to blend; set aside.",
        "Melt butter in extra-large pot with lid over high heat. Add garlic and thyme; stir 1 minute. Add mussels, tomatoes, and green onions. Pour beer over, then add crème fraîche mixture; sprinkle with freshly ground black pepper. Cover tightly with lid and cook until steam appears, about 3 minutes. Add half of fresh herb mixture and stir until mussels and herbs are gently mixed. Cover tightly with lid again and cook until mussels open, 4 to 5 minutes (discard any mussels that do not open).",
        "Using slotted spoon, divide mussels among 6 bowls. Season mussel juices lightly with salt and pepper, then pour juices over each serving. Sprinkle each serving with Parmesan croutons and remaining herb mixture and serve.",
        "* Available at most supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "4 5 x 3 x 1/2-inch slices country-style bread, crusts removed, bread cut into 3/4-inch cubes",
        "1/3 cup grated Parmesan cheese",
        "2 tablespoons olive oil",
        "3/4 cup chopped fresh Italian parsley",
        "1/4 cup chopped fresh chives",
        "1/4 cup chopped fresh tarragon",
        "1/4 cup chopped fresh chervil (optional)",
        "2/3 cup crème fraîche*",
        "3 tablespoons Dijon mustard",
        "1 tablespoon whole grain brown mustard or whole grain Dijon mustard",
        "3 tablespoons butter",
        "4 large garlic cloves, minced",
        "2 tablespoons chopped fresh thyme",
        "5 pounds mussels, scrubbed, debearded",
        "3 cups diced seeded tomatoes (about 4 large)",
        "1 cup chopped green onions (about 4)",
        "1 12-ounce bottle Belgian white beer (such as Hoegaarden)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Beer",
        "Milk/Cream",
        "Herb",
        "Dinner",
        "Parmesan",
        "Seafood",
        "Mussel",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mussels Steamed in Beer with Crème Fraîche, Herbs, and Parmesan croutons",
    "url": "http://www.epicurious.com/recipes/food/views/mussels-steamed-in-beer-with-creme-fraiche-herbs-and-parmesan-croutons-358572"
}
