{
    "directions": [
        "Place pork on a wire rack set inside a large rimmed baking sheet; season all over with salt and pepper. Whisk mustard, mustard powder, and 1/4 cup oil in a small bowl to blend. Rub over pork and let sit at room temperature 1 hour.",
        "Preheat oven to 425°F. Roast pork until beginning to brown, 25-30 minutes. Reduce heat to 350°F and roast until a thermometer inserted in the thickest part registers 145°F, 25-35 minutes longer, depending on thickness of roast.",
        "Meanwhile, cook farro in a large pot of boiling salted water until tender, 30-35 minutes; drain.",
        "Whisk vinegar, caraway seeds, honey, and remaining 1/4 cup oil in a medium bowl; set vinaigrette aside.",
        "Heat 2 tablespoons vinaigrette in a large skillet over medium-high heat. Add farro and carrots and cook, tossing often, until carrots soften and farro is warmed through, about 3 minutes. Remove from heat and transfer to a large bowl. Add onion, parsley, and half of remaining vinaigrette; season with salt and pepper and toss to combine.",
        "Slice pork. Serve with farro salad. Pass remaining vinaigrette alongside.",
        "DO AHEAD: Farro can be cooked 2 days ahead. Let cool, cover, and chill. Reheat before using."
    ],
    "ingredients": [
        "1 3-3 1/2-pound boneless pork loin",
        "Kosher salt, freshly ground pepper",
        "1 cup whole grain mustard",
        "1/4 cup mustard powder",
        "1/2 cup olive oil, divided",
        "2 cups farro",
        "1/3 cup apple cider vinegar",
        "1 tablespoon caraway seeds, coarsely chopped",
        "1 teaspoon honey",
        "1 1/2 pounds baby carrots, any color, very thinly sliced lengthwise on a mandoline",
        "1/2 small red onion, very thinly sliced into rings",
        "1 cup (packed) fresh flat-leaf parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Pork",
        "Roast",
        "Easter",
        "Dinner",
        "Carrot",
        "Spring",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mustard-Crusted Pork With Farro and Carrot Salad",
    "url": "http://www.epicurious.com/recipes/food/views/mustard-crusted-pork-with-farro-and-carrot-salad-51155310"
}
