{
    "directions": [
        "In a spice mill or in a mortar with a pestle, coarsely grind the peppercorns and mustard seeds. Transfer the mixture to a small bowl, then stir in the rosemary and salt. Pat the steak dry and press the spice mixture into both sides.",
        "Brush a large, heavy fry pan with olive oil and place over high heat. Add the steak and cook, turning once, about 4 minutes per side for medium-rare, or until done to your liking. Transfer the steak to a cutting board.",
        "Add the vinegar, shallots and brown sugar to the pan and boil, stirring occasionally, until reduced to a glaze, about 1 minute. Transfer the glaze to a small bowl.",
        "Divide the arugula among 4 warmed plates and top with the onion and radishes. Squeeze lemon juice over the salads. Slice the steak thinly on an angle and arrange on top of the arugula. Drizzle with the glaze and serve immediately. Serves 4.",
        "Quick Tips:",
        "Top sirloin is an economical and great-tasting cut of beef that’s perfect for weeknight cooking. Be sure to slice the meat thinly or it may seem tough. The leftover steak is delicious in sandwiches.",
        "Adapted from Williams-Sonoma",
        "Weeknight Fresh & Fast,",
        "by Kristine Kidd (Williams-Sonoma, 2011)."
    ],
    "ingredients": [
        "2 tsp. peppercorns",
        "1 tsp. mustard seeds",
        "1 Tbs. minced fresh rosemary",
        "2 tsp. coarse kosher salt",
        "1 1/4 lb. top sirloin steak, about 1 inch thick",
        "Olive oil as needed",
        "1/2 cup balsamic vinegar",
        "1/4 cup minced shallots",
        "1 tsp. firmly packed brown sugar",
        "6 cups arugula",
        "1/4 red onion, thinly sliced",
        "1/2 bunch radishes, thinly sliced",
        "1/2 lemon"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Mustard-Peppercorn Steak and Arugula Salad",
    "url": "http://www.williams-sonoma.com/recipe/mustard-peppercorn-steak-and-arugula-salad.html"
}
