{
    "directions": [
        "1. Preheat the oven to 400°F.",
        "2. Peel the outer layers of skin from the head of garlic until you reach the individual cloves. Slice off the top of the head so the flesh of each clove is exposed. Put the head of garlic on a sheet of foil, drizzle with olive oil, season with salt and pepper, and close the foil into a pouch. Bake for 45 minutes, until the flesh of each clove is light brown and very soft when tested with the tip of a knife.",
        "3. Once you've slipped the garlic into the oven, heat 1 teaspoon olive oil over medium heat in a large heavy pot or Dutch oven. Working in two batches, arrange the chicken in the pot, skin side down, in a single layer. Season with salt and pepper and cook for 3 minutes on each side, until golden. (Be careful not to burn yourself with the sizzling chicken fat.)",
        "4. While the chicken is browning, peel and quarter the onions. Set the meat aside on a plate and pour out the excess chicken fat. Put the onions in the pot and cook for 5 minutes, until softened, stirring regularly.",
        "5. Add the tomatoes, thyme, bay leaves, and ground chile powder, and arrange the chicken over the vegetables. Pour in the wine and bring to a simmer. Cover and cook over medium-low heat for 40 minutes, stirring from time to time to make sure the vegetables don’t stick to the bottom.",
        "6. Remove the garlic from the oven, open the pouch, and let stand until cool enough to handle. Squeeze the garlic out of each clove into a small bowl, and mash with a fork to form a paste. Taste and adjust the seasoning. Cover and set aside.",
        "7. When the chicken is cooked, spoon the mustard in the pot and stir to blend into the sauce. Turn the heat up to medium-high and cook uncovered for 10 minutes, stirring regularly, until the sauce is thick enough to cling to the meat. Taste the sauce and adjust the seasoning.",
        "8. Cover and keep over low heat until ready to serve. Serve over rice or pasta (fish out the bay leaves, or simply tell your dining companions not to eat them), with garlic paste on the side. The stew and garlic can be prepared up to a day ahead, covered, and refrigerated. Reheat the stew over gentle heat, and bring the garlic paste to room temperature before serving. The leftover sauce from the stew is splendid on pasta."
    ],
    "ingredients": [
        "1 whole head garlic",
        "Extra virgin olive oil",
        "Fine sea salt and freshly ground pepper",
        "One 3- to 3 1/2-pound whole free-range chicken, cut in 8 serving pieces (2 breasts, 2 thighs, 2 wings, and 2 drumsticks, with bones and skin), thawed if frozen",
        "6 medium red onions, about 2 pounds",
        "One 28- to 32-ounce can good-quality whole peeled tomatoes, drained",
        "1 tablespoon fresh thyme or 1 1/2 teaspoons dried thyme",
        "2 bay leaves",
        "A good pinch of ground chile powder",
        "1/3 cup dry white wine",
        "3 tablespoons old-fashioned Dijon mustard with whole mustard seeds (substitute 1/4 cup regular Dijon mustard)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Wine",
        "Chicken",
        "Garlic",
        "Mustard",
        "Onion",
        "Poultry",
        "Tomato",
        "Stew",
        "Dinner",
        "Thyme",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Mustard Chicken Stew",
    "url": "http://www.epicurious.com/recipes/food/views/mustard-chicken-stew-355877"
}
