{
    "directions": [
        "Preheat oven to 425°F.",
        "Stir together mustards, brown sugar, pepper, and lemon zest.",
        "Pat beef dry and season generously with salt. Heat oil in a heavy skillet over moderately high heat until just beginning to smoke, then brown beef on all sides, about 2 minutes total.",
        "Transfer to an oiled shallow baking pan and coat with mustard mixture.",
        "Roast beef in middle of oven until a thermometer inserted 2 inches into thickest part of meat registers 125°F for medium-rare, 15 to 20 minutes. Transfer to a cutting board and let stand until cool, at least 45 minutes.",
        "Chill onion slices in water to cover 30 minutes. Cook beans in boiling salted water until crisp-tender, about 5 minutes. Drain beans in a colander and rinse under cold water to stop cooking, then transfer to a large bowl. Add arugula to beans. Drain onion slices and pat dry.",
        "Whisk together vinegar, lemon juice, mustard, and salt and pepper to taste. Add oil in a slow stream, whisking until emulsified.",
        "Cut beef into thin slices.",
        "Add onion slices, beef, and enough dressing to arugula and beans to just coat and toss to combine well."
    ],
    "ingredients": [
        "1/4 cup coarse-grain mustard",
        "3/4 teaspoon dry mustard",
        "2 1/4 teaspoons packed dark brown sugar",
        "3/4 teaspoon coarsely ground black pepper",
        "1/2 teaspoon finely grated fresh lemon zest",
        "1 (1-lb) trimmed beef tenderloin roast, tied",
        "1 tablespoon vegetable oil",
        "1 small red onion (1/4 lb), thinly sliced",
        "1/2 lb wax or green beans, cut diagonally into 2-inch pieces",
        "4 oz baby arugula (4 cups)",
        "1 1/2 tablespoons balsamic vinegar",
        "1 tablespoon fresh lemon juice",
        "1/4 teaspoon Dijon mustard",
        "1/4 cup olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Beef",
        "Mustard",
        "Roast",
        "Picnic",
        "Salad Dressing",
        "Vinegar",
        "Arugula",
        "Summer",
        "Gourmet"
    ],
    "title": "Mustard-Crusted Beef Tenderloin with Arugula, Red Onion, and Wax Bean Salad",
    "url": "http://www.epicurious.com/recipes/food/views/mustard-crusted-beef-tenderloin-with-arugula-red-onion-and-wax-bean-salad-103711"
}
