{
    "directions": [
        "Coarsely puree first 7 ingredients in processor. Reserve 1/2 cup mustard mixture in bowl; cover and chill.",
        "Rinse turkey inside and out; pat dry. Slide hand under skin of turkey breast, legs and thighs to loosen skin. Using hand, spread 1 cup mustard mixture under skin over turkey breast, legs and thighs. Spread remaining mustard mixture inside main cavity. Place turkey on rack in large roasting pan. Slide pan with turkey into large plastic bag (about 30-gallon capacity). Close bag; refrigerate turkey at least 1 day and up to 2 days.",
        "Position rack in bottom third of oven; preheat to 325°F. Remove pan with turkey from bag. If stuffing turkey, spoon stuffing loosely into main cavity. Tuck wing tips under turkey; tie legs together loosely. Spread 1/2 cup chilled mustard mixture all over turkey. Roast 2 hours. Baste with 1/2 cup broth. Continue to roast until turkey is brown and thermometer inserted into thickest part of thigh registers 180°F, basting frequently with remaining 1 1/2 cups broth and pan juices and covering loosely with foil if browning too quickly, about 1 hour 30 minutes longer if unstuffed and 2 hours longer if stuffed.",
        "Transfer turkey to platter. Tent loosely with foil; let stand 30 minutes. Reserve pan juices for gravy.",
        "Pour pan juices into large measuring cup. Spoon off fat, reserving 2 tablespoons. Heat 2 tablespoons turkey fat in heavy large skillet over medium-high heat. Add mushrooms to skillet; sauté until brown and tender, about 15 minutes. Add enough broth to pan juices to measure 3 1/2 cups. Add 3 1/2 cups pan-juice mixture and cream to mushrooms. Boil 8 minutes to blend flavors. Mix cornstarch and 1/4 cup broth in small bowl. Mix into gravy. Continue to boil until gravy thickens, about 1 minute; season with salt and pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "1 cup Dijon mustard",
        "3/4 cup olive oil",
        "1/2 cup chopped fresh parsley",
        "1/4 cup fresh lemon juice",
        "2 tablespoons grated lemon peel",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh sage",
        "1 15- to 16-pound turkey",
        "2 cups canned low-salt chicken broth",
        "1 pound mushrooms, thinly sliced",
        "1 1/4 cups (about) canned low-salt chicken broth",
        "1/2 cup whipping cream",
        "2 tablespoons cornstarch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Fall"
    ],
    "title": "Mustard-Rubbed Roast Turkey with Mushroom Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/mustard-rubbed-roast-turkey-with-mushroom-gravy-102480"
}
