{
    "directions": [
        "Using electric mixer, beat crème fraîche and cream in medium bowl to firm peaks. Fold in horseradish and 1/3 cup mustard. Season to taste with salt and pepper. Cover and chill. DO AHEAD: Can be made 8 hours ahead. Keep chilled. Rewhisk before serving.",
        "Preheat oven to 450°f. Toss onions, shallots, vinegar, oil, and 1 1/2 teaspoons coarse salt in large bowl. Sprinkle roast lightly with coarse salt and generously with pepper. Stir 2/3 cup mustard and garlic in small bowl; rub over roast. Place roast, bone side down, in roasting pan. Sprinkle mustard seeds over, pressing to adhere. Roast 20 minutes. Reduce oven temperature to 350°F.",
        "Arrange onion mixture around roast. Return to oven; roast until instant-read thermometer inserted into center registers 120°F, stirring onion mixture occasionally, about 2 1/4 hours for medium-rare.",
        "Transfer roast to work surface. Tent with foil; let rest 30 minutes. If necessary, increase oven temperature to 450°F and return onion mixture to roasting pan and roast until deep brown and very tender, about 10 minutes. Using slotted spoon, transfer onion mixture to medium bowl.",
        "Place roasting pan over 2 burners on medium-high heat. Add brandy; stir 30 seconds. Whisk in broth and remaining 1 teaspoon mustard; boil until reduced to 1 1/4 cups jus, stirring occasionally, about 10 minutes. Season jus with salt and pepper.",
        "Slice roast; arrange on platter. Spoon onions around roast. Sprinkle parsley over. Pass dijon crème fraîche and jus alongside.",
        "The king of roasts meets its match in the king of wines. Dijon mustard's pleasant sharpness softens Cabernet's big tannins. With the roast, try the ROBERT MONDAVI 2006 CABERNET SAUVIGNON OAKVILLE (California, $45). The wine's spice and blackberry flavors are perfect with the beef."
    ],
    "ingredients": [
        "1/2 cup crème fraîche",
        "1/2 cup heavy whipping cream",
        "1/4 cup prepared white horseradish",
        "1 cup plus 1 teaspoon dijon mustard, divided",
        "4 medium onions, cut into 3/4-inch wedges with some core attached",
        "5 very large shallots (about 1 pound), quartered through root end",
        "3 tablespoons balsamic vinegar",
        "2 tablespoons olive oil",
        "1 1/2 teaspoons coarse kosher salt plus additional (for sprinkling)",
        "4 garlic cloves, minced",
        "1 9 1/2-pound bone-in standing prime rib roast, trimmed",
        "2 tablespoons yellow mustard seeds",
        "1/4 cup brandy",
        "2 cups low-salt beef broth",
        "Chopped fresh italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mustard",
        "Onion",
        "Roast",
        "Christmas",
        "Dinner",
        "Vinegar",
        "Christmas Eve",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Mustard-Seed-Crusted Prime Rib Roast with Roasted Balsamic Onions",
    "url": "http://www.epicurious.com/recipes/food/views/mustard-seed-crusted-prime-rib-roast-with-roasted-balsamic-onions-362529"
}
