{
    "directions": [
        "Prepare a charcoal or gas grill for grilling over high heat, or turn 3 gas burners to high. Place the eggplants directly onto the coals or flame and grill, using tongs to turn them as the skin chars, until blackened all over. Set aside to cool.",
        "Alternatively, roast the eggplant in the oven. Preheat the oven to 400°F and line a baking sheet with aluminum foil. Pierce the eggplants in a few places with a sharp knife, place them on the prepared baking sheet and roast, turning every 5 minutes or so, until the skin is blistered and begins to crack all over. Set aside to cool.",
        "Slice the eggplants in half lengthwise and scoop out the flesh, transferring it directly to a strainer to allow the liquid to release.",
        "Meanwhile, in a medium bowl, combine the tomatoes with the chile peppers, if using, garlic, shallot, 1/2 cup parsley, 3 tablespoons oil, lemon juice, cumin, pepper and salt. Add the drained eggplant and mix together with a fork. Transfer the eggplant mixture to a serving bowl and drizzle with the remaining 3 tablespoons oil. Garnish with the remaining parsley and surround with the cucumber slices."
    ],
    "ingredients": [
        "3 medium eggplants, 2 1/2 to 3 pounds total",
        "4 plum tomatoes or 2 Jersey tomatoes, finely chopped",
        "2 chile peppers, seeded and finely chopped, optional",
        "4 to 5 cloves garlic, minced",
        "1 shallot, minced",
        "1 cup chopped fresh parsley",
        "6 tablespoons extra-virgin olive oil or to taste",
        "Juice of 2 lemons, plus more for finishing",
        "1/2 teaspoon ground cumin or to taste",
        "1/2 teaspoon freshly ground black pepper",
        "Sea salt to taste",
        "Sliced cucumbers for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Side",
        "Vegetarian",
        "Backyard BBQ",
        "Eggplant",
        "Grill",
        "Grill/Barbecue",
        "Vegan",
        "Lemon Juice",
        "Chile Pepper",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Mutabal",
    "url": "http://www.epicurious.com/recipes/food/views/mutabal-51231810"
}
