{
    "directions": [
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.",
        "Place green bell pepper on the prepared baking sheet.",
        "Broil bell pepper in the oven, turning every 5 minutes, until skin is blackened and bubbling, about 20 minutes. Transfer roasted pepper to a resealable plastic bag; seal and set aside.",
        "Heat a Dutch oven over medium-high heat. Cook and stir ground beef and ground sausage in the hot Dutch oven until browned and crumbly, 5 to 7 minutes; drain and discard grease. Transfer ground meat to a bowl.",
        "Heat olive oil in the same Dutch oven over medium-low heat; cook and stir onions and garlic in the hot oil until onions are translucent, 5 to 10 minutes.",
        "Carefully remove roasted pepper from the plastic bag and peel off the blackened layer; chop the pepper. Add chopped bell pepper, ground meat mixture, chili beans, coffee, green chiles, cocoa powder, cumin, and chili powder to the onion mixture; stir well. Simmer, stirring frequently, until warmed, about 5 minutes.",
        "Stir crushed tomatoes and water into chili; season with salt. Bring to boil. Cover Dutch oven, reduce heat, and simmer, stirring occasionally, until flavors have blended, at least 30 minutes. Remove cover and simmer until chili is thickened, about 30 more minutes."
    ],
    "ingredients": [
        "1 green bell pepper",
        "1 pound ground beef sirloin",
        "1 pound ground salsiccia sausage",
        "1 tablespoon olive oil",
        "2 onions, diced",
        "6 cloves garlic, minced",
        "2 (15 ounce) cans chili beans, undrained",
        "1 cup brewed coffee",
        "1 (7 ounce) can diced green chiles",
        "5 tablespoons unsweetened cocoa powder",
        "1/4 cup ground cumin",
        "1/4 cup chili powder",
        "1 (28 ounce) can canned crushed tomatoes",
        "1 cup water, or as needed",
        "salt to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "My Best Kid-Friendly Chili",
    "url": "http://allrecipes.com/recipe/232255/my-best-kid-friendly-chili/"
}
