{
    "directions": [
        "If using a 12-quart pot, combine 4 quarts of water in the pot with the salt, lemon, honey, thyme, parsley, bay leaves, garlic, and peppercorns. Cover and bring to a boil. Stir until salt is dissolved, then remove from the heat. Transfer brine to 20-quart food-safe container, and add 6 quarts of ice water. Let cool completely.",
        "If using a 20-quart pot, combine 4 quarts of water in the pot with the salt, lemon, honey, thyme, parsley, bay leaves, garlic, and peppercorns. Cover and bring to a boil. Stir until salt is dissolved, then remove from the heat and add 6 quarts of ice water. Let cool completely.",
        "Lower the turkey into the brine and refrigerate for 24 hours.",
        "After 24 hours, remove the turkey from the brine, pat dry, and place on a rimmed baking sheet, breast-side up, to air dry for a minimum of 24 hours in the refrigerator. Once the turkey is dried, it is ready to roast.",
        "Preheat the oven to 450°F with the rack in the lower third of the oven. Remove the turkey from the refrigerator 1 hour before roasting.",
        "In a medium saucepan, melt the butter over low heat. Remove and let stand 3 minutes. Skim off the froth and discard. Slowly pour butter into a medium bowl, leaving milky solids behind in the pot. Discard solids and reserve clarified butter in bowl.",
        "Place the vegetables in the roasting pan and toss with oil. Place roasting rack on top of vegetables. Stuff the cavity of the bird with the rosemary, thyme, bay leaves, and garlic, and tie the legs together with kitchen twine. Place the air-dried turkey on the roasting rack, breast side up.",
        "Brush the turkey skin with the clarified butter and season the skin generously with salt. Roast the turkey for 1 hour. Rotate the pan and cook until a thermometer inserted into the thickest part of the thigh reaches 150°F, 1 to 1 1/2 hours more.",
        "Allow the turkey to rest at room temperature for 30 minutes before carving. This will allow the juices to be locked in and the turkey to carry over to an internal temperature of 165°F."
    ],
    "ingredients": [
        "1 1/2 cups kosher salt",
        "5 lemons, cut in half",
        "1/2 cup honey",
        "1 bunch thyme",
        "1 bunch parsley",
        "2 bay leaves",
        "2 garlic heads, sliced in half crosswise",
        "3 tablespoons whole black peppercorns",
        "6 quarts ice water",
        "18- to 20-pound turkey, thawed if frozen",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut in pieces",
        "4 medium yellow onions, peeled and cut into 2-inch wedges",
        "6 medium carrots, cut into 2-inch pieces",
        "4 celery ribs, cut into 2-inch pieces",
        "3 tablespoons canola oil",
        "3 tablespoons kosher salt",
        "1 bunch rosemary",
        "1 bunch thyme",
        "2 bay leaves",
        "1 garlic head, sliced in half crosswise",
        "12-quart pot and a 20-quart food-safe container (or a 20-quart pot)",
        "large roasting pan with rack",
        "kitchen twine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Thyme"
    ],
    "title": "My Favorite Roast Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/my-favorite-roast-turkey-51258050"
}
