{
    "directions": [
        "Bring 2 1/2 cups water to a boil in a saucepan; add rice and stir. Reduce heat, cover, and simmer until the rice is tender, 20 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C). Drizzle olive oil in a 9x13-inch casserole dish.",
        "Fill a separate saucepan with water and bring to a boil; add green bell peppers and simmer for 3 minutes. Transfer peppers to a bowl of ice water until peppers are cooled. Arrange peppers in the prepared casserole dish.",
        "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Return skillet to heat; mix onion and cooked rice into ground beef. Pour tomato sauce into ground beef mixture and stir to combine.",
        "Mix garlic, coriander, cumin, cayenne pepper, salt, and black pepper into ground beef mixture. Simmer until flavors have combined, 10 minutes. Remove from heat and spoon 2 to 3 tablespoons ground beef mixture into each bell pepper half. Sprinkle mozzarella cheese over each filled pepper. Cover casserole dish with aluminum foil.",
        "Bake in the preheated oven for 15 minutes. Remove aluminum foil and continue to bake until cheese is bubbling and melted, about 15 more minutes."
    ],
    "ingredients": [
        "2 1/2 cups water",
        "1 cup brown rice",
        "1 teaspoon olive oil, or as needed",
        "6 large green bell peppers, halved and seeded",
        "1 1/2 pounds lean ground beef",
        "1 onion, diced",
        "1 (15 ounce) can tomato sauce",
        "2 cloves garlic, minced",
        "1 teaspoon ground coriander",
        "1 teaspoon ground cumin",
        "1 teaspoon ground cayenne pepper",
        "salt and ground black pepper to taste",
        "2 cups finely shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "My Favorite Stuffed Green Peppers",
    "url": "http://allrecipes.com/recipe/231272/my-favorite-stuffed-green-peppers/"
}
