{
    "directions": [
        "Put the chickpeas in a large bowl and add enough cold water to cover them by at least 2 inches. Let soak overnight, then drain. Or use canned chickpeas, drained.",
        "Place the drained, uncooked chickpeas and the onions in the bowl of a food processor fitted with a steel blade. Add the parsley, cilantro, salt, hot pepper, garlic, and cumin. Process until blended but not pureed.",
        "Sprinkle in the baking powder and 4 tablespoons of the flour, and pulse. You want to add enough bulgur or flour so that the dough forms a small ball and no longer sticks to your hands. Turn into a bowl and refrigerate, covered, for several hours.",
        "Form the chickpea mixture into balls about the size of walnuts, or use a falafel scoop, available in Middle-Eastern markets.",
        "Heat 3 inches of oil to 375ºF in a deep pot or wok and fry 1 ball to test. If it falls apart, add a little flour. Then fry about 6 balls at once for a few minutes on each side, or until golden brown. Drain on paper towels. Stuff half a pita with falafel balls, chopped tomatoes, onion, green pepper, and pickled turnips. Drizzle with tahina thinned with water.",
        "NOTE: Egyptians omit the cilantro and substitute fava beans for the chickpeas.",
        "Tahina (also called tahini) is an oily paste made from ground sesame seeds. It is available in Middle Eastern markets and at www.ethnicgrocer.com.\nTo garnish your falafel in true Israeli style, try adding one or several of the following condiments: harissa hot sauce, pickled turnip (both also available at www.ethnicgrocer.com), mango amba (pickle), or sauerkraut."
    ],
    "ingredients": [
        "1 cup dried chickpeas",
        "1/2 large onion, roughly chopped (about 1 cup)",
        "2 tablespoons finely chopped fresh parsley",
        "2 tablespoons finely chopped fresh cilantro",
        "1 teaspoon salt",
        "1/2-1 teaspoon dried hot red pepper",
        "4 cloves of garlic",
        "1 teaspoon cumin",
        "1 teaspoon baking powder",
        "4-6 tablespoons flour",
        "Soybean or vegetable oil for frying",
        "Chopped tomato for garnish",
        "Diced onion for garnish",
        "Diced green bell pepper for garnish",
        "Tahina sauce",
        "Pita bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Side",
        "Fry",
        "Vegetarian",
        "Chickpea",
        "Deep-Fry",
        "Kosher",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "My Favorite Falafel",
    "url": "http://www.epicurious.com/recipes/food/views/my-favorite-falafel-231755"
}
