{
    "directions": [
        "Use a mortar and pestle to pound all the dressing ingredients until smooth, pounding each ingredient thoroughly before adding the next. taste and add more fish sauce, lime juice, chili, and/or palm sugar if you want. The flavor's up to you.",
        "1. Heat a grill pan, cast-iron skillet, or grill until very hot. Cut the long beans into a manageable size for your pan, if necessary, then char the beans well on all sides, about 4 minutes total. Transfer them to a bowl, cover it tightly with plastic wrap, and let them steam for about 10 minutes. Cut the beans into 1/2-inch pieces and return them to the bowl.",
        "2. Tear the basil and mint leaves. Toss together the long beans with the papaya, cucumber, mango, pineapple, long red chilies, herbs, and the dressing. If you have a large enough mortar or want to work in batches and take the time to make the salad even better, pound the ingredients with the dressing just to bruise them and further infuse the ingredients with the flavor of the dressing. transfer the dressed salad to a serving bowl and sprinkle with the crushed peanuts."
    ],
    "ingredients": [
        "1 tablespoon fresh cilantro root (4 roots), rinsed, scraped, and rinsed again",
        "1 tablespoon minced peeled fresh ginger",
        "1 fresh Thai bird chili, or more to taste",
        "1/2 teaspoon minced garlic",
        "1/2 teaspoon minced shallot",
        "2 tablespoons palm or brown sugar, or more to taste",
        "1 tablespoon fish sauce, or more to taste",
        "Juice of 3 limes, or more to taste",
        "4 Chinese long beans, trimmed",
        "1 cup loosely packed fresh Thai basil leaves",
        "1 cup loosely packed fresh Vietnamese mint (rau ram) leaves",
        "2 cups julienned peeled green (unripe) papaya",
        "2 cups julienned peeled cucumber",
        "1 cup julienned peeled green (unripe) mango",
        "2 cups julienned peeled ripe mango",
        "3/4 cup 1/2-inch-thick pineapple batons (size of a lady's pinkie)",
        "3/4 cup julienned fresh long red chilies, such as Anaheim or Hungarian Wax",
        "3/4 cup lightly crushed salted roasted peanuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Fruit",
        "Tropical Fruit",
        "Mango",
        "Papaya",
        "Pineapple",
        "Mint",
        "Basil",
        "Peanut",
        "Cucumber",
        "Summer",
        "Healthy",
        "Chile Pepper"
    ],
    "title": "My Green Papaya Salad",
    "url": "http://www.epicurious.com/recipes/food/views/my-green-papaya-salad-395609"
}
