{
    "directions": [
        "Bring a large pot of water to a boil over high heat. Turn off heat and drop in rice noodles. Allow them to soften, about 10 minutes. Drain noodles in a colander and set aside.",
        "Whisk together fish sauce, honey, soy sauce, lime juice, rice vinegar, chili garlic sauce, ketchup, chili oil, sesame oil, and garlic in a bowl.",
        "Heat a nonstick skillet over medium heat and scramble eggs. Remove and set aside.",
        "Heat vegetable oil in a large skillet over medium heat. Cook and stir shrimp until pink but not opaque, 3 to 4 minutes (they will finish cooking when returned to the skillet). Season shrimp with salt and ground black pepper and set aside.",
        "Cook and stir onions and celery in the skillet just until tender, about 2 minutes.",
        "Stir cabbage and drained rice noodles into the skillet and continue cooking until cabbage is tender, about 2 minutes. Pour in chicken stock as needed to keep noodles from getting dry.",
        "Stir scrambled eggs, shrimp, salt, and ground black pepper into noodle mixture and gently toss to coat.",
        "Pour sauce over the noodles and toss gently to combine. Continue cooking until shrimp are fully cooked, 2 to 5 minutes.",
        "Remove from heat and toss cilantro, peanuts, and red chiles into noodles."
    ],
    "ingredients": [
        "1 (8 ounce) package dried wide rice noodles",
        "1/4 cup fish sauce",
        "1/4 cup honey",
        "3 tablespoons soy sauce",
        "1 lime, juiced",
        "2 tablespoons rice vinegar",
        "2 tablespoons chili garlic sauce",
        "1 tablespoon ketchup",
        "1 tablespoon chili oil",
        "1 tablespoon sesame oil",
        "1 tablespoon minced garlic",
        "4 eggs",
        "2 tablespoons vegetable oil",
        "20 extra large shrimp, peeled and deveined",
        "salt and ground black pepper to taste",
        "1 cup thinly sliced onion",
        "1 cup thinly sliced celery",
        "2 cups napa cabbage, sliced into 2 inch strips",
        "1/2 cup chicken stock",
        "1 cup chopped fresh cilantro (optional)",
        "1/2 cup chopped peanuts (optional)",
        "1 hot red chile pepper, sliced (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "My Husband's Pad Thai Noodles",
    "url": "http://allrecipes.com/recipe/220253/my-husbands-pad-thai-noodles/"
}
