{
    "directions": [
        "1. Preheat the oven to 350°F.",
        "2. Put the beef, veal, and pork into a bowl and kneed them together.",
        "3. Pour the milk into a bowl and soak the bread in it, squeezing it into a paste. Add the soaked bread to the bowl with the meat and work them together as though you were kneading dough. Add the cheese, garlic, onion, eggs, oregano, and parsley. Season with salt and pepper and knead again until well incorporated.",
        "4. Oil a large roasting pan with the olive oil. Form the meat mixture into a large loaf in the center of a roasting pan.",
        "5. Stir in the plum tomatoes, tomato paste, and 1 cup water together in a bowl and pour the mixture evenly over the meatloaf. Scatter the carrots and celery in the pan around the loaf.",
        "6. Put the pan in the oven and bake until a skewer inserted in the center of the loaf comes out warm, about 1 1/2 hours. If the loaf begins to look dry while cooking, tent it with aluminum foil. Remove the pan from the oven and let it cool slightly.",
        "7. Slice the meatloaf into servings, put 1 serving on each plate and spoon pan gravy and vegetables over and around the meatloaf.",
        "You can make the loaf with beef and veal only, or with just beef.",
        "Lay some raw bacon strips over the loaf before baking. (This was one way my mother made her meatloaf extra special.)",
        "Add some sautéed mushrooms to the pan during the last 20 minutes of cooking."
    ],
    "ingredients": [
        "1 pound ground beef",
        "1 pound ground pork",
        "1 pound ground veal",
        "1 cup milk",
        "1 cup bread cubes (3 or 4 slices Italian country bread, crusts removed)",
        "1/2 cup finely grated pecorino Romano",
        "2 tablespoons minced garlic",
        "1 onion, cut into small dice",
        "2 eggs",
        "2 tablespoons dried oregano",
        "1/2 cup chopped flatleaf parsley",
        "Fine sea salt and freshly ground black pepper",
        "Olive oil, for greasing",
        "1 cup canned plum tomatoes, crushed",
        "2 tablespoons tomato paste",
        "1 medium carrot, diced",
        "1 stalk celery, diced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pork",
        "Bake",
        "Kid-Friendly",
        "Dinner",
        "Meat",
        "Ground Beef",
        "Veal",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "My Mother's Italian-American Meatloaf",
    "url": "http://www.epicurious.com/recipes/food/views/my-mothers-italian-american-meatloaf-232204"
}
