{
    "directions": [
        "Soak bread slices in warm water in a bowl for 5 minutes; squeeze bread dry and transfer to a large bowl.",
        "Melt butter in a skillet over medium heat; cook and stir onion and garlic in hot butter until onion is translucent, about 5 minutes. Add onion and garlic to bread. Stir 1 1/2 cup mozzarella cheese, eggs, Parmesan cheese, and Italian seasoning into bread and onions until thoroughly combined. Crumble ground beef into mixture; mix until thoroughly combined. Season with salt and black pepper.",
        "Form ground beef mixture into 1-inch meatballs. Heat vegetable oil in a large skillet over medium heat. Pan-fry meatballs until browned, working in batches if necessary, about 10 minutes, turning often. Set meatballs aside.",
        "Bring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Combine prepared spaghetti sauce, tomato paste, and Cheddar cheese soup in a bowl. Combine ricotta cheese, cottage cheese, 2 cups mozzarella cheese, and parsley in a separate bowl.",
        "Spread 1 cup of sauce mixture into the bottom of a 9x13-inch baking dish. Layer 1/3 the lasagna noodles over the sauce, overlapping if necessary. Arrange meat balls over noodles. Place 1/3 the lasagna noodles over meat balls, and spread with cheese mixture in an even layer. Top cheese layer with remaining 1/3 the lasagna noodles and spread remaining sauce over top layer of noodles. Sprinkle top with 1 cup mozzarella cheese.",
        "Bake lasagna in the preheated oven until casserole is bubbling and the topping is melted, about 1 hour."
    ],
    "ingredients": [
        "Meatballs:",
        "4 slices day-old bread",
        "1 cup warm water",
        "1/4 cup butter",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1 1/2 cups shredded mozzarella cheese",
        "4 eggs",
        "1/4 cup grated Parmesan cheese",
        "1 tablespoon Italian seasoning",
        "2 pounds ground beef",
        "salt and ground black pepper to taste",
        "2 tablespoons vegetable oil",
        "1 (12 ounce) package lasagna noodles",
        "Sauce:",
        "1 (24 ounce) jar prepared spaghetti sauce (such as Prego®)",
        "1 (12 ounce) can tomato paste",
        "1 (10.75 ounce) can condensed Cheddar cheese soup",
        "Cheese Mixture:",
        "1 (15 ounce) container ricotta cheese",
        "1 (12 ounce) container cottage cheese",
        "2 cups shredded mozzarella cheese",
        "3 tablespoons chopped fresh parsley",
        "1 cup shredded mozzarella cheese, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "My Meatball Lasagna",
    "url": "http://allrecipes.com/recipe/230570/my-meatball-lasagna/"
}
