{
    "directions": [
        "Preheat oven to 375°F.",
        "In a Dutch oven or other heavy baking pan large enough to hold brisket heat 1 tablespoon oil in oven 10 minutes. Pat brisket dry and season with salt and pepper. Roast brisket in pan, uncovered, 30 minutes.",
        "While brisket is roasting, in a large heavy skillet cook onions in remaining 2 tablespoons oil over moderately high heat, stirring, until softened and beginning to turn golden. Reduce heat and cook onions, stirring occasionally and reducing heat if necessary, until deep golden, about 20 minutes more. Stir in garlic, paprika, salt, and pepper and cook 1 minute. Stir in 3 cups water and bring to a boil.",
        "Spoon onion mixture over brisket and bake, covered, with lid 1/2 inch ajar, 3 1/2 hours, or until brisket is tender. (Check pan every hour and if necessary add more water.) Remove brisket from oven and let cool in onion mixture 1 hour.",
        "Remove brisket from pan, scraping onion mixture back into pan, and chill, wrapped in foil, overnight. Spoon onion mixture into a 1-quart measure and chill, covered, overnight.",
        "Preheat oven to 350°F.",
        "Discard fat from onion mixture, add enough water to mixture to measure 3 cups total, and in a blender blend gravy until smooth. Slice brisket against the grain (thick or thin, as you prefer). In a large ovenproof skillet heat gravy until hot, add brisket, and heat in oven 30 minutes."
    ],
    "ingredients": [
        "a 5- to 6-pound first-cut beef brisket",
        "3 tablespoons vegetable oil",
        "3 large yellow onions, cut into 1/2-inch pieces (about 5 cups or 3 pounds)",
        "2 or 3 large garlic cloves, or to taste, minced",
        "1 teaspoon paprika, preferably Hungarian",
        "3/4 teaspoon salt",
        "3/4 teaspoon freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Roast",
        "Hanukkah",
        "Low/No Sugar",
        "Purim",
        "Rosh Hashanah/Yom Kippur",
        "Winter",
        "Kosher",
        "Gourmet"
    ],
    "title": "My Mother's Brisket",
    "url": "http://www.epicurious.com/recipes/food/views/my-mothers-brisket-13482"
}
