{
    "directions": [
        "Pour 1/2 cup of warm water into a small bowl, and stir in the yeast and 1 teaspoon of sugar. Allow the yeast mixture to stand until it forms a creamy foam layer on top, 5 to 10 minutes.",
        "Place milk and vegetable shortening into a small saucepan over medium-low heat and cook until the shortening has melted and the milk has tiny bubbles around the edge. Remove from heat.",
        "Place 1/4 cup of sugar and the salt into the work bowl of a large stand mixer and pour the milk and shortening into the bowl. Mix on low speed just to dissolve sugar; and allow mixture to stand until warm.",
        "Beat in the yeast mixture, eggs, and 1 cup of flour on low speed until smooth. Gradually beat in remaining flour to make a soft dough.",
        "Continue beating the dough on low speed until dough leaves the sides of the bowl, 2 to 3 minutes.",
        "Turn the dough out onto a well-floured work surface and knead until smooth and elastic, 2 or 3 more minutes.",
        "Form the dough into a ball and place into a large greased bowl. Grease the top of the dough, and cover the bowl with waxed paper. Set the bowl into a warm place; let the dough rise until doubled in size, 1 to 1 1/2 hours.",
        "Punch down the dough and roll out on a floured work surface to 1/2 inch thick. Cut doughnuts out of the dough with a 3 1/2-inch round doughnut cutter with a 1-inch smaller cutter in the center. Let the doughnuts rise on the work surface until very light and fluffy, 40 minutes to 1 hour.",
        "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).",
        "Gently pick up and drop the doughnuts into the hot oil, working in small batches of 2 or 3 at a time, and cook until the doughnuts are light golden brown, turning once, about 2 minutes.",
        "Drain the doughnuts on paper towels to absorb oil.",
        "In a bowl, mix 1 tablespoon of warm water and vanilla extract, and stir in the confectioners' sugar to make a glaze. Spread a thin layer of glaze over the warm doughnuts."
    ],
    "ingredients": [
        "1/2 cup warm water (100 to 110 degrees F/40 to 45 degrees C)",
        "2 (.25 ounce) packages active dry yeast",
        "1 teaspoon white sugar",
        "3/4 cup milk, lukewarm",
        "1/3 cup vegetable shortening",
        "1/4 cup white sugar",
        "1 teaspoon salt",
        "2 eggs",
        "4 cups sifted all-purpose flour",
        "2 quarts vegetable oil for frying",
        "1 tablespoon warm water",
        "1/2 teaspoon vanilla extract",
        "1 cup confectioners' sugar, sifted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "My Mom's Raised Doughnuts",
    "url": "http://allrecipes.com/recipe/219912/my-moms-raised-doughnuts/"
}
