{
    "directions": [
        "Mix the strawberries, rhubarb, brown sugar, 1/2 cup of white sugar, cinnamon, allspice, cornstarch, and flour into a bowl; stir until the flour and cornstarch are smoothly combined. Let the filling stand for 30 minutes. If the filling is very juicy, add an additional tablespoon of cornstarch.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Divide the pie pastry in half; roll out half into a circle on a floured work surface, and line a 9-inch pie dish with bottom crust. Roll the remaining half out into a 10-inch circle on a floured work surface, and set aside.",
        "Pour the filling into the crust-lined pie dish. Scatter diced butter over the top.",
        "Cut the remaining crust into 3/4-inch wide strips (use a scalloped edge pastry cutter for a prettier crust). Moisten the rim of the filled bottom crust with a bit of water, and lay the two longest strips in a cross in the middle of the pie. Working from the next longest down to the shortest strips, alternate horizontal and vertical strips, weaving the strips as you go. Press the lattice strips down onto the bottom crust edge to seal, and trim the top crust strips neatly. Brush the crust with milk, and sprinkle with 1 tablespoon of sugar. Cover pie edges with aluminum foil strips.",
        "Bake pie in preheated oven for 15 minutes; lower temperature to 375 degrees F (190 degrees C), and bake until the filling is bubbling and the crust is golden brown, about 40 minutes. Remove aluminum foil about 15 minutes before end of baking. Turn off oven, and allow pie to rest for 15 minutes with the door open, and 15 more minutes with the door closed. Allow to cool completely on wire rack for several hours or overnight; filling will thicken as it sits."
    ],
    "ingredients": [
        "3 cups strawberries, cut into 1/2-inch pieces",
        "3 cups chopped rhubarb",
        "1/2 cup brown sugar",
        "1/2 cup white sugar",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground allspice",
        "1 tablespoon cornstarch, or as needed",
        "1/4 cup all-purpose flour",
        "1 tablespoon butter, diced",
        "1 recipe pastry for a 9 inch double crust pie",
        "1 tablespoon milk",
        "1 tablespoon white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "My Own Strawberry Rhubarb Pie",
    "url": "http://allrecipes.com/recipe/216988/my-own-strawberry-rhubarb-pie/"
}
