{
    "directions": [
        "Remove fat, kidneys, and liver from rabbit if necessary. Pat rabbit dry and season with salt and pepper. Heat oil and 1/2 tablespoon butter in a wide 6-quart heavy pot over moderately high heat until foam subsides, then brown rabbit in 2 batches, 2 to 3 minutes per side. Transfer as browned to a plate. Add wine to pot and boil 30 seconds. Add broth and deglaze pot by boiling, scraping up brown bits. Mince and mash garlic with thyme and salt and stir into broth with bay leaf and rabbit. Simmer, covered, 40 minutes.",
        "While rabbit is simmering, quarter onions lengthwise, leaving enough of core intact to keep layers together. Soak leeks in a large bowl of water 10 minutes, agitating occasionally to dislodge any sand and letting sand sink to bottom of bowl. Lift leeks out of water.",
        "Scatter onions, leeks, carrots, and potatoes over and around rabbit and continue to simmer, covered, until rabbit and vegetables are tender, 40 to 50 minutes.",
        "When rabbit is almost done, cook beans in a large pot of boiling salted water until just tender, 3 to 5 minutes, and drain in a colander.",
        "Stir beans into ragout, then transfer rabbit and vegetables with a slotted spoon to a deep platter and keep warm. Boil cooking liquid until reduced to about 3/4 cup and whisk in remaining 1/2 tablespoon butter. Pour some of sauce over rabbit and vegetables and serve the rest on the side."
    ],
    "ingredients": [
        "1 (3-pound) rabbit (thawed if frozen), cut into 8 serving pieces",
        "1 tablespoon unsalted butter",
        "1/4 cup dry white wine",
        "2 cups fat-free chicken broth",
        "2 tablespoons chopped garlic",
        "1/2 tablespoon fresh thyme",
        "1 teaspoon kosher salt",
        "1 bay leaf (not California)",
        "4 small (2-inch) red onions (1/2 pound total)",
        "3 large leeks, white and pale green parts only, cut into 1/2-inch-thick rounds",
        "3 large carrots, cut diagonally into 1/2-inch-thick slices",
        "1/2 pound small (1-inch) boiling potatoes (about 8)",
        "1/2 pound haricots verts or regular green beans, cut diagonally into 2-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Stew",
        "Rabbit",
        "Leek",
        "Green Bean",
        "Carrot",
        "White Wine",
        "Fall",
        "Simmer",
        "Gourmet"
    ],
    "title": "Rabbit, Carrot, Leek, and Green Bean Ragoût",
    "url": "http://www.epicurious.com/recipes/food/views/rabbit-carrot-leek-and-green-bean-ragout-104272"
}
