{
    "directions": [
        "Place the plums, pineapple, apple juice, orange juice concentrate, and lemon juice into a large pot over medium-low heat, cover, and cook until the plums are soft, 15 to 20 minutes. Mash the plums and pineapple with a potato masher until thoroughly broken up, but leave small chunks of fruit in the mixture. With the fruit mixture at a slow simmer, stir in the cloves, allspice, pectin, and butter (to reduce foaming). Raise heat to high and bring the mixture to a full, rolling boil for 1 minute, stirring constantly. Mix in the sugar, stirring constantly, and cook for 1 more minute at a full, rolling boil. Remove from heat, stir in red food coloring until even in color, and skim off any foam.",
        "Sterilize 12-ounce canning jars and lids in boiling water for at least 5 minutes. Pack the plum jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "10 red plums, pitted and chopped",
        "2 cups chopped fresh pineapple",
        "1/2 cup apple juice",
        "1/2 (12 fluid ounce) can frozen orange juice concentrate",
        "1 lemon, juiced",
        "1 1/2 teaspoons ground cloves",
        "1 teaspoon ground allspice",
        "1 (1.75 ounce) package powdered fruit pectin",
        "1 tablespoon butter",
        "8 cups white sugar",
        "4 drops red food coloring"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rachel's Sugar Plum Spice Jam",
    "url": "http://allrecipes.com/recipe/215135/rachels-sugar-plum-spice-jam/"
}
