{
    "directions": [
        "Bring vermouth and raisins to a boil in a small saucepan, then remove from heat and let steep until raisins are soft and plump, about 15 minutes.",
        "Cook onion in oil in a large heavy skillet over medium-low heat, stirring occasionally, until onion is tender but not browned, 5 to 8 minutes. Add chard, raisins with any remaining vermouth, 1/2 teaspoon salt, and 1/4 teaspoon pepper and cook over medium heat, turning chard constantly with tongs, until chard is tender and liquid has evaporated, about 12 minutes. Transfer to a bowl and stir in nuts, then cool.",
        "Cutting as close to bones as possible, make 1 long incision to separate meat of each rack from bones, stopping 1/2 inch from bottom (do not cut all the way through). Roll meat away from bones to create a long opening, then season inside with salt and pepper and fill with stuffing. Roll meat back over stuffing, then tie meat to bones with string (between every 2 ribs).",
        "Preheat oven to 400°F with rack in middle.",
        "Stir together mustard, thyme, and rosemary and spread over both sides of each rack. Put racks of lamb in a large shallow heavy baking pan, pairing racks so that they stand up with their bones interlocking but leaving space between them at base.",
        "Roast lamb until an instant-read thermometer inserted into center of meat (do not touch bone) registers 130°F for medium-rare, 25 to 35 minutes. Let stand, loosely covered, 15 minutes.",
        "Cut each rack into 4 double chops, discarding string, and serve on top of roasted red peppers."
    ],
    "ingredients": [
        "1/2 cup sweet (red) vermouth",
        "1/2 cup golden raisins",
        "1 medium onion, chopped",
        "2 tablespoons extra-virgin olive oil",
        "2 large bunches green Swiss chard (1 pound total), stems and center ribs reserved for another use and leaves coarsely chopped",
        "2 tablespoons pine nuts, toasted",
        "4 (8-rib) frenched racks of lamb (each about 1 1/2 pound), trimmed of all but a thin layer of fat",
        "1/2 cup Dijon mustard",
        "2 teaspoons finely chopped thyme",
        "1 teaspoon finely chopped rosemary",
        "Equipment: kitchen string",
        "Accompaniment: roasted red peppers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Roast",
        "Easter",
        "Mother's Day",
        "Dinner",
        "Raisin",
        "Rosemary",
        "Rack of Lamb",
        "Pine Nut",
        "Spring",
        "Chard",
        "Gourmet",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Rack of Lamb with Swiss Chard",
    "url": "http://www.epicurious.com/recipes/food/views/rack-of-lamb-with-swiss-chard-241737"
}
