{
    "directions": [
        "Cook onions in a large saucepan of boiling salted water until tender, 5-8 minutes; drain and let cool. Trim root ends and peel.",
        "Preheat oven to 425°F. Season lamb with salt and black pepper. Heat 1 tablespoon oil in a 12\" ovenproof skillet over medium-high heat. Cook lamb until browned, 5-8 minutes per side. Add onions and turnips to skillet, season with salt and black pepper, and toss to coat in pan drippings.",
        "Transfer skillet to oven and roast until vegetables are tender and browned and an instant-read thermometer inserted into the thickest part of lamb registers 125°F for medium-rare, 15-20 minutes. Transfer lamb to a cutting board; let rest 10 minutes.",
        "Meanwhile, coarsely chop cilantro and 2 cups mint. Place in a medium bowl; add shallot, garlic, lemon juice, Aleppo pepper, if using, 2 tablespoons vinegar, and remaining 1 cup oil. Season salsa verde with salt, black pepper, and more vinegar, if desired.",
        "Transfer vegetables to a medium bowl; toss with remaining 1/2 cup mint leaves and 1 tablespoon vinegar. Slice lamb between ribs and serve with vegetables and salsa verde."
    ],
    "ingredients": [
        "1 pound small cipolline or pearl onions",
        "Kosher salt",
        "2 racks of lamb (3-3 1/2 pounds total), rib bones frenched, left at room temperature for 1 hour",
        "Freshly ground black pepper",
        "1 tablespoon plus 1 cup olive oil",
        "1 pound baby turnips, stems trimmed, halved or quartered if large",
        "1 cup (packed) fresh cilantro leaves",
        "2 1/2 cups (packed) fresh mint leaves, divided",
        "1 small shallot, finely chopped",
        "1 garlic clove, finely grated",
        "1 tablespoon fresh lemon juice",
        "2 teaspoons Aleppo pepper or 1/2 teaspoon crushed red pepper flakes (optional)",
        "3 tablespoons (or more) red wine vinegar, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Roast",
        "Easter",
        "Dinner",
        "Mint",
        "Turnip",
        "Spring",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Rack of Lamb with Baby Turnips and Mint Salsa Verde",
    "url": "http://www.epicurious.com/recipes/food/views/rack-of-lamb-with-baby-turnips-and-mint-salsa-verde-51154970"
}
