{
    "directions": [
        "Heat oil in medium saucepan over medium-high heat. Add onion and sauté until translucent, about 2 minutes. Add garlic and sauté 1 minute. Add pecans, 4 cups water, and cilantro. Boil 10 minutes. Mix in chipotle chiles and adobo sauce. Remove cilantro. Puree mixture in blender. Return to saucepan and boil until reduced to 1 1/2 cups, about 20 minutes. Season sauce with salt. (Can be made 1 day ahead. Cover and chill. Reheat before using.)",
        "Preheat oven to 350°F. Toast chile seeds in large skillet over medium-high heat, shaking pan constantly, until aromatic, about 3 minutes. Transfer seeds to spice grinder. Add spices; grind very finely. Sprinkle lamb with salt and coat with spice mixture. Place lamb, bone side down, on heavy rimmed baking sheet. Roast lamb until thermometer inserted into thickest part of meat registers 125°F for medium-rare, about 25 minutes. Let lamb stand 5 minutes. Cut into chops; top with sauce and serve.",
        "*Mexican cinnamon sticks with a delicate, floral flavor."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1/2 small white onion, chopped",
        "1 garlic clove, chopped",
        "1/2 cup chopped pecans",
        "4 cups water",
        "8 fresh cilantro sprigs",
        "1 teaspoon finely chopped canned chipotle chiles plus 2 tablespoons adobo sauce",
        "1/4 cup chile seeds (from any dried but not smoked chile, such as ancho or pasilla)",
        "3/4 teaspoon aniseed",
        "1/2 teaspoon ground allspice",
        "1 (1-inch piece) canela* or cinnamon stick",
        "2 whole cloves",
        "2 (1 1/4- to 1 1/2-pound) racks of lamb, fat trimmed, frenched (trimmed between bones)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Low Carb",
        "Low/No Sugar",
        "Rack of Lamb",
        "Pecan",
        "Spice",
        "Hot Pepper",
        "Spring",
        "Anise",
        "Cinnamon"
    ],
    "title": "Rack of Lamb with Pecan-Chipotle Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/rack-of-lamb-with-pecan-chipotle-sauce-108052"
}
