{
    "directions": [
        "Combine first 6 ingredients in medium bowl. Season with salt and pepper. (Can be prepared 1 day ahead. Cover tightly and refrigerate.)",
        "Preheat oven to 450°F.",
        "Fill medium bowl with cold water; squeeze in juice of half a lemon. Cut end off stem of 1 artichoke and rub with lemon. Starting from base, bend each leaf back and snap off at natural break until half of length of exposed leaves is light green. Cut off top dark green part of leaves. Trim all dark green areas off artichoke. Rub with lemon. Cut in quarters lengthwise. Cut out any choke and red-tipped leaves and discard. Place in bowl of lemon water. Repeat with remaining artichokes.",
        "Place 1 tablespoon oil in medium baking pan and place in oven to heat. Drain artichokes and place in another medium baking pan. Add potatoes, 1 tablespoon olive oil and 1 1/2 tablespoons lemon juice to artichokes. Season with salt and pepper. Season lamb with salt and pepper. Place lamb fat side down in baking pan with heated oil. Place vegetables and lamb in oven. Roast 15 minutes. Reduce oven temperature to 375°F and roast 5 minutes.",
        "Remove lamb and vegetables from oven. Spoon 3 tablespoons lamb dripping onto vegetables and mix. Return vegetables to oven. Spread 1 tablespoon mustard over bone side and ends of lamb; press half of breadcrumb mixture into mustard. Turn lamb and spread 1 tablespoon mustard over fat side of lamb; press in remaining crumbs. Return lamb to oven. Continue roasting lamb and vegetables until thermometer inserted into center of lamb registers 130°F for medium-rare and vegetables are just tender, stirring vegetables occasionally, 15 minutes.",
        "Let lamb stand 10 minutes. Slice into chops. Divide between plates, crossing bones in center. Spoon vegetables onto plates and serve."
    ],
    "ingredients": [
        "1 cup fresh breadcrumbs (preferably French bread)",
        "2 tablespoons minced fresh parsley",
        "2 tablespoon minced green onion",
        "2 tablespoons olive oil",
        "2 tablespoon lightly toasted pine nuts",
        "1 tablespoon minced fresh mint",
        "Salt and freshly ground pepper",
        "1 lemon, halved",
        "4 baby artichokes",
        "2 tablespoons olive oil",
        "8 1- to 1 1/2-inch red new potatoes, halved",
        "1 1/2 tablespoons fresh lemon juice",
        "1 1/4- to 1 1/2-pound rack of lamb, fat trimmed to 1/4-inch thickness",
        "2 tablespoons Dijon mustard"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Potato",
        "Roast",
        "Christmas",
        "Easter",
        "Mint",
        "Rack of Lamb",
        "Artichoke",
        "Winter"
    ],
    "title": "Rack of Lamb with Artichokes, New Potatoes and Mint",
    "url": "http://www.epicurious.com/recipes/food/views/rack-of-lamb-with-artichokes-new-potatoes-and-mint-1148"
}
