{
    "directions": [
        "Heat 1 tablespoon oil in medium skillet over medium heat. Add chopped onion; sauté until translucent, about 7 minutes. Add sausages. Sauté until brown, breaking up with spoon, about 5 minutes. Using slotted spoon, transfer mixture to medium bowl, then add pears, pecans, currants, and chopped rosemary. Season with salt and pepper. (Can be made 4 hours ahead. Cover and chill.)",
        "Using long thin knife, make 1 cut through center of eye of venison. Rotate knife 90 degrees and insert again, creating an X through center. Insert handle of long wooden spoon through X; roll handle to create 1- to 2-inch-diameter cavity. Stuff with filling.",
        "Preheat oven to 425°F. Arrange sliced onions, garlic, and herbs in roasting pan. Toss with 3 tablespoons oil. Rub venison with remaining 1 tablespoon oil; sprinkle with salt and pepper. Heat large skillet over high heat. Add venison; cook until brown on all sides, about 5 minutes. Place venison atop vegetables in pan. Roast until thermometer inserted into center registers 120°F for rare, about 20 minutes. Let stand 10 minutes. Carve between bones; serve with vegetables."
    ],
    "ingredients": [
        "5 tablespoons olive oil, divided",
        "1 cup chopped onion",
        "4 ounces sweet Italian sausages, casings removed",
        "Roasted Bosc Pears",
        "1/2 cup pecans, toasted",
        "1/3 cup dried currants",
        "1 teaspoon chopped fresh rosemary",
        "1 2 1/2-pound rack of venison, frenched (8 bones)",
        "2 medium onions, thinly sliced",
        "2 heads of garlic, cloves separated, root ends trimmed, unpeeled",
        "6 fresh rosemary sprigs",
        "1 bunch fresh thyme"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Game",
        "Nut",
        "Roast",
        "Christmas",
        "Quick & Easy",
        "Currant",
        "Pear",
        "Venison",
        "Sausage",
        "Pecan",
        "Winter"
    ],
    "title": "Rack of Venison Stuffed with Pecans, Currants, Sausage, and Pears",
    "url": "http://www.epicurious.com/recipes/food/views/rack-of-venison-stuffed-with-pecans-currants-sausage-and-pears-233709"
}
