{
    "directions": [
        "Combine first 6 ingredients in food processor. Blend until garlic is finely chopped. Add 4 tablespoons oil and blend until coarse paste forms. Sprinkle each lamb rack generously with salt. Transfer half of herb paste to small bowl and reserve. Spread remaining half of herb paste over lamb racks. Arrange lamb on rimmed baking sheet. Let stand at room temperature 2 hours. (Can be made 1 day ahead. Cover lamb and reserved herb paste separately and chill. Bring both to room temperature before continuing.)",
        "Preheat oven to 450°F. Heat remaining 2 tablespoons oil in heavy large skillet over high heat. Place 1 lamb rack, meat side down, in skillet. Sear until golden, about 2 minutes; return to baking sheet, meat side up. Repeat with remaining lamb racks. Roast lamb until meat thermometer inserted into center of lamb registers 130°F for medium-rare, about 20 minutes. Transfer lamb to platter. Let stand 15 minutes. Mix any pan juices into reserved herb paste. Cut lamb between bones into individual chops. Serve with herb sauce.",
        "*A dried herb mixture available at specialty foods stores and in the spice section of some supermarkets. A combination of dried thyme, basil, savory, and fennel seeds can be substituted."
    ],
    "ingredients": [
        "10 garlic cloves, peeled",
        "1/2 cup (packed) fresh mint leaves",
        "1/4 cup (packed) fresh parsley leaves",
        "1/4 cup fresh rosemary leaves (pulled from sprigs)",
        "2 teaspoons coarsely ground black pepper",
        "2 teaspoons herbes de Provence*",
        "6 tablespoons olive oil",
        "3 1- to 1 1/4-pound well-trimmed racks of lamb (each with 8 bones)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Lamb",
        "Marinate",
        "Roast",
        "Easter",
        "Low Carb",
        "Low/No Sugar",
        "Mint",
        "Rosemary",
        "Rack of Lamb",
        "Spring"
    ],
    "title": "Rack of Lamb with Fresh Herbs and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/rack-of-lamb-with-fresh-herbs-and-garlic-108243"
}
