{
    "directions": [
        "Preheat oven to 350°F. In a baking pan toast pine nuts in middle of oven until golden, about 10 minutes, and cool.",
        "Discard stems from spinach and coarsely chop spinach. Rinse spinach and drain in a colander. In a large heavy kettle cook spinach in water clinging to leaves, covered, 1 minute, or until just wilted. Drain spinach well in colander, pressing out excess liquid with back of a large spoon, and cool. Tear ham into pieces. In a food processor pulse spinach with nuts, parsley, ham, and butter until finely chopped and transfer to a large bowl. Stir in remaining crust ingredients until combined well. Crust mixture may be made 1 day ahead and chilled, covered.",
        "Increase temperature to 425°F. If leaving strip of fat on racks, score a diamond pattern on fat with tip of a sharp thin knife. Halve lamb racks to form six 4-rib pieces. Pat lamb dry and season with salt and pepper.",
        "In a large heavy skillet heat oil over moderately high heat until hot but not smoking and lightly brown pieces 2 at a time, on all sides, about 1 minute total for each batch. Transfer pieces as browned to a large shallow roasting pan and arrange meaty sides up. Spread meaty side of each piece with 1 teaspoon mustard. Divide crust mixture into 6 portions and pat over mustard coating on each piece, gently pressing to help adhere.",
        "Roast lamb in middle of oven 25 minutes, or until a thermometer inserted 2 inches into center registers 135°F. for medium-rare. Transfer lamb to a cutting board and let stand 10 minutes.",
        "Cut lamb into individual chops and serve with sauce."
    ],
    "ingredients": [
        "1/2 cup pine nuts (about 3 ounces)",
        "1 pound spinach (about 2 bunches)",
        "1 cup packed fresh flat-leafed parsley leaves",
        "1/4 pound sliced smoked ham",
        "1/4 cup unsalted butter, softened",
        "2 cups fine fresh bread crumbs",
        "1 whole large egg",
        "1 large egg yolk",
        "1 teaspoon finely grated fresh lemon zest",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "3 racks of lamb (8 ribs and about 1 1/2 pounds each), frenched to eye of meat*",
        "1 tablespoon vegetable oil",
        "2 tablespoons Dijon mustard",
        "Accompaniment:minted pea sauce",
        "*available by request from butchers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Roast",
        "Easter",
        "Pine Nut",
        "Spinach",
        "Spring",
        "Parsley",
        "Gourmet"
    ],
    "title": "Rack of Lamb with Spinach Pine-Nut Crust and Minted Pea Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/rack-of-lamb-with-spinach-pine-nut-crust-and-minted-pea-sauce-101050"
}
