{
    "directions": [
        "Bring broth and water to a simmer in a 2 1/2- to 3-quart saucepan and keep at a bare simmer.",
        "Cook onion in butter with bay leaf and salt in a wide 4-quart heavy pot over moderate heat, stirring, until onion is pale golden, about 10 minutes.",
        "While onion is cooking, cook radicchio in boiling salted water in a 4- to 6-quart pot until just tender, about 3 minutes. Drain in a colander and transfer to a bowl of ice and cold water to stop cooking. Drain and squeeze dry.",
        "Add rice to onion and cook, stirring, 2 minutes. Add wine and boil, stirring, until most of wine is absorbed, about 5 minutes. Stir in 1/2 cup simmering broth mixture and cook, stirring constantly and keeping at a strong simmer, until most of broth is absorbed. Continue cooking risotto and adding broth, about 1/2 cup at a time, stirring constantly and letting each addition be absorbed before adding next, until rice is tender and creamy-looking but still al dente, about 18 minutes total (you may have some broth left over). Discard bay leaf, then add radicchio and cheese and cook, stirring, until heated through, about 1 minute. Add salt and pepper to taste and serve immediately."
    ],
    "ingredients": [
        "3 1/2 cups low-sodium chicken broth (28 fluid ounces)",
        "3 1/2 cups water",
        "1 cup finely chopped onion (1 large)",
        "3 tablespoons unsalted butter",
        "1 Turkish or 1/2 California bay leaf",
        "1/2 teaspoon salt",
        "1/2 pound radicchio, quartered, cored, and cut crosswise into 1/2-inch slices",
        "1 1/2 cups Arborio rice (10 ounces)",
        "1 1/2 cups dry red wine",
        "1 1/2 ounces finely grated Parmigiano-Reggiano (3/4 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Rice",
        "Side",
        "Parmesan",
        "Red Wine",
        "Simmer",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Radicchio and Red-Wine Rissoto",
    "url": "http://www.epicurious.com/recipes/food/views/radicchio-and-red-wine-rissoto-230772"
}
