{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "In a large bowl, combine red and purple potatoes and toss with 1 tablespoon of the oil. Sprinkle with 1/4 teaspoon of the salt and 1/4 teaspoon of the pepper. Roast in the oven for about 30 minutes, until tender and browned. Set aside and let cool to room temperature.",
        "In a large pan set over medium heat, add green beans and 3 tablespoons water. Saute until beans are bright green and water has evaporated, about 3 minutes. Add 1 tablespoon of the oil to the pan. Add zucchini, yellow squash, and corn to the pan. Cook until crisp-tender, 5 to 7 minutes.",
        "Add thyme and remaining 1/4 teaspoon of the salt and 1/4 teaspoon of the pepper to the pan. Cook for 1 to 2 minutes longer, until fragrant. Remove from heat and add the tomatoes. Cool to room temperature. Once cool, add the potatoes to the other vegetables.",
        "In a small bowl, whisk together lemon juice and sugar. Continue whisking constantly and slowly drizzle in the remaining 2 tablespoons oil. Add the shallots and stir.",
        "Drizzle the vinaigrette over the potato salad and gently toss to coat. Add more salt and pepper to taste, if desired. Serve at room temperature or chill."
    ],
    "ingredients": [
        "2 red potatoes, cut into 1-inch pieces",
        "2 purple potatoes, cut into 1-inch pieces",
        "4 tablespoons olive oil, divided",
        "1/2 teaspoon salt, divided",
        "1/2 teaspoon ground black pepper, divided",
        "2 cups fresh green beans, trimmed and halved",
        "1 cup halved zucchini slices",
        "1 cup halved yellow squash slices",
        "1 cup fresh corn kernels",
        "1/2 tablespoon chopped fresh thyme",
        "1 cup grape tomatoes, halved",
        "1/4 cup fresh lemon juice",
        "2 teaspoons sugar",
        "1/4 cup sliced shallots"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rainbow Roasted Potato Salad",
    "url": "http://allrecipes.com/recipe/255103/rainbow-roasted-potato-salad/"
}
