{
    "directions": [
        "Discard 1 or 2 outer layers from lemongrass and trim root end. Mince lower inch of stalks for gremolata crumbs (3 to 4 tablespoons). Thinly slice enough from remaining lower end of stalk to measure 1/4 cup, then finely chop for butter sauce.",
        "Cut remainder of stalks, except reedy branches at top, into 1/2-inch slices, then purée with oil in a blender until smooth, 2 to 3 minutes. Force purée through a fine sieve into a bowl, pressing hard on solids, then discarding them.",
        "Blend 1/3 cup lemongrass oil with minced lemongrass (for gremolata), parsley, and zest in cleaned blender until parsley is minced, about 30 seconds. Transfer to a bowl and add panko and salt, stirring until crumbs are bright green, then spread gremolata crumbs in a shallow (1-inch-deep) baking pan.",
        "Peel apples and cut out as many pearl-size balls as possible using melon-ball cutter. (Alternatively, cut apples into 1/4-inch dice.) Drop balls as cut into a small shallow baking pan and toss first with lemon juice, then with oil.",
        "Preheat oven to 350°F.",
        "Simmer chopped lemongrass, shallot, peppercorns, bay leaf, and wine in a 2-quart heavy saucepan over moderately low heat until reduced to about 1/2 cup, 10 to 15 minutes. Pour through fine sieve into a bowl, pressing on solids, then discarding them.",
        "Return wine to saucepan and stir in cream. Bring to a simmer over moderately low heat and whisk in butter, a few pieces at a time, adding new pieces before previous ones have completely melted. (Sauce must not get hot enough to liquefy; it should be the consistency of a thin hollandaise.) Remove from heat and whisk in salt and pepper. Keep warm, covered, off heat.",
        "Bake gremolata crumbs in upper third of oven, stirring occasionally, until crisp but still green (not golden), 8 to 10 minutes.",
        "Bake apples in lower third of oven until just heated through, about 5 minutes.",
        "Open trout like a book so that they lie flat, then pat dry and season both sides with salt and pepper. Heat 1 1/2 tablespoons lemongrass oil in each skillet over moderately high heat until hot but not smoking. Slide 2 butterflied trout, skin sides down, into each skillet (they will fit better if you alternate them head to tail; don't worry if edges of fish go up sides of skillet slightly). Reduce heat to moderate and cook until only a patch of pink flesh remains in center of each fillet, 7 to 12 minutes (fish will continue to cook from residual heat; do not turn over).",
        "Carefully lift 1 trout with a slotted spatula, then rest spatula (with fish) on paper towels and blot both sides of fish lightly. Transfer fish to a plate, placing it off-center. Repeat with remaining trout. Spoon about 1/4 cup gremolata crumbs on 1 side of each fish, letting excess spill onto plate. Gently fold other side of fish over crumbs and pour butter sauce around it. Scatter apple pearls on top and sprinkle dish with more gremolata crumbs."
    ],
    "ingredients": [
        "4 stalks fresh lemongrass",
        "3/4 cup grapeseed oil or canola oil",
        "1/2 cup fresh flat-leaf parsley",
        "1 teaspoon finely rasped (see cooks' note, below) or 1/2 teaspoon finely grated lime zest (from 1 lime)",
        "1 cup panko (Japanese bread crumbs)",
        "1/2 teaspoon kosher salt",
        "2 tart firm-fleshed apples such as Pink Pearl, Pink Lady, or Gala",
        "1 teaspoon fresh lemon juice",
        "1 teaspoon grapeseed oil or canola oil",
        "1/4 cup finely chopped shallot (1 large)",
        "3 whole black peppercorns",
        "3 whole pink peppercorns",
        "1 bay leaf (not California)",
        "1 1/3 cups Mosel Riesling (Kabinett quality)",
        "2 tablespoons heavy cream",
        "1 1/4 sticks (10 tablespoons) cold unsalted butter, cut into 1/2-inch cubes",
        "1/4 teaspoon kosher salt, or to taste",
        "1/8 teaspoon black pepper, or to taste",
        "4 (12-oz) rainbow trout, cleaned, boned, and head removed, leaving rest of fish whole",
        "Special equipment: a 1/4-inch melon-ball cutter (optional) and 2 (12-inch) nonstick skillets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauté",
        "Apple",
        "Trout",
        "White Wine",
        "Shallot",
        "Lemongrass",
        "Parsley",
        "Gourmet"
    ],
    "title": "Rainbow Trout with Apple Pearls, Lemongrass Gremolata Crumbs, and Mosel Riesling Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/rainbow-trout-with-apple-pearls-lemongrass-gremolata-crumbs-and-mosel-riesling-butter-sauce-105607"
}
