{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).  Grease and flour three 9 inch square pans.",
        "Beat eggs in mixing bowl until frothy.  Gradually beat in 1 cup sugar. Beat until light colored and thick.",
        "In another bowl, mix flour, baking powder, and salt together.  Fold into egg mixture.",
        "Into hot milk, stir vanilla and butter until melted.  Fold milk mixture into batter. Divide batter in 3 equal parts into separate bowls.",
        "Add a few drops of red food colouring onto one batter.  Stir to mix.  Spread into a prepared pan.  Add a few drops of yellow food colouring into another batter.  Stir to mix.  Spread into a prepared pan.  Add a few drops of green food coloring into remaining batter.  Stir to mix.  Spread into remaining pan. To summarize, make three different coloured batters, and pour each into a prepared pan.",
        "Bake in oven for about 10 to 15 minutes until an inserted wooden pick comes out clean.  Let stand 8 to 10 minutes.  Turn out onto racks to cool.",
        "Trim cake layers of rough edges.  Cut each layer into 2 even layers.",
        "Mash apple or crabapple jelly with fork.  Spread some over 1 pink layer on tray.  Spread 1 green layer with jelly, and place on top.  Spread yellow layer with jelly, and place on top of green strip.  Repeat with remaining 3 layers in same order, making 6 layers.  Spread jelly on top and sides if preferred, but it is not necessary.  Trim edges if needed.",
        "To Make Strawberry Fluff:  Place 1 egg white, 1/2 cup sugar, thawed strawberries, and 1/8  teaspoon salt into top of double boiler.  Beat with electric beater to mix well.  Place over rapidly boiling water.  Continue beating while it cooks until stiff peaks form when beater is lifted.  Remove frosting from heat, and spread over cake."
    ],
    "ingredients": [
        "4 eggs, room temperature",
        "1 cup white sugar",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1 cup hot milk",
        "2 tablespoons butter",
        "1 teaspoon vanilla extract",
        "3 drops red food coloring",
        "3 drops green food coloring",
        "3 drops yellow food coloring",
        "1 egg white",
        "1/2 cup apple jelly",
        "1/2 cup white sugar",
        "1/8 teaspoon salt",
        "5 ounces sliced frozen strawberries"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rainbow Cake",
    "url": "http://allrecipes.com/recipe/7567/rainbow-cake/"
}
