{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Spray 2 large baking sheets with nonstick spray.",
        "Place powdered sugar in small bowl. Mix in enough milk by teaspoonfuls (about 5) to form thick, smooth glaze. Cover glaze; set aside. Combine almonds and walnuts in processor. Using on/off turns, blend until most nuts are reduced to 1/4-inch pieces (some will be very finely ground). Combine flour, butter, 2/3 cup sugar, citrus peels, aniseed, salt, spices, and baking soda in large bowl. Using electric mixer, beat at low speed until fine meal forms. Add egg yolks and beat until clumps form. Add nuts and raisins. Beat until dough holds together, adding milk by teaspoonfuls (about 3) if dough is dry. Knead dough briefly to compact.",
        "Roll out 1/3 of dough on lightly floured surface to 1/4- to 1/3-inch-thick rectangle. Cut lengthwise into 2-inch-wide strips. Cut each strip on diagonal into 11/2- to 2-inch diamonds. Transfer diamonds to baking sheet. Gather dough scraps and reserve. Repeat with remaining dough. Reroll scraps, cutting out more cookies, until all dough is used.",
        "Bake cookies, 1 sheet at a time, until golden, about 17 minutes. Spoon generous 1/2 teaspoon glaze over each hot cookie and spread with back of spoon to coat. Let cookies stand on baking sheets until completely cool and glaze is set. (Can be prepared 1 week ahead. Store airtight between sheets of waxed paper at room temperature.)"
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 cup powdered sugar",
        "8 teaspoons (about) whole milk",
        "1 cup whole almonds (about 5 ounces), toasted, cooled",
        "1/2 cup walnut pieces (about 2 ounces), toasted, cooled",
        "1 3/4 cups all purpose flour",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into 1/2-inch pieces, room temperature",
        "2/3 cup sugar",
        "1 teaspoon finely grated lemon peel",
        "1 teaspoon finely grated orange peel",
        "1 teaspoon aniseed",
        "3/4 teaspoon salt",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon baking soda",
        "2 large egg yolks",
        "1 cup golden raisins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Bake",
        "Raisin",
        "Almond",
        "Walnut",
        "Spice"
    ],
    "title": "Raisin-Nut Spice Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/raisin-nut-spice-cookies-106495"
}
