{
    "directions": [
        "Put all the raisins in a small bowl, and pour hot water over them.  Set the bowl aside.",
        "Heat 1/4 cup white sugar with 2 tablespoons water in a small saucepan over medium-high heat.  Boil the mixture until the bubbles rise to the surface in a random pattern.  This indicates that the water has nearly evaporated, and that the sugar is beginning to cook.  With a small spoon, drop a bit of the sugar into a bowl filled with ice water.  If the sugar dissolves immediately, continue cooking the sugar mixture.  Remove from heat when the sugar dropped into the water can be rolled between your fingers into a ball.",
        "Begin beating the egg whites with an electric mixer on high speed.  Pour the sugar syrup down the side of the bowl in a thin, steady stream.  When all the sugar has been incorporated, decrease mixer speed to medium.  Continue beating until the egg whites are glossy, have formed stiff peaks, and have cooled to room temperature--about 10 minutes.  Increase the speed to high, and beat the meringue for 1 minute more.",
        "Puree the yogurt, cream cheese, cottage cheese, vanilla extract, and 1/4 cup white sugar in a food processor or blender.  Scrape the cheese mixture into a large bowl.",
        "Pour the milk into a small saucepan.  Sprinkle the gelatin over the milk.  Let it stand until the gelatin softens, about 5 minutes.  Heat the milk over a medium heat, stirring until the gelatin is dissolved.  Stir the milk into the cheese mixture.  Mix about 1/3 of the meringue into the cheese mixture to lighten it.  Gently fold in the rest of the meringue.",
        "Line an 8 inch cake pan with plastic wrap.  Drain the raisins, and scatter them in the bottom of the pan.  Then pour the cheesecake batter into the lined pan.  Chill for 4 hours.  To turn out the cheesecake, invert a serving plate on top of the pan.  Turn both over together.  Lift away the pan, peel off the plastic wrap, and slice for serving."
    ],
    "ingredients": [
        "1/4 cup golden raisins",
        "1/4 cup raisins",
        "1 cup plain low-fat yogurt",
        "1 (3 ounce) package cream cheese",
        "1 1/4 cups low-fat cottage cheese",
        "1 teaspoon vanilla extract",
        "1/2 cup white sugar",
        "1/2 cup low-fat milk",
        "1 (.25 ounce) package unflavored gelatin",
        "3 egg whites",
        "1 cup boiling water",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Raisin Cheesecake",
    "url": "http://allrecipes.com/recipe/9302/raisin-cheesecake/"
}
