{
    "directions": [
        "Bring milk to simmer in small saucepan. Cool to between 105°F. and 115°F. Stir warm water and sugar in large bowl until sugar dissolves. Sprinkle yeast over. Let stand until foamy, about 8 minutes. Mix in milk, 1/2 cup molasses, oil, orange peel and salt. Add rye flour, oats, caraway seeds, fennel seeds and aniseed and stir until well blended. Stir in 2 cups bread flour. Cover and let rest 15 minutes.",
        "Gradually mix in enough remaining bread flour to form dough. Turn out dough onto floured surface. Knead until smooth and elastic, adding more flour if sticky, about 12 minutes. Knead in raisins. Oil large bowl. Add dough, turning to coat. Cover bowl with clean kitchen towel. Let rise in warm area until doubled, about 1 hour.",
        "Oil two 9-inch-diameter cake pans. Line bottom of pans with parchment. Oil parchment. Coat pans and parchment with flour; shake out excess. Punch down dough. Turn out onto lightly oiled surface. Divide dough into 2 pieces. Shape each into 6-inch round loaf. Transfer loaves to prepared pans; flatten slightly. Cover with clean kitchen towel. Let rise in warm area until almost doubled and loaves have spread almost to edges of pans, about 45 minutes.",
        "Preheat oven to 350°F. Bake loaves until tester inserted into center comes out clean, about 45 minutes or less Cool loaves in pans on racks 5 minutes. Remove loaves from pans. Brush tops with 1 tablespoon molasses. Cool completely on racks. (Can be made 1 day ahead. Wrap tightly; store at room temperature.)"
    ],
    "ingredients": [
        "2 cups milk",
        "1/2 cup warm water (105°F. to 115°F.)",
        "1/2 cup packed golden brown sugar",
        "2 envelopes dry yeast",
        "1/2 cup plus 1 tablespoon unsulfured (light) molasses",
        "1/2 cup vegetable oil",
        "2 teaspoons grated orange peel",
        "1 1/2 teaspoons salt",
        "2 1/2 cups rye flour*",
        "1/2 cup old-fashioned oats",
        "1 teaspoon caraway seeds, crushed",
        "1/2 teaspoon fennel seeds, crushed",
        "1/2 teaspoon aniseed, crushed",
        "5 cups (about) bread flour",
        "1 cup raisins",
        "*Rye flour is sold at natural foods stores, specialty foods stores and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Breakfast",
        "Brunch",
        "Bake",
        "Raisin",
        "Spice",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Raisin Rye Bread",
    "url": "http://www.epicurious.com/recipes/food/views/raisin-rye-bread-525"
}
