{
    "directions": [
        "Lightly butter 30 mini-muffin cups. Roll out crust on lightly floured surface to 1/8-inch thickness. Using floured 2 3/4- to 3-inch round cookie cutter, cut out rounds. Gather dough scraps and reroll, cutting out additional rounds for total of 30. Press each dough round firmly over bottom and up sides of prepared mini-muffin cups. Freeze 20 minutes.",
        "Preheat oven to 350°F. Bake crusts until golden, occasionally pressing on bottom and sides of crusts with spoon if crusts bubble and slide down sides of cups, about 25 minutes. Transfer pans to rack and cool crusts in pans while making filling. Maintain oven temperature.",
        "Combine raisins, Sherry, 2 tablespoons water, and pinch of salt in heavy small saucepan. Bring to boil. Remove from heat; let stand uncovered until liquid is almost absorbed, about 10 minutes. Stir cream into raisin mixture; bring to boil. Remove from heat. Whisk eggs, sugar, 1 tablespoon oil, cinnamon, and vanilla in medium bowl to blend. Gradually whisk in hot raisin-cream mixture. Return mixture to saucepan. Stir constantly over medium-low heat until mixture thickens slightly to sauce consistency, about 6 minutes (do not boil). Spoon raisin custard into tartlet crusts, dividing equally. Bake tartlets until filling is just barely set but still moves slightly in center when pans are shaken gently, about 10 minutes. Cool completely in pans on rack. Run small sharp knife around crust edges to loosen; gently remove from pans. (Can be made 1 day ahead. Store airtight at room temperature.)",
        "Toss almonds with remaining 1 teaspoon olive oil in small bowl. Top each tartlet with 1 almond and sprinkle lightly with sea salt. Place tartlets on plates and serve."
    ],
    "ingredients": [
        "Easy Tart Crust",
        "1/2 cup raisins",
        "1/4 cup medium-dry Sherry (such as amontillado)",
        "2 tablespoons water",
        "Pinch of salt",
        "1/2 cup whipping cream",
        "2 large eggs",
        "1/2 cup sugar",
        "1 tablespoon plus 1 teaspoon extra-virgin olive oil",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon vanilla extract",
        "30 whole almonds, toasted",
        "Coarse sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Raisin",
        "Almond",
        "Sherry"
    ],
    "title": "Raisin and Almond Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/raisin-and-almond-tartlets-109285"
}
