{
    "directions": [
        "Place the kidney beans into a large container and cover with several inches of cool water; let stand 8 hours or overnight. Drain and rinse.",
        "Grind the onion, ginger, and garlic into a paste using a mortar and pestle.",
        "Heat the oil and ghee together in a pressure cooker over medium heat. Fry the red chile peppers, cumin seeds, and whole cloves in the hot oil until the cumin seeds begin to splutter; stir the onion paste into the mixture and cook, stirring frequently, until golden brown. Season with the ground turmeric, ground cumin, and ground coriander; continue cooking for a few more seconds before adding the tomatoes. Cook until the tomatoes are completely tender.",
        "Add the drained kidney beans to the pressure cooker with enough water to cover; pour the 2 cups water additionally to the cooker. Add the sugar and salt. Close the pressure cooker and bring to 15 pounds of pressure; cook about 40 minutes. Lower the heat to low and cook another 10 to 15 minutes. Release the pressure and open the cooker. Stir the garam masala and ground red pepper into the bean mixture; garnish with chopped cilantro to serve."
    ],
    "ingredients": [
        "2 cups dry red kidney beans",
        "1 large onion, chopped",
        "4 cloves garlic, chopped",
        "1 (2 inch) piece fresh ginger root, chopped",
        "2 tablespoons vegetable oil",
        "2 teaspoons ghee (clarified butter)",
        "2 dried red chile peppers, broken into pieces",
        "1 teaspoon cumin seeds",
        "6 whole cloves",
        "1 teaspoon ground turmeric",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "2 tomatoes, chopped",
        "2 cups water",
        "1 teaspoon white sugar",
        "salt to taste",
        "2 teaspoons garam masala",
        "1 teaspoon ground red pepper",
        "1/4 cup cilantro leaves, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rajma (Kidney Bean Curry)",
    "url": "http://allrecipes.com/recipe/212366/rajma-kidney-bean-curry/"
}
