{
    "directions": [
        "With a very sharp knife, cut the chicken breasts in half down the middle. This will result in 8 chicken breast pieces that are thinner and uniform in size.",
        "Next, make the marinade. In a large bowl mix together the honey, mustard, paprika, salt, pepper to taste, lemon juice and crushed red pepper flakes if using. Stir to combine.",
        "Add the chicken to the marinade and toss to coat. Cover the bowl with plastic wrap and marinate in the fridge, 2 to 4 hours.",
        "While the chicken marinates, fry up the bacon until chewy. When finished cooking, reserve 1/4 cup of the bacon grease and pour off the rest of the grease (but do not clean the skillet).",
        "When you are ready to cook the chicken, remove it from the marinade and cook it in the skillet over medium-high heat, 3 to 4 minutes each side. Brush a little reserved bacon grease on the chicken as you cook it. (Or you can grill the chicken breasts on an indoor or outdoor grill.)",
        "When a couple of minutes grilling time are left, lay 2 pieces of bacon onto each chicken breast. Top with some Cheddar and allow it to melt on the grill (if you need to remove the chicken you can finish melting the cheese under the broiler).",
        "Halve the rolls and immediately load with the bacon-and-cheese covered chicken."
    ],
    "ingredients": [
        "4 whole boneless, skinless chicken breasts",
        "1/2 cup honey",
        "1/2 cup Dijon mustard (or country/grainy mustard)",
        "1 teaspoon paprika",
        "1/2 teaspoon salt",
        "Freshly ground black pepper",
        "Juice of 1 lemon",
        "Crushed red pepper, for sprinkling, optional",
        "1 pound thick-cut bacon, sliced in half",
        "2 cups grated sharp Cheddar",
        "8 soft whole grain buns"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sandwich",
        "Bacon Recipes",
        "Meat",
        "Chicken",
        "Poultry Recipes",
        "Cheese",
        "Main Dish Recipes"
    ],
    "title": "Ranch Chicken Sandwiches",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/ranch-chicken-sandwiches-recipe"
}
