{
    "directions": [
        "Place beans in large bowl. Pour enough cold water over to cover beans by 1 1/2 inches; let stand overnight.",
        "Cook bacon in large pot over medium heat until crisp, about 12 minutes. Using slotted spoon, transfer bacon to paper towels. Transfer 3 tablespoons bacon drippings to small bowl. Heat remaining drippings in pot over medium-high heat. Add chopped onion and cumin; sauté 5 minutes. Stir in juice and chilies; boil 5 minutes. Add beans and soaking liquid; bring to boil. Reduce heat to medium. Cover partially; simmer 2 hours. Uncover; simmer until beans are tender and liquid thickens, about 30 minutes. Stir in bacon. Season with salt and pepper.",
        "Combine reserved bacon drippings and sliced onion in large skillet. Sauté over medium heat until brown, about 25 minutes. Season with salt and pepper.",
        "Transfer beans to large bowl. Top with caramelized onion and serve.",
        "Chipotle chilies canned in a spicy tomato sauce, sometimes called adobo, are available at Latin American markets, specialty foods stores, and some supermarkets."
    ],
    "ingredients": [
        "1 pound dried poquito beans or pink beans",
        "1 pound smoked bacon, chopped",
        "1 large red onion, chopped",
        "1 tablespoon ground cumin",
        "2 cups orange juice",
        "1 tablespoon minced canned chipotle chilies*",
        "1 large red onion, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Bean",
        "Onion",
        "Side",
        "Super Bowl",
        "Orange",
        "Bacon",
        "Hot Pepper",
        "Tailgating",
        "Simmer",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Ranch-Style Poquito Beans",
    "url": "http://www.epicurious.com/recipes/food/views/ranch-style-poquito-beans-107155"
}
