{
    "directions": [
        "Preheat the oven to 375°F. Grease several baking sheets or coat with nonstick spray.",
        "In a medium bowl, thoroughly stir together the flour, baking powder, baking soda, and salt; set aside. In a large bowl, with an electric mixer on medium speed, beat together the butter and shortening until lightened. Add the brown sugar and sugar and beat until fluffy and smooth. Add the eggs and vanilla and beat until evenly incorporated. Beat or stir in the flour mixture until evenly incorporated. Stir in the oats, corn flakes, pecans, and coconut until evenly incorporated. Let the dough stand for 5 to 10 minutes, or until firmed up slightly.",
        "Shape portions of the dough into generous golf-ball-sized balls with lightly greased hands. Place on the baking sheets, spacing about 3 inches apart. Using your hand, pat down the balls until about 1/3 inch thick.",
        "Bake the cookies, one sheet at a time, in the upper third of the oven for 8 to 11 minutes, or until tinged with brown and just beginning to firm up in the centers; be careful not to overbake. Transfer the sheet to a wire rack and let stand until the cookies firm up slightly, about 3 minutes. Using a spatula, transfer the cookies to wire racks. Let stand until completely cooled.",
        "Store in an airtight container for up to 1 week or freeze for up to 1 month."
    ],
    "ingredients": [
        "2 cups all-purpose white flour",
        "3/4 teaspoon baking powder",
        "3/4 teaspoon baking soda",
        "Generous 1/2 teaspoon salt",
        "2/3 cup (1 stick plus 2 2/3 tablespoons) unsalted butter, slightly softened",
        "1/2 cup white vegetable shortening",
        "1 1/3 cups packed light brown sugar",
        "2/3 cup sugar",
        "2 large eggs",
        "2 1/2 teaspoons vanilla extract",
        "2 cups old-fashioned rolled oats",
        "2 cups corn flakes, crushed",
        "1 1/4 cups (5 ounces) chopped pecans",
        "1 1/4 cups (about 3 1/2 ounces) shredded or flaked sweetened coconut"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Nut",
        "Dessert",
        "Bake",
        "Picnic",
        "Kid-Friendly",
        "Back to School",
        "Coconut",
        "Pecan",
        "Oat",
        "Fall",
        "Party"
    ],
    "title": "Ranger Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/ranger-cookies-106064"
}
