{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C).  Line an 8 inch square baking pan with aluminum foil.",
        "In a large mixing bowl, beat the sugar, 2 whole eggs, and vanilla until combined. Mix in butter. In another bowl, combine the flour, cocoa powder, baking powder, and salt; stir into butter mixture, mixing just until incorporated.  Fold in the chocolate chips.  Pour the batter into the prepared pan.",
        "Bake in preheated oven until a toothpick inserted in the center comes out with moist crumbs attached, 25 to 30 minutes.  Cool pan on wire rack.",
        "Whisk together the evaporated milk and egg yolk in a small saucepan.  Heat over medium low, stirring constantly, until the mixture is very hot and thickens slightly; do not boil.  Place the 4 ounces of chopped semisweet chocolate in a medium bowl, and slowly pour in the hot milk.  Stir until the chocolate is melted and smooth.  Pour the filling over the cooled brownies; refrigerate until firm, about 2 hours.",
        "Beat the cream cheese with the raspberry jam in a large bowl until smooth.  Fold in the whipped topping, and add the food coloring if desired.  Top the cooled brownies with the frosting, using a cake comb to create a design.  Cut brownies into 16 squares, then cut each square in half diagonally to form triangles.  Garnish with chocolate curls if desired."
    ],
    "ingredients": [
        "1 cup white sugar",
        "2 eggs",
        "1/2 teaspoon vanilla extract",
        "1/2 cup butter or margarine, melted",
        "1/2 cup all-purpose flour",
        "1/3 cup unsweetened cocoa powder",
        "1/4 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/2 cup miniature chocolate chips",
        "1/2 cup evaporated milk",
        "1 egg yolk",
        "4 (1 ounce) squares semisweet baking chocolate, chopped",
        "6 ounces cream cheese, softened",
        "2 tablespoons seedless raspberry jam",
        "1 cup frozen whipped topping, thawed",
        "2 drops red food coloring (optional)",
        "16 chocolate curls (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Raspberry Fudge Brownies",
    "url": "http://allrecipes.com/recipe/189657/raspberry-fudge-brownies/"
}
