{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line 36 cupcake cups with paper liners.",
        "In a bowl, sift together the flour, baking powder, and salt until thoroughly combined and sifted. In a large mixing bowl, beat 1 cup of unsalted butter until fluffy with an electric mixer set on medium speed. Mix in 2 cups of sugar and the lemon pudding mix, and beat on high speed until very fluffy and well combined, about 8 minutes. Beat in eggs, one at a time. With the electric mixer running, beat in milk in 1/3 cup increments, alternating with the flour mixture; beat in vanilla extract, lemon juice, and lemon zest just until mixed. Fill the prepared cupcake cups about 2/3 full with the batter.",
        "Bake in the preheated oven until the cupcakes are lightly browned and a toothpick inserted into the center of a cupcake comes out clean, 18 to 23 minutes. Allow the cupcakes to cool.",
        "When cupcakes are cool, make filling; pour about 2 inches of water into the bottom of a double boiler, place over medium heat, and bring the water to a boil. Reduce heat to a simmer, and place the egg whites and 2/3 cup of sugar into the top of the double boiler. Do not allow the water to touch the upper part of the double boiler. Stir until the sugar has dissolved, and mix with electric mixer set on high speed until the meringue holds soft peaks, 5 to 10 minutes. Reduce mixer speed to medium, and beat in the butter, 2 or 3 tablespoons at a time. When butter is smoothly beaten in, beat the creme de menthe candy flavoring oil in until the flavoring is fully incorporated and the filling is fluffy, 1 to 2 more minutes. Remove filling from heat and set aside. When cooled, load the filling into a piping bag with a medium-sized round tip.",
        "To make the frosting, place cream cheese, raspberries, both amounts of tea powder, 1 teaspoon of vanilla extract, and 1/2 cup of sugar in a bowl, and beat until smooth with an electric mixer set on high speed. While mixer is running, slowly pour the cream into the bowl, and beat until the frosting forms stiff peaks, about 3 minutes. Scrape down the bowl often.",
        "Insert the piping tip into the top of each cupcake, and squeeze about half a tablespoon of filling into each cupcake. Top each cupcake with a generous dollop of frosting to serve."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "4 1/2 teaspoons baking powder",
        "1 1/2 teaspoons salt",
        "1 cup unsalted butter, softened",
        "2 cups white sugar",
        "1 (3.4 ounce) package instant lemon pudding mix",
        "4 eggs",
        "1 cup milk",
        "1/2 teaspoon vanilla extract",
        "1 lemon, juiced and zested",
        "2 egg whites",
        "2/3 cup white sugar",
        "1 cup unsalted butter at room temperature",
        "8 drops oil-based creme de menthe candy flavoring",
        "8 ounces cream cheese, softened",
        "1/2 cup frozen unsweetened raspberries, thawed",
        "1/4 cup unsweetened instant tea powder",
        "4 teaspoons unsweetened instant tea powder",
        "1 teaspoon vanilla extract",
        "1/2 cup white sugar",
        "2 cups heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Raspberry Iced Tea Cupcakes",
    "url": "http://allrecipes.com/recipe/218796/raspberry-iced-tea-cupcakes/"
}
