{
    "directions": [
        "Preheat oven to 325°F. Butter 9-inch-diameter glass pie dish. Mix cookie crumbs and melted butter in medium bowl until evenly moistened. Press crumb mixture onto bottom and up sides of prepared dish. Bake until crust is firm and crisp to touch, about 10 minutes. Cool completely.",
        "Line baking sheet with foil; oil lightly. Stir sugar in heavy medium skillet over medium-low heat until sugar begins to melt, about 8 minutes. Increase heat to medium-high and cook until sugar turns into deep golden syrup, stirring occasionally, about 4 minutes. Stir in almonds. Immediately pour praline onto foil-lined baking sheet; spread with wooden spoon. Let stand until praline is cool and firm, about 30 minutes. Cut praline into 1/2-inch pieces. Transfer half of praline pieces to processor; grind until powder forms. Reserve remaining praline pieces for topping.",
        "Spread 1 pint pistachio ice cream gently and evenly in cooled crust (crust is fragile). Sprinkle 1/4 cup praline powder over. Spread raspberry gelato evenly over. Sprinkle remaining praline powder over. Leaving 1 inch border of raspberry gelato showing, spread remaining pistachio ice cream over top of pie, mounding slightly in center. Sprinkle reserved praline pieces over top. Freeze until firm, at least 4 hours. (Can be made 5 days ahead. Cover tightly; keep frozen.)",
        "Let pie soften slightly at room temperature, about 5 minutes. Serve pie with Raspberry Sauce, if desired.",
        "*Available at Italian markets and some supermarkets."
    ],
    "ingredients": [
        "1 1/2 cups finely crushed amaretti cookies* (Italian macaroons; about 7 ounces)",
        "5 tablespoons unsalted butter, melted",
        "3/4 cup sugar",
        "3/4 cup blanched slivered almonds",
        "2 pints pistachio ice cream, slightly softened",
        "1 pint raspberry gelato, slightly softened",
        "Raspberry Sauce (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Raspberry",
        "Almond",
        "Pistachio",
        "Summer"
    ],
    "title": "Raspberry-Pistachio Ice Cream Pie with Almond Praline",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-pistachio-ice-cream-pie-with-almond-praline-105387"
}
