{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Press pie crust into a 9-inch pie pan. Brush crust with enough egg white to coat with a thin layer.",
        "Cook in the preheated oven until golden brown, 5 to 10 minutes. Remove crust from oven and cool. Decrease oven temperature to 350 degrees F (175 degrees C).",
        "Cook and stir raspberries in a saucepan over medium heat until raspberries start to break down, 5 to 10 minutes. Stir 1 tablespoon cornstarch into raspberries until cornstarch is dissolved and mixture is thickened, 2 to 3 minutes. Spoon raspberry mixture into pie crust.",
        "Combine 1 cup white sugar and 1/4 cup cornstarch in a saucepan; gradually stir in water and 1/2 cup lemon juice until smooth. Stir egg yolks into sugar mixture; bring to a boil. Cook sugar-egg mixture at a boil, stirring constantly, until smooth, about 1 minute. Remove saucepan from heat. Stir lemon pulp, remaining 1/4 cup lemon juice, and butter into sugar-egg mixture; pour over raspberry mixture.",
        "Beat 3 egg whites in a small bowl using an electric mixer on high speed until foamy. Gradually beat 1/3 cup white sugar into egg whites until stiff peaks form. Spread egg white mixture over lemon filling, completely sealing egg mixture onto edges of crust.",
        "Bake in the preheated oven until meringue is golden brown, 15 to 20 minutes. Cool pie to room temperature on a wire rack, about 30 minutes. Refrigerate pie until completely chilled, about 3 hours."
    ],
    "ingredients": [
        "Pie Crust:",
        "1 pastry for a 9-inch pie crust",
        "1 egg white, or as needed",
        "Raspberry Layer:",
        "1/2 cup frozen raspberries (optional)",
        "1 tablespoon cornstarch (optional)",
        "Lemon Filling:",
        "1 cup white sugar",
        "1/4 cup cornstarch",
        "1 cup cold water",
        "3/4 cup lemon juice, divided",
        "3 egg yolks, lightly beaten",
        "1 tablespoon lemon pulp (including zest if desired)",
        "1 tablespoon butter",
        "Meringue:",
        "3 egg whites",
        "1/3 cup white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Raspberry Lemon Meringue Pie",
    "url": "http://allrecipes.com/recipe/237897/raspberry-lemon-meringue-pie/"
}
