{
    "directions": [
        "Preheat oven to 350°F. Spray 12 tartlet pans with 3-inch-diameter tops, 1 1/4-inch bottoms and 1 1/4-inch high sides (1/4 cup capacity) with vegetable oil spray. Press scant 1 1/2 tablespoons dough evenly onto bottom and up sides of each pan. Arrange pans on large baking sheet. Bake until crusts are golden brown, piercing with fork if crusts bubble, about 12 minutes. Transfer pans to rack and cool crust.",
        "Bring milk to simmer in heavy medium saucepan. Whisk yolks, sugar, orange juice, cornstarch and peel in large bowl to blend. Gradually whisk in hot milk. Return mixture to same pan. Whisk over medium heat until mixture thickens and boils 1 minute. Pour pastry cream into small bowl. Press plastic wrap directly onto surface of pastry cream. Cover and refrigerate until cold. about 4 hours. (Crust and pastry cream can be made 1 day ahead. Remove crusts from tartlet pans. Store crusts in airtight containers. Keep pastry cream chilled.)",
        "Spoon about 1 generous tablespoon pastry cream into each crust. Arrange raspberries decoratively atop pastry cream. Refrigerate tartlets until well chilled, about 1 hour. Lightly sift powdered sugar over tartlets and serve.",
        "Mix flour, powdered sugar and salt in processor. Add butter; process until mixture resembles coarse meal. Mix egg yolks and water in small bowl. Add to flour mixture and process until moist clumps form.",
        "Gather dough into ball; flatten into disk for round tart or into square for rectangular tart. Wrap in plastic and refrigerate 1 hour. (Can be prepared 3 days ahead. Keep refrigerated. Let dough soften briefly at room temperature before rolling out."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 cup milk (do not use low-fat or non fat)",
        "3 large egg yolks",
        "3 tablespoons sugar",
        "1 1/2 tablespoons orange juice",
        "1 1/2 tablespoons cornstarch",
        "1 1/2 teaspoons grated orange peel",
        "2 6-ounce baskets raspberries",
        "Powdered sugar",
        "(Makes one 9-inch crust)",
        "1 1/4 cups all purpose flour",
        "1/3 cup powdered sugar",
        "1/2 teaspoon salt",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into pieces",
        "2 large egg yolks",
        "1 tablespoon cold water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Raspberry",
        "Orange",
        "Summer",
        "Chill"
    ],
    "title": "Raspberry-Topped Orange Custard Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-topped-orange-custard-tartlets-2301"
}
