{
    "directions": [
        "Preheat oven to 350°F. Finely grind ground cookies, nuts and sugar in processor. Add butter and vanilla; process until moist crumbs form. Press onto bottom and up sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Wrap outside of pan with foil. Bake until crust is light golden, about 15 minutes. Cool. Maintain oven temperature.",
        "Scrape seeds from vanilla beans into heavy small saucepan; add beans. Add cream and bring to boil. Cool completely. Discard beans.",
        "Using electric mixer, beat cream cheese and sugar in large bowl until smooth. Add vanilla-cream mixture, sour cream and vanilla extract and beat until well blended. Beat in eggs 1 at a time.",
        "Gently mix 1 basket raspberries, 1 basket blueberries and cornstarch in medium bowl. Pour 2/3 of filling into crust. Sprinkle berry mixture over. Pour remaining filling over berries to cover. Bake until cake is golden and begins to crack around edges but still moves slightly in center when pan is shaken, about 1 hour 10 minutes. Let cool 10 minutes (cake will fall).",
        "Mix sour cream, sugar and vanilla in small bowl to blend.",
        "Gently press down any raised edges of cake. Spoon topping evenly over cake. Bake 10 minutes. Cool cake on rack. Refrigerate overnight. (Can be prepared 2 days ahead. Keep refrigerated.)",
        "Melt jam in small saucepan over low heat. Brush some jam over top of cake. Arrange remaining berries atop cake. Gently brush berries with remaining jam. (Can be made 8 hours ahead. Keep chilled.)",
        "Run small sharp knife around pan sides to loosen cake. Remove pan sides. Place cake on platter. Serve cold."
    ],
    "ingredients": [
        "1 1/2 cups ground shortbread cookies",
        "1 cup hazelnuts, toasted, husked",
        "1/4 cup sugar",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "1 teaspoon vanilla extract",
        "2 vanilla beans, split lengthwise",
        "1/3 cup whipping cream",
        "3 8-ounce packages cream cheese, room temperature",
        "1 cup sugar",
        "1/2 cup sour cream",
        "2 teaspoons vanilla extract",
        "4 large eggs",
        "2 6-ounce baskets fresh raspberries",
        "2 6-ounce baskets fresh blueberries",
        "1 tablespoon cornstarch",
        "1 cup sour cream",
        "3 tablespoons sugar",
        "1 1/2 teaspoons vanilla extract",
        "1/3 cup seedless raspberry jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Blueberry",
        "Raspberry",
        "Vanilla",
        "Summer",
        "Hazelnut",
        "Sour Cream",
        "Jam or Jelly"
    ],
    "title": "Raspberry and Blueberry Vanilla Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-and-blueberry-vanilla-cheesecake-4306"
}
