{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place 6 tablespoons butter in a saucepan. Melt over medium-low heat. Cool until barely warm.",
        "Combine flour, 6 tablespoons sugar, cinnamon, and salt and add to melted butter. Toss with a fork until crumbs are formed.",
        "Take a clump of the crumb mixture in your hand and squeeze gently forming a larger clump. Break larger clump apart.",
        "Sprinkle crumbs onto a large shallow pan. Repeat until all the mixture has been made into crumbs. Place crumbs in oven and bake for 15 to 18 minutes until they turn light brown. Set streusel mixture aside to cool and harden.",
        "Heat cream in a 2-quart saucepan until just under a boil. In a small bowl, combine 1/3 cup sugar and cornstarch.  Beat egg yolks in a mixing bowl with a whisk until slightly thickened. Whisk in sugar-cornstarch mixture. Gradually pour in hot cream, whisking constantly. Return mixture to saucepan. Heat slowly, stirring constantly with a wooden spoon, until mixture begins to thicken and comes to a boil. Be sure to reach all parts of the pot to release any custard that may stick.",
        "After custard reaches a boil, simmer about 1 minute. Remove from heat. Stir in 1 tablespoon butter, vanilla, and Kirschwasser or framboise. Cover custard with a piece of buttered plastic wrap. Cool about 10 minutes.",
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Spread custard into a prebaked tart shell and bake for until bubbly, 20 to 25 minutes. Remove from oven and cool on a rack for 10 minutes to set.",
        "Combine preserves and water in a small saucepan. Heat until mixture comes to a boil. Pass the glaze through a fine-mesh strainer. Discard pulp.",
        "Gently brush top of custard with half of the hot preserves. Sprinkle berries generously over hot custard. Lightly brush tops of berries with remaining preserves. Sprinkle tart generously with streusel, pressing the crumbs gently into the berries so they will stick. Chill tart, uncovered, for about 2 hours. Just before serving, sift confectioners' sugar on top."
    ],
    "ingredients": [
        "Streusel:",
        "6 tablespoons unsalted butter",
        "1 1/4 cups all-purpose flour",
        "6 tablespoons white sugar",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon salt",
        "Custard:",
        "1 3/4 cups light cream",
        "1/3 cup white sugar",
        "4 teaspoons cornstarch",
        "4 egg yolks",
        "1 tablespoon unsalted butter",
        "1 teaspoon vanilla extract",
        "1 tablespoon kirschwasser",
        "1 (11 inch) shortbread tart crust, baked",
        "2/3 cup apricot preserves",
        "2 tablespoons water",
        "2 1/2 pints fresh raspberries",
        "2 1/2 tablespoons sifted confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Raspberry Streusel Tart",
    "url": "http://allrecipes.com/recipe/12361/raspberry-streusel-tart/"
}
