{
    "directions": [
        "Using electric mixer, beat sugar, butter and egg in medium bowl until creamy. Add flour, almonds, cinnamon, baking powder and salt; beat just until well blended. Measure 3/4 cup of dough; flatten into disk. Wrap in plastic; chill. Using floured fingertips, press remaining dough over bottom and up sides of 9-inch-diameter tart pan with removable bottom. Pierce dough in several places with fork. Chill at least 1 hour. (Can be made 1 day ahead. Keep chilled.)",
        "Preheat oven to 375°F. Bake crust until light golden, piercing with toothpick if crust bubbles, about 15 minutes. Transfer to rack and cool. Maintain oven temperature.",
        "Roll out chilled dough disk on generously floured surface to 1/8-inch thickness. Cut dough into stars, using 2-inch and 3-inch star cookie cutters. Transfer cookies to baking sheet. Bake until cookies are light golden, about 6 minutes. Transfer cookies to racks and cool. Maintain oven temperature.",
        "Melt chocolate chips in top of double boiler set over simmering water, stirring until smooth. Cool 5 minutes. Spread chocolate over bottom of crust. Arrange berries over chocolate, spacing evenly. Stir jam in heavy small saucepan over low heat until melted and smooth. Spoon jam over raspberries.",
        "Bake tart until crust is golden brown, about 35 minutes (filling will still appear slightly liquid but will set up as tart cools.) Transfer tart to rack and cool. Arrange stars atop tart, overlapping points. Dust with powdered sugar. Serve with whipped cream."
    ],
    "ingredients": [
        "2/3 cup (packed)golden brown sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 large egg",
        "1 1/2 cups all purpose flour",
        "1/2 cup ground toasted blanched almonds (about 2 1/2 ounces)",
        "3/4 teaspoon ground cinnamon",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "6 ounces semisweet chocolate chips (about 1 cup)",
        "1 1/2-pint basket raspberries",
        "1/2 cup seedless raspberry jam",
        "Powdered sugar",
        "Lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Berry",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Fourth of July",
        "Kid-Friendly",
        "Raspberry",
        "Almond",
        "Summer",
        "Winter"
    ],
    "title": "Raspberry Linzer Tart",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-linzer-tart-929"
}
