{
    "directions": [
        "For the pastry: Whisk together the flour, granulated sugar and salt in a large bowl. Cut the butter in with a pastry blender or two knives until the mixture resembles coarse meal with a few pea-sized pieces. Add 4 tablespoons of the water and stir with a fork until a shaggy dough starts to form. Add 1 to 2 more tablespoons water if you need to, but stop before the dough gets too wet. It should just hold together when you squeeze it in your hand.",
        "Gather the dough into a rough ball in the bowl with your hands. Put a piece of plastic wrap on the counter and set the dough on it. Wrap the dough and flatten it into a 6-inch disc. Refrigerate until cold, at least 1 hour.",
        "For the filling: Meanwhile, place the almonds in the bowl of a food processor and pulse until very finely ground. Add the granulated sugar, butter, salt and almond extract and blend until smooth. Add the eggs and blend until smooth. Add the flour and pulse until just combined.",
        "Heat the oven to 375 degrees F. On a lightly floured surface with a lightly floured rolling pin, roll the dough out to an 11-inch circle. Ease the dough into a 9-inch tart pan with a removable bottom. Gently press in the edges, then run a rolling pin over the top to trim the edges. Refrigerate for at least 30 minutes or freeze for 15 minutes. Line the cold pastry with parchment paper and fill with pie weights or dried beans. Place the lined tart pan on a baking sheet and bake until set and dry, about 20 minutes. Reduce the oven temperature to 350 degrees F.",
        "Scrape the filling into the tart pan and spread it out evenly. Top evenly with the raspberries and sprinkle with the sliced almonds. Bake until the filling is puffed and golden brown, 35 to 40 minutes. Transfer to a rack to cool. Serve warm or at room temperature sprinkled with confectioners' sugar."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour, plus more for the work surface",
        "1 tablespoon granulated sugar",
        "1/2 teaspoon kosher salt",
        "8 tablespoons (1 stick) cold unsalted butter, cut into pieces",
        "4 to 6 tablespoons ice water",
        "1 cup (4 ounces) whole blanched, raw almonds",
        "1/2 cup granulated sugar",
        "4 tablespoons (1/2 stick) unsalted butter, at room temperature",
        "1/2 teaspoon kosher salt",
        "1 teaspoon almond extract",
        "2 large eggs",
        "3 tablespoons all-purpose flour",
        "1 1/2 cups (6 ounces) fresh raspberries",
        "2 tablespoons sliced almonds",
        "Confectioners' sugar, for sprinkling"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Nut Recipes",
        "Fruit",
        "Raspberry Recipes",
        "Dessert"
    ],
    "title": "Raspberry Frangipane Tart",
    "url": "http://www.foodnetwork.com/recipes/raspberry-frangipane-tart"
}
