{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9  inch pans. In a medium bowl mix together the flour, baking powder, 1/2 teaspoon salt and ground walnuts. Set aside. In a small bowl whip 1 1/2 cups cream until stiff peaks form. Set aside.",
        "In a large bowl combine 1 1/2 cups sugar, eggs and 3 teaspoons vanilla. Beat 5 minutes at highest speed of an electric mixer. fold in flour mixture alternately with whipped cream.",
        "Pour batter into prepared pans. Bake in the preheated oven for 25 to 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 15 minutes, then turn out onto a wire rack and cool completely.",
        "To make the Frosting:  In a large bowl combine cream cheese, 1 cup sugar 1/8 teaspoon salt and 1 teaspoon vanilla. Beat until smooth. In a separate small bowl, whip 1/12 cups whipping cream until stiff peaks form. Fold whipped cream into cream cheese mixture.",
        "To assemble cake:  Split each layer in half horizontally to form 4 layers. Place 1 layer on serving plate; spread with 1/2 cup frosting. Top with second layer; spread with 1/2 cup preserves. Top with 3rd layer; spread with 1/2 cup frosting. Top with remaining cake layer. Frost sides of cake with frosting, reserving about 1 cup for decorating. Spread remaining preserves on top of cake. Using a pastry bag and a star tip, pipe reserved frosting in a lattice design on the top of cake, pipe border around top and bottom edges of cake. Store in refrigerator."
    ],
    "ingredients": [
        "1 3/4 cups cake flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 cup ground walnuts",
        "1 1/2 cups heavy cream",
        "1 1/2 cups white sugar",
        "3 eggs",
        "3 teaspoons vanilla extract",
        "1 (8 ounce) package cream cheese, softened",
        "1 cup white sugar",
        "1/8 teaspoon salt",
        "1 teaspoon vanilla extract",
        "1 1/2 cups heavy cream",
        "1 (12 ounce) jar raspberry preserves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Raspberry Walnut Torte",
    "url": "http://allrecipes.com/recipe/19094/raspberry-walnut-torte/"
}
