{
    "directions": [
        "Preheat oven to 350° with rack in upper third. Grease an 8\" x 8\" pan with butter, line with parchment paper, and grease and flour parchment paper.",
        "Put chocolate and 4 Tbsp butter in a heatproof bowl set over a saucepan of 2\" simmering water. Melt, stirring occasionally, about 5 minutes. Remove from heat; let cool slightly.",
        "In a small bowl, beat 2 eggs. Whisk eggs into chocolate mixture. Add 3/4 cup sugar and beat until combined. Add 1/2 cup flour, baking powder, and salt. Stir well. Stir in 1 tsp vanilla. Spread batter in prepared pan.",
        "For the cream cheese layer: In a medium bowl, stir together cream cheese and remaining 2 tbsp butter until smooth and thoroughly combined. Add remaining 2 tbsp sugar, remaining egg, and jam and mix well. Stir in remaining 1 tbsp flour and remaining 1/2 tsp vanilla. Dollop mixture onto batter in pan. Use a butter knife to swirl cream cheese mixture into brownies. Press fresh raspberries into the top.",
        "Bake until a wooden pick inserted into center comes out with only a few moist crumbs, 35-40 minutes (check after 30 minutes). Let cool completely before slicing and serving.",
        "The brownies will keep, wrapped individually and stored in the refrigerator, up to 4 days."
    ],
    "ingredients": [
        "6 tbsp unsalted butter, room temperature, divided, plus more",
        "1/2 cup plus 1 tbsp all-purpose flour, divided, plus more",
        "4 oz bittersweet chocolate, coarsely chopped",
        "3 large eggs, divided",
        "3/4 cup plus 2 tbsp sugar, divided",
        "1/2 tsp baking powder",
        "1/2 tsp salt",
        "1 1/2 tsp vanilla extract, divided",
        "4 oz cream cheese, room temperature",
        "2 tbsp raspberry jam",
        "1/2 cup fresh raspberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Cream Cheese",
        "Raspberry"
    ],
    "title": "Raspberry Cream Cheese Brownies",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-cream-cheese-brownies-51256870"
}
