{
    "directions": [
        "In a food processor purée the thawed raspberries with the syrup, force the mixture through a fine sieve into a heavy saucepan, pressing hard on the solids, and boil the raspberry purée, stirring occasionally, until it is reduced to about 1 cup. Let the raspberry purée cool and chill it.",
        "In a metal bowl beat together the eggs, the sugar, and the honey, set the bowl over a saucepan of simmering water, and beat the mixture until it is pale, thickened, and registers 160°F. on a candy thermometer. Beat the mixture set over a large bowl of ice and cold water until it is cold, in another bowl beat the cream until is just holds stiff peaks, and fold the cream and the walnuts into the egg mixture gently but thoroughly. Spoon the raspberry purée and the egg mixture decoratively into 6-ounce glasses, make swirls with a wooden skewer, and freeze the parfaits, covered, overnight. The parfaits may be made 2 days in advance and kept covered and frozen. Let the parfaits stand for 15 minutes before serving. Arrange the chocolate curls and the fresh raspberries decoratively on the parfaits."
    ],
    "ingredients": [
        "two 10-ounce packages frozen raspberries in light syrup, thawed",
        "3 large eggs",
        "2 1/2 tablespoons sugar",
        "2 1/2 tablespoons honey",
        "3/4 cup well-chilled heavy cream",
        "1/2 cup walnuts, toasted lightly, cooled and chopped",
        "6 chocolate curls if desired",
        "fresh raspberries if available for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Dessert",
        "Freeze/Chill",
        "Kid-Friendly",
        "Frozen Dessert",
        "Raspberry",
        "Walnut",
        "Chill",
        "Gourmet",
        "Kidney Friendly"
    ],
    "title": "Raspberry Swirl Parfaits",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-swirl-parfaits-11090"
}
