{
    "directions": [
        "About one hour before smoking, make the dry rub.  Combine all ingredients in small bowl; mix well.   Pat ribs dry with paper towels; generously coat both sides of ribs with rub. Set aside at room temperature for 1 hour.",
        "Meanwhile, make the sauce. Combine all ingredients in medium saucepan; bring to a boil over medium-high heat.  Reduce heat and simmer 15 minutes until slightly thickened, stirring frequently. Cool to room temperature; cover and refrigerate.",
        "Heat charcoal or gas grill for indirect cooking at 250 to 300 degrees F. Add drained wood chips, if using.",
        "Place the ribs, meaty side up, over a drip pan and cook for 2 hours.  Spray both sides of ribs with tamarind juice.  Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.",
        "Continue cooking ribs for 1 to 2 hours more until very tender, spraying with tamarind juice every 30 minutes.  Add more coals as needed to maintain temperature for a charcoal grill.",
        "Move ribs over direct heat on grill and brush with sauce.  Cook for about 5 minutes until sauce is set.  Turn ribs and repeat with more sauce.",
        "Serve ribs with remaining sauce."
    ],
    "ingredients": [
        "Dry Rub:",
        "1/4 cup light brown sugar",
        "3 tablespoons sea salt",
        "4 1/2 teaspoons chili powder",
        "4 1/2 teaspoons dried lemon peel",
        "4 1/2 teaspoons paprika",
        "4 1/2 teaspoons onion powder",
        "2 teaspoons cayenne pepper",
        "2 teaspoons black pepper",
        "Sauce:",
        "1 cup seedless raspberry jam",
        "1/4 cup chipotle salsa",
        "1/4 cup white sugar",
        "1 1/2 teaspoons onion powder",
        "1 teaspoon apple cider vinegar",
        "1/4 teaspoon hickory liquid smoke",
        "1/8 teaspoon cayenne pepper",
        "2 racks Smithfield® Extra Tender Pork Back Ribs, membrane removed",
        "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional)",
        "3/4 cup tamarind juice, in a spray bottle*"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Raspberry Chipotle Back Ribs",
    "url": "http://allrecipes.com/recipe/242373/raspberry-chipotle-back-ribs/"
}
