{
    "directions": [
        "Sprinkle yeast over 1/4 cup of warm milk in a small bowl. Stir in 1 teaspoon flour and 1 1/2 teaspoon caster sugar; stir to dissolve. Let stand until the yeast softens and begins to form a creamy foam, about 5 minutes.",
        "Combine 1 cup sifted flour and 1/4 cup warm milk in a large bowl. Pour in the yeast mixture and mix well to form a sticky dough. Cover the bowl with plastic wrap, and cover the plastic-wrapped bowl with a clean kitchen towel. Let the dough rise in a warm place for until doubled, 2 hours or more.",
        "Beat butter, egg yolk, and 2 tablespoons caster sugar with an electric mixer until creamy, about 3 minutes. Add the butter mixture to the dough; pour in 1 cup flour and 1/2 teaspoon salt.",
        "Transfer the dough to a floured surface and knead until the dough is no longer sticky and feels  smooth and elastic, about 10 minutes. Place the dough into a lightly greased bowl, cover the bowl with plastic wrap, and top it with the towel. Let the dough rise again for 1 hour.",
        "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.",
        "Return the dough to a floured work surface. Press down lightly with your hands to deflate it, and use a knife to cut the dough into 8 pieces.",
        "Shape each piece into a ball and arrange them on the prepared baking sheet. Place two glasses on the baking sheet to hold up the towel, and arrange the towel over the rolls to prevent them from drying out. Let rise for 30 minutes.",
        "Remove the towel and glasses. Dip the bottom of a 2-inch glass or jar in flour and press down in the center of each bun to form a hollow. Fill the buns with the raspberries. Brush the beaten egg white on the edges of the buns and sprinkle each bun with about 1 1/2 teaspoon sugar.",
        "Bake in the preheated oven until the buns are golden brown, about 25 minutes."
    ],
    "ingredients": [
        "1 teaspoon active dry yeast",
        "1/4 cup warm milk (no more than 100 degrees F/38 degrees C)",
        "1 teaspoon all-purpose flour",
        "1 1/2 teaspoons castor sugar or superfine sugar",
        "1 cup sifted all-purpose flour",
        "1/4 cup warm milk (no more than 100 degrees F/38 degrees C)",
        "3 1/2 tablespoons butter at room temperature",
        "1 egg yolk",
        "2 tablespoons castor sugar or superfine sugar",
        "1 cup sifted all-purpose flour",
        "1/2 teaspoon salt",
        "2 1/2 cups fresh raspberries",
        "1 egg white, lightly beaten",
        "2 tablespoons white sugar, or to taste - divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Raspberry Vatrushka Buns",
    "url": "http://allrecipes.com/recipe/218540/raspberry-vatrushka-buns/"
}
