{
    "directions": [
        "Blend 1 1/4 cups flour and 1/2 teaspoon salt in processor. Add chilled butter; using on/off turns, process until mixture resembles coarse meal. Add 3 tablespoons ice water and process until moist clumps form, adding more water by teaspoonfuls if mixture is dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour.",
        "Preheat oven to 375°F. Roll out dough on lightly floured surface to 12-inch round. Transfer to 9-inch-diameter tart pan with removable bottom. Trim dough overhang to 1/2 inch. Fold overhang in, forming double-thick sides. Freeze crust 15 minutes. Bake until crust is golden, about 40 minutes. Reduce oven temperature to 350°F.",
        "Line warm tart shell with raspberries. Whisk remaining 2 tablespoons flour and brown sugar in medium bowl to blend. Whisk in eggs, melted butter, and cream. Scrape in seeds from vanilla bean; discard bean. Pour enough filling over raspberries to fill crust to just below edge (discard any remaining filling). Place tart pan on baking sheet. Bake until custard is set, puffed, and golden, about 35 minutes. Cool at least 3 hours; serve at room temperature. (Can be made 1 day ahead. Cover and store at room temperature.)"
    ],
    "ingredients": [
        "1 1/4 cups plus 2 tablespoons all-purpose flour",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "3 tablespoons (or more) ice water",
        "8 ounces raspberries (about 1 3/4 cups)",
        "3/4 cup (packed) golden brown sugar",
        "2 large eggs",
        "1/2 cup (1 stick) unsalted butter, melted",
        "1/2 cup whipping cream",
        "1/2 vanilla bean, split lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Egg",
        "Dessert",
        "Bake",
        "Raspberry",
        "Summer"
    ],
    "title": "Raspberry and Brown Sugar Custard Tart",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-and-brown-sugar-custard-tart-108323"
}
