{
    "directions": [
        "In a saucepan, bring some water to a boil, and then reduce the heat to a simmer. Find a heat-proof mixing bowl that will fit over the top of the pan, but not sink it all the way in. (Do-it-yourself double boiler!)",
        "Put the egg yolks into the mixing bowl. Add 1/4 cup of the sugar and whisk until the yolks start to turn pale. Place the mixing bowl on the saucepan with the simmering water. Slowly add 1/2 cup of the marsala wine and whisk to combine. Cook over the simmering water, and use a rubber spatula to scrape the bowl. Cook until thick. Cover with plastic wrap and refrigerate until cool.",
        "Place the mascarpone cheese in a bowl and stir until smooth. In another mixing bowl, combine the whipping cream and remaining 4 tablespoons sugar and whip until not quite stiff. To the bowl of whipped cream, add the softened mascarpone cheese and the chilled egg yolk mixture. Fold the mixture gently. Cover with plastic wrap and refrigerate for 1 to 2 hours.",
        "Add the remaining 1/4 cup marsala and vanilla to the espresso. Arrange the ladyfingers in a single layer in a 9- by 13-inch pan. Spoon a small amount of the espresso mixture over each ladyfinger (keep it under 1 tablespoon per cookie and you'll be fine). Plop one-third of the cold mascarpone mixture on top and spread it into a layer. Scatter with raspberries and grate over a thin layer of semisweet chocolate. Repeat the process two more times.",
        "Cover and refrigerate for a few hours before serving. This allows for more moisture to soften the cookies and the whole mixture to meld together.",
        "To serve, spoon out helpings onto individual plates.",
        "Cook's Note: Tiramisu does not last beyond 24 to 36 hours, as everything eventually starts to break down and become soupy."
    ],
    "ingredients": [
        "5 whole egg yolks",
        "1/4 cup plus 4 tablespoons sugar",
        "3/4 cup marsala wine",
        "1 pound mascarpone cheese, at room temperature",
        "1 cup whipping (heavy) cream",
        "3 teaspoons vanilla extract",
        "1 1/2 cups brewed espresso",
        "Store-bought ladyfingers",
        "2 cups fresh raspberries",
        "1 square semisweet chocolate, for grating"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian Dessert Recipes",
        "Dessert",
        "Italian",
        "Tiramisu",
        "Cheese",
        "Fruit",
        "Raspberry Recipes"
    ],
    "title": "Raspberry Tiramisu",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/raspberry-tiramisu-recipe"
}
