{
    "directions": [
        "Spray 9-inch springform pan with 3-inch-high sides with nonstick spray. Finely grind macaroons, almonds, and lemon peel in processor. Press half of mixture over bottom of prepared pan.",
        "Puree peaches in processor. Transfer puree to heavy deep-sided saucepan and bring to simmer over medium heat. Cook until reduced to 1 cup, stirring often, about 10 minutes (color of puree will darken slightly). Transfer to bowl and chill until cool, about 15 minutes.",
        "Puree raspberries in processor. Strain through sieve set over medium bowl, pressing to extract as much fruit as possible. Chill puree.",
        "Whisk 1/4 cup cream, egg yolks, sugar, corn syrup, and butter in large metal bowl to combine. Set bowl over saucepan of simmering water (do not allow bottom of bowl to touch water). Whisk constantly until parfait base thickens and thermometer inserted into base registers 160°F, about 8 minutes.",
        "Remove bowl from over water. Using electric mixer, beat parfait base until billowy and completely cool, about 8 minutes. Divide between 2 medium bowls (about 1 cup parfait base in each bowl). Beat remaining 2 1/4 cups cream in large bowl until medium peaks form. Fold cool peach puree and schnapps into 1 parfait base, then fold in half of whipped cream. Spread peach parfait in prepared pan. Sprinkle remaining macaroon mixture over. Place in freezer.",
        "Fold 1 cup of raspberry puree (reserve remaining puree for another use) into parfait base in second bowl. Fold in remaining whipped cream. Spread parfait over macaroon mixture in pan. Cover; freeze at least 8 hours and up to 2 days.",
        "Fold 30x7-inch strip aluminum foil lengthwise in half to form 30x3 1/2-inch strip.",
        "Microwave white chocolate in glass bowl for 10-second intervals until chocolate just begins to melt; stir until smooth. Pour into small resealable plastic bag. Cut tip off 1 corner of bag. Pipe white chocolate over foil strip in lacy design. Let stand until chocolate sets, about 10 minutes.",
        "Using heated knife, cut around parfait cake to loosen; remove pan sides. Holding foil strip upright and parallel to bottom of cake, place 1 end against cake, white chocolate side in. Gently press strip completely around cake like a fence, leaving overhang. Freeze 10 minutes. Starting at overhang, carefully peel off foil. Trim off chocolate overhang. Cover; return cake to freezer for up to 12 hours.",
        "Combine all ingredients except raspberries in large bowl; let compote stand at least 15 minutes and up to 1 hour, stirring occasionally. Arrange raspberries atop cake. Cut cake into wedges. Serve with compote.",
        "Lindt and Perugina white chocolate gave the best results in our test kitchen."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 13-ounce package soft coconut macaroons",
        "1/2 cup sliced almonds, toasted",
        "1 1/2 teaspoons grated lemon peel",
        "3 large peaches (about 20 ounces), peeled, pitted, diced",
        "3 1/2-pint containers raspberries",
        "2 1/2 cups chilled heavy whipping cream",
        "9 large egg yolks",
        "3/4 cup sugar",
        "1/3 cup light corn syrup",
        "2 tablespoons (1/4 stick) unsalted butter, room temperature",
        "2 tablespoons peach schnapps",
        "5 ounces imported white chocolate, finely chopped",
        "6 large peaches (about 2 1/2 pounds), peeled, pitted, thinly sliced",
        "1/2 cup sugar",
        "1/3 cup peach schnapps",
        "2 teaspoons fresh lemon juice",
        "3 1/2-pint containers raspberries (for topping)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Berry",
        "Chocolate",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Fourth of July",
        "Backyard BBQ",
        "Frozen Dessert",
        "Raspberry",
        "Peach",
        "Summer",
        "Party",
        "Double Boiler",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Raspberry and Peach Parfait Cake",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-and-peach-parfait-cake-108469"
}
