{
    "directions": [
        "In large bowl, with mixer at low speed, beat margarine or butter with cream cheese until blended and smooth. Beat in vanilla extract, salt, 1 cup flour, and 1/4 cup sugar until blended.",
        "With spoon, stir in remaining flour. Divide dough into 4 equal pieces. Wrap each with plastic wrap and refrigerate until firm, at least 2 hours or overnight.",
        "To Prepare Filling: In medium bowl, with spoon, stir walnuts, apricots, brown sugar, 1/4 cup plus 2 tablespoons white sugar, and 1/2 teaspoon cinnamon until well mixed.",
        "Line 2 large baking sheets with foil and grease foil.",
        "On lightly floured surface, with floured rolling pin, roll 1 piece of chilled dough into a 9-inch round, keeping remaining dough refrigerated. Spread dough with 2 tablespoons raspberry preserves. Sprinkle with about 1/2 cup apricot filling; gently press filling onto dough. With pastry wheel or sharp knife, cut dough into 12 equal wedges. Starting at curved edge, roll up each wedge,  jelly-roll fashion. Place cookies on foil-lined cookie sheet, point-side down, about 1/2 inch apart.  Repeat with remaining dough, one-fourth at a time.",
        "Preheat oven to 325 degrees F (165 degrees C).",
        "In cup, mix remaining 2 tablespoons sugar with 1 teaspoon cinnamon. With pastry brush, brush rugelach with milk. Sprinkle with cinnamon-sugar.",
        "Bake rugelach at 325 degrees F (165 degrees C) on 2 oven racks about 30 to 35 minutes until golden, rotating cookie sheets between upper and lower racks halfway through baking time. Immediately remove rugelach to wire racks to cool. Store in tightly covered container."
    ],
    "ingredients": [
        "1 cup butter, softened",
        "1 (8 ounce) package cream cheese, softened",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon salt",
        "2 cups all-purpose flour",
        "3/4 cup white sugar",
        "1 cup chopped walnuts",
        "3/4 cup dried apricots, chopped",
        "1/4 cup packed brown sugar",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 cup seedless raspberry preserves",
        "1 tablespoon milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Raspberry and Apricot Rugelach",
    "url": "http://allrecipes.com/recipe/11326/raspberry-and-apricot-rugelach/"
}
