{
    "directions": [
        "Line a 1-quart charlotte mold with plastic wrap and trim 1 whole bread slice to fit the bottom of it. Arrange the halved slices, overlapping them slightly, around the sides of the mold and press the bread round into the bottom.",
        "In a saucepan combine 4 cups of the raspberries, the sugar, and the framboise, bring the mixture to a simmer over moderate heat, stirring, and simmer it, stirring, for 3 minutes, or until the raspberries are crushed and the sugar is dissolved. Remove the pan from the heat and let the raspberry mixture cool.",
        "Spoon one third of the raspberry mixture into the mold and top it with 1 slice of the remaining bread, trimming the bread if necessary. Spoon the remaining raspberry mixture into the mold and top it with enough of the remaining 3 slices of bread, cut into pieces, to cover the top completely. Cover the mold with a round wax paper cut to fit the inside of the mold, top the wax paper with 1 round of stiff cardboard cut to fit the inside of the mold, and weight the pudding evenly with a 2-pound weight. Chill the pudding overnight.",
        "Just before serving, remove the weight, the cardboard, and the wax paper, run a thin knife around the edge of the mold to loosen the pudding, and invert a large round serving plate over the mold. Invert the raspberry pudding onto the plate, remove the plastic wrap, and garnish the pudding with the whipped cream and the additional raspberries."
    ],
    "ingredients": [
        "14 slices of very thin homemade-type white bread, crusts removed and 8 of the slices halved crosswise",
        "4 cups raspberries plus additional for garnish",
        "1/3 cup sugar, or to taste",
        "1/4 cup framboise or other raspberry-flavored liqueur",
        "whipped cream for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dairy",
        "Fruit",
        "Dessert",
        "Freeze/Chill",
        "Raspberry",
        "Summer",
        "Chill",
        "Gourmet"
    ],
    "title": "Raspberry Summer Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-summer-pudding-12165"
}
