{
    "directions": [
        "Preheat oven to 350°F. Line 2 cookie sheets with parchment. Mix flour and ground coffee beans in small bowl. Using electric mixer, beat egg yolks and 4 tablespoons sugar in medium bowl until thick and slowly dissolving ribbon forms when beaters are lifted, about 4 minutes. Beat in vanilla. Mix in dry ingredients (batter will be thick). Using electric mixer fitted with clean dry beaters, beat egg whites until thick and foamy. Add remaining 1 tablespoon sugar and beat until whites are stiff but not dry. Fold into yolk mixture in 2 additions.",
        "Drop batter by rounded tablespoons (8 per sheet) onto prepared sheets, spacing evenly. Sift powdered sugar thickly over rounds. Bake until rounds are golden brown on edges, about 16 minutes. Cool in pan on rack. Remove ladyfinger rounds from parchment (Can be prepared 1 day ahead. Store in single layer in airtight container).",
        "Combine framboise and instant espresso in small bowl. Stir until espresso dissolves. Using electric mixer, beat cream cheese and 2/3 cup powdered sugar until light and fluffy. Beat in coffee mixture. Fold in 1 cup raspberries. Let stand at room temperature.",
        "Combine coffee and 3 tablespoons sugar. Stir until sugar dissolves. Spoon 1 scant tablespoon coffee mixture over flat side of 1 ladyfinger round Place coffee side up on plate. Spread 1/3 cup filling atop round. Place flat side down atop filling. Sprinkle with powdered sugar. Spoon raspberry sauce around desserts. Garnish with remaining raspberries and fresh mint and serve.",
        "Puree raspberries and syrup in processor. Strain into small bowl to remove seeds. Stir in eau-de-vie. (Can be prepared 2 days ahead. Cover and refrigerate.)"
    ],
    "ingredients": [
        "1/2 cup all purpose flour",
        "1/2 teaspoon finely ground coffee (preferably espresso)",
        "3 extra-large eggs, separated, room temperature",
        "5 tablespoons sugar",
        "1/2 teaspoon vanilla extract",
        "Powdered sugar",
        "3 tablespoons framboise eau-de-vie (clear raspberry brandy)",
        "1 tablespoon instant espresso powder or instant coffee granules",
        "2 8-ounce packages cream cheese (preferably oil-fashioned, low-salt cream cheese), room temperature",
        "2/3 cup powdered sugar",
        "1 6-ounce basket raspberries or 1 1/2 cups frozen unsweetened, thawed, drained",
        "3/4 cup freshly brewed strong coffee (preferably espresso), room temperature",
        "3 tablespoons sugar",
        "Additional powdered sugar",
        "Fresh mint",
        "Makes about 1 1/4 cups",
        "1 10-ounce package frozen raspberries in syrup, thawed",
        "2 tablespoons framboise eau-de-vie"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Food Processor",
        "Mixer",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Raspberry",
        "Eau de Vie"
    ],
    "title": "Raspberry and Coffee Tiramisu",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-and-coffee-tiramisu-1470"
}
