{
    "directions": [
        "To make the crust, combine the flour and salt in a mixing bowl. Cut in the shortening with a knife or pastry blender until the mixture resembles coarse crumbs. Combine the egg, water, and lemon juice. Sprinkle wet ingredients over the flour mixture and toss lightly with a fork until the flour mixture is moistened. Wrap the dough in plastic and refrigerate for at least 1 hour or up to three days.",
        "Roll the dough out to fit a 9 inch pie plate. Place the dough in the pie plate, trimming the edge to form a 1 inch overhang. Fold the extra dough under itself and decoratively crimp the edge of the crust. Chill the pastry-filled pie pan at least 20 minutes before baking to prevent shrinkage.",
        "Preheat oven to 400 degrees F (205 degrees C). Line pastry with a double layer of aluminum foil and a layer of pie weights or dried beans.  Bake in the preheated oven until edge of crust is golden, about 10 minutes. Carefully remove the foil and weights and bake until the crust has set, about 5 minutes more. Cool completely before adding filling.",
        "To make the filling, melt the chocolate in a double boiler. Let it cool until room temperature but still fluid. Meanwhile, beat the butter with an electric mixer until smooth. Gradually add the sugar, beating until the mixture is light and fluffy. It should be noticeably lighter in color. Blend in the cooled melted chocolate and the vanilla extract. Add the eggs one at a time, beating at high speed for 2 minutes and scraping down the sides of the bowl well after each addition.",
        "Spread a thin layer (about 1/4 inch) of raspberry jam on the bottom of the cooled pie crust. Spoon the chocolate filling on top of the jam and smooth the surface. Refrigerate overnight.",
        "Before serving, garnish each slice with a dollop of whipped topping, 3 fresh raspberries, and a mint leaf."
    ],
    "ingredients": [
        "Crust:",
        "1 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1/3 cup shortening",
        "2 tablespoons beaten egg",
        "1 tablespoon water",
        "1 teaspoon lemon juice",
        "Filling:",
        "3 ounces semisweet chocolate",
        "3/4 cup butter, softened",
        "1 cup white sugar",
        "1/2 teaspoon vanilla extract",
        "3 eggs",
        "1/3 cup seedless raspberry jam",
        "Garnish:",
        "fresh raspberries",
        "fresh mint leaves",
        "whipped topping"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Raspberry French Silk Pie",
    "url": "http://allrecipes.com/recipe/152291/raspberry-french-silk-pie/"
}
