{
    "directions": [
        "Combine flour, sugar, aniseed and salt in bowl of heavy-duty mixer fitted with paddle attachment. Add butter, yolk and vanilla and mix at low speed until coarse meal forms. Knead dough into smooth ball. Flatten to disk, wrap in plastic and refrigerate 40 minutes.",
        "Preheat oven to 350°F. Roll dough out on lightly floured surface to scant 1/8-inch thickness. Using 3 1/2-inch fluted cutter, cut dough into rounds. Transfer rounds to heavy large cookie sheets, spacing evenly. Gather dough scraps. Repeat rolling and cutting until all dough is used, chilling dough briefly if soft. Brush cookies with beaten egg. Bake until light golden, about 12 minutes. Transfer cookies to rack to cool. (Can be prepared 3 days ahead. Store cookies in airtight container.)",
        "Puree raspberries and honey in blender. Strain. (Can be prepared 2 days ahead. Cover and refrigerate.)",
        "Beat crème fraîche and honey in chilled medium bowl until stiff peaks form. Transfer filling to pastry bag fitted with 3/8-inch (no. 3) star tip.",
        "Place 1 cookie on flat surface. Pipe filling in small stars over cookie. Place 1 layer of raspberries atop stars. Top with second cookie. Pipe filling in small stars over second cookie. Place layer of raspberries atop stars. Top with third cookie. Sift powdered sugar over. Place 1 raspberry in center. Repeat layering of cookies, filling and berries to make 3 more desserts. Spoon sauce onto plates. Transfer 1 galette to center of each plate. Garnish with mint leaves and serve."
    ],
    "ingredients": [
        "1 1/3 cups unbleached all purpose flour",
        "3/4 cup plus 1 tablespoon powdered sugar",
        "3/4 teaspoon aniseed, chopped",
        "Pinch of salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 large egg yolk",
        "1 tablespoon vanilla extract",
        "1 egg, beaten to blend",
        "2 cups (about 8 ounces) frozen whole unsweetened raspberries, thawed",
        "3 tablespoons honey, preferably orange or other fruit flavored",
        "1 cup crème fraîche or whipping cream",
        "3 tablespoons honey, preferably orange flavored",
        "2 1/2-pint baskets raspberries or 1 1-pint basket strawberries, sliced",
        "Powdered sugar",
        "Fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Berry",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Raspberry",
        "Spring",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Raspberry Galettes",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-galettes-1871"
}
