{
    "directions": [
        "Heat oven to 350°F with rack in middle. Line baking sheets with parchment paper.",
        "Spread almonds on a small rimmed baking sheet and bake until fragrantly toasty and nuts are golden on the inside (cut one open). Turn off oven. Cool almonds completely (you can speed this up by putting them in the freezer for 10 to 15 minutes).",
        "Grind nuts with 1/2 cup of flour from cookie recipe in a food processor until finely ground, then transfer to a medium bowl. Whisk in remaining 1 1/2 cups flour from recipe and whisk in cinnamon.",
        "Follow the rest of the Buttery Sugar Cookie dough recipe to make the Linzer dough. Divide dough in half, and wrap each half in wax paper, shaping each half into a flattened rectangle, then store each in a resealable plastic bag. Chill dough until firm, at least 2 hours.",
        "Heat oven again to 350°F with rack in middle. Line baking sheets with parchment paper.",
        "While oven heats, roll out 1 piece of dough (keep remaining dough chilled) between two large sheets of wax paper to 1/8 inch thick. (If dough becomes too soft to roll out, quick-chill on a baking sheet in the freezer or chill in the refrigerator until firm.)",
        "Peel back top sheet of wax paper and cut out as many 3-inch cookies with cutter as possible. Then cut 1-inch openings in the center of half the cookies. Transfer cookies, as cut, to a lined baking sheet, arranging them 1 inch apart. (If dough becomes too soft to remove the cookies, quick-chill the dough in freezer or chill in refrigerator again on a baking sheet.)",
        "Gather, reroll, and chill scraps to form more cookies.",
        "Freeze or chill cut-out cookies on baking sheet until firm before baking.",
        "Bake cookies, one sheet at time, until edges are golden, 6 to 9 minutes. Let cookies cool on sheet 2 minutes. Transfer cookies with a metal spatula to a rack to cool completely.",
        "Repeat with remaining piece of dough. (Cool sheets and use fresh parchment for subsequent batches.)",
        "Spread about 1 teaspoon jam on all the solid round cookies (without holes). Lightly dust rings (cookies with holes) with confectioners' sugar using a wire-mesh sieve.",
        "Set rings over jam to form sandwiches."
    ],
    "ingredients": [
        "1/2 cup whole natural almonds (with skins)",
        "Buttery Sugar Cookie dough recipe with adjustments and additions",
        "1/2 teaspoon ground cinnamon",
        "2/3 cup seedless raspberry jam or red currant jelly",
        "Confectioners' sugar for dusting",
        "Special equipment: Wax paper; parchment paper; 2 large baking sheets; 3-inch and 1-inch fluted round cookie cutters"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Nut",
        "Bake",
        "Christmas",
        "Tree Nut",
        "Almond",
        "Birthday",
        "Shower",
        "Christmas Eve",
        "Party",
        "Jam or Jelly",
        "Gourmet"
    ],
    "title": "Raspberry-Almond Linzer Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-almond-linzer-cookies-387489"
}
