{
    "directions": [
        "Bring 1 cup cream to simmer in medium saucepan. Remove from heat. Add white chocolate; whisk until smooth. Cool to barely lukewarm, about 10 minutes. Beat 2 1/2 cups cream and 1/2 teaspoon extract in large bowl to soft peaks. Fold in white chocolate mixture.",
        "Stir sugar and 1/2 cup water in small saucepan over medium heat until sugar melts. Mix in 3/4 teaspoon extract; remove syrup from heat. Quickly submerge 1 biscuit in syrup; shake excess back into pan. Place dipped biscuit in bottom of 14-cup trifle dish. Repeat with enough biscuits to cover bottom of dish.",
        "Spread 1/3 of melted jam over biscuits in dish. Top with 1/3 of partially thawed berries with juices. Spread 1/3 of whipped chocolate cream over. Repeat layering with dipped biscuits, melted jam, partially thawed berries, and whipped chocolate cream 2 more times. Mound fresh berries in center of trifle. Sprinkle almonds around edge. Cover and chill at least 5 hours and up to 24 hours.",
        "*Available at some supermarkets and at Italian markets."
    ],
    "ingredients": [
        "3 1/2 cups chilled heavy whipping cream, divided",
        "12 ounces high-quality white chocolate (such as Lindt or Perugina), chopped",
        "1 1/4 teaspoons almond extract, divided",
        "1/2 cup sugar",
        "1/2 cup water",
        "7 ounces Boudoirs or Champagne biscuits (crisp ladyfinger cookies),* divided",
        "1 cup raspberry jam, melted, divided",
        "1 1/2 12-ounce packages frozen unsweetened raspberries, partially thawed, divided",
        "2 6-ounce containers fresh raspberries",
        "3/4 cup sliced almonds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Christmas",
        "Kid-Friendly",
        "Raspberry",
        "Almond",
        "Chill",
        "Jam or Jelly",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Raspberry, White Chocolate, and Almond Trifle",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-white-chocolate-and-almond-trifle-233432"
}
