{
    "directions": [
        "Using a 2 1/2- to 3-inch round cookie cutter or a cardboard circle and a small, sharp knife, cut out as many rounds as possible from the tart dough. Press the dough scraps together and reroll to cut out additional rounds. You should have a total of 12. Transfer the rounds to twelve 2-inch tartlet pans. Ease into the pans and pat firmly into the bottoms and up the sides. Trim off any excess dough. Press the dough into the sides to extend it slightly above the rims. Refrigerate or freeze the tartlet shells until firm, about 30 minutes.",
        "Position a rack in the lower third of an oven and preheat to 375°F. Place the tartlet shells on a baking sheet for easy removal from the oven.",
        "Line the shells with aluminum foil or parchment paper and fill with pie weights or raw short-grain rice. Bake until the shells are pale gold, about 15 minutes. Remove the weights and foil and continue to bake until the shells are golden, about 5 minutes more. Transfer to wire racks and let cool completely.",
        "In the top pan of a double boiler, combine the chocolate, butter and corn syrup. Set the pan over but not touching barely simmering water in the bottom pan and melt, stirring occasionally. Alternatively, in a microwavable bowl, combine the chocolate, butter and corn syrup and melt in the microwave for 30-second intervals. Remove from the stovetop or microwave oven and stir until smooth.",
        "Pass the raspberry jam through a medium-mesh sieve to remove the seeds. Spread 1 tsp. of the jam in the bottom of each shell and fill as full as possible with the chocolate mixture. Let the filled tartlets stand at room temperature until set, 1 to 2 hours.",
        "Before serving the tartlets, place 1 raspberry, stem end down, on top of the chocolate in the middle of each tartlet and surround with additional raspberries. (You will need 7 or 8 raspberries for each tartlet.) Remove the tartlets from the pans and serve. Makes 12 small tartlets."
    ],
    "ingredients": [
        "1 rolled-out round Basic Tart Dough",
        "8 oz. semisweet chocolate, chopped into small slivers",
        "6 Tbs. (3/4 stick) unsalted butter",
        "2 Tbs. light corn syrup",
        "1/4 cup raspberry jam",
        "4 cups raspberries"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Raspberry and Chocolate Tartlets",
    "url": "http://www.williams-sonoma.com/recipe/raspberry-and-chocolate-tartlets.html"
}
