{
    "directions": [
        "Preheat the oven to 350°F.",
        "To make the crust, crush the oatcakes with a rolling pin or in a food processor until sandy and no chunks remain. Stir in the rolled oats and sugar. Melt the butter over low heat in a small pan, then add it to the crushed oatcakes and stir to combine. Add a bit more butter if the mixture feels dry; it needs to be moist enough to hold together in small clumps. Spoon it into the pan and press firmly with the back of a spoon. Bake for 10 to 15 minutes, until just set (it will firm as it cools). Set aside while you prepare the filling. Turn the oven down to 250°F.",
        "To make the filling, beat the cream cheese in a large bowl until smooth. Add the sour cream and stir to combine, then add the honey, sugar, and vanilla extract. Stir in the whiskey to taste. (You can add a little extra, or none at all, if you prefer.) Lightly whisk the eggs in a separate bowl, then gradually add them to the cream cheese mixture while stirring continuously to prevent lumps from forming. The mixture should be thick and smooth.",
        "Pour the filling over the pre-baked crust. Bake for about 1 1/2 hours, until the filling is set and has just the slightest wobble in the center. Because it's baked at such a low temperature, it should be barely colored, just deepening to a light gold. Let cool to room temperature in the pan, then unmold and chill.",
        "Shortly before serving, arrange the raspberries on top of the cheesecake, fat ends down and tapered bottoms upward. You can cover with the raspberries earlier, but there's a risk that, if they're particularly ripe, their juices will seep into the creamy cheesecake."
    ],
    "ingredients": [
        "150 grams (5.25 oz) oatcakes",
        "25 grams (5 tbsp) regular rolled oats",
        "1 tablespoon + 2 teaspoons superfine sugar",
        "100 grams (7 tbsp) unsalted butter",
        "400 grams (14 oz) full-fat cream cheese",
        "1/2 cup + 2 tablespoons sour cream",
        "1/4 cup honey",
        "100 grams (7 tbsp) superfine sugar",
        "1 teaspoon vanilla extract",
        "2 to 3 tablespoons whiskey",
        "3 large eggs",
        "200 to 300 grams (1 1/2 to 2 1/2 c) fresh raspberries",
        "8-inch round removable bottom or springform pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Kid-Friendly",
        "Cream Cheese",
        "Raspberry",
        "Oat",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Raspberry, Whiskey & Oat Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/raspberry-whiskey-oat-cheesecake-56389498"
}
