{
    "directions": [
        "In a blender or small food processor blend all vinaigrette ingredients with salt and pepper to taste until smooth. Vinaigrette may be made 1 day ahead and chilled, covered. Bring vinaigrette to room temperature before using on salads.",
        "Cut eggplant, zucchini, yellow squash, and bell peppers into 1/4-inch dice. In a large heavy skillet cook eggplant in 1 tablespoon oil over moderate heat, stirring, until tender and transfer to a bowl. In skillet cook zucchini, yellow squash, and onion with salt and pepper to taste in 1 tablespoon oil over moderate heat, stirring, until crisp-tender, 3 to 5 minutes, and transfer to bowl. Cook bell peppers in remaining teaspoon oil in same manner and transfer to bowl. Stir in tomato purée, garlic, herbs, and salt and pepper to taste and cool ratatouille completely.",
        "Preheat oven to 375°F. and cut a large sheet of parchment paper into eight 5-to-6 inch squares.",
        "On a work surface put a 3-inch metal pastry ring (at least 1 1/2 high) in middle of 1 parchment square and fill it with 1/3 cup ratatouille, pressing evenly and tightly into bottom. Cut goat cheese into 8 equal pieces and flatten each piece to form a 3-inch disk. Top ratatouille in ring with goat cheese disk, pressing lightly at edges to cover ratatouille completely. Transfer round on parchment square to a large baking sheet and remove ring. Make 7 more rounds in same manner with remaining parchment squares, ratatouille, and goat cheese. Bake rounds in middle of oven 8 to 10 minutes, or until heated through.",
        "While rounds are baking, in a large bowl toss mesclun with 1/4 cup vinaigrette and divide among 8 plates.",
        "With a spatula transfer a round to center of each salad. Drizzle each salad with about 1 teaspoon vinaigrette and garnish with tomatoes."
    ],
    "ingredients": [
        "3/4 cup packed fresh basil leaves",
        "1/2 tablespoon minced garlic",
        "1/2 tablespoon minced shallot",
        "1 tablespoon freshly grated Parmesan",
        "1 tablespoon pine nuts, toasted golden",
        "1 1/2 tablespoons white-wine vinegar",
        "1/2 cup plus 2 tablespoons olive oil",
        "1 long narrow Japanese eggplant",
        "1 small zucchini",
        "1 small yellow squash",
        "1 small red bell pepper",
        "1 small green bell pepper",
        "3 tablespoons olive oil",
        "1 small red onion, chopped fine",
        "1 medium vine-ripened tomato, seeded and puréed (about 1/2 cup)",
        "2 teaspoons minced garlic",
        "3 tablespoons finely chopped fresh parsley leaves",
        "2 tablespoons finely chopped fresh basil leaves",
        "1 tablespoon finely chopped fresh thyme leaves",
        "12 ounces soft mild goat cheese at room temperature",
        "8 ounces mesclun (mixed baby greens)",
        "Garnish: red and yellow cherry tomatoes, halved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Blender",
        "Food Processor",
        "Leafy Green",
        "Tomato",
        "Bake",
        "Vegetarian",
        "Goat Cheese",
        "Basil",
        "Eggplant",
        "Bell Pepper",
        "Zucchini",
        "Spring",
        "Yellow Squash",
        "Gourmet"
    ],
    "title": "Ratatouille and Goat Cheese Salad with Pesto Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/ratatouille-and-goat-cheese-salad-with-pesto-vinaigrette-14314"
}
