{
    "directions": [
        "Preheat oven to 400°F.",
        "Prick eggplant in 3 places and coat lightly with additional oil. In a shallow baking dish roast eggplant in middle of oven, turning once, 1 hour, or until collapsed and soft, particularly at stem end. Cool eggplant slightly and halve lengthwise. Scoop out flesh into a bowl and cool. Discard liquid that accumulates in bowl and in a food processor purée eggplant. Eggplant purée may be made 1 day ahead and chilled, covered. Bring purée to room temperature before proceeding with recipe.",
        "In a large heavy skillet, cook onion in 2 tablespoons oil over moderate heat, stirring until softened. Add garlic and cook, stirring, 1 minute. Add bell peppers, zucchini, squash, thyme and salt and pepper to taste and cook, stirring occasionally, until tender, 8 to 10 minutes. Add tomato and cook, stirring, 3 minutes. In a bowl, stir together eggplant purée, vegetable mixture and parsley and season with salt and pepper. Dip may be made 1 day ahead and chilled, covered.",
        "Serve dip at room temperature with toast or crackers."
    ],
    "ingredients": [
        "a 1- to 1 1/4-pound eggplant",
        "2 tablespoons olive oil plus additional for coating eggplant",
        "1 medium-large onion, chopped fine (about 1 1/2 cups)",
        "2 garlic cloves, minced",
        "2 medium red bell peppers, chopped fine (about 1 1/2 cups)",
        "1 medium zucchini, cut into 1/2-inch dice",
        "1 medium yellow squash, cut into 1/2-inch dice",
        "1 1/2 tablespoons minced fresh thyme leaves",
        "1/2 cup finely chopped seeded vine-ripened tomato or drained canned tomatoes",
        "2 tablespoons finely chopped fresh parsley leaves",
        "Accompaniment: thin slices of French bread, toasted, or crackers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Food Processor",
        "Onion",
        "Tomato",
        "Appetizer",
        "Roast",
        "Vegetarian",
        "Eggplant",
        "Bell Pepper",
        "Zucchini",
        "Chill",
        "Vegan",
        "Thyme",
        "Yellow Squash",
        "Gourmet",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Ratatouille Dip",
    "url": "http://www.epicurious.com/recipes/food/views/ratatouille-dip-10114"
}
