{
    "directions": [
        "Cut an X in bottom of each tomato with a sharp paring knife and blanch together in a 4-quart pot of boiling water 1 minute. Transfer tomatoes with a slotted spoon to a cutting board and, when cool enough to handle, peel off skin, beginning from scored end, with paring knife.",
        "Coarsely chop tomatoes and transfer to a 5-quart heavy pot with garlic, parsley, basil, and 1/3 cup oil. Simmer, partially covered, stirring occasionally, until tomatoes break down and sauce is slightly thickened, about 30 minutes.",
        "While sauce is simmering, toss eggplant with 1/2 teaspoon salt in a large colander and let stand in sink 30 minutes.",
        "Meanwhile, cook onions in 3 tablespoons oil with 1/4 teaspoon salt in a 12-inch heavy skillet over moderate heat, stirring occasionally, until softened, 10 to 12 minutes. Transfer onions with a slotted spoon to a large bowl, then add 3 tablespoons oil to skillet and cook bell peppers with 1/4 teaspoon salt over moderate heat, stirring occasionally, until softened, about 10 minutes. Transfer peppers with slotted spoon to bowl with onions. Add 3 tablespoons oil to skillet and cook zucchini with 1/4 teaspoon salt over moderate heat, stirring occasionally, until just tender, 6 to 8 minutes. Transfer zucchini with slotted spoon to bowl with other vegetables.",
        "While zucchini are cooking, pat eggplant dry with paper towels. Add remaining oil (about 1/4 cup) to skillet and cook eggplant over moderate heat, stirring occasionally, until softened, 10 to12 minutes.",
        "Add vegetables, remaining teaspoon salt, and black pepper to tomato sauce and simmer, covered, stirring occasionally, until vegetables are very tender, about 1 hour. Cool, uncovered, and serve warm or at room temperature."
    ],
    "ingredients": [
        "2 1/2 lb tomatoes (4 large)",
        "8 large garlic cloves, thinly sliced",
        "1 cup chopped fresh flat-leaf parsley",
        "20 fresh basil leaves, torn in half",
        "1 cup plus 2 tablespoons extra-virgin olive oil",
        "2 lb eggplant, cut into 1-inch cubes",
        "2 1/4 teaspoons salt",
        "2 large onions (1 1/2 lb total), quartered lengthwise and thinly sliced crosswise",
        "3 assorted bell peppers (green, red, and/or yellow; 1 1/2 lb total), cut into 1-inch pieces",
        "4 medium zucchini (2 lb), quartered lengthwise and cut crosswise into 3/4-inch-thick pieces",
        "1/2 teaspoon black pepper",
        "Garnish: Parmigiano-Reggiano shavings and fresh basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Tomato",
        "Vegetable",
        "Side",
        "Stew",
        "Vegetarian",
        "Parmesan",
        "Eggplant",
        "Bell Pepper",
        "Zucchini",
        "Spring",
        "Summer",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Ratatouille",
    "url": "http://www.epicurious.com/recipes/food/views/ratatouille-108350"
}
