{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Mix ground beef, eggs, onion, milk, bread crumbs, salt, and black pepper in a large bowl until completely combined to make the rat body mixture.",
        "Mix Cheddar cheese, 3/4 bottle of barbeque sauce, and 1 cup French-fried onions together gently in a separate bowl to make the rat guts.",
        "Put about half the rat body mixture onto a sheet of waxed paper and form it into the shape of a rat body. Spread a thick layer of the cheese mixture on top of the body leaving 1/2 inch of space along the outer edge.",
        "Put remaining rat body mixture on top, forming the body and creating a solid seal around the edges so the guts don't ooze out while baking.",
        "Place the top part of a broiler pan on the rat and carefully flip it over. Reshape rat body as needed. Place olives onto the rat body for the eyes and nose, potato slices for the ears, and spaghetti for the whiskers. Spread 1/4 bottle barbeque sauce over the body of the rat and sprinkle with crushed French-fried onions. Set the broiler rack atop the broiler pan.",
        "Bake in preheated oven until the cheese is melted, about 1 hour. Allow ratloaf to cool 5 minutes before slicing to serve."
    ],
    "ingredients": [
        "3 pounds ground beef",
        "2 eggs",
        "1 onion, chopped",
        "2 cups milk",
        "2 cups dry bread crumbs",
        "salt and ground black pepper to taste",
        "1 (8 ounce) package shredded Cheddar cheese",
        "3/4 (12 ounce) bottle barbeque sauce",
        "1 cup French-fried onions",
        "3 large black olives",
        "3 spaghetti noodles, broken into halves",
        "2 slices red potato",
        "2 cups crushed French-fried onions, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ratloaf (Halloween Meatloaf)",
    "url": "http://allrecipes.com/recipe/229161/ratloaf-halloween-meatloaf/"
}
