{
    "directions": [
        "Peel potatoes and cut into 1 1/2-inch pieces. Transfer to a bowl and cover with cold water.",
        "Toast coconut in a 12-inch heavy skillet over medium heat, stirring occasionally, until golden, about 3 minutes. Transfer to a small bowl and wipe out skillet. Toast cumin seeds in skillet over medium heat, shaking skillet frequently, until fragrant and just a shade darker, about 30 seconds. Transfer to another small bowl. Reserve skillet.",
        "Purée jalapeño, ginger, and garlic in a blender with curry powder, cinnamon, turmeric, oil, 1/4 cup water, and 1 teaspoon salt until smooth. Transfer purée to skillet and cook over medium-high heat, stirring, until thickened slightly, about 1 minute. Add onion and cook, stirring occasionally, until it begins to soften, about 8 minutes.",
        "Drain potatoes, then add to onion mixture with cumin seeds and cook over medium heat, stirring occasionally, until potatoes are barely tender, about 10 minutes.",
        "Add chickpeas and remaining 1 1/2 cups water, scraping up any brown bits, then briskly simmer, covered, until potatoes are tender, 16 to 20 minutes more. Add peas and cook, covered, until just tender, about 3 minutes. Remove from heat and stir in toasted coconut and cilantro.",
        "Whisk flours, cumin seeds, salt, and water in a bowl.",
        "Generously brush a 12-inch nonstick skillet with oil and heat over medium-high heat until it shimmers. Pour 1/2 cup batter into skillet, swirling until bottom is coated. Cook, undisturbed, until dosa is set and edges are golden, about 2 minutes. Flip using a rubber spatula and cook dosa until underside is golden in spots, about 1 minute more. Transfer to a plate. Make more dosas with remaining batter, stacking and covering loosely with foil to keep warm. To serve, spoon masala filling into dosas."
    ],
    "ingredients": [
        "1 1/2 pounds Yukon Gold potatoes",
        "1/3 cup dried grated unsweetened coconut",
        "2 teaspoons cumin seeds",
        "1 (3-inch) fresh jalapeño, coarsely chopped, including seeds",
        "1 (2 1/2-inch) piece peeled ginger, coarsely chopped",
        "3 garlic cloves, smashed",
        "1 tablespoon curry powder",
        "1/2 teaspoon cinnamon",
        "1/2 teaspoon turmeric",
        "1/3 cup vegetable oil",
        "1 3/4 cups water, divided",
        "1 large onion, chopped (about 3 cups)",
        "1 (15-to 19-ounces) can chickpeas, rinsed and drained",
        "1/2 cup frozen peas (do not thaw)",
        "1/2 cup chopped cilantro",
        "1/2 cup semolina flour",
        "1/2 cup rice flour",
        "1/2 cup all-purpose flour",
        "1/2 teaspoon cumin seeds",
        "1/2 teaspoon salt",
        "2 cups water",
        "Vegetable oil for brushing"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Vegetarian",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Spice",
        "Curry",
        "Chickpea",
        "Pea",
        "Jalapeño",
        "Gourmet",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Rava Dosas with Potato Chickpea Masala",
    "url": "http://www.epicurious.com/recipes/food/views/rava-dosas-with-potato-chickpea-masala-356035"
}
