{
    "directions": [
        "In a bowl, combine the Meatloaf, balsamic vinegar, Parmesan, and oregano, mix well, and set aside",
        "Using the Fresh Pasta recipe, roll out your dough either by hand or by machine.",
        "After you have rolled the pasta out into sheets, cut the sheet into an even amount of squares. Using a teaspoon fill the center of half with the filling. Brush around the filling with the egg wash and place the remaining squares on top. Press down around the seal to push out any air bubbles.",
        "In half a gallon of rapidly boiling salted water add the ravioli in batches. Remove to a strainer.",
        "In a separate pan over medium heat place the butter until it just starts to brown. Toss in 10 ravioli until coated. Sprinkle in the sage and toss again to evenly distribute.",
        "In a food processor bowl, combine croutons, black pepper, cayenne pepper, chili powder, and thyme. Pulse until the mixture is of a fine texture. Place this mixture into a large bowl. Combine the onion, carrot, garlic, and red pepper in the food processor bowl. Pulse until the mixture is finely chopped, but not pureed. Combine the vegetable mixture, ground sirloin, and ground chuck with the bread crumb mixture. Season the meat mixture with the kosher salt. Add the egg and combine thoroughly, but avoid squeezing the meat.",
        "By Hand:",
        "On a clean surface make a well with the flour. In a measuring cup mix the eggs, water and oil and salt. Pour the wet mixture slowly into the flour and mix with your 2 fingers until all of the wet is incorporated. Do not force the dough to take all of the flour. If you are going to use a pasta machine to roll out the dough you may at this point form the dough into a disk and cover with plastic wrap. Place in the refrigerator for 1 hour to rest. If you going to roll this by hand you should knead the dough on a floured work surface for 8 to 10 minutes.",
        "By Food Processor:",
        "In the bowl of your food processor combine the flour and salt and pulse 2 to 3 times. In a liquid measuring cup whisk the eggs, water and oil. While pulsing the machine pour this mixture in a continuous stream and continue running the machine until the dough begins to pull away from the sides of the bowl. Follow directions above for hand rolling or machine."
    ],
    "ingredients": [
        "1/4 recipe Alton Brown's Meatloaf, recipe follows",
        "1 tablespoon balsamic vinegar",
        "3 tablespoons grated Parmesan",
        "1/2 teaspoon dry oregano",
        "Fresh Pasta Dough, recipe follows",
        "1 egg mixed with 1 teaspoon water (eggwash)",
        "2 tablespoons butter",
        "1 tablespoon sliced sage",
        "6 ounces garlic-flavored croutons",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon cayenne pepper",
        "1 teaspoon chili powder",
        "1 teaspoon dried thyme",
        "1/2 onion, roughly chopped",
        "1 carrot, peeled and broken",
        "3 whole cloves garlic",
        "1/2 red bell pepper",
        "18 ounces ground sirloin",
        "18 ounces ground chuck",
        "1 1/2 teaspoons kosher salt",
        "1 egg",
        "3 cups all-purpose flour",
        "2 large eggs",
        "3 tablespoons water",
        "1 teaspoon olive oil",
        "1/2 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Food Processor",
        "Italian",
        "Ravioli",
        "Pasta Recipes",
        "Cheese",
        "Meat",
        "Appetizer",
        "Main Dish Recipes"
    ],
    "title": "Ravioli",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/ravioli-recipe"
}
