{
    "directions": [
        "In a medium bowl, cream together the butter and sugar until smooth. Beat in the egg, then stir in the vanilla and almond extracts and lemon zest. Combine the flour, baking soda and salt; stir into the creamed mixture until a smooth dough forms. Divide dough into halves. Roll each portion out between two sheets of waxed paper into a 12 inch square. Refrigerate for at least one hour.",
        "Preheat the oven to 350 degrees F (175 degrees C). Grease cookie sheets.",
        "Remove one piece of the dough from the refrigerator, remove the top layer of waxed paper, and cut into 1 1/2 inch squares. Place about 1/4 teaspoon of the cherry preserves into the center of the first sheet of squares. Set aside. Remove the remaining piece of dough from the refrigerator, remove top layer of waxed paper, and cut into 1 1/2 inch squares also. Poke holes for venting in these squares using a fork. Place each vented square over one of the filled squares, and gently seal the edges by pressing with the tines of a fork. Place cookies 2 inches apart onto prepared cookie sheets.",
        "Bake for 9 to 11 minutes in the preheated oven, or until the edges are lightly browned. Allow cookies to cool for 5 minutes on the baking sheets before removing to wire racks to cool completely. Dust cookies with confectioners' sugar while they are still warm."
    ],
    "ingredients": [
        "1 cup butter, softened",
        "2/3 cup white sugar",
        "1 egg, beaten",
        "1 1/2 teaspoons vanilla extract",
        "1/4 teaspoon almond extract",
        "1 teaspoon grated lemon zest",
        "2 1/2 cups all-purpose flour",
        "1/4 teaspoon baking soda",
        "1/8 teaspoon salt",
        "1/2 cup cherry preserves",
        "1/2 cup confectioners' sugar for dusting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ravioli Dolci (Sweet Ravioli)",
    "url": "http://allrecipes.com/recipe/45204/ravioli-dolci-sweet-ravioli/"
}
