{
    "directions": [
        "Bring first 4 ingredients to boil in small saucepan. Cook uncovered until peas are just tender, about 3 minutes. Cool slightly. Transfer mixture to blender; puree until smooth (sauce will be thin). Season with salt and pepper. (Can be prepared 6 hours ahead. Cover and chill. Rewarm before using.)",
        "Cut top 3 inches off asparagus; cut into 1/2-inch lengths. Cook in saucepan of boiling salted water until tender, about 3 minutes. Drain; place in bowl of ice water. Drain; pat dry. Mix cheese and mint in medium bowl. Stir in asparagus. Season with salt and pepper; mix in egg.",
        "Follow directions for making and rolling Fresh Egg Pasta dough into sheets. Starting 1 inch from 1 short side of 1 pasta sheet, drop ricotta filling by rounded teaspoonfuls down center of sheet, spacing mounds 2 inches apart. Brush pasta edges and between mounds of filling lightly with water. Cover with second pasta sheet, pressing down around filling to eliminate air pockets and to seal. Using fluted pastry wheel, cut pasta between filling, trimming sides to form 2- to 2 1/4-inch ravioli. Repeat with more pasta and remaining filling, making about 36. (Reserve remaining pasta for another use, cutting into shapes and drying on floured work surface.) Place ravioli on floured baking sheet; let dry 30 minutes. (Can be made 6 hours ahead. Cover; chill.)",
        "Working in 2 batches, cook ravioliin very large pot of boiling salted water until just tender, stirring gently, about 3 minutes. Drain ravioli. Divide hot pea sauce among 6 plates. Top with ravioli. Drizzle with olive oil and serve."
    ],
    "ingredients": [
        "1 cup shelled fresh or frozen green peas",
        "1 cup water",
        "1 tablespoon chopped green onion",
        "1/2 teaspoon salt",
        "1 pound slender asparagus",
        "3/4 cup fresh whole-milk ricotta cheese (6 ounces)",
        "1 teaspoon minced fresh mint",
        "1 large egg",
        "Fresh Egg Pasta",
        "Extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Vegetable",
        "Vegetarian",
        "Ricotta",
        "Mint",
        "Asparagus",
        "Pea",
        "Spring",
        "Noodle"
    ],
    "title": "Ravioli di Ricotta e Asparagi con Salsa di Piselli",
    "url": "http://www.epicurious.com/recipes/food/views/ravioli-di-ricotta-e-asparagi-con-salsa-di-piselli-232093"
}
