{
    "directions": [
        "Combine 1 1/4 cup water, flour, sugar, 1 teaspoon salt, vegetable oil, and yeast in the mixing bowl of a stand mixer. Mix on low speed using the dough hook until well-developed, about 8 minutes. To ensure the gluten has developed fully, cut off a walnut-sized piece of dough. Flour your fingers, and then stretch the dough: if it tears immediately, the dough needs more kneading. Fully developed dough should form a thin translucent \"windowpane.\"",
        "Transfer the dough to a lightly oiled bowl, cover it with plastic wrap and a kitchen towel, and let rise for 2 hours.",
        "Punch the dough down, place it on a lightly floured work surface, and use a knife or dough scraper to divide the dough into 6 pieces (or more, for smaller bagels). Roll each piece of dough into a sausage shape about 6 inches long. Join the ends to form a circle. Repeat with the remaining dough, and let the bagels rest for 15 minutes.",
        "Preheat oven to 475 degrees F (245 degrees C). Line a baking sheet with parchment paper. Arrange small plates with poppy seeds, sesame seeds, and onion flakes next to the baking sheet.",
        "Bring 4 quarts water to a boil in a large pot. Add honey, if desired (see Editor's Note). Boil the bagels, three at a time, until they rise to the surface of the pot, about 1 minute per side. Remove the bagels with a slotted spoon and place them on the parchment-lined baking sheet.",
        "Dip the tops of the wet bagels into the toppings and arrange them, seeds up, on the baking sheet. Sprinkle with coarse salt, if desired. Bake in the preheated oven until the bagels begin to brown, 15 to 20 minutes."
    ],
    "ingredients": [
        "For the Bagels:",
        "1 1/4 cups water",
        "4 1/2 cups bread flour",
        "3 tablespoons white sugar",
        "1 teaspoon salt",
        "2 tablespoons vegetable oil",
        "1 tablespoon instant yeast",
        "4 quarts water",
        "1 cup honey (optional)",
        "Toppings:",
        "2 tablespoons poppy seeds (optional)",
        "2 tablespoons sesame seeds (optional)",
        "2 tablespoons dried onion flakes (optional)",
        "1 tablespoon coarse salt (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Real Homemade Bagels",
    "url": "http://allrecipes.com/recipe/220619/real-homemade-bagels/"
}
