{
    "directions": [
        "In a large fry pan over medium heat, warm the oil. Add the onion, celery and bell pepper and cook, stirring occasionally, until the onion softens, about 5 minutes. Add the beef, increase the heat to medium-high and cook, stirring and breaking up the beef with a wooden spoon, until it is no longer pink, about 10 minutes. Stir in 1/4 cup water, the tomato sauce, chili sauce, Worcestershire sauce, mustard, vinegar, sugar, salt and pepper and bring to a simmer. Reduce the heat to medium-low and simmer, stirring frequently, for about 20 minutes to blend the flavors.",
        "Toast the buns. Place the bottom halves of the buns, cut side up, on warmed individual plates and top with the beef mixture, dividing it equally. Cover with the bun tops and serve immediately. Makes 6 sandwiches.",
        "Variation:",
        "Sloppy Joes are just as good when made with ground turkey or ground chicken. Some cooks like to add 1 to 2 cups cooked kidney or pinto beans to the beef mixture just before it is ready. Or, you can top the beef mixture with thin slices of cheddar cheese before covering with the bun tops.",
        "Adapted from Williams-Sonoma",
        "Comfort Food,",
        "by Rick Rodgers (Oxmoor House, 2009)."
    ],
    "ingredients": [
        "1 Tbs. canola oil",
        "1 yellow onion, diced",
        "1 celery stalk, diced",
        "1/4 cup finely diced green bell pepper",
        "1 1/2 lb. ground beef",
        "1 cup tomato sauce",
        "1/2 cup ketchup-style chili sauce",
        "1 Tbs. Worcestershire sauce",
        "1 Tbs. Dijon mustard",
        "1 Tbs. cider vinegar",
        "1 Tbs. firmly packed light brown sugar",
        "1 tsp. kosher salt",
        "1/4 tsp. freshly ground pepper",
        "6 sesame-seed sandwich buns, split"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Real Sloppy Joes",
    "url": "http://www.williams-sonoma.com/recipe/real-sloppy-joes.html"
}
