{
    "directions": [
        "Fill a large bowl with cold water. Using a mandoline or a very sharp knife, slice the baking and purple potatoes into 1/8-inch-thick rounds then transfer to the cold water to soak for 5 minutes. While the potatoes soak, slice the beets into 1/8-inch-thick rounds.",
        "Remove the potatoes from the water and transfer them to a paper towel–lined plate, patting them completely dry.",
        "Line a large baking sheet with paper towels. Fill a deep, heavy-bottomed medium saucepan (or deep fryer) with 4 inches of oil, leaving at least 3 inches between the oil and the top of the saucepan. Heat the oil over moderately high heat until a deep-fry thermometer registers 350°F.",
        "Working in batches, use a slotted metal spoon or spider to carefully place the potato rounds in the hot oil. Fry, flipping as needed, until golden brown, 2 to 3 minutes. Transfer as done to the paper towel–lined baking sheet and immediately season with salt. Continue to fry the remaining potatoes, returning the oil to 350°F between batches.",
        "Once all the potatoes are fried, fry the beets: Working in batches, use a slotted metal spoon or spider to carefully place the beet rounds in the hot oil. Fry, flipping as needed, until they begin to curl around the edges, 3 to 4 minutes. Transfer as done to the paper towel–lined baking sheet and immediately season with salt. Continue to fry the remaining beet rounds, returning the oil to 350°F between batches.",
        "In a large bowl, toss together the potato and beet chips, season with additional salt if necessary, and serve. DO AHEAD: Potato and beet chips can be fried ahead and stored in an airtight container for 3 days."
    ],
    "ingredients": [
        "1/2 pound baking potatoes, such as russet or Idaho (about 2 small potatoes)",
        "1/2 pound purple potatoes (about 4 small potatoes)",
        "1/2 pound beets, peeled, and greens removed (about 2 small beets)",
        "6 cups vegetable or canola oil",
        "Kosher or sea salt",
        "Equipment: Mandoline (optional), large baking sheet, deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Fry",
        "Fourth of July",
        "Kid-Friendly",
        "Quick & Easy",
        "Backyard BBQ",
        "Root Vegetable",
        "Beet",
        "Summer",
        "Deep-Fry",
        "Party"
    ],
    "title": "Red, White, and Blue Potato and Beet Chips",
    "url": "http://www.epicurious.com/recipes/food/views/red-white-and-blue-potato-and-beet-chips-51170000"
}
