{
    "directions": [
        "Put beans in a large saucepan with enough water to cover by 2 inches. Bring to a boil, then boil 2 minutes. Remove from heat and let stand, covered, 1 hour. Drain well.",
        "Cook onion, garlic, chiles, Cubanelles, recao, and sun-dried tomatoes in oil in a large heavy pot over medium heat, stirring occasionally, until browned, about 12 minutes. Add bay leaf and pimentón and cook, stirring, 2 minutes, then add beans and water and simmer, covered, until beans are very tender, 11/2 to 2 hours. Discard bay leaf.",
        "Purée soup in batches in a blender (use caution when blending hot liquids). Reheat over medium-low heat. Season with salt and pepper. Stir in lemon juice.",
        "Stir together zest, garlic, and parsley.",
        "Serve soup sprinkled with gremolata and drizzled with oil."
    ],
    "ingredients": [
        "1 (1-pound) bag dried red kidney beans, picked over and rinsed",
        "1 large onion, chopped",
        "4 large garlic cloves, chopped",
        "4 fresh ají dulce chiles, stemmed, seeded, and chopped",
        "2 Cubanelle peppers (Italian green frying peppers), seeded and chopped",
        "1/2 cup chopped recao (culantro) or cilantro leaves",
        "1/4 cup chopped sun-dried tomatoes (preferably oil-packed), drained",
        "1/4 cup extra-virgin olive oil plus additional for drizzling",
        "1 Turkish or 1/2 California bay leaf",
        "1/2 teaspoon sweet piment&ocute;n (smoked paprika)",
        "2 1/2 quarts water",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon grated lemon zest",
        "1 garlic clove, minced",
        "1/4 cup finely chopped flat-leaf parsley",
        "2 1/2 quarts water",
        "1 tablespoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Garlic",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Lemon",
        "Cilantro",
        "Parsley",
        "Paprika",
        "Gourmet"
    ],
    "title": "Red-Bean Soup with Gremolata",
    "url": "http://www.epicurious.com/recipes/food/views/red-bean-soup-with-gremolata-351299"
}
