{
    "directions": [
        "Preheat an oven to 375 degrees F (190 degrees C).",
        "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 8 minutes. Set the bacon on a paper towel-lined plate, leaving bacon fat in the skillet. Brown the ham and sausage in the bacon fat, about 10 minutes. Remove from pan.",
        "Add the onions, celery, red and green bell peppers to the pan used to cook the meat, adding peanut oil if the pan is too dry. Cook and stir until the vegetables are tender, about 5 to 8 minutes. Stir in the garlic and cook 2 minutes. Add the eggplant, and cook for 5 more minutes. Place the cooked veggies in the bottom of a large casserole or oven-proof baking dish.",
        "Heat 1 teaspoon peanut oil in the skillet. Pour in the uncooked rice; cook and stir until the rice is fragrant and golden, about 3 minutes. Spoon the rice over the veggies in the casserole dish. Cover the rice with the cooked bacon, ham, and sausage.",
        "Return the skillet to medium heat, and cook the okra until lightly brown. Pour in the red wine and simmer until the wine has almost evaporated completely. Stir chicken stock, tomato puree, bay leaves, salt, basil, thyme, and black pepper into the okra; bring to a boil. Pour the okra mixture into the casserole dish, and cover the dish tightly with foil. Bake in the preheated oven until the rice is tender, about 1 to 1 1/4 hours. Remove the bay leaves and serve with hot sauce."
    ],
    "ingredients": [
        "3 slices bacon, chopped",
        "1 cup cubed fully cooked ham",
        "1 pound smoked sausage, sliced",
        "2 cups diced onion",
        "1 cup diced celery",
        "1 cup diced green bell pepper",
        "1 cup diced red bell pepper",
        "1 teaspoon peanut oil (optional)",
        "2 tablespoons minced garlic",
        "1 cup peeled and diced eggplant",
        "1 teaspoon peanut oil",
        "2 cups uncooked white rice",
        "2 cups sliced fresh okra",
        "1/2 cup red wine",
        "2 cups chicken stock",
        "1 (14.25 ounce) can tomato puree",
        "2 bay leaves",
        "2 1/2 teaspoons salt",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon dried thyme",
        "1/2 teaspoon ground black pepper",
        "hot pepper sauce (such as Cholula®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Red Rice Purloo",
    "url": "http://allrecipes.com/recipe/218442/red-rice-purloo/"
}
