{
    "directions": [
        "Trim excess fat from duck legs, reserving fat for the sautéed kale. In a large bowl marinate duck legs in wine with bouquet garni, covered and chilled, 2 hours.",
        "Transfer legs to a plate, reserving wine and bouquet garni. In a heavy kettle large enough to hold legs in one layer heat oil over moderately high heat until hot. Pat legs dry with paper towels and season with salt. Cook legs, skin sides down, 20 minutes, or until skin is crisp and mahogany-colored, removing fat from kettle as it rendered with a metal bulb baster (or very carefully pouring it off). Turn legs and cook until browned on other side, about 2 minutes, transferring as browned to a plate.",
        "Pour off all but about 2 tablespoons fat from kettle and sauté vegetables with salt to taste, stirring occasionally, until tender and lightly browned, about 15 minutes. Add duck legs, skin sides up, with parsley sprigs and reserved wine and bouquet garni and simmer, covered, 1 1/2 hours, or until tender. Braised duck legs may be prepared up to this point 2 days ahead and chilled, covered. Reheat mixture over low heat, adding 1/3 cup water, before proceeding with duck preparation.",
        "Preheat oven to 400°F.",
        "In a shallow baking pan large enough to hold onions and pears in one layer melt butter in oven and swirl pan to coat. Add onion halves, cut sides down, and quarters, and bake 30 minutes. Add pears, cut side down, to pan and bake 20 minutes, or until pears and onions are tender and lightly browned. In a cup stir together lemon juice, honey, and salt and add to onions and pears, tossing to coat.",
        "Transfer duck legs to a warm plate and keep warm, covered with foil. Discard parsley sprigs and bouquet garni and strain liquid into a 1-quart measuring cup, reserving vegetables. Let liquid stand until fat rises to top and skim and discard fat. Return liquid to kettle and simmer until reduced to about 2 cups. Add beurre manié, a little at a time, whisking, and boil 2 minutes. Stir reserved vegetables and minced parsley into sauce and heat through if necessary.",
        "Serve duck legs, with sauce spooned over them and garnished with parsley sprigs, with roasted pears and onions."
    ],
    "ingredients": [
        "4 large duck legs* (about 2 3/4 pounds total, cut from two 5 1/2- to 6-pound ducks)",
        "a 750-ml. bottle light fruity red wine such as Pinot Noir (about 3 1/4 cups)",
        "a bouquet garni of 10 lightly crushed juniper berries**, 3 whole cloves, a 4- by 1 inch strip orange zest, and 1 bay leaf tied together in a cheesecloth bag",
        "1 tablespoon vegetable oil",
        "1 large carrot, cut into 1/4-inch dice",
        "1 large celery rib, cut into 1/4-inch dice",
        "1 large onion , cut 1/4-inch dice",
        "2 large fresh parsley sprigs plus 1 tablespoon minced fresh parsley leaves",
        "3 medium onions, halved or quartered",
        "2 ripe Bosc pears",
        "2 tablespoons unsalted butter",
        "1 tablespoon fresh lemon juice",
        "2 teaspoons honey",
        "1/4 teaspoon salt",
        "a beurre manié made by rubbing together 2 tablespoons softened unsalted butter and 2 tablespoons all-purpose flour",
        "Garnish: parsley sprigs",
        "*available at some butcher shops",
        "**available in spice section of supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Onion",
        "Braise",
        "Marinate",
        "Pear",
        "Red Wine",
        "Fall",
        "Gourmet"
    ],
    "title": "Red-Wine-Braised Duck Legs with Roasted Pears and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-braised-duck-legs-with-roasted-pears-and-onions-10898"
}
