{
    "directions": [
        "Preheat oven to 350°F. Butter and flour two 9-inch-diameter cake pans with 1 1/2-inch-high sides. Sift sifted flour, cocoa powder, baking powder, baking soda, and salt into medium bowl. Whisk buttermilk, food coloring, vinegar, and vanilla in small bowl to blend. Using electric mixer, beat sugar and butter in large bowl until well blended. Add eggs 1 at a time, beating until well blended after each addition. Beat in dry ingredients in 4 additions alternately with buttermilk mixture in 3 additions.",
        "Divide batter between prepared pans. Bake cakes until tester inserted into center comes out clean, about 27 minutes. Cool in pans on racks 10 minutes. Turn cakes out onto racks; cool completely.",
        "Beat cream cheese and butter in large bowl until smooth. Beat in vanilla. Add powdered sugar and beat until smooth.",
        "Place 1 cake layer, flat side up, on platter. Spread 1 cup frosting over top of cake. Arrange 1 basket raspberries and 1/2 basket blueberries atop frosting, pressing lightly to adhere. Top with second cake layer, flat side down. Spread remaining frosting over top and sides of cake. Arrange remaining berries decoratively over top of cake. (Can be made 1 day ahead. Cover and refrigerate. Let stand at room temperature 1 hour before serving.)"
    ],
    "ingredients": [
        "2 1/4 cups sifted cake flour (sifted, then measured)",
        "2 tablespoons unsweetened cocoa powder",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup buttermilk",
        "1 tablespoon red food coloring",
        "1 teaspoon distilled white vinegar",
        "1 teaspoon vanilla extract",
        "1 1/2 cups sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "2 large eggs",
        "2 8-ounce packages cream cheese, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 tablespoon vanilla extract",
        "2 1/2 cups powdered sugar",
        "3 1/2-pint baskets fresh raspberries",
        "3 1/2-pint baskets fresh blueberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Mixer",
        "Berry",
        "Chocolate",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Mother's Day",
        "Cream Cheese",
        "Summer",
        "Birthday",
        "Shower",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Red Velvet Cake with Raspberries and Blueberries",
    "url": "http://www.epicurious.com/recipes/food/views/red-velvet-cake-with-raspberries-and-blueberries-108256"
}
