{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch cake pan. Whisk the flour, cocoa powder, baking soda, and salt in a bowl; set aside. Stir the milk, food coloring, vinegar, and 1/2 teaspoon vanilla extract together in a small bowl; set aside.",
        "Beat the softened butter and 3/4 cup sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Beat in the egg until smooth.  Pour in the flour mixture alternately with the milk, mixing until just incorporated. Pour the batter into prepared pan.",
        "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 30 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
        "Once the cake has cooled, cut half of the cake into cubes, and set aside. Cut the remaining cake into 1/2-inch strips, and place onto a baking sheet.",
        "Return the cake strips to the oven, and bake until they have dried out, about 15 minutes. Turn the strips over halfway through cooking so they dry evenly. Once completely dry, allow to cool to room temperature, then crush  into fine crumbs.",
        "Combine the cake crumbs with the melted butter until evenly moistened. Press into a 10-inch springform pan, and refrigerate until the butter has hardened, about 45 minutes.",
        "When the crust has nearly hardened, whip the whipping cream until stiff; set aside. Beat the softened cream cheese in a bowl with 2/3 cup sugar and 2 teaspoons vanilla extract until smooth. Fold in the whipped cream until evenly mixed. Pour half of the cream cheese mixture into hardened crumb crust. Spread the cake cubes evenly over the cream cheese mixture, then spread the remaining cream cheese over top. Refrigerate at least 4 hours until the cream cheese has set and the cheesecake is firm."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1 tablespoon unsweetened cocoa powder",
        "1 1/4 teaspoons baking soda",
        "1/2 teaspoon salt",
        "1/2 cup milk",
        "2 tablespoons red food coloring",
        "1 1/2 teaspoons distilled white vinegar",
        "1/2 teaspoon vanilla extract",
        "1/4 cup unsalted butter, softened",
        "3/4 cup white sugar",
        "1 egg",
        "1/3 cup melted unsalted butter",
        "1 pint heavy whipping cream",
        "2 (8 ounce) packages cream cheese, softened",
        "2/3 cup white sugar",
        "2 teaspoons vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Red Velvet-Center Cheesecake",
    "url": "http://allrecipes.com/recipe/217390/red-velvet-center-cheesecake/"
}
