{
    "directions": [
        "Prepare the short ribs: In a large oven-safe pot or Dutch oven over medium-high heat, heat the ghee or olive oil.",
        "Pat the short ribs dry with paper towels and season with the sea salt. Gently place the short ribs in the hot ghee or oil and sear on all sides until golden brown, about 4 minutes per side, turning as needed and searing in batches if needed to avoid overcrowding the pot. Transfer to a plate.",
        "To the same pot, add the onion, carrot and celery and cook until the veggies begin to brown, stirring as needed to avoid burning, about 5 minutes.",
        "Add the wine and deglaze the pot, scraping the browned bits loose from the bottom of the pot. Add the thyme and garlic and bring to a simmer. Let the wine reduce by half, about 10 minutes, then remove the pot form the heat.",
        "Place the browned short ribs into the wine reduction along with the bone broth and let marinate for 1 hour in the refrigerator. Alternatively, you can prepare this dish in advance by letting the ribs marinate for a full 24 hours-well worth it in our opinion.",
        "Preheat the oven to 350°F.",
        "Remove the pot from the refrigerator, cover with a lid or aluminum foil, and transfer to the oven to braise for 2 1/2 hours.",
        "At the 2 hour mark, when 30 minutes remain on the cooking time for the short ribs, prepare the vegetables: On a baking sheet, toss the potatoes, carrots, and mushrooms with the ghee or oil and sea salt. Spread out in and even layer and roast in the oven for 20 to 25 minutes, until the potatoes and carrots are knife-tender.",
        "Remove the pot with the short ribs from the oven, uncover, and transfer the meat to a plate. Strain the braising liquid into a deep serving dish; discard the solids from the liquid. Add the roasted veggies to the serving dish and stir to distribute evenly. Using your hands or a fork, break the short ribs into chunks and stir in as well. Garnish with a little chopped fresh parsley and serve family style.",
        "The stew or any leftovers can be refrigerated for up to 1 week, or frozen for up to 6 months."
    ],
    "ingredients": [
        "1 tablespoon ghee or olive oil",
        "3 pounds boneless short ribs, trimmed",
        "1 tablespoon sea salt",
        "1 onion, peeled and chopped",
        "1 carrot, scrubbed and chopped",
        "1 celery stalk, chopped",
        "1 cup port or red wine",
        "6 sprigs fresh thyme",
        "4 whole garlic cloves",
        "2 cups Beef Bone Broth",
        "Chopped fresh flat-leaf parsley, for serving",
        "2 potatoes, diced",
        "2 carrots, peeled and diced",
        "8 shiitake mushrooms, stems removed, caps chopped",
        "1 tablesepoon ghee or olive oil",
        "1 teaspoon sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Beef Rib",
        "Dinner",
        "Kid-Friendly",
        "Soup/Stew",
        "Potato",
        "Carrot",
        "Mushroom",
        "One-Pot Meal",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Red Wine-Braised Short Rib Stew with Potatoes, Carrots, and Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-braised-short-rib-stew-with-potatoes-carrots-and-mushrooms"
}
