{
    "directions": [
        "Cut broccoli into 1-inch-wide florets (with 1/2 inch of stem). Blanch in a 6- to 8-quart pot of boiling salted water , uncovered, 2 minutes. Transfer with a slotted spoon to a large colander to drain, reserving broccoli-cooking liquid in pot, then transfer broccoli to a bowl.",
        "Return cooking liquid to a boil and cook spaghetti, stirring occasionally, 5 minutes (pasta will not be fully cooked). Drain in colander and return empty pot to stovetop. Add wine and sugar to pot and boil vigorously 2 minutes. Add spaghetti and shake pot to prevent pasta from sticking. Gently stir with tongs until coated and boil over high heat, stirring occasionally, until most of liquid is absorbed, about 6 minutes (pasta will be al dente).",
        "Immediately after adding spaghetti to wine mixture, cook garlic and red pepper flakes in oil in a deep 12-inch heavy skillet over moderately low heat, shaking skillet occasionally, until garlic is pale golden, about 5 minutes. Add broccoli, salt, and pepper and cook, stirring, 1 minute.",
        "Increase heat to high and pour spaghetti mixture into skillet, tossing with tongs to combine (skillet will be very full). Cook, stirring, until all of wine is absorbed, about 2 minutes. Remove from heat and stir in cheese. Serve immediately."
    ],
    "ingredients": [
        "1 3/4 lb broccoli, thick stems discarded",
        "1 lb spaghetti",
        "1 (750-ml) bottle red wine (preferably Zinfandel)",
        "1 teaspoon sugar",
        "4 garlic cloves, finely chopped (2 tablespoons)",
        "1/2 teaspoon dried hot red pepper flakes",
        "1/3 cup extra-virgin olive oil",
        "3/4 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 oz finely grated Parmigiano-Reggiano (1/2 cup)",
        "Accompaniment: finely grated Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pasta",
        "Vegetarian",
        "Quick & Easy",
        "Parmesan",
        "Broccoli",
        "Red Wine",
        "Gourmet"
    ],
    "title": "Red-Wine Spaghetti with Broccoli",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-spaghetti-with-broccoli-232801"
}
