{
    "directions": [
        "Place drained tomatoes in medium bowl. Using potato masher, crush tomatoes to coarse puree. Drain again, reserving juices.",
        "Heat oil in heavy large skillet over medium-high heat. Add onion and stir 30 seconds. Add garlic and stir 30 seconds. Add tomato puree and cook 1 minute. Add bay leaves, parsley, oregano, and 1/4 cup reserved tomato juices. Simmer until sauce thickens, about 3 minutes. Add olives, raisins, capers, and all remaining reserved tomato juices. Simmer until sauce thickens again, stirring occasionally, about 8 minutes. Season sauce to taste with salt and pepper. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 425°F. Spread 3 tablespoons sauce in bottom of 15x10x2-inch glass baking dish. Arrange fish atop sauce. Sprinkle fish lightly with salt and pepper. Spoon remaining sauce over. Bake uncovered until fish is just opaque in center, about 18 minutes. Using long spatula, transfer fish with sauce to plates. Garnish with pickled jalapeño halves."
    ],
    "ingredients": [
        "1 28-ounce can diced tomatoes in juice, well drained, juices reserved",
        "1/4 cup extra-virgin olive oil",
        "1/4 cup finely chopped white onion",
        "3 large garlic cloves, chopped",
        "3 small bay leaves",
        "2 tablespoons chopped fresh parsley",
        "1 teaspoon dried Mexican oregano",
        "1/4 cup chopped pitted green olives",
        "2 tablespoons raisins",
        "2 tablespoons drained capers",
        "6 4- to 5-ounce red snapper fillets",
        "3 pickled jalapeño chiles, halved lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Tomato",
        "Bake",
        "Cinco de Mayo",
        "Dinner",
        "Raisin",
        "Snapper",
        "Spring",
        "Healthy",
        "Jalapeño",
        "Capers",
        "Simmer"
    ],
    "title": "Red Snapper, Veracruz Style",
    "url": "http://www.epicurious.com/recipes/food/views/red-snapper-veracruz-style-108045"
}
