{
    "directions": [
        "In a large bowl stir together flour and salt. Add rabbit and toss to coat. In a heavy kettle heat 2 tablespoons oil over moderately high heat until hot but not smoking and brown rabbit in batches, transferring pieces to a bowl.",
        "Add onion and remaining tablespoon oil to kettle and sauté, stirring occasionally, until softened but not browned. Stir in garlic and rosemary and sauté, stirring, 1 minute. Add broth, wine, and rabbit with any juices accumulated in bowl and simmer, covered, 1 hour, or until rabbit is tender. Remove lid and simmer until sauce is thickened slightly. Stir in parsley.",
        "Stir sage into warm polenta. Serve polenta topped with rabbit and sauce.",
        "In a heavy saucepan bring water and salt to a boil and gradually whisk in cornmeal in a thin stream. Cook polenta over moderately low heat (it should be barely boiling), stirring constantly, until very thick and pulls away from side of pan, about 40 minutes for cornmeal and about 15 minutes 2for instant polenta. Remove pan from heat and cover to keep warm. Stir polenta just before using. Polenta will keep warm, covered, about 20 minutes. Makes about 3 cups.",
        "Note: In the traditional method of cooking polenta, forty minutes of constant stirring is required to achieve a lumpless texture and fragrant flavor. However, Italian-food expert Marcella Hazan has developed a method that involves very little stirring during this time. We believe it produces a very good polenta, one nearly as flavorful and smooth as the traditional procedure. To make satisfactory polenta in a real hurry, an imported instant polenta (precooked cornmeal) is available. This cooks in a mere fifteen minutes."
    ],
    "ingredients": [
        "2 tablespoons all-purpose flour",
        "1 teaspoon salt",
        "a 2 1/2- to 3-pound rabbit, thawed if frozen, cut into 7 or 8 serving pieces",
        "3 tablespoons olive oil",
        "1 large onion, chopped",
        "2 garlic cloves, minced",
        "2 teaspoons minced fresh rosemary leaves",
        "1 1/2 cups chicken broth",
        "1 cup dry red wine",
        "2 tablespoons coarsely chopped fresh parsley leaves",
        "2 tablespoons minced fresh sage leaves or 1 teaspoon dried, crumbled",
        "1 recipe basic polenta, kept warm",
        "4 cups water",
        "1 teaspoon salt",
        "1 cup cornmeal or instant polenta"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Braise",
        "Valentine's Day",
        "Fall",
        "Gourmet"
    ],
    "title": "Red-Wine Braised Rabbit with Sage Polenta",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-braised-rabbit-with-sage-polenta-13079"
}
