{
    "directions": [
        "Butter 9-inch springform pan. Mix flour, sugar, yeast and salt in processor. Add butter; using on/off turns, blend until butter is reduced to pea-size pieces. Add eggs and milk. Using on/off turns, blend until sticky dough forms. Using buttered fingertips, press dough onto pan bottom. Cover with plastic. Let dough rise in warm draft-free area until doubled in volume, about 1 3/4 hours.",
        "Stir wine and 3/4 cup sugar in medium saucepan over medium-high heat until sugar dissolves and mixture boils. Add pears. Reduce heat to medium-low; simmer until pears are tender, about 8 minutes. Cool mixture 30 minutes.",
        "Using slotted spoon, transfer pears to plate. Boil wine syrup in pan until reduced to 1 cup, about 4 minutes. Mix cornstarch and 1 teaspoon water in small bowl; stir into wine syrup. Cook until syrup thickens and boils, whisking occasionally, about 1 minute longer. Set sauce aside.",
        "Position rack in top third of oven; preheat to 400°F. Starting at edge of pan and leaving 1/2-inch plain border, arrange pear slices close together in concentric circles on dough. Sprinkle pears and dough edge with 2 tablespoons sugar.",
        "Bake tart until edge is brown, pears are tender and crust is cooked through, about 30 minutes. Transfer to rack; release pan sides. Cool at least 15 minutes. Cut tart into wedges; place on plates. Serve with sauce and crème fraîche."
    ],
    "ingredients": [
        "1 1/2cups all purpose flour",
        "3 tablespoons sugar",
        "2 teaspoons dry yeast",
        "3/4 teaspoon salt",
        "6 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "2 large eggs",
        "2 tablespoons whole milk",
        "1 3/4 cups dry red wine",
        "3/4 cup plus 2 tablespoons sugar",
        "1 1/4 pounds Bosc pears (3 medium), peeled, quartered, cored, each quarter cut into 3 wedges",
        "1 teaspoon cornstarch",
        "1 teaspoon water",
        "crème fraîche or sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Food Processor",
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Rosh Hashanah/Yom Kippur",
        "Pear",
        "Red Wine",
        "Fall",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Red Wine and Pear Brioche Tart",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-and-pear-brioche-tart-104047"
}
