{
    "directions": [
        "Prepare Cake: Preheat oven to 350 degrees F. Spray three 8-inch round cake pans with baking spray; set aside.",
        "Combine oil and granulated sugar in large mixing bowl with an electric mixer on medium speed. Blend in vinegar and vanilla. Add eggs, one at a time, beating until well blended after each addition. Add red food coloring; beat until combined.",
        "Combine flour, cocoa powder and baking soda in medium bowl. Add to sugar mixture alternately with buttermilk. Beat on low speed until blended after each addition. Pour batter evenly into prepared pans.",
        "Bake 20 to 25 minutes or until wooden pick inserted in centers comes out clean. Cool cakes in pans on wire racks 5 minutes. Remove cakes from pans; cool completely on wire racks.",
        "Prepare Frosting: Place cream cheese and butter in medium bowl; beat with an electric mixer on medium speed 1 to 2 minutes or until creamy. Gradually add confectioners' sugar and vanilla; blend until smooth.",
        "Assemble cake by placing one cake layer onto cake plate or cardboard cake round. Spread with some of the frosting. Place second and third cake layers over first with more frosting between layers. Frost top and sides of cake with remaining frosting. Garnish with pecans, if desired."
    ],
    "ingredients": [
        "PAM® Baking Spray",
        "3/4 cup Pure Wesson® Canola Oil",
        "2 cups granulated sugar",
        "1 tablespoon distilled white vinegar",
        "1 1/2 teaspoons vanilla extract",
        "3 eggs",
        "1 (1 ounce) bottle red food coloring",
        "3 cups Ultragrain® All Purpose Flour",
        "2 tablespoons unsweetened cocoa powder",
        "1 teaspoon baking soda",
        "1 1/3 cups lowfat buttermilk",
        "1 (8 ounce) package cream cheese, softened",
        "1/2 cup unsalted butter, softened",
        "16 ounces confectioners' sugar",
        "1 teaspoon vanilla extract",
        "Chopped pecans (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Red Velvet Cake with Cream Cheese Frosting by PAM®",
    "url": "http://allrecipes.com/recipe/238940/red-velvet-cake-with-cream-cheese-fro/"
}
