{
    "directions": [
        "Preheat the oven to 350 degrees F. Generously oil a 12-cup muffin pan.",
        "Combine the cake mix, oil, 3 of the eggs and 1 cup water until smooth; divide among the muffin cups. Bake until a tester comes out clean, about 18 minutes. Cool in the pan for 5 minutes, then cool completely on a wire rack.",
        "Meanwhile, beat the cream cheese, butter, confectioners' sugar, 1 teaspoon of the vanilla and a pinch of salt in the bowl of a stand mixer fitted with a paddle attachment (or in a large bowl if using a hand mixer) until smooth.",
        "Whisk the milk, egg yolks, granulated sugar, remaining 5 eggs and 1 tablespoon vanilla, and a pinch of salt in a large bowl until smooth.",
        "Butter a shallow 3-quart baking dish. Cut the cupcakes in quarters and scatter half over the bottom of the dish. Dollop half the frosting over the cupcakes, then pour in half the custard mixture. Repeat the layering once. Cover and refrigerate at least 1 hour or overnight.",
        "When ready to bake, preheat the oven to 350 degrees F. Uncover the bread pudding and sprinkle the pecans on top. Bake until the top is golden brown and the center is set, about 1 hour. If the pecans start to burn, loosely tent the dish with foil. Cool completely on a wire rack."
    ],
    "ingredients": [
        "1/3 cup vegetable oil, plus more for greasing pan",
        "One 16.5-ounce box red velvet cake mix",
        "8 large eggs plus 2 large egg yolks",
        "12 ounces cream cheese, softened",
        "4 tablespoons unsalted butter, softened, plus more for greasing dish",
        "1 cup confectioners' sugar",
        "1 tablespoon plus 1 teaspoon pure vanilla extract",
        "Fine salt",
        "4 cups whole milk",
        "1/4 cup granulated sugar",
        "1 cup pecans"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Bread Pudding",
        "Red Velvet Cake",
        "Egg Recipes",
        "Chocolate",
        "Dairy Recipes"
    ],
    "title": "Red Velvet Bread Pudding",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/red-velvet-bread-pudding"
}
