{
    "directions": [
        "Preheat oven to 350°F. Spread 1 tablespoon butter evenly over bottom of 9-inch-diameter springform pan. Sprinkle with graham cracker crumbs. Beat cream cheese in large bowl until smooth. Add 1 cup sugar and 1 teaspoon vanilla and beat until well blended. Using electric mixer fitted with clean dry beaters, beat egg whites in another large bowl until stiff but not dry. Gently fold beaten white into cheese mixture in 3 additions. Pour batter into pan.",
        "Bake cheesecake until filling is puffed and cracks begin to form around edges, about 35 minutes. Combine sour cream, remaining 1/4 cup sugar and remaining 1/2 teaspoon vanilla extract in small bowl and stir until well blended. Pour mixture over filling. Using spatula, spread sour cream mixture evenly over cheesecake to cover completely.",
        "Bake cheesecake 5 minute longer. Transfer pan to rack. Cool completely. Cover and refrigerate overnight. (Can be prepared 1 day ahead. Keep refrigerated.)",
        "Cut around cake to loosen; remove pan sides. Garnish with some berries. Cut into wedges and serve with remaining berries."
    ],
    "ingredients": [
        "1 tablespoon unsalted butter, room temperature",
        "2/3 cup coarsely ground graham cracker crumbs",
        "3 8-ounce packages cream cheese, room temperature",
        "1 1/4 cups sugar",
        "1 1/2 teaspoons vanilla extract",
        "4 large egg white",
        "2 cups sour cream",
        "2 1/2-pint baskets fresh raspberries",
        "1 1-pint basket fresh strawberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Berry",
        "Cheese",
        "Dairy",
        "Dessert",
        "Bake",
        "Christmas",
        "Valentine's Day",
        "Raspberry",
        "Strawberry",
        "Winter",
        "Sour Cream"
    ],
    "title": "Red Berry Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/red-berry-cheesecake-940"
}
