{
    "directions": [
        "Simmer 1/4 cup of the coconut milk in a heavy large saucepan over medium heat for 5 minutes, or until the oil separates from the milk. Stir in the curry paste and cook for 1 minute. Add the fish sauce and sugar and cook for 2 minutes, stirring constantly, or until the mixture darkens and thickens. Add the green beans and stir to coat. Add the remaining coconut milk and stir to scrape up the browned bits on the bottom of the pan. Stir in the ginger, lime leaves, and tamarind paste. Add the pineapple and simmer for 3 minutes, stirring occasionally, or until the sauce reduces and thickens slightly and the beans are crisp-tender. Add the lobster and basil leaves and cook for 4 minutes, or until the lobster is just cooked through.",
        "Discard the ginger and lime leaves. Season the curry with salt to taste. Transfer one half lobster tail to each warmed serving bowl, and spoon the curry over it. Serve the steamed rice on the side."
    ],
    "ingredients": [
        "One 14-ounce can unsweetened coconut milk",
        "2 tablespoons red curry paste",
        "1 1/2 tablespoons fish sauce (nam pla)",
        "1 (packed) tablespoon grated palm sugar (jaggery) or light brown sugar",
        "8 ounces Chinese long beans or green beans, ends trimmed",
        "4 slices peeled fresh ginger",
        "2 kaffir lime leaves or grated zest of 1 lime",
        "1 1/2 teaspoons tamarind paste",
        "1 1/2 cups bite-size cubes peeled fresh pineapple (about 1/4 of a pineapple)",
        "Two 8-ounce uncooked lobster tails in the shell, split lengthwise",
        "1/2 cup fresh basil leaves",
        "Salt",
        "Hot steamed rice, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Dinner",
        "Tropical Fruit",
        "Pineapple",
        "Seafood",
        "Lobster",
        "Curry",
        "Green Bean",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Red Curry of Lobster and Pineapple",
    "url": "http://www.epicurious.com/recipes/food/views/red-curry-of-lobster-and-pineapple-51222010"
}
