{
    "directions": [
        "Simmer yuca in boiling salted water until fork-tender, 30 to 35 minutes. Drain yuca and transfer to a large bowl, then cool to room temperature, about 30 minutes.",
        "While yuca is cooling, heat 1 tablespoon oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté onion with cumin and 1/4 teaspoon cayenne, stirring occasionally, until beginning to soften, about 2 minutes. Sprinkle salt and remaining 1/4 teaspoon cayenne over fish and add to onion in skillet, then sauté, turning fish over once, until just cooked through, 4 to 6 minutes. Transfer fish with onion to a plate and cool to room temperature.",
        "Remove thin, fibrous core from yuca if necessary, then coarsely mash yuca with a wooden spoon. Flake fish and add to yuca along with onion and herbs, tossing to combine (mixture will be coarse). Form into 12 (2 1/2-inch) cakes (1 inch thick) and transfer to a wax-paper-lined tray. Cover cakes with plastic wrap and chill 30 minutes.",
        "Cook garlic in oil in a small skillet over low heat, stirring, until just softened, about 3 minutes. Transfer garlic with oil to a small bowl and stir in remaining mojo ingredients. Chill mojo, covered, until serving.",
        "Heat 1 1/2 tablespoons oil over moderately high heat in a 12-inch heavy skillet (preferably nonstick) until hot but not smoking, then sauté half of cakes, turning over once, until browned and heated through, about 8 minutes total. Sauté remaining cakes in remaining 1 1/2 tablespoons oil. Serve with mojo and lime wedges.",
        "*Available at Latino markets and some supermarkets."
    ],
    "ingredients": [
        "1 1/2 pounds frozen yuca*",
        "1/4 cup vegetable oil",
        "1 medium onion, halved lengthwise then thinly sliced lengthwise",
        "1/4 teaspoon ground cumin",
        "1/2 teaspoon cayenne",
        "1 teaspoon kosher salt",
        "1 pounds red snapper fillets, skinned and any bones removed",
        "3 tablespoons coarsely chopped fresh cilantro",
        "3 tablespoons coarsely chopped fresh flat-leaf parsley",
        "6 garlic cloves, minced",
        "1 tablespoon vegetable oil",
        "1 cup fresh orange juice (from 2 oranges)",
        "1/4 cup fresh lime juice (from 2 limes)",
        "6 fresh Thai chiles (red or green), seeded and minced, or 2 to 3 serrano chiles (including seeds), minced",
        "1/2 cup thinly sliced shallot (4 small)",
        "1 teaspoon kosher salt",
        "Accompaniment: lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Sauté",
        "Lime",
        "Orange",
        "Snapper",
        "Hot Pepper",
        "Healthy",
        "Yuca",
        "Gourmet"
    ],
    "title": "Red Snapper Yuca Cakes with Mojo de Ajo",
    "url": "http://www.epicurious.com/recipes/food/views/red-snapper-yuca-cakes-with-mojo-de-ajo-108735"
}
