{
    "directions": [
        "In a bowl stir together the cookie crumbs and the butter until the mixture is combined well and pat the mixture onto the bottom and 1/2 inch up the side of a 9 1/2-inch springform pan. Chill the crust for 30 minutes.",
        "Preheat the oven to 325°F. In a bowl with an electric mixer beat the cream cheese until it is light and fluffy, add the sugar gradually, beating, and beat the mixture until it is combined well. Beat in the flour, add the eggs, 1 at a time, beating well after each addition, and beat in the sour cream, the zests, the salt, and the vanilla, beating the filling until it is combined well.",
        "Pour the filling into the crust and bake the cheesecake in a foil-lined shallow baking pan in the middle of the oven for 1 hour and 10 minutes. (The cheesecake will not be completely set; it will set as it cools.) Turn the oven off and let the cheesecake stand in the oven with the oven door propped open about 6 inches until it is cooled completely and remove the side of the pan.",
        "Arrange the raspberries on top of the cheesecake in a star shape and arrange the blueberries around the star to cover the top of the cheesecake."
    ],
    "ingredients": [
        "28 chocolate wafers, ground fine in a blender or food processor (about 1 1/2 cups crumbs)",
        "1 stick (1/2 cup) unsalted butter, melted",
        "four 8-ounces packages cream cheese, softened",
        "1 1/2 cups sugar",
        "2 tablespoons all-purpose flour",
        "5 large eggs",
        "1/2 cup sour cream",
        "1 teaspoon freshly grated orange zest",
        "1 teaspoon freshly grated lemon zest",
        "1/2 teaspoon salt",
        "1 1/2 teaspoons vanilla",
        "about 1 1/2 cups raspberries",
        "about 1 1/2 cups blueberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Cream Cheese",
        "Blueberry",
        "Raspberry",
        "Summer",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Red, White, and Blue Cheesecake with Chocolate Cookie Crust",
    "url": "http://www.epicurious.com/recipes/food/views/red-white-and-blue-cheesecake-with-chocolate-cookie-crust-12282"
}
