{
    "directions": [
        "Roast red bell peppers directly over gas flame or in broiler until blackened on all sides. Enclose peppers in paper bag and let stand 10 minutes. Peel and seed roasted peppers; cut into scant 1/2-inch-wide strips. (Roasted bell peppers can be prepared ahead. Cover and refrigerate up to 2 days.)",
        "Preheat oven to 450°F. Brush each of 2 large baking sheets with 1 tablespoon olive oil. Arrange eggplant rounds in single layer on baking sheets; sprinkle eggplant rounds on each baking sheet with 1 tablespoon olive oil. Bake until eggplant begins to soften but not brown, about 15 minutes. Remove from oven; maintain oven temperature.",
        "Heat 1 tablespoon olive oil in heavy large skillet over medium heat. Add 3 cups fresh breadcrumbs to skillet and sauté until golden, about 6 minutes. Remove skillet from heat.",
        "Arrange half of eggplant rounds in single layer in 12 x 9 x 2-inch oval baking dish. Sprinkle eggplant rounds with half of minced garlic, 1 tablespoon chopped fresh thyme and 3 tablespoons Niçois olives. Top with half each of thinly sliced plum tomatoes, anchovy fillets and roasted bell pepper strips, spacing evenly. Sprinkle lightly with salt and generously with black pepper. Drizzle with 2 tablespoons olive oil. Repeat layering with remaining eggplant rounds, minced garlic, 1 tablespoon thyme and 3 tablespoons Niçois olives. Top with remaining sliced plum tomatoes, spacing evenly, leaving 1 1/2-inch-wide space at edge of baking dish. Arrange remaining roasted red bell peppers and anchovies between tomato slices. Drizzle with remaining 2 tablespoons olive oil. Sprinkle with 1 tablespoon Niçois olives.",
        "Bake assembled tian 30 minutes. Sprinkle toasted breadcrumbs and remaining 1 tablespoon chopped fresh thyme around edge of baking dish. Continue to bake tian until vegetables are very tender, about 15 minutes longer. Let tian stand 15 minutes. Serve tian hot or at room temperature."
    ],
    "ingredients": [
        "4 large red bell peppers (about 2 pounds)",
        "9 tablespoons olive oil",
        "2 1-pound eggplants, peeled, cut crosswise into 1/4- to 1/2-inch-thick rounds",
        "3 cups fresh breadcrumbs made from crustless French bread",
        "3 garlic cloves, minced",
        "3 tablespoons chopped fresh thyme",
        "7 tablespoons coarsely chopped pitted Niçois olives or other brine-cured black olives",
        "6 large plum tomatoes, thinly sliced",
        "1 2-ounce can anchovy fillets, drained"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Side",
        "Bake",
        "Eggplant",
        "Summer",
        "Healthy"
    ],
    "title": "Red Bell Pepper and Eggplant Tian with Anchovies",
    "url": "http://www.epicurious.com/recipes/food/views/red-bell-pepper-and-eggplant-tian-with-anchovies-101598"
}
