{
    "directions": [
        "Preheat the oven to 350 degrees F. Thoroughly spray a large (18-by-12-inch) sheet cake pan (or you can use a slightly smaller jelly roll pan) with nonstick baking spray. Be sure to get in all the corners of the pan.",
        "Sift together the cake flour and salt. Set aside. In a separate bowl, stir together the buttermilk, vanilla, baking soda and eggs. Add the vinegar and stir. Set aside.",
        "In a separate small bowl, mix together the cocoa and red food coloring. Set aside. Cream together the shortening and sugar until fluffy. Alternate adding the flour mixture and the buttermilk/egg mixture until all combined. Pour in the red mixture and beat until combined.",
        "Pour the batter into the prepared sheet cake pan. Use a large offset spatula or knife to even out the surface. Bake for 20 minutes.",
        "Remove the pan from the oven and allow the cake to cool in the pan for 20 minutes.",
        "Place a large cutting board on top of the cake pan, then invert the cake, allowing it to turn out onto the cutting board. Allow the cake to cool completely before icing.",
        "Combine the milk and flour in a saucepan over medium heat and whisk constantly until thick. Remove from the heat and let cool to room temperature. Add the vanilla once cooled.",
        "In the bowl of a stand mixer with the paddle attachment, cream the butter and sugar until light and fluffy. Add the cooled milk mixture and beat very well. It may look separated, which means you have to keep beating until fully combined. It should be fluffy and light, similar to whipped cream.",
        "Ice the cake and top with raspberries."
    ],
    "ingredients": [
        "Nonstick baking spray",
        "2 1/2 cups cake flour",
        "1 teaspoon salt",
        "1 cup buttermilk",
        "1 teaspoon vanilla extract",
        "1 teaspoon baking soda",
        "2 whole eggs",
        "1 1/2 teaspoons vinegar",
        "1 1/2 teaspoons cocoa powder",
        "1 1/2 fluid ounces red food coloring",
        "1 cup shortening",
        "1 3/4 cup granulated sugar",
        "1 cup whole milk",
        "5 tablespoons all-purpose flour",
        "1 teaspoon vanilla extract",
        "2 sticks unsalted butter",
        "1 cup granulated sugar",
        "2 cups raspberries"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Baking",
        "Frosting Recipes",
        "Cake",
        "Cheese",
        "Cream Cheese Recipes"
    ],
    "title": "Red Velvet Sheet Cake with Classic Red Velvet Frosting",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/red-velvet-sheet-cake-with-classic-red-velvet-frosting-recipe"
}
