{
    "directions": [
        "Bring a large pot of salted water to a boil. Prepare a bowl of ice water. Strip beet greens, turnip greens, and kale from their coarse stems and wash leaves well. Working in batches, cook each bunch in boiling water until bright green and slightly limp, about 1 minute. Transfer immediately to ice water and repeat with remaining greens. Discard cooking water.",
        "Remove greens from ice water and squeeze out as much water as possible.",
        "Combine greens, 2/3 cup olive oil, 2 cloves garlic, Parmigiano Reggiano cheese, and 1/2 teaspoon kosher salt in blender or food processor; blend until smooth. Transfer pesto to a bowl and cover surface with plastic wrap.",
        "Heat 1/4 cup olive oil in large pot over medium-high heat. Stir in onion, grated tomato, 4 cloves minced garlic, rosemary, 1/2 teaspoon kosher salt, bay leaf, and chili flakes. Cook, stirring frequently, for 5 minutes; reduce heat to low. Continue cooking and stirring until vegetables are a deep golden brown, 20 to 30 minutes.",
        "Pour remaining 2 tablespoons olive oil over onion mixture. Stir in leek, carrot, turnips, and beets. Increase heat to medium-high and cook, stirring occasionally, for 5 minutes.",
        "Pour white wine over vegetable mixture and scrape browned bits off the bottom of the pot. Mix cannellini beans and green beans into vegetable mixture; pour in 5 cups water. Bring liquid to a boil, reduce heat, and simmer until green beans are tender, about 5 minutes more. Stir in parsley and lemon juice.",
        "Divide soup among heated bowls and serve with a generous dollop of the winter greens pesto."
    ],
    "ingredients": [
        "Winter Greens Pesto:",
        "1 bunch beet greens",
        "1 bunch turnip greens",
        "1 bunch kale",
        "2/3 cup extra-virgin olive oil",
        "2 cloves garlic",
        "1 ounce Parmigiano Reggiano cheese, grated",
        "1/2 teaspoon kosher salt",
        "Red Winter Minestrone:",
        "6 tablespoons extra-virgin olive oil, divided",
        "1 white onion, finely chopped",
        "2 Roma (plum) tomatoes, peeled and grated",
        "4 cloves garlic, minced",
        "1 teaspoon minced fresh rosemary",
        "1/2 teaspoon kosher salt",
        "1 bay leaf",
        "1 pinch dried chili flakes",
        "1 leek, white and light green parts only, halved lengthwise, cleaned, and cut into 1/2-inch slices",
        "1 carrot, peeled and sliced",
        "1/2 pound turnips, peeled and cubed",
        "1/2 pound beets, peeled and cubed",
        "1 cup dry white wine",
        "2 cups cooked cannellini beans",
        "1/2 cup green beans, cut into 1-inch pieces",
        "5 cups water",
        "1/4 cup chopped flat-leaf (Italian) parsley",
        "1/2 tablespoon fresh lemon juice, or to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Red Winter Minestrone with Winter Greens Pesto",
    "url": "http://allrecipes.com/recipe/253160/red-winter-minestrone-with-winter-gre/"
}
