{
    "directions": [
        "Combine lemon, thyme, chiles, garlic, wine, oil, and pepper in a large resealable plastic bag. Add steak, close bag, and turn to coat. Chill at least 4 hours.",
        "Steak can be marinated 2 days ahead. Keep chilled.",
        "Prepare campfire for medium-high heat. Bank coals on one side to create a two-zone fire; oil grate. (If cooking at home with a gas grill, leave one or two burners off.) Cook shallot, garlic, chile, and butter in a small saucepan over medium heat until shallots are softened; season with salt and pepper. Keep warm.",
        "Remove steak from marinade; season with salt. Grill over direct heat, turning occasionally, until cooked to desired doneness, 8–10 minutes for mediumrare. Transfer to a cutting board; let rest 10 minutes. Slice against the grain.",
        "Meanwhile, working one at a time, gently stretch each piece of dough into an oval (about 12x8\") and grill over direct heat, flipping and rotating as needed, until lightly charred and stiff, about 1 minute per side. Move to cooler part of grill to keep warm until ready to serve.",
        "Spoon shallot butter over flatbreads and top with parsley. Serve with steak."
    ],
    "ingredients": [
        "1/2 lemon, thinly sliced",
        "3 sprigs thyme",
        "2 Fresno chiles, halved",
        "6 garlic cloves, smashed",
        "3/4 cup dry red wine",
        "1/4 cup olive oil",
        "1/2 teaspoon freshly ground black pepper",
        "1 1/2 pounds hanger steak, center membrane removed, cut into 4 pieces",
        "Vegetable oil (for grill)",
        "1 shallot, finely chopped",
        "3 garlic cloves, chopped",
        "1 Fresno chile, chopped",
        "6 tablespoons unsalted butter",
        "Kosher salt, freshly ground pepper",
        "1 pound prepared pizza dough, room temperature, cut into 4 pieces",
        "2 tablespoons chopped fresh parsley steak"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Steak",
        "Summer",
        "Grill/Barbecue"
    ],
    "title": "Red Wine–Marinated Hanger Steaks with Flatbreads",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-marinated-hanger-steaks-with-flatbreads-56389762"
}
