{
    "directions": [
        "Cut off kernels from 1 ear corn. Cut remaining 2 ears corn (including cob) crosswise into 1-inch pieces.",
        "Heat oil in a 4-quart heavy pot over moderate heat until hot but not smoking, then cook chiles, garlic, and onion, stirring occasionally, until onion is pale golden, about 7 minutes. Remove from heat and transfer chile mixture to a bowl with a slotted spoon, pressing mixture against side of pot to leave behind as much oil as possible. Do not clean pot; there will be a thin film of oil remaining.",
        "Purée half of chile mixture with 1 cup broth and 2 1/4 teaspoons masa harina in a blender until smooth, then force purée through a medium-mesh sieve with a rubber spatula into a medium bowl.",
        "Purée remaining chile mixture, 1 cup broth, and remaining 2 1/4 teaspoons masa harina in same manner, forcing through sieve into same bowl.",
        "Heat oil remaining in pot over moderately high heat until hot but not smoking, then cook chile puré, stirring constantly, until it reaches a boil and is slightly thickened.",
        "Stir in remaining 4 cups broth and bring to a simmer, stirring occasionally.",
        "Stir in corn (kernels and pieces), mushrooms, green beans, potatoes, and epazote and gently simmer, uncovered, stirring occasionally, until beans are tender, 15 to 25 minutes.",
        "Thin chileatole with a little more broth or water to attain a light cream soup consistency, then stir in salt."
    ],
    "ingredients": [
        "3 ears fresh corn, shucked",
        "1 tablespoon vegetable or olive oil",
        "4 pliable dried ancho chiles (3 ounces), stemmed, seeded, and each torn into several pieces",
        "3 garlic cloves, peeled",
        "1 medium white onion, cut into 1/4-inch-thick slices",
        "1 1/2 quart Imagine brand vegetable broth (48 fluid ounces)",
        "1 1/2 tablespoons masa harina",
        "1/2 pound fresh shiitake mushrooms, stems discarded and caps cut into 1/2-inch slices (4 cups)",
        "6 ounces green beans or sugar snap peas, trimmed and halved or cut into thirds (2 cups)",
        "1/2 pound fingerling potatoes, cut into 1/2-inch cubes",
        "2 large sprigs fresh epazote (each 12 to 16 inches long) or fresh flat-leaf parsley sprigs",
        "1 3/4 teaspoons salt, or to taste",
        "Accompaniment: 2 limes, cut into wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Food Processor",
        "Mushroom",
        "Onion",
        "Potato",
        "Sauté",
        "Vegetarian",
        "Corn",
        "Green Bean",
        "Hot Pepper",
        "Winter",
        "Healthy",
        "Vegan",
        "Hominy/Cornmeal/Masa",
        "Simmer",
        "Gourmet"
    ],
    "title": "Red Chileatole with Fall Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/red-chileatole-with-fall-vegetables-235967"
}
