{
    "directions": [
        "Whisk the cream cheese, sour cream, milk and confectioners' sugar until smooth in a medium bowl; set aside.",
        "Sift the flour, cocoa powder, baking soda, baking powder and 1/2 teaspoon salt into a large bowl. Beat the eggs and granulated sugar in a large bowl until pale yellow; beat in the buttermilk, melted butter, food coloring, vanilla and vinegar. Add the egg mixture to the flour mixture and fold just until incorporated. Transfer some of the batter to a squeeze bottle with a 1/4-inch opening.",
        "Heat a griddle or large nonstick skillet over medium-low heat. Lightly coat the hot skillet with melted butter and squeeze some of the batter onto it in the outline of a heart or hearts of the desired size. Fill in each outline with more batter; use a spatula to spread it to the edges of the heart. Cook each pancake until bubbles begin to pop on the surface, about 3 minutes. Carefully flip and cook until the bottom is set and the pancake is cooked through, 1 to 2 minutes longer. Repeat with the remaining batter.",
        "Drizzle the cream cheese mixture and maple syrup on top of the pancakes and sprinkle with pecans."
    ],
    "ingredients": [
        "4 ounces cream cheese, at room temperature",
        "1/4 cup sour cream",
        "3 tablespoons whole milk",
        "2 tablespoons confectioners' sugar",
        "2 cups all-purpose flour",
        "1 tablespoon unsweetened cocoa powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "Fine salt",
        "2 large eggs",
        "3/4 cup granulated sugar",
        "1 1/4 cups buttermilk",
        "1/2 cup melted and cooled butter, plus more for griddle",
        "2 teaspoons red food coloring",
        "1 teaspoon pure vanilla extract",
        "1 teaspoon apple cider vinegar",
        "Maple syrup, for serving",
        "Toasted, chopped pecans, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pancake",
        "Chocolate"
    ],
    "title": "Red Velvet Heart Pancakes",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/red-velvet-heart-pancakes"
}
