{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.",
        "Stir milk and vinegar together in a small bowl to make sour milk. Sift flour, baking powder, baking soda, and salt together in a separate bowl.",
        "Beat white sugar and 5 tablespoons butter together in a large bowl with an electric mixer until light and fluffy. Add 2 eggs; beat until smooth. Beat in portions of sour milk and flour mixture alternately until smooth batter forms.",
        "Melt chocolate in top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching, 1 to 3 minutes. Stir melted chocolate and vanilla extract into batter. Pour batter into prepared baking dish.",
        "Bake in preheated oven until a toothpick inserted into the center comes out clean, about 25 minutes. Cool in the baking dish for 10 minutes before removing to cool completely on a wire rack.",
        "Beat 1/2 cup butter in a large bowl with an electric mixer until smooth and creamy. Beat in egg yolk; gradually beat in confectioners' sugar until light and fluffy. Mix in lemon juice until smooth frosting forms. Frost cake with frosting when cake has completely cooled."
    ],
    "ingredients": [
        "Cake:",
        "1/2 cup milk",
        "1 tablespoon white vinegar",
        "1 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1 cup white sugar",
        "5 tablespoons butter",
        "2 eggs",
        "2 ounces chopped chocolate",
        "1 teaspoon vanilla extract",
        "Frosting:",
        "1/2 cup butter",
        "1 egg yolk",
        "1 cup confectioners' sugar",
        "1 tablespoon lemon juice, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Red Devil's Food Cake with Lemon Frosting",
    "url": "http://allrecipes.com/recipe/245743/red-devils-food-cake-with-lemon-fros/"
}
