{
    "directions": [
        "In a small bowl soak porcini in boiling water 30 minutes. Pour soaking liquid through a fine sieve lined with a dampened paper towel or coffee filter into a bowl and reserve. Wash porcini under cold water to remove any grit and pat dry. Chop porcini fine.",
        "Chop fine 1/4 pound cremini or white mushrooms (about 1 1/2 cups) and reserve. Depending on size, halve and/or quarter remaining 1 1/4 pounds cremini or white mushrooms and in a large heavy skillet cook in 4 tablespoons butter with salt and pepper to taste over moderate heat, stirring, until tender, 5 to 10 minutes. Remove skillet from heat and reserve mushrooms in skillet. (They will be reheated just before serving.)",
        "In a large saucepan heat broth and keep at a bare simmer.",
        "In a 5-to-6 quart heavy saucepan cook pancetta over moderate heat, stirring, 5 minutes. Add reserved finely chopped cremini or white mushrooms, remaining 2 tablespoons butter, onion, rosemary, sage, and salt and pepper to taste and cook, stirring, until onion is softened. Stir in rice and cook, stirring, until coated well with fat, about 1 minute. Add 1 cup wine and cook, stirring constantly, until absorbed. Add remaining cup wine and cook, stirring constantly, until absorbed.",
        "Add 1 cup simmering broth and cook, stirring constantly, until absorbed. Continue cooking and adding broth, 1/2 cup at a time, stirring constantly and letting each addition be absorbed before adding next, until rice is tender and creamy-looking but still al dente, 20 to 25 minutes.",
        "Note: About halfway through cooking, add reserved porcini soaking liquid and chopped porcini, stirring constantly until liquid is absorbed, and continue cooking and adding broth in same manner.",
        "During last few minutes of cooking, reheat reserved cremini or white mushrooms in skillet over moderate heat, stirring, until hot, and stir in parsley and salt and pepper to taste. Stir grated Parmesan and salt and pepper to taste into risotto.",
        "Serve risotto immediately, topped with cremini or white mushrooms and garnished with Parmesan curls and rosemary."
    ],
    "ingredients": [
        "1 ounce dried porcini mushrooms*",
        "2 cups boiling water",
        "1 1/2 pounds fresh cremini or white mushrooms",
        "3/4 stick (6 tablespoons) unsalted butter",
        "5 to 6 cups low-salt chicken broth",
        "6 ounces 1/4-inch-thick slices pancetta (Italian unsmoked cured bacon)**, chopped",
        "1 cup finely chopped onion",
        "1 tablespoon finely chopped fresh rosemary leaves or 1 teaspoon dried rosemary, crumbled",
        "1 tablespoon finely chopped fresh sage leaves or 1 teaspoon dried sage, crumbled",
        "3 cups Arborio rice**",
        "2 cups dry red wine such as Rosso di Montalcino",
        "3 tablespoons finely chopped fresh parsley leaves",
        "1 cup freshly grated Parmesan",
        "Garnishes: curls shaved with a vegetable peeler from a 1/4-pound piece of Parmesan, fresh rosemary sprigs",
        "*available at specialty foods shops and some supermarkets",
        "**available at Italian markets and specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Rice",
        "Side",
        "Parmesan",
        "Bacon",
        "Red Wine",
        "Simmer",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Red Wine and Mushroom Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-and-mushroom-risotto-11812"
}
