{
    "directions": [
        "Puree 1 cup cilantro leaves and taco sauce in mini processor until almost smooth. Sauté sausage in large skillet over medium-high heat until cooked through, breaking up sausage finely, 4 to 5 minutes. Transfer to small bowl. Reserve skillet.",
        "Using on/off turns, blend beans, chili powder, cumin, scant 1/4 teaspoon salt, and 2 tablespoons chopped cilantro in processor until most beans are chopped. Add sausage. Blend using 4 or 5 on/off turns (some chunky texture should remain). Using wet hands, shape mixture by generous 1/3 cupfuls into four 3-inch-diameter patties.",
        "Coat reserved skillet with nonstick spray. Heat over medium-high heat. Add patties; cook until brown, 3 minutes per side.",
        "Add 2 inches water to another large skillet; add salt and bring to boil. Reduce heat to medium-low. Crack eggs into water. World's Simmer until whites are firm and yolks are cooked, 2 to 3 minutes for runny yolks.",
        "Arrange patties on plates; sprinkle with tomatoes. Top each with 1 egg, then salsa."
    ],
    "ingredients": [
        "1 cup fresh cilantro leaves plus 2 tablespoons chopped cilantro",
        "1/3 cup bottled green taco sauce",
        "5 ounces breakfast sausage roll",
        "1 15-to 16-ounce can kidney beans, drained well",
        "1 teaspoon chili powder",
        "1 teaspoon ground cumin",
        "1/4 teaspoon (scant) salt plus additional for poaching liquid",
        "Nonstick vegetable oil spray",
        "4 large eggs",
        "3/4 cup chopped seeded plum tomatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Bean",
        "Egg",
        "Tomato",
        "Breakfast",
        "Brunch",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Sausage",
        "Cilantro",
        "Cumin",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Red Bean and Sausage Cakes with Poached Eggs and Cilantro Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/red-bean-and-sausage-cakes-with-poached-eggs-and-cilantro-salsa-357232"
}
