{
    "directions": [
        "Toss grapes with sugar, lemon juice, and cinnamon in a wide 6- to 8-quart heavy pot. Bring to a boil, covered, over moderate heat, stirring occasionally. Continue to boil, covered, stirring occasionally, until grapes begin to burst, 20 to 30 minutes.",
        "Transfer grapes with a slotted spoon to a colander set over a bowl and drain 15 minutes, then return juices in bowl to pot.",
        "Preheat oven to 425°F. Boil juices, uncovered, until syrupy and reduced to about 2 cups, 20 to 25 minutes.",
        "Stir together Cognac and cornstarch until smooth and whisk into grape syrup. Boil, whisking constantly, 1 minute. Stir grapes into syrup, then spoon filling into a 3-quart shallow baking or gratin dish.",
        "Pulse together flour, brown sugar, oats, butter, cinnamon, and salt in a food processor until mixture resembles coarse meal. Transfer to a bowl and stir in pecans.",
        "Sprinkle topping evenly over filling and bake in middle of oven until topping is golden brown and filling is bubbling, about 20 minutes."
    ],
    "ingredients": [
        "6 lb seedless grapes (preferably a mix of red and green; 4 quarts)",
        "3/4 cup granulated sugar",
        "1/4 cup fresh lemon juice",
        "1 teaspoon cinnamon",
        "1/4 cup Cognac or other brandy",
        "3 tablespoons cornstarch",
        "3/4 cup all-purpose flour",
        "3/4 cup packed light brown sugar",
        "3/4 cup old-fashioned rolled oats",
        "1 stick (1/2 cup) cold unsalted butter, cut into bits",
        "1/4 teaspoon cinnamon",
        "1/4 teaspoon salt",
        "1 cup coarsely chopped pecans",
        "Accompaniment: crème fraîche, vanilla ice cream, or lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dairy",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pecan",
        "Oat",
        "Cognac/Armagnac",
        "Fall",
        "Party",
        "Grape",
        "Gourmet"
    ],
    "title": "Red and Green Grape Crisp",
    "url": "http://www.epicurious.com/recipes/food/views/red-and-green-grape-crisp-103965"
}
