{
    "directions": [
        "Preheat oven to 400°F. Toss tomatoes, bell peppers, and onion in small baking dish with 2 tablespoons olive oil. Roast until partially charred, turning every 15 minutes, about 45 minutes. Cover with foil; let stand 15 minutes.",
        "Meanwhile, heat 1 tablespoon olive oil in small skillet over medium-high heat. Add chile; fry until darkened and slightly puffed, turning once, about 30 seconds. Transfer to small bowl. Add enough hot water to cover. Let stand 30 minutes.",
        "Peel and seed ancho chile, tomatoes, and bell peppers; place in blender. Peel onion; coarsely chop and add to blender.",
        "Heat 1 tablespoon olive oil in small skillet over medium-high heat. Add almonds; sauté until lightly toasted, about 1 minute. Transfer to blender. Add 1/4 cup extra-virgin olive oil, garlic, vinegar, bread, and paprika to blender; blend to coarse puree. Transfer to bowl; season with salt. (Can be made 1 day ahead. Cover and chill. Bring to room temperature before serving.)",
        "Preheat oven to 450°F. Place 1 fish in each of two 13x9x2-inch metal baking pans. Cover each fish with 3 pounds salt. Drizzle 1 1/2 cups water over salt in each pan. Using hands, pack salt over fish to cover completely.",
        "Bake fish until thermometer inserted into center of fish registers 135°F, about 30 minutes. Gently rap salt crust with back of spoon to crack; carefully remove salt. Use pastry brush to remove any remaining salt. Carefully transfer whole fish to platter and serve with sauce.",
        "*Sold at Latin American markets, specialty foods stores, and some supermarkets."
    ],
    "ingredients": [
        "3 large plum tomatoes",
        "2 large red bell peppers",
        "1 medium onion (unpeeled)",
        "4 tablespoons olive oil, divided",
        "1 dried ancho chile*",
        "1/2 cup sliced almonds",
        "1/4 cup extra-virgin olive oil",
        "3 garlic cloves",
        "2 tablespoons Sherry wine vinegar",
        "1 slice wheat bread, toasted, cut into 1/2-inch cubes (about 1/2 cup)",
        "1 teaspoon pimentón or other imported sweet paprika (see note below)",
        "2 2-pound whole red snappers",
        "6 pounds coarse kosher salt",
        "3 cups water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Pepper",
        "Tomato",
        "Appetizer",
        "Bake",
        "Christmas",
        "Vinegar",
        "Snapper",
        "Hot Pepper",
        "Winter",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Red Snapper Baked in Salt with Romesco Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/red-snapper-baked-in-salt-with-romesco-sauce-109059"
}
