{
    "directions": [
        "Separately cut carrots and bell pepper into thin strips and diagonally cut snow peas into 1/2-inch pieces. Chop coriander. Peel sweet potato and, if desired, with a channel knife cut 4 lengthwise grooves (one every quarter turn). Cut potato crosswise into 12 slices (about 1/4 inch thick) and in a steamer set over 1 inch boiling water steam slices, in one layer if possible, covered, until just cooked through and tender but not falling apart, about 8 minutes.",
        "Remove steamer from heat and season potato with salt and pepper. Keep potato warm in steamer, covered. In a small saucepan heat glaze and keep warm, covered.",
        "Preheat oven to 275°F.",
        "In a non-stick skillet heat 1/2 teaspoon oil over moderately high heat until hot but not smoking and sauté 2 fillets, skin sides down, pressing on fish with a metal spatula to help skin brown evenly, until skin is golden brown, about 1 minute. With spatula turn fillets over and sauté until golden, about 30 seconds more. Transfer fillets, skin sides up, to a non-stick baking pan and sauté remaining 2 fillets in 1/2 teaspoon oil in same manner. Bake fish in middle of oven until just cooked through, about 3 minutes.",
        "While fish is baking, in a large non-stick skillet heat 1/2 teaspoon remaining oil over moderately high heat until hot but not smoking and sauté carrots until barely tender, about 2 minutes. Add remaining 1/2 teaspoon oil, bell pepper, and snow peas and sauté vegetables, stirring, until just tender, about 30 seconds. Add cabbage and onion and sauté, stirring, until just tender, about 1 minute. Immediately transfer sautéed vegetables to a bowl and toss with coriander, vinegar, and salt and pepper to taste.",
        "Divide potato among 4 plates and top with sautéed vegetables. Put fillets, skin sides up, on vegetables and drizzle with some glaze.",
        "Garnish plates with lime wedges and serve remaining glaze on the side."
    ],
    "ingredients": [
        "2 medium carrots",
        "1 yellow bell pepper",
        "3 ounces snow peas (about 3/4 cup)",
        "1 cup fresh coriander sprigs",
        "a 3/4-pound sweet potato",
        "3/4 cup Spicy Soy Glaze",
        "2 teaspoons vegetable oil",
        "four 4-ounce red snapper or grouper fillets with skin",
        "2 cups thinly sliced Napa cabbage",
        "1/4 cup thinly sliced red onion",
        "1 tablespoon seasoned rice vinegar",
        "Garnish: lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Herb",
        "Onion",
        "Bake",
        "Low Fat",
        "Sweet Potato/Yam",
        "Winter",
        "Gourmet"
    ],
    "title": "Red Snapper with Spicy Soy Glaze on Sauteed Vegetables and Sweet Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/red-snapper-with-spicy-soy-glaze-on-sauteed-vegetables-and-sweet-potatoes-14713"
}
