{
    "directions": [
        "Heat oven to 350°F with rack in middle. Invert bottom of springform pan (to make it easier to slide cake off bottom) and lock on side. Butter pan and line bottom with a round of parchment or wax paper. Butter paper, then dust paper with additional flour, knocking out excess.",
        "Sift together flour, baking powder, baking soda, and salt into a bowl.",
        "In a separate bowl, beat together butter and sugar with an electric mixer (fitted with paddle attachment if using a stand mixer) at medium-high speed until pale and fluffy, 3 to 5 minutes. Add in warmed eggs, one at a time, beating well after each addition, then beat in vanilla.",
        "Reduce speed to low, then add flour mixture in 3 batches alternately with sour cream, beginning and ending with flour and mixing until batter is smooth. Spoon batter into springform pan, spreading evenly.",
        "Bake cake until it begins to pull away from side of pan and a wooden toothpick inserted in center comes out clean, 35 to 40 minutes. Let cake cool in pan on a wire rack for 10 minutes, then carefully run a thin knife around edge of cake and remove side of pan. Invert cake onto rack, then remove bottom of pan and carefully peel off paper. Let cake cool completely.",
        "Combine all ingredients except water and cornstarch in a 2- to 3-quart heavy saucepan and bring to a boil over medium-high heat, stirring frequently. Reduce heat and briskly simmer, uncovered, stirring occasionally, until reduced to about 1 1/4 cups, 8 to 10 minutes. Stir water into cornstarch in a small bowl, then stir into blueberry filling and gently boil, stirring, 1 minute. Transfer to a bowl and chill, uncovered, until cold.",
        "Combine all ingredients except water and cornstarch in a 2- to 3-quart heavy saucepan and bring to a boil over medium-high heat, stirring frequently. Reduce heat and briskly simmer, uncovered, stirring occasionally, until reduced to about 1 1/4 cups, 10 to 12 minutes. Stir water into cornstarch in a small bowl, then stir into raspberry filling and gently boil, stirring, 1 minute. Force filling through a large fine-mesh sieve into a bowl, scraping bottom of sieve to release pulp into bowl. Discard solids in sieve. Chill filling, uncovered, until cold.",
        "Cut cooled cake horizontally into 3 even layers with a long serrated knife (see Cooks' Notes for an easy method). Line 9-inch springform pan with 2 overlapping sheets of plastic wrap, letting excess hang over edge. Put bottom layer, cut side up, in pan. Spread cold blueberry filling over cake using offset spatula, leaving a 1/4-inch border around edge, then freeze until firm, about 20 minutes.",
        "Slightly soften ice cream in microwave, then scoop half of it, preferably in thin curls that you can lay over blueberry layer, and gently spread it evenly to edge of cake. Return remaining ice cream to freezer. Put middle cake layer on top of ice cream, gently pressing it down, and spread cold raspberry filling over cake, leaving a 1/4-inch border around edge. Freeze cake until raspberry layer is firm, about 30 minutes.",
        "Slightly soften remaining ice cream, if necessary, and spread in same manner evenly over raspberry filling to edge of cake. Put remaining cake layer on top of ice cream, cut side down, and gently press it down, then freeze cake, well wrapped in plastic, until very firm, 4 to 6 hours.",
        "Beat heavy cream with confectioners' sugar and vanilla in a large deep bowl with an electric mixer until it just holds stiff peaks.",
        "Remove side and bottom of springform pan and peel plastic from cake. Set cake on a serving plate that will fit in the freezer. Spread some of whipped cream in a thin layer around side and top of cake and freeze cake until cream is firm, about 30 minutes (meanwhile, keep remaining whipped cream cold in refrigerator).",
        "Frost cake with remaining cream, leaving swirls in cream on top to help hold berries. Freeze until very firm, at least 30 minutes.",
        "To serve, transfer cake to refrigerator to soften, 30 minutes to 1 hour, and garnish with berries."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour plus more for dusting",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 cup sugar",
        "2 large eggs, warmed in their shells in warm water for 5 minutes",
        "1 teaspoon pure vanilla extract",
        "1/2 cup sour cream",
        "12 ounces (2 1/4 cups) fresh blueberries",
        "1/3 cup sugar",
        "2 tablespoons light corn syrup",
        "1 teaspoon fresh lemon juice",
        "1 teaspoon water",
        "1 teaspoon cornstarch",
        "12 ounces (3 cups) fresh raspberries",
        "1/3 cup sugar",
        "2 tablespoons light corn syrup",
        "1 teaspoon fresh lemon juice",
        "1 teaspoon water",
        "1 1/2 teaspoons cornstarch",
        "1 1/2 quarts vanilla ice cream",
        "1 1/2 cups chilled heavy cream",
        "1/3 cup confectioners sugar",
        "1 teaspoon pure vanilla extract",
        "1 cup mixed fresh blueberries and raspberries",
        "Special equipment: A 9-inch springform pan; a small offset metal spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Berry",
        "Dairy",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Blueberry",
        "Raspberry",
        "Summer",
        "Birthday",
        "Party",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Red, White, and Blue Ice Cream Cake",
    "url": "http://www.epicurious.com/recipes/food/views/red-white-and-blue-ice-cream-cake-51108000"
}
