{
    "directions": [
        "Stir together water, soy sauce, wine, rock sugar, white parts of scallions, ginger, garlic, cilantro stems, zest strips, and star anise in a deep 6- to 8-quart heavy pot and bring to a boil. Reduce heat and simmer, uncovered, 10 minutes. Add pork, then cover and reduce heat to low. Simmer gently, turning pork over every 30 minutes, until very tender, 4 to 4 1/2 hours. Cool pork in cooking liquid, uncovered, about 1 hour, then chill, covered, at least 8 hours.",
        "Preheat oven to 350°F.",
        "Transfer chilled pork to a clean cutting board, then remove string and cut meat across the grain into 1/2-inch-thick slices. Arrange pork in overlapping slices in a 13- by 9-inch glass or ceramic baking dish.",
        "Discard fat from cooking liquid and reheat liquid over low heat until warm, then pour through a sieve into a bowl (discard solids). Transfer 2 cups cooking liquid to a 1-quart saucepan, reserving remainder for another use. Bring to a simmer, then pour over pork. Cover dish tightly with foil and heat in middle of oven until heated through, about 30 minutes.",
        "Cut scallion greens diagonally into thin slices. Carefully pour hot broth from baking dish into a bowl and stir in scallion greens and grated zest. Serve pork with broth, topped with cilantro leaves and frizzled ginger."
    ],
    "ingredients": [
        "6 cups water",
        "1 cup soy sauce",
        "1 cup Chinese rice wine or medium-dry Sherry",
        "1/2 cup Chinese rock sugar or packed light brown sugar",
        "1 bunch scallions, white parts smashed and greens reserved",
        "2 (1-inch-thick) pieces fresh ginger, smashed",
        "2 garlic cloves, smashed",
        "10 fresh cilantro stems (reserve leaves for garnish)",
        "2 (4- by 1-inch) strips fresh orange zest",
        "2 whole star anise",
        "1 (5- to 6-lb) boneless pork butt, shoulder, or blade roast, tied",
        "1 teaspoon finely grated fresh orange zest",
        "Accompaniment: frizzled ginger"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Pork",
        "Marinate",
        "Stew",
        "Quick & Easy",
        "Dinner",
        "Sherry",
        "Winter",
        "Simmer",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Red-Cooked Pork with Frizzled Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/red-cooked-pork-with-frizzled-ginger-107593"
}
