{
    "directions": [
        "Preheat oven to 350°F. Season short ribs with salt and pepper. Heat oil in a large Dutch oven over medium-high heat. Working in 2 batches, brown short ribs on all sides, about 8 minutes per batch. Transfer short ribs to a plate. Pour off all but 3 tablespoons drippings from pot.",
        "Add onions, carrots, and celery to pot and cook over medium-high heat, stirring often, until onions are browned, about 5 minutes. Add flour and tomato paste; cook, stirring constantly, until well combined and deep red, 2-3 minutes. Stir in wine, then add short ribs with any accumulated juices. Bring to a boil; lower heat to medium and simmer until wine is reduced by half, about 25 minutes. Add all herbs to pot along with garlic. Stir in stock. Bring to a boil, cover, and transfer to oven.",
        "Cook until short ribs are tender, 2-2 1/2 hours. Transfer short ribs to a platter. Strain sauce from pot into a measuring cup. Spoon fat from surface of sauce and discard; season sauce to taste with salt and pepper. Serve in shallow bowls over mashed potatoes with sauce spooned over."
    ],
    "ingredients": [
        "5 pound bone-in beef short ribs, cut crosswise into 2\" pieces",
        "Kosher salt and freshly ground black pepper",
        "3 tablespoons vegetable oil",
        "3 medium onions, chopped",
        "3 medium carrots, peeled, chopped",
        "2 celery stalks, chopped",
        "3 tablespoons all-purpose flour",
        "1 tablespoon tomato paste",
        "1 750-milliliter bottle dry red wine (preferably Cabernet Sauvignon)",
        "10 sprigs flat-leaf parsley",
        "8 sprigs thyme",
        "4 sprigs oregano",
        "2 sprigs rosemary",
        "2 fresh or dried bay leaves",
        "1 head of garlic, halved crosswise",
        "4 cups low-salt beef stock"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Braise",
        "Dinner",
        "Beef Rib",
        "Red Wine",
        "Fall",
        "Winter",
        "Potluck",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Red Wine–Braised Short Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-braised-shortribs-367736"
}
