{
    "directions": [
        "Place a 9-inch springform pan in the freezer until very cold, at least 1 hour.",
        "Make the strawberry sorbet (or beat premade, frozen sorbet until smooth in an electric mixer fitted with the paddle attachment). Remove the springform pan from the freezer and immediately scoop in the sorbet. Working quickly, use the back of a spoon or an offset spatula to smooth the sorbet into an even layer, approximately 1 inch high. Sprinkle evenly with 1/4 cup cookie crumbs or candied ginger, cover tightly with plastic wrap, and freeze until firm, at least 1 hour.",
        "Repeat the process with the lemon ice cream and another 1/4 cup of crumbs or candied ginger, freezing 1 hour. Finish with the blueberry sorbet, topping with the last 1/4 cup of crumbs or candied ginger. Cover tightly with plastic wrap and freeze until set, at least two hours or overnight.",
        "Chill a serving plate or cake stand in the freezer.",
        "Just before serving, unmold the cake: Warm the blade of an offset spatula or knife in hot tap water, then wipe it dry. Run the blade around the inside edge of the pan, then unlock and remove the sides. Place the chilled plate or cake stand upside-down on top of the cake pan and flip everything over so the cake is resting on the plate. Rewarm the knife and gently edge it between the bottom of the pan and the cake to remove the bottom of the pan. Garnish with a mint sprig and serve with whipped cream and fresh berries.",
        "**Note:**If the entire cake is not eaten in one sitting, immediately after slicing, wrap it well with plastic wrap and put it back in the freezer. This will help prevent melting and refreezing, which can ruin the texture."
    ],
    "ingredients": [
        "One recipe Simply Strawberry Sorbet",
        "3/4 cup cookie crumbs (process 7 Newman's Own Organic O's — creamy fillings and all — in the food processor until finely ground) or finely chopped candied ginger",
        "One recipe Lemon Ice Cream with Candied Lemon Peel",
        "One recipe Simply Blueberry Sorbet",
        "Freshly whipped cream, fresh berries, and sprigs of mint, for serving",
        "fresh berries",
        "sprigs of mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Citrus",
        "Dairy",
        "Dessert",
        "Freeze/Chill",
        "Fourth of July",
        "Kid-Friendly",
        "Backyard BBQ",
        "Frozen Dessert",
        "Blueberry",
        "Strawberry",
        "Lemon",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Red, White, and Blue Ice Cream Cake",
    "url": "http://www.epicurious.com/recipes/food/views/red-white-and-blue-ice-cream-cake-232354"
}
