{
    "directions": [
        "In a large saucepan simmer the chilies in 6 cups of the water for 20 minutes, in a blender purée the chilies with the liquid in batches, and force the purée through a fine sieve into a bowl, pressing hard on the solids before discarding them.",
        "In a large heavy kettle cook the onions and the garlic in the oil over moderate heat, stirring, until the onion is softened, add the cumin, and cook the mixture, stirring, for 30 seconds. Add the pork, the chili purée, the tomatoes, the bay leaf, the salt, the orégano, and the remaining 1 cup water and simmer the mixture, uncovered, adding more water if necessary to keep the pork barely covered, for 2 hours, or until the pork is tender. Add the kidney beans, simmer the chili, stirring occasionally, for 5 minutes, or until the beans are heated through, and discard the bay leaf. The chili may be frozen or made 4 days in advance, cooled, uncovered, and kept covered and chilled. Serve the chili with the sour cream."
    ],
    "ingredients": [
        "6 ounces (about 30) dried New Mexican red chilies*, stemmed and seeded (wear rubber gloves)",
        "7 cups water",
        "2 large onions, chopped",
        "8 garlic cloves, minced",
        "3 tablespoons vegetable oil",
        "1 tablespoon ground cumin",
        "4 1/2 pounds boneless pork shoulder, trimmed of excess fat and cut into 1/2-inch pieces",
        "a 28-ounce can tomatoes, drained and chopped",
        "1 bay leaf",
        "2 teaspoons salt",
        "1 teaspoon dried orégano, or to taste, crumbled",
        "a 19-ounce can (about 2 cups) kidney beans, rinsed and drained",
        "sour cream as an accompaniment if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Garlic",
        "Onion",
        "Pork",
        "Tomato",
        "Super Bowl",
        "Hot Pepper",
        "Winter",
        "Gourmet"
    ],
    "title": "Red Pork and Bean Chili",
    "url": "http://www.epicurious.com/recipes/food/views/red-pork-and-bean-chili-11343"
}
