{
    "directions": [
        "In a large saucepan combine the broth, the water, the soy sauce, the Sherry, the brown sugar, the vinegar, the cinnamon sticks, the star anise, the gingerroot, and the flattened scallions, bring the liquid to a boil, and simmer the mixture for 20 minutes. Cut off the wing tips, reserving them for another use such as stock if desired, halve the wings at the joint, and pat them dry. In a large deep fryer or large deep kettle heat 2 inches of the oil to 375°F. on a deep-fat thermometer and in it fry the wings, 5 pieces at a time, for 5 to 8 minutes, or until they are golden and crisp. Transfer the wings with a slotted spoon as they are fried to paper towels to drain and make sure the oil returns to 375°F. before adding each new batch. Add the wings to the soy-sauce mixture and braise them, covered, over moderately low heat for 45 minutes. Stir the cornstarch mixture, stir it into the braising liquid, and simmer the mixture for 1 minute, or until it is thickened. Serve the wings with the sauce over the rice, sprinkle with the minced scallion."
    ],
    "ingredients": [
        "2 cups chicken broth",
        "1 cup water",
        "1/2 cup soy sauce",
        "1/4 cup medium-dry Sherry",
        "1/4 cup firmly packed dark brown sugar",
        "1 tablespoon rice vinegar",
        "two 3-inch cinnamon sticks",
        "1 tablespoon star anise, crushed lightly with the flat side of a heavy knife",
        "2 slices of fresh gingerroot, each about the size of a quarter, flattened with the flat side of a heavy knife",
        "2 scallions, flattened with the flat side of a heavy knife, plus 1/4 cup minced scallion",
        "2 pounds chicken wings (about 10)",
        "vegetable oil for deep-frying",
        "1 teaspoon cornstarch dissolved in 1 tablespoon water",
        "cooked rice as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Braise",
        "Fry",
        "Super Bowl",
        "Anise",
        "Cinnamon",
        "Gourmet"
    ],
    "title": "Red-Cooked Chicken Wings",
    "url": "http://www.epicurious.com/recipes/food/views/red-cooked-chicken-wings-11550"
}
