{
    "directions": [
        "Preheat oven to 350°F. and season duck legs with salt and pepper.",
        "In a heavy kettle just large enough to hold legs in one layer, cook legs, skin sides down, over moderately high heat 10 to 15 minutes, or until skin in scrip and mahogany colored, removing fat from kettle as it is rendered with a metal bulb baster (or very carefully tilting the kettle and spooning off). Turn legs over and cook until browned on the other side, about 2 minutes, transferring to a plate.",
        "Pour off fat from kettle and deglaze with wine, scraping up brown bits. Boil wine until reduced to a syrup and add garlic, thyme and 1/2 cup dried fruit. Return duck legs, skin sides up, to kettle and add broth. Bring mixture to a simmer and braise, uncovered, in oven 2 hours, or until legs are very tender. Transfer legs to a platter and keep warm.",
        "Pour braising mixture into a 1-quart measuring cup and let stand until fat rises to the top. Skim off fat and pour liquid through a sieve into a saucepan, pressing hard on solids. Boil liquid until reduced by about one third and slightly thickened and add remaining 1/2 cup dried fruit. Simmer sauce until fruit is softened, about 5 minutes, and season with salt and pepper.",
        "Serve duck legs with sauce and noodles or roasted and mashed potatoes."
    ],
    "ingredients": [
        "6 large whole duck legs (about 4 1/2 pounds total), trimmed of excess fat",
        "1/2 cup dry red wine",
        "2 heads garlic, cloves separated and peeled",
        "8 fresh thyme sprigs",
        "1 cup mixed dried fruit such as dried sour cherries, chopped dried apricots, chopped pitted prunes, and raisins",
        "5 cups chicken broth",
        "Accompaniment: buttered noodles or roasted and mashed potatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Garlic",
        "Braise",
        "Dried Fruit",
        "Red Wine",
        "Winter",
        "Thyme",
        "Gourmet"
    ],
    "title": "Red-Wine-Braised Duck Legs",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-braised-duck-legs-14324"
}
