{
    "directions": [
        "Preheat oven to 325°F.",
        "In a 4- to 6-quart heavy saucepan boil wine until reduced by about half (about 3 1/4 cups). Trim oxtails and pat dry. Season oxtails with salt and pepper. In a deep heavy ovenproof kettle just large enough to hold oxtails in one layer heat 1 tablespoon butter over moderately high heat until foam subsides and brown half of oxtails on all sides, transferring to a bowl. Brown remaining oxtails in 1 tablespoon butter in same manner and transfer to bowl. Coarsely chop shallots, garlic, carrots, leeks, onion, and celery. Add vegetables to kettle and cook in 1 tablespoon butter over moderately low heat, stirring, until softened.",
        "Arrange oxtails over vegetables and add reduced wine, herbs, and enough broth to just cover oxtails. Bring liquid to a boil and braise oxtails, covered, in middle of oven 3 to 3 1/2 hours, or until meat is very tender but not falling off the bone. Transfer oxtails with a slotted spoon to a bowl and keep warm. Pour braising liquid through a fine sieve into a large saucepan and discard solids. Boil liquid until thick, shiny, and reduced to about 1 3/4 cups and whisk in remaining tablespoon butter.",
        "Serve oxtails and sauce with celery root puree or mashed potatoes."
    ],
    "ingredients": [
        "Two 750-ml. bottles dry red wine (preferably Burgundy)",
        "12 large oxtail pieces (about 6 pounds total)",
        "1/2 stick (1/4 cup) unsalted butter",
        "5 shallots",
        "5 garlic cloves",
        "2 medium carrots",
        "2 medium leeks (white parts only)",
        "1 medium onion",
        "2 celery ribs",
        "3 fresh thyme sprigs",
        "3 bay leaves",
        "1 bunch parsley stems",
        "about 4 cups beef broth",
        "Accompaniment: celery root puree or mashed potatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Herb",
        "Vegetable",
        "Bake",
        "Braise",
        "Valentine's Day",
        "Winter",
        "Gourmet"
    ],
    "title": "Red-Wine-Braised Oxtails",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-braised-oxtails-14520"
}
