{
    "directions": [
        "In large bowl stir together olives, capers, red onion, tomatoes, basil, 3 tablespoons parsley, and olive oil. Add 2 teaspoons salt, 1/2 teaspoon pepper, and red pepper flakes, and let stand at room temperature 30 minutes.",
        "Holding very sharp paring knife at 30-degree angle from fillets, cut 2 diagonal slits through skin and partially into flesh, making slits 1/2 inch apart.",
        "In large heavy skillet over high heat, heat 1/3 cup canola oil until hot but not smoking. Working in 3 batches, sprinkle fillets with 1 tablespoon salt and 1 teaspoon pepper and place skin-side down in hot pan. Saué until skin is rich golden brown, about 3 minutes, lowering heat if necessary to prevent burning. Turn fillets over and cook 3 minutes more. Transfer to platter and loosely cover with foil to keep warm. Cook remaining two batches in same manner, wiping pan clean between batches and starting with fresh oil for each batch.",
        "After removing last batch of fish, pour lemon juice into pan and swirl around to combine with pan juices. Drizzle over fish, then sprinkle with remaining 1/2 cup parsley. Garnish with tomato-olive mixture."
    ],
    "ingredients": [
        "25 black, salt-cured olives such as Gaeta or Kalamata, rinsed, pitted, and roughly chopped",
        "2 1/2 teaspoons bottled capers, rinsed",
        "2 tablespoons plus 1 1/2 teaspoons red onion, finely diced",
        "8 ripe plum tomatoes, cut into medium dice",
        "10 large basil leaves, roughly chopped",
        "1/2 cup plus 3 tablespoons fresh Italian flat-leaf parsley, roughly chopped",
        "1/2 cup extra-virgin olive oil",
        "1 tablespoon plus 2 teaspoons kosher salt",
        "1 1/2 teaspoons freshly ground black pepper plus more to taste",
        "1 teaspoon red pepper flakes",
        "10 (6-ounce) red snapper fillets, skin on",
        "1 cup canola oil",
        "6 tablespoons fresh lemon juice (from 2 lemons)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Herb",
        "Olive",
        "Onion",
        "Tomato",
        "Sauté",
        "Dinner",
        "Seafood",
        "Snapper",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Red Snapper with Black Olives, Capers, and Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/red-snapper-with-black-olives-capers-and-tomatoes-235714"
}
