{
    "directions": [
        "In a large non-stick skillet heat oil over moderately high heat until hot but not smoking and sauté bell peppers, stirring, until crisp-tender. In a bowl stir together bell peppers and ricotta, stirring until combined well. In a vegetable steamer set over simmering water steam broccoli, covered, until crisp-tender, 3 to 5 minutes, and stir into ricotta mixture with salt and pepper to taste.",
        "Preheat oven to 375°F.",
        "Pour 1 cup tomato sauce into a baking dish, 13 by 9 by 2 inches (sauce will not cover bottom completely), and cover with 3 lasagne sheets, making sure they do not touch each other. Drop about 1 1/2 cups ricotta mixture by spoonfuls onto pasta and gently spread with back of a spoon. Sprinkle 3/4 cup mozzarella and 1/3 cup Parmesan over ricotta mixture and make 2 more layers in same manner, beginning and ending with pasta. Spread remaining cup tomato sauce over pasta, making sure pasta is completely covered, and sprinkle with remaining mozzarella and Parmesan.",
        "Cover dish tightly with foil, tenting slightly to prevent foil from touching top layer, and bake in middle of oven 30 minutes. Remove foil and bake lasagne 10 minutes more, or until top is bubbling. Let lasagne stand 5 minutes before serving."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "3 large red bell peppers, chopped",
        "15 ounces ricotta (about 2 cups)",
        "1 1/2 pounds broccoli, flowerets cut into 3/4-inch pieces and stems cut into 1/2-inch dice",
        "2 cupsRich Winter Tomato Sauce",
        "twelve 7- by 3 1/2-inch sheets dry no-boil lasagne pasta",
        "10 ounces mozzarella, grated (about 2 1/2 cups)",
        "1 1/4 cups fresh grated Parmesan (about 5 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Pepper",
        "Tomato",
        "Vegetable",
        "Bake",
        "Vegetarian",
        "Winter",
        "Gourmet"
    ],
    "title": "Red, White, and Green Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/red-white-and-green-lasagne-13506"
}
