{
    "directions": [
        "Preheat the oven to 400 degrees.",
        "Slice the tomatoes crosswise in half. Using a small spoon or your fingers, scrape out the seeds. Place the tomatoes cut side down on a baking sheet lined with parchment paper (this keeps the acidic tomatoes from reacting with the pan) and roast for about 20 minutes. Let cool slightly, then remove and discard the skins and cores. Reserve.",
        "Meanwhile, also roast the peanuts on a baking sheet for 10 to 12 minutes. Let cool, then coarsely grind in a food processor. Set aside.",
        "Toast the anchos in a small skillet over medium heat. Soak in hot water to soften, about 20 minutes. Drain, and remove the seeds and stems. Reserve.",
        "Heat the canola oil in a medium skillet over high heat. Add the plantain slices and sauté until well browned and caramelized. Remove from the skillet and drain on paper towels.",
        "In a dry skillet, toast the annatto, allspice, cloves, and peppercorns until fragrant. Let cool, then combine with the canela in a spice grinder and grind to a fine powder.",
        "In a blender, puree the anchos and chipotles until smooth. Add the plantains, ground spices, and tomatoes and puree. Reserve.",
        "Pour the garlic oil into a medium pot and heat over medium-high heat. When the oil is very hot, add the puree and simmer for 10 minutes, stirring frequently. Add the peanuts and simmer for another 2 minutes. Add the chocolate and let it melt. Stir in the vinegar and chicken stock and cook for another 5 minutes. Season with salt. Refrigerated, this keeps for 1 month."
    ],
    "ingredients": [
        "3 large ripe tomatoes",
        "1 cup peanuts",
        "8 ancho chiles",
        "1/4 cup canola or peanut oil",
        "1 ripe plantain, peeled, halved lengthwise and then crosswise",
        "1 tablespoon annatto seeds",
        "1 tablespoon allspice berries",
        "1 teaspoon whole cloves",
        "1 canela or cinnamon stick, broken into pieces",
        "1 1/2 teaspoons black peppercorns",
        "3 canned chipotle chiles in adobo sauce",
        "1/3 cup Roasted Garlic Oil or pure olive oil",
        "3 3/4 ounces bittersweet chocolate, finely chopped",
        "1 tablespoon Spanish sherry vinegar",
        "2 cups Chicken Stock",
        "Kosher salt to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Blender",
        "Chocolate",
        "Garlic",
        "Tomato",
        "Roast",
        "Peanut",
        "Hot Pepper",
        "Plantain",
        "Cinnamon"
    ],
    "title": "Red Mole",
    "url": "http://www.epicurious.com/recipes/food/views/red-mole-108215"
}
