{
    "directions": [
        "In a large shallow dish whisk together the wine, the vinegar, the garlic paste, the mustard, and pepper to taste.",
        "Arrange the chicken, pricked in several places with a fork, in one layer in the dish, let it marinate, covered and chilled, turning it once, for at least 3 hours or, preferably, overnight. and drain it, reserving 1/2 cup of the marinade and discarding the rest.",
        "In a shallow dish whisk together the egg and the reserved marinade. In another shallow dish stir together the flour, the salt, the thyme, and pepper to taste. Dip the chicken in the egg mixture, letting the excess drip off, and dredge it twice in the flour mixture to make a thick coating, shaking off the excess each time. Reserve the remaining flour mixture. Let the chicken stand in one layer on a wire rack for 15 minutes.",
        "In a large skillet, preferably cast-iron, heat 1 inch of the oil to 375°F. and in it fry half the chicken for 1 minute on each side. Reduce the heat to moderate so that the temperature of the oil is reduced to 300°F., fry the chicken, uncovered, for 20 to 25 minutes, or until it is cooked through, and transfer it with tongs to paper towels to drain. Keep the chicken warm while frying the remaining chicken in the same manner. Dredge the onions in the reserved flour mixture, shaking off the excess, and in the skillet fry them in 375°F. oil, turning them carefully, for 5 minutes, or until they are lightly golden. Transfer the onions with a slotted spoon to paper towels to drain and sprinkle them with salt to taste. Mound the onions in the middle of a large platter and arrange the chicken around them."
    ],
    "ingredients": [
        "1 cup dry red wine",
        "1/2 cup red-wine vinegar",
        "3 garlic cloves, minced and mashed to a paste with a pinch of salt",
        "1 tablespoon Dijon-style mustard",
        "8 chicken thigh or drumsticks (about 2 pounds)",
        "1 large egg",
        "1 cup all-purpose flour",
        "1 teaspoon salt",
        "1/2 teaspoon dried thyme, crumbled",
        "vegetable oil for frying the chicken",
        "2 large onions, sliced thin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Poultry",
        "Fry",
        "Gourmet"
    ],
    "title": "Red-Wine Marinated Fried Chicken with Onions",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-marinated-fried-chicken-with-onions-12154"
}
