{
    "directions": [
        "Preheat oven to 300°F. Bring broth to simmer in saucepan. Remove from heat; add mushrooms, cover, and let stand until soft, about 15 minutes. Using slotted spoon, transfer mushrooms to cutting board. Chop coarsely. Reserve mushrooms and broth separately.",
        "Sprinkle beef with salt and pepper. Heat oil in heavy large ovenproof pot over medium-high heat. Add beef and cook until brown on all sides, about 15 minutes total. Transfer beef to large plate. Pour off all but 1 tablespoon drippings from pot. Place pot over medium heat. Add onion and celery. Sprinkle with salt and pepper and sauté until beginning to brown, about 8 minutes. Add garlic, chopped marjoram, and reserved porcini mushrooms; sauté 1 minute. Using hands, crush tomatoes, 1 at a time, into pot. Cook 3 minutes, stirring frequently and scraping up browned bits from bottom of pot. Add wine; boil 5 minutes. Add reserved mushroom broth, leaving any sediment behind. Boil 5 minutes.",
        "Return beef and any accumulated juices to pot. Cover; transfer to oven. Cook 1 1/2 hours. Turn beef and continue cooking until tender, about 1 1/2 hours longer. (Can be made 2 days ahead. Cool slightly. Refrigerate uncovered until cool. Cover and keep refrigerated.)",
        "Transfer beef to cutting board; tent with foil. Spoon fat from surface of juices in pot. Bring juices to boil; cook until liquid is reduced to 4 cups, about 7 minutes. Season with salt and pepper.",
        "Cut beef into 1/2-inch-thick slices. Transfer to platter. Spoon juices over, garnish with marjoram sprigs, and serve."
    ],
    "ingredients": [
        "1 cup low-salt chicken broth or beef broth",
        "1/2 ounce dried porcini mushrooms",
        "1 4-pound boneless beef chuck roast, trimmed",
        "2 tablespoons extra-virgin olive oil",
        "1 large onion, coarsely chopped",
        "2 celery stalks with some leaves, cut into 1/2-inch-thick slices",
        "3 garlic cloves, smashed",
        "1 tablespoon chopped fresh marjoram plus sprigs for garnish",
        "1 28-ounce can whole peeled tomatoes, drained",
        "1 cup dry red wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Mushroom",
        "Onion",
        "Tomato",
        "Roast",
        "Celery",
        "Red Wine",
        "Winter"
    ],
    "title": "Red-Wine Pot Roast with Porcini",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-pot-roast-with-porcini-233926"
}
