{
    "directions": [
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil. Place the pepper, cut-side down, on the prepared baking sheet.",
        "Cook pepper under the preheated broiler until pepper skin blackens and blisters, 5 to 8 minutes. Place blackened pepper into a bowl and tightly seal with plastic wrap. Allow the pepper to steam as it cools, about 20 minutes. Remove and discard skin; thinly slice pepper.",
        "Stir mashed potatoes, egg, bread crumbs, salt, and black pepper together in a bowl until smooth.",
        "Heat olive oil in a large nonstick skillet over medium heat. Working in batches, drop batter by spoonfuls into hot oil and flatten out to form a small pancake. Cook until golden and crispy on one side, about 7 minutes. Flip and cook until golden and crispy on the other side, 5 to 7 minutes more. Wipe skillet clean with a paper towel.",
        "Place scallops in a bowl and season olive oil, cayenne pepper, and salt.",
        "Heat the same nonstick skillet over high heat. Place scallops in the center of the skillet; place red peppers in a pile in the side of the skillet. Cook scallops until a golden crust develops, 3 to 4 minutes. Transfer scallops to a plate, leaving peppers in the skillet.",
        "Cook and stir peppers, basil, butter, and capers together in the hot skillet; pour water into skillet, stir sauce, and remove from heat.",
        "Arrange pancakes in a single layer on plates or a platter; place 2 to 3 scallops on each pancake. Top with pepper sauce."
    ],
    "ingredients": [
        "1/2 red bell pepper",
        "3/4 cup cold mashed potatoes",
        "1 egg, beaten",
        "2 tablespoons dry bread crumbs",
        "1 pinch salt and freshly ground black pepper to taste",
        "1 pound scallops",
        "1 teaspoon olive oil",
        "cayenne pepper to taste",
        "1/4 cup fresh whole basil leaves, or to taste",
        "1 tablespoon butter",
        "1 tablespoon capers",
        "1/4 cup water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Red Pepper Scallops on Potato Pancakes",
    "url": "http://allrecipes.com/recipe/238587/red-pepper-scallops-on-potato-pancake/"
}
