{
    "directions": [
        "For the cookies: Sift the flour, cocoa powder, baking soda and 1/8 teaspoon salt into a medium bowl.",
        "Beat the butter and granulated sugar in the bowl of a stand mixer fitted with a paddle attachment (or a large bowl if using a hand mixer) on medium speed just until combined. Beat in the egg yolk just until combined. Beat in the food coloring and vanilla until the color is evenly distributed, scraping down the bowl as needed. Reduce the mixer speed to low and gradually add the flour mixture. Beat just until the dough comes together. Form the dough into two 1-inch-thick disks, wrap tightly in plastic and refrigerate until firm, about 2 hours.",
        "Preheat the oven to 350 degrees F. Line two baking sheets with parchment paper.",
        "Lightly dust a sheet of parchment paper with flour. Unwrap one disk, place it on the paper and cover with a large sheet of plastic wrap. Roll the dough out to 1/8 inch thick. Peel off the plastic wrap and, using a 2 1/2-inch round cookie or biscuit cutter, cut the dough into rounds. Place them on the prepared baking sheets, spacing them 1 inch apart (about 12 cookies per sheet). Gather the scraps, chill until firm, roll again and cut. Repeat with the remaining disk.",
        "Bake the cookies until set and brick-red, 8 to 10 minutes, rotating the baking sheets halfway through. Let the cookies cool on the sheets for 3 minutes, then transfer to a wire rack to cool completely.",
        "For the filling: Meanwhile, in the bowl of a stand mixer fitted with a paddle attachment (or a medium bowl if using a hand mixer), beat the butter on medium speed until light and creamy. Add the cream cheese and beat until smooth and creamy, 2 to 3 minutes. Add the confectioners' sugar, vanilla and a pinch of salt and beat until smooth and fully incorporated. Refrigerate the filling until it is slightly firm, about 2 hours.",
        "To assemble the cookies, put a heaping teaspoon of filling on a cookie and top with another cookie, gently pressing to spread the filling to the edge of the cookies."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour, plus more for rolling",
        "1 1/2 teaspoons unsweetened cocoa powder",
        "1/4 teaspoon baking soda",
        "Fine salt",
        "6 tablespoons unsalted butter, softened",
        "1/2 cup plus 2 tablespoons granulated sugar",
        "1 large egg yolk",
        "1 1/2 teaspoons red food coloring",
        "1 teaspoon vanilla extract",
        "4 tablespoons unsalted butter, softened",
        "4 ounces cream cheese, softened",
        "3/4 cup confectioners' sugar",
        "1/2 teaspoon pure vanilla extract",
        "Fine salt"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chocolate Cookie Recipes",
        "Chocolate",
        "Cookie",
        "Baking",
        "Dessert",
        "Sandwich",
        "Cheese",
        "Cream Cheese Recipes"
    ],
    "title": "Red Velvet Sandwich Cookies",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/red-velvet-sandwich-cookies"
}
