{
    "directions": [
        "Preheat the oven to 350°F. Grease jumbo muffin cups (3 1/2 inches in diameter and 2 inches deep) with butter or cooking spray, and lightly flour them, knocking out the excess flour, or line them with baking papers.",
        "In a small bowl, stir the food coloring and cocoa powder together to make a smooth paste. Set aside. Using an electric mixer fitted with the paddle attachment, cream the butter and the sugar on medium-high speed until light and fluffy, about 2 minutes. Add the eggs, one at a time, beating after each addition, then add the cocoa paste while continuing to beat. Reduce the mixer speed to medium and beat the batter for about 4 minutes. In a medium bowl, sift together the cake flour, all-purpose flour, salt, and baking soda. Stir the vanilla into the buttermilk (this can be done in the measuring cup). Add the flour mixture in 3 increments alternately with the buttermilk in 2 increments, starting and ending with the flour. Beat on medium speed just until the ingredients are combined. Add the sour cream and vinegar and beat on low speed until combined.",
        "Fill the muffin cups three-fourths full with batter. Bake for 25 to 35 minutes, just until the cupcakes feel firm to the touch and a toothpick inserted in the center comes out clean. Do not overbake, or the cupcakes will dry out. Remove from the oven and let cool in the pans for 5 minutes, then unmold onto a wire rack and let cool completely before frosting.",
        "To make the icing: In the large bowl of an electric mixer fitted with the paddle attachment, beat the butter, cream cheese, and powdered sugar on medium-high speed until light and fluffy. Beat in the mascarpone on very low speed until just combined. (Be careful; once you've added the mascarpone, excessive beating can make the frosting curdle.) Stir in the vanilla or mint extract.",
        "Frost the top of each muffin with the icing. Sprinkle the crushed peppermint candy, if using, evenly on the cupcakes."
    ],
    "ingredients": [
        "1/4 cup (2 ounces) red food coloring",
        "3 1/2 tablespoons high-quality unsweetened cocoa powder",
        "1 cup (2 sticks) unsalted butter at room temperature",
        "1 3/4 cups sugar",
        "2 large eggs",
        "2 cups cake flour",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon kosher salt",
        "1 teaspoon baking soda",
        "2 teaspoons vanilla extract",
        "1 cup buttermilk",
        "1 cup sour cream",
        "1 tablespoon distilled white vinegar",
        "1 cup (2 sticks) unsalted butter at room temperature",
        "1 cup (8 ounces) cream cheese at room temperature",
        "2 cups powdered sugar",
        "1 teaspoon vanilla extract",
        "Pinch of kosher salt",
        "1 cup (8 ounces) mascarpone (Italian cream cheese, available at most grocery stores)",
        "1 teaspoon vanilla or mint extract",
        "Crushed peppermint candy for garnish (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Bake",
        "Christmas",
        "Marscarpone"
    ],
    "title": "Red Velvet Cupcakes with Mascarpone Cream Cheese Icing",
    "url": "http://www.epicurious.com/recipes/food/views/red-velvet-cupcakes-with-mascarpone-cream-cheese-icing-358285"
}
