{
    "directions": [
        "Boil wine, broth, and thyme in a 6- to 7-quart wide heavy pot until reduced to about 5 cups, about 30 minutes, then pour through a fine sieve into a heatproof bowl.",
        "Cook whole shallots in oil in cleaned pot over moderate heat, stirring frequently, until golden, about 6 minutes. Add garlic cloves and cook, stirring frequently, until garlic is golden and shallots are golden brown, about 2 minutes. Transfer with a slotted spoon to a plate, reserving fat in pot.",
        "Pat ribs dry and season well with salt and pepper. Heat fat in pot over high heat, then sear ribs in 3 batches until browned on all sides, about 4 minutes per batch, transferring with tongs to a bowl. Pour off any fat in pan.",
        "Return ribs, shallots, garlic, and reduced wine to pot with jelly and salt to taste, then simmer, covered, without stirring, 1 3/4 hours.",
        "After meat has been simmering 1 1/4 hours, peel carrots, then cut carrots and zucchini diagonally into 1/2-inch-thick slices. Peel potatoes.",
        "Add potatoes and carrots to pot (don't stir) and simmer, covered, until ribs are tender and potatoes and carrots are just tender, about 30 minutes.",
        "Add zucchini to pot (don't stir) and simmer, covered, until just tender, about 6 minutes.",
        "Transfer meat and vegetables with a slotted spoon to a large serving dish. Discard any loose bones and keep meat and vegetables warm, covered.",
        "Skim fat from sauce and reserve 1 tablespoon fat. Stir reserved fat into flour in a small bowl to make a dry paste. Thin paste with 2 tablespoons warm sauce. Bring sauce to a boil and whisk in half of flour paste until thickened. (If necessary, whisk more paste into boiling sauce until thickened to desired consistency.) Simmer sauce, whisking occasionally, about 3 minutes. Pour over meat and vegetables."
    ],
    "ingredients": [
        "1 (750-ml) bottle dry red wine",
        "5 cups beef stock or broth",
        "2 fresh thyme sprigs",
        "12 small shallots (1 lb), peeled and trimmed",
        "1 1/2 tablespoons vegetable oil",
        "5 large garlic cloves, peeled",
        "4 lb beef short ribs, cut into 1-rib pieces if necessary",
        "1 tablespoon red currant jelly",
        "1 lb carrots",
        "1 lb zucchini",
        "1 1/2 lb small (1 1/2-inch diameter) boiling potatoes",
        "3 tablespoons all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Beef",
        "Vegetable",
        "Braise",
        "Dinner",
        "Meat",
        "Beef Rib",
        "Carrot",
        "Zucchini",
        "Red Wine",
        "Fall",
        "Winter",
        "Shallot",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Red Wine-Braised Short Ribs with Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/red-wine-braised-short-ribs-with-vegetables-106160"
}
