{
    "directions": [
        "To prepare the dough, combine the flour and oregano in the bowl of an electric mixer fitted with a paddle attachment. Add the shortening and mix on low speed until the mixture resembles oatmeal. In a bowl, combine the water and salt, and slowly drizzle into the mixer while on low speed. Mix until the water is fully absorbed; do not overwork the dough or it will form a ball. Wrap the dough in plastic and refrigerate for 30 minutes.",
        "To prepare the filling, combine the cabbage, onion, jalapeño, mustard, horseradish, canela, allspice, vinegar, sugar, salt, and 1/2 cup water in a saucepan. Bring to a boil, reduce the heat to a simmer, and cook, covered, for 1 hour, or until the cabbage is tender. Remove the pan from the heat, let cool, and drain. In a mixing bowl, combine the cooled cabbage with the Gorgonzola and walnuts and set aside.",
        "Preheat the oven to 400°F.",
        "Remove the chilled dough from the refrigerator and cut into 16 equal pieces. Using a lightly floured rolling pin, roll out each piece into a circle about 1/8 inch thick. In a bowl, whisk together the egg and water. Divide the cabbage filling evenly among the circles, placing it in the center of each. With a pastry brush, brush the exposed edges of the dough with the egg wash. Carefully fold each circle in half, making sure the filling is completely sealed inside, and crimp the edges with a fork. Make a small slit in the top of each empanada to allow the steam to escape.",
        "Place the empanadas on a lightly greased cookie sheet and brush with the remaining egg wash. Transfer to the oven and bake for 25 minutes, or until the pastry is shiny and golden brown."
    ],
    "ingredients": [
        "1 1/3 cups all-purpose flour",
        "1 tablespoon dried oregano",
        "6 tablespoons vegetable shortening",
        "1/4 cup cold water",
        "1/4 teaspoon salt",
        "1/2 head of red cabbage, cored and juilienned",
        "1/2 onion, minced",
        "1 jalapeño chile, seeded and minced",
        "1 tablespoon whole-grain mustard",
        "1 teaspoon prepared horseradish",
        "Pinch of ground canela or cinnamon",
        "Pinch of ground allspice",
        "1 cup cider vinegar",
        "1/2 cup sugar",
        "1/2 tablespoon salt",
        "1/3 cup crumbled Gorgonzola cheese",
        "1/4 cup toasted chopped walnuts",
        "1 large egg",
        "1/4 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Vinegar",
        "Blue Cheese",
        "Walnut",
        "Winter",
        "Cabbage",
        "Jalapeño",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Red Cabbage, Blue Cheese, and Walnut Empañadas",
    "url": "http://www.epicurious.com/recipes/food/views/red-cabbage-blue-cheese-and-walnut-empanadas-104136"
}
