{
    "directions": [
        "Heat 2 tablespoons of the oil in a large Dutch oven over high heat. Sprinkle the beef with salt and pepper and add one-third of the meat to the pan and saute until browned on all sides. Repeat with the oil and meat, draining any excess liquid from the pan between the batches. Return the meat to the pan, sprinkle with the cumin and stir well. Deglaze the pan with the beer and bring to a boil. Cook until the beer is almost completely reduced. Remove the meat from the pan and set aside.",
        "In the same pan, add the remaining 1 tablespoon oil to the same pan and then add the onions and cook on medium heat until soft. Add the garlic and cook for 2 minutes. Add the habanero, Thai bird, jalapeno and poblano peppers and cook until soft, about 5 minutes. Add the ancho chile pepper, cascabel chile powder, chipotle pepper puree, pasilla chile powder and New Mexican chile powder, and cook an additional 2 minutes. Add the chicken stock and tomatoes, bring to a boil and cook until slightly thickened, 15 to 20 minutes.",
        "Puree with an immersion blender. Add the beef back to the pan, reduce the heat to medium, cover and simmer until the chili is thick and the beef is tender, about 1 hour 15 minutes. If the chili has too much liquid, continue to cook uncovered to thicken, about 15 minutes. Remove from the heat, add in the chocolate and maple syrup and stir until the chocolate is melted and combined and adjust seasonings. Serve with Toasted Cumin Crema.",
        "Place the cumin in a small saute pan over medium heat. Toast until lightly golden brown. Place in a small bowl. Stir in the crema and season with salt and pepper. Place in a squeeze bottle for serving."
    ],
    "ingredients": [
        "7 tablespoons canola or vegetable oil",
        "4 pounds bottom round beef, cut into 1/2 -inch cubes",
        "Kosher salt and freshly ground black pepper",
        "2 tablespoons ground cumin",
        "One 12-ounce bottle dark beer",
        "1 large red onion, finely diced",
        "4 cloves garlic, finely chopped",
        "1 teaspoon seeded and chopped habanero",
        "1 Thai bird chile, seeded and chopped",
        "1/2 jalapeno, seeded and chopped",
        "1/2 poblano, seeded and chopped",
        "1 tablespoon ancho chile powder",
        "1 tablespoon cascabel chile powder",
        "1 tablespoon chipotle pepper puree",
        "1 tablespoon pasilla chile powder",
        "1 teaspoon New Mexican chile powder",
        "5 cups homemade chicken stock, canned low-sodium broth or water",
        "One 16-ounce can whole tomatoes, drained and pureed",
        "2 tablespoons finely chopped semisweet chocolate",
        "2 tablespoons maple syrup, or more as needed",
        "1/2 tablespoon cumin seeds",
        "1/2 cup Mexican crema or creme fraeche",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Beef Chili",
        "Beef",
        "Chili",
        "Meat",
        "Dutch Oven",
        "Chile Peppers",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Red Beef Chili",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/red-beef-chili-recipe"
}
