{
    "directions": [
        "In a large bowl wash the lentils in several changes of cold water until the water runs clear and drain them in a fine sieve. In a large heavy saucepan cook the onions in the oil over moderate heat, stirring, until they are softened, add the garlic and the gingerroot, and cook the mixture, stirring, for 1 minutes. Add the cumin and the ground coriander seeds and cook the mixture over moderately low heat, stirring, for 1 minute. Add the lentils, the broth, 1 1/2 cups water, and the tomatoes and simmer the mixture, covered, for 15 to 20 minutes, or until the lentils are tender. In a blender or food processor purée the mixture in batches, transferring it to a bowl as it is puréed, return the soup to the pan, cleaned, and season it with salt and pepper. The soup may be made 3 days in advance and kept covered and chilled. Reheat the soup and thin it, if necessary, with water.",
        "In a small skillet or saucepan heat the oil over moderately high heat until it is hot but not smoking, add the chili, the cuminseed, and the turmeric, and fry the spices, stirring, for 10 to 15 seconds, or until the sizzling begins to subside. Remove the skillet from the heat.",
        "Heat the soup over moderate heat, stirring, until it is hot and ladle it into bowls. Drizzle the spiced oil with a spoon over the soup, garnish each serving with a coriander sprig, and serve the soup with the pappadams.",
        "In a skillet at least 2 inches wider than a pappadam heat 1/2 inch of the oil to 375°F. on a deep-fat thermometer and in it fry the pappadams, 1 at a time, turning them, for 10 to 15 seconds, or until they have expanded and turned pale golden. Transfer the pappadams as they are fried to paper towels to drain. The pappadams may be fried 1 day in advance and kept, covered loosely, at room temperature."
    ],
    "ingredients": [
        "1 cup red lentils (available at natural foods stores, East Indian markets, and some supermarkets), picked over",
        "2 onions, chopped",
        "2 tablespoons vegetable oil",
        "5 garlic cloves, minced",
        "4 teaspoons grated peeled fresh gingerroot",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander seeds",
        "3 cups chicken broth",
        "1 cup drained canned tomatoes",
        "2 tablespoons vegetable oil",
        "1 1/2 teaspoons minced seeded fresh red chili (wear rubber gloves) or 1/4 teaspoon dried hot red pepper flakes",
        "1/4 teaspoon cuminseed",
        "1/4 teaspoon turmeric",
        "fresh coriander sprigs for garnish if desired",
        "pappadams as an accompaniment",
        "(Crisp Lentil Wafers)",
        "pappadams (available at East Indian markets and specialty foods shops)",
        "vegetable oil for frying the pappadams"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Ginger",
        "Onion",
        "Tomato",
        "Side",
        "Valentine's Day",
        "Lentil",
        "Gourmet"
    ],
    "title": "Red Lentil Soup with Spiced Oil",
    "url": "http://www.epicurious.com/recipes/food/views/red-lentil-soup-with-spiced-oil-11495"
}
