{
    "directions": [
        "Steam potatoes until almost tender, about 8 minutes. Cool.",
        "Melt butter with 2 tablespoons oil in heavy large pot over medium-high heat. Add onions; sauté until golden brown, about 8 minutes. Mix in 3 tablespoons oil and garlic. Add potatoes; cook 2 minutes. Mix in red wine. Boil until almost no liquid remains, about 4 minutes. Add stock, tomatoes with juices and oregano and bring to boil. Add olives; boil until liquid thickens slightly and potatoes are very tender, about 12 minutes. Mix in 3 tablespoons parsley. Season with salt and pepper.",
        "Meanwhile, sprinkle fish with salt and pepper. Heat 1 1/2 tablespoons oil in each of 2 heavy large nonstick skillets over medium-high heat. Add fish fillets and sauté until just opaque in center, about 3 minutes per side.",
        "Arrange potatoes in center of each of 6 plates. Spoon some sauce over. Top with fish. Spoon remaining sauce over fish. Sprinkle with 1 tablespoon parsley. Drizzle with 1 tablespoon olive oil and serve."
    ],
    "ingredients": [
        "4 large Yukon Gold potatoes, peeled, cut into 1/4-inch-thick slices",
        "1 tablespoon butter",
        "9 tablespoons extra-virgin olive oil",
        "3 small onions, sliced",
        "8 garlic cloves, thinly sliced",
        "1 cup dry red wine",
        "2 cups chicken stock or canned low-salt chicken broth",
        "1 14-ounce can diced tomatoes in juice",
        "1 teaspoon dried oregano",
        "1/3 cup Kalamata olives or other brine-cured black olives",
        "4 tablespoons chopped fresh parsley",
        "6 7-ounce red snapper or blackfish fillets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Olive",
        "Potato",
        "Tomato",
        "Sauté",
        "Snapper",
        "Red Wine",
        "Healthy"
    ],
    "title": "Red Snapper with Potatoes, Tomatoes and Red Wine",
    "url": "http://www.epicurious.com/recipes/food/views/red-snapper-with-potatoes-tomatoes-and-red-wine-5877"
}
