{
    "directions": [
        "Whisk together red wine vinegar, raspberry jam, 1 tablespoon olive oil, and black pepper in a bowl until smooth. Cover bowl with plastic wrap and refrigerate to blend flavors, at least 30 minutes.",
        "Lightly toss tomato, spinach, and Italian cheese blend in a bowl. Drizzle the mixture with 3 tablespoons raspberry dressing and toss again.",
        "Heat 1 tablespoon olive oil in a large skillet over medium heat; place a tortilla into the skillet and cook until small brown spots dot the bottom of the tortilla, about 45 seconds.",
        "Flip tortilla over and cook until it starts to slightly puff up, another 45 seconds.",
        "Transfer the warmed tortilla to a plate lined with paper towels.",
        "Repeat with remaining tortillas; stack them on the paper plate with paper towels between each.",
        "Heat 2 tablespoons olive oil in skillet over medium-high heat; place chicken breasts into hot oil and pan-fry until lightly browned and no longer pink inside, about 5 minutes per side. Set chicken aside.",
        "In the same skillet over medium heat, cook and stir cremini mushrooms, red bell pepper, and green onion until  mushrooms have softened and released their juice, 5 to 8 minutes.",
        "Transfer mushroom mixture to a plate lined with paper towels to remove excess moisture.",
        "Thinly slice chicken breasts, then chop into 1/2-inch pieces.",
        "Return chopped chicken to the hot skillet and cook and stir until the chicken is lightly browned, 3 to 5 minutes.",
        "To assemble, place a warm tortilla onto a plate. Sprinkle with 1/4 of the chopped chicken.",
        "Drizzle chicken with 1 teaspoon of raspberry dressing.",
        "Top with 1/4 of the tomato-cheese mixture and 1/4 of the mushroom mixture.",
        "Roll the tortilla over the fillings to serve."
    ],
    "ingredients": [
        "2 tablespoons red wine vinegar",
        "1 1/2 tablespoons seedless raspberry jam",
        "1 tablespoon extra-virgin olive oil",
        "1/8 teaspoon freshly ground black pepper",
        "1 tomato, seeded and coarsely chopped",
        "1 cup fresh spinach leaves - stems removed, leaves rolled, and finely sliced",
        "1/4 cup shredded Italian cheese blend (Parmesan, Romano, and Asiago)",
        "1 tablespoon extra-virgin olive oil",
        "4 (8 inch) whole wheat tortillas",
        "2 tablespoons extra-virgin olive oil",
        "2 skinless, boneless chicken breast halves",
        "4 cremini mushrooms, coarsely chopped",
        "1/2 red bell pepper, chopped",
        "1 green onion, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Red Bird Wrap",
    "url": "http://allrecipes.com/recipe/220135/red-bird-wrap/"
}
