{
    "directions": [
        "In a sauté pan, melt the butter over medium heat and sauté the shallots in the butter until soft, about 4 minutes. Spoon the shallots out of the pan and into a mixing bowl. Crack the egg into the shallots and whisk in the cream, chipotle puree, herbs, and salt and pepper.",
        "Break up the salmon into large chunks. Fold the salmon in with the beets and potatoes in a medium size bowl and pour the custard over the top, then toss gently with half of the panko or fresh bread crumbs. Try not to break up the salmon chunks. Form the salmon hash into 4 equal-size cakes no thicker than 1 inch, and sprinkle each cake with the remaining bread crumbs. Let the cakes rest in the fridge for 1 hour to set.",
        "Heat the butter in a deep heavy-bottomed skillet until shimmering and sauté the salmon cakes for 4 minutes on each side, until they develop a nice brown crust and are warm inside. As they are cooked, keep them warm in a 200°F oven.",
        "In the top of a double boiler, whisk the egg yolks with the lemon juice and water until the liquid forms pale ribbons; this takes about 5 minutes. Whisk in the clarified butter until the mixture thickens. Season with salt and pepper and ground coriander seed and fold in the cilantro leaves.",
        "Use a heavy saucepan, about 10 inches in diameter with sides at least 2 inches deep. Add water to a depth of 1 inch and bring to a simmer. Add a small amount of white vinegar to the poaching water for the eggs. (White vinegar helps the whites to coagulate.) Stir the water a little bit to create a vortex and crack an egg into the center. This helps the white stay centered around the yolk. Repeat for each egg. (You can also use a commercial poaching dish.) Poach the eggs to the desired degree of doneness.",
        "To serve, gently place a poached egg on each salmon cake. Drizzle with hollandaise and serve immediately.",
        "Cut 1 pound of butter into 1-inch pieces and place in a heavy-bottom saucepan over low heat. Simmer butter very slowly, skimming off any white foam that rises to the top. After 15 minutes or so, the butter solids will sink to the bottom of the pan. Remove the pan from the heat and let stand for a few minutes. Carefully ladle the clarified butter into a clean jar or crock. The clarified butter will keep, if well covered in the fridge, for up to 4 weeks.",
        "Yield: about 3/4 pound of clarified butter.",
        "*To make the chipotle puree, empty the contents of a small can of chipotles in adobo into a blender and puree until very smooth, making sure all of the seeds are broken down."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "2 shallots, thinly sliced",
        "1 egg",
        "1/4 cup heavy cream",
        "1/2 teaspoon chipotle puree*",
        "1 tablespoon minced fresh cilantro, thyme, or parsley",
        "Salt and freshly ground black pepper>",
        "8 ounces oven-steamed salmon, or an 8-ounce fillet of raw salmon poached in 2 cups court bouillon",
        "1 medium-size red beet, roasted until tender, peeled, and cut into 1/2-inch dice",
        "1 large russet potato, cooked until tender, peeled, and cut into 1/2-inch dice",
        "1/2 cup panko (Japanese bread crumbs), or fresh bread crumbs",
        "2-3 tablespoons butter, for sautéing",
        "2 egg yolks",
        "2 tablespoons lemon juice",
        "1 tablespoon water",
        "1 cup clarified butter (see Chef's Trick)",
        "Salt and pepper to taste",
        "1 teaspoon ground coriander seed",
        "3 tablespoons minced fresh cilantro",
        "White vinegar",
        "4 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Herb",
        "Potato",
        "Breakfast",
        "Brunch",
        "Poach",
        "Sauté",
        "Steam",
        "Salmon",
        "Beet",
        "Spring",
        "Pescatarian"
    ],
    "title": "Red-Flannel Salmon Hash with Poached Eggs and Coriander Hollandaise",
    "url": "http://www.epicurious.com/recipes/food/views/red-flannel-salmon-hash-with-poached-eggs-and-coriander-hollandaise-234559"
}
