{
    "directions": [
        "In a heavy kettle cook the bacon over moderately low heat, stirring occasionally, until it is crisp, transfer it to paper towels to drain, and reserve it. Pour off all but 1/4 cup of the fat and in the remaining fat cook the onion, the garlic, the bay leaf, the chili powder, the cuminseed, and the cayenne, stirring, until the onion is softened. Add the celery, the carrot, the beans, 4 cups of the broth, and 2 cups water and simmer the soup, covered, for 1 to 1 1/2 hours, or until the beans are tender. Add the tomatoes with the reserved juice and simmer the soup, covered, for 20 minutes. Discard the bay leaf and force the soup in batches through a food mill into a large saucepan. Stir in the Sherry, salt and pepper to taste, and the additional broth or water to thin the soup to the desired consistency, simmer the soup for 5 minutes, and serve it with the reserved bacon, the scallion greens, and the sour cream.",
        "In a colander rinse the beans under cold water and discard any discolored ones. In a kettle combine the beans with enough cold water to cover them by 2 inches, bring the water to a boil, and boil the beans for 2 minutes. Remove the kettle from the heat and let the beans soak, covered, for 1 hour."
    ],
    "ingredients": [
        "1/2 pound lean bacon (about 8 slices), cut into 1/2-inches pieces",
        "1 1/2 cups finely chopped onion",
        "2 large garlic cloves",
        "1 bay leaf",
        "1 tablespoon chili powder",
        "1 1/2 teaspoons ground cuminseed",
        "1/4 teaspoon cayenne, or to taste",
        "1 1/2 cups chopped celery",
        "1 1/2 cups chopped carrot",
        "1 pound red beans such as kidney or pinto, soaked in enough cold water to cover them by 2 inches overnight or quick-soaked (procedure follows) and drained",
        "4 cups chicken broth plus, if desired, additional for thinning the soup",
        "a 28-ounce can Italian tomatoes, drained, reserving the juice, and chopped",
        "1/2 cup medium-dry Sherry",
        "chopped scallion greens as an accompaniment",
        "sour cream as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Onion",
        "Tomato",
        "Appetizer",
        "Bacon",
        "Celery",
        "Carrot",
        "Winter",
        "Gourmet"
    ],
    "title": "Red Bean and Bacon Soup",
    "url": "http://www.epicurious.com/recipes/food/views/red-bean-and-bacon-soup-11491"
}
