{
    "directions": [
        "Pat fish dry, then score skin of each fillet twice diagonally with a sharp knife to help prevent them from curling in pan. Brush skin side with 1 tablespoon oil (total) and arrange fillets skin side down on a tray. Brush flesh sides with another tablespoon oil and season with 1/2 teaspoon salt.",
        "Preheat oven to 200°F.",
        "Heat 1 tablespoon oil in a large heavy skillet over medium-high heat until it shimmers. Sauté haricots verts, apricots, and toasted pine nuts until beans are crisp-tender with some golden edges, about 4 minutes.",
        "Remove from heat, then stir in mint and 1/4 teaspoon salt. Divide among 4 plates and keep warm in oven. Wipe out skillet.",
        "Heat cleaned skillet and another dry large heavy skillet (not nonstick) over medium-high heat 2 minutes. Add 1/2 tablespoon oil to one skillet, swirling to coat, then place 4 fillets skin side down in skillet, immediately pressing each one flat with a spatula to prevent curling before adding the next. Swirl remaining 1/2 tablespoon oil in other skillet, then add remaining fillets in same manner. Cook fish, without turning, pressing flat as necessary, until skin is golden and fish is almost cooked through (it will continue to cook from residual heat), 3 to 4 minutes.",
        "Arrange 2 fillets, skin side up, over vegetables on each plate. Drizzle plates lightly with additional oil."
    ],
    "ingredients": [
        "8 (2-ounce) rouget (red mullet) fillets with skin (from four 3/4-pound whole fish), pin bones removed with tweezers",
        "1/4 cup mild extra-virgin olive oil (preferably from Liguria), divided, plus additional for drizzling",
        "1/3 pound haricots verts, trimmed and cut into 1/4-inch pieces",
        "6 dried apricots, cut into 1/4-inch dice",
        "1/4 cup pine nuts, <epi recipelink=\"\" id=\"105622\">toasted</epi>",
        "6 large mint leaves, very thinly sliced crosswise",
        "small mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Apricot",
        "Mint",
        "Pine Nut",
        "Seafood",
        "Green Bean",
        "Healthy",
        "Gourmet",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Red Mullet Fillets with Haricots Verts and Dried Apricots",
    "url": "http://www.epicurious.com/recipes/food/views/red-mullet-fillets-with-haricots-verts-and-dried-apricots-243619"
}
