{
    "directions": [
        "Heat a medium heavy saucepan over medium heat. Add ham and sauté until golden brown, adding vegetable oil as needed if the ham scraps are lean. Add shallots and cook, stirring often, until they begin to soften, about 3 minutes. Stir in coffee, scraping up any browned bits.",
        "Add stock, sorghum syrup, and vinegar; bring to a simmer and cook until sauce coats the back of a spoon, about 20 minutes. Strain into a small bowl. DO AHEAD: Can be made 2 days ahead. Let cool completely; cover and chill. Rewarm before using.",
        "Melt 3 tablespoons butter in a large heavy pot over medium heat. Add onion and cook, stirring often, until softened, about 8 minutes. Add garlic and cook until fragrant, about 2 minutes. Add broth, peas, and 3 bay leaves. Bring to a boil; reduce heat to medium-low and cook, skimming the surface occasionally, until peas are tender, about 1 1/4 hours. Discard bay leaves.",
        "Strain peas, reserving broth. Transfer 2 cups strained peas to a medium bowl; mash into a paste. Return whole and mashed peas to pot, along with some of the broth to thin mixture. Season with salt. DO AHEAD: Can be made 2 days ahead.",
        "Melt remaining 4 tablespoons butter in small pan over medium heat. Simmer until browned bits form on bottom of pan, 5-6 minutes. Stir in coriander, fennel, lemon peel, cayenne, and remaining 2 bay leaves; cook, stirring, for 1 minute. Remove pan from heat. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Rewarm and discard bay leaves and lemon peel from spice butter before serving.",
        "Combine first 4 ingredients in a small bowl. Season pork with spice mixture; let stand for 1 hour.",
        "Preheat oven to 350°F. Heat oil in a large cast-iron skillet over high heat. Sear pork on all sides until deep golden brown, about 8 minutes total. Transfer skillet to oven. Roast pork, occasionally brushing with glaze, until an instant-read thermometer inserted into meat registers 140°F, about 15 minutes. Transfer meat to a carving board. Let rest, uncovered, for 10 minutes.",
        "Reheat peas and spice butter. Cut pork into 1/4\"-1/2\"-thick slices. Transfer to plates and spoon pickle purée over. Serve with peas drizzled with spoonfuls of spice butter."
    ],
    "ingredients": [
        "2 ounces country ham scraps or prosciutto",
        "1-2 teaspoons vegetable oil (optional)",
        "3 tablespoons shallots, coarsely chopped",
        "1/2 cup strong coffee or espresso",
        "2 cups pork stock or low-salt chicken broth",
        "3 tablespoons sorghum syrup or honey",
        "2 tablespoons apple cider vinegar",
        "7 tablespoons unsalted butter, divided",
        "1 cup minced yellow onion",
        "1/4 cup minced garlic",
        "8 cups low-salt chicken broth",
        "2 cups dried black-eyed peas, soaked overnight, drained",
        "5 bay leaves, divided",
        "Kosher salt",
        "1 tablespoon each crushed toasted coriander and fennel seeds",
        "1 1x3\" strip lemon peel, all white pith removed",
        "1 teaspoon cayenne pepper",
        "1 tablespoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/4 teaspoon cayenne pepper",
        "1/4 teaspoon (packed) light brown sugar",
        "2 1 1/4-pound trimmed pork tenderloins",
        "2 tablespoons vegetable oil",
        "1 cup bread-and-butter pickles, blended to a coarse purée"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Bean",
        "Pork",
        "Low Cal",
        "Dinner",
        "Pork Tenderloin",
        "Legume",
        "Winter",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Redeye-Glazed Pork Tenderloin with Black-Eyed Peas",
    "url": "http://www.epicurious.com/recipes/food/views/redeye-glazed-pork-tenderloin-with-black-eyed-peas-388714"
}
