{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Spray 2 9-inch cake pans with cooking spray. Whisk together the whole wheat flour and salt in a bowl.",
        "Beat together the applesauce, 3/4 cup plus 1 tablespoon of sugar and sucralose baking blend, and egg substitute with an electric mixer on Medium speed in a large mixing bowl. In a small bowl, stir the cocoa powder and red food coloring together until smooth, and mix into the liquid ingredients. Gradually beat in the whole wheat flour mixture, alternating with buttermilk in several additions, and mix in 1 1/4 teaspoon of vanilla extract. In a small bowl, stir the vinegar and baking soda together, and mix into the batter. Pour batter into the cake pans, and tap the filled pans on the counter to remove air bubbles.",
        "Bake in the preheated oven until the cakes are set and a toothpick inserted into the center of a cake comes out clean, 20 to 25 minutes. Allow to cool completely before frosting.",
        "For frosting, place the vanilla yogurt and cottage cheese into the work bowl of a food processor, and process until smooth; add the cream cheese, and process again to smoothly blend the mixture. Add confectioners' sugar and 1 teaspoon of vanilla extract, and process again to make a smooth frosting, 30 seconds to 1 more minute, scraping the sides of the bowl. If frosting seems too stiff to spread, blend in skim milk, 1 teaspoon at a time, until the frosting is spreadable and smooth. Chill frosting for 1 hour before frosting cake. After frosting, chill cake before serving for easier cutting."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/250x250/665300.jpg",
    "ingredients": [
        "Cooking spray",
        "2 1/4 cups whole wheat flour",
        "1 teaspoon salt",
        "1/2 cup unsweetened applesauce",
        "3/4 cup sugar and sucralose blend for baking (such as SPLENDA® Sugar Blend)",
        "1 tablespoon sugar and sucralose blend for baking (such as SPLENDA® Sugar Blend)",
        "1/2 cup liquid egg substitute",
        "3 tablespoons unsweetened cocoa powder",
        "1 fluid ounce red food coloring",
        "1 cup reduced-fat buttermilk",
        "1 1/4 teaspoons vanilla extract",
        "1 tablespoon white vinegar",
        "1 teaspoon baking soda",
        "3/4 cup fat-free vanilla yogurt",
        "3/4 cup fat-free cottage cheese",
        "2 (8 ounce) packages fat-free cream cheese at room temperature, cubed",
        "1 cup confectioners' sugar",
        "1 teaspoon vanilla extract",
        "1 teaspoon skim milk, or as needed (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Reduced Fat and Cholesterol Red Velvet Cake",
    "url": "http://allrecipes.com/recipe/218308/reduced-fat-and-cholesterol-red-velve/"
}