{
    "directions": [
        "In a bowl, whisk together the cornstarch with 1 tablespoon of water until thoroughly combined. Stir in the rhubarb, strawberries, white sugar, lemon juice, cinnamon, and vanilla extract. Allow the mixture to stand for 30 minutes.",
        "Preheat oven to 425 degrees F (220 degrees C). Place bottom crust into a 9-inch pie dish. Roll the remaining crust out into a 10-inch circle on a floured work surface, and set aside.",
        "Stir the filling, and pour into the prepared pie dish. Cut the remaining crust into 1-inch wide strips (use a scalloped edge pastry cutter for a prettier crust). Moisten the rim of the filled bottom crust with a bit of water, and lay the two longest strips in a cross in the middle of the pie. Working from the next longest down to the shortest strips, alternate horizontal and vertical strips, weaving the strips as you go. Press the lattice strips down onto the bottom crust edge to seal, and trim the top crust strips neatly. Beat the egg white with 1 teaspoon of water in a small bowl, and brush the entire lattice top with the beaten egg white. Sprinkle with turbinado sugar. Wrap aluminum foil strips around the edges of the pie.",
        "Bake in the preheated oven for 15 minutes; reduce heat to 375 degrees F (190 degrees C), and bake until the crust is browned and the filling is bubbling, 40 to 45 more minutes. Remove the aluminum foil for the last 10 minutes of baking time. Allow pie to cool completely before serving."
    ],
    "ingredients": [
        "2 tablespoons cornstarch",
        "1 tablespoon water",
        "2 1/2 cups diced rhubarb",
        "2 1/2 cups sliced fresh strawberries",
        "1 1/4 cups white sugar",
        "1/2 teaspoon lemon juice",
        "3/4 teaspoon ground cinnamon",
        "1 teaspoon vanilla extract",
        "1 recipe pastry for a 9 inch double crust pie",
        "1 egg white",
        "1 teaspoon water",
        "1 tablespoon turbinado sugar (such as Sugar in the Raw®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Renee's Strawberry Rhubarb Pie",
    "url": "http://allrecipes.com/recipe/216991/renees-strawberry-rhubarb-pie/"
}
