{
    "directions": [
        "Peel and segment 2 grapefruits; set aside. Squeeze the juice from the other half grapefruit into a measuring cup; it should yield about 1/4 cup of juice.",
        "To make the salad dressing, combine the grapefruit juice, vinegar, oil, garlic, salt, freshly ground black pepper to taste, and minced jalapeño in a medium bowl; mix well. Cover and refrigerate the salad dressing.",
        "Place the tuna steaks in a shallow dish. Pour 1 tablespoon of dressing over each piece of tuna. Turn the tuna in the marinade to coat. Cover with plastic wrap, or place all of the tuna steaks and marinade in a plastic bag, and refrigerate for 1 hour.",
        "Light the grill. Remove the tuna from the refrigerator and allow to come to room temperature. Grill for about 4 minutes per inch of thickness for rare, 6 minutes for medium or until done to taste, turning at least once.",
        "To serve, toss the greens with the salad dressing in a mixing bowl. Divide the dressed greens among 4 plates. Top each with a grilled tuna steak, then sprinkle with freshly ground black pepper. Spread grapefruit supremes over the top of the salad. Garnish with the cilantro and red onion slices."
    ],
    "ingredients": [
        "2 1/2 Texas red grapefruits",
        "1 tablespoon white wine vinegar",
        "3/4 cup olive oil",
        "1 clove garlic, minced",
        "1/4 teaspoon salt",
        "Freshly ground black pepper",
        "1 teaspoon minced jalapeño pepper, or hot pepper sauce",
        "4 tuna steaks, 6 to 8 ounces each",
        "6 cups mixed salad greens",
        "2 tablespoons chopped fresh cilantro leaves",
        "8 red onion slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Citrus",
        "Fish",
        "Leafy Green",
        "Marinate",
        "Low Fat",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Grapefruit",
        "Seafood",
        "Tuna",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Jalapeño",
        "Cilantro",
        "Lettuce",
        "Advance Prep Required",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Republic of the Rio Grande Grilled Tuna and Grapefruit Supreme Salad",
    "url": "http://www.epicurious.com/recipes/food/views/republic-of-the-rio-grande-grilled-tuna-and-grapefruit-supreme-salad-363418"
}
