{
    "directions": [
        "Combine water, teriyaki sauce, lime juice, garlic, liquid smoke, salt, ginger, and tequila in a medium nonporous glass bowl and mix all together. Add chicken and turn to coat; cover bowl and refrigerate for 2 to 3 hours.",
        "Meanwhile, make the Mexi-Ranch Dressing: mix mayonnaise, sour cream, milk, tomato, peppers, onion, parsley, hot pepper sauce, salt, dill weed, paprika, cayenne pepper, cumin, chili powder, and ground black pepper in a medium bowl and mix well until smooth. Cover bowl and chill until needed.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler, or preheat an outdoor grill for medium-high heat and lightly oil the grate.",
        "Remove chicken from marinade, discarding any remaining marinade. Grill or broil chicken for 3 to 5 minutes per side, or until chicken is cooked through and juices run clear.",
        "Arrange cooked chicken in a 9x13-inch baking dish. Spread a layer of Mexi-Ranch dressing over each piece of chicken, followed by 1/4 cup of cheese blend. Broil in preheated oven for 2 to 3 minutes, or just until cheese has melted.",
        "Spread a bed of about 1/2 cup crumbled corn chips or tortilla strips on each of 4 plates. Slide a chicken breast onto the chips on each plate and serve."
    ],
    "ingredients": [
        "Chicken Marinade:",
        "1 cup water",
        "1/3 cup teriyaki sauce",
        "2 tablespoons lime juice",
        "2 teaspoons minced garlic",
        "1 teaspoon liquid smoke flavoring",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon tequila",
        "4 skinless, boneless chicken breast halves",
        "Mexi-Ranch Dressing:",
        "1/4 cup mayonnaise",
        "1/4 cup sour cream",
        "1 tablespoon milk",
        "2 teaspoons minced tomato",
        "1 1/2 teaspoons chopped green chile peppers",
        "1 teaspoon minced onion",
        "1/4 teaspoon dried parsley",
        "1/4 teaspoon hot pepper sauce",
        "1 pinch salt",
        "1 pinch dried dill weed",
        "1 pinch paprika",
        "1 pinch cayenne pepper",
        "1 pinch ground cumin",
        "1 pinch chili powder",
        "1 pinch ground black pepper",
        "1 cup shredded Cheddar/Monterey Jack cheese blend",
        "2 cups crumbled corn chips"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Restaurant-Style Tequila Lime Chicken",
    "url": "http://allrecipes.com/recipe/19127/restaurant-style-tequila-lime-chicken/"
}
