{
    "directions": [
        "1. Soak the rye berries in a big bowl of cool water for at least 8 and up to 16 hours. Drain the rye berries in a fine-mesh sieve or small-holed colander set in the sink. Pour the rye berries into a large saucepan, cover with water by several inches, and bring to a boil over high heat. Reduce the heat to low and simmer until tender, about 1 hour 15 minutes. Drain again in that sieve or colander, then run under cool water to stop the cooking. Drain thoroughly.",
        "2. Slice the cabbage head in half. Cut out the thick, pyramidal core at the base of each half. Set the halves cut side down on the cutting board; make thin slices parallel to the core's former point up in the heart of the cabbage. Separate the shreds from each other and toss them in a large bowl with the salt. Set aside at room temperature for 30 minutes.",
        "3. Rinse the cabbage to get rid of the excess salt, then squeeze it by handfuls to remove any excess water. Dump these handfuls into a large serving bowl as you go. Pour in the cooked rye berries, diced pastrami, and cheese. Toss well.",
        "4. Whisk the mayonnaise, pickle relish, and ketchup in a small bowl; whisk in the vinegar. Pour this dressing onto the salad and toss it up."
    ],
    "ingredients": [
        "1 cup rye berries",
        "1 large head green cabbage (about 2 pounds)",
        "2 tablespoons salt",
        "1/2 pound thick-cut deli pastrami, cut into 1/4-inch dice",
        "1/2 pound thick-cut Swiss cheese, diced to match the pastrami",
        "6 tablespoons mayonnaise (regular, low-fat, light, or fat-free)",
        "2 tablespoons pickle relish",
        "1 tablespoon ketchup",
        "3 tablespoons cider vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Cheese",
        "Leafy Green",
        "Vegetable",
        "Side",
        "Picnic",
        "Lunch",
        "Meat",
        "Swiss Cheese",
        "Cabbage",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Reuben Salad",
    "url": "http://www.epicurious.com/recipes/food/views/reuben-salad-51118600"
}
