{
    "directions": [
        "Working in 2 batches, scatter rosemary over a paper towel–lined plate. Top with another sheet of paper towel and microwave on high 1 minute. Check rosemary and continue to microwave in 20-second intervals, until dry and crisp. Grind rosemary in spice mill or with mortar and pestle to a powder. Transfer to a small bowl and mix in fennel pollen.",
        "Place roast, fat side down, on a cutting board with a long side facing you. Using a sharp slicing knife and long strokes, cut roast into two 3-bone roasts. French rib bones 1 1/2\" from tip of bones, if desired. Score fat cap in a crosshatch pattern, spacing cuts 1\" apart. Rub roasts all over with garlic, then coat with rosemary mixture. Season generously with salt and pepper. Place, fat cap up, on a rack, set inside a roasting pan. Chill, uncovered, at least 8 hours and up to 1 day.",
        "Let roasts sit at room temperature 2 hours for even roasting.",
        "Place a rack in lower third of oven; preheat to 225°F. Roast meat, rotating pan once, until an instant-read thermometer inserted into the thickest part of roasts registers 125°F for medium-rare, or 130°F for medium, 3 ½–4 hours. Remove from oven, tent with foil, and let rest 30 minutes.",
        "Meanwhile, cook bacon in a small saucepan over medium heat, stirring occasionally, until brown and crisp, 8–10 minutes. Using a slotted spoon, transfer bacon to a small bowl; reserve for another use (it’s the fat you’re after). Add butter pieces to drippings in pan and cook, stirring often, until mixture foams, then browns, 5–8 minutes. Strain into a medium nonreactive bowl. Immediately stir in shallot; let cool (butter will have set up but will still be soft). Using an electric mixer on medium-high, add room-temperature butter to bacon fat mixture and beat until light and fluffy. Mix in chives and vinegar; season bacon butter with salt. Chill, stirring occasionally, at least 20 minutes (butter should be a little more firm but still light and fluffy).",
        "Move rack to upper third of oven; increase oven temperature to 500°F. Roast meat until deep brown and exterior is crisp, 8–10 minutes. Serve rib-eye roast with bacon butter.",
        "Bacon butter mixture (without chives and vinegar) can be made 3 days ahead. Cover and keep chilled. Let soften slightly before adding chives and vinegar."
    ],
    "ingredients": [
        "3/4 cup rosemary leaves",
        "3 tablespoons fennel pollen, or 2 fennel seeds, finely ground",
        "1 (6-bone) standing beef rib-eye roast (10–13 pounds), preferably dry-aged, chine bone removed, fat trimmed to 1/4-inch thick",
        "6 garlic cloves, finely grated",
        "Kosher salt, freshly ground pepper",
        "4 ounces bacon, coarsely chopped",
        "1 1/2 cups (3 sticks) unsalted butter, 1 cup cut into pieces, 1/2 cup room temperature",
        "1 large shallot, finely chopped",
        "1/4 cup finely chopped chives",
        "1 tablespoon apple cider vinegar",
        "A spice mill or mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Beef Rib",
        "Roast",
        "Rosemary",
        "Bacon",
        "Butter",
        "Shallot",
        "Christmas",
        "Christmas Eve",
        "Dinner",
        "Entertaining",
        "Wheat/Gluten-Free",
        "Winter"
    ],
    "title": "Reverse Sear Rib-Eye Roast With Fennel and Rosemary",
    "url": "http://www.epicurious.com/recipes/food/views/reverse-sear-rib-eye-roast-with-fennel-and-rosemary"
}
