{
    "directions": [
        "Preheat an oven to 350°F. Lightly butter a shallow 2-quart baking dish.",
        "In a bowl, stir together the flour and brown sugar. Scatter 4 Tbs. of the butter over the top and, using your fingers, 2 knives or a pastry blender, work in the butter until the mixture is crumbly. Add the almonds, crystallized ginger and salt and stir to combine. Set the topping mixture aside.",
        "In a large bowl, combine the rhubarb, fresh ginger and granulated sugar and stir to mix well. Transfer the rhubarb mixture to the prepared baking dish and spread in an even layer. Dot with the remaining 2 Tbs. butter. Sprinkle the topping mixture evenly over the fruit.",
        "Bake until the topping is deep gold and the juices are bubbling, about 1 hour. Serve warm or at room temperature with vanilla ice cream. Serves 6 to 8.",
        "Fresh take:",
        "There are no rules when it comes to crumbles, so feel free to vary the flavors and fruit combinations with the seasons. In summer, try nectarines and blueberries or a plum-almond mixture; in fall, combine apples and cherries.",
        "Dress it up:",
        "Vanilla ice cream is pretty much a required topping for any crumble or cobbler. Churn up a homemade batch or purchase a top-quality brand at the market.",
        "Make ahead:",
        "The crumble topping can be made up to 2 days ahead and stored, tightly covered, in the refrigerator.",
        "Adapted from Williams-Sonoma",
        "Good Food to Share",
        ", by Sara Kate Gillingham-Ryan (Weldon Owen, Inc., 2010)."
    ],
    "ingredients": [
        "6 Tbs. (3/4 stick) unsalted butter, cut into 1/4-inch cubes, plus more for greasing",
        "1 cup unbleached all-purpose flour",
        "3/4 cup firmly packed light brown sugar",
        "3/4 cup chopped almonds",
        "1/3 cup finely chopped crystallized ginger",
        "1/4 tsp. sea salt",
        "2 lb. rhubarb, trimmed and cut into 3/4-inch pieces (about 6 cups)",
        "1 Tbs. peeled and minced fresh ginger",
        "3/4 cup granulated sugar",
        "Vanilla ice cream for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Rhubarb-Ginger Crumble",
    "url": "http://www.williams-sonoma.com/recipe/rhubarb-ginger-crumble.html"
}
