{
    "directions": [
        "In a heavy saucepan cook rhubarb with sugar over moderate heat, stirring often, 20 to 25 minutes, or until rhubarb is a thick purée (about 1 1/2 cups). In a small bowl sprinkle gelatin over water and let soften 1 minute. Add gelatin to rhubarb and stir over low heat 1 minute, or until gelatin is dissolved. Transfer filling to a metal bowl set in a bowl of ice and cold water and stir occasionally until cooled and thickened.",
        "Preheat oven to 350°F. Line the bottom of a greased jelly-roll pan, 15 1/2 by 10 1/2 by 1 inch, with foil. Grease foil and dust with flour, knocking out excess.",
        "In a bowl with an electric mixer beat egg yolks, 1/4 cup of the granulated sugar, zest, and vanilla until thick and pale and mixture forms a ribbon when beaters are lifted.",
        "In a large bowl with cleaned beaters beat egg whites with salt until they hold soft peaks. Beat in the remaining 1/4 cup granulated sugar gradually and beat whites until they hold stiff peaks.",
        "Stir one third of whites into yolk mixture to lighten it and fold in remaining whites gently but thoroughly. Sift flour and cornstarch over batter and fold in until batter is just combined.",
        "Spread batter evenly in prepared pan and bake in middle of oven 6 to 9 minutes, or until cake is lightly colored and springs back when pressed lightly.",
        "Dust a kitchen towel generously with confectioners' sugar and invert cake onto it. Remove foil carefully from cake. Starting with a long side, roll up cake loosely and gently in the towel and cool 30 minutes.",
        "In a very small saucepan bring all ingredients to simmer, stirring until sugar is dissolved. Keep syrup warm.",
        "Unroll cake carefully and brush with half of the warm syrup. Spread cake with filling and reroll cake carefully. Transfer cake to a platter, seam side down, and brush with remaining syrup. Chill roll, covered loosely, at least 2 hours or overnight.",
        "In a small bowl stir together sugar and lemon juice to make a pourable glaze.",
        "Transfer glaze to a small resealable plastic bag and snip one corner to make a small hole. Trim ends of cake diagonally and squeeze glaze decoratively over cake.",
        "Serve cake, sliced crosswise, with White Chocolate Toasted Almond Semifreddo."
    ],
    "ingredients": [
        "1 pound rhubarb, chopped (about 4 cups)",
        "1/2 cup granulated sugar",
        "1 teaspoon unflavored gelatin",
        "1 tablespoon cold water",
        "4 large eggs, separated",
        "1/2 cup granulated sugar",
        "2 teaspoons freshly grated lemon zest",
        "1 teaspoon vanilla",
        "1/4 teaspoon salt",
        "1/4 cup all-purpose flour",
        "1/4 cup cornstarch",
        "confectioners' sugar",
        "2 tablespoons granulated sugar",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon water",
        "1/2 cup confectioners' sugar",
        "1 tablespoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Egg",
        "Dessert",
        "Bake",
        "Easter",
        "Lemon",
        "Spring",
        "Rhubarb",
        "Gourmet"
    ],
    "title": "Rhubarb Lemon Cake Roll",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-lemon-cake-roll-11683"
}
