{
    "directions": [
        "Combine rhubarb, sugar, and 1 tablespoon water in medium saucepan. Stir over medium heat until sugar dissolves. Cover; cook until rhubarb softens to thick pulp, stirring often, about 8 minutes. Mix in jam; cool. do ahead Can be made 1 week ahead. Cover; chill.",
        "Sift flour, sugar, baking powder, and salt into large bowl. Using large holes on box grater, grate frozen butter into bowl; stir to blend. Cover and freeze at least 15 minutes. DO AHEAD: Can be made 1 day ahead. Keep frozen.",
        "Preheat oven to 400°F. Line large rimmed baking sheet with parchment paper. Add 2/3 cup ice water to flour mixture, tossing until soft dough forms, adding more ice water by tablespoonfuls if dough is stiff. Transfer to lightly floured surface; knead gently 5 or 6 turns (butter should remain in firm pieces). Roll out dough to 12x9-inch rectangle. Spread 6 tablespoons filling over dough, leaving 1-inch plain border on all sides. Starting at 1 long side, roll up jelly-roll style; seal seam. Place seam side down on prepared sheet. Seal ends. Brush glaze over pastry.",
        "Bake pastry until golden (jam may leak out), about 30 minutes. Cool pastry briefly.",
        "Cut roly-poly crosswise into 6 to 8 rounds. Serve warm with Vanilla Custard Sauce and remaining filling."
    ],
    "ingredients": [
        "1/2 pound fresh rhubarb, cut crosswise into 1/2-inch-thick slices (about 2 cups)",
        "1/2 cup sugar",
        "1 tablespoon water",
        "1/2 cup raspberry jam",
        "2 cups all purpose flour",
        "2 tablespoons sugar",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "10 tablespoons (1 1/4 sticks) frozen unsalted butter",
        "2/3 cup (or more) ice water",
        "1 tablespoon whipping cream beaten with 1 tablespoon sugar (for glaze)",
        "Vanilla Custard Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit",
        "Dessert",
        "Bake",
        "Raspberry",
        "Spring",
        "Rhubarb",
        "Jam or Jelly",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rhubarb and Raspberry Jam Roly-Poly with Vanilla Custard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-and-raspberry-jam-roly-poly-with-vanilla-custard-sauce-241648"
}
