{
    "directions": [
        "Preheat oven to 350°F. Butter a 15- by 10- by 1-inch shallow baking pan and line with wax paper. Butter paper and dust with flour, knocking out excess.",
        "Beat together yolks, vanilla, and 5 tablespoons granulated sugar in a large bowl with an electric mixer at high speed until thick and pale, about 1 minute with a standing mixer or 3 minutes with a handheld.",
        "Beat whites with salt using cleaned beaters in another bowl until they just hold soft peaks. Add remaining 3 tablespoons granulated sugar, a little at a time, beating until whites just hold stiff peaks.",
        "Gently fold one third of flour and one third of whites into yolk mixture, then gently fold in remaining flour and whites in 2 more batches, making sure flour is thoroughly incorporated.",
        "Spread batter evenly in baking pan and bake in middle of oven until top is pale and dry to the touch, 10 to 12 minutes. Transfer cake in pan to a rack and cool, covered with a kitchen towel, 5 minutes.",
        "Cook rhubarb with sugar in a 12-inch nonstick skillet over moderately high heat (rhubarb will exude liquid), stirring, until rhubarb is a thick purée, about 8 minutes. Spread filling on a plate and chill 5 minutes.",
        "Remove towel and arrange cake with a short side nearest you. Spread rhubarb filling evenly over cake, leaving a 1-inch border on each short side. Put a platter next to far end of cake. Beginning with near short side and using wax paper as an aid, roll up cake jelly-roll style. Carefully transfer roll, seam side down, to platter, using wax paper as an aid.",
        "Dust cake generously with confectioners sugar, then slice with a serrated knife."
    ],
    "ingredients": [
        "4 large eggs, separated",
        "1 teaspoon vanilla",
        "1/2 cup granulated sugar",
        "1/8 teaspoon salt",
        "3/4 cup all-purpose flour",
        "Confectioners sugar for dusting",
        "1 lb rhubarb stalks, trimmed and finely chopped",
        "1/2 cup granulated sugar",
        "Accompaniment: lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit",
        "Dessert",
        "Bake",
        "Spring",
        "Rhubarb",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rhubarb Roulade",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-roulade-106548"
}
