{
    "directions": [
        "Preheat oven to 350°F and place rack in center.",
        "Butter 9-inch cake pan and line bottom with a round of parchment.",
        "Butter paper, then dust pan with flour, knocking out excess.",
        "Sift together flour, baking powder, and salt into a bowl.",
        "Beat butter and sugar together at medium-high speed until pale and fluffy, about 2 minutes.",
        "Beat in egg and vanilla until fluffy and combined well, about 2 minutes.",
        "Reduce speed to low and add flour mixture and milk alternately in 3 batches, beginning and ending with flour. Mix until batter is just combined. Do not overmix.",
        "Spread batter evenly in pan and bake until cake begins to pull away from sides of pan and a wooden pick or skewer inserted in center comes out clean, 20 to 25 minutes (cake will still be pale in color, not golden brown).",
        "Cool for 10 minutes in pan on a rack, then invert onto rack and reinvert to cool completely right side up.",
        "Combine rhubarb, 1 1/4 cups sugar, and 1/4 cup water in a large heavy saucepan and cook over medium-high heat, stirring occasionally, until rhubarb releases enough juice to almost cover rhubarb, 5 to 8 minutes.",
        "Reduce heat and simmer mixture, stirring occasionally, until rhubarb falls apart and is reduced to about 4 cups, 25 to 30 minutes. Remove from heat.",
        "Pour mixture into a large fine-mesh sieve set over a bowl and collect 1 cup syrup and set aside. Transfer rhubarb pulp to another bowl.",
        "Soften gelatin in remaining 1/4 cup water 1 minute, then stir into hot rhubarb mixture until dissolved.",
        "Set bowl inside a larger bowl of ice water and stir rhubarb mixture until cooled to room temperature (do not let set on ice).",
        "Beat together mascarpone, heavy cream, and vanilla with remaining 1/4 cup sugar until it just holds stiff peaks.",
        "Fold cooled rhubarb mixture into mascarpone mixture.",
        "Carefully halve cooled cake horizontally, then spread jam on bottom half and reassemble.",
        "Invert bottom of spring-form pan (to make it easier to slide cake off bottom), then lock on side. Lightly oil bottom and sides of pan with some vegetable oil.",
        "Arrange cake in center of spring-form pan. Spoon rhubarb mousse into pan over cake. Smooth top. Rap pan on counter twice to release any air bubbles and chill cake, uncovered, until mousse is set, at least 2 hours.",
        "Sprinkle gelatin over water in a small heavy saucepan to soften, 1 minute. Heat gelatin over low heat until it has dissolved. Remove from heat then stir in reserved rhubarb syrup.",
        "Pour glaze over chilled mousse, tilting pan slightly to cover it completely in an even layer. Chill, uncovered, until glaze is set, at least 1 hour.",
        "Let cake stand at room temperature 30 minutes to soften slightly. Wrap a kitchen towel dampened in hot water around the side of the pan for about 15 seconds. Run the tip of a thin knife around the edge of the pan, then gently unlock and remove sides of spring-form pan."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/2 stick (4 tablespoons) unsalted butter, softened",
        "1/2 cup sugar",
        "1 large egg, at room temperature 30 minutes",
        "1 teaspoon vanilla",
        "1/3 cup whole milk",
        "1/2 cup strawberry or strawberry-rhubarb jam",
        "2 pounds rhubarb, cut into 1-inch pieces (8 cups)",
        "1 1/2 cups sugar, divided",
        "1/2 cup water, divided",
        "3 teaspoons unflavored gelatin (less than 2 packages)",
        "1 cup (8 ounces) mascarpone",
        "3/4 cup chilled heavy cream",
        "1 teaspoon vanilla",
        "Vegetable oil for greasing pan",
        "1 1/2 teaspoons unflavored gelatin",
        "3 tablespoons water",
        "1 cup rhubarb syrup (see below)",
        "a few small strawberries, such as tri-star or wild strawberries with their leaves (optional)",
        "Special equipment: 1 (9-inch) round cake pan; 1 (10-inch) round spring-form pan with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Easter",
        "Spring",
        "Birthday",
        "Shower",
        "Chill",
        "Rhubarb",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Rhubarb-Mascarpone Mousse Cake",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-mascarpone-mousse-cake-395015"
}
