{
    "directions": [
        "Put 1/4 cup water in a small cup, then sprinkle gelatin on top and let gelatin soften while cooking rhubarb.",
        "Cook rhubarb, 1/2 cup sugar, and remaining 1/2 cup water in a heavy medium saucepan over moderate heat, stirring occasionally, until very soft, about 7 minutes. Add gelatin mixture, stirring until dissolved, then cool 10 minutes. Purée in a food processor until smooth, then add yogurt and blend until combined. Freeze in ice cream maker.",
        "Spread cookie crumbs evenly over bottom of an 8-inch springform pan. Spoon frozen yogurt gently over crumbs and carefully smooth top. Wrap pan in plastic wrap and freeze until yogurt is firm, at least 2 hours.",
        "Soak a kitchen towel in hot water and wring it dry. Wrap hot towel around pan, then release side of pan and let torte stand at room temperature 20 minutes. Meanwhile, hull and quarter strawberries, toss with remaining 2 tablespoons sugar, and let stand 15 minutes. Cut torte into 8 wedges and serve with strawberries spooned on top.",
        "*Available at Italian markets and specialty foods shops."
    ],
    "ingredients": [
        "3/4 cup water",
        "2 teaspoons unflavored gelatin (from a 1/4-ounce envelope)",
        "4 cups sliced fresh rhubarb stalks or thawed frozen rhubarb (1 lb)",
        "1/2 cup plus 2 tablespoons sugar",
        "3 cups vanilla low-fat yogurt",
        "12 amaretti* (crisp Italian macaroons), finely chopped (3/4 cup)",
        "1 pound strawberries",
        "Special equipment: an ice cream maker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Ice Cream Machine",
        "Dessert",
        "Yogurt",
        "Frozen Dessert",
        "Strawberry",
        "Spring",
        "Healthy",
        "Rhubarb",
        "Gourmet"
    ],
    "title": "Rhubarb Frozen Yogurt Torte",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-frozen-yogurt-torte-109353"
}
