{
    "directions": [
        "Bring sugar and water to boil in heavy medium saucepan, stirring until sugar dissolves. Cool syrup.",
        "Stir rhubarb, orange juice and 3/4 cup syrup in large saucepan over medium heat until rhubarb falls apart and mixture thickens slightly, about 15 minutes. Purée in processor. Press through strainer into large bowl, leaving any fibers behind. Mix pomegranate juice, liqueur, salt and 3/4 cup sugar into purée. (Reserve remaining syrup for another use.) Chill until cold.",
        "Process rhubarb mixture in ice cream maker according to manufacturer's instructions. Transfer sorbet to container; cover and freeze until firm, at least 4 hours. (Can be made 2 days ahead.)",
        "Cut peel and white pith from oranges. Working over medium bowl and using small sharp knife, cut between membranes to release segments.",
        "Mix 2/3 cup orange juice, sugar, ginger and cinnamon in small saucepan over medium heat. Simmer 3 minutes to blend flavors. Cover; cool 5 minutes. Strain syrup into medium bowl. Drain orange segments; add to syrup and cool completely.",
        "Spoon compote into shallow bowls or wine glasses. Top with sorbet."
    ],
    "ingredients": [
        "1 1/2 cups sugar",
        "1 1/2 cups water",
        "8 cups 1/2-inch-thick slices trimmed rhubarb (3 pounds untrimmed)",
        "1/2 cup orange juice",
        "1/2 cup pomegranate juice*",
        "2 1/2 tablespoons Grand Marnier or other orange liqueur",
        "1/8 teaspoon salt",
        "6 large navel oranges",
        "2/3 cup orange juice",
        "1/2 cup sugar",
        "1/2 cup thinly sliced peeled fresh ginger (about 2 1/2 ounces)",
        "1 cinnamon stick",
        "Available at Middle Eastern and natural food stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Food Processor",
        "Ice Cream Machine",
        "Fruit",
        "Ginger",
        "Dessert",
        "Frozen Dessert",
        "Orange",
        "Spring",
        "Vegan",
        "Rhubarb",
        "Pomegranate",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rhubarb Sorbet with Gingered Orange Compote",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-sorbet-with-gingered-orange-compote-5911"
}
