{
    "directions": [
        "Blend flour, sugar, and salt in processor 5 seconds. Using on/off turns, cut in butter until coarse meal forms. Add egg yolk and 3 tablespoons cream. Blend until moist clumps form, adding more cream if dough is dry. Gather dough into ball. Press enough dough into 10-inch-diameter tart pan with removable bottom to make 1/4-inch-thick crust. Pierce crust all over with fork. Chill at least 2 hours.",
        "Cook butter in large skillet over medium heat until golden, stirring often, about 5 minutes. Remove from heat. Mix in almonds, sugar, and cinnamon. Add flour and stir until moist clumps form. Cool completely. (Crust and streusel can be made 1 day ahead. Cover separately and chill.)",
        "Preheat oven to 375°F. Toss all ingredients in bowl to blend. Let stand until filling looks moist, stirring occasionally, about 15 minutes.",
        "Bake cold crust until golden brown, pressing with back of fork if crust bubbles, about 20 minutes. Remove from oven. Reduce oven temperature to 350°F.",
        "Spoon filling into warm crust. Crumble streusel over. Bake until filling is bubbling and streusel is crisp and brown, about 1 hour. Cool tart on rack 30 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "3 tablespoons sugar",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 large egg yolk",
        "3 to 4 tablespoons chilled cream",
        "9 tablespoons unsalted butter, cut into 1/2-inch cubes",
        "3/4 cup sliced almonds",
        "3/4 cup (packed) golden brown sugar",
        "1 teaspoon ground cinnamon",
        "3/4 cup all purpose flour",
        "5 cups 1/2-inch-thick slices rhubarb (from about 2 1/2 pounds)",
        "1 1/4 cups sugar",
        "1/2 cup all purpose flour",
        "1 teaspoon grated lemon peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Brunch",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Fall",
        "Family Reunion",
        "Shower",
        "Rhubarb",
        "Cinnamon",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rhubarb Tart with Brown Butter Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-tart-with-brown-butter-streusel-109094"
}
