{
    "directions": [
        "Let egg whites stand at room temperature 1 hour.",
        "Preheat oven to 250° F. Line 2 baking sheets with parchment paper and draw three 10- by 4 1/2-inch rectangles on parchment (2 on one sheet and 1 on other). Turn parchment over.",
        "In a large bowl with an electric mixer beat whites with cream of tartar and a pinch salt until they hold soft peaks. Gradually add sugar, beating, and beat until meringue holds stiff, glossy peaks.",
        "Transfer meringue to a pastry bag fitted with a 1/2-inch fluted tip and pipe evenly onto parchment rectangles, filling them in. (Alternatively, divide meringue among parchment rectangles, spreading with a spatula to fill them in.)",
        "Bake meringue layers in upper and lower thirds of oven, switching positions halfway through baking, 1 hour, or until crisp and firm. (If weather is humid, cooking time may be longer.) Cool meringue layers completely on baking sheet in turned-off oven or on a rack and carefully peel off parchment. Meringue layers may be made 1 day ahead, wrapped well in plastic wrap or sealed in an airtight container, and stored in a cool, dry place.",
        "In a heavy saucepan stir together purée ingredients and simmer, stirring occasionally, until rhubarb is softened, about 12 minutes. Cool mixture slightly and in a blender or food processor purée until smooth (use caution when blending hot mixtures). Transfer purée to a bowl and cool. Purée may be made 2 days ahead and chilled, covered. Bring purée to room temperature before proceeding.",
        "Lightly whip heavy cream.",
        "On a large platter arrange 1 meringue layer and spread evenly with 1/2 cup rhubarb purée. Spread half of whipped cream evenly over purée and top with 3/4 cup raspberries. Repeat procedure with another meringue layer, 1/2 cup purée, remaining whipped cream, and 3/4 cup raspberries. Top with remaining meringue layer.",
        "Garnish cake with remaining cup raspberries and serve with rhubarb raspberry sauce."
    ],
    "ingredients": [
        "4 large egg whites",
        "1/4 teaspoon cream of tartar",
        "1 cup sugar",
        "1 pound fresh rhubarb, trimmed and cut into 1/2-inch pieces (3 cups total)",
        "1/2 cup sugar",
        "1 tablespoon water",
        "2 teaspoons cornstarch",
        "1 cup well-chilled heavy cream",
        "2 1/2 cups picked-over fresh raspberries",
        "Accompaniment:Rhubarb Raspberry Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Blender",
        "Food Processor",
        "Mixer",
        "Berry",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Raspberry",
        "Spring",
        "Rhubarb",
        "Engagement Party",
        "Simmer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rhubarb Raspberry Meringue Cake",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-raspberry-meringue-cake-13704"
}
