{
    "directions": [
        "Whisk preserves and 1/2 cup water in heavy large skillet over medium heat until preserves dissolve. Sprinkle ginger and orange peel over. Scatter rhubarb evenly in skillet. Bring mixture to simmer over medium heat, occasionally stirring very gently, until rhubarb is slightly tender but still intact, about 10 minutes. Pour mixture into large sieve set over large saucepan. Let drain 15 minutes. DO AHEAD: Can be made 1 day ahead. Cover fruit and syrup separately and chill.",
        "Preheat oven to 350°F. Whisk sugar and eggs in medium bowl. Place milk and cream in heavy medium saucepan. Scrape in seeds from vanilla bean. Bring to simmer over medium heat. Gradually add hot cream mixture to egg mixture, whisking custard to blend.",
        "Butter 13 x 9 x 2-inch oval baking dish. Arrange enough bread slices in dish to cover bottom (some spaces will remain between slices). Spoon half of rhubarb evenly over. Repeat with bread and rhubarb. Pour custard over. Place baking dish in roasting pan. Add enough hot water to pan to come halfway up sides of dish.",
        "Bake pudding until just set in center, about 50 minutes. Remove from oven. Let stand in water bath 30 minutes; remove.",
        "Boil reserved syrup until reduced to 1 cup, about 10 minutes. Keep warm.",
        "Brush top of pudding with some rhubarb syrup. Spoon warm pudding into bowls; top with syrup and whipped cream."
    ],
    "ingredients": [
        "1 cup seedless raspberry preserves",
        "1/2 cup water",
        "1/3 cup chopped crystallized ginger",
        "1 tablespoon finely grated orange peel",
        "2 1/2 pounds rhubarb (preferably bright red), ends trimmed, stalks cut into 1/2-inch-wide pieces (8 to 9 cups)",
        "3/4 cup sugar",
        "3 large eggs",
        "1 cup whole milk",
        "1 cup heavy whipping cream",
        "1 vanilla bean, split lengthwise",
        "Butter (for dish)",
        "8 (or more) 1/2-inch-thick slices brioche or egg bread (each about 5 x 4 inches), cut lengthwise in half",
        "Lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Mother's Day",
        "Spring",
        "Rhubarb",
        "Advance Prep Required",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rhubarb and Ginger Brioche Bread Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-and-ginger-brioche-bread-pudding-358597"
}
