{
    "directions": [
        "Divide dough into 2 pieces (1 piece should be slightly smaller than the other). Chill larger dough piece, wrapped in plastic wrap. On a lightly floured surface with a lightly floured rolling pin roll out smaller piece of dough into a 10-inch round (about 1/8 inch thick).",
        "Transfer round to a large baking sheet and chill, covered. Roll out remaining dough into an 11-inch round (about 1/8 inch thick) and stack it on top of first round. Chill pastry rounds, loosely covered with plastic wrap, at least 1 hour, or until firm. Cut enough rhubarb crosswise into 1/2-inch slices to measure 4 cups. In a 3-quart kettle stir together 3 cups rhubarb, 1 cup sugar, and cinnamon and cook over moderate heat, stirring constantly, until sugar is melted, about 6 minutes. In a small bowl stir together cornstarch and lemon juice. Add cornstarch mixture to rhubarb mixture and boil, stirring constantly, until rhubarb is thickened, about 5 minutes, and transfer mixture to a bowl. Cool mixture to room temperature, about 30 minutes.",
        "Fold raspberries and remaining cup rhubarb into mixture until just combined. Chill rhubarb filling, covered, at least 30 minutes, or until cold.",
        "Preheat oven to 425°F.",
        "In a small bowl whisk together egg and milk to make an egg wash. Fit 11-inch round of dough into a 9-inch (1-quart) glass pie plate and trim with scissors, leaving a 1/2-inch overhang. Spoon rhubarb filling into shell, smoothing top, and brush edge of crust with egg wash. Drape remaining pastry round over filling and trim, leaving a 1/2-inch overhang. Crimp edge decoratively. With a sharp small knife score a decorative pattern on crust and brush crust evenly with some egg wash. Sprinkle crust with remaining 2 tablespoons sugar.",
        "Bake pie on a baking sheet in middle of oven 35 minutes, or until crust is golden brown and cooked through. (If pastry gets too brown too quickly, tent pie with foil.) Transfer pie to a rack. Cool pie at least 1 hour to set filling.",
        "Serve pie with ice cream."
    ],
    "ingredients": [
        "frozen-butter pastry dough",
        "1 1/2 pounds trimmed rhubarb",
        "1 cup plus 2 tablespoons sugar",
        "1/2 teaspoon cinnamon",
        "3 tablespoons cornstarch",
        "3 tablespoons fresh lemon juice",
        "1 1/2 cups raspberries",
        "1 large egg",
        "1 tablespoon milk",
        "Accompaniment: vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Raspberry",
        "Spring",
        "Rhubarb",
        "Gourmet"
    ],
    "title": "Rhubarb Raspberry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-raspberry-pie-101507"
}
