{
    "directions": [
        "Preheat oven to 400°F with rack in middle.",
        "Stir together orange juice, lime juice, and sugar in a bowl. Add rhubarb and let stand, stirring occasionally, 10 minutes.",
        "Meanwhile, cut pastry in half lengthwise, then roll out each piece into an 11-by 7-inch rectangle on a lightly floured surface with a floured rolling pin. Arrange pastry rectangles side by side on an ungreased large baking sheet.",
        "Make a 1/2-inch border around each pastry rectangle by lightly scoring a line parallel to each edge (do not cut all the way through). Prick pastry inside border all over with a fork.",
        "Strain rhubarb mixture through a sieve set over a bowl, reserving liquid. Top 1 pastry rectangle (within border) with half of rhubarb, overlapping slices slightly. Repeat with remaining pastry and rhubarb.",
        "Bake until pastry is puffed and golden (underside of pastry should also be golden), about 30 minutes.",
        "Meanwhile, boil reserved rhubarb liquid in a small saucepan, skimming foam if necessary, until reduced to about 1/4 cup, 15 to 18 minutes.",
        "Transfer tarts to a rack. Brush rhubarb and pastry with glaze and sprinkle with zest."
    ],
    "ingredients": [
        "1 cup fresh orange juice",
        "1 tablespoon fresh lime juice",
        "1/2 cup sugar",
        "3/4 pound rhubarb stalks, thinly sliced diagonally (1/8 inch)",
        "1 sheet frozen puff pastry (from a 17 1/4-ounces package), thawed",
        "1/2 teaspoon grated orange zest",
        "Accompaniment: vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Easter",
        "Quick & Easy",
        "Orange",
        "Spring",
        "Rhubarb",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rhubarb Tart with Orange Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-tart-with-orange-glaze-352290"
}
