{
    "directions": [
        "Blend flour, sugar, and salt in processor 5 seconds. Add butter. Using on/off turns, blend until coarse meal forms. Add 6 tablespoons ice water. Using on/off turns, blend until moist clumps form, adding more ice water by 1/2 tablespoonfuls if dough is dry. Gather dough into ball. Divide into 2 pieces, 1 slightly larger than the other. Flatten into disks. Wrap and chill at least 1 hour and up to 1 day.",
        "Combine rhubarb, 2/3 cup sugar, orange juice, orange peel, and cardamom in large deep skillet. Toss over medium-high heat until liquid starts to bubble. Reduce heat to medium. Cover and simmer until rhubarb is almost tender, stirring very gently occasionally to keep rhubarb intact, about 8 minutes. Using slotted spoon, transfer rhubarb to colander set over bowl. Drain well. Add syrup from bowl to skillet. Boil until juices in skillet are thick and reduced to 2/3 cup, adding any additional drained syrup from bowl, about 7 minutes. Mix in preserves. Cool mixture in skillet 15 minutes. Very gently fold in rhubarb (do not overmix or rhubarb will fall apart).",
        "Preheat oven to 375°F. Roll out larger dough disk on lightly floured surface to 12-inch round. Transfer to 9-inch glass pie dish. Roll out smaller dough disk to 11-inch round; cut into 1/2-inch-wide strips. Spoon filling into pie dish. Arrange 6 dough strips atop filling, spacing evenly apart. Arrange 5 dough strips atop filling in opposite direction, forming lattice. Seal strip ends to crust edge. Stir cream and 2 teaspoons sugar in small bowl to blend. Brush over lattice, but not crust edge.",
        "Bake pie until filling bubbles thickly and crust is golden, covering edge with foil if browning too quickly, about 55 minutes. Cool pie completely. Cut into wedges; serve with ice cream.",
        "Test-kitchen tip:"
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "2 tablespoons sugar",
        "3/4 teaspoon salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into 1/2-inch cubes, frozen 15 minutes",
        "7 tablespoons (about) ice water",
        "10 cups 1-inch pieces rhubarb (about 2 1/2 pounds)",
        "2/3 cup plus 2 teaspoons sugar",
        "1/4 cup orange juice",
        "2 1/2 teaspoons grated orange peel",
        "1/2 teaspoon ground cardamom",
        "1/4 cup strawberry preserves",
        "1 tablespoon whipping cream",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Orange",
        "Spring",
        "Rhubarb",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rhubarb Lattice Pie with Cardamom and Orange",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-lattice-pie-with-cardamom-and-orange-231903"
}
