{
    "directions": [
        "Combine rhubarb and 2 1/2 cups brown sugar in large pot. Cook over low heat until syrup forms and rhubarb is tender but not falling apart, stirring occasionally, about 35 minutes. Pour rhubarb mixture into sieve set over large bowl. Cover sieve and chill rhubarb and juices overnight.",
        "Preheat oven to 400°F. Roll out 1 pastry sheet on floured surface to 12-inch square. Cut into four 6-inch squares. Using small plate as guide, cut 6-inch round from each. Place rounds on ungreased baking sheet; pierce with fork. Bake 5 minutes; flatten with spatula. Bake until golden, about 10 minutes longer. Repeat with second pastry sheet to make 8 crusts. Maintain oven temperature.",
        "Blend ricotta and powdered sugar in bowl. Brush each crust with egg glaze. Leaving 1/2-inch plain border, spread 1/8 of cheese mixture (about 1/4 cup) on each crust. Bake tartlets until topping is set, about 10 minutes. (Can be made 1 hour ahead. Let stand at room temperature.)",
        "Preheat broiler. Pour rhubarb juices into small saucepan. Boil until reduced to thick syrup, stirring occasionally, about 8 minutes. Spread rhubarb 3/4 inch thick on rimmed baking sheet. Sprinkle with 3 tablespoons brown sugar. Broil until top is crisp and dark brown in spots, about 4 minutes.",
        "Spoon rhubarb over tartlets. Drizzle with rhubarb syrup and serve."
    ],
    "ingredients": [
        "2 pounds rhubarb, sliced 1/2 inch thick",
        "2 1/2 cups plus 3 tablespoons (packed) golden brown sugar",
        "1 17.3-ounce package frozen puff pastry (2 sheets), thawed",
        "2 cups whole-milk ricotta cheese",
        "2/3 cup powdered sugar",
        "1 egg, beaten to blend (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Ricotta",
        "Spring",
        "Rhubarb",
        "Phyllo/Puff Pastry Dough"
    ],
    "title": "Rhubarb and Ricotta Cheese Puff-Pastry Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-and-ricotta-cheese-puff-pastry-tartlets-105090"
}
