{
    "directions": [
        "Combine both flours, sugar, and salt in a processor; blend for 5 seconds. Add butter; pulse until butter is reduced to pea-size pieces. Whisk egg and milk in a small bowl to blend; add to processor and pulse until moist clumps form. Gather dough into a ball; flatten into a disk. Wrap in plastic wrap; chill at least 1 1/2 hours. DO AHEAD: Can be made 2 days ahead. Keep chilled.",
        "Dissolve cornstarch in 3 tablespoons water in a small bowl; set aside. Combine rhubarb, raspberries, and sugar in a large heavy saucepan. Cook over medium heat, stirring often, until sugar dissolves and juices are released, about 4 minutes. Stir in cornstarch mixture and bring to a boil (rhubarb will not be tender and slices will still be intact). Transfer to a bowl. Chill until cool, about 30 minutes.",
        "Preheat oven to 400°F Roll out dough on floured parchment paper to 12\" round; brush with beaten egg. Mound filling in center of crust; gently spread out, leaving 1 1/2\" border. Gently fold edges of dough over filling, pleating as needed. Brush border with egg; sprinkle with raw sugar. Slide parchment with crostata onto a large rimmed baking sheet and bake until crust is golden brown and filling is bubbly, about 45 minutes. Let crostata cool on baking sheet on a rack. Transfer crostata to a platter, cut into wedges, and serve with whipped cream or ice cream."
    ],
    "ingredients": [
        "1 cup unbleached all-purpose flour",
        "1/2 cup whole wheat flour",
        "1 1/2 tablespoons sugar",
        "1/2 teaspoon kosher salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cubed",
        "1 large egg",
        "1 tablespoon whole milk",
        "1/4 cup cornstarch",
        "4 cups 1/2\"-thick slices rhubarb",
        "1 6 ounce container fresh raspberries",
        "1/3 cup sugar",
        "1 large egg, beaten",
        "Raw sugar",
        "Sweetened whipped cream or vanilla ice cream (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Brunch",
        "Dessert",
        "Easter",
        "Valentine's Day",
        "High Fiber",
        "Mother's Day",
        "Backyard BBQ",
        "Raspberry",
        "Spring",
        "Shower",
        "Rhubarb",
        "Party",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rhubarb and Raspberry Crostata",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-and-raspberry-crostata-365159"
}
