{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Grease an 8x8 inch square baking dish.",
        "In a medium bowl, cream together the butter and 1/4 cup sugar until smooth. Beat in the egg and vanilla. Combine the flour, baking powder and salt; stir into the butter mixture until a stiff dough forms. Press the dough into the bottom and 1/2 inch up the sides of the prepared pan.",
        "Bake crust for 15 minutes, or until firm.",
        "In a saucepan over medium heat, combine the rhubarb, 1/2 cup sugar, cinnamon, and 3 tablespoons water. Bring to a boil, and cook until rhubarb is tender, about 10 minutes. Mix remaining 2 tablespoons of water with the cornstarch, and stir into the saucepan. Cook, stirring constantly, until the sauce is thickened. Remove from heat, and spread over the baked crust.",
        "In a medium glass or metal bowl, beat egg whites until soft peaks form. Gradually add remaining 1/2 cup of sugar, continuing to beat until whites form stiff peaks. Spread meringue over the layer of rhubarb sauce, and sprinkle coconut over the top.",
        "Bake for 10 minutes in the preheated oven, or until the meringue is golden brown. Cool completely before cutting into squares."
    ],
    "ingredients": [
        "CRUST:",
        "1/4 cup butter",
        "1/4 cup white sugar",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1 1/4 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "FILLING:",
        "3 cups chopped fresh rhubarb",
        "3 tablespoons water",
        "1/2 cup white sugar",
        "1/2 teaspoon ground cinnamon",
        "2 tablespoons water",
        "3 tablespoons cornstarch",
        "TOPPING:",
        "2 egg whites",
        "1/2 cup white sugar",
        "1/4 cup flaked coconut"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rhubarb Meringue Squares",
    "url": "http://allrecipes.com/recipe/35633/rhubarb-meringue-squares/"
}
