{
    "directions": [
        "Melt butter in heavy medium saucepan over medium heat. Add rhubarb. Cover and simmer until rhubarb is tender and falling apart, about 10 minutes. Add preserves and 1/4 cup sugar. Cook uncovered until very thick and reduced to 2 cups, stirring frequently, about 35 minutes. Refrigerate filling uncovered until cold, at least 1 hour. (Can be prepared 2 days ahead. Cover and keep refrigerated.)",
        "Preheat oven to 400°F. Line large baking sheet with parchment paper. Roll out pastry on lightly floured surface to 16x12-inch rectangle. Cut pastry in half lengthwise, forming two 16x6-inch rectangles. Place 1 rectangle on prepared baking sheet. Leaving 1-inch plain border, spoon filling onto pastry. Brush border with glaze. Top with second rectangle; press edges firmly to seal. Brush edges with glaze. Fold edges over, forming 1/2-inch border. Press border with tines of fork to seal. Brush top of pastry with glaze; sprinkle with 2 tablespoons sugar. Using sharp knife, cut 1 1/2-inch crosswise slits down center of pastry at 2-inch intervals, exposing filling.",
        "Bake pastry until golden brown, about 25 minutes. Cool pastry on sheet to lukewarm, about 45 minutes. Cut crosswise into 6 pieces. Serve with ice cream."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) unsalted butter",
        "4 cups 1/2-inch-thick slices fresh rhubarb (from about 2 pounds)",
        "1 cup raspberry preserves with seeds",
        "1/4 cup plus 2 tablespoons sugar",
        "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed",
        "1 large egg, beaten to blend (for glaze)",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Raspberry",
        "Spring",
        "Chill",
        "Rhubarb",
        "Phyllo/Puff Pastry Dough",
        "Jam or Jelly",
        "Pastry",
        "Simmer"
    ],
    "title": "Rhubarb-Raspberry Jalousie",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-raspberry-jalousie-104976"
}
