{
    "directions": [
        "Cut enough rhubarb into 1/4-inch-thick slices to measure 6 cups, reserving remainder for another use. Cook rhubarb, granulated sugar, and lemon juice in a large heavy saucepan over moderately high heat, stirring occasionally, until rhubarb exudes juices. Reduce heat and simmer, stirring occasionally, until rhubarb falls apart and is reduced to about 2 cups, 25 to 30 minutes. Cool to room temperature.",
        "While rhubarb simmers, brush flat side of ladyfingers with kirsch. Lightly oil mold and line with 2 (24-inch-long) crisscrossed sheets of plastic wrap, letting excess hang over side. Line side and bottom of mold with some of ladyfingers, flat sides facing inward and trimming bottom ones to fit snugly.",
        "Beat together cream and confectioners sugar until it just holds stiff peaks. Spoon half of rhubarb into mold, smoothing top, and spoon half of cream over it, smoothing top. Cover cream with 1 layer of ladyfingers. Repeat layering with remaining rhubarb, cream, and ladyfingers.",
        "Fold plastic wrap to cover charlotte and weight with a flat-bottomed dish filled with a 2-lb weight. Chill charlotte 1 day.",
        "Remove weight and dish. Unfold plastic wrap and invert a platter over mold. Invert charlotte onto platter, using plastic wrap to loosen charlotte."
    ],
    "ingredients": [
        "2 1/4 pounds rhubarb, leaves and root ends discarded",
        "1 cup granulated sugar",
        "1 1/2 tablespoons fresh lemon juice",
        "37 (3- by 1-inch) soft ladyfingers",
        "2 tablespoons kirsch",
        "3/4 cup chilled heavy cream",
        "3 tablespoons confectioners sugar",
        "Special equipment: a 6-cup charlotte"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Dessert",
        "Kirsch",
        "Spring",
        "Chill",
        "Rhubarb",
        "Simmer",
        "Gourmet"
    ],
    "title": "Rhubarb Charlotte",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-charlotte-104776"
}
