{
    "directions": [
        "Preheat oven to 350°F. Butter and flour Bundt pan, tapping out excess flour.",
        "Rub together granulated sugar and lemon zest with your fingers in a large bowl until fragrant. Using an electric mixer on medium speed, cream lemon sugar and 3/4 cup butter until light and fluffy, about 4 minutes. Add eggs 1 at a time, scraping down sides of bowl and beating well between each addition. Beat in rose water and vanilla extract on medium-low speed until just combined.",
        "Whisk 2 1/4 cups flour, salt, baking powder, and baking soda in another large bowl. With mixer on low, add dry ingredients to lemon sugar mixture in 3 additions, alternating with yogurt in 2 additions, beginning and ending with dry ingredients, scraping down sides and bottom of bowl as needed. Fold in pistachios.",
        "Cut rhubarb crosswise into 2 1/2\" pieces. Using a mandoline set to 1/4\" or a very sharp knife, slice rhubarb lengthwise, maintaining as much red skin on stalks as possible.",
        "Pour one-third of the batter into prepared pan and smooth surface. Add half of the rhubarb, nestling pieces side by side to form a thick ring on top of batter. Pour another third of the batter on top of rhubarb layer; smooth surface. Repeat with remaining rhubarb and batter.",
        "Bake cake until the surface is cracked and golden brown, springs back to the touch, and a tester inserted into the center comes out clean, 50–60 minutes. Let cake rest in pan 10 minutes, then turn out onto a cooling rack.",
        "Whisk powdered sugar, milk, rose water, vanilla extract, and salt in a medium bowl until well combined. Glaze should be pourable but stiff enough to hold its shape-it can be thickened with more powdered sugar or thinned with more milk if needed.",
        "Using a spoon, drizzle rose glaze over cooled cake, holding the spoon a few inches above the cake. While glaze is still wet, sprinkle rose petals and pistachios on top.",
        "Cake can be baked, cooled, wrapped in plastic, and stored at room temperature up to 3 days. Glaze can be made and stored in an airtight container at room temperature up to 5 days."
    ],
    "ingredients": [
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature, plus more for pan",
        "2 1/4 cups all-purpose flour, plus more for pan",
        "2 1/4 cups granulated sugar",
        "1/2 teaspoon finely grated lemon zest",
        "5 large eggs, room temperature",
        "2 teaspoons rose water",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon baking soda",
        "3/4 cup plain yogurt",
        "3/4 cup plus 2 tablespoons raw pistachios, toasted and chopped",
        "8 ounces rhubarb (2-3 stalks), trimmed",
        "2 1/2 cups powdered sugar",
        "2 tablespoons milk",
        "1 tablespoon rose water",
        "1/2 teaspoon vanilla extract",
        "1/8 teaspoon salt",
        "2 tablespoons dried rose petals",
        "2 tablespoons raw pistachios, toasted and chopped",
        "12-cup Bundt pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Pistachio",
        "Rhubarb",
        "Picnic",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rhubarb-Pistachio Bundt Cake With Rose Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/rhubarb-pistachio-bundt-cake-with-rose-glaze-56389533"
}
