{
    "directions": [
        "Sprinkle steaks on both sides with coarse salt and freshly ground black pepper. Place on plate; cover and chill overnight.",
        "Using fork, mix all ingredients in small bowl. Season with freshly ground black pepper. DO AHEAD: Can be made 1 day ahead. Cover; chill. Let stand at room temperature 1 hour before using.",
        "Prepare barbecue (medium-high heat). Grill steaks to desired doneness, 4 to 5 minutes per side for medium-rare. Transfer steaks to cutting board; let rest 5 minutes.",
        "Meanwhile, whisk flour, coarse salt, and baking powder in medium bowl. Add beer and vodka; whisk just until blended. Pour enough oil into heavy large pot to reach depth of 2 inches. Attach deep-fry thermometer to side of pot; heat oil over medium heat to 350°F. Working with 2 onion rings at a time, dip onion rings into batter; shake off excess. Gently drop onion rings into hot oil; fry until deep golden, adjusting heat to maintain temperature, 2 to 4 minutes. Transfer onion rings to paper towels. Repeat with remaining batter and onion rings.",
        "Cut steaks in half across grain. Place 1 steak half on each of 4 plates. Top with blue cheese butter and onion rings."
    ],
    "ingredients": [
        "2 1-pound rib-eye steaks (each about 1 to 1 1/4 inches thick)",
        "Coarse kosher salt",
        "3 tablespoons unsalted butter, room temperature",
        "3 tablespoons crumbled American blue cheese (such as Maytag), room temperature",
        "1 1/2 teaspoons finely grated lemon peel",
        "1 1/2 teaspoons chopped fresh Italian parsley",
        "1 1/2 teaspoons freshly cracked black pepper",
        "1 cup cake flour",
        "1/2 teaspoon coarse kosher salt",
        "1/4 teaspoon baking powder",
        "1/2 cup beer",
        "2 tablespoons vodka",
        "Canola or peanut oil (for deep-frying)",
        "1 large (about 12 ounces) Walla Walla onion or other sweet onion (such as Vidalia or Maui), cut into 1/3-inch-thick rounds, separated into rings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Blue Cheese",
        "Steak",
        "Grill",
        "Grill/Barbecue",
        "Butter",
        "Sugar Conscious",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Rib-Eye Steak with Blue Cheese Butter and Walla Walla Onion Rings",
    "url": "http://www.epicurious.com/recipes/food/views/rib-eye-steak-with-blue-cheese-butter-and-walla-walla-onion-rings-360669"
}
