{
    "directions": [
        "Mix first 3 ingredients in small bowl to blend. Season to taste with kosher salt. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Combine onions, wine, honey, and thyme in large skillet. Bring to boil. Reduce heat to medium-low and simmer uncovered until wine is almost absorbed, stirring occasionally, about 55 minutes. Mix in red wine vinegar. Simmer 10 minutes to blend flavors, adding water by tablespoonfuls to moisten if jam is dry and stirring often (onions will still be slightly crunchy). Season to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate. Before using, rewarm over medium heat until just warm, adding more water by tablespoonfuls if jam is dry.)",
        "Preheat oven to 350°F. Wrap tortillas in foil, enclosing completely. Place in oven until heated through, about 15 minutes.",
        "Meanwhile, heat 1 tablespoon olive oil in each of 2 heavy large skillets over high heat. Add 2 steaks to each skillet and cook to desired doneness, about 3 minutes per side for medium-rare. Transfer steaks to cutting board. Thinly slice steaks crosswise. Divide steak slices among warm tortillas. Top with onion jam, then spoonful of horseradish crème fraîche. Garnish with cilantro sprigs."
    ],
    "ingredients": [
        "1 cup finely grated peeled fresh horseradish root (about 4 ounces)",
        "1 8-ounce container crème fraîche or sour cream",
        "1/4 cup white wine vinegar",
        "Coarse kosher salt",
        "1 1/2 pounds red onions, very thinly sliced",
        "2 cups dry red wine",
        "2 tablespoons honey",
        "1 tablespoon chopped fresh thyme",
        "2 tablespoons red wine vinegar",
        "10 7- to 8-inch-diameter flour tortillas, each cut into 5-inch square",
        "2 tablespoons olive oil",
        "4 9- to 10-ounce boneless rib-eye steaks, excess fat trimmed",
        "Fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Appetizer",
        "Sauté",
        "Cocktail Party",
        "Winter",
        "Honey",
        "Thyme",
        "Engagement Party",
        "Tortillas",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Rib-Eye Tacos with Onion Jam and Horseradish Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/rib-eye-tacos-with-onion-jam-and-horseradish-creme-fraiche-109060"
}
