{
    "directions": [
        "Season steak with kosher salt and pepper. Let sit at room temperature 2 hours, or chill up to 12 hours.",
        "Preheat oven to 300°F. Heat vegetable oil in a large ovenproof skillet, preferably cast-iron, over medium-high. Cook steak until deep golden brown, 5–8 minutes per side. Add butter and spoon over steak a few times. Transfer skillet to oven and roast steak until an instant-read thermometer inserted into the thickest part registers 120°F for rare, 5–8 minutes. Transfer steak to a cutting board and let rest. Increase oven temperature to 425°F.",
        "Combine anchovies, capers, and olive oil in a small bowl; season with kosher salt and pepper. Spread half of anchovy mixture onto cut sides of marrow bone. Roast bone on a rimmed baking sheet until top is browned and marrow is tender, 10–12 minutes.",
        "Meanwhile, cut half of the radishes into quarters (leave the tops on, if using); trim and thinly slice remaining radishes crosswise. Toss radishes, celery leaves, parsley, lemon juice, and remaining anchovy mixture in a medium bowl. Season radish salad with kosher salt, pepper, and more lemon juice, if desired.",
        "Cut steak off bone and slice 1/2\" thick. Transfer meat to a platter, pour pan juices over, and sprinkle with sea salt. Serve alongside marrow bone, radish salad, and toast."
    ],
    "ingredients": [
        "1 (2-pound) bone-in rib eye, about 2\" thick",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons vegetable oil",
        "2 tablespoons unsalted butter",
        "4 oil-packed anchovy fillets, finely chopped",
        "2 tablespoons coarsely chopped drained capers",
        "1 tablespoon olive oil",
        "1 (6–8\" piece) marrow bone, split lengthwise",
        "6 radishes, preferably with tops",
        "1/2 cup celery leaves or 2 celery stalks, thinly sliced",
        "1/4 cup parsley leaves",
        "1 tablespoon (or more) fresh lemon juice",
        "Flaky sea salt (for serving)",
        "Slices of country-style bread, toasted (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Dinner",
        "Steak",
        "Radish",
        "Anchovy",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Rib Eye With Bone Marrow and Radish Salad",
    "url": "http://www.epicurious.com/recipes/food/views/rib-eye-with-bone-marrow-and-radish-salad-56390117"
}
