{
    "directions": [
        "Preheat broiler. Quarter peppers lengthwise, discarding stems, seeds, and ribs. Put peppers, skin side up, on a rack of a broiler pan and broil about 2 inches from heat until skins are blistered and charred, 8 to 12 minutes.",
        "Transfer peppers to a bowl and let stand, covered, until cool enough to handle. Peel peppers. (Wear rubber gloves when handling chilies.)",
        "Lay peppers on their sides on racks of burners (preferably 1 to a burner) and turn flame on high. Char peppers, turning them with tongs, until skins are blackened, 6 to 8 minutes. (If peppers are small, as are chilies, spear through stem end with a long handled fork and rest on burner rack.)",
        "Transfer peppers to a bowl and let stand, covered, until cool enough to handle. Peel peppers. Cut off tops and discard seeds and ribs. (Wear rubber gloves when handling chilies.)",
        "In a shallow baking dish just large enough to hold steaks in one layer stir together oil, rosemary, lemon, and pepper.",
        "Add steaks to marinade, turning to coat well. Marinate steaks, covered, and chilled, turning occasionally, 1 day.",
        "In a blender or food processor blend arugula, oil, and salt and pepper to taste 30 seconds. Chill mixture, covered, 1 1/2 hours. Bring mixture to room temperature and pour through a fine sieve into a bowl. Arugula oil may be made 1 day ahead and chilled, covered.",
        "Prepare grill.",
        "Remove steaks from marinade, letting excess drip off, and grill on an oiled rack set 5 to 6 inches over glowing coals 4 to 5 minutes on each side for medium-rare. (Alternatively, steaks may be grilled in batches in a hot well seasoned ridged grill pan.) Transfer steaks to a cutting board and let stand 5 minutes.",
        "Toss roasted peppers with olive oil and salt and pepper to taste and cut steaks into 1/4-inch-thick slices.",
        "Divide arugula leaves among 4 plates and top with steak and roasted peppers. Drizzle each serving with arugula oil and salt and pepper to taste and serve with potatoes."
    ],
    "ingredients": [
        "1 1/2 cups olive oil",
        "2 teaspoons finely chopped fresh rosemary leaves",
        "1 lemon, sliced thin",
        "1 teaspoons freshly ground black pepper",
        "four 1-inch-thick rib-eye steaks (about 10 ounces each)",
        "1 cup packed arugula leaves, washed and dried",
        "2/3 cup extra-virgin olive oil",
        "2 red bell peppers, quick roasted and peeled",
        "2 yellow bell peppers, quick roasted and peeled",
        "1 tablespoon olive oil",
        "5 cups packed arugula leaves, washed and dried",
        "Accompaniment: Ricotta Whipped Potatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Beef",
        "Marinate",
        "Backyard BBQ",
        "Steak",
        "Arugula",
        "Bell Pepper",
        "Summer",
        "Winter",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Rib-Eye Steaks with Arugula Oil",
    "url": "http://www.epicurious.com/recipes/food/views/rib-eye-steaks-with-arugula-oil-14115"
}
