{
    "directions": [
        "For the steaks: Process the mushrooms in a spice grinder until they form a powder; place it in a jar. Process the salt and peppercorns in the same grinder and add it to the mushroom powder. Process the sugar in the grinder and add it to the mushroom mix. Process the garlic and red pepper flakes in the grinder, add it to the mix and shake it all up.",
        "Place the mixture on a sheet pan and coat all sides of the steaks with the rub.",
        "Lightly coat a grill pan with olive oil and heat it over medium-high heat. Place the steaks on the hot pan and cook for 7 minutes on each side. Allow the steaks to rest on a platter while you make the salad.",
        "For the salad: Put the arugula in a bowl and toss with the lemon juice. Slice the steaks crosswise.",
        "Place the salad on a platter and arrange the sliced steak on top. Sprinkle Oven-Dried Cherry Tomatoes over the steak and drizzle with balsamic vinegar before serving.",
        "Preheat the oven to 300 degrees F.",
        "Place the tomatoes in a bowl and drizzle with olive oil. Sprinkle with salt, black pepper and pepper flakes, if using. Toss well and place on a sheet pan in a single layer. Place the sheet pan in the oven and roast for 3 hours, tossing occasionally."
    ],
    "ingredients": [
        "1/4 cup dried porcini mushrooms, broken up",
        "2 tablespoons kosher salt",
        "2 tablespoons whole black peppercorns",
        "2 tablespoons granulated sugar",
        "1 tablespoon granulated garlic or minced garlic",
        "1 tablespoon red pepper flakes",
        "Three 1 1/2-inch-thick rib-eye steaks",
        "Olive oil, for the pan",
        "6 ounces baby arugula",
        "Juice of one lemon",
        "Oven-Dried Tomatoes, recipe follows",
        "Balsamic vinegar, for drizzling",
        "1 pint cherry tomatoes, sliced in half",
        "Olive oil",
        "Kosher salt and freshly ground black pepper",
        "Crushed red pepper flakes, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Steak",
        "Tomato",
        "Vegetable",
        "Mushroom",
        "Arugula",
        "Main Dish Recipes"
    ],
    "title": "Rib-Eye Steaks with Porcini Rub",
    "url": "http://www.foodnetwork.com/recipes/rib-eye-steaks-with-porcini-rub"
}
