{
    "directions": [
        "Place steaks in shallow dish. Drizzle with oil; rub oil all over steaks. Sprinkle with salt and pepper. Let stand at room temperature 1 hour.",
        "Melt butter in heavy medium skillet over medium-high heat. Add onion and sauté until beginning to soften, about 3 minutes. Add mushrooms and garlic; sauté until mushrooms are just tender, about 4 minutes.",
        "Heat heavy large skillet over medium-high heat. Add steaks to skillet; fry until cooked to desired doneness, about 5 minutes per side for medium-rare. Using tongs, transfer steaks to plates; tent loosely with foil to keep warm.",
        "Add broth, then brandy and minced rosemary to same large skillet and bring to boil, scraping up browned bits. Add mushroom mixture. Boil until liquid is thick enough to coat spoon lightly, about 5 minutes. Add 1 cup cheese; stir just until cheese melts, about 1 minute. Season sauce to taste with salt and pepper.",
        "Spoon sauce over steaks. Sprinkle with remaining 1/4 cup cheese. Garnish with rosemary sprigs."
    ],
    "ingredients": [
        "2 10- to 12-ounce rib-eye steaks (each about 1 inch thick)",
        "1 tablespoon olive oil",
        "3 tablespoons unsalted butter",
        "1 small onion, thinly sliced",
        "1/2 pound mushrooms, thickly sliced",
        "4 garlic cloves, chopped",
        "3/4 cup canned beef broth",
        "1/4 cup brandy",
        "1/4 teaspoon minced fresh rosemary",
        "1 1/4 cups crumbled blue cheese (about 4 ounces)",
        "Fresh rosemary sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Sauté",
        "Father's Day",
        "Blue Cheese",
        "Rosemary",
        "Steak",
        "Brandy",
        "Winter"
    ],
    "title": "Rib-Eye Steaks with Mushrooms, Brandy and Blue Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/rib-eye-steaks-with-mushrooms-brandy-and-blue-cheese-103434"
}
