{
    "directions": [
        "For the steak and marinade: Add the orange juice, soy sauce, cumin, salt, garlic, lemon juice, chipotle, 1/2 cup of the olive oil and some black pepper to a food processor and blend until smooth and combined.",
        "Put the steaks into a resealable plastic bag and pour the marinade over. Seal the bag and massage the marinade into the steaks to ensure they are totally coated. Marinate, refrigerated, for as long as it takes to roast the chiles and get the other ingredients ready for the quesadillas.",
        "For the roasted poblano chiles: Roast the chiles by using metal tongs to hold them one-by-one over the flame of your stovetop until the skin is totally charred. (If you don't have a gas stove, you can use an outdoor grill OR place them on a baking sheet directly under your oven's broiler.) When totally blackened, place the chiles in a large resealable plastic bag and seal the bag to allow them to sweat for a good 20 minutes. Then use a knife to scrape off most of the blackened skin. Slice the chiles in half lengthwise and scrape out the seeds and membranes, then slice into strips.",
        "Heat the remaining 2 tablespoons olive oil in a grill pan over high heat. Remove the steaks from the marinade and turn the heat to medium low. Grill for 5 to 6 minutes each side for medium rare. Let the steaks rest for 5 minutes, then slice.",
        "For the quesadillas: Build the quesadillas by laying some cheese on 6 of the tortillas, then some slices of steak and some of the poblano chile strips. Sprinkle with the tomato and onion. Top with a little more grated cheese and then place the remaining tortillas on top.",
        "Melt 1/2 tablespoon of butter in a clean skillet over medium heat and lay a quesadilla in the skillet. Cook until golden on the bottom, 3 to 4 minutes. Carefully flip the quesadilla to the other side, adding another 1/2 tablespoon butter to the skillet at the same time. Continue cooking until the second side is golden, 3 to 4 minutes. Repeat with the remaining quesadillas.",
        "To serve: Cut the quesadillas into wedges and top with pico de gallo and salsa if desired."
    ],
    "ingredients": [
        "1/2 cup orange juice",
        "1/4 cup soy sauce",
        "1 tablespoon ground cumin",
        "1 teaspoon kosher salt",
        "2 cloves garlic",
        "Juice of 1 lemon",
        "1 chipotle pepper in adobo sauce",
        "1/2 cup plus 2 tablespoons olive oil",
        "Freshly ground black pepper",
        "Two 2-inch-thick rib-eye steaks",
        "4 fresh poblano chiles",
        "4 cups grated Monterey Jack cheese",
        "12 flour tortillas",
        "4 Roma tomatoes, diced",
        "1 yellow onion, diced",
        "6 tablespoons butter, for frying",
        "Pico de gallo, for serving, optional",
        "Salsa, for serving, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Quesadilla",
        "Steak",
        "Beef",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Rib-Eye Quesadillas",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/rib-eye-quesadillas"
}
