{
    "directions": [
        "Thirty minutes before grilling the steaks, remove them from the refrigerator and allow them to come to room temperature. Heat a grill with coals.",
        "When the coals are hot, spread them out in the grill in one solid layer. Pat the steaks dry on both sides with paper towels and sprinkle them liberally with salt and pepper. Place the steaks on the hot grill and sear them on each side for 2 minutes, until browned. Brush each side lightly with olive oil. Place the lid on the grill and allow the steaks to cook for another 3 to 4 minutes, until they are cooked rare, or 120 degrees F on a meat thermometer. (To test the steaks, insert the thermometer sideways to be sure you're actually testing the middle of the steak.) Remove the steaks from the grill, place them in one layer on a platter and cover tightly with aluminum foil. Allow the steaks to rest at room temperature for 15 minutes.",
        "For the stilton sauce, place the stilton cheese in the bowl of a food processor fitted with a steel blade and blend until finely minced. Add the cream cheese, mayonnaise, sour cream, scallions, 1 teaspoon salt, 1/2 teaspoon pepper, and Worcestershire sauce. Process until smooth.",
        "Slice the steak and serve with the stilton sauce.",
        "Photograph by Quentin Bacon"
    ],
    "ingredients": [
        "4 (1 1/4-inch-thick) rib-eye steaks, either boneless or bone-in",
        "Kosher salt and freshly ground black pepper",
        "Good olive oil",
        "4 ounces stilton cheese, crumbled",
        "8 ounces cream cheese, at room temperature",
        "1/2 cup good mayonnaise",
        "1/2 cup sour cream",
        "1 tablespoon chopped scallions, white and green parts",
        "Kosher salt and freshly ground black pepper",
        "1/4 teaspoon Worcestershire sauce"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Steak",
        "Cheese"
    ],
    "title": "Rib-Eye Steaks With Stilton Sauce",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/rib-eye-steaks-with-stilton-sauce-recipe"
}
