{
    "directions": [
        "Preheat oven to 500°F with rack in middle.",
        "Toss tomatoes with shallots, garlic, oil, and 1 1/2 teaspoons salt in a shallow 3-quart baking dish, then arrange tomatoes cut sides up. Roast, uncovered, basting once, until tomatoes are tender but still hold their shape and are starting to brown, 35 to 45 minutes. Cool to room temperature.",
        "While tomatoes cool, prepare grill for direct-heat cooking over hot charcoal (medium-high heat for gas).",
        "Sprinkle each steak all over with 1/4 teaspoon salt and 1/4 teaspoon pepper (total per steak). Oil grill rack, then grill steaks, covered only if using a gas grill, turning over once, 5 to 6 minutes total for medium-rare. Transfer to a cutting board.",
        "Lightly brush both sides of bread slices with some of oil from roasted tomatoes and grill, covered only if using a gas grill, turning over once, until lightly toasted and grill marks form, about 1 minute total. Stir together vinegar and sugar until sugar is dissolved, then stir in herbs. Spread one side of each bread slice with some of herb mixture (about a tablespoon per slice). Slice steaks, then make into sandwiches with bread, roasted tomatoes and shallots, and watercress."
    ],
    "ingredients": [
        "6 medium tomatoes, halved crosswise",
        "3 shallots, thinly sliced into rings",
        "3 garlic cloves, smashed",
        "1/2 cup extra-virgin olive oil",
        "3 (3/4-inch-thick) boneless rib-eye steaks (about 1 3/4 pound total)",
        "8 slices sourdough bread",
        "2 tablespoons rice vinegar (not seasoned)",
        "2 teaspoons sugar",
        "1/2 cup finely chopped cilantro",
        "1/2 cup finely chopped mint",
        "1 bunch watercress, tough stems discarded"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Garlic",
        "Tomato",
        "Roast",
        "Backyard BBQ",
        "Mint",
        "Steak",
        "Summer",
        "Grill/Barbecue",
        "Shallot",
        "Watercress",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Rib-Eye and Roasted-Tomato Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/rib-eye-and-roasted-tomato-sandwiches-239284"
}
