{
    "directions": [
        "Combine 8 cups water, beans, sage, and sliced garlic in large saucepan. Bring to boil; reduce heat to low, cover, and simmer until beans are tender, stirring occasionally and adding more water by 1/4 cupfuls to keep beans submerged, 2 to 2 1/2 hours, depending on age of beans. Add 1 teaspoon sea salt; simmer 10 minutes. Uncover and cool beans in liquid. DO AHEAD: Can be made 1 day ahead. Cover and chill in cooking liquid.",
        "Heat 3 tablespoons oil in large pot over medium heat. Add onion; sprinkle with sea salt. Cook until onion is translucent, stirring often, about 5 minutes. Add chopped garlic; stir 2 minutes. Add celery, carrot, potato, fennel, and thyme; cook until vegetables are tender and begin to turn brown in spots, stirring often, 15 to 18 minutes. Add kale, chard, cabbage, tomatoes, Parmesan rind, 5 cups water, and 1 teaspoon sea salt. Bring to boil; reduce heat to medium-low, cover, and simmer until vegetables are very tender, about 1 1/2 hours. Add beans with cooking liquid and crushed red pepper. Add 2 cups broth. Season with salt and generous amount of pepper. DO AHEAD: Can be made 1 day ahead. Cool, cover, and chill. Rewarm before continuing.",
        "Add bread to soup and simmer, stirring often to break up bread into smaller pieces and adding more broth by 1/2 cupfuls to thin, if desired. Season with sea salt and pepper.",
        "Divide ribollita among bowls, drizzle with oil, and serve.",
        "Also called Tuscan kale, dinosaur kale, lacinato kale, or cavolo nero_, black kale has long, narrow dark green leaves; available at some supermarkets and farmers' markets._"
    ],
    "ingredients": [
        "13 cups (or more) water, divided",
        "1 1/4 cups dried cannellini (white kidney beans; about 8 ounces)",
        "12 large fresh sage leaves",
        "8 garlic cloves; 5 sliced, 3 chopped",
        "2 teaspoons (or more) fine sea salt, divided",
        "6 tablespoons extra-virgin olive oil, divided, plus additional for drizzling",
        "1 large onion, chopped",
        "2 large celery stalks, diced",
        "1 medium carrot, chopped",
        "1 large unpeeled Yukon Gold potato, scrubbed, cut into 1/2-inch cubes",
        "1 small fennel bulb, trimmed, quartered through core, sliced crosswise",
        "1 large pinch of dried thyme",
        "1 small bunch black kale,* cut crosswise into 1-inch ribbons (about 6 cups)",
        "1 small bunch green chard (about 4 large leaves), center stem removed, cut crosswise into 1-inch-wide ribbons (about 6 cups)",
        "4 cups thinly sliced savoy cabbage",
        "5 large plum tomatoes, chopped",
        "1 2-inch square Parmesan cheese rind",
        "Pinch of dried crushed red pepper",
        "2 cups (or more) Light Vegetable Broth or good-quality canned vegetable broth (such as Swanson)",
        "6 1/2-inch-thick slices country white bread, coarsely torn with crusts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Potato",
        "Tomato",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Kale",
        "Winter",
        "Family Reunion",
        "Healthy",
        "Low Cholesterol",
        "Potluck",
        "Simmer",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ribollita",
    "url": "http://www.epicurious.com/recipes/food/views/ribollita-357309"
}
