{
    "directions": [
        "Preheat oven to 350°. Toss bread and 3 tablespoons oil on a rimmed baking sheet, squeezing to moisten; season with salt. Toast, tossing occasionally, until golden brown and crunchy, 15–18 minutes. Let croutons cool.",
        "Using your hands, mix sausage and wine in a medium bowl until smooth. Cook in a large saucepan over medium heat, stirring occasionally, until firm but not browned, about 4 minutes.",
        "Add onion, carrots, celery, anchovies, garlic, and red pepper flakes. Cook, stirring occasionally, until vegetables are tender but still hold their shape, 20–25 minutes. Add kale, tomatoes, beans, and broth and bring to a boil. Reduce heat and simmer, stirring occasionally, until kale offers no resistance when bitten and flavors have melded, about 1 hour.",
        "Just before serving, add vinegar and half of croutons to soup, stirring to break them into smaller pieces. Divide remaining croutons among bowls and ladle soup over. Serve topped with Parmesan and drizzled with more oil."
    ],
    "ingredients": [
        "2 cups coarsely torn day-old sourdough bread",
        "3 tablespoons olive oil, plus more",
        "Kosher salt",
        "1 pound sweet Italian sausage, casings removed",
        "1 cup dry white wine",
        "1 medium onion, finely chopped",
        "3 medium carrots, peeled, finely chopped",
        "3 celery stalks, finely chopped",
        "2 anchovy fillets packed in oil, drained, chopped",
        "3 garlic cloves, thinly sliced",
        "1 teaspoon crushed red pepper flakes",
        "1 bunch Tuscan kale, ribs removed, leaves torn into 2\" pieces",
        "1 15 ounce can whole peeled tomatoes, drained, finely chopped",
        "1 15 ounce can cannellini (white kidney) beans, rinsed",
        "8 cups low-sodium chicken broth",
        "1 tablespoon red wine vinegar",
        "4 ounces Parmesan, shaved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Low Fat",
        "Kid-Friendly",
        "Dinner",
        "Lunch",
        "Sausage",
        "Kale",
        "Carrot",
        "Healthy",
        "Low Cholesterol",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Ribollita with Italian Sausage",
    "url": "http://www.epicurious.com/recipes/food/views/ribollita-with-italian-sausage-51263630"
}
