{
    "directions": [
        "Dissolve yeast in warm water; set aside.",
        "Scald 1 cup milk, and combine with 1/2 cup sugar and 1/2 cup butter or margarine. Set aside to cool.",
        "In a separate bowl beat eggs. Add eggs, vanilla, and pinch of salt to cooled milk mixture.  Mix together.  Add yeast mixture. Gradually add flour and raisins until dough comes away from the bowl. Knead the dough until pliable.  Avoid handling the dough more than necessary!  Place dough in a well oiled bowl.  Set aside to rise until doubled in size in a draft free area.",
        "Combine 2 cups cold milk, 1/4 cup sugar, and pinch of salt in a saucepan.  Stir in rice, and bring to a boil.  Add 1 tablespoon butter.  Lower heat, cover, and cook for about 20 minutes, until done. Set aside to cool.",
        "Punch down the dough, and knead a couple of times. Place into the center of a 9 x 14 inch casserole dish  that has been sprayed with non-stick cooking spray and lightly floured. Spread dough in dish by patting gently to all sides. Let rise for 15 minutes.",
        "Spread rice on top of dough, and pull sides up gently to form an envelope type design.  Rice will show in center. Brush the top lightly with melted butter and sprinkle with cinnamon.",
        "Place in a preheated 375 degree F (190 degrees C) oven.  Lower temperature to 350 degrees F (175 degrees C).  Bake for 30 to 40 minutes, until golden."
    ],
    "ingredients": [
        "1 (0.6 ounce) cake compressed fresh yeast",
        "1/4 cup warm water (110 degrees F/45 degrees C)",
        "1 cup milk",
        "1/2 cup white sugar",
        "1/2 cup margarine",
        "2 eggs",
        "2 teaspoons vanilla extract",
        "1 pinch salt",
        "4 1/2 cups all-purpose flour",
        "3/4 cup golden raisins",
        "1 tablespoon butter, melted",
        "1/2 teaspoon ground cinnamon",
        "1 cup white rice",
        "2 cups cold milk",
        "1 tablespoon butter",
        "1/4 cup white sugar",
        "1 pinch salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rice Bread (Pirog)",
    "url": "http://allrecipes.com/recipe/6994/rice-bread-pirog/"
}
