{
    "directions": [
        "1. Combine the rice, cream, and butter. Add the eggs, stirring together until well blended.",
        "2. Sift the flour with the cinnamon, nutmeg, and salt, and blend thoroughly into the rice mixture. Cover the batter and refrigerate for at least 2 hours, or up to 8 hours.",
        "3. Preheat the oven to 200°F.",
        "4. When you are ready to cook the pancakes, remove the batter from the refrigerator and whisk together well. Melt about 1 tablespoon of butter in a skillet set over medium-high heat. When the butter is sizzling, add a small amount of batter to the pan to test the heat level. If necessary, reduce the heat to medium before cooking the pancakes.",
        "5. For each rice pancake, pour about 1/4 cup of the batter into the prepared pan. Cook for 2 to 3 minutes, or until bubbles appear on the surfaces and the edges of the pancakes are lightly browned. Using a spatula, carefully turn the pancakes over and cook about 2 minutes more, until done. Transfer the finished pancakes, separated by parchment paper, to an ovenproof platter, and set them in the oven to keep warm. Prepare the remaining pancakes, adding more butter to the pan as needed.",
        "6. To serve, lightly sprinkle the rice pancakes with sugar, if desired, and garnish with orange slices."
    ],
    "ingredients": [
        "1 1/2 cups cooked rice",
        "2 cups heavy cream",
        "2 tablespoons unsalted butter, melted, plus more for cooking",
        "2 large eggs, well beaten",
        "1/2 cup sifted all-purpose flour",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "1/2 to 1 teaspoon salt",
        "Sugar for sprinkling (optional)",
        "Orange slices for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Egg",
        "Rice",
        "Breakfast",
        "Chill",
        "Advance Prep Required",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Rice Pancakes",
    "url": "http://www.epicurious.com/recipes/food/views/rice-pancakes-394729"
}
