{
    "directions": [
        "To make the tomato mixture, in a small bowl, combine the mushrooms with warm water to cover and let stand for 15 minutes to rehydrate. Drain, squeeze out the excess liquid and chop finely. In a fry pan over medium heat, warm the olive oil. Add the beef, onion and mushrooms and sauté until the meat is no longer red, about 10 minutes. Add the tomato puree and salt and bring to a boil. Reduce the heat to medium-low and simmer, uncovered, until the sauce has reduced by about one-third, about 20 minutes. Remove from the heat and let cool.",
        "To make the rice, bring a large saucepan three-fourths full of water to a rapid boil over high heat. Add the 1 Tbs. salt and the rice and cook, stirring occasionally with a wooden spoon, until the rice has softened but is still al dente, 10 to 12 minutes. Drain the rice and spread it out on a large platter or roasting pan to cool slightly. Add the eggs, butter, Parmigiano-Reggiano cheese, a pinch of salt and the tomato mixture. Using your hands, mix to combine. Let cool to room temperature.",
        "To form the croquettes, whisk the egg in a small, shallow bowl until blended. Pour the bread crumbs into a second shallow bowl. Using a soupspoon, scoop up some rice and form into a ball the size and shape of an egg. Using an index finger, make an indentation in the side of the ball, insert a piece of the mozzarella deep into the center and close the rice around it. Roll the ball in the beaten egg to coat evenly and then roll in the bread crumbs, again coating evenly. Place the ball on a large, flat plate or tray. Repeat with the remaining rice and cheese, evenly coating each ball. When all the balls are formed, cover the plate and refrigerate the balls for at least 1 hour or up to overnight before cooking.",
        "Preheat an oven to 150°F and put an ovenproof platter in it.",
        "To cook the croquettes, in a heavy saucepan or deep, heavy fry pan, pour in olive oil to a depth of at least 2 inches and heat to 325°F on a deep-frying thermometer, or until a bit of rice dropped into the hot oil sizzles immediately on contact.",
        "Working in batches, fry the croquettes, turning as needed to color evenly, until they are a deep sunburned color and have a nice crisp crust, 5 to 7 minutes. Using a slotted spoon, transfer to paper towels to drain, then transfer to the platter in the oven while you fry the remaining croquettes.",
        "Serve the croquettes while the mozzarella core is still hot. They may be eaten with a knife and fork, but for the traditional telephone-cord effect, they should be grasped with a paper napkin and eaten out of hand. Makes about 24 croquettes.",
        "Adapted from Williams-Sonoma Foods of the World Series,",
        "Rome,",
        "by Maureen B. Fant (Oxmoor House, 2005)."
    ],
    "ingredients": [
        "For the tomato mixture:",
        "1 1/2 oz. dried porcini mushrooms",
        "1 Tbs. extra-virgin olive oil",
        "1/4 lb. ground lean beef",
        "1 small yellow onion, finely chopped",
        "1 can (14 oz.) tomato puree",
        "1/2 tsp. salt",
        "For the rice:",
        "1 Tbs. salt, plus more, to taste",
        "2 cups Arborio rice",
        "2 eggs, lightly beaten",
        "2 Tbs. unsalted butter",
        "2 Tbs. grated Parmigiano-Reggiano cheese",
        "1 egg",
        "1 cup fine dried bread crumbs",
        "1/2 lb. fresh mozzarella cheese, cut into rectangles the size and shape of large sugar cubes (about 24 pieces)",
        "Olive oil, preferably extra-virgin, for deep-frying"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Rice Croquettes (Supplì al Telefono)",
    "url": "http://www.williams-sonoma.com/recipe/rice-croquettes.html"
}
