{
    "directions": [
        "Mix 2 teaspoons soy sauce, 1 teaspoon oil, 2 teaspoons garlic and 1 teaspoon ginger in medium bowl. Add chicken and toss to coat. Let stand 30 minutes.",
        "Meanwhile, bring 2 3/4 cups water to boil in heavy medium saucepan. Add rice; return to boil. Reduce heat to medium-low, cover and simmer until rice is tender and water is absorbed, about 15 minutes. Uncover; let stand until cool.",
        "Sprinkle chicken with salt and pepper. Heat large nonstick skillet over high heat. Add chicken with marinade to skillet and sauté until golden brown and cooked through, about 4 minutes. Cool.",
        "Whisk lime juice, 1 tablespoon soy sauce, 2 tablespoons oil, 2 tablespoons garlic and 3 teaspoons ginger in large bowl. Mix in rice, chicken, pineapple, kiwi, 1/2 cup green onions and bell pepper. Season with salt and pepper. (Can be made 6 hours ahead. Chill. Let stand up to 2 hours at room temperature before continuing.",
        "Line bowl with lettuce leaves. Spoon salad into bowl. Sprinkle with remaining 1/4 cup green onions and serve."
    ],
    "ingredients": [
        "2 teaspoons plus 1 tablespoon low-sodium soy sauce",
        "1 teaspoon plus 2 tablespoons vegetable oil",
        "4 teaspoons minced garlic",
        "4 teaspoons minced peeled fresh ginger",
        "12 ounces skinless boneless chicken breast halves or chicken tenders, cut crosswise into 1/2-inch strips",
        "2 3/4 cups water",
        "1 1/2 cups basmati rice or long-grain white rice",
        "6 tablespoons fresh lime juice",
        "1 cup cubed peeled pineapple",
        "1 kiwi, peeled, cubed",
        "3/4 cup thinly sliced green onions",
        "1/2 cup chopped red bell pepper",
        "4 large curly lettuce leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Fruit",
        "Rice",
        "Low Fat",
        "Pineapple",
        "Summer"
    ],
    "title": "Rice, Pineapple and Chicken Salad",
    "url": "http://www.epicurious.com/recipes/food/views/rice-pineapple-and-chicken-salad-101351"
}
