{
    "directions": [
        "Preheat oven to 350°F.",
        "Place garlic cloves on 6-by-6-inch square of foil, drizzle with olive oil, and sprinkle with 1/2 teaspoon salt. Wrap garlic tightly in foil and roast in middle of oven until soft, 30 to 35 minutes. When cool enough to handle, unwrap and separate cloves. Squeeze garlic from skin into small bowl. Set aside.",
        "On gas stove, directly over burner turned to moderately high heat, roast chiles, turning with tongs, until softened and charred on all sides, about 6 to 8 minutes. (Alternately, roast chiles in broiler, turning occasionally, about 2 1/2 minutes.) Immediately seal in airtight container or place in bowl and cover tightly with plastic wrap. Let sit until cool enough to handle, about 10 minutes, then uncover. Holding chiles under cold running water, rub off charred skins. Cut off tops, gently split chiles open, and discard seeds if desired. (Seeds will add additional heat to final dish.) Set aside.",
        "In dry, 10-inch skillet over moderately low heat, toast coriander seeds, shaking skillet often, until fragrant and several shades darker, about 3 minutes. Transfer to small bowl. Toast cumin seeds in same manner. (Do not wash skillet.) When cool, finely grind both spices in electric coffee/spice grinder. Set aside.",
        "In same skillet, over moderately low heat, toast coconut, stirring occasionally to prevent sticking, until fragrant and golden, about 7 minutes. In blender, combine coconut, garlic, chiles, and 1/2 cup water. Purée until smooth, adding additional 1/4 cup water if necessary. Set aside.",
        "In medium saucepan over moderately high heat, heat canola oil until shimmering. Add shallot and ginger, and cook, stirring, until fragrant, about 1 minute. Add garlic-chile purée (do not clean blender) and ground spices. Pour stock into blender, swish around to collect residual puré, and pour into pan with other ingredients. Add tamarind paste and sugar, and season with salt. Simmer, stirring occasionally, until thickened slightly, about 12 minutes. Keep warm.",
        "Preheat oven to 400°F.",
        "In small bowl, beat together egg, flour, 1/8 teaspoon salt, and 1/8 teaspoon pepper to make egg wash.",
        "Place rice flakes in medium bowl.",
        "Working with 1 fillet at a time, generously brush skinned side of snapper with egg wash, then gently dredge same side in rice flakes and sprinkle with salt and pepper. Repeat with remaining snapper.",
        "In large ovenproof skillet, over moderately high heat, heat 2 tablespoons oil until shimmering. Add 3 snapper fillets, coated sides down. Sear, without turning, until coating is golden brown, about 1 1/2 minutes. Turn fillets over and place skillet in oven. Roast, uncovered, until firm and just cooked through, about 2 to 4 minutes. Transfer fillets to platter and loosely cover with foil to keep warm. Heat remaining 2 tablespoons oil in skillet and cook remaining fillets in same manner. Serve with roasted chile sauce."
    ],
    "ingredients": [
        "3 garlic cloves, unpeeled",
        "1 tablespoon extra-virgin olive oil",
        "1/2 teaspoon salt, plus more to taste",
        "2 mild to moderately hot fresh green chiles (4 to 6 inches in length) such as jalapeños and serranos",
        "1 1/2 tablespoons coriander seeds",
        "1 1/2 teaspoons cumin seeds",
        "1 1/2 cups grated fresh coconut or unsweetened desiccated coconut, tightly packed",
        "2 tablespoons canola oil",
        "1 tablespoon shallot, chopped",
        "1 tablespoon fresh ginger, peeled and chopped",
        "1 cup chicken stock or low-sodium chicken broth",
        "1 tablespoon tamarind paste*",
        "1/2 teaspoon sugar",
        "1 large egg",
        "2 tablespoons all-purpose flour",
        "1/8 teaspoon salt, plus more to taste",
        "1/8 teaspoon freshly ground black pepper, plus more to taste",
        "1 cup (4 ounces) rice flakes or crushed unsweetened puffed rice cereal*",
        "6 (6-ounce) pieces red snapper fillets with skin",
        "1/4 cup canola oil",
        "*Tamarind paste is available at Middle Eastern markets or online at kalustyans.com",
        "**Rice flakes are also called poha thick and are available at Indian spice stores."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Fish",
        "Ginger",
        "Roast",
        "Dinner",
        "Seafood",
        "Snapper",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rice Flaked Red Snapper with Roasted Chile Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/rice-flaked-red-snapper-with-roasted-chile-sauce-235712"
}
