{
    "directions": [
        "Cook wild rice in a medium pot of boiling salted water until tender and grains start to split, 35–40 minutes. Drain; let cool.",
        "Meanwhile, combine basmati rice, lime, if using, and 1 1/2 cups water in a medium saucepan, season with salt, and bring to a boil. Reduce heat, cover, and simmer 10 minutes. Remove from heat and fluff with a fork. Cover; let sit until water is absorbed, about 5 minutes. Let cool; discard lime.",
        "If using fresh fava beans, cook in a large saucepan of boiling salted water until tender, about 4 minutes. Drain; transfer to a bowl of ice water. Drain and peel. (If using frozen fava beans, cook 2 minutes; transfer to a bowl of ice water, then drain.)",
        "Toss wild rice, basmati rice, dill, parsley, pistachios, oil, lemon zest and juice, lime powder, and fava beans in a large bowl; season with salt.",
        "Do ahead: Fava beans can be cooked and peeled 2 days ahead; cover and chill. Wild and basmati rice can be cooked 2 days ahead; cover and chill."
    ],
    "ingredients": [
        "1/2 cup wild rice",
        "Kosher salt",
        "1 cup basmati rice",
        "1 dried Iranian lime (optional)",
        "1 cup fresh shelled fava beans (from about 1 pound pods) or frozen, thawed",
        "1/2 cup chopped fresh dill",
        "1/2 cup chopped fresh flat-leaf parsley",
        "1/2 cup unsalted, raw pistachios",
        "1/4 cup olive oil",
        "2 teaspoons finely grated lemon zest",
        "1/4 cup fresh lemon juice",
        "1/2 teaspoon Iranian lime powder or 1 teaspoon finely grated lime zest",
        "Dried Iranian limes, also known as limu omani, are available at Middle Eastern markets and online."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Kid-Friendly",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Spring",
        "Summer",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Rice Salad with Fava Beans and Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/rice-salad-with-fava-beans-and-pistachios-51242140"
}
