{
    "directions": [
        "Wash rice in several changes of cold water in a bowl until water is almost clear. Soak rice in cold water 1 hour, then drain well in a sieve.",
        "While rice soaks, cook onion in oil in a wide 5- to 6-quart heavy pot over medium-high heat, stirring occasionally, until pale golden, about 5 minutes. Pat lamb dry and sprinkle with 1 teaspoon salt. Add to onion and brown on all sides, about 8 minutes total. Add 1 cup water and bring to a simmer. Cover pot and reduce heat to low, then braise lamb, stirring occasionally, until meat is tender, about 45 minutes.",
        "Stir in drained rice, carrots, raisins, and 2 teaspoons salt. Add enough water to cover mixture by 1 inch (3 1/2 to 4 cups) and bring to a boil, uncovered, over medium-high heat. Wrap a kitchen towel around lid with ends of towel on top, then cover pot and boil over medium heat 10 minutes. Reduce heat to low and simmer, covered, until rice is tender and liquid has been absorbed, about 30 minutes.",
        "Fluff rice with a fork and transfer pilaf to a large platter. Top with kebabs and serve with yogurt sauce."
    ],
    "ingredients": [
        "3 cups basmati rice (7 ounces)",
        "1 medium onion, chopped",
        "3 tablespoons olive oil",
        "1 1/2 pounds boneless lamb shank (from 2 1/4 pounds bone-in shanks), cut into 1 1/2- to 2-inch pieces",
        "4 1/2 to 5 cups water, divided",
        "2 large carrots, cut into 1/8-inch-thick matchsticks",
        "1 cup raisins (6 ounces)",
        "Accompaniments: chicken kebabs and cilantro garlic yogurt sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Rice",
        "Vegetable",
        "Braise",
        "Dinner",
        "Raisin",
        "Meat",
        "Lamb Shank",
        "Root Vegetable",
        "Carrot",
        "Fall",
        "Winter",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Rice Pilaf with Lamb, Carrots, and Raisins",
    "url": "http://www.epicurious.com/recipes/food/views/rice-pilaf-with-lamb-carrots-and-raisins-240165"
}
