{
    "directions": [
        "Cover chicken with 12 cups water in a 6- to 8-quart pot.",
        "Cut off one third of ham (trim if necessary) and cut into 1/3-inch dice, then chill. Add remaining two thirds ham to pot.",
        "Trim scallions, then cut 1 scallion into thin slices and reserve. Cut remaining scallions crosswise into thirds and add to pot along with ginger, garlic, and cilantro stems.",
        "Cook chicken, uncovered, at a bare simmer 3 hours (do not let boil), skimming foam as necessary. (Do not stir, or stock will be cloudy.)",
        "Transfer chicken with tongs to a cutting board, reserving stock. When chicken is cool enough to handle, remove breast meat and shred into 3-inch-long strips, discarding skin. Chill strips and reserve remaining chicken for another use. Pour stock through a fine-mesh sieve into a large bowl, discarding solids and skimming off fat (see cooks' note, below).",
        "Bring 6 cups stock with salt to a simmer.",
        "While stock is coming to a simmer, bring about 2 quarts water to a boil in a 4-quart saucepan. Soak noodles in a bowl of very hot water until softened, about 10 minutes, then drain in a colander. Add noodles to boiling water and cook 1 minute, then add lettuce and cook 30 seconds. Drain in a colander.",
        "Using tongs, divide noodles and lettuce among 6 deep bowls, forming small nests, then top with shredded chicken and diced ham. Ladle 1 cup hot broth into each bowl and sprinkle with sliced scallion."
    ],
    "ingredients": [
        "1 (3-lb) whole chicken",
        "12 cups cold water",
        "1 (6-oz) slice boneless ham (1/3 inch thick) such as Smithfield ham or baked Virginia ham",
        "1 bunch scallions",
        "1 (1-inch) piece fresh ginger, cut into 1/4-inch slices",
        "4 garlic cloves, crushed",
        "1/2 cup coarsely chopped fresh cilantro stems, roots discarded",
        "1 1/2 teaspoons salt",
        "6 oz dried rice noodles",
        "3 cups finely shredded iceberg lettuce (1/4 head)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Ginger",
        "Breakfast",
        "Lunch",
        "Ham",
        "Fall",
        "Winter",
        "Noodle",
        "Cilantro",
        "Lettuce",
        "Simmer",
        "Gourmet"
    ],
    "title": "Rice Noodle Soup with Ham and Lettuce",
    "url": "http://www.epicurious.com/recipes/food/views/rice-noodle-soup-with-ham-and-lettuce-109103"
}
