{
    "directions": [
        "In an 8- or 9-inch skillet heat 1 cup oil over moderate heat until hot but not smoking and fry shallot, stirring, until golden, 1 to 2 minutes. Transfer shallot with a slotted spoon to paper towels to drain. Fry garlic in same hot oil and drain in same manner.",
        "In a small bowl stir together tamarind and warm water, mashing tamarind gently, and strain mixture through a fine sieve set over a bowl, pressing hard on solids. Stir in fish sauce, vinegar, sugar, and water.",
        "In a large bowl soak noodles in cold water to cover 15 minutes. Drain noodles and in a kettle of boiling salted water cook until just tender, 1 to 2 minutes. In a colander drain noodles and rinse under cold water. Drain noodles well.",
        "In a large skillet cook onion and bell pepper in remaining 2 tablespoons oil over moderate heat, stirring, until softened and add tomatoes, noodles, and sauce. Cook mixture, stirring, until heated through. Add herbs, garlic, and shallot and toss noodles well."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons vegetable oil",
        "1/2 cup thinly sliced shallot",
        "1/3 cup thinly sliced garlic",
        "1/4 cup tamarind (from a pliable block)",
        "1/2 cup warm water",
        "3 tablespoons Asian fish sauce (preferably naam pla)",
        "3 tablespoons rice vinegar",
        "1 1/2 tablespoons firmly packed brown sugar",
        "1/4 cup water",
        "3/4 pound dried flat rice noodles (about 1/4 to 1/2 inch wide)",
        "1 small onion, sliced thin",
        "1 small red bell pepper, cut into thin strips",
        "3/4 pint vine-ripened cherry tomatoes, quartered",
        "1/4 cup thinly sliced fresh Thai basil leaves or Italian basil leaves",
        "1/4 cup chopped fresh coriander"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Tomato",
        "Side",
        "Vegetarian",
        "Dinner",
        "Basil",
        "Bell Pepper",
        "Summer",
        "Pan-Fry",
        "Noodle",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Rice Noodles with Garlic and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/rice-noodles-with-garlic-and-herbs-12063"
}
