{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Place the turkey wings, onions, celery, carrots, and garlic into a roasting pan, and roast until the turkey wings turn a deep golden brown color, about 1 hour and 15 minutes. Transfer the cooked wings and vegetables to a large pot. Place the roasting pan over 2 stove burners on medium-high heat, then pour the white wine into the roasting pan. Scrape off and dissolve any browned flavor bits from the bottom of the pan into the white wine; heat and scrape the roasting pan until the drippings and wine have reduced to about 1/2 cup. Pour the wine mixture into the saucepan with the turkey wings.",
        "Pour chicken broth and water into the pot, and season with thyme. Push the turkey wings down into the liquid; bring the mixture to a boil, reduce heat to low, and simmer for 45 minutes. Skim off any foam that collects on top. Pour the broth mixture through a colander into a large bowl; pick meat from the wings, if desired, to add to gravy, or discard the spent wings and vegetables. Allow the gravy base to stand for several minutes for the fat to collect into a layer on top, and skim as much fat as possible. Transfer the skimmed fat into a saucepan. There should be at least 1/2 cup of turkey fat; add butter to make this amount if necessary.",
        "Whisk the flour into the turkey fat over medium heat until the flour mixture becomes smooth and golden brown. Gradually whisk in the broth until the gravy comes to a boil and thickens. Season to taste with salt and pepper. Allow the gravy to cool, then refrigerate or freeze. Reheat almost to boiling to serve."
    ],
    "ingredients": [
        "3 pounds turkey wings",
        "2 small onions, quartered",
        "2 stalks celery, each cut into 4 pieces",
        "2 carrots, each cut into 4 pieces",
        "2 cloves garlic, halved",
        "1 1/2 cups dry white wine",
        "4 cups chicken broth",
        "4 cups water",
        "1/4 teaspoon dried thyme",
        "2 tablespoons butter, or more if needed (optional)",
        "1/2 cup all-purpose flour",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rich Make-Ahead Turkey Gravy",
    "url": "http://allrecipes.com/recipe/215895/rich-make-ahead-turkey-gravy/"
}
