{
    "directions": [
        "Wash and dry the raisins and the currants.  Wash, dry, pit, and chop the dates.  Chop the raisins and the citrus peel.  Slice the cherries.  Blanch the almonds, and slice them lengthwise.  Combine fruits and nuts in large bowl.",
        "Grease and line 3 standard Christmas cake pans (these round pans are at least 3 inches deep and come in a set of three sizes- 5, 7, and 9 inch across) with 4 layers of heavy waxed paper, or 3 layers of brown paper.  Grease again.   Preheat oven to 275 degrees F (135 degrees C).",
        "Sift together flour, baking powder, soda, salt, and spices onto a piece of waxed paper.  Remove 1 cup  of this flour mixture, and combine with fruit and nuts.  Mix until fruit is well coated.",
        "Cream the butter until fluffy.  Add extracts.  Gradually add sugar, mixing until creamy.  Beat egg yolks until light and lemon-colored, and beat into the butter mixture.  Stir in the molasses, and beat together well.  Add half of the remaining flour mixture, and blend thoroughly.",
        "Beat egg whites until stiff but not dry; fold into batter.  Stir in lightly the remaining flour mixture alternately with combined fruit juice and coffee.  Add floured fruit and nuts, blending in until fruit is well distributed.",
        "Turn batter into prepared cake tins, filling each about 2/3 full and spreading batter evenly.  Bake in center of oven.  Bake small cake 2 1/2 hours, medium cake 3 1/2 hours, and large cake 4 to 4 1/2 hours.  Remove from oven and allow to stand 5 minutes, then turn out on wire rack to cool."
    ],
    "ingredients": [
        "6 cups sultana raisins",
        "3 cups dried currants",
        "1 1/2 cups pitted dates",
        "6 cups raisins",
        "3 cups candied mixed citrus peel",
        "1/2 pound candied cherries",
        "2 cups almonds",
        "2 cups butter",
        "3 1/4 cups all-purpose flour",
        "3 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "2 teaspoons ground allspice",
        "4 teaspoons ground cinnamon",
        "1 teaspoon ground nutmeg",
        "1/2 teaspoon ground cloves",
        "1 tablespoon vanilla extract",
        "1 tablespoon almond extract",
        "2 cups white sugar",
        "12 egg yolks",
        "1/2 cup molasses",
        "12 egg whites",
        "1/2 cup grape juice",
        "1/2 cup strong brewed coffee"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rich Dark Fruitcake",
    "url": "http://allrecipes.com/recipe/9281/rich-dark-fruitcake/"
}
