{
    "directions": [
        "Heat the olive oil in a large pot or Dutch oven, such as Le Creuset. Add the oxtails, 1 teaspoon salt, and 1/2 teaspoon pepper and cook over medium-high heat, stirring occasionally, for 10 minutes until browned all over. Remove the oxtails with a slotted spoon and reserve.",
        "Add the leeks, carrots, onion, celery, and garlic to the fat in the pot and cook over medium heat, stirring occasionally, for 10 minutes, until the vegetables start to brown. Tie the thyme sprigs together with kitchen string and add to the pot along with the bay leaves. Return the oxtails to the pot and add the broth, 1 teaspoon of salt, and 1 teaspoon of pepper. Raise the heat and bring to a boil. Lower the heat, cover, and simmer for 1 hour. Discard the thyme bundle and the bay leaves, and skim off the fat.",
        "Meanwhile, bring 4 cups of water to a boil and add the barley. Simmer uncovered for 30 minutes, drain, and set aside.",
        "When the soup is ready, add the barley and cook the soup for another 15 or 20 minutes, until the barley is tender. Depending on the saltiness of the stock, the soup might need another teaspoon of salt and some pepper. Serve hot, with or without the oxtails."
    ],
    "ingredients": [
        "1 tablespoon good olive oil",
        "2 pounds beef oxtails",
        "Kosher salt and freshly ground black pepper",
        "2 cups chopped leeks, white and light green parts (2 leeks)",
        "2 cups (1/2-inch) diced carrots (4 carrots)",
        "1 cup chopped yellow onion",
        "1 cup (1/2-inch) diced celery (2 stalks)",
        "2 garlic cloves, minced",
        "2 sprigs fresh thyme leaves",
        "3 bay leaves",
        "10 cups canned beef broth",
        "1 cup pearled barley"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Soup",
        "Beef",
        "Meat",
        "Barley",
        "Grain Recipes",
        "Vegetable"
    ],
    "title": "Rich Beef Barley Soup",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/rich-beef-barley-soup-recipe"
}
