{
    "directions": [
        "Place the beef into a large bowl. Stir in the red wine, salt, and black pepper. Marinate for 10 minutes, then remove the beef and pat dry with a paper towel. Reserve the remaining marinade.",
        "Heat the olive oil in a large skillet over medium heat. Stir in the beef; cook and stir until browned, then transfer to a plate, 5 to 7 minutes. Drain any remaining grease from the skillet. Melt 2 tablespoons butter over medium heat. Stir in the onion, garlic, and a pinch of salt. Cook and stir until the onion is soft and translucent. Transfer the onion mixture to the plate with the prepared beef; set aside.",
        "Melt another 2 tablespoons butter in the same skillet over medium heat, and stir in the mushrooms. Cook and stir until the mushrooms are tender, about 10 minutes. Place the cooked mushrooms in a bowl and set aside. Melt 1/4 cup of butter in the skillet. Whisk in the flour, cook and stir until the flour no longer tastes raw, about 4 minutes. Slowly whisk in the beef stock. Bring to a boil, stirring constantly, then reduce heat to medium low. Pour in the reserved red wine marinade, Worcestershire sauce, prepared mustard, and red pepper flakes, then add the beef and onion mixture. Cover and simmer until the meat is tender, about 1 hour. Season with salt and black pepper.",
        "Stir in the mushrooms, sour cream, and cream cheese about 5 minutes before serving."
    ],
    "ingredients": [
        "2 (2 pound) beef chuck roast, cut into 1/2-inch thick strips",
        "1/2 cup red wine",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 tablespoon extra-virgin olive oil",
        "2 tablespoons butter",
        "1 large onion, diced",
        "3 cloves garlic, minced",
        "2 tablespoons butter",
        "1 cup sliced mushrooms",
        "1/4 cup butter",
        "1/4 cup all-purpose flour",
        "1 1/3 cups beef stock",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon prepared yellow mustard",
        "2 teaspoons crushed red pepper flakes",
        "1/3 cup sour cream",
        "1 (3 ounce) package cream cheese, softened"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rich and Creamy Beef Stroganoff",
    "url": "http://allrecipes.com/recipe/219046/rich-and-creamy-beef-stroganoff/"
}
