{
    "directions": [
        "1. Prepare the sauce: Place oil in a saucepan over medium heat. Add the onion and cook, stirring, until just beginning to brown, about 5 minutes. Add the garlic and cook 1 minute more. Raise the heat to medium-high and add the tomatoes, chopped thyme, lemon zest, and half of the olives, capers, and peppers. Simmer briskly, stirring, for about 5 minutes to evaporate some of the liquid. Reduce the heat to medium-low, stir in 1 cup water and simmer for 15 minutes. Taste and season with salt. Cool.",
        "2. Preheat a gas grill to medium-high or light a charcoal fire and let it burn just until the coals are covered with gray ash and very hot. Reduce the heat on one side of the gas grill to medium-low or set up the charcoal grill for indirect cooking by banking all of the coals to one side, leaving the other half of the grill empty. Set the cooking grate in place, cover the grill and let the grate heat for 5 minutes.",
        "3. Oil the grill and both sides of each salmon steak; sprinkle fish with salt. Cook the salmon over the hottest part of the grill for about 4 minutes, until nicely browned underneath. Carefully flip over the fish onto the cooler side of the grill; cook 2 to 4 minutes more for medium-rare.",
        "4. Spoon the sauce into a deep platter and nestle the fish in it. Let stand at room temperature for about an hour to bring together the flavors of the fish and the sauce.",
        "5. To serve, sprinkle the fish with remaining olives, capers, and peppers; garnish with the thyme sprigs. Serve immediately."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil, plus more for oiling the grill and the salmon",
        "1 medium-sized onion, thinly sliced",
        "4 cloves of garlic, finely chopped",
        "7 cups diced (1/2 inch) ripe tomatoes",
        "2 tablespoons chopped fresh thyme leaves, plus a few sprigs for garnish",
        "2 teaspoons finely grated lemon zest",
        "1 cup pitted, roughly sliced green olives (preferably manzanillo olives)",
        "1/4 cup capers, drained and rinsed",
        "3 pickled jalapeño peppers, stemmed, seeded and thinly sliced",
        "Salt, to taste",
        "6 salmon steaks (7 to 8 ounces each), about 1 inch thick"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Dinner",
        "Healthy",
        "Parade",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Rick Bayless' Grilled Salmon Vera Cruz with Lemon-and-Thyme-Scented Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/rick-bayless-grilled-salmon-vera-cruz-with-lemon-and-thyme-scented-salsa-106865"
}
