{
    "directions": [
        "Preheat an oven to 400°F.",
        "In a heavy fry pan over medium heat, warm the 2 Tbs. olive oil. Add the green onion and green garlic and sauté until tender, about 1 minute. Add the peas and the 1 1/2 Tbs. minced tarragon and stir to coat. Add the water and a sprinkle of salt, and cook until the peas are tender and almost all of the water has evaporated, about 7 minutes. Remove from the heat and let cool slightly.",
        "Transfer the pea mixture to a food processor, add the ricotta and Parmigiano-Reggiano and process until smooth. Season with salt and pepper. (The mixture can be covered and refrigerated for up to 2 days before continuing.)",
        "Arrange the baguette slices on a large rimmed baking sheet. Brush the slices lightly with olive oil. Transfer to the oven and bake until lightly toasted, about 8 minutes.",
        "Spread the toasts thickly with the pea puree and return them to the baking sheet. Transfer to the oven and heat just until the puree is warmed through, about 7 minutes.",
        "Arrange the crostini on a platter, sprinkle with some pink peppercorns and tarragon leaves and serve immediately. Makes 24 crostini.",
        "Adapted from Williams-Sonoma",
        "Kitchen Garden Cookbook,",
        "by Jeanne Kelly (Weldon Owen, 2013)."
    ],
    "ingredients": [
        "2 Tbs. extra-virgin olive oil, plus more for brushing",
        "1 green onion, sliced",
        "1 Tbs. sliced green garlic, or 1 garlic clove, chopped",
        "1 1/2 cups shelled English peas",
        "1 1/2 Tbs. minced fresh tarragon, plus whole leaves for garnish",
        "1/3 cup water",
        "Kosher salt, to taste",
        "3/4 cup ricotta cheese",
        "1/2 cup grated Parmigiano-Reggiano cheese",
        "Freshly ground pepper, to taste",
        "24 thin baguette slices",
        "Pink peppercorns for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Ricotta and Pea Crostini with Tarragon and Pink Peppercorns",
    "url": "http://www.williams-sonoma.com/recipe/ricotta-pea-crostini-tarragon.html"
}
