{
    "directions": [
        "Whisk 3/4 cup sugar, cornstarch, and flour in large bowl. Add egg yolks and lemon peel; whisk to blend.",
        "Bring milk just to simmer in small saucepan over medium-high heat. Gradually whisk hot milk into yolk mixture. Return mixture to same saucepan and bring to boil over medium heat, whisking constantly. Boil 1 minute, whisking constantly (pastry cream will be thick). Spread pastry cream out to 1/3-inch thickness on small rimmed baking sheet. Cover completely with plastic wrap. Cool to room temperature. Transfer pastry cream to medium bowl. Whisk in ricotta. Cover and chill until cold, about 1 hour.",
        "Bring blackberries, vermouth, lemon juice, and 1/4 cup sugar to boil in small saucepan, crushing some berries and stirring to dissolve sugar. Reduce heat to medium-low; simmer until mixture thickens and measures 1 cup, about 8 minutes. Transfer blackberry compote to small bowl, cover with plastic wrap, and chill.",
        "Butter six 1/2-cup ramekins; coat with sugar, tapping out any excess. Using electric mixer, beat egg whites in large bowl until soft peaks form. Gradually beat in remaining 6 tablespoons sugar; continue beating until stiff but not dry. Fold egg whites into ricotta mixture. Spoon batter into ramekins; smooth tops. Run thumb 1/4 inch deep around inside edge of each soufflé dish to wipe clean. do ahead Can be made 4 hours ahead. Cover and chill.",
        "Preheat oven to 350°F. Bake soufflés until puffed and golden at edges, about 28 minutes (about 32 minutes if chilled). Serve immediately with blackberry compote."
    ],
    "ingredients": [
        "1 cup plus 6 tablespoons sugar, divided",
        "1 tablespoon cornstarch",
        "2 tablespoons plus 1 teaspoon all purpose flour",
        "4 large egg yolks",
        "1 1/2 teaspoons finely grated lemon peel",
        "1 cup whole milk",
        "1 cup fresh ricotta cheese",
        "2 cups frozen blackberries (about 1/2 pound)",
        "1/4 cup sweet vermouth",
        "3 tablespoons fresh lemon juice",
        "6 large egg whites"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Ricotta",
        "Blackberry",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ricotta Soufflés with Blackberry Compote",
    "url": "http://www.epicurious.com/recipes/food/views/ricotta-souffles-with-blackberry-compote-351054"
}
