{
    "directions": [
        "1. Preheat oven to 400°F.",
        "2. Place the flour, salt, and olive oil in a large bowl and work it with your hands until the oil is incorporated and the mixture resembles crumbs.",
        "3. Add the egg mixture and toss until the dough comes together in a dry mass. (Add another tablespoon or two of water, if needed.) Knead until just smooth.",
        "4. Flatten the dough into a disc; set aside.",
        "5. In a large bowl, combine all the filling ingredients except 1 tablespoon of the eggs and 1 tablespoon of the pecorino.",
        "6. Line the bottom and sides of a 9-inch-diameter pie dish with 2/3 of the dough (rolled out 1/8 inch thick), allowing for a 1-inch overhang.",
        "7. Scrape the filling into the dish and top with the remaining 1/3 of the dough (rolled out to the same thickness). Press the edges together to seal, and cut slits in the top crust.",
        "8. Brush with the reserved egg and sprinkle with the reserved cheese.",
        "9. Bake for 10 minutes, then reduce heat to 350°F and bake until the top has puffed out, about 1 hour more.",
        "10. Let cool 15 minutes before removing from the dish. Serve warm or at room temperature."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1 tablespoon kosher salt",
        "6 tablespoons olive oil",
        "2 eggs, beaten and mixed with 6 tablespoons water",
        "5 eggs, beaten",
        "1/2 cup grated pecorino",
        "1 pound ricotta, excess liquid drained",
        "1 cup salami, such as sopressata, sliced or cut into 1/2-inch cubes",
        "1 cup shredded mozzarella (or mild cheddar or Gouda)",
        "1/2 teaspoon freshly ground black pepper",
        "2 tablespoons chopped Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Egg",
        "Breakfast",
        "Bake",
        "Kid-Friendly",
        "Dinner",
        "Mozzarella",
        "Ricotta",
        "Fall",
        "Winter",
        "Cookie",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Ricotta Pizza Pie",
    "url": "http://www.epicurious.com/recipes/food/views/ricotta-pizza-pie-240223"
}
