{
    "directions": [
        "Set large strainer lined with double-layer damp cheesecloth over large bowl. Place ricotta in prepared strainer; cover with plastic and refrigerate overnight. (If using fresh ricotta, skip this step.)",
        "Cook leek in small pot of boiling salted water until tender, about 7 minutes. Drain. Rinse under cold water; drain. Using hands, squeeze leek dry.",
        "Mix ricotta, leek, egg, 1/2 cup Parmesan, salt, pepper, and nutmeg in bowl. Stir in 2/3 cup flour. Cover and chill mixture at least 1 hour and up to 1 day. Line rimmed baking sheet with parchment paper. Place flour for dredging in flat bowl. For each gnocchi, shape 1 tablespoon ricotta mixtureinto ball, then drop into bowl of flour, tossing to coat. Transfer gnocchi to baking sheet. (Can be made 4 hours ahead. Cover with plastic wrap; chill.)",
        "If using fresh fava beans, blanch in small saucepan of boiling salted water for 2 minutes; transfer to bowl of ice water. Peel beans.",
        "Melt butter in large nonstick skillet over medium heat. Add fava beans and sage leaves. Sauté until butter browns, favas are tender, and sage leaves are crisp, about 5 minutes. Set aside.",
        "Bring large pot of salted water to boil. Working in 2 batches, add gnocchi and cook until tender and cooked through, about 5 minutes. Using slotted spoon, transfer to skillet with fava beans; toss to coat. When all gnocchi have been added to skillet, toss over medium heat to warm. Serve with Parmesan."
    ],
    "ingredients": [
        "1 15- to 16-ounce container whole-milk ricotta cheese or 15 ounces fresh whole-milk ricotta cheese",
        "1 small leek (white and pale green parts only), halved lengthwise, thinly sliced crosswise",
        "1 large egg",
        "1/2 cup freshly grated Parmesan cheese, plus additional for serving",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/8 teaspoon ground nutmeg",
        "2/3 cup all purpose flour, plus additional for dredging",
        "1 cup shelled fresh fava beans or frozen double-peeled, thawed",
        "1/2 cup (1 stick) butter",
        "12 fresh sage leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Vegetable",
        "Sauté",
        "Vegetarian",
        "Ricotta",
        "Leek",
        "Spring"
    ],
    "title": "Ricotta Gnocchi with Leeks and Fava Beans",
    "url": "http://www.epicurious.com/recipes/food/views/ricotta-gnocchi-with-leeks-and-fava-beans-232095"
}
