{
    "directions": [
        "Preheat oven to 350°F.",
        "Pulse flour, sugar, salt, and butter in a food processor until mixture resembles coarse meal. Add yolk, vanilla, and lemon juice and pulse just until mixture begins to form a dough. Spread dough with a small offset spatula or back of a spoon over buttered bottom of a 24-centimeter springform pan and prick all over with a fork. Chill 30 minutes.",
        "Bake crust in a shallow baking pan (to catch drips) in middle of oven until golden brown, about 25 minutes, and cool on a rack.",
        "Increase temperature to 375°F.",
        "Discard liquid and cheesecloth and force drained ricotta through sieve into bowl. Beat yolks and sugar with an electric mixer until thick and pale, then beat in ricotta, flour, and zests. Beat whites with salt in another bowl until they hold soft peaks, and fold into ricotta mixture.",
        "Butter side of springform pan and pour filling over crust (pan will be completely full). Bake in baking pan in middle of oven until cake is puffed and golden and a tester inserted 1 inch from center comes out clean, about 1 hour.",
        "Run a knife around top edge of cake to loosen and cool completely in springform pan on rack. Chill, loosely covered, at least 4 hours. Remove side of pan and transfer cake to a plate. Bring to room temperature before serving."
    ],
    "ingredients": [
        "1/2 cup all-purpose flour",
        "2 tablespoons sugar",
        "1/2 teaspoon salt",
        "5 tablespoons cold unsalted butter, cut into bits",
        "1 large egg yolk",
        "1/2 teaspoon vanilla",
        "1/2 teaspoon fresh lemon juice",
        "2 lb whole-milk ricotta, drained in a cheesecloth-lined sieve set over a bowl at least 6 hours, chilled",
        "6 large eggs, separated",
        "3/4 cup sugar",
        "3 tablespoons all-purpose flour",
        "Finely grated zest of 1 lemon",
        "Finely grated zest of 1 orange",
        "1/8 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Cheese",
        "Egg",
        "Dessert",
        "Bake",
        "Ricotta",
        "Gourmet"
    ],
    "title": "Ricotta Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/ricotta-cheesecake-102594"
}
