{
    "directions": [
        "Preheat oven to 375°F with rack in middle. Generously butter tart pan.",
        "Pulse flour, sugar, and salt in a food processor until combined. Add butter and zest and pulse until mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Add yolk, vanilla, and water and pulse until just incorporated and dough begins to form large clumps.",
        "Turn out dough onto a work surface and divide into 4 pieces. Smear each piece once with heel of your hand in a forward motion to help distribute fat. Gather dough together using scraper and form into a ball, then flatten into a rectangle.",
        "Press dough over bottom and up sides of pan in an even layer with well-floured fingers. Chill shell 45 minutes.",
        "Lightly prick shell all over with a fork, then line with foil and fill with pie weights. Bake shell until sides are set and edge is golden, about 20 minutes. Carefully remove weights and foil and bake until shell is golden all over, about 15 minutes more. Cool shell completely in pan on a rack. (Leave oven on.)",
        "Beat together cream cheese, sugar, and cinnamon in a bowl with an electric mixer at medium-high speed until light and fluffy, about 2 minutes. Reduce speed to low and mix in ricotta, whole egg and egg white, and salt until just combined.",
        "Pour filling into cooled tart shell and bake until slightly puffed along edges and just set in center, about 15 minutes. (Center will tremble when tart is gently shaken.) Transfer to a rack and cool completely. Loosely cover tart with plastic wrap and chill until filling is firm, at least 8 hours.",
        "Bring water, wine, sugar, vanilla bean (if using), and zest to a boil in a heavy medium saucepan over medium heat, stirring until sugar has dissolved. Stir figs into syrup and simmer, uncovered, until tender, about 5 minutes. Transfer figs with a slotted spoon to a bowl. Stir apricots into syrup and simmer until tender, about 3 minutes. Transfer apricots with slotted spoon to bowl with figs. Stir cherries into syrup and simmer until just tender, about 1 minute, then add to fruit using slotted spoon.",
        "Boil syrup until reduced to about 1 cup, about 12 minutes. Discard lemon zest and vanilla bean (if using; if using extract, stir in now), then pour syrup over fruit and cool to room temperature. Serve compote with tart."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "3 tablespoons sugar",
        "1/2 teaspoon salt",
        "1 stick cold unsalted butter, cut into 1/2-inch cubes",
        "1 teaspoon grated lemon zest",
        "1 large egg yolk",
        "1/2 teaspoon pure vanilla extract",
        "1 tablespoon water",
        "3 ounces cream cheese, softened",
        "1/4 cup sugar",
        "1/8 teaspoon cinnamon",
        "3/4 pound ricotta (preferably fresh)",
        "1 large egg plus 1 large egg white, lightly beaten",
        "1/8 teaspoon salt",
        "2 1/2 cups water",
        "2 1/2 cups dry white wine",
        "1/2 cup plus 2 tablespoons sugar",
        "1/2 vanilla bean, split lengthwise",
        "3 (3- by 1/2-inch) strips of lemon zest",
        "1 cup dried Calmyrna figs (5 ounces), trimmed, halved lengthwise if large",
        "1/2 cup dried California apricots (3 1/2 ounces)",
        "1/4 cup dried sour cherries (3 ounces)",
        "Equipment: a 14- by 4-inch rectangular tart pan with removable bottom; a pastry or bench scraper; pie weights or dried beans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mixer",
        "Cheese",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Ricotta",
        "Dried Fruit",
        "Fig",
        "Apricot",
        "Fall",
        "Winter",
        "Chill",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ricotta Tart with Dried-Fruit Compote",
    "url": "http://www.epicurious.com/recipes/food/views/ricotta-tart-with-dried-fruit-compote-240564"
}
