{
    "directions": [
        "Bring a large pot of salted water to a boil.",
        "Combine the ricotta cheese, Parmesan, olive oil, eggs and 1 teaspoon salt with a whisk in a large mixing bowl. Add the all-purpose flour in 3 parts, stirring with a rubber spatula.",
        "Bring the dough together in a ball and cut off one-quarter of it. Dust the work surface with all-purpose flour to prevent sticking, and roll the cut-off piece of dough into a dowel shape about 5/8 inch in diameter. Cut the dowel into 5/8-inch pieces. Dust some parchment paper with semolina flour and place the gnocchi on it to prevent sticking. Repeat with the rest of the dough, quarter by quarter.",
        "Cook the gnocchi in the boiling water for 2 minutes. Serve tossed with a bit of the Pancetta Tomato Sauce. Alternatively, you can freeze the uncooked gnocchi for up to 2 weeks.",
        "Heat a large saute pan over medium-high heat. Add the pancetta and cook until the fat has rendered and the pancetta is crisp, about 5 minutes. Remove the pancetta from the pan and reserve, leaving the fat behind.",
        "Add the diced onions to the hot pan and season with salt and pepper. Cook until the onions have softened, about 5 minutes. Add the garlic and cook 1 minute more. Add the crushed tomatoes, cover and bring to a simmer. Cook for 20 minutes, then remove the lid, add the reserved pancetta and cook an additional 10 minutes. Season with additional salt and pepper, stir in the basil and serve."
    ],
    "ingredients": [
        "Kosher salt",
        "2 cups ricotta cheese",
        "1/2 cup grated Parmesan",
        "1 1/2 tablespoons extra-virgin olive oil",
        "2 large eggs",
        "1 1/4 cups all-purpose flour, plus more for dusting",
        "Semolina flour, for dusting",
        "Pancetta Tomato Sauce, recipe follows, for serving",
        "6 ounces thick-cut pancetta (about 3 1/4-inch slices), diced",
        "1/2 cup diced onions",
        "Kosher salt and freshly ground black pepper",
        "2 cloves garlic, minced",
        "One 28-ounce can crushed San Marzano tomatoes",
        "5 fresh basil leaves, cut into chiffonade"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sauce Recipes",
        "Gnocchi",
        "Tomato",
        "Vegetable",
        "Cheese",
        "Ricotta",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Ricotta Gnocchi",
    "url": "http://www.foodnetwork.com/recipes/geoffrey-zakarian/ricotta-gnocchi"
}
