{
    "directions": [
        "Place wheat berries into a bowl, cover with water, and soak for 3 days, changing water 2 or 3 times per day. Drain and place wheat berries into a saucepan; pour in milk to cover. Stir 3/4 cup confectioners' sugar, orange zest, 1  teaspoon vanilla extract, and a pinch of salt into wheat and milk. Bring to a boil, reduce heat to low, and simmer until wheat berries are tender, about 1 hour. Refrigerate.",
        "Sift flour, 3/4 cup confectioners' sugar, baking powder, and 1 pinch of salt together in a bowl; cut butter into flour mixture, using a pastry cutter, until butter forms small lumps. Make a well in flour mixture and pour 3 beaten eggs into the well; add 1 tablespoon vanilla extract and 1 tablespoon anisette liqueur to eggs. Stir together to make a smooth dough. Refrigerate at least 1 hour.",
        "Move a rack into low position in oven and preheat oven to 350 degrees F (175 degrees C). Generously grease and flour the 8x8-inch cake pans.",
        "Divide dough into fourths; roll each piece out onto a floured work surface to make a thin 12x12-inch dough square. Fit dough into a prepared cake pan. Repeat with remaining dough to make 4 crusts.",
        "Beat ricotta cheese with 12 eggs in a large bowl until mixture is smooth and creamy. Add 1 cup of soaked wheat berries, pineapple preserves, 1 1/2 cup confectioners' sugar, heavy cream, dried mixed fruit, white sugar, 1/4 cup anisette liqueur, 1 tablespoon vanilla extract, and 1 pinch of salt. Stir to combine thoroughly and divide ricotta filling into each crust.",
        "Bake cakes on the bottom rack of the preheated oven for 15 minutes; reduce heat to 225 degrees F (105 degrees C) and bake for 1 hour and 15 minutes. Turn off heat and let cakes cool in the oven with the door open, about 30 minutes. Let cakes cool to room temperature, then chill at least 2 hours (up to overnight). Sprinkle each cake with about 1 1/2 teaspoon confectioners' sugar, or to taste, before slicing."
    ],
    "ingredients": [
        "3/4 cup wheat berries (optional)",
        "2 cups whole milk, or as needed to cover",
        "3/4 cup confectioners' sugar",
        "1 orange, zested",
        "1 teaspoon vanilla extract",
        "1 pinch salt",
        "2 1/2 cups all-purpose flour",
        "3/4 cup confectioners' sugar",
        "1 1/2 teaspoons baking powder",
        "1 pinch salt",
        "1/2 cup unsalted butter at room temperature",
        "3 large eggs, beaten",
        "1 tablespoon vanilla extract",
        "1 tablespoon anisette liqueur",
        "4 8x8-inch disposable aluminum cake pans",
        "3 pounds ricotta cheese at room temperature",
        "12 large eggs at room temperature",
        "1 (12 ounce) jar pineapple preserves",
        "1 1/2 cups confectioners' sugar",
        "1 cup heavy whipping cream at room temperature",
        "1 cup chopped dried mixed fruit",
        "3/4 cup white sugar",
        "1/4 cup anisette liqueur, or more to taste",
        "1 tablespoon vanilla extract",
        "1 pinch salt",
        "2 tablespoons confectioners' sugar for dusting, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ricotta Easter Cake",
    "url": "http://allrecipes.com/recipe/231661/ricotta-easter-cake/"
}
