{
    "directions": [
        "Beat the 12 eggs, 2 cups sugar and vanilla extract together in a large bowl. Stir in the ricotta cheese and the chocolate chips, if using (see Cook's Note). Set aside.",
        "Combine the flour, baking powder, and 1 cup sugar together. Cut in 1/2 cup plus 1 tablespoon shortening until the mixture resembles coarse crumbs. Mix in 4 beaten eggs and 1 teaspoon vanilla extract. Divide dough into 4 balls, wrap in plastic, and chill for at least 30 minutes.",
        "Preheat oven to 325 degrees F (165 degrees C). Grease two deep-dish pie plates.",
        "Roll out 2 of the balls to fit into the pie pans. Do not make the crust too thick, as it will expand during cooking. Do not flute the edges of the dough. Roll out the other 2 balls of dough and cut each into 8 narrow strips for the top of the crust. (Alternately, you can use cookie cutters and place the cutouts on the top of the pies.)",
        "Pour the ricotta filling evenly into the pie crusts. Top each pie with 8 narrow strips of dough or cookie cut-outs. Brush top of pie with milk for shine, if desired. Place foil on the edge of crust.",
        "Bake in preheated oven for 20 to 30 minutes; remove foil. Rotate pies on the rack so they will bake evenly. Continue to bake until a knife inserted in the center of each pie comes out clean, 25 to 30 minutes more. Cool completely on wire racks. Refrigerate until serving."
    ],
    "ingredients": [
        "Pie Filling:",
        "12 eggs",
        "2 cups white sugar",
        "2 teaspoons vanilla extract",
        "3 pounds ricotta cheese",
        "1/4 cup miniature semisweet chocolate chips, or to taste (optional)",
        "Sweet Crust:",
        "4 cups all-purpose flour",
        "5 teaspoons baking powder",
        "1 cup white sugar",
        "1/2 cup shortening, chilled",
        "1 tablespoon shortening, chilled",
        "4 eggs, lightly beaten",
        "1 teaspoon vanilla extract",
        "1 tablespoon milk (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ricotta Pie (Old Italian Recipe)",
    "url": "http://allrecipes.com/recipe/9328/ricotta-pie-old-italian-recipe/"
}
