{
    "directions": [
        "To make the beef ragu, in a large pot over medium heat, warm the olive oil. Add the pancetta and beef brisket and cook, stirring occasionally, until the meat is cooked and browned bits stick to the bottom of the pot, 8 to 10 minutes. If the drippings on the bottom of the pot become too dark or look like they will burn, lower the heat.",
        "Using a slotted spoon, transfer the meat to a bowl, leaving about 3 Tbs. fat in the pot and discarding any excess. Add the onion, garlic, bay leaves and red pepper flakes and sauté over medium heat until the onion is translucent but not brown, about 4 minutes. The moisture from the onion will help deglaze the pan (dislodge the brown bits). Add the tomato paste and cook until the tomato caramelizes (it will begin to stick to the bottom of the pot and turn dark red), 4 to 6 minutes. If the tomato paste gets too dark, lower the heat. Add the wine, increase the heat to medium-high and bring to a simmer. Use a wooden spoon to scrape up the browned bits from the bottom of the pot and simmer until the wine has almost completely evaporated, 5 to 7 minutes.",
        "Add the 2 1/2 quarts (2.5 l) stock and bring to a gentle simmer. Return the meat to the pot, reduce the heat to medium-low and simmer gently—the liquid should bubble lazily—until the meat has become tender and the sauce has gradually reduced and become rich. Be patient; this will take about 3 hours. Be careful not to let the sauce boil. If the sauce becomes too thick, add up to 1/2 cup (120 ml) additional stock. Season lightly with salt and black pepper and discard the bay leaves.",
        "(To store, transfer the sauce to an airtight container and refrigerate for up to 2 days or freeze for up to 1 month. To thaw, place in the refrigerator overnight or until fully thawed.)",
        "Meanwhile, make the gnocchetti: In a large bowl, combine the ricotta, Parmigiano-Reggiano, egg, melted butter and a few gratings of nutmeg. Add the 3/4 cup (125 g) plus 2 Tbs. all-purpose flour and mix with your hands just until combined. The dough should be slightly sticky and wet. Do not overmix, as this will make the gnocchetti tough.",
        "Dust 1/4 cup (30 g) all-purpose flour on a work surface, then scrape the dough from the bowl directly on top of the flour. Sprinkle the top of the dough with an additional 1/4 cup (30 g) all-purpose flour. This will help prevent the dough from being too sticky to roll.",
        "Line 2 baking sheets with parchment paper and dust with semolina flour. Cut off a chunk of dough, about 1/4 cup (25 g), and cover the rest with plastic wrap. On a work surface lightly dusted with all-purpose flour, use your hands to roll the chunk into a log about 1/4 inch (6 mm) in diameter. Cut the log into 1/2-inch (12-mm) pieces. Put the gnocchetti on the prepared baking sheets and shape the remaining dough. Make sure that the gnocchetti don’t touch or they will stick together.",
        "(To store, refrigerate the gnocchetti on the baking sheets, covered with plastic wrap, for up to 2 days, or freeze on the baking sheets and transfer to an airtight container. Use within 1 month. Do not thaw before cooking.)",
        "When ready to serve, bring a large pot filled with generously salted water to a simmer over medium-high heat. Add the gnocchetti and simmer until they float to the surface, 1 to 3 minutes. Remove immediately with a slotted spoon.",
        "For each serving, in a sauté pan over medium heat, warm about 1/2 cup (120 ml) of the ragu and add 1 1/2 tsp. to 1 Tbs. butter per serving, depending on how naughty you feel. Gently simmer until the bubbles get large and the sauce is not watery along the edges of the pan, about 4 minutes. Add the cooked gnocchetti and simmer for 1 minute to let the dumplings absorb the flavor of the sauce. Top with grated Parmigiano-Reggiano and season with salt and pepper. Serve immediately. Serves 6.",
        "Adapted from",
        "Pasta by Hand,",
        "by Jenn Louis (Chronicle Books, 2015)"
    ],
    "ingredients": [
        "1/3 cup (120 ml) extra-virgin olive oil",
        "3 oz. (85 g) pancetta or prosciutto, finely chopped",
        "2 1/4 lb. (1 kg) ground beef brisket",
        "1 yellow onion, diced",
        "2 garlic cloves, thinly sliced",
        "2 bay leaves",
        "1/2 tsp. red pepper flakes",
        "1/2 cup (140 g) tomato paste",
        "3/4 cup (180 ml) red wine",
        "2 1/2 quarts (2.5 l) chicken stock, plus more as needed",
        "Kosher salt and freshly ground black pepper to taste",
        "2 cups (480 g) whole-milk ricotta cheese",
        "1/4 cup (25 g) finely grated Parmigiano-Reggiano cheese",
        "1 egg",
        "1 Tbs. unsalted butter, melted",
        "Freshly grated nutmeg to taste",
        "3/4 cup (125 g) plus 2 Tbs. all-purpose flour, plus more for dusting",
        "Semolina flour for dusting",
        "Unsalted butter for serving",
        "Grated Parmigiano-Reggiano cheese for serving",
        "Kosher salt and freshy ground pepper"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Ricotta Gnocchetti with Beef Ragu",
    "url": "http://www.williams-sonoma.com/recipe/ricotta-gnocchetti-with-beef-ragu.html"
}
