{
    "directions": [
        "Line medium bowl with several layers of paper towels. Spoon ricotta cheese into bowl. Let drain at least 30 minutes and up to 1 hour.",
        "Beat egg, 1/3 cup Pecorino Romano cheese, salt, and white pepper in large bowl to blend. Mix in ricotta. Sprinkle 3/4 cup flour over and stir gently to blend. Cover and chill dough 1 hour. Do ahead Can be made 1 day ahead. Keep chilled.",
        "Line rimmed baking sheet with plastic wrap. Place some flour in bowl. For each gnudi, gently roll 1 heaping teaspoonful of dough into ball. Add to flour; toss to coat lightly, shaping into short log. Place on baking sheet. Do ahead Can be made 4 hours ahead. Cover; chill.",
        "Heat 1 tablespoon oil in large pot or extra-large skillet over medium-high heat. Add 3 prosciutto slices. Cook until beginning to brown, about 2 minutes per side. Transfer to paper towels. Repeat with remaining prosciutto. Add whole sage leaves to pot; sauté until crisp, about 1 minute per side. Transfer to paper towels.",
        "Heat remaining 4 tablespoons oil in same pot over medium-high heat. Add all mushrooms, shallots, thyme, and chopped sage. Sauté until mushrooms brown and liquids evaporate, about 12 minutes. Transfer mixture to bowl. Add broth to same pot and boil until slightly reduced, scraping up browned bits, about 7 minutes. Remove from heat. Add 1 teaspoon truffle oil and mushroom mixture. Season to taste with salt and pepper. do ahead Sauce can be made 2 hours ahead. Let stand at room temperature.",
        "Cook gnudi in large pot of boiling salted water until very tender, about 8 minutes.",
        "Meanwhile, rewarm sauce. Add butter; toss until blended. Using strainer, transfer gnudi to pot with sauce. Toss over medium heat until sauce coats gnudi. Season with salt and pepper.",
        "Transfer to large shallow bowl. Crumble prosciutto over. Top with sage leaves; serve with additional Pecorino."
    ],
    "ingredients": [
        "1 pound fresh ricotta cheese*",
        "1 large egg",
        "1/3 cup finely grated Pecorino Romano cheese (about 1 ounce) plus additional for serving",
        "1/2 teaspoon salt",
        "Large pinch of ground white pepper",
        "3/4 cup all purpose flour plus additional for coating",
        "5 tablespoons extra-virgin olive oil, divided",
        "6 thin prosciutto slices",
        "12 whole fresh sage leaves",
        "2 pounds fresh wild mushrooms (such as crimini, oyster, and stemmed shiitake), sliced",
        "2 large shallots, chopped",
        "6 fresh thyme sprigs",
        "2 teaspoons chopped fresh sage",
        "2 cups low-salt chicken broth",
        "1 teaspoon black truffle oil*",
        "1/4 cup ( 1/2 stick) chilled butter, diced",
        "*Available at some supermarkets and at specialty foods stores and Italian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Mushroom",
        "Onion",
        "Sauté",
        "Ricotta",
        "Prosciutto",
        "Sage",
        "Thyme",
        "Shallot"
    ],
    "title": "Ricotta Gnudi with Wild Mushroom and Truffle Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/ricotta-gnudi-with-wild-mushroom-and-truffle-sauce-236878"
}
