{
    "directions": [
        "Make the gelato: In a saucepan whisk together the half-and-half, the milk, the ricotta, and the sugar, add the cinnamon stick, and bring the mixture just to a boil, stirring. Remove the pan from the heat, add the zest, and let the mixture stand, covered, for 10 minutes. Force the mixture through a fine sieve set over a bowl and stir in the corn syrup and the vanilla. Chill the mixture, covered, until it is cold and freeze it in an ice-cream freezer according to the manufacturer's instructions. Pack the gelato tightly into six 1/2-cup dariole or other molds, cover each mold with plastic wrap, and freeze the gelato for 30 minutes, or until it is ready to be served.",
        "Make the blackberry sauce: In a heavy saucepan melt the sugar over moderate heat, stirring with a fork, and cook the syrup, swirling the pan occasionally, until it is a golden caramel. Working carefully and quickly, stir in the water, the blackberries, the lemon juice, and the crème de cassis (the mixture will bubble up), stirring until mixture is combined well, and cook the mixture over moderately low heat until the caramel is dissolved. Strain the mixture through a fine sieve set over a bowl, pressing hard on the solids, and chill the sauce, covered, until it is cold.",
        "Divide the sauce among 6 dessert plates, unmold the gelato, and arrange it in the center of the plates. Garnish each serving with some of the mango and the blackberries."
    ],
    "ingredients": [
        "1 1/4 cups half-and-half",
        "1 1/4 cups milk",
        "a 15- or 16-ounce container whole-milk ricotta",
        "1/2 cup sugar",
        "a 3-inch cinnamon stick",
        "a 2-inch strip of lemon zest removed with a vegetable peeler",
        "2 tablespoons light corn syrup",
        "1/4 teaspoons vanilla",
        "1 cup sugar",
        "1/4 cup water",
        "2 cups blackberries",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon crème decassis",
        "1 mango, pitted, peeled, and cut in 1/2-inch dice for garnish",
        "blackberries for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Ice Cream Machine",
        "Fruit",
        "Dessert",
        "Frozen Dessert",
        "Ricotta",
        "Blackberry",
        "Mango",
        "Summer",
        "Gourmet"
    ],
    "title": "Ricotta Gelato with Blackberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/ricotta-gelato-with-blackberry-sauce-12509"
}
