{
    "directions": [
        "Heat 3 tablespoons oil in large skillet over medium-high heat. Add onion and half of garlic; sauté 5 minutes. Add tomatoes and 3/4 cup basil. Cook 15 minutes to blend flavors, stirring often and adding water if dry. Season with salt and pepper. (Can be made 1 day ahead. Chill.)",
        "Heat 2 tablespoons oil in large saucepan over medium heat. Add remaining garlic; sauté; 1 minute. Add spinach; cook until most of liquid evaporates, stirring often, about 5 minutes. Drain and cool. Squeeze out liquid.",
        "Place spinach in processor. Add ricotta and blend well. Blend in 1/2 cup Parmesan. Season filling to taste with nutmeg, salt and pepper.",
        "Place 1 wonton wrapper on work surface. Brush edges with water. Place 1 scant tablespoon filling on 1 half. Fold diagonally in half, forming triangle. Press edges to seal. Overlap 2 ends together; press to adhere. Repeat with remaining wrappers, water and filling. Place in single layer on floured baking sheet. (Can be made 4 hours ahead. Cover with plastic; chill.)",
        "Working in batches, cook tortelloni in pot of boiling salted water until just tender but still firm to bite, stirring occasionally, about 3 minutes. Using slotted spoon, transfer to bowls.",
        "Meanwhile, bring sauce to simmer. Spoon over pasta. Sprinkle with 1/4 cup basil."
    ],
    "ingredients": [
        "5 tablespoons olive oil",
        "1 cup chopped onion",
        "12 garlic cloves, sliced",
        "6 large tomatoes, chopped (about 5 cups)",
        "1 cup chopped fresh basil",
        "1 10-ounce package spinach leaves, stems trimmed",
        "1 cup ricotta cheese",
        "1/2 cup freshly grated Parmesan cheese",
        "Ground nutmeg",
        "24 square wonton wrappers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Leafy Green",
        "Pasta",
        "Tomato",
        "Sauté",
        "Vegetarian",
        "Quick & Easy",
        "Parmesan",
        "Ricotta",
        "Winter",
        "Boil"
    ],
    "title": "Ricotta and Spinach Tortelloni in Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/ricotta-and-spinach-tortelloni-in-tomato-sauce-102856"
}
