{
    "directions": [
        "For the crust: Preheat the oven to 350 degrees F. Grease and line a baking sheet with parchment.",
        "Place the cannoli shells in a blender or food processor and pulse until crumbly. In a bowl, mix the melted butter and granulated sugar with the crumbs and press in the bottom of the prepared baking sheet. Bake for 10 minutes. Let cool.",
        "For the filling: Combine the cream cheese and granulated sugar in the bowl of a stand mixer fitted with the paddle attachment and cream together. Then add the ricotta and mix until well incorporated. Add the flour and vanilla seeds and mix. Add the eggs, one at a time, until incorporated. Add the chocolate pieces and zest and mix until just combined. Pour the batter over the baked crust and bake for 30 minutes.",
        "For the glaze: Combine the granulated sugar and orange juice in a saucepan and simmer over medium-low heat until slightly thickened, 10 to 20 minutes.",
        "Whip the heavy cream to soft peaks and whisk in the confectioners' sugar. Gently fold in the mascarpone and ricotta.",
        "Slice the cheesecake into pieces of desired size. Serve each piece with a drizzle of glaze, a dollop of cream on top and garnish with orange zest.",
        "This recipe was created by a contestant during a cooking competition. The Food Network Kitchens have not tested it for home use, therefore, we cannot make any representation as to the results."
    ],
    "ingredients": [
        "1 stick unsalted butter, melted, plus more for greasing",
        "4 cups crushed cannoli shells",
        "3 tablespoons granulated sugar",
        "Two 8-ounce packages cream cheese",
        "1 1/2 cups granulated sugar",
        "3 cups ricotta",
        "3 tablespoons all-purpose flour",
        "1 vanilla bean, scraped",
        "4 eggs",
        "1 cup bittersweet chocolate chips, chopped",
        "3 1/2 tablespoons orange zest",
        "1 cup granulated sugar",
        "Juice of 3 oranges",
        "1/2 cup heavy cream",
        "1 1/2 cups confectioners' sugar",
        "1 cup mascarpone",
        "1 cup ricotta",
        "4 tablespoons orange zest"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Cannoli",
        "Cheese",
        "Ricotta"
    ],
    "title": "Ricotta Cannoli Cheesecake",
    "url": "http://www.foodnetwork.com/recipes/ricotta-cannoli-cheesecake-recipe"
}
