{
    "directions": [
        "Place ricotta in strainer set over medium bowl. Chill until ricotta has texture of wet clay, about 1 hour.",
        "Mix ricotta, 1/2 cup flour, egg, and next 5 ingredients in medium bowl, adding more flour by tablespoonfuls until dough is slightly sticky (do not add more than 4 tablespoonfuls). Cover and chill 30 minutes.",
        "Sprinkle rimmed baking sheet generously with flour. Transfer dough to lightly floured surface. Cut into 4 equal pieces. Using hands, roll 1 piece on floured surface into 3/4-inch-wide log. Cut log crosswise into 1-inch pieces. Place gnocchi on prepared baking sheet, spacing apart. Repeat with remaining dough. Cover gnocchi with plastic wrap and chill at least 1 hour and up to 1 day.",
        "Heat olive oil in large skillet over high heat. Add mushrooms; sauté until beginning to brown, about 4 minutes. Add chopped white and pale green parts of green onions. Sauté 1 minute. Add wine; stir until almost all liquid is absorbed, about 30 seconds. Add 1/2 cup chicken broth. Stir until sauce is slightly thickened, about 1 minute. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Working in 2 batches, add gnocchi to large pot of boiling salted water, stirring to prevent sticking. Boil until gnocchi rise to surface of water, then continue boiling until cooked through, 1 1/2 to 2 minutes longer. Using slotted spoon, transfer gnocchi to skillet with mushrooms. Add sliced dark green parts of green onions.",
        "Rewarm mushrooms with gnocchi and green onions over medium heat, adding more broth by 1/4 cupfuls if dry. Remove from heat. Add 1/4 cup cheese, butter, and marjoram; stir until cheese and butter melt. Season with salt and pepper. Transfer to plates and sprinkle with additional cheese."
    ],
    "ingredients": [
        "1 pound (about 2 1/4 cups) fresh ricotta cheese",
        "1/2 cup to 3/4 cup all purpose flour",
        "1 large egg",
        "1/4 cup grated Parmesan cheese",
        "1 tablespoon butter, melted",
        "1 tablespoon extra-virgin olive oil",
        "1/2 teaspoon salt",
        "Pinch of ground black pepper",
        "2 tablespoons extra-virgin olive oil",
        "1 pound assorted wild mushrooms, cut into 1/2- to 3/4-inch pieces",
        "4 green onions; white and pale green parts finely chopped, dark green parts thinly sliced",
        "1/4 cup dry white wine",
        "1/2 cup (or more) low-salt chicken broth",
        "1/4 cup grated Parmesan cheese plus additional for sprinkling",
        "2 tablespoons butter",
        "2 tablespoons fresh marjoram leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Mushroom",
        "Pasta",
        "Sauté",
        "Dinner",
        "Ricotta",
        "Chill",
        "Potluck",
        "Boil",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ricotta Gnocchi with Mushrooms and Marjoram",
    "url": "http://www.epicurious.com/recipes/food/views/ricotta-gnocchi-with-mushrooms-and-marjoram-351042"
}
