{
    "directions": [
        "1. In a large bowl combine the ricotta, nutmeg, lemon zest, Parmigiano-Reggiano, and 1 egg. Season to taste with salt and pepper, stir well, and set aside.",
        "1. Mound the flour on a clean work surface and create a well in the center. Place the eggs, egg yolks, and oil (if using) in the center. Using a fork, whisk the eggs and oil together and slowly start dragging the flour into the egg mixture. Knead by hand until all the ingredients are well combined and the dough is smooth and elastic, about 10 minutes. (Alternatively, place all the ingredients in the bowl of a stand mixer fitted with a dough hook. With the mixer on medium speed, knead the dough until smooth and elastic, about 5 minutes.) Wrap the dough in plastic wrap or place it in a covered bowl and let it rest at room temperature for at least 30 minutes.",
        "2. Set up a pasta machine and turn it to the largest opening. Cut off pieces of dough about the size of an egg. Working with one piece of dough at a time, roll the dough into sheets about 1/8-inch thick.",
        "3. Lay 1 pasta sheet flat on a lightly floured work surface and determine approximately where the halfway point is lengthwise. Use a pastry brush to lightly wet one half of the dough with the remaining egg lightly beaten with water. Spoon mounds of the filling, about 2 teaspoons each, onto half of the wet side of the dough, leaving about a 1/2 inch between the mounds. Fold the dry half of the sheet over lengthwise to cover the filling. Press the pasta sheets together to seal the edges around the filling, and press out any excess air. Use a pastry cutter or knife to cut individual ravioli. As you cut out the ravioli, place them on a plate or baking sheet sprinkled with flour to keep them from sticking. Repeat with the remaining pasta and filling.",
        "4. Bring a large pot of salted water to a boil. Add the ravioli all at once and stir a few times to submerge and separate them. Cook, uncovered, at a gentle boil until the pasta is just tender to the bite, 2 to 3 minutes. Drain the ravioli thoroughly and serve with a desired sauce or cheese."
    ],
    "ingredients": [
        "1 pound fresh ricotta, drained if wet",
        "Pinch of freshly grated nutmeg",
        "1 teaspoon freshly grated lemon zest (from about 1/2 a lemon)",
        "1 cup freshly grated Parmigiano-Reggiano, plus more for serving",
        "1 large egg, plus 1 large egg lightly beaten with 2 tablespoons water",
        "Salt and freshly ground black pepper",
        "N/A freshly ground black pepper",
        "3 2/3 cups all-purpose flour",
        "2 large eggs",
        "2 egg yolks",
        "1 tablespoon olive oil (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta Maker",
        "Egg",
        "Kid-Friendly",
        "Parmesan",
        "Ricotta",
        "Boil"
    ],
    "title": "Ricotta-Filled Ravioli (Ravioli di Ricotta)",
    "url": "http://www.epicurious.com/recipes/food/views/ricotta-filled-ravioli-ravioli-di-ricotta-51112640"
}
