{
    "directions": [
        "Whisk 1/4 cup water and cornstarch in small bowl. Melt butter in medium nonstick skillet over medium heat. Add cherries, 1/4 cup water, and brown sugar; stir until sugar dissolves. Increase heat to medium-high; add cornstarch mixture and stir until mixture boils and thickens, adding water by tablespoonfuls if sauce is very thick, about 1 minute. Remove from heat; stir in lemon juice.",
        "Whisk flour, sugar, baking powder, and salt in small bowl. Using electric mixer, beat ricotta cheese and egg yolks in large bowl at medium-high speed until light and fluffy, about 1 minute. Reduce mixer speed to low; add flour mixture alternately with milk in 2 additions each, beating just until blended and scraping down sides of bowl as needed.",
        "Using electric mixer fitted with clean beaters, beat egg whites in medium bowl until stiff but not dry. Fold 1/4 of whites into ricotta mixture to lighten, then fold in remaining whites in 3 more additions.",
        "Heat griddle or large nonstick skillet over medium heat; brush griddle lightly with oil. Drop batter by generous 1/4 cupfuls onto griddle; spread each pancake with offset spatula to form 3 1/2-inch round. Cook until bubbles form on tops of pancakes and bottoms are golden, about 3 minutes. Turn pancakes over and cook until golden brown on bottoms, about 2 minutes.",
        "Transfer pancakes to plates. Top with cherry sauce and yogurt, if desired, and serve."
    ],
    "ingredients": [
        "1/2 cup (or more) water, divided",
        "2 teaspoons cornstarch",
        "1 tablespoon unsalted butter",
        "2 cups halved pitted fresh Bing cherries or other dark sweet cherries (about 14 ounces unpitted cherries)",
        "2 tablespoons (packed) golden brown sugar",
        "1 tablespoon fresh lemon juice",
        "3/4 cup unbleached all purpose flour",
        "2 tablespoons sugar",
        "1/2 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1 1/3 cups whole-milk ricotta cheese",
        "4 large egg yolks",
        "1/2 cup whole milk",
        "3 large egg whites",
        "Vegetable oil (for brushing)",
        "Plain Greek-style yogurt or plain regular yogurt (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Breakfast",
        "Brunch",
        "Vegetarian",
        "Kid-Friendly",
        "Low Cal",
        "High Fiber",
        "Father's Day",
        "Ricotta",
        "Cherry",
        "Summer",
        "Pan-Fry",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Ricotta Pancakes with Brown Sugar-Cherry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/ricotta-pancakes-with-brown-sugar-cherry-sauce-242515"
}
