{
    "directions": [
        "Preheat oven to 400°F with racks in middle and lower third.",
        "Cook garlic in oil in a small heavy skillet over medium-low heat, stirring occasionally, until pale golden, 2 to 3 minutes. Transfer to a bowl and stir in ricotta, eggs, parmesan, herbs, 1/2 teaspoon salt, and 1/4 teaspoon pepper.",
        "Cut out backbones from chickens with kitchen shears (freeze bones for making stock if desired). Pat chickens dry, then spread flat, skin sides up, on a cutting board. Cut a 1/2-inch slit on each side of chicken in center of triangle of skin between thigh and breast (near drumstick), then tuck knob of each drumstick thourough slit.",
        "Sprinkle each chicken with 3/4 teaspoon salt and 1/2 teaspoon pepper and spread chickens flat, skin sides up, in an oiled large (17- by 12-inch) shallow baking pan. Gently slide your finger between skin and flesh of breast and legs of 1 chicken to loosen skin (be careful not to tear skin). Using a small spoon, slide 2/3 cup ricotta mixture under skin, using a finger on outside of skin to spread filling over meat of breast, thighs, and drumsticks. Tuck wing tips under. Stuff second chicken in same manner. Brush skin of chickens all over with oil (2 tablespoons) and sprinkle each with 3/4 teaspoon salt and 1/2 teaspoon pepper.",
        "Spoon remaining filling into an oiled 1-quart shallow baking dish (10 by 7 inches).",
        "Bake chickens in middle of oven 30 minutes, then put dish of stuffing in oven on lower rack. Continue baking until chicken is just cooked thourough and an instant-read thermometer inserted into thickest part of a thigh (through stuffing; do not touch bone) registers 170°F and until gratin is puffed and golden, about 30 minutes more. Let chickens stand 10 minutes, then cut each into quarters. Serve with gratin."
    ],
    "ingredients": [
        "4 garlic cloves, minced",
        "3 tablespoons extra-virgin olive oil",
        "4 cups whole-milk ricotta (preferably fresh; 2 pounds)",
        "2 large eggs, lightly beaten",
        "1 cup grated Parmigiano-Reggiano (2 ounces)",
        "1/4 cup chopped fresh oregano",
        "1/4 cup chopped fresh flat-leaf parsley",
        "2 whole chickens (each about 3 1/2 pounds)",
        "2 tablespoons extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Herb",
        "Roast",
        "Parmesan",
        "Ricotta",
        "Summer",
        "Gourmet"
    ],
    "title": "Ricotta-and-Herb-Stuffed Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/ricotta-and-herb-stuffed-chicken-238929"
}
