{
    "directions": [
        "Heat 1 tablespoon of the olive oil in a large saucepan over medium heat. Add garlic, and cook until fragrant and lightly browned. Pour in the crushed tomatoes and tomato sauce. Season with Italian seasoning, salt, sugar, and pepper. Simmer covered over medium-low heat for 30 minutes, stirring occasionally. Remove from heat and set aside.",
        "Preheat the oven to 400 degrees F (200 degrees C). In a large shallow dish, stir together the bread crumbs and flour. In a separate dish, whisk together the eggs and cream with a fork.",
        "Heat the remaining olive oil in a large skillet over medium-high heat. Dip each eggplant slice into the egg mixture, then coat with breadcrumbs. Fry each slice until golden brown in the hot oil, turning once. Drain on paper towels.",
        "Spread a thin layer of the marinara sauce in the bottom of a 9x13 inch baking dish. In a large bowl, stir together the ricotta cheese, mozzarella cheese, Parmesan cheese and parsley. Spread 2 to 3 tablespoons of the cheese mixture onto one side of each slice of eggplant. Roll up, and place in the baking dish seam side down. Spoon the remaining tomato sauce over the rolls. Cover the baking dish with a lid or aluminum foil.",
        "Bake for 30 minutes in the preheated oven. Garnish with additional chopped parsley before serving if desired."
    ],
    "ingredients": [
        "1/2 cup vegetable oil, divided",
        "4 cloves garlic, minced",
        "1 (28 ounce) can crushed tomatoes in puree",
        "1 (10 ounce) can tomato sauce",
        "2 tablespoons Italian seasoning",
        "1 teaspoon salt",
        "1 teaspoon white sugar",
        "1/2 teaspoon ground black pepper",
        "2 cups plain dried bread crumbs",
        "1 cup all-purpose flour",
        "2 eggs",
        "1/4 cup heavy cream",
        "2 large eggplants, peeled and sliced lengthwise into 1/4 inch slices",
        "1 (15 ounce) container ricotta cheese",
        "2 cups shredded mozzarella cheese",
        "1/2 cup grated Parmesan cheese",
        "3/4 cup chopped fresh parsley",
        "fresh parsley, for garnish (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ricotta Eggplant Rolls",
    "url": "http://allrecipes.com/recipe/53118/ricotta-eggplant-rolls/"
}
