{
    "directions": [
        "Heat 2 tablespoons olive oil in heavy large skillet over medium heat. Add minced shallot and 1 minced garlic clove and sauté until tender, about 5 minutes. Increase heat to high, add all mushrooms, and sauté until tender, about 5 minutes. Transfer mushroom mixture to bowl.",
        "Heat remaining 2 tablespoons olive oil in same skillet over medium heat. Add onion, sliced shallot, and remaining 2 garlic cloves; sauté until tender, about 5 minutes. Add diced tomatoes with juices and white wine and simmer 10 minutes. Stir in mushroom mixture and 1/4 cup fresh basil. Remove from heat. Season sauce to taste with salt and pepper; cover to keep warm. (Mushroom sauce can be prepared 1 day ahead. Cover and refrigerate. Rewarm mushroom sauce before continuing.)",
        "Cook pasta in heavy large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain well. Return pasta to pot. Add mushroom sauce to pasta and toss to coat. Add vegetable stock and 1/4 cup Parmesan cheese, tossing to coat. Transfer to bowl; sprinkle sun-dried tomatoes and remaining 1/4 cup basil over. Serve, passing additional Parmesan cheese separately."
    ],
    "ingredients": [
        "4 tablespoons olive oil",
        "1 large shallot, minced (about 1/4 cup), plus 1 shallot, sliced",
        "3 garlic cloves, minced",
        "4 ounces shiitake mushrooms, stemmed, caps thinly sliced",
        "4 ounces oyster mushrooms, thinly sliced",
        "4 baby portobello mushrooms (about 4 ounces), stemmed, gills scraped, thinly sliced",
        "4 ounces button mushrooms, thinly sliced",
        "3/4 cup chopped onion",
        "1 28-ounce can diced tomatoes in juice",
        "1/2 cup dry white wine",
        "1/2 cup chopped fresh basil",
        "12 ounces rigatoni",
        "3/4 cup vegetable stock or canned vegetable broth",
        "1/4 cup grated Parmesan cheese",
        "1/4 cup drained oil-packed sun-dried tomatoes, thinly sliced",
        "Additional grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "Tomato",
        "Appetizer",
        "Sauté",
        "Vegetarian",
        "Summer",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rigatoni with Tomato, Basil, and Mushroom Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/rigatoni-with-tomato-basil-and-mushroom-sauce-106611"
}
