{
    "directions": [
        "Trim brussels sprouts with a paring knife, then snap off several dark outer leaves from each; set aside. Cut sprouts into quarters (or halve if very small). Starting at root end, cut half of leek into 1/2\"-thick rings, then chop remaining leek.",
        "Heat 2 Tbsp. oil in a large skillet over medium. Add brussels sprout quarters and leek rings; season with salt and pepper and cook undisturbed until deep golden brown, about 3 minutes. Toss and continue to cook, tossing occasionally, until browned all over and tender, about 3 minutes more. Transfer to a medium bowl.",
        "Set aside a little lemon zest for serving and add remaining zest along with chopped leek, garlic, and 2 Tbsp. oil to same skillet. Season with salt and pepper and cook, stirring often, until garlic and leek are golden, about 4 minutes. Add wine, bring to a boil, and cook until skillet is almost dry, about 3 minutes.",
        "Meanwhile, cook pasta in a large pot of boiling salted water until very al dente, 8–10 minutes; drain, reserving 1 cup pasta cooking liquid.",
        "Add pasta to skillet along with reserved brussels sprout leaves, brussels sprout quarters and leek rings, and 1/2 cup pasta cooking liquid; toss to combine. Bring to a simmer, then gradually add 2 oz. Parmesan, tossing constantly. Cook, shaking skillet to toss pasta and adding more pasta cooking liquid as needed, until pasta is al dente and sauce is thickened and glossy, about 3 minutes. Season with salt and pepper.",
        "Divide pasta among bowls. Top with more Parmesan and pepper and reserved lemon zest; drizzle with oil. Serve with lemon wedges for squeezing over."
    ],
    "ingredients": [
        "1 pound brussels sprouts",
        "1 large leek, white and pale-green parts only",
        "4 tablespoons olive oil, divided, plus more for serving",
        "Kosher salt, freshly ground pepper",
        "1 lemon, zest removed with a vegetable peeler, cut into very thin strips",
        "4 cloves garlic, finely chopped",
        "1/2 cup dry white wine",
        "12 ounces rigatoni",
        "2 ounces Parmesan, finely grated, plus more for serving",
        "Lemon wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Pasta",
        "Brussel Sprout",
        "Parmesan",
        "Lemon",
        "Leek",
        "Vegetarian",
        "Lunch",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rigatoni With Brussels Sprouts, Parmesan, Lemon, and Leek",
    "url": "http://www.epicurious.com/recipes/food/views/rigatoni-with-brussels-sprouts-parmesan-lemon-and-leek"
}
