{
    "directions": [
        "Heat oil in large deep skillet over medium heat. Add next 4 ingredients. sauté until onion is soft, about 6 minutes. Add tomatoes with juice. Simmer until slightly thickened, about 7 minutes. Add shredded duck, reserved vegetables, and reserved sauce to skillet. Heat through, about 2 minutes. Season with salt and pepper. DO AHEAD Can be made 1 day ahead. Cool slightly. Cover and chill ragù and duck skin separately. Rewarm ragù over medium heat before continuing.",
        "Heat large skillet over medium heat. Add duck skin; fry until crisp and most fat renders, stirring often, about 8 minutes. Transfer to paper towels to drain. Cook pasta in large pot of boiling salted water until tender but firm to bite. Drain, reserving 1 cup cooking liquid. Stir pasta into duck mixture, adding pasta cooking water by 1/4 cupfuls if dry. Season with salt and pepper. Transfer to large bowl. Sprinkle cracklings over and serve, passing cheese alongside."
    ],
    "ingredients": [
        "3 tablespoons extra-virgin olive oil",
        "1 small onion, finely chopped",
        "3 garlic cloves, sliced",
        "1 teaspoon dried oregano",
        "1/4 teaspoon crushed dried red pepper",
        "1 (28-ounce) can whole peeled tomatoes, crushed, juice reserved",
        "4 duck legs reserved from Spice-Rubbed Duck Legs Braised with Green Olives and Carrots , skin peeled off and cut into 1/2-inch squares, meat shredded",
        "1 1/2 cups vegetables reserved from Spice-Rubbed Duck Legs Braised with Green Olives and Carrots , olives pitted, vegetables chopped",
        "1/2 cup sauce reserved from Spice-Rubbed Duck Legs Braised with Green Olives and Carrots",
        "1 pound rigatoni or ziti pasta",
        "Grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Garlic",
        "Onion",
        "Pasta",
        "Tomato",
        "Vegetable",
        "Fry",
        "Sauté",
        "Dinner",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Rigatoni with Duck Ragù",
    "url": "http://www.epicurious.com/recipes/food/views/rigatoni-with-duck-ragu-237064"
}
