{
    "directions": [
        "In a kettle cook the onion and the garlic in the oil over moderately low heat, stirring occasionally, until they are softened, add the wine, and boil the mixture for 1 minute. Stir in the tomatoes with the juice, 1 tablespoon of the parsley, the basil, the oregano, the salt, and the red pepper flakes and boil the mixture, stirring occasionally, for 5 minutes, or until it is thickened. Add the shrimp and cook the mixture over moderate heat, stirring, for 4 to 5 minutes, or until the shrimp are just firm.",
        "In a large kettle of boiling salted water cook the rigatoni until it is just al dente, drain it well, and stir it into the shrimp mixture. Stir in 5 ounces of the Feta and salt and pepper to taste, transfer the mixture to a lightly oiled 4-quart shallow glass baking dish, and sprinkle the top with the remaining 1 tablespoon parsley and the remaining 2 ounces Feta. Bake the pasta in the middle of a preheated 450°F. oven for 20 minutes, or until the Feta is bubbling and the top is slightly crusty."
    ],
    "ingredients": [
        "1/2 cup finely chopped onion",
        "1 garlic clove, minced",
        "6 tablespoons olive oil",
        "1/2 cup dry white wine",
        "three 14- to 16-ounce cans plum tomatoes including the juice,  chopped coarse",
        "2 tablespoons finely chopped fresh parsley leaves (preferably  flat-leafed)",
        "1/2 teaspoon dried basil, crumbled",
        "1/2 teaspoon dried oregano, crumbled",
        "3/4 teaspoon salt",
        "dried hot red pepper flakes to taste if desired",
        "1 1/2 pounds medium shrimp (about 34), shelled, deveined if desired,  and rinsed",
        "1 pound dried rigatoni or other tubular pasta",
        "1/2 pound Feta, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Shellfish",
        "Tomato",
        "Bake",
        "Feta",
        "Shrimp",
        "White Wine",
        "Gourmet"
    ],
    "title": "Rigatoni with Shrimp in Tomato and Feta Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/rigatoni-with-shrimp-in-tomato-and-feta-sauce-11773"
}
