{
    "directions": [
        "Heat oil in heavy large pot over medium heat. Add onion; sauté until translucent, about 4 minutes. Add garlic; stir 1 minute. Add sausage; cook until browned, breaking up with back of spoon, about 5 minutes. Drain drippings from pot. Add wine, diced tomatoes with juice, and crushed tomatoes; increase heat and bring to boil. Reduce heat to low and simmer 30 minutes to blend flavors, stirring occasionally. DO AHEAD: Can be made 1 day ahead. Cool slightly. Refrigerate uncovered until cool, then cover and keep chilled. Rewarm over medium heat before continuing.",
        "Meanwhile, cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain.",
        "Stir pasta, arugula, basil, and oregano into tomato sauce. Simmer until arugula wilts, stirring often, about 2 minutes. Season with salt and pepper. Transfer to large bowl. Sprinkle with Parmesan."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 large onion, chopped",
        "3 garlic cloves, chopped",
        "2 pounds fresh hot Italian sausages, casings removed",
        "1/2 cup dry red wine",
        "1 28-ounce can diced tomatoes in juice",
        "1 28-ounce can crushed tomatoes with added puree",
        "8 ounces rigatoni",
        "2 cups (packed) fresh arugula, stemmed",
        "1/2 cup thinly sliced fresh basil leaves",
        "1 tablespoon chopped fresh oregano",
        "1/2 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "High Fiber",
        "Graduation",
        "Father's Day",
        "Dinner",
        "Parmesan",
        "Sausage",
        "Arugula",
        "Summer",
        "Potluck",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Rigatoni with Spicy Sausage-Tomato Sauce, Arugula, and Parmesan",
    "url": "http://www.epicurious.com/recipes/food/views/rigatoni-with-spicy-sausage-tomato-sauce-arugula-and-parmesan-242503"
}
