{
    "directions": [
        "Heat 4 tablespoons of the olive oil with the garlic in a large saucepan over medium-low heat. Once it begins to sizzle, cook, stirring occasionally, until the garlic is soft and just beginning to brown, about 6 minutes. Stir in the chile flakes, then add the tomatoes and 1 1/2 cups water. Increase the heat to high and bring the tomato sauce to a boil, crushing the tomatoes with the back of a wooden spoon. Lower the heat to maintain a simmer and cook, stirring occasionally, until reduced and thickened, about 15 minutes. Remove the pan from the heat, stir in the basil and season with salt and pepper. Let the sauce cool for 10 minutes then puree in a blender until smooth.",
        "Preheat the oven to 375 degrees F. Grease a 9-inch springform pan with the remaining 1 tablespoon olive oil and bring a large pot of generously salted water to a boil. Cook the pasta until it is slightly less than al dente, about 8 minutes. Drain the pasta, spread in a single layer on a rimmed baking sheet and toss with 1 tablespoon olive oil.",
        "Stand the rigatoni on their ends in the prepared pan until it is completely filled (you might not use all the pasta). Place the pan on a foil-lined baking sheet to catch drips. Pour the sauce over the noodles, spreading it with the back of a spoon (You might not use all the sauce.) Sprinkle the pasta with the mozzarella and Parmesan cheeses.",
        "Cover the pan with foil, doming it slightly to avoid touching the cheese. Bake for 30 minutes. Uncover the pan and continue cooking until the top is golden brown and bubbly, about 30 minutes more. Let the pasta cool for 10 minutes, then carefully remove the sides of the pan, cut into wedges and serve."
    ],
    "ingredients": [
        "6 tablespoons extra-virgin olive oil",
        "9 cloves garlic, minced",
        "1/2 teaspoon crushed red pepper flakes",
        "One 28-ounce can whole peeled tomatoes in juice",
        "One 15-ounce can whole peeled tomatoes in juice",
        "1 cup loosely-packed fresh basil leaves",
        "Kosher salt and freshly ground pepper",
        "1 pound rigatoni",
        "1 pound part-skim mozzarella, grated",
        "2/3 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pasta Recipes",
        "Cheese",
        "Mozzarella Recipes",
        "Tomato",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Rigatoni Pie",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/rigatoni-pie"
}
