{
    "directions": [
        "Remove the dough ball from the refrigerator and leave wrapped at room temperature until the dough warms to 60°F to 65°F.",
        "Line a large dinner plate with paper towels. Pour the oil into a 12-inch cast-iron skillet and have a lid and a pair of tongs nearby.",
        "Dust a work surface near the stove with semolina, then move the dough to the surface and dust the top.",
        "Press out the dough into a flat disk and roll it out into an 11-1/2-inch round.",
        "Heat the oil in the skillet over medium-high heat for about 3 minutes, until very hot with ripples covering the surface. Gently lift the dough and lower the bottom of one edge into the side of the pan closest to you, then lower the remaining dough into the pan. Cook for about 2 minutes, using tongs to check the bottom often and to rotate the dough as needed to brown evenly. If bubbles form on the top of the dough, pierce them gently with the tongs.",
        "When the bottom is golden brown, turn the dough over. Immediately sprinkle the mozzarella evenly over the surface and cover the pan. Cook for 1 to 1 1/2 minutes, until the cheese has melted and the bottom of the dough is a rich golden brown. Using the tongs, reach to the center of the pizza and transfer it to the towel-lined plate to drain briefly.",
        "Transfer the pizza to the cutting board and cut into 6 wedges. Scatter the lardo and pinches of the squacquerone evenly over the top. Drape a slice of prosciutto cotto on each slice and garnish with shavings of the pecorino."
    ],
    "ingredients": [
        "1 (8-ounce/225-gram) ball Master Dough , preferably with starter, made with Poolish",
        "Semolina, for dusting",
        "1/2 cup (112 grams) olive oil, or more as needed",
        "1-1/2 ounces (45 grams) whole-milk mozzarella cheese, shredded (1/4 cup plus 2 tablespoons)",
        "1 ounce (30 grams) thinly shaved lardo",
        "1-1/2 ounces (45 grams) squacquerone cheese",
        "6 thin slices (2 ounces/55 grams) prosciutto cotto",
        "Small piece young Pecorino Romano cheese, cold, for shaving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Garlic",
        "Kid-Friendly",
        "Dinner",
        "Lunch"
    ],
    "title": "Rimini",
    "url": "http://www.epicurious.com/recipes/food/views/rimini-51255810"
}
