{
    "directions": [
        "Cook beef suet in a large soup pot over medium heat until pieces render their fat, about 15 minutes. Discard suet solids. Add beef marrow bones, ground chuck, pork, beef short ribs, oxtail, beef shank, flank steak, onions, garlic, 1/4 cup chili powder, 2 tablespoons hot paprika, 1 1/2 teaspoon salt, 1 1/2 teaspoon black pepper, 1 1/2 teaspoon oregano, and bay leaves to the pot. Stir mixture to coat with spices; pour in 1 cup beef broth. Simmer until onion is translucent and soft, 10 to 15 minutes.",
        "Process chipotle chiles and adobo sauce in a blender until pureed; add chipotle puree, tomato sauce, diced tomatoes with green chiles, 1 more cup beef stock, and red wine to meat mixture and stir to combine. Bring to a boil, reduce heat to low, and simmer until meat is tender, 3 to 4 hours. Remove bones from mixture, let cool, and scrape meat and cartilage from bones. Chop meat and cartilage and return to chili; discard bones.",
        "Stir 1/4 cup chili powder, 2 tablespoons hot paprika, 1 1/2 teaspoon salt, 1 1/2 teaspoon black pepper, 1 1/2 teaspoon oregano, and ground cumin into chili (the 'second dump') Pour water into chili to desired thickness; to add more thickness, stir masa harina into chili. Simmer until meat is tender and flavors have blended, about 30 more minutes. Skim excess grease from chili before serving."
    ],
    "ingredients": [
        "1/2 pound beef suet, chopped",
        "1 pound beef marrow bones",
        "1 pound beef chuck, coarsely ground for chili",
        "1 pound pork shoulder steaks, chopped",
        "1/2 pound beef short ribs, cut into pieces",
        "1/2 pound beef oxtail, cut into pieces",
        "1/2 pound beef shank, cross-cut into 1-inch slices",
        "1/2 pound beef flank, cut into pieces",
        "2 yellow onions, minced",
        "1/3 cup minced fresh garlic",
        "1/4 cup chili powder (such as Mexene's®)",
        "2 tablespoons hot paprika",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons freshly ground black pepper",
        "1 1/2 teaspoons dried oregano, or more to taste",
        "3 bay leaves",
        "1 cup beef stock",
        "1/2 (7 ounce) can chipotle chiles in adobo sauce, chopped - or more to taste",
        "1 (12 ounce) can tomato sauce",
        "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®)",
        "1 cup beef stock",
        "1/2 cup red wine",
        "1/4 cup chili powder (such as Mexene's®)",
        "2 tablespoons hot paprika",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons freshly ground black pepper",
        "1 1/2 teaspoons dried oregano",
        "1 tablespoon ground cumin, or more to taste",
        "1 cup water, or as desired",
        "1 tablespoon masa harina, or to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ring of Fire Chili",
    "url": "http://allrecipes.com/recipe/231766/ring-of-fire-chili/"
}
