{
    "directions": [
        "Slice cucumbers in half lengthwise. If using Japanese cucumbers, scrape out seeds with a small spoon. Slice cucumbers into very thin half moons. Toss in a small bowl with a few pinches of salt. Let sit until salt begins to draw out water from cucumbers, about 5 minutes. Massage cucumbers to release liquid, gently at first to keep them from breaking, then more vigorously as they start to expel water. Rinse in several changes of water, squeeze out excess liquid, and place in a clean small bowl.",
        "Mash garlic and a pinch of salt on a cutting board with the side of a chef's knife to a paste. Mix into cucumbers along with both yogurts; season with salt.",
        "Mix flour, potato starch, and 2 tablespoons water in a bowl. Set slurry aside.",
        "Heat oil in a large heavy pot over medium-high. Season beef with salt and pepper. Working in 2 batches, cook beef, turning occasionally and reducing heat if needed, until browned on all sides, 6–8 minutes per batch. Add onions and apple and cook, stirring occasionally, until onions are soft, 12–15 minutes. Add mirin, ginger, and garlic and cook, stirring occasionally, until very fragrant, about 5 minutes. Add curry powder, kuro sato, garam masala, soy sauce, and broth. Bring to a boil; reduce heat and simmer until beef is almost tender, 30–40 minutes.",
        "Add squash, potato, and carrots, cover, and cook, adding water by 1/4-cupfuls if needed to keep vegetables submerged, until tender, 20–30 minutes.",
        "Submerge a small sieve into curry and whisk reserved slurry into liquid in sieve to combine. Return curry to a boil; reduce heat and simmer until thickened, 8–10 minutes. Serve over rice topped with raita."
    ],
    "ingredients": [
        "2 Japanese or Persian cucumbers",
        "Kosher salt",
        "1 garlic clove",
        "1/2 cup plain whole-milk yogurt",
        "1/2 cup plain whole-milk Greek yogurt",
        "1 tablespoon all-purpose flour",
        "1 tablespoon potato starch or cornstarch",
        "3 tablespoons vegetable oil",
        "2 pound beef chuck, cut into 1/2–1\" pieces",
        "Kosher salt, freshly ground pepper",
        "3 medium onions, chopped",
        "1 apple, peeled, grated",
        "3 tablespoons mirin",
        "1 tablespoon finely chopped peeled ginger",
        "2 garlic cloves, finely chopped",
        "3 tablespoons curry powder (such as S&B)",
        "2 tablespoons kuro sato (Japanese black sugar) or 1 tablespoon granulated sugar plus 1/2 teaspoon robust-flavored (dark) molasses",
        "1 tablespoon garam masala",
        "1 tablespoon soy sauce",
        "4 cups low-sodium chicken broth",
        "1/2 kabocha squash, peeled, seeded, cut into 1/2\" pieces",
        "1 large Yukon Gold potato, scrubbed, cut into 1/2\" pieces",
        "2 large carrots, peeled, cut into 1/2\" pieces",
        "Steamed white rice (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Potato",
        "Kid-Friendly",
        "Yogurt",
        "Cucumber",
        "Carrot",
        "Squash",
        "Healthy"
    ],
    "title": "Rintaro's Beef Curry",
    "url": "http://www.epicurious.com/recipes/food/views/rintaros-beef-curry-56389992"
}
