{
    "directions": [
        "Preheat oven to 450°F. Grease 9-inch square baking pan. Rub both sides of steak with garlic and cumin, then with 1 1/2 teaspoons oil and lime juice. Let stand while preparing peppers.",
        "Heat 1 tablespoon oil in heavy medium skillet over medium-high heat. Add onion and cook until beginning to brown, stirring frequently, about 6 minutes. Add chiles and peppers and stir until heated through. Add cream, then 3/4 cup cheese and stir until mixture thickens, about 1 minute. Add oregano. Season with salt and pepper.",
        "Heat 1 tablespoon oil in heavy large skillet over high heat. Season steak with salt and pepper. Cook until brown, about 1 1/2 minutes per side for very rare. Transfer to work surface. Halve across width, then cut against grain into thin slices.",
        "Hold 1 tortilla over gas burner on low or place on electric burner on low until heated through, about 15 seconds per side. Place tortilla on work surface. Spoon 1/4 cup pepper mixture down center of tortilla. Top with 1/4 of meat. Roll up tortilla, enclosing filling. Arrange in baking pan, seam side down. Repeat with remaining tortillas, 3/4 cup pepper mixture, and remaining meat. Spoon remaining pepper mixture over tortillas. Sprinkle with 1/2 cup cheese. Do ahead Can be assembled 2 hours ahead. Cover with foil and refrigerate.",
        "Bake uncovered (cover if burritos were refrigerated) until cheese melts, 5 to 10 minutes."
    ],
    "ingredients": [
        "8 ounces skirt or flank steak",
        "1 large garlic clove, crushed",
        "1/4 teaspoon ground cumin",
        "2 1/2 tablespoons olive oil, divided",
        "1 1/2 teaspoons fresh lime juice",
        "1 large onion, thinly sliced",
        "2 fresh Anaheim chiles, roasted, peeled, seeded, cut into thin strips, or canned whole green chiles, seeded, cut into thin strips",
        "1 (7-ounce) jar roasted red peppers, drained, cut into thin strips",
        "1/2 cup whipping cream",
        "1 1/4 cups grated Monterey Jack cheese, divided",
        "1/2 teaspoon dried oregano, crumbled",
        "4 (8-inch) flour tortillas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Garlic",
        "Onion",
        "Sauté",
        "Quick & Easy",
        "Steak",
        "Bell Pepper",
        "Tortillas",
        "Monterey Jack"
    ],
    "title": "Rio Grande Beef Burritos with Roasted Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/rio-grande-beef-burritos-with-roasted-peppers-236193"
}
