{
    "directions": [
        "Bring leeks and cream to boil in heavy medium saucepan. Reduce heat to medium and simmer until leeks are tender and cream is thick, stirring often, about 15 minutes. Season with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill. Rewarm before continuing.",
        "Preheat oven to 400°F. Toss all ingredients on rimmed baking sheet. Sprinkle with salt and pepper. Roast until mushrooms are tender and light brown around edges, stirring occasionally, about 45 minutes. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Melt 2 tablespoons butter in heavy large saucepan over medium heat. Add onion and cook until beginning to soften, about 5 minutes. Add rice; stir 1 minute. Add wine and stir until almost all liquid is absorbed, about 1 minute. Add 1 cup hot broth. Simmer until broth is almost absorbed, stirring often, about 4 minutes. Add more broth, 1 cup at a time, allowing each addition to be absorbed before adding next and stirring often, until rice is tender and mixture is creamy, about 20 minutes longer. Stir in leek mixture, mushroom mixture, remaining 2 tablespoons butter, cheese, and truffle. Transfer to large bowl, sprinkle with parsley, and serve."
    ],
    "ingredients": [
        "2 large leeks (white and pale green parts only), halved, thinly sliced crosswise (about 2 cups)",
        "3/4 cup whipping cream",
        "1 pound shiitake mushrooms, stemmed, cut into 1/4- to 1/3-inch-thick slices",
        "1 large onion, halved, thinly sliced lengthwise",
        "1/4 cup (1/2 stick) butter, melted",
        "1 tablespoon white truffle oil",
        "1 teaspoon minced fresh thyme leaves",
        "4 tablespoons (1/2 stick) butter, divided",
        "1 large onion, chopped",
        "1 1/2 cups arborio rice or medium-grain white rice",
        "1/2 cup dry white wine",
        "5 cups (or more) hot vegetable broth",
        "1/2 cup grated Parmesan cheese",
        "2 teaspoons shaved or chopped black truffle (optional)",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Rice",
        "Side",
        "Vegetarian",
        "High Fiber",
        "Parmesan",
        "Leek",
        "White Wine",
        "Fall",
        "Simmer",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Risotto with Leeks, Shiitake Mushrooms, and Truffles",
    "url": "http://www.epicurious.com/recipes/food/views/risotto-with-leeks-shiitake-mushrooms-and-truffles-239801"
}
