{
    "directions": [
        "Halfway fill large bowl with cold water. Squeeze in juice from 1 lemon half. Cut off stem from 1 artichoke and rub exposed area with cut side of second lemon half. Starting from base of artichoke, bend each leaf back and snap off where it breaks naturally. Continue until light green leaves are exposed. Cut off top 2 inches of leaves above heart. Using small sharp knife, cut off all dark green areas. Cut artichokes heart into quarters. Rub all cut surfaces with lemon half. Cut out choke and pink inner leaves from each section. Cut each section lengthwise into 1/4-inch-thick slices and place in acidulated water. Repeat with remaining artichokes. (Can be prepared 3 hours ahead. Let stand in water.)",
        "Starting from base, bend each asparagus spear and snap off where it breaks naturally. Discard ends. Cut asparagus into 1-inch pieces. Set aside.",
        "Pour broth into saucepan; bring to simmer. Reduce heat to low; keep hot.",
        "Heat oil in heavy large saucepan over medium-high heat. Add onion and cook until tender, stirring frequently, about 5 minutes. Drain artichoke hearts and add to saucepan. Cook until almost tender, stirring occasionally, about 14 minutes. Add rice and half of prosciutto and stir 2 minutes. Add 3/4 of broth to saucepan and adjust heat so that liquid simmers. Cook 10 minutes, stirring frequently. Add asparagus and continue cooking until rice is tender but still slightly firm to bite and mixture is creamy, stirring frequently and adding remaining broth by 1/4 cupfuls as necessary, about 15 minutes. Add peas and green onions and stir until heated through, about 2 minutes.",
        "Set aside 2 tablespoons basil and 1 tablespoon prosciutto for garnish. Stir remaining basil and prosciutto and 2 cups Parmesan cheese into risotto. Season to taste with salt and pepper. Garnish with reserved basil and prosciutto. Serve immediately, passing additional Parmesan cheese separately."
    ],
    "ingredients": [
        "1 lemon, halved",
        "3 artichokes",
        "1 pound slender asparagus",
        "4 14 1/2-ounce cans (about) low-salt chicken broth",
        "3 tablespoons olive oil",
        "1 large onion, chopped",
        "2 cups arborio rice",
        "4 ounces sliced prosciutto, chopped",
        "1 cup frozen peas, thawed",
        "1 bunch green onions, chopped",
        "1 1/2-ounce package fresh basil (1/2 cup), trimmed, thinly sliced",
        "2 cups freshly grated Parmesan cheese (about 4 1/2 ounces)",
        "Additional Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Vegetable",
        "Parmesan",
        "Basil",
        "Artichoke",
        "Asparagus",
        "Pea",
        "Spring",
        "Prosciutto"
    ],
    "title": "Risotto Primavera",
    "url": "http://www.epicurious.com/recipes/food/views/risotto-primavera-1981"
}
