{
    "directions": [
        "In a saucepan over high heat, bring the broth to a boil. Add the sugar snap peas and cook until just crisp-tender, about 2 minutes. Using a slotted spoon, transfer the sugar snap peas to a bowl and set aside. Reduce the heat to low.",
        "In a heavy saucepan over medium heat, warm the olive oil. Add the pancetta and stir until fragrant, about 1 minute. Add the leeks and cook, stirring frequently, until tender, about 5 minutes. Add the rice and stir until opaque, about 1 minute. Add the wine and stir until absorbed. Add about 3/4 cup of the hot broth; adjust the heat so the liquid bubbles and is absorbed slowly. Cook, stirring frequently, until the liquid is absorbed. Continue cooking, adding the liquid about 3/4 cup at a time and stirring frequently, until the rice is just tender but slightly firm in the center and the mixture is creamy, about 20 minutes.",
        "Stir in the sugar snap peas, cheese, tarragon and a generous amount of pepper. Taste and adjust the seasoning with salt. Serve immediately. Serves 4.",
        "Quick tips:",
        "Turn any leftovers into risotto cakes: For 3 to 4 cups of risotto, mix in 1 egg yolk and 1/3 cup panko (Japanese bread crumbs). Using wet hands, form the mixture into 2-inch balls, then flatten into rounds 3/4 inch thick. Dip the cakes into beaten egg and coat with more panko, then brown in olive oil, about 4 minutes per side.",
        "Adapted from Williams-Sonoma",
        "Weeknight Fresh & Fast,",
        "by Kristine Kidd (Williams-Sonoma, 2011)."
    ],
    "ingredients": [
        "5 1/2 cups low-sodium chicken or vegetable broth",
        "1 lb. sugar snap peas, strings removed",
        "1 Tbs. olive oil",
        "3 oz. pancetta, minced",
        "2 leeks, white and light green portions, halved lengthwise and sliced crosswise",
        "1 1/2 cups Arborio rice",
        "1/2 cup dry white wine",
        "1 cup grated Parmigiano-Reggiano cheese",
        "1 Tbs. minced fresh tarragon",
        "Freshly ground pepper, to taste",
        "Coarse kosher salt, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Risotto with Leeks and Sugar Snaps",
    "url": "http://www.williams-sonoma.com/recipe/risotto-with-leeks-and-sugar-snaps.html"
}
