{
    "directions": [
        "Bring broth to boil in heavy small saucepan. Remove from heat and cover. Melt butter in heavy medium saucepan over medium-low heat. Add onion and sauté 4 minutes. Add rice; stir 1 minute. Add wine and stir until absorbed, about 1 minute. Add 1/2 cup broth and simmer until liquid is absorbed, stirring often. Cook until rice is just tender and risotto is creamy, adding broth 1/2 cup at at time, stirring frequently and allowing each addition to be absorbed before adding next, about 25 minutes. Mix in Parmesan. Season risotto with salt and pepper. Cool completely. Mix in 1 egg. Cover and chill.",
        "Place some flour in 1 bowl; place remaining egg in another bowl and beat to blend. Place breadcrumbs in third bowl. Using moistened hands, shape 1/4 cup (packed) cold risotto into ball. Poke hole in center. Fill with 1 rounded teaspoon mozzarella and 1 teaspoon prosciutto. Press risotto over filling. Coat rice balls in flour, then egg, then breadcrumbs. Place on rack to dry. Repeat with remaining risotto, filling and coating. Let rice balls stand at least 30 minutes and up to 1 hour.",
        "Pour 1 1/2 inches oil into heavy medium pot. Attach deep-fry thermometer and heat oil to 360°F. Fry balls, 3 at a time, until golden and crusty, turning once, about 2 minutes. Drain on paper towels. Serve hot or at room temperature."
    ],
    "ingredients": [
        "3 cups canned low-salt chicken broth",
        "1 tablespoon unsalted butter",
        "1/2 medium onion, chopped",
        "1 1/4 cups (8 to 9 ounces) arborio rice",
        "1/3 cup dry white wine",
        "1/2 cup freshly grated Parmesan",
        "2 large eggs",
        "All purpose flour",
        "2 cups finely ground fresh breadcrumbs made from crustless Italian or French bread",
        "2/3 cup finely diced whole-milk mozzarella cheese",
        "1/3 cup finely chopped prosciutto",
        "Vegetable oil (for deep-frying)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Appetizer",
        "Fry",
        "Mozzarella",
        "White Wine",
        "Prosciutto",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Risotto Croquettes with Mozzarella and Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/risotto-croquettes-with-mozzarella-and-prosciutto-106455"
}
