{
    "directions": [
        "Season butternut squash cubes with salt and black pepper. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Cover and bring the water to a boil. Add butternut squash, cover, and steam until just tender, 10 to 12 minutes depending on thickness. Transfer squash to a bowl and mash.",
        "Heat olive oil in a skillet over medium heat. Cook and stir onion in the hot oil until softened, 3 to 5 minutes. Stir tomato into onions until onions become translucent, 3 to 5 more minutes. Add Arborio rice to onion mixture and stir to coat with oil; cook and stir until rice becomes translucent with a white spots in the middle of each grain, about 2 minutes.",
        "Stir white wine into rice mixture; cook and stir until wine is completely absorbed, 2 to 4 minutes; add marjoram, oregano, and basil. Pour chicken broth into rice mixture, about 1/2 cup at a time, stirring until liquid is absorbed, until rice is creamy but firm to the bite, 20 to 25 minutes. Stir squash into rice mixture until fully incorporated. Remove from heat.",
        "Stir hot pepper sauce, white beans, Parmesan cheese, and parsley into risotto until cheese is melted. Season with salt and black pepper."
    ],
    "ingredients": [
        "1 butternut squash - peeled, seeded, and cubed",
        "salt and ground black pepper to taste",
        "1/4 cup extra-virgin olive oil",
        "1 onion, diced",
        "1 small tomato, diced",
        "1 (16 ounce) package Arborio rice",
        "1/2 cup white wine",
        "1 teaspoon dried marjoram (optional)",
        "1 teaspoon dried oregano (optional)",
        "1 teaspoon dried basil (optional)",
        "8 cups chicken broth, or more as needed",
        "1 dash hot pepper sauce, or more to taste",
        "1 (14 ounce) can small white beans, drained",
        "1/4 cup shredded Parmesan cheese",
        "3 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Risotto with Butternut Squash and White Beans",
    "url": "http://allrecipes.com/recipe/221995/risotto-with-butternut-squash-and-whi/"
}
