{
    "directions": [
        "Bring broth and water to a boil with 3/4 teaspoon sea salt in a 3- to 4-quart saucepan. Meanwhile, cut stems and center ribs from kale and discard. Stir kale into broth in batches and simmer (all of kale), stirring occasionally, until tender, 5 to 10 minutes. Transfer kale with tongs to a large sieve set over a bowl and gently press on greens to extract more liquid. Add liquid in bowl to simmering broth and keep at a bare simmer, covered. Chop kale.",
        "Cook onion in oil and 1 tablespoon butter with remaining 1/4 teaspoon sea salt in a wide 4-quart heavy pot, covered, over low heat, stirring occasionally, until softened, about 5 minutes. Increase heat to moderate, then add garlic and cook, uncovered, stirring, 1 minute. Add rice and cook, stirring, 1 minute.",
        "Add wine and simmer briskly, stirring constantly, until absorbed. Stir in 1/2 cup simmering broth and simmer briskly, stirring constantly, until broth is absorbed. Continue simmering and adding broth, about 1/2 cup at a time, stirring constantly and letting each addition be absorbed before adding next, until rice is creamy-looking but still al dente (it should be the consistency of thick soup), 17 to 18 minutes. (There will be leftover broth.)",
        "Stir in kale, cheese, and remaining tablespoon butter and cook, stirring, until heated through and butter is incorporated, about 1 minute. Season risotto with sea salt and pepper and, if desired, thin with some of remaining broth. Serve sprinkled with toasted pumpkin seeds."
    ],
    "ingredients": [
        "3 1/2 cups low-sodium fat-free chicken broth",
        "3 1/2 cups water",
        "1 teaspoon fine sea salt",
        "3/4 pound Tuscan kale (also called cavolo nero or lacinato kale)",
        "1 1/4 cups finely chopped onion",
        "1 tablespoon olive oil",
        "2 tablespoons unsalted butter",
        "3 garlic cloves, minced",
        "1 1/2 cups Arborio rice (10 ounces)",
        "1/3 cup dry white wine",
        "1/2 cup grated Parmigiano-Reggiano (3/4 ounce)",
        "Accompaniment:toasted pumpkin seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Parmesan",
        "Kale",
        "White Wine",
        "Fall",
        "Healthy",
        "Simmer",
        "Gourmet"
    ],
    "title": "Risotto with Tuscan Kale and Toasted Pumpkin Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/risotto-with-tuscan-kale-and-toasted-pumpkin-seeds-107016"
}
