{
    "directions": [
        "Cut 1/4-inch slice off 1 long side of carrot to stabilize. Cut lengthwise into 1/8-inch-thick slices. Stack half of slices and cut lengthwise into 1/8-inch-thick strips. Cut strips crosswise into 1/8-inch cubes. Repeat with remaining slices.",
        "Heat 1 tablespoon oil in heavy large skillet over medium-high heat. Add asparagus, zucchini, and crookneck squash; sprinkle with salt and pepper. Sauté until vegetables begin to soften, about 2 minutes. Set vegetables aside.",
        "Bring broth to simmer in medium saucepan over low heat. Cover and keep warm. Heat 3 tablespoons oil in heavy large pot over medium-high heat. Add onion and cubed carrot. Sauté until onion begins to soften, about 2 minutes. Add rice; stir until rice is translucent at edges but still opaque in center, about 3 minutes. Add wine and simmer until absorbed, stirring occasionally, about 3 minutes. Add 1 cup warm broth and baby carrots. Simmer until broth is almost absorbed, stirring often, about 4 minutes. Add 2 cups more broth, 1 cup at a time, allowing each addition to be absorbed before adding next and stirring frequently, about 10 minutes. Mix in sautéed vegetables and 1 cup broth. Simmer until broth is just absorbed, stirring often, about 5 minutes. Add 1 1/3 cups cheese, peas, butter, and 1/2 cup broth. Simmer until butter melts, rice and vegetables are just tender, and risotto is creamy, stirring often and adding more broth by 1/4 cupfuls if risotto is dry, about 3 minutes longer. Mix in basil; season with salt and pepper.",
        "Transfer risotto to large shallow bowl. Sprinkle with pine nuts. Serve, passing additional cheese separately."
    ],
    "ingredients": [
        "1 medium carrot, peeled",
        "4 tablespoons olive oil",
        "8 ounces slender asparagus spears, trimmed, cut on diagonal into 1-inch pieces",
        "1 medium zucchini, trimmed, quartered lengthwise, seeded, cut on diagonal into 1-inch pieces",
        "1 medium-size yellow crookneck squash, trimmed, quartered lengthwise, seeded, cut on diagonal into 1-inch pieces",
        "4 1/2 cups (or more) low-salt chicken broth",
        "1 large white onion, finely chopped",
        "1 3/4 cups (11 1/2 ounces) arborio rice or medium-grain white rice",
        "3/4 cup dry white wine",
        "8 baby carrots, peeled, tops trimmed to 1/2 inch",
        "1 1/3 cups freshly grated Parmesan cheese (about 4 ounces)",
        "1 cup frozen peas, thawed",
        "1/4 cup (1/2 stick) butter, cut into 1-inch pieces",
        "1/2 cup thinly sliced fresh basil leaves",
        "1/4 cup pine nuts, toasted",
        "Additional freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Side",
        "Sauté",
        "Parmesan",
        "Basil",
        "Pine Nut",
        "Asparagus",
        "Pea",
        "Carrot",
        "Squash",
        "Zucchini",
        "Spring",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Risotto Primavera",
    "url": "http://www.epicurious.com/recipes/food/views/risotto-primavera-107905"
}
