{
    "directions": [
        "For the risotto: In a medium saucepan, heat the chicken broth to a simmer. In a separate saucepan, melt the butter over medium-high heat. Add the shallots to the butter, cooking until fragrant and translucent, about 2 minutes. Add the Arborio rice and lightly toast, stirring to coat in the butter and shallots. Add the white wine, continuing to cook while stirring until the wine is absorbed. You should be able to run your spoon through the risotto and have the indentation stay. Using a ladle, add enough of the warm chicken broth to cover the rice, stirring constantly over medium heat until the broth is completely absorbed. Repeat the process 3 more times, adding the broth in stages while continuing to stir. Once all of the chicken broth has been added and the rice is tender, add the peas, lemon juice and lemon zest and stir to combine. Remove from the heat and stir in the Parmesan, mozzarella and season with salt and pepper. Cool the risotto by spreading it evenly over a sheet tray. Cover with plastic wrap and chill in the refrigerator for 20 to 30 minutes. Once the risotto is cooled, form the mixture into burger-size patties, about 1-inch thick. Set up a dredging station with the flour in one dish, beaten eggs in another and panko breadcrumbs in another. Dip the rice patties into the flour, then into the eggs and finally coat them in the panko breadcrumbs. In a large skillet, heat 1/2-inch vegetable oil over medium heat until a pinch of panko sizzles when dropped in the oil. Working in batches of 2 to 3, fry the risotto cakes until golden brown, 2 to 3 minutes per side (use a fish spatula under the cake and the back of a fork on top to help stabilize while flipping). Transfer to a wire rack, which will help them stay crispy. Season with salt and they are ready to serve. Cook's Note: This is a great way to use up leftover risotto."
    ],
    "ingredients": [
        "4 ounces low-moisture shredded mozzarella",
        "3 cups low-sodium chicken broth",
        "3 tablespoons unsalted butter",
        "2 large shallots, minced (about 1/2 cup)",
        "1 cup Arborio rice",
        "3/4 cups dry white wine",
        "5 ounces frozen peas, defrosted",
        "1/3 cup lemon juice",
        "1 tablespoon lemon zest",
        "1 1/4 cups freshly grated Parmesan",
        "Salt and freshly ground black pepper",
        "1 cup all-purpose flour, for dredging",
        "2 eggs, beaten",
        "1 1/2 cups panko breadcrumbs",
        "Vegetable oil, for frying"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Risotto Recipes",
        "Beans and Legumes",
        "Cheese",
        "Pea Recipes",
        "Rice Recipes",
        "Shallot Recipes",
        "Vegetable"
    ],
    "title": "Risotto Cakes",
    "url": "http://www.foodnetwork.com/recipes/risotto-cakes"
}
