{
    "directions": [
        "Preheat oven to 325 degrees F. Line two muffin tins with cupcake liners.",
        "Spread 1 teaspoon cold hot fudge sauce over top of 24 crackers.  Place the crackers, fudge side up, in the lined cups.",
        "Blend cream cheese and sugar in a large bowl until creamy.  Add egg yolk and eggs, one at a time, mixing well after each addition.  Mix in sour cream, lemon juice, vanilla extract, and butter. Mix until incorporated.",
        "Pour batter into muffin cups to about 3/4 full, about 2 heaping tablespoons per cup.",
        "To make the crumb topping, combine the crushed RITZ Bits Peanut Butter sandwich crackers, flour, light brown sugar, cinnamon, and melted butter until mixture has a wet look. Set aside.",
        "Bake cheesecakes in preheated oven 15 minutes.",
        "Remove cheesecakes and evenly distribute crumb topping over each cake.",
        "Return cheesecakes to oven and continue to bake until crumb topping is browned and a toothpick inserted into cheesecake come out dry, about 15 more minutes.",
        "Remove cheesecakes from oven and allow to cool completely.  When cooled, transfer to a covered container and refrigerate up to 2 hours.",
        "Before serving, place peanut butter and caramel sauce in microwave safe mixing bowl.  Microwave 30 seconds.  Carefully remove dish from microwave and stir. Drizzle peanut butter caramel sauce over top of cheesecakes.",
        "Leftover cheesecakes should be stored in the refrigerator."
    ],
    "ingredients": [
        "For the crust:",
        "24 RITZ Crackers",
        "1/2 cup hot fudge topping",
        "For the filling:",
        "2 (8 ounce) packages 1/3-less-fat cream cheese (Neufchatel)",
        "1/2 cup granulated sugar",
        "1 egg yolk",
        "3 eggs",
        "1/4 cup sour cream",
        "1 teaspoon lemon juice",
        "1 teaspoon vanilla extract",
        "1 tablespoon butter, melted",
        "For the crumb topping:",
        "1 cup RITZ Bits Peanut Butter crackers, crushed",
        "2 tablespoons flour",
        "2 tablespoons light brown sugar",
        "1/2 teaspoon ground cinnamon",
        "4 tablespoons unsalted butter, melted",
        "For the caramel topping:",
        "1/4 cup creamy peanut butter",
        "1/4 cup caramel sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "RITZ New York-Style Mini Crumb Cheesecakes",
    "url": "http://allrecipes.com/recipe/235906/ritz-new-york-style-mini-crumb-cheese/"
}
