{
    "directions": [
        "Preheat oven to 250 degrees F.",
        "Put a wire rack over a shallow baking pan and pour 1 cup of water into the pan. Season the ribs with a pinch of salt and pepper. Place the ribs on rack, meaty side up. Slide them into the oven and roast slowly. Check every hour or so for doneness. Roast until you can gently tear the meat between the bones, or they reach an internal temperature of 180 degrees F, about 2 1/2 to 3 hours. Remove from oven and set aside to cool completely.",
        "When ribs are cooled, cut into individual ribs.",
        "Pulse RITZ Crackers into crumbs in a food processor to make about 2 cups crumbs. Mix crumbs with granulated garlic, kosher salt and coarse black pepper.",
        "Coat each rib in flour, dip in egg wash, and then coat with RITZ crumb mixture. Set aside.",
        "Heat oil in deep 9-inch skillet to 350 degrees F. Place ribs meat side down into hot oil (ribs should be about 3/4 covered). Fry in batches, being careful not to overcrowd pan as this will bring down the oil temperature.",
        "Cook approximately 1 1/2  to 2 minutes until ribs are crispy and golden brown. Remove ribs from pan; drain on paper towels.",
        "While ribs are still hot, season with 2 tablespoons Cajun seasoning. Serve with Zesty Buttermilk Ranch Dressing.",
        "To make the Zesty Buttermilk Ranch Dressing, whisk together mayonnaise, buttermilk, vinegar, garlic, chives, grated cheese, and Cajun seasoning in a bowl. Pour into a container with a lid and refrigerate until needed."
    ],
    "ingredients": [
        "3 racks St. Louis style ribs",
        "2 sleeves RITZ Crackers",
        "1 teaspoon granulated garlic",
        "1 teaspoon kosher salt",
        "1 tablespoon coarsely ground black pepper",
        "6 eggs, beaten",
        "1 cup all-purpose flour for dredging",
        "4 cups vegetable oil for frying",
        "2 tablespoons Cajun seasoning, for ribs",
        "Zesty Buttermilk Ranch Dressing:",
        "1 1/4 cups mayonnaise",
        "1 cup buttermilk",
        "2 tablespoons red wine vinegar",
        "2 teaspoons minced garlic",
        "1/4 cup finely chopped chives",
        "1/4 cup freshly grated Parmigiano-Reggiano cheese",
        "2 tablespoons Cajun seasoning"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "RITZ Country Fried Ribs with Zesty Buttermilk Ranch Dressing, created by Dinosaur Bar-B-Que",
    "url": "http://allrecipes.com/recipe/235562/ritz-country-fried-ribs-with-zesty-bu/"
}
