{
    "directions": [
        "1. Prepare the turkey. Remove all extra parts; reserve giblets. Cut off wingtips and any excess neck, etc. Season turkey inside and out with kosher salt and freshly ground pepper; be generous. Loosen up leg joints without tearing skin.",
        "2. Make the stuffing by roughly chopping the lemon , apple, onion, thyme, rosemary, sage, parsley and bay leaves into 1/2-inch pieces. Mix with oil. Put stuffing into cavity and truss the bird. Do not tie too tight.",
        "3. Start the stock at least 30 minutes before roasting the turkey. Place the wingtips and neck in a saucepan; add 6 cups of water. Bring to a boil. Skim off any foam. Reduce heat to a slow simmer. Add onion, celery, carrot, bay leaves, peppercorns and parsley stems. Allow to simmer about 2 1/2 hours. Strain stock and reserve. You should have about 3 cups.",
        "4. Make a paste by kneading 6 tablespoons unsalted butter with 1/4 cup flour. Rub this vigorously and thoroughly into the skin of the bird.",
        "5. Preheat the oven to 450 degrees. Sprinkle 4 tablespoons flour evenly on the bottom of a roasting pan. Place turkey on a rack in the pan. Allow time for turkey to come to room temperature if it is still cold to the touch.",
        "6. Place turkey in oven. Leave in oven for 40 minutes or until the bird is browned all over. Combine 8 tablespoons butter with 1 teaspoon of water and bring to a boil. Turn the oven down to 350 degrees and baste the turkey generously with the butter mixture. Repeat this process twice, once every 10 minutes, until basting liquid is used up. At this point, the turkey should be in the oven about 1 hour. Now baste 2 more times at intervals of 15 minutes, using pan drippings. At this point, the turkey has been in about 1 hour 30 minutes. Cook 20 minutes more without basting, to allow the skin to crisp. Remove from oven. Allow to rest at least 30 minutes before carving. Make the gravy during this resting period.",
        "7. To make the gravy, remove turkey to a serving platter. Place roasting pan directly on top of a burner on medium heat. Cook for about 5 minutes, allowing excess liquid to evaporate. Stir constantly. Now carefully remove any excess fat that has not combined with the flour to make a roux. Add the diced leek and cook for 1 minute. Slowly add 3 cups turkey stock, allowing the gravy to thicken as it comes to a boil. At this point it may be switched to a saucepan. Make sure that every bit of the pan drippings has been incorporated into the gravy. Add the giblets and simmer for about 15 minutes. Stir in the hard-boiled egg and remove from heat. Season to taste with freshly ground pepper and salt, if necessary.",
        "8. Carve the turkey and pass the gravy. Serve with country sausage and sage dressing and cranberry relish."
    ],
    "ingredients": [
        "1 Vermont or other fresh turkey, about 10 pounds, fattened on corn and walnuts, killed 3 days earlier",
        "kosher salt and freshly ground black pepper",
        "1 lemon",
        "1/2 apple",
        "1/2 medium onion",
        "10 sprigs fresh thyme",
        "4 branches fresh rosemary",
        "2 branches fresh sage",
        "10 sprigs Italian parsley",
        "4 bay leaves",
        "1/4 cup vegetable oil",
        "trimmings from the turkey",
        "1/2 medium onion",
        "2 stalks celery",
        "1 carrot",
        "2 bay leaves",
        "10 black peppercorns",
        "5 Italian parsley stems",
        "6 tablespoons unsalted butter",
        "1/4 cup all-purpose flour",
        "4 tablespoons all-purpose flour",
        "8 tablespoons unsalted butter",
        "1 teaspoon water",
        "1 large leek, white part only, cut in 1/4-inch dice",
        "3 cups turkey stock",
        "giblets from turkey, finely diced",
        "1 hard-boiled egg, finely diced",
        "salt and freshly ground pepper",
        "Country Sausage and Sage Dressing",
        "Cranberry Relish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Sausage",
        "Sugar Conscious",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roast Vermont Turkey with Giblet Gravy and Sausage and Sage Dressing, for Thanksgiving",
    "url": "http://www.epicurious.com/recipes/food/views/roast-vermont-turkey-with-giblet-gravy-and-sausage-and-sage-dressing-for-thanksgiving-104109"
}
