{
    "directions": [
        "Preheat oven to 400°F. Place tomatoes, cut side up, on large baking sheet. Sprinkle with salt and pepper. Drizzle tomatoes with 3 tablespoons olive oil. Roast until tomatoes are brown and tender, about 1 hour. Cool slightly.",
        "Transfer tomatoes and any accumulated juices to processor. Using on/off turns, process until slightly chunky.",
        "Heat 3 tablespoons oil in large pot over medium-high heat. Add garlic and sauté until fragrant, about 2 minutes. Stir in tomatoes, rosemary, thyme and dried crushed red pepper. Add chicken stock; bring to boil. Reduce heat and simmer uncovered until soup thickens slightly, about 25 minutes. Remove from heat. (Can be prepared 1 day ahead. Cover and refrigerate. Rewarm soup over medium-high heat before continuing.) Stir in basil. Season to taste with salt and pepper.",
        "Meanwhile, preheat broiler. Brush both sides of baguette slices with remaining 2 tablespoons oil. Transfer to large baking sheet. Broil croutons until golden, about 2 minutes per side. Serve with soup."
    ],
    "ingredients": [
        "3 pounds plum tomatoes, halved lengthwise",
        "8 tablespoons olive oil",
        "3 tablespoons minced garlic",
        "1 1/2 tablespoons finely chopped fresh rosemary or 1 1/4 teaspoons dried",
        "1 1/2 tablespoons finely chopped fresh thyme or 1 1/4 teaspoons dried",
        "1/4 teaspoon (or more) dried crushed red pepper",
        "6 cups chicken stock or canned low-salt broth",
        "6 tablespoons chopped fresh basil",
        "16 1/4-inch-thick baguette slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Food Processor",
        "Garlic",
        "Tomato",
        "Appetizer",
        "Roast",
        "Lunch",
        "Basil",
        "Rosemary",
        "Summer",
        "Winter",
        "Thyme",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roasted Tomato Soup with Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-tomato-soup-with-garlic-5102"
}
