{
    "directions": [
        "Combine the water, apple juice, salt, sugar, garlic, bay leaves, peppercorns, dried rosemary, and orange peel in a large pot and bring to a boil. Turn off the heat immediately, cover, and allow mixture to come to room temperature. Cool mixture in the fridge until you're ready.",
        "To brine the turkey, remove the turkey from wrapper, remove interior bags (set aside; refrigerate), and rinse turkey thoroughly under cool water.",
        "Place the turkey into a plastic brining bag or a very large pot.",
        "Pour the cooled brine mixture over the top, adding extra cold water if you need more to completely cover the turkey. Seal the bag or cover the pot and allow the turkey to brine in the refrigerator for 16 to 24 hours before roasting.",
        "Before roasting, remove the turkey from brine and rinse thoroughly under cold water. Then soak in a sink full of fresh water for 15 to 20 minutes. Pat dry. Discard brine. (This soaking process will decrease the likelihood of too-salty gravy).",
        "Preheat the oven 275 degrees F.",
        "Truss the bird and place it breast side up on a rack in a large roasting pan. Cover the turkey tightly with heavy-duty foil. Make sure it's entirely covered (cover over the bottom edges of the pan). Place in the oven and roast for about 10 minutes per pound (a 20 pound turkey will roast for about 3 1/2 hours).",
        "Remove the turkey from the oven and increase the temperature to 375 degrees F. Remove the aluminum foil and set aside. Mix the softened butter with the rosemary and orange zest and rub all over the skin of the turkey, covering every single inch of the skin. Insert a meat thermometer into the thigh, near the hip joint. Place the turkey, uncovered, back into the oven. Continue roasting the turkey, basting with butter every 30 minutes, until the thermometer registers 170 degrees F and until the juices are no longer pink.",
        "Remove from the oven and cover with foil until you are ready to carve and serve. Reserve pan juices to make gravy."
    ],
    "ingredients": [
        "2 gallons water",
        "2 cups apple juice",
        "1 1/2 cups kosher salt",
        "2 cups brown sugar",
        "5 cloves garlic, crushed",
        "5 bay leaves",
        "4 tablespoons black peppercorns",
        "2 tablespoons dried rosemary",
        "3 oranges, peeled, white pith removed, skin roughly chopped",
        "1 (20-pound) fresh turkey",
        "1 1/2 sticks softened butter",
        "3 tablespoons minced fresh rosemary leaves",
        "3 tablespoons chopped orange zest"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Dinner Recipes",
        "Thanksgiving Turkey",
        "Holiday",
        "Poultry Recipes",
        "Thanksgiving",
        "Turkey Recipes",
        "Roasted Turkey",
        "Roasting",
        "Fruit",
        "Orange Recipes",
        "Fall"
    ],
    "title": "Roasted Thanksgiving Turkey",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/roasted-thanksgiving-turkey-recipe"
}
