{
    "directions": [
        "Cook bacon in heavy large skillet over medium heat until brown and crisp. Transfer bacon to paper towels and drain. Crumble bacon finely. Mix butter, sage and bacon in medium bowl. Season lightly with salt and pepper. Can be made 2 days ahead. Cover and chill. Bring to room temperature before using.)",
        "Pat turkey dry with paper towels. Season cavity with salt and pepper. Place leeks, 8 sage sprigs and bay leaves in cavity. Slide hand under skin of turkey breast to loosen skin. Spread 1/3 cup sage butter over breast meat under skin. Place turkey on rack set in large roasting pan. Rub 2 tablespoons sage butter over outside of turkey. Set aside 1/3 cup butter for gravy; reserve remainder for basting. (Can be made 1 day ahead. Cover, chill. let stand at room temperature 1 hour before continuing.)",
        "Position rack in bottom third of oven and preheat to 350°F. Pour 1/3 cup broth over turkey. Roast turkey until thermometer inserted into thickest part of inner thigh registers 180°F. basting every 30 minutes with 1/3 cup broth and occasionally brushing with sage butter, about 3 hours. Transfer turkey to platter; tent with foil. Let stand 30 minutes.",
        "Remove rack from pan. Pour pan juices into large glass measuring cup. Spoon off fat; discard. Pour juices back into pan. Set pan over 2 burners set on high heat. Add 2 cups broth. Boil until liquid is reduced to 2 cups, scraping up browned bits, about 10 minutes. Whisk in reserved 1/3 cup sage butter. Season with pepper. Transfer gravy to bowl.",
        "Uncover platter. Garnish with sage and parsley. Serve turkey with gravy."
    ],
    "ingredients": [
        "8 slices bacon (about 1/2 pound)",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "3 tablespoons chopped fresh sage or 3 teaspoons dried",
        "1 16-pound turkey",
        "3 cups chopped leeks (white and pale green parts only; about 2 medium)",
        "8 large fresh sage sprigs",
        "3 bay leaves, crumbled",
        "4 1/2 cups (about) canned low-salt chicken broth",
        "Fresh sage and parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Bake",
        "Roast",
        "Thanksgiving",
        "Bacon",
        "Chill",
        "Sage"
    ],
    "title": "Roast Turkey with Sage Butter",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-sage-butter-828"
}
