{
    "directions": [
        "Preheat oven to 350°F. Toast pine nuts on a rimmed baking sheet, tossing occasionally, until golden brown, 8–10 minutes; let cool.",
        "Increase temperature to 450°F. Toss carrots with 1 tablespoon oil on another rimmed baking sheet; season with salt and black pepper. Roast, tossing occasionally, until softened and browned, 15–20 minutes; let cool slightly.",
        "Meanwhile, heat 1 tablespoon oil in a large ovenproof skillet over medium-high heat. Season pork with salt and black pepper and cook, turning occasionally, until golden brown, 10–15 minutes. Transfer skillet to oven and roast pork until a thermometer inserted into thickest portion registers 145°F, 8–10 minutes. Let rest 5 minutes before slicing.",
        "Pulse pine nuts, garlic, and remaining 3 tablespoons oil in a food processor to a coarse paste. Add Aleppo pepper, one-fourth of carrots, 1 tablespoon vinegar, and 1 tablespoon water. Process, adding more water as needed, to a coarse purée; season romesco with salt, black pepper, and more vinegar, if desired.",
        "Toss greens with remaining carrots and remaining 1 tablespoon vinegar in a large bowl; season with salt and black pepper. Serve pork with romesco and salad."
    ],
    "ingredients": [
        "1/4 cup pine nuts",
        "1 1/2 pounds small carrots, peeled, halved lengthwise if larger",
        "5 tablespoons olive oil, divided",
        "Kosher salt",
        "1 freshly ground black pepper",
        "1 large pork tenderloin (about 1 1/2 pounds)",
        "1 small garlic clove, finely grated",
        "1 teaspoon Aleppo pepper or 1/2 teaspoons crushed red pepper flakes",
        "2 tablespoons red wine vinegar, divided",
        "2 cups spicy greens (such as watercress or baby mustard)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Pork",
        "Roast",
        "Quick & Easy",
        "Dinner",
        "Pork Tenderloin",
        "Pine Nut",
        "Carrot",
        "Quick and Healthy",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roast Pork Tenderloin with Carrot Romesco",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-tenderloin-with-carrot-romesco-51231850"
}
