{
    "directions": [
        "Preheat the oven to 425 degrees.",
        "With a mortar and pestle or in the bowl of a food processor fitted with a steel blade, grind together the garlic, salt, and thyme leaves. Add the mustard and combine. Spread the mixture over the loin of pork and allow it to sit at room temperature for at least 30 minutes.",
        "Meanwhile, cut the fennel bulbs into thick wedges, slicing through the core. Toss the fennel, carrots, potatoes, and onions in a bowl with the olive oil, melted butter, salt, and pepper.",
        "Transfer the vegetables to a large roasting pan and cook for 30 minutes. Add the pork to the pan and continue to cook for another 30 to 50 minutes, or until a meat thermometer inserted into the middle of the pork reads exactly 138 degrees. Remove the meat from the pan and return the vegetables to the oven to keep cooking. Cover the meat with aluminum foil and allow it to rest for 15 minutes.",
        "Remove the strings from the meat and slice it thickly. Arrange the meat and vegetables on a platter. Sprinkle with salt and pepper."
    ],
    "ingredients": [
        "2 garlic cloves, minced",
        "1 tablespoon kosher salt",
        "1 tablespoon fresh thyme leaves",
        "1/4 cup Dijon mustard",
        "1 3-pound boneless pork loin, trimmed and tied",
        "3 small fennel bulbs, tops removed",
        "10 carrots, peeled and thickly sliced diagonally",
        "10 small new potatoes, quartered",
        "2 onions, thickly sliced",
        "4 tablespoons good olive oil",
        "4 tablespoons unsalted butter (1/2 stick), melted",
        "Salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Potato",
        "Roast",
        "Fennel",
        "Carrot",
        "Winter"
    ],
    "title": "Roast Loin of Pork with Fennel",
    "url": "http://www.epicurious.com/recipes/food/views/roast-loin-of-pork-with-fennel-105104"
}
