{
    "directions": [
        "In a baking pan roast the onions in the middle of a preheated 475°F. oven for 2 hours. While the onions are roasting, in a small saucepan melt the butter over low heat, whisk in the flour, and cook the roux, whisking, for 3 minutes. Add the cream and the wine in a stream, whisking, bring the mixture to a boil, whisking, and simmer it whisking, for 5 minutes. Remove the saucepan from the heat and stir in the capers, the vinegar, the tarragon, the parsley, and the chives.",
        "Let the onions cool until they can be handled, discard the tough outer layers, the stems, the root ends, and the juices in the baking pan, and in a food processor purée the onions until they are smooth. Transfer the purée to a small saucepan, bring it to a boil, and boil it, stirring, until it is thickened and the excess liquid is evaporated. Stir in the purée into the cream sauce and stir in salt and pepper to taste. The sauce may be made 1 day in advance and kept covered and chilled. Serve the sauce warm or at room temperature."
    ],
    "ingredients": [
        "2 large onions (about 3/4 pound each), unpeeled and untrimmed",
        "2 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour",
        "3/4 cup heavy cream",
        "1/4 cup dry white wine",
        "3 tablespoons drained bottled capers",
        "1 teaspoon white-wine vinegar",
        "1 tablespoon minced fresh tarragon leaves or 3/4 teaspoon dried, crumbled",
        "2 tablespoons minced fresh parsley leaves",
        "1 tablespoons thinly sliced fresh chives or scallion greens"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Milk/Cream",
        "Herb",
        "Onion",
        "Roast",
        "Quick & Easy",
        "Vinegar",
        "White Wine",
        "Winter",
        "Tarragon",
        "Parsley",
        "Capers",
        "Gourmet"
    ],
    "title": "Roasted Onion, Caper, and Tarragon Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-onion-caper-and-tarragon-sauce-13567"
}
