{
    "directions": [
        "Preheat oven to 375°F. Brush baking sheet with olive oil. Place eggplant pieces on paper towels. Sprinkle lightly with salt; let stand 20 minutes. Transfer eggplant to prepared sheet. Toss with 2 tablespoons oil. Roast eggplant until tender, stirring occasionally, about 30 minutes. Set aside. Maintain oven temperature.",
        "Mix ricotta cheese, 1/2 cup Parmesan, shallots and rosemary in large bowl. Season with salt and pepper.",
        "Oil 13 x 9 x 2-inch glass baking dish. Spread 1/2 cup tomato sauce in dish. Arrange 3 lasagna noodles crosswise in single layer in dish. Spread half of ricotta mixture over noodles. Arrange half of eggplant over. Sprinkle with salt and pepper. Spoon generous 1 cup sauce over. Arrange half of mozzarella over sauce. Repeat layering 1 more time. Top with 3 lasagna noodles. Spread remaining sauce over. Sprinkle with 3/4 cup Parmesan. Cover tightly with lightly oiled foil. (Can be made 1 day ahead; chill.)",
        "Bake until noodles are tender and lasagna is heated through, about 45 minutes. Uncover; bake until cheese begins to brown and sauce is bubbling slightly at edges, about 15 minutes longer. Let stand 10 minutes before serving."
    ],
    "ingredients": [
        "2 1-pound eggplants, peeled, cut into 1-inch pieces",
        "2 tablespoons olive oil",
        "2 pounds part-skim ricotta cheese",
        "1 1/4 cups freshly grated Parmesan cheese (about 3 ounces)",
        "1/2 cup chopped shallots",
        "1 tablespoon chopped fresh rosemary",
        "Broiled Tomato Sauce with Roasted Garlic",
        "9 no-boil or oven-ready lasagna noodles",
        "8 ounces smoked mozzarella cheese or smoked Gouda cheese, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Vegetable",
        "Bake",
        "Vegetarian",
        "Mozzarella",
        "Parmesan",
        "Ricotta"
    ],
    "title": "Roasted Eggplant Lasagna with Broiled Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-eggplant-lasagna-with-broiled-tomato-sauce-15581"
}
