{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Lay the beef in a large roasting pan with the bone side down. (The ribs act as a natural roasting rack.) In a small bowl mash together the garlic, horseradish, rosemary, thyme, salt, pepper, and olive oil to make a paste. Massage the paste generously over the entire roast. Put the pan in the oven and roast the beef until the internal temperature of the meat registers 125 degrees F on an instant-read thermometer (medium-rare), 1 1/2 to 2 hours. Remove the beef to a carving board and let it rest for 20 minutes before carving.",
        "Pour off some of the pan drippings and place pan on stovetop over medium-high heat.",
        "Add the white wine and bring to a simmer, scraping the bits on the bottom of the pan. Reduce the wine by half. Whisk in the flour, then add the broth and continue to cook, whisking until sauce thickens into a gravy, about 10 minutes.",
        "Serve with Scalloped Potato Gratin and Roasted Red Onions.",
        "1 1/2 cups heavy cream",
        "1 sprig fresh thyme",
        "2 garlic cloves, chopped",
        "1/2 teaspoon ground nutmeg",
        "Butter",
        "2 russet potatoes, peeled and cut into 1/8-inch thick slices",
        "Salt and freshly ground black pepper",
        "1/2 cup grated Parmesan, plus more for broiling",
        "Preheat the oven to 375 degrees F.",
        "In a saucepan, heat up the cream with a sprig of thyme, chopped garlic and nutmeg.",
        "While cream is heating up, butter a casserole dish. Place a layer of potato in an overlapping pattern and season with salt and pepper. Remove cream from heat, then pour a little over the potatoes. Top with some grated Parmesan. Make 2 more layers. Bake, uncovered, for 45 minutes. Sprinkle some more Parmesan and broil until cheese browns, about 5 minutes.",
        "Yield: 4 to 6 servings",
        "6 tablespoons butter",
        "3 tablespoons balsamic vinegar",
        "1/2 cup honey",
        "1/2 bunch fresh thyme",
        "Salt and freshly ground black pepper",
        "4 red onions, halved",
        "Preheat the oven to 350 degrees F.",
        "Combine the butter, vinegar, honey, thyme, salt, and pepper in a small saucepan over medium heat. Bring to a simmer and cook for 1 minute to reduce slightly. Place the onions, cut sides up, in a single layer on a baking pan. Drizzle the butter-vinegar mixture over and roast until soft and slightly caramelized, about 45 minutes.",
        "Yield: 6 servings"
    ],
    "ingredients": [
        "1 bone in prime rib beef roast, 3 ribs, about 6 pounds",
        "5 garlic cloves, smashed",
        "1/4 cup grated fresh or prepared horseradish",
        "Leaves from 2 fresh rosemary sprigs",
        "Leaves from 4 fresh thyme sprigs",
        "1/2 cup kosher salt",
        "1/4 cup freshly ground black pepper",
        "1/2 cup extra-virgin olive oil",
        "1/2 cup dry white wine",
        "1 tablespoon all-purpose flour",
        "2 cups canned chicken or beef broth"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Christmas Dinner",
        "Christmas",
        "Holiday",
        "Roasted Potato",
        "Roasted Vegetable",
        "Potato",
        "Roasting",
        "Vegetable",
        "Roast Recipes",
        "Prime Rib",
        "Meat",
        "Beef",
        "Onion Recipes",
        "Main Dish Recipes",
        "New Year's"
    ],
    "title": "Roast Prime Rib of Beef with Horseradish Crust",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/roast-prime-rib-of-beef-with-horseradish-crust-recipe"
}
