{
    "directions": [
        "Char peppers over gas flame or in broiler until blackened on all sides. Wrap in paper bag and seal. Let stand 10 minutes. Peel and seed peppers. Cut into 1/3-inch-wide strips.",
        "Heat oil in heavy large skillet over medium heat. Add onion and sauté until just beginning to color, about 12 minutes. Transfer to bowl and cool. (Bell peppers and onion can be prepared 1 day ahead. Cover separately and refrigerate.)",
        "Preheat oven to 425°F. Remove crust from box. Let stand at room temperature 15 minutes to soften. Unfold crust; peel off top plastic sheet. Press out fold lines. If crust cracks, wet fingers and push edges together to seal. Sprinkle 1 teaspoon flour over surface of crust. Place crust, floured side down, in 9-inch-diameter tart pan with removable bottom; peel off second plastic sheet. Fold crust edge in, forming double-thick sides. Pierce dough all over with fork. Bake until light golden, about 10 minutes. Cool crust. Reduce oven temperature to 400°F.",
        "Arrange onion in crust. Top with bell pepper strips. Sprinkle with basil. Whisk cream, eggs, salt and pepper in medium bowl to blend. Pour custard over vegetables. Bake tart until custard sets, about 20 minutes. Cool tart 5 minutes in pan on rack. Remove pan sides. Cut tart into wedges and serve warm."
    ],
    "ingredients": [
        "1 small red bell pepper",
        "1 small yellow bell pepper",
        "2 tablespoons olive oil",
        "1 1/2 cups chopped onion",
        "1 refrigerated pie crust (half of 15-ounce package)",
        "1 teaspoon all purpose flour",
        "1/4 cup chopped fresh basil",
        "2/3 cup whipping cream",
        "2 large eggs",
        "1/4 teaspoon salt",
        "1/8 teaspoon pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Onion",
        "Bake",
        "Vegetarian",
        "Bell Pepper"
    ],
    "title": "Roasted Bell Pepper and Onion Tart",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-bell-pepper-and-onion-tart-1968"
}
