{
    "directions": [
        "Preheat oven to 425°F.",
        "Unfold puff pastry sheet and gently roll out with a floured rolling pin on a very lightly floured surface into a 12-inch square. Trim edges with a sharp knife, then cut pastry into 6 rectangles (about 6 by 4 inches each). Arrange rectangles 1 to 2 inches apart on an ungreased baking sheet and prick them all over with a fork.",
        "Bake in middle of oven until pastry is puffed and golden, 13 to 15 minutes. Cool pastry on baking sheet on a rack.",
        "Reduce oven temperature to 375°F.",
        "Arrange rhubarb in 1 layer in a lightly oiled shallow 15- by 10-inch baking pan (preferably nonstick) and sift 2 tablespoons confectioners sugar evenly over it. Roast in middle of oven until tender, 15 to 25 minutes, then cool in pan on a rack.",
        "Make strawberry sauce and cream filling while rhubarb is roasting: Purée strawberries with syrup in a food processor, then force purée through a very fine sieve into a bowl.",
        "Sift 5 tablespoons confectioners sugar over crème fraîche and whisk to combine.",
        "Sift remaining tablespoon confectioners sugar over pastry rectangles. Make a 3-inch lengthwise trough in the center of each rectangle by gently tapping with back of a teaspoon. Divide cream filling among troughs and top with rhubarb, then drizzle with strawberry sauce."
    ],
    "ingredients": [
        "1 sheet frozen puff pastry (from a 17 1/4-ounces package), thawed",
        "1 lb rhubarb stalks, trimmed and cut crosswise into 1-inch pieces",
        "1/2 cup confectioners sugar",
        "1 (10-ounces) package frozen strawberries in heavy syrup, thawed",
        "3/4 cup crème fraîche or sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Strawberry",
        "Spring",
        "Rhubarb",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted Rhubarb Tarts with Strawberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-rhubarb-tarts-with-strawberry-sauce-106386"
}
