{
    "directions": [
        "Grind star anise and coriander seeds in spice mill or with mortar and pestle. Slice chile and garlic, then mash to a paste using the side of a chef's knife. Transfer to a small bowl and stir in ground spices, soy sauce, fish sauce, and paprika.",
        "Lightly score pork skin crosswise in a tight pattern with a very sharp knife, cutting through the skin and some fat, but taking care not to slash the meat itself. Transfer pork to a large Dutch oven with a tight-fitting lid or a roasting pan. Season liberally with salt and pepper and rub with marinade. Cover (use foil with roasting pan) and chill overnight.",
        "Preheat oven to 425°F. Place pork, covered, in oven; reduce oven temp to 300°F. Roast pork, basting with juices every hour, until meat is fork-tender and bones are very loose, 5–5 1/2 hours.",
        "Uncover pork and increase temperature to 450°F. Roast, basting every 5 minutes and adding water by 1/4-cupfuls if juices become syrupy, until pork is dark brown and skin is crisp, 15–20 minutes.",
        "Carefully transfer pork to a platter. Skim fat from pan juices and pour remaining juices over.",
        "Pork can be marinated 2 days ahead. Keep chilled."
    ],
    "ingredients": [
        "4 star anise pods",
        "1 tablespoon coriander seeds",
        "1 red Fresno chile",
        "3 garlic cloves",
        "2 tablespoons soy sauce",
        "1 tablespoon fish sauce (such as nam pla or nuoc nam)",
        "1 teaspoon hot smoked Spanish paprika",
        "1 (7–8-pound) skin-on, bone-in pork picnic shoulder:",
        "Kosher salt, freshly ground pepper",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Roast",
        "Kid-Friendly",
        "Mortar and Pestle"
    ],
    "title": "Roast Pork Shoulder with Star Anise and Soy Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-shoulder-with-star-anise-and-soy-sauce-56389900"
}
