{
    "directions": [
        "Preheat an oven to 375 degrees F (190 degrees C).",
        "Cut off the top of the head of garlic to expose the cloves, trimming about 1/4 inch off of the top of each clove. You may need to trim individual cloves along the sides of the head. Brush the cut cloves with 1 tablespoon of olive oil, then nestle the head into a piece of aluminum foil.  Bake in the preheated oven until the cloves are tender and nicely browned, about 25 minutes.",
        "Remove roasted garlic from oven, open foil and allow to cool slightly. When the garlic is cool enough to handle, cut the heads in half horizontally so that all of the cloves are exposed. Squeeze both halves to release the roasted cloves into a medium bowl.",
        "While the garlic is roasting, heat the remaining 1 tablespoon olive oil in a large saucepan.  Stir in the onion and the carrot and cook, stirring, until soft, about 5 minutes.  Pour the chicken stock into the saucepan and add the potatoes, rosemary, and thyme.  Bring the soup to a simmer over medium heat and cook until the potatoes are tender, about 20 minutes.",
        "Remove about 1/2 of the potatoes from the pot and reserve.  Place the roasted garlic cloves into a blender and add the soup, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the contents moving before letting it run.  Puree the soup, in batches, until smooth. Pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot.",
        "Stir the reserved potato cubes, heavy cream, and smoked salmon into the pureed soup and bring to a simmer.  Serve, hot, with a sprinkle of green onion."
    ],
    "ingredients": [
        "1 whole head garlic",
        "2 tablespoons olive oil",
        "1/4 cup diced onion",
        "1 carrot, finely chopped",
        "4 cups chicken stock",
        "4 large new potatoes, cut into 1/2 inch cubes",
        "1/2 teaspoon ground dried rosemary",
        "1/4 teaspoon ground thyme",
        "3/4 cup heavy cream",
        "1/2 cup smoked salmon, torn or cut into bite-size pieces",
        "salt and pepper to taste",
        "1 green onion, thinly sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Garlic Potato Soup with Smoked Salmon",
    "url": "http://allrecipes.com/recipe/170176/roasted-garlic-potato-soup-with-smoke/"
}
