{
    "directions": [
        "Preheat the oven to 400 degrees F. Line two sheet pans with parchment paper.",
        "Place the sirloin, pork, and veal in a large mixing bowl and lightly break up the meats with a fork and your fingertips. Add the bread crumbs, Pecorino, Parmesan, garlic, parsley, 2 teaspoons salt, and 1/2 teaspoon black pepper. Add the eggs, wine, and 3/4 cup water and combine lightly but thoroughly.",
        "Measure out 2-ounce portions of the mixture (I use a rounded 1 3/4-inch ice cream scoop) and roll each lightly into a ball. Place one inch apart on the prepared sheet pans. Brush the meatballs with the olive oil.",
        "Bake the meatballs for 25 to 30 minutes, until lightly browned. Pour the marinara into a large pot and bring to a simmer. Carefully add the meatballs and simmer for 10 minutes, until heated through.",
        "To serve with polenta, spoon a puddle of creamy Parmesan polenta on one side of each dinner plate. Spoon 1 or 2 meatballs plus a puddle of tomato sauce on the other side, allowing them to combine in the center of the plate. To serve with spaghetti, distribute among shallow pasta bowls. Spoon the meatballs and sauce onto the pasta. Sprinkle with extra Parmesan and serve hot.",
        "Place the chicken stock in a large saucepan. Add the garlic and cook over medium-high heat until the stock comes to a boil. Reduce the heat to medium-low and very slowly whisk in the cornmeal, whisking constantly to make sure there are no lumps. Switch to a wooden spoon, add the salt and pepper, and simmer, stirring almost constantly, for 10 minutes, until thick. Be sure to scrape the bottom of the pan thoroughly while you're stirring. Off the heat, stir in the Parmesan, creme fraiche, and butter. Taste for seasonings and serve hot with extra Parmesan cheese to sprinkle on top."
    ],
    "ingredients": [
        "1 pound ground sirloin",
        "1/2 pound ground pork",
        "1/2 pound ground veal",
        "1 3/4 cups dry seasoned bread crumbs",
        "1/2 cup freshly ground Italian Pecorino cheese (2 ounces)",
        "1/2 cup freshly ground Italian Parmesan cheese (2 ounces), plus extra for serving",
        "2 garlic cloves, minced",
        "2 tablespoons chopped fresh parsley leaves",
        "Kosher salt and freshly ground black pepper",
        "2 extra-large eggs, lightly beaten",
        "3/4 cup dry red wine, such as Chianti",
        "1/4 cup good olive oil",
        "2 (32-ounce) jars good marinara sauce, such as Rao's",
        "Creamy Parmesan Polenta (recipe follows) or cooked spaghetti, for serving",
        "4 cups chicken stock, preferably homemade",
        "2 teaspoons minced garlic (2 cloves)",
        "1 cup yellow cornmeal, preferably stone-ground",
        "1 tablespoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 cup freshly grated Parmesan cheese, plus extra for serving",
        "1/2 cup creme fraiche",
        "2 tablespoons (1/4 stick) unsalted butter"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Meatballs",
        "Polenta Recipes",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Roasted Italian Meatballs",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/roasted-italian-meatballs"
}
