{
    "directions": [
        "Blend all ingredients in processor until bacon is finely chopped. Transfer to sheet of plastic wrap. Using plastic wrap as aid, roll butter mixture into 2-inch-diameter log; chill until firm. DO AHEAD: Can be made 3 days ahead. Keep chilled.",
        "Preheat oven to 425°F. Combine turkey neck, 1/4 cup turkey fat, and turkey leg in heavy large ovenproof pot. Place in oven; roast uncovered until turkey parts are deep, dark brown, turning once, about 1 1/2 hours. Drain, reserving fat from pot. Reserve 1/4 cup fat for gravy; return 1 tablespoon fat to pot. Return turkey parts to pot; stir in celery, onions, thyme sprigs, and peppercorns. Return pot to oven; roast uncovered 10 minutes. Add apple cider and vinegar; roast 10 minutes longer. Reduce oven temperature to 375°F. Add 8 cups stock and sage to pot; cook in oven uncovered 1 1/2 hours. Strain gravy base through fine strainer; discard solids in strainer (there will be about 5 cups gravy base). DO AHEAD: Can be made 2 days ahead. Cover and chill.",
        "Cut bacon butter into 1/4-inch-thick rounds and let stand at room temperature 20 minutes. Rinse turkey inside and out; pat dry. Starting at neck end, carefully slide hand between skin and breast meat, then slide hand between skin and thigh meat. Carefully slide butter slices between skin and leg, thigh, and breast meat to cover (there will be a generous amount of butter mixture). Sprinkle 1 teaspoon coarse salt and 1 teaspoon pepper over turkey, and 1 teaspoon coarse salt and 1 teaspoon pepper in main cavity of turkey. Place turkey on rimmed baking sheet. Cover with plastic wrap or foil; chill at least 1 day. DO AHEAD: Can be made 2 days ahead. Keep chilled.",
        "Set rack at lowest position in oven; preheat to 350°F. Mix onions, celery, fennel, carrots, apples, oil, and bay leaves in large roasting pan. Sprinkle generously with salt and pepper. Place turkey atop vegetable mixture. Tuck wings under; tie legs together loosely to hold shape. Place turkey in oven; roast until instant-read thermometer inserted into thickest part of thigh registers 170°F, basting with pan drippings every 30 minutes and tenting loosely with foil if browning too quickly, about 4 hours total. Transfer turkey to platter (internal temperature of turkey will increase 5 to 10 degrees).",
        "Pour vegetable mixture and pan drippings into large strainer set over large bowl; press on solids to extract liquid. Discard solids in strainer. Spoon off fat from pan drippings; discard (there will be a large amount of fat in pan drippings). Reserve degreased pan drippings for gravy (about 1 cup). Remove fat from surface of gravy base; reserve 1/4 cup fat. Rewarm cider gravy base.",
        "Melt reserved 1/4 cup fat in large saucepan over medium heat. Add flour; stir 3 minutes. Gradually add warm cider gravy base and degreased pan drippings. Simmer until smooth, thickened, and reduced to 51/2 cups, whisking frequently, about 5 minutes. Season gravy with salt and pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, room temperature",
        "8 ounces applewood-smoked bacon slices, coarsely chopped",
        "1/3 cup Dijon mustard",
        "1/4 cup chopped fresh thyme",
        "1/4 cup chopped fresh sage",
        "1/4 cup fresh lemon juice",
        "1 tablespoon coarse sea salt or coarse",
        "kosher salt",
        "1 tablespoon freshly ground black pepper",
        "1 tablespoon finely grated lemon peel",
        "Neck reserved from 18- to 19-pound heritage turkey",
        "1/4 cup fat reserved from turkey cavities",
        "1 whole turkey leg (thigh and drumstick)",
        "2 1/2 cups coarsely chopped celery",
        "2 cups coarsely chopped onions",
        "6 large fresh thyme sprigs",
        "1/4 teaspoon black peppercorns",
        "1/2 cup apple cider",
        "2 tablespoons apple cider vinegar",
        "8 cups chicken stock or low-salt chicken broth",
        "4 whole sage leaves",
        "1 18- to 19-pound heritage turkey, neck and 1/4 cup fat from cavities reserved for cider gravy base",
        "2 teaspoons coarse sea salt or coarse kosher salt",
        "2 teaspoons freshly ground black pepper, divided",
        "2 cups coarsely chopped onions",
        "2 cups coarsely chopped celery",
        "2 cups coarsely chopped fresh fennel bulbs",
        "2 cups coarsely chopped peeled carrots",
        "2 cups coarsely chopped unpeeled apples",
        "1/2 cup olive oil",
        "3 bay leaves",
        "1/2 cup all purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Mustard",
        "Poultry",
        "turkey",
        "Marinate",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "High Fiber",
        "Dinner",
        "Vinegar",
        "Apple",
        "Bacon",
        "Fennel",
        "Fall",
        "Family Reunion",
        "Christmas Eve",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Heritage Turkey with Bacon-Herb and Cider Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-heritage-turkey-with-bacon-herb-and-cider-gravy-350421"
}
