{
    "directions": [
        "Preheat the oven to 400 degrees.",
        "If the asparagus are thick, peel them halfway up the stalks. Cut off and discard the bottom third of the asparagus. Place the asparagus in a single layer on a sheet pan, drizzle with olive oil, and sprinkle with 1 teaspoon salt and 1/2 teaspoon pepper. Roast for 10 minutes, until the stalks are just tender. Meanwhile, place the prosciutto in a single layer on another sheet pan and roast in the same oven for 5 minutes.",
        "Melt the butter in a medium (10-inch) saute pan over medium heat and wait until the bubbles almost subside. Crack the eggs into the skillet, keeping them separate, if possible. Sprinkle the eggs generously with salt and pepper and cook over medium heat until the whites are cooked but the yolks are still runny. Don't turn them over!",
        "Arrange the asparagus on 3 plates. Place 2 slices of prosciutto on top of each pile, drizzle with hollandaise, and place a fried egg on top of the prosciutto. Serve hot.",
        "Place the egg yolks, lemon juice, salt, black pepper, and cayenne pepper in the jar of a blender and process on low for 15 seconds. Melt the butter in a small saucepan until it is sizzling hot. Remove the small clear insert in the top of the blender. With the blender on low, slowly add the hot butter to the egg and lemon mixture and blend for 30 seconds, until the sauce is very thick. Use immediately."
    ],
    "ingredients": [
        "1 pound fresh asparagus (not too thin)",
        "Good olive oil",
        "Kosher salt and freshly ground black pepper",
        "6 large slices prosciutto",
        "1 1/2 tablespoons unsalted butter",
        "3 extra-large eggs",
        "Easy Hollandaise Sauce, recipe follows",
        "2 extra-large egg yolks, at room temperature",
        "1 1/2 tablespoons freshly squeezed lemon juice",
        "3/4 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "Pinch of cayenne pepper",
        "6 tablespoons (3/4 stick) unsalted butter"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Egg Recipes",
        "Asparagus",
        "Vegetable",
        "Meat",
        "Brunch",
        "Roasting"
    ],
    "title": "Roasted Asparagus and Prosciutto",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/roasted-asparagus-and-prosciutto-recipe"
}
