{
    "directions": [
        "Preheat oven to 425°F. Pierce duck skin all over with tip of small sharp knife. Place duck, breast side down, on large rimmed baking sheet. Roast duck until skin is deep golden brown and crisp, about 50 minutes. Transfer duck to plate. Reduce oven temperature to 350°F. Pour off fat from baking sheet into medium bowl; reserve fat. Return duck to baking sheet, breast side up. Scatter squash, shallots, and sage around duck; sprinkle duck and vegetables with salt and pepper. Drizzle 1/4 cup reserved fat over vegetables. Roast duck and vegetables 45 minutes. Turn vegetables. Continue roasting until drumsticks are tender, about 45 minutes. Maintain oven temperature.",
        "Meanwhile, cook green beans in large pot of boiling salted water until crisptender, 4 to 5 minutes. Drain green beans and spread out on another rimmed baking sheet to cool. Heat 1 1/2 tablespoons reserved duck fat in heavy large skillet over medium high heat. Add 1/3 of mushrooms; sprinkle with salt and pepper. Sauté mushrooms until tender and beginning to brown, 2 to 3 minutes. Transfer to bowl. Working in 2 more batches, repeat with duck fat, remaining mushrooms, and salt and pepper.",
        "Transfer duck to plate; let rest. Add mushrooms to green beans on baking sheet; toss. Roast until heated through, about 15 minutes. Season to taste with salt and pepper. Using tongs, tilt duck to drain juices from cavity onto plate.",
        "Place duck on platter; pour juices from plate onto rimmed baking sheet with vegetables. Using slotted spoon, transfer vegetables to platter; arrange around duck. Pour off pan juices from baking sheet into medium bowl. Spoon off fat from surface; discard fat and reserve juices. Place baking sheet over 2 burners on stovetop. Add reserved juices and broth to baking sheet. Bring to boil, scraping up any browned bits. Pour pan juices into small pitcher; season with salt and pepper.",
        "Serve duck and vegetables, passing pan juices alongside."
    ],
    "ingredients": [
        "1 5- to 5 1/2-pound duck",
        "1 2 1/2-pound butternut squash, halved, seeded, cut into 2- to 3-inch chunks with skin",
        "8 small shallots, peeled",
        "20 large fresh sage leaves",
        "1 pound green beans, trimmed",
        "1 pound fresh cèpes (porcini), cut vertically into 1/3-inch-thick slices",
        "3/4 cup low-salt chicken broth",
        "Ingredient info: Fresh porcini mushrooms are available in the fall and spring at some farmers' markets and online from oregonmushrooms.com. If you're at the market, ask the purveyor to cut the mushrooms in half so that you can look at the stem. It should be white, without any tiny holes."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Mushroom",
        "Roast",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Green Bean",
        "Squash",
        "Fall",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roast Duck, Butternut Squash, Cèpes, and Green Beans",
    "url": "http://www.epicurious.com/recipes/food/views/roast-duck-butternut-squash-cepes-and-green-beans-361329"
}
