{
    "directions": [
        "Finely mince 1/2 cup oregano, garlic, salt and pepper in processor. Place lamb in large roasting pan. Rub lamb with 2 tablespoons olive oil. Spread 4 tablespoons oregano mixture over lamb, reserving remainder. Arrange lamb so that fat side is up. Let stand at room temperature 1 hour.",
        "Meanwhile, fill large pot with cold water. Add 4 tablespoons lemon juice to water. Cut 1 artichoke lengthwise into 8 wedges. Rub cut surfaces of artichoke with lemon half to prevent discoloring. Cut away choke and discard, leaving artichoke wedges intact. Place artichokes in pot with water . Repeat with remaining artichokes. Boil artichokes until almost tender, about 15 minutes. Drain. Transfer to large bowl. Add olives, 1 tablespoon lemon juice and 1 teaspoon oregano mixture to artichokes; toss to coat. Set aside.",
        "Preheat oven to 450°F. Roast lamb 10 minutes. Reduce temperature to 350°F.",
        "Meanwhile, mix potatoes, 2 tablespoons oil and oregano mixture in bowl.",
        "Arrange potatoes around lamb in roasting pan. Roast until thermometer inserted into thickest part of lamb registers 140°F, about 50 minutes.",
        "Transfer lamb to large platter. Add artichoke mixture to roasting pan with potatoes; mix well. Continue roasting vegetables until tender, about 20 minutes. Surround lamb with vegetables. Garnish with oregano sprigs and carve roast at table."
    ],
    "ingredients": [
        "1/2 cup (packed) fresh oregano leaves (about 3 bunches)",
        "8 large garlic cloves",
        "1 tablespoon coarse salt",
        "1 tablespoon ground black pepper",
        "1 4-pound semi-boneless leg of lamb, fat trimmed",
        "4 tablespoons olive oil",
        "5 tablespoons fresh lemon juice",
        "4 medium artichokes, stems and tops trimmed",
        "1 lemon, halved",
        "24 brine-cured black olives (such as Kalamata)",
        "6 8-ounce white potatoes, each cut lengthwise into 6 wedges",
        "Fresh oregano sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Herb",
        "Lamb",
        "Olive",
        "Potato",
        "Roast",
        "Artichoke"
    ],
    "title": "Roast Leg of Lamb with Potatoes, Artichokes and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/roast-leg-of-lamb-with-potatoes-artichokes-and-olives-1670"
}
