{
    "directions": [
        "Melt butter in heavy large skillet over medium heat. Add onions, celery and garlic and sauté until soft, about 8 minutes. Combine stuffing mixture, sage, salt, oregano, thyme, pepper and Italian Seasoning in large bowl. Stir in onion mixture and eggs. Add stock and mix well. Set aside.",
        "Preheat oven to 450°F. Rinse goose inside and out; pat dry, using paper towel. Rub goose inside and out with halved lemon. Season goose inside and out with salt and pepper. Fill main cavity and neck cavity loosely with stuffing. Place any remaining stuffing in small buttered baking dish and cover with foil. Run fingers between breast meat and skin to loosen skin. Place bacon slices under breast skin. Wrap goose in cheesecloth.",
        "Place goose on rack set into large roasting pan. Roast goose 30 minutes. Reduce heat to 350°F. Continue roasting until meat thermometer inserted into thickest part to thigh registers 180°F., basting every 20 minutes with pan juices, about 1 hour 20 minutes. (Place stuffing in covered baking dish in oven during last 40 minutes.) Remove cheesecloth. Transfer goose to platter. Pass stuffing separately."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter",
        "2 small onions, finely chopped",
        "2 celery stalks, diced",
        "5 garlic cloves, chopped",
        "1 14-ounce bag cubed herbed stuffing mix",
        "1 1/2 tablespoons rubbed or ground dried sage",
        "3/4 teaspoon salt",
        "1/2 teaspoon dried oregano, crumbled",
        "1/2 teaspoon dried thyme, crumbled",
        "1/2 teaspoon pepper",
        "1/2 teaspoon Italian Seasoning",
        "2 eggs, beaten to blend",
        "1 cup chicken stock or canned broth",
        "1 11- to 13-pound goose, fat removed from cavity",
        "1 lemon, halved",
        "3 bacon slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Onion",
        "Roast",
        "Sauté",
        "Christmas",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Sage",
        "Seattle",
        "Washington"
    ],
    "title": "Roast Goose with Garlic, Onion and Sage Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/roast-goose-with-garlic-onion-and-sage-stuffing-819"
}
