{
    "directions": [
        "Sprinkle entire surface of beef tenderloin with coarse kosher salt. Place beef on rack set over large rimmed baking sheet. Refrigerate uncovered at least 24 hours and up to 36 hours.",
        "Melt 2 tablespoons butter in large saucepan over medium-low heat. Add shallots; sauté until soft, 3 minutes. Add Cognac, rosemary, and 1 teaspoon cracked pepper and cook until liquid evaporates, 1 minute. Add Port; bring to simmer. Add all of beef stock. Boil until reduced to 1 1/2 cups, about 20 minutes. Strain into medium saucepan, pressing on solids to extract as much liquid as possible. Discard solids in strainer. DO AHEAD: Can be made 24 to 36 hours ahead. Cool slightly, then cover and chill.",
        "Let beef stand at room temperature 1 hour before roasting. Position rack in center of oven and preheat to 425°F. Rub beef all over with oil; sprinkle with 2 tablespoons cracked peppercorns, pressing to adhere. Return beef to rack on baking sheet and roast until instant-read thermometer inserted into thickest part of meat registers 125°F for medium-rare (135°F to 140°F in thinnest part), about 30 minutes. Remove roast from oven and let rest 15 minutes.",
        "Bring sauce to boil; whisk in remaining 2 tablespoons butter. Season sauce to taste with salt and pepper.",
        "Cut off string from roast. Cut roast crosswise into 1/2-inch-thick slices; arrange on platter. Serve with sauce.",
        "Chateau Coufran 2003 (France, $23). The leathery, earthy notes and subtle fruit in this medium-bodied Bordeaux are perfect for the tenderloin."
    ],
    "ingredients": [
        "1 4- to 5-pound trimmed whole beef tenderloin, tail end tucked under, tied every 3 inches",
        "2 teaspoons coarse kosher salt",
        "4 tablespoons (1/2 stick) chilled unsalted butter, divided",
        "1/4 cup finely chopped shallots",
        "3 tablespoons Cognac or brandy",
        "1 fresh rosemary sprig",
        "1 teaspoon coarsely cracked black pepper",
        "1 cup ruby or tawny Port",
        "Simple Homemade Beef Stock",
        "2 tablespoons extra-virgin olive oil",
        "2 tablespoons black peppercorns, coarsely cracked in mortar with pestle or in resealable plastic bag with mallet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Christmas",
        "Rosemary",
        "Beef Tenderloin",
        "Port",
        "Winter",
        "Shallot"
    ],
    "title": "Roast Beef Tenderloin with Port Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-beef-tenderloin-with-port-sauce-240690"
}
