{
    "directions": [
        "On a lightly floured surface roll out dough into a 12-inch round (about 1/8 inch thick). Fit dough into an 11-inch tart pan with a removable fluted rim. Freeze shell 15 minutes.",
        "Preheat oven to 375°F.",
        "Line shell with foil and fill with pie weights or raw rice. Bake shell in middle of oven until edge is pale golden, about 20 minutes. Carefully remove foil and weights or rice and bake shell 10 minutes more, or until bottom is golden. Leave oven on. Cool shell in pan on a rack.",
        "Halve squash and scoop out seeds. Lightly brush each cut side with about 1 teaspoon oil and on a baking sheet roast squash, cut sides down, in middle of oven 40 minutes, or until soft.",
        "While squash is roasting, thinly slice onion and in a heavy skillet cook in 1/2 tablespoon butter and remaining 1 1/2 teaspoons oil over moderate heat, stirring occasionally, until soft and golden brown, about 20 minutes.",
        "Cool squash and scoop out flesh. In a food processor purée squash. Add whole egg, egg yolk, and cream and blend well. Transfer mixture to a large bowl and stir in cheeses, herbs, onion, salt, and pepper to taste. Pour filling into shell, smoothing top.",
        "In a small skillet melt remaining tablespoon butter and stir in bread crumbs until combined well. Sprinkle bread crumb mixture evenly over filling. Bake tart in middle of oven 40 minutes, or until filling is set. Cool tart in pan on rack 10 minutes and carefully remove rim."
    ],
    "ingredients": [
        "pastry dough",
        "pie weights or raw rice for weighting shell",
        "1 small butternut squash (about 1 pound)",
        "1 1/2 teaspoons olive oil plus about 2 teaspoons for brushing squash",
        "1 small onion",
        "1 1/2 tablespoons unsalted butter",
        "1 whole large egg",
        "1/2 large egg yolk (1/2 tablespoon)",
        "1/3 cup heavy cream",
        "3/4 cup grated Italian Fontina cheese (about 2 1/2 ounces)",
        "1/3 cup freshly grated Parmesan (about 1 ounce)",
        "1/4 cup crumbled mild soft goat cheese (about 1 ounce)",
        "1 1/2 teaspoons minced fresh herbs such as rosemary, thyme, and marjoram leaves",
        "1/2 teaspoon salt",
        "freshly ground black pepper",
        "1/3 cup fine fresh bread crumbs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Vegetable",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Lunch",
        "Butternut Squash",
        "Fall",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted Butternut Squash and Caramelized Onion Tart",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-butternut-squash-and-caramelized-onion-tart-15748"
}
