{
    "directions": [
        "Preheat oven to 350°F. Season veal generously with dried thyme, salt and pepper. Heat heavy large skillet over high heat. Add veal bones and cook until some fat is rendered, turning occasionally, about 5 minutes. Add onions and sauté until brown, about 15 minutes. Sprinkle flour over and stir 3 minutes. Transfer mixture to large roasting pan, spreading onions in center and bones around edge. Add 1 brisket to same skillet and cook until brown, about 5 minutes per side. Transfer brisket to roasting pan and place atop onions. Repeat with second brisket.",
        "Add button mushrooms, stock, Marsala, dried mushrooms, garlic and allspice to same skillet. Bring mixture to boil, scraping up browned bits. Cover tightly with heavy-duty foil. Roast until briskets are very tender, about 2 hours. Uncover; let cool at least 30 minutes.",
        "Transfer briskets to platter. Remove bones from pan and discard. Spoon onions into strainer set over large saucepan. Press onions hard to release juices. Discard onions in strainer. Set mushrooms aside. Strain pan juices in roasting pan into same large saucepan. Spoon fat from top of pan juices and discard. Boil until pan juices coat spoon lightly, about 20 minutes. Return reserved mushrooms to sauce. Season to taste with salt and pepper.",
        "Cut briskets diagonally across grain into thin slices; trim fat, if desired. Overlap slices in large casserole. Spoon mushroom sauce over. (Can be prepared 3 days ahead. Cover with foil and refrigerate. Rewarm covered in 350°F oven before continuing, about 45 minutes.) Garnish with fresh thyme, if desired, and serve."
    ],
    "ingredients": [
        "2 6-to 7-pound point-end veal breasts, boned, fat trimmed (about 2 1/2 pounds each after boning), bones reserved and cut into pieces",
        "Dried thyme",
        "1 1/2 pounds medium onions, quartered",
        "2 tablespoons all purpose flour",
        "1 1/2 pounds button mushrooms, thickly sliced",
        "4 cups chicken stock or canned low-salt broth",
        "2 cups dry imported Marsala",
        "2 ounces dried porcini mushrooms, rinsed, drained",
        "8 large garlic cloves",
        "1/4 teaspoon (generous) ground allspice",
        "Fresh thyme (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Braise",
        "Hanukkah",
        "Veal",
        "Marsala",
        "Winter"
    ],
    "title": "Roast Veal Brisket with Marsala-Mushroom Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-veal-brisket-with-marsala-mushroom-sauce-2893"
}
