{
    "directions": [
        "Mince garlic and mash with salt. In a small bowl stir together garlic paste, herbs, pepper, and 3 tablespoons oil. Pat veal chops dry. Reserve 1 tablespoon herb mixture for sauce and rub remainder evenly onto chops. Veal chops can be prepared up to this point 1 day ahead and chilled, covered. Chill reserved herb mixture, covered.",
        "Preheat oven to 425°F.",
        "Quarter shallots and tomatoes lengthwise and in a bowl toss with 1 tablespoon oil, sugar, and salt and pepper to taste. Arrange tomatoes, cut sides up, in one layer in a shallow baking pan with shallots and roast in upper third of oven 20 minutes. Halve and pit olives. While vegetables are roasting, in a 12-inch nonstick skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and sear chops in batches until golden brown, about 3 minutes on each side. Transfer chops as seared to another shallow baking pan (do not wash skillet).",
        "Reduce temperature to 375°F. Transfer shallots and tomatoes to lower third of oven and put chops in upper third of oven. Roast vegetables until tender and caramelized, about 20 minutes. Roast chops until an instant-read thermometer inserted horizontally into chops registers 160°F. for medium, 20 to 25 minutes.",
        "While chops and vegetables are roasting, pour wine into skillet with reserved herb mixture and boil, scraping up brown bits, 1 minute. Boil mixture until reduced to about 1/4 cup, about 5 minutes. Add broth and boil mixture until reduced to about 3/4 cup, about 5 minutes.",
        "When chops are cooked, pour any meat juices from baking pan into wine mixture and bring jus to a boil. Cut butter into pieces and add with olives to jus. Swirl skillet to incorporate butter and boil until jus is slightly thickened. Season jus with salt and pepper. Serve chops over polenta with shallots and tomatoes, drizzled with olive jus."
    ],
    "ingredients": [
        "6 garlic cloves",
        "2 teaspoons salt",
        "3 tablespoons chopped fresh rosemary leaves",
        "3 tablespoons chopped fresh thyme leaves",
        "1 1/2 teaspoons freshly ground black pepper",
        "5 tablespoons olive oil",
        "six 1 1/4-inch-thick veal rib chops (12 to 14 ounces each), frenched if desired",
        "9 large shallots (about 3/4 pound)",
        "9 plum tomatoes (about 1 1/4 pounds)",
        "1/4 teaspoon sugar",
        "1/2 cup drained Kalamata olives",
        "1 1/2 cups dry white wine",
        "1 1/2 cups chicken broth",
        "2 tablespoons unsalted butter",
        "Accompaniment: soft polenta"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Olive",
        "Tomato",
        "Roast",
        "Rosemary",
        "Veal",
        "White Wine",
        "Winter",
        "Thyme",
        "Shallot",
        "Gourmet"
    ],
    "title": "Roasted Veal Chops with Shallots, Tomatoes, and Olive Jus",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-veal-chops-with-shallots-tomatoes-and-olive-jus-100581"
}
