{
    "directions": [
        "Whisk vinegar and lemon juice in small bowl; gradually whisk in oil. Season with salt and pepper.",
        "Preheat oven to 400°F. Brush 2 large rimmed baking sheets with oil; spray with nonstick spray. Whisk vinegar and sugar in small bowl; set aside. Cut squash halves crosswise into 1/4-inch-thick slices. Arrange squash in single layer on prepared sheets; brush with oil and sprinkle with coarse salt and pepper. Roast 5 minutes; brush with sugar-vinegar mixture. Turn squash over and brush with sugar-vinegar mixture; roast 5 minutes. Roast until squash is tender when pierced with small knife, about 15 minutes longer. Cool on sheets. DO AHEAD: Can be made 4 hours ahead. Let stand at room temperature. Arrange 5 to 6 endive leaves on each of 10 plates. Place butternut squash slices in center of each plate. Scatter apples, cheese, and cranberries over squash. Drizzle dressing over and serve."
    ],
    "ingredients": [
        "2 tablespoons balsamic vinegar",
        "2 tablespoons fresh lemon juice",
        "6 tablespoons extra-virgin olive oil",
        "Olive oil",
        "Nonstick vegetable oil spray",
        "1/4 cup balsamic vinegar",
        "2 teaspoons (packed) dark brown sugar",
        "2 2-pound butternut squash, peeled, halved lengthwise, seeded",
        "Coarse kosher salt",
        "4 heads of Belgian endive, root ends trimmed, leaves separated into individual leaves",
        "2 unpeeled Fuji apples, halved, cored, cut into matchstick-size strips",
        "8 ounces blue cheese (such as Maytag), coarsely crumbled",
        "1/2 cup dried cranberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Appetizer",
        "Christmas",
        "Vegetarian",
        "High Fiber",
        "Blue Cheese",
        "Apple",
        "Butternut Squash",
        "Fall",
        "Christmas Eve",
        "Potluck",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted Butternut Squash and Apple Salad",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-butternut-squash-and-apple-salad-350748"
}
