{
    "directions": [
        "Preheat oven to 375°F. Whisk maple syrup, soy sauce, rice vinegar, and hot pepper sauce in small bowl for glaze. Simmer Sherry in small saucepan until reduced to 1/2 cup, about 3 minutes.",
        "Run hands under chicken skin to loosen; rub most of butter under skin over breast and thighs. Rub remaining butter over outside of chicken. Sprinkle cavity with salt and pepper. Place chicken in roasting pan. Squeeze some juice from each orange piece over chicken. Stuff cavity with orange pieces, ginger, and garlic. Tuck wing tips under. Pour Sherry over chicken.",
        "Roast chicken 20 minutes. Add 1/4 cup water to pan. Roast 15 minutes longer. Brush chicken with glaze. Roast chicken until thermometer inserted into thickest part of thigh registers 170°F, brushing chicken with glaze every 10 minutes, about 40 minutes longer. Tilt chicken to allow juices from cavity to run into roasting pan. Transfer chicken to platter. Let stand 10 minutes (internal temperature will rise).",
        "Spoon fat from surface of pan juices. Add any remaining glaze to pan juices. Place roasting pan over 2 burners; bring sauce to boil. Serve sauce alongside chicken."
    ],
    "ingredients": [
        "1/4 cup pure maple syrup",
        "1 tablespoon soy sauce",
        "1 tablespoon rice vinegar",
        "1/2 teaspoon hot pepper sauce",
        "3/4 cup dry Sherry",
        "1 4 1/2-pound chicken, fat and giblets removed, rinsed and patted dry",
        "2 tablespoons (1/4 stick) butter, room temperature",
        "1/2 orange, cut into 4 pieces",
        "2 1/2-inch slices fresh ginger, smashed",
        "2 garlic cloves, smashed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Poultry",
        "Roast",
        "Christmas",
        "Orange",
        "Sherry",
        "Winter",
        "Maple Syrup",
        "Soy Sauce"
    ],
    "title": "Roast Chicken with Maple-Soy Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-maple-soy-glaze-233929"
}
