{
    "directions": [
        "Position a rack in the middle of the oven and preheat to 375°F. Arrange a steamer rack over a large pot of boiling water.",
        "Remove the green outer leaves from the cauliflower, place it on the steamer rack, and steam until tender, about 10 minutes. Transfer to a large bowl to cool. Once the cauliflower is cool enough to handle, use your hands to gently break the florets from the thick central stalk—try to break the cauliflower into large florets rather than small pieces. Arrange the florets, in one layer, in a 12- by 8-inch baking dish and set aside.",
        "In a large heavy saucepan over moderate heat, melt the butter. Reduce the heat to low, add the flour and salt, and whisk until both are incorporated and the mixture turns golden brown, about 2 minutes. Raise the heat to moderate and add the milk, whisking constantly, until a smooth sauce forms (the sauce should be thick and glossy, but still runny), about 5 minutes. (If the sauce is too thick, gradually whisk in additional milk until the desired consistency is achieved.) Add 1 cup of the grated cheese and whisk until melted, about 1 minute. Pour the cheese sauce over the cauliflower, making sure to cover all the florets. Sprinkle with the remaining 1/4 cup cheese and season with pepper, then bake until the cauliflower is golden brown and the cheese sauce is bubbling, about 30 minutes."
    ],
    "ingredients": [
        "1 large head cauliflower (about 1 pound total)",
        "4 tablespoons (1/2 stick) unsalted butter",
        "1/4 cup all-purpose flour",
        "1/8 teaspoon fine sea salt",
        "2 cups whole milk",
        "10 ounces Cheddar cheese or similar, grated (about 1 1/4 cup)",
        "Special equipment: 12- by 8-inch baking dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Roast",
        "St. Patrick's Day",
        "Cheddar",
        "Cauliflower",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Cauliflower with Cheddar Cheese Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-cauliflower-with-cheddar-cheese-sauce-363911"
}
