{
    "directions": [
        "Using small sharp knife, make sixteen 1-inch-deep slits all over lamb. Push 1/2 anchovy and 1 garlic quarter into each slit. Place lamb on small rack in center of large rimmed baking sheet. Brush lamb with olive oil. Cover with plastic wrap; chill overnight.",
        "Combine parsley, 3 whole anchovies, 3 whole garlic cloves, and lemon peel in processor. Add 6 tablespoons olive oil; blend to coarse paste. Add butter; blend until smooth. Season butter with coarse salt and freshly ground pepper. Transfer anchovy-parsley butter to small bowl. DO AHEAD: Can be made 1 day ahead. Cover; chill. Bring to room temperature before using.",
        "Preheat oven to 450°F. Roast lamb uncovered 30 minutes. Reduce heat to 325°F. Roast lamb until thermometer inserted into thickest part registers 135°F to 140°F, about 1 hour longer. Let lamb rest 30 to 45 minutes.",
        "Meanwhile, prepare barbecue (medium-high heat). Combine beans and 3 tablespoons oil in large bowl; sprinkle with coarse salt and pepper and toss to coat.",
        "Place grill basket on barbecue. Spread out beans in basket (reserve bowl). Grill beans until slightly charred, tossing often, 15 to 18 minutes. Return beans to reserved bowl. Toss with 1 1/2 tablespoons oil and 1 1/2 tablespoons lemon juice. Season with coarse salt and pepper.",
        "Transfer lamb to platter. Serve with grilled beans and anchovy-parsley butter."
    ],
    "ingredients": [
        "1 6 3/4-pound bone-in leg of lamb, well trimmed",
        "11 anchovy fillets; 8 halved, 3 whole",
        "7 garlic cloves; 4 quartered, 3 whole",
        "10 1/2 tablespoons olive oil, divided, plus additional (for brushing lamb)",
        "1 1/2 cups (lightly packed) fresh Italian parsley leaves",
        "2 1/4 teaspoons finely grated lemon peel",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "Coarse kosher salt",
        "2 1/2 pounds summer beans (such as green, purple, and yellow wax beans)",
        "1 1/2 tablespoons fresh lemon juice",
        "Special equipment: Grill basket for barbecue"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Roast",
        "High Fiber",
        "Backyard BBQ",
        "Dinner",
        "Grill",
        "Grill/Barbecue",
        "Parsley",
        "Butter",
        "Anchovy",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roast Leg of Lamb with Grilled Summer Beans and Anchovy-Parsley Butter",
    "url": "http://www.epicurious.com/recipes/food/views/roast-leg-of-lamb-with-grilled-summer-beans-and-anchovy-parsley-butter-360749"
}
