{
    "directions": [
        "Preheat the oven to 425°F.",
        "In a small bowl, combine butter, orange zest, orange juice, 1/2 teaspoon salt and 1/4 teaspoon pepper; stir well to combine. Set the citrus butter aside.",
        "Peel the carrots and parsnips and cut them lengthwise into long wedges, which that will get a bit browned and crisp at the ends. If I am roasting young carrots small enough to cook whole or halved lengthwise, I like to leave a half inch or so of the greens attached—looks pretty. Parsnips will cook at about the same rate as carrots, so cut them into similar-size pieces.",
        "On a rimmed baking sheet, toss vegetables with oil; season with 1 teaspoon salt and toss again. Spread the vegetables flat and roast until tender and lightly browned (and more than lightly browned on the thinner edges), tossing halfway through, 20 to 30 minutes. If they seem to be getting too browned before tender, sprinkle them with a little water and keep roasting.",
        "When vegetables are roasted, place in a warmed dish and spoon the citrus butter on, tossing them gently to melt the butter and coat the roots. Serve warm."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter, at room temperature",
        "1 teaspoon grated orange zest, plus 1 1/2 teaspoons orange juice",
        "1 1/2 teaspoons kosher salt, divided",
        "1/4 teaspoon freshly ground black pepper",
        "1 pound carrots, peeled",
        "1 pound parsnips, peeled",
        "2 tablespoons extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Side",
        "Roast",
        "Kid-Friendly",
        "Quick & Easy",
        "Carrot",
        "Parsnip",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Carrots and Parsnips with Citrus Butter",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-carrots-and-parsnips-with-citrus-butter-51262740"
}
