{
    "directions": [
        "Preheat an oven to 425 degrees F (220 degrees C).",
        "Whisk the 1 tablespoon olive oil, salt, and pepper together in a bowl; toss the sweet potato wedges with the olive oil to coat. Place the bell pepper halves with their cut-sides down onto a baking sheet; arrange the sweet potato wedges around the peppers.",
        "Roast in the preheated oven until the potatoes are slightly charred and crispy and the the bell pepper skin is blistered, about 45 minutes. Shake the pan once mid-way through the cooking time to keep the mixture from sticking to the pan. Set the potato wedges aside to cool. Place the pepper halves into a bowl and cover with plastic wrap; allow to sweat until cool, about 20 minutes. Peel the skin from the peppers and discard.",
        "Mince the garlic and shallot together in a food processor. Add the peeled peppers, lemon juice, mustard, hot sauce, salt, and pepper; puree until smooth. Slowly stream the 1/2 cup olive oil and the walnut oil into the mixture as it blends. Transfer to a large bowl; add the arugula leaves and toss to coat.",
        "Divide the potato wedges between 4 salad plates; top the wedges with equal amounts of the dressed arugula leaves. Shave the Parmigiano-Reggiano cheese over the salads to serve. Serve immediately."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "salt and ground black pepper to taste",
        "4 sweet potatoes, peeled and cut into wedges",
        "2 red bell peppers, halved and seeded",
        "1 clove garlic",
        "1 shallot",
        "1 tablespoon lemon juice",
        "1 teaspoon Dijon mustard",
        "1 dash hot pepper sauce (such as Tabasco®)",
        "1 teaspoon salt",
        "ground black pepper to taste",
        "1/2 cup extra virgin olive oil",
        "1/2 cup walnut oil",
        "1/2 pound baby arugula leaves",
        "1 (2 inch) piece Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Sweet Potato and Rocket Salad",
    "url": "http://allrecipes.com/recipe/195844/roasted-sweet-potato-and-rocket-salad/"
}
