{
    "directions": [
        "Preheat the oven to 425°F. In a roasting pan large enough to hold the venison racks without crowding them, toss the shallots with 2 tablespoons of the oil and salt and pepper to taste and roast them in the middle of the oven, stirring occasionally, for 25 to 30 minutes, or until they are golden. Pat the venison dry, season it with salt and pepper, and rub it generously with the additional oil. Heat a large heavy skillet over high heat until it is hot and in it sear the venison on all sides. Push the shallots to the sides of the roasting pan, stand the venison racks in the middle of the pan, allowing the bones to rest together, and roast the mixture in the middle of the oven for 23 minutes, or until a meat thermometer registers 125°F., for rare meat. Transfer the racks with shallots to a platter and let them stand, covered loosely with foil, for 15 minutes. To the roasting pan add the broth, the wine, the water, and the juniper berries and simmer the mixture, scraping up the brown bits, for 5 minutes. Strain the mixture through a fine sieve set over a small saucepan, whisk the cornstarch mixture, and add it to the saucepan with the cranberries, the vinegar, and salt and pepper to taste. Simmer the gravy, whisking, for 5 minutes. Cut the venison into individual chops and serve it with the shallots and the gravy."
    ],
    "ingredients": [
        "an 8- to 11 rib (3- to 4-pound) rack of venison, halved to form two 4- to 6-rib racks and any tough membranes trimmed",
        "2 pounds shallots, trimmed and peeled",
        "2 tablespoons vegetable oil plus additional for rubbing the venison",
        "1/2 cup beef broth",
        "1/2 cup red wine",
        "1/2 cup water",
        "1 tablespoon juniper berries (available in the spice section of supermarkets), crushed lightly",
        "2 teaspoons cornstarch dissolved in 2 tablespoons water",
        "1/3 cup dried cranberries (available at specialty foods shops)",
        "1 tablespoon balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Roast",
        "Dried Fruit",
        "Venison",
        "Winter",
        "Shallot",
        "Gourmet"
    ],
    "title": "Roasted Rack of Venison and Shallots with Dried-Cranberry Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-rack-of-venison-and-shallots-with-dried-cranberry-gravy-10985"
}
