{
    "directions": [
        "Combine chopped rosemary and next 4 ingredients in mortar and crush with pestle or blend in mini processor until coarse paste forms. Mix in oil. Rinse chicken; pat dry. Rub 1 teaspoon herb mixture over bone side of chicken. Turn chicken over and open like book; place chicken, skin side up, on work surface. Loosen skin from breast and thigh meat; rub remaining herb mixture over meat under skin. Rub any remaining herb mixture on outside of chicken.",
        "Place rosemary sprigs in 13x9x2-inch ceramic or glass baking dish. Place chicken, skin side up, atop rosemary sprigs in dish. DO AHEAD: Can be made 8 hours ahead. Cover with plastic wrap and chill. Let stand at room temperature 1 hour before roasting.",
        "Position rack in center of oven and preheat to 400°F. Roast chicken uncovered until instant-read thermometer inserted into thickest part of thigh registers 170°F, about 1 1/2 hours. Transfer chicken to platter and serve.",
        "*Available in the spice section of most supermarkets.",
        "Chardonnay is a good match for this menu. In keeping with the spirit of this earth-friendly dinner, go with a domestic bottle. We like the 2006 Frog's Leap Chardonnay ($24) from Napa, which has bright citrus and stone fruit flavors."
    ],
    "ingredients": [
        "1/4 cup (loosely packed) fresh rosemary leaves, finely chopped, plus 3 whole fresh rosemary sprigs",
        "5 juniper berries*",
        "2 garlic cloves, chopped",
        "1/2 teaspoon black peppercorns",
        "3/4 teaspoon fine sea salt or coarse kosher salt",
        "4 teaspoons olive oil",
        "1 5- to 6-pound whole chicken (preferably organic), backbone and neck removed (reserved for Light Homemade Chicken Stock , if making)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Roast",
        "Low Cal",
        "Rosemary"
    ],
    "title": "Roast Chicken with Rosemary-Garlic Paste",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-rosemary-garlic-paste-241348"
}
