{
    "directions": [
        "Whisk mayonnaise, oil, oregano, garlic, lemon juice, and lemon peel in small bowl to blend. Season aioli to taste with salt and freshly ground black pepper. DO AHEAD: Can be made 2 days ahead. Cover and chill.",
        "Bring large saucepan of salted water to boil. Fill large bowl with cold water; squeeze juice from lemon halves into water. Working with 1 artichoke at a time, pull off all dark green outer leaves until only tender inner yellow leaves remain. Cut off top 1 inch from artichoke. Cut off stem and trim around stem base of artichoke. Cut artichoke lengthwise in half and immediately drop into lemon water to prevent discoloration. Repeat with remaining artichokes.",
        "Drain artichokes, then add to saucepan of boiling salted water and blanch 3 minutes. Drain again. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Preheat oven to 425°F. Line 2 rimmed baking sheets with foil. Place artichokes on 1 prepared baking sheet. Drizzle 1 tablespoon oil over; sprinkle with salt and pepper and toss to coat. Spread in even layer on sheet. Place asparagus spears on second baking sheet. Drizzle remaining 2 tablespoons oil over; sprinkle with salt and pepper and toss to coat. Spread in even layer on sheet. Roast asparagus and artichokes until tender, about 8 minutes for asparagus and about 15 minutes for artichokes. Arrange artichokes and asparagus on platter. Place bowl of aioli in center for dipping and serve."
    ],
    "ingredients": [
        "1 cup mayonnaise",
        "1 tablespoon extra-virgin olive oil",
        "2 teaspoons chopped fresh oregano",
        "1 garlic clove, pressed",
        "1 teaspoon fresh lemon juice",
        "1/2 teaspoon finely grated lemon peel",
        "1 lemon, halved",
        "12 baby artichokes",
        "3 tablespoons olive oil, divided",
        "2 1-pound bunches thick asparagus spears, tough ends trimmed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Roast",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Lemon",
        "Artichoke",
        "Asparagus",
        "Summer",
        "Party",
        "Oregano",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted Asparagus and Baby Artichokes with Lemon-Oregano Aioli",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-asparagus-and-baby-artichokes-with-lemon-oregano-aioli-359318"
}
