{
    "directions": [
        "Stir 1/2 tablespoon melted butter, honey, lemon juice, garlic, thyme, ground chiles, cumin, cinnamon, and pinch of cayenne pepper in small bowl to blend. Season to taste with salt. Let glaze stand at least 45 minutes to allow flavors to blend. Do AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Preheat oven to 400°F. Line large rimmed baking sheet with parchment paper. Spread parsnips, turnips, and rutabagas evenly on prepared baking sheet. Drizzle remaining 1 1/2 tablespoons melted butter and olive oil over; sprinkle with salt and pepper and toss to coat well. Roast until vegetables are soft and browned in spots, tossing occasionally, about 50 minutes.",
        "Pour glaze over vegetables; toss to coat evenly. Roast until glaze is absorbed and vegetables are browned, tossing occasionally, about 15 minutes longer. Serve warm."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter, melted, divided",
        "2 tablespoons honey",
        "1 1/2 tablespoons fresh lemon juice",
        "1 garlic clove, minced",
        "1 teaspoon chopped fresh thyme",
        "1/2 teaspoon ground ancho chiles",
        "1/2 teaspoon ground cumin",
        "1/8 teaspoon ground cinnamon",
        "Pinch of cayenne pepper",
        "12 ounces parsnips, peeled, thin ends halved lengthwise, thick ends quartered lengthwise, cut crosswise into 2-inch pieces",
        "12 ounces turnips, peeled, cut into 1-inch wedges",
        "12 ounces rutabaga, trimmed, peeled, cut into 3/4-to 1-inch wedges",
        "1 1/2 tablespoons extra-virgin olive oil",
        "Coarse kosher salt",
        "Ingredient info: Look for ground ancho chiles in the spice section of many supermarkets and at Latin markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Roast",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Root Vegetable",
        "Parsnip",
        "Turnip",
        "Fall",
        "Healthy",
        "Honey",
        "Rutabaga",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted Parsnips, Turnips, and Rutabagas with Ancho-Spiced Honey Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-parsnips-turnips-and-rutabagas-with-ancho-spiced-honey-glaze-361291"
}
