{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Place 1/2 cup of olive oil in a large bowl.  Toss the cubed potatoes in the oil until coated, and then spread them evenly on a baking sheet.",
        "Pass the red peppers through the bowl of oil, making sure they are evenly coated.  Place on a separate baking sheet.",
        "Cut about 1/2 inch off the tops of the garlic and drizzle with the remaining oil from the bowl.  Place on the baking sheet with the red peppers.  Sprinkle the potatoes, peppers and garlic with salt and pepper, and then place both sheets in the oven for about 20 minutes.",
        "Check the potatoes: they should be soft, brown and crispy.  If not, return them to the oven for an additional 10 minutes or until they are done.  The peppers and garlic will take longer, and are done when the skins on the peppers are black and garlic is dark brown (no more than 40 minutes total).",
        "Once everything has been roasted, place the potatoes in a large bowl and seal the peppers in a plastic bag to let them steam for 10 minutes.  (This will loosen their skins.)",
        "Take the peppers out of the bag, remove their skins and seeds and chop them up.  Add to the bowl with the potatoes and stir to mix.",
        "Turn the garlic heads upside down and squeeze the softened garlic past into a separate, small bowl.  Mix in the balsamic vinegar, 1/3 cup olive oil and oregano until smooth.  Pour the dressing onto the potatoes and peppers and toss to coat.  Season to taste with additional salt and pepper.  Best when served warm or at room temperature.  To prepare in advance for an occasion, refrigerate and then reheat in the microwave just until warmed through."
    ],
    "ingredients": [
        "8 red potatoes - unpeeled, scrubbed and cubed",
        "2 red bell peppers",
        "2 medium heads garlic",
        "1/2 cup olive oil",
        "salt and pepper to taste",
        "1/3 cup balsamic vinegar",
        "1/3 cup olive oil",
        "1 teaspoon dried oregano"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Potato and Garlic Salad",
    "url": "http://allrecipes.com/recipe/24818/roasted-potato-and-garlic-salad/"
}
