{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Season roast generously on all sides with salt and black pepper.",
        "Heat olive oil in a large oven-proof skillet over medium-high heat. Cook roast in hot oil until browned on all sides, 3 to 4 minutes per side. Add shallot, cut-side down, to skillet and place rosemary sprigs on top of roast.",
        "Roast pork in the preheated oven for 45 minutes. Flip pork, place rosemary sprigs back on top of roast, and break up shallots with a spoon. Continue roasting until slightly pink in the center, about 45 minutes more. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
        "Transfer roast to a platter to rest for 10 minutes. Drizzle any excess fat in the skillet over the top of roast.",
        "Place the same skillet over medium heat. Stir blueberries into skillet and cook and stir until soft, 1 to 2 minutes. Pour port wine into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon.",
        "Stir chicken broth into blueberry mixture, increase heat to medium-high, and cook until liquid is reduced by half, 3 to 4 minutes. Reduce heat to low, stir cold butter into sauce and whisk until completely incorporated. Strain sauce through a fine-mesh sieve into a bowl.",
        "Slice pork roast against the grain into thin slices and top with blueberry sauce."
    ],
    "ingredients": [
        "1 (2 1/2 pound) pork shoulder roast",
        "salt and ground black pepper to taste",
        "1 tablespoon olive oil, or as needed",
        "1 large shallot, halved",
        "3 sprigs fresh rosemary",
        "1 cup fresh blueberries",
        "2/3 cup port wine",
        "1/2 cup chicken broth",
        "2 tablespoons cold butter, or more to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roast Pork with Blueberry Port Sauce",
    "url": "http://allrecipes.com/recipe/238586/roast-pork-with-blueberry-port-sauce/"
}
