{
    "directions": [
        "Mix 1 tablespoon thyme, 2 teaspoons coarse salt, and 2 pressed garlic cloves in small bowl. Rub salt mixture over beef tenderloin. Wrap in plastic. Place in 11x7x2-inch baking dish and chill at least 1 day and up to 3 days.",
        "Heat 3 tablespoons oil in heavy large skillet over high heat. Add oyster and chanterelle mushrooms and sauté until browned, about 8 minutes. Add minced shallot, 1 pressed garlic clove, and 1 teaspoon thyme; sauté 2 minutes. Add 2 tablespoons brandy and stir 20 seconds. Add cream; stir until almost all liquid is absorbed, about 3 minutes. DO AHEAD: Can be made 2 hours ahead. Cover and let stand at room temperature.",
        "Preheat oven to 400°F. Brush heavy large roasting pan with oil. Heat remaining 1 tablespoon oil in heavy large skillet over medium-high heat. Add beef tenderloin and cook until browned on all sides, about 5 minutes Total. Transfer to prepared roasting pan. Roast until instant-read thermometer inserted into center registers 118°F for rare, about 28 minutes. Transfer beef to cutting board; let rest 10 minutes.",
        "Meanwhile, rewarm mushroom mixture. Sprinkle flour over; stir to coat. Add remaining 2 tablespoons brandy to roasting pan. Heat over medium heat, scraping up browned bits, then add to mushroom mixture. Add Beef Reduction to mushrooms and bring to boil. Reduce heat to medium-high and simmer until slightly thickened, about 5 minutes. Stir in remaining 1 teaspoon thyme. Season to taste with salt and pepper.",
        "Thinly slice beef. Divide Caramelized-Shallot Mashed Potatoes among 6 plates. Arrange beef slices on plates. Spoon mushroom sauce over, sprinkle with parsley, and serve."
    ],
    "ingredients": [
        "1 tablespoon plus 2 teaspoons minced fresh thyme, divided",
        "2 teaspoons coarse kosher salt",
        "3 garlic cloves, pressed, divided",
        "1 2 1/2- to 2 3/4-pound beef tenderloin, well trimmed",
        "4 tablespoons olive oil, divided, plus additional for brushing",
        "8 ounces fresh oyster mushrooms, sliced (about 4 cups lightly packed)",
        "8 ounces fresh chanterelle mushrooms, sliced (about 4 cups lightly packed)",
        "2 tablespoons minced shallot",
        "4 tablespoons brandy, divided",
        "1/2 cup whipping cream",
        "1 rounded tablespoon all purpose flour",
        "Beef Reduction",
        "Caramelized-Shallot Mashed Potatoes",
        "2 tablespoons minced fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Roast",
        "Christmas",
        "Dinner",
        "Beef Tenderloin",
        "Brandy",
        "Winter",
        "Family Reunion",
        "Shallot",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Beef with Wild Mushroom Sauce and Caramelized-Shallot Mashed Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/roast-beef-with-wild-mushroom-sauce-and-caramelized-shallot-mashed-potatoes-241622"
}
