{
    "directions": [
        "Preheat oven to 450°F. Using back of spoon, press enough chipotles through fine sieve into small bowl to measure 2 teaspoons puree. Mix puree, jam, vinegar, and cumin in bowl; season glaze to taste with salt.",
        "Coat small rimmed baking sheet with nonstick spray. Arrange salmon on sheet; sprinkle with salt and black pepper. Spread half of glaze over each fillet. Roast until just opaque in center, about 10 minutes.",
        "Meanwhile, puree hominy and 3 tablespoons reserved juice in mini processor until almost smooth. Transfer to small skillet. Add butter and cilantro. Stir over medium heat until warmed through, mixing in more reserved juice by teaspoonfuls if too thick. Season to taste with salt and pepper.",
        "Divide hominy between 2 plates, top with salmon, and serve."
    ],
    "ingredients": [
        "3 chipotle chiles (about) from canned chipotle chiles in adobo",
        "2 tablespoons apricot jam or preserves",
        "1 1/4 teaspoons red wine vinegar",
        "1/2 teaspoon ground cumin",
        "Nonstick vegetable oil spray",
        "2 6-to 7-ounce salmon fillets with skin (scant 1 inch thick)",
        "1 15-ounce can hominy, drained, juice reserved",
        "1 tablespoon butter",
        "1 tablespoon chopped fresh cilantro",
        "Ingredient info: Chipotle chiles are dried, smoked jalapeños in a spicy tomato sauce called adobo; they're available at some supermarkets and at specialty foods stores and Latin markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Roast",
        "Valentine's Day",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Salmon",
        "Healthy",
        "Hominy/Cornmeal/Masa",
        "Chile Pepper",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Salmon with Sweet Chipotle Glaze and Hominy Puree",
    "url": "http://www.epicurious.com/recipes/food/views/roast-salmon-with-sweet-chipotle-glaze-and-hominy-puree-364676"
}
