{
    "directions": [
        "Cut the cabbage into the thinnest strips you can and make sure those pieces are no longer than 2 inches. This is a great time to get good with your knife if you are looking for a silver fking lining in all that chopping. Chop the carrot into thin matchsticks of the same length. Got that st down now, right? In a small bowl, mix together the lime juice, vinegar, oil, and salt. Add the dressing right before you are going to eat and toss that s**t well. Fold in the cilantro just before serving.",
        "Crank your oven to 400°F. Chop the cauliflower into small florets no bigger than a quarter. In a saucepan over medium heat, warm the beer, broth, lime juice, tamari, hot sauce, and garlic. Add the cauliflower and simmer for about 90 seconds. Drain.",
        "In a large bowl. toss the spices, salt, and olive oil together. Add the cauliflower and onion and stir 'til those f**kers are coated. Dump it on a rimmed baking sheet and bake until browned, stirring halfway, about 20 minutes.",
        "To assemble the tacos, warm the tortillas in the oven or microwave for a hot minute and then pile them high with the cauliflower filling, slices of avocado, some of the slaw, and top with plenty of salsa."
    ],
    "ingredients": [
        "1/2 head of green cabbage (about 1/2 pound)",
        "1 small carrot",
        "2 tablespoons lime juice",
        "2 tablespoons rice vinegar",
        "1 teaspoon olive oil",
        "1/8 teaspoon salt",
        "1/3 cup chopped cilantro",
        "1 head cauliflower (about 1 pound)",
        "3/4 cup beer",
        "1/4 cup vegetable broth",
        "1 tablespoon lime juice",
        "11/2 teaspoons tamari or soy sauce",
        "11/2 tablespoons chipotle hot sauce",
        "1 to 2 garlic cloves, sliced",
        "11/2 teaspoons chili powder",
        "1 teaspoon smoked paprika",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon garlic powder",
        "Pinch of salt",
        "1 tablespoon olive oil",
        "1/2 yellow onion, chopped",
        "6 corn tortillas",
        "1 avocado, sliced",
        "Tomato salsa, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Vegetarian",
        "Cauliflower",
        "Vegan",
        "Cabbage",
        "Cilantro",
        "Tortillas"
    ],
    "title": "Roasted Beer and Lime Cauliflower Tacos with Cilantro Coleslaw",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-beer-and-lime-cauliflower-tacos-with-cilantro-coleslaw-51253830"
}
