{
    "directions": [
        "Preheat oven to 425°F. Cut large red and yellow bell peppers in half through stem end. Remove seeds and cut out ribs, leaving stems intact. Finely chop small red bell pepper; set aside. Spread 1 tablespoon oil over rimmed baking sheet. Place pepper halves, cut side down, on prepared sheet. Roast 15 minutes. Turn over; roast until slightly softened, about 15 minutes longer. Remove from oven.",
        "Meanwhile, bring 2 cups water to boil in medium saucepan; add bulgur and 1 teaspoon salt. Remove from heat. Cover and let stand until bulgur is tender, about 30 minutes. Drain well.",
        "Heat 1 tablespoon oil in large skillet over medium-high heat. Add chopped red pepper; sauté until tender, about 3 minutes. Add currants and pine nuts; sauté 2 minutes. Add cumin; stir 20 seconds. Mix in spinach; stir until beginning to wilt, about 2 minutes. Remove from heat. Mix in bulgur, mint, and dill. Stir in half of cheese. Season with salt and pepper. Divide bulgur mixture among pepper halves. Sprinkle with remaining cheese. (Can be made 1 day ahead. Cover and chill.)",
        "Preheat oven to 425°F. Bake stuffed peppers until heated through, about 25 minutes (or 30 minutes if chilled); serve.",
        "*Also called cracked wheat; available at natural foods stores and supermarkets."
    ],
    "ingredients": [
        "3 red bell peppers (2 large and 1 small)",
        "2 large yellow bell peppers",
        "2 tablespoons olive oil, divided",
        "2 cups water",
        "1 cup coarse or medium bulgur*",
        "1 teaspoon salt",
        "1/4 cup dried currants",
        "2 tablespoons pine nuts",
        "2 teaspoons ground cumin",
        "1 6-ounce bag fresh baby spinach leaves",
        "3 tablespoons chopped fresh mint",
        "3 tablespoons chopped fresh dill",
        "1 cup crumbled feta cheese (about 4 ounces), divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Pepper",
        "Roast",
        "Low Fat",
        "Vegetarian",
        "Healthy"
    ],
    "title": "Roasted Bell Pepper Halves Stuffed with Bulgur and Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-bell-pepper-halves-stuffed-with-bulgur-and-spinach-230629"
}
