{
    "directions": [
        "Put oven rack in lowest position and preheat oven to 425°F.",
        "Tie celery, parsley, thyme, marjoram, sage, and bay leaf into a bundle with kitchen string to make a bouquet garni.",
        "Rinse turkey inside and out and pat dry. Rub turkey inside and out with salt and pepper, then put onion and bouquet garni in large cavity. Working from large cavity end, run your fingers between skin and flesh of breast to loosen skin without tearing. Put 1 tablespoon butter under skin of each side of breast and massage skin from outside to spread butter evenly. Tie drumsticks together with kitchen string and fold wings under body. Put turkey on rack in a large flameproof roasting pan and, if using remote thermometer, insert it into thickest part of a thigh (do not touch bone).",
        "Brush remaining 2 tablespoons butter over turkey, then roast 30 minutes.",
        "Reduce oven temperature to 350°F. Baste turkey with pan drippings or butter, then continue to roast, basting every 30 minutes, until a thigh registers 165°F on thermometer, 2 to 2 1/2 hours more.",
        "Carefully tilt turkey so any juices from inside cavity run into roasting pan, then transfer turkey to a serving platter and discard onion and bouquet garni from cavity. Let turkey stand 30 to 40 minutes (thigh temperature will rise to 175°F).",
        "Remove rack from roasting pan and pour pan juices through a sieve into a 1-quart glass measure. Straddle roasting pan across two burners, then add cider and deglaze pan by boiling over high heat, stirring and scraping up brown bits, until reduced to about 1/2 cup, 3 to 5 minutes. Pour cider through sieve into glass measure with pan juices, then skim fat, reserving 1/4 cup of it. (Reserve 6 tablespoons total if using turkey fat for wild rice stuffing; recipe follows.) Add enough turkey stock to drippings to total 4 cups.",
        "Cook chopped onions in butter in a 12-inch heavy skillet over moderate heat, stirring occasionally, until golden brown, about 10 minutes. Add sage and cook, stirring, 1 minute. Add turkey stock mixture and any turkey juices accumulated on platter and bring to a boil. Stir together flour and reserved 1/4 cup fat in a small bowl, then whisk into gravy. Reduce heat and simmer gravy, uncovered, whisking occasionally, 10 minutes. Season with salt and pepper.",
        "Serve turkey with gravy on the side.",
        "*Available at most cookware stores and cooking.com"
    ],
    "ingredients": [
        "1 (3-inch) piece celery",
        "2 fresh flat-leaf parsley sprigs",
        "2 fresh thyme sprigs",
        "2 fresh marjoram sprigs",
        "2 large fresh sage leaves",
        "1 Turkish or 1/2 California bay leaf",
        "1 (12- to 14 pound) turkey (preferably kosher), any feathers and quills removed with tweezers or needlenose pliers, and neck and giblets (excluding liver) reserved for makingturkey stock",
        "1 tablespoon salt",
        "1 teaspoon black pepper",
        "1 onion, peeled and stuck with 2 whole cloves",
        "1/2 stick (1/4 cup) unsalted butter, softened, plus additional if necessary for basting",
        "1 cup hard cider or sparkling hard cider",
        "About 4 cupsturkey stock",
        "1 pounds onions, finely chopped (2 cups)",
        "3 tablespoons unsalted butter",
        "1 tablespoon finely chopped fresh sage or 3/4 teaspoon dried",
        "1/3 cup all-purpose flour",
        "Special equipment: kitchen string; a metal flat rack (use a cooling rack if necessary) small enough to just fit inside roasting pan; an instant-read thermometer or remote digital thermometer*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Apple",
        "Fall",
        "Kosher",
        "Sage",
        "Gourmet"
    ],
    "title": "Roast Turkey with Cider Sage Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-cider-sage-gravy-108738"
}
