{
    "directions": [
        "Preheat the oven to 375 degrees. Heat the oil in a large ovenproof skillet over high heat. Season the pork with salt and pepper and sear on all sides until golden brown. Combine the mustard and vinegar and brush over the pork. Transfer to the oven and roast the pork until a thermometer inserted in the center reads 145 degrees, about 35 minutes.",
        "Transfer the pork to a cutting board and tent with foil for 10 minutes. Remove strings, slice and serve with Fall Vegetable Cobbler (recipe below)",
        "Preheat the oven to 375 degrees. Whisk the broth and 1/4 cup flour in a saucepan over medium heat. Add the mustard and vegetables; simmer until thickened, about 2 minutes. Whisk in 2 tablespoons butter and salt and pepper to taste; transfer to a 3-quart baking dish.",
        "Whisk the remaining 1 3/4 cups flour, the baking powder and a pinch of salt in a bowl. Rub in the cold cubed butter with your hands until the dough resembles coarse meal. Lightly stir in 3/4 cup cream with a fork. Place big spoonfuls of dough (about 6) on top of the vegetables and brush with the remaining 1/4 cup cream. Bake until golden brown and cooked through, about 45 minutes. Scatter parsley on top.",
        "Prep Time: 30 minutes",
        "Cook Time: 1 hour",
        "Photograph by Tina Rupp"
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "1 boneless center-cut pork loin roast (about 2 pounds), trimmed and tied (see below)",
        "Kosher salt and freshly ground pepper",
        "2 tablespoons whole-grain mustard",
        "2 tablespoons cider vinegar",
        "4 cups low-sodium chicken broth",
        "2 cups all-purpose flour",
        "2 tablespoons whole-grain mustard",
        "1 large turnip, peeled and cut into 3/4-inch pieces",
        "2 medium russet potatoes, peeled and cut into 1/2-inch pieces",
        "4 large carrots, sliced",
        "8 tablespoons unsalted butter; 6 tablespoons cut into cubes and kept cold",
        "Kosher salt and freshly ground pepper",
        "1 tablespoon baking powder",
        "1 cup heavy cream",
        "1 bunch fresh parsley, chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pork Roast",
        "Meat",
        "Pork",
        "Roast Recipes",
        "Pork Loin",
        "Main Dish Recipes"
    ],
    "title": "Roast Pork Loin",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/roast-pork-loin-recipe2"
}
