{
    "directions": [
        "Remove excess skin, fat and quills from goose. Carefully lower goose into large pot of boiling water. Boil 1 minute. Remove from water. Pat dry. Place on rack in large pan. Chill uncovered 2 days.",
        "Melt butter in heavy large saucepan over medium heat. Add goose neck; cook until brown, turning once, about 5 minutes. Add slice shallots; sauté until tender, about 4 minutes. Add 1 1/2 cups Madeira and 1 orange. Boil until reduced by 1/3, scraping up browned bits, about 3 minutes. Add broth and juice. Boil until reduced to 2 cups liquid, about 45 minutes. Strain sauce into saucepan. (Can be made 2 days ahead. Chill.)",
        "Preheat oven to 325°F. Pierce goose skin (not meat) all over with fork. Place halved shallots and remaining 3 oranges in cavity of goose. Tie leg together to hold shape. Season with salt and pepper. Place goose, breast side down, on rack in roasting pan. Roast 1 1/2 hours.",
        "Transfer goose to platter. Pour off fat from pan. Place goose, breast side up, on rack in pan. Roast until thermometer inserted into thickest part of thigh registers 180°F. about 1 hour 15 minutes. Increase oven temperature to 450°F. Roast goose until golden, about 10 minutes. Transfer to platter.",
        "Pour off all fat from pan, leaving browned bits in pan. Pour 1/3 cup Madeira into pan. Gently heat pan while scraping up browned bits. Pour mixture into sauce. Dissolve cornstarch in remaining 2 tablespoons Madeira. Whisk into sauce. Boil until thickened to sauce consistency, about 7 minutes. Stir in 2 tablespoons honey. Season to taste with more honey, salt and pepper.",
        "Melt butter in heavy large saucepan over medium heat. Add shallots; sauté until golden, about 10 minutes. Stir in Madeira, broth and honey. Simmer until shallots are tender and liquid is reduced to glaze, about 1 hour 10 minutes. (Glazed shallots can be made 1 day ahead. Cover and refrigerate. Rewarm over low heat, stirring often, before serving.)",
        "Carve goose. Arrange slices on plates. Top with Madeira-glazed Shallots and sauce and serve."
    ],
    "ingredients": [
        "1 12 1/2-pound goose, neck reserved",
        "1 tablespoon butter",
        "3 shallots, sliced",
        "1 1/2 cups Madeira",
        "4 small oranges, quartered",
        "4 cups canned low-salt chicken broth",
        "1 cup fresh orange juice",
        "4 large shallots, halved",
        "1/3 cup plus 2 tablespoons Madeira",
        "1 tablespoon cornstarch",
        "2 tablespoons (about) honey",
        "1 tablespoon butter",
        "18 shallots, peeled",
        "1 1/2 cups Madeira",
        "3/4 cup canned low-salt chicken broth",
        "3 tablespoons honey"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "Roast",
        "Christmas",
        "Orange",
        "Goose",
        "Fortified Wine",
        "Winter",
        "Shallot"
    ],
    "title": "Roast Goose with Oranges and Madeira",
    "url": "http://www.epicurious.com/recipes/food/views/roast-goose-with-oranges-and-madeira-966"
}
