{
    "directions": [
        "Preheat oven to 400°F (200°C). To make the Parmesan Wafers, place the quinoa, Parmesan and pepper in a bowl and toss to combine. Place tablespoons of the mixture on a baking tray lined with non-stick baking paper and bake for 5–7 minutes or until golden. Allow to cool on the tray and set aside.",
        "Place the tomatoes, basil and garlic on a baking tray lined with non-stick baking paper and drizzle with oil. Roast for 45 minutes or until the tomatoes are soft and the basil is crisp. Spread the quinoa on a separate baking tray lined with non-stick baking paper, drizzle with oil and toss to coat. Roast for the last 15 minutes of the tomato cooking time. Reserve and set aside the crispy basil leaves. Squeeze the roasted garlic from its skin into a large saucepan. Add the tomatoes and stock and bring to a boil over high heat. Reduce the heat to medium and simmer for 10 minutes or until thickened. Using a hand-held stick blender, blend until smooth. Add the roasted quinoa, salt and pepper and stir to combine. Divide the soup between serving bowls and top with the reserved basil. Serve with the Parmesan Wafers."
    ],
    "ingredients": [
        "About 4 1/2 pounds tomatoes (2kg), halved",
        "1 cup basil leaves",
        "1 head garlic",
        "Extra virgin olive oil, for drizzling",
        "2 cups (320g) cooked quinoa",
        "1 1/2 quarts (1.5 liters) chicken stock",
        "Sea salt and cracked black pepper",
        "1/2 cup (80g) cooked quinoa",
        "1/2 cup (40g) finely grated Parmesan",
        "Cracked black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Soup/Stew",
        "Winter",
        "Tomato",
        "Quinoa",
        "Parmesan",
        "Basil",
        "Dinner",
        "Vegetarian",
        "Wheat/Gluten-Free"
    ],
    "title": "Roasted Quinoa and Tomato Soup With Parmesan Wafers and Crispy Basil",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-quinoa-and-tomato-soup-with-parmesan-wafers-and-crispy-basil"
}
