{
    "directions": [
        "Preheat the oven to 325°F. With a very sharp knife, score the fat of the pork belly into 1/2-inch diagonal lines starting at one corner; repeat going the opposite direction to create a 1/2-inch cross-hatch pattern. Season very generously with salt and pepper on both sides of the pork.",
        "Place the onion, fennel, thyme and orange peel in the bottom of a small roasting pan. Lay the pork on top of the vegetables, then pour the oil, wine and broth on and around the pork belly. Cover the pan with foil and cook pork is until easily pierced with a knife, about 3 hours.",
        "To compress the pork (which makes for a better presentation): Transfer pork to a separate, low-sided serving dish. Cover in plastic wrap and top with another serving dish, weighing it down with cans or other heavy items.",
        "Combine vinegar, sugar, salt, and 1/2 cup warm water in a medium bowl and stir to dissolve. Add the sliced onion and let sit at room temperature for at least 1 hour (or refrigerate at least overnight and up to 1 week).",
        "In a small saucepan over medium heat, warm the oil. Add the fennel, shallot, and salt. Cook, stirring occasionally, until softened, but not browned, about 5 minutes. Add the sugar, vinegar, bay leaf, star anise, and juice. Raise the heat to bring the mixture to a boil, then reduce to a simmer and cook until sauce has thickened enough to coat the pork and reduced by two thirds, about 20 minutes. Set aside.",
        "When ready to serve, heat the broiler. Slice the pork belly across into 1/2-inch slices, then cut each slice into thirds. Arrange the slices on a rimmed baking sheet, cut side down; brush with the sauce and broil until crisped. Place one piece of pork on each toast; top with a little more sauce, pickled red onion, fennel fronds, and a pinch of flaky sea salt."
    ],
    "ingredients": [
        "One 2-pound piece of boneless, skinless pork belly",
        "Kosher salt and freshly ground black pepper",
        "1 large onion, cut into thick wedges",
        "1/2 fennel bulb, cut in thirds, fronds reserved",
        "2 to 3 sprigs thyme",
        "4 strips blood orange or regular orange zest",
        "1/4 cup extra-virgin olive oil",
        "1 cup dry white wine",
        "1 cup low-sodium chicken broth",
        "1/4 cup red-wine vinegar",
        "1 1/2 teaspoons granulated sugar",
        "3/4 teaspoon kosher salt",
        "1/2 medium red onion, thinly sliced",
        "2 tablespoons neutral vegetable oil, such as grapeseed",
        "1/2 fennel bulb, minced (about 1/4 cup)",
        "1/2 large shallot, minced (about 1/4 cup)",
        "1/4 teaspoon kosher salt",
        "2 tablespoons granulated sugar",
        "2 tablespoons red-wine vinegar",
        "1 bay leaf",
        "1 star anise",
        "1 cup blood orange or regular orange juice (from 4 to 6 oranges, or store bought)",
        "1 large baguette or 2 medium baguettes, cut into 40 1/4-inch thick slices and toasted",
        "Reserved fennel fronds, roughly chopped",
        "Flaky sea salt, such as Maldon, for sprinkling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Onion",
        "Pork",
        "Appetizer",
        "Christmas",
        "Orange",
        "Sugar Conscious",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Pork Belly Toasts with Blood-Orange BBQ Sauce and Pickled Red Onion",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-belly-toasts-with-blood-orange-bbq-sauce-and-pickled-red-onion-51259690"
}
