{
    "directions": [
        "Preheat oven to 400°F. Heat 1 tablespoon vegetable oil in heavy medium ovenproof skillet over medium-high heat. Add carrots, 5 unpeeled garlic cloves, and thyme. Sauté until carrots color, about 6 minutes; set aside. Arrange romaine, cut side up, in 15x10x2-inch baking dish. Add broth and 2 tablespoons olive oil; sprinkle with salt and pepper. Cover with plastic wrap, then foil. Roast lettuce until tender, about 35 minutes. Uncover lettuce; roast until lightly browned, about 12 minutes.",
        "At the same time, place skillet with carrots and garlic in oven alongside lettuce; roast carrots until golden and tender, about 40 minutes. Cut carrots lengthwise in half; set roasted carrots and garlic cloves aside. Drain and cool lettuce.",
        "Meanwhile, combine beans, cilantro, bay leaf, cayenne, and 1/2 cup olive oil in saucepan. Cover; cook over medium-low heat until beans are tender, about 25 minutes. Discard bay leaf. Peel roasted garlic; add to beans. Mash until almost smooth. Season hummus with salt and pepper.",
        "Heat 3 tablespoons vegetable oil in small skillet over medium heat. Add minced garlic; sauté until pale golden, about 3 minutes. Pour mixture into small bowl; whisk in lime juice and cumin.",
        "Spread hummus on toast slices. Top each with 1 romaine half, folded to fit, 4 carrot halves, and 1 generous tablespoon dressing. Using vegetable peeler, shave Parmesan ribbons over each."
    ],
    "ingredients": [
        "4 tablespoons vegetable oil",
        "8 medium carrots, peeled, cut to 6-inch lengths",
        "5 large garlic cloves, unpeeled, plus 2 teaspoons minced garlic",
        "6 large fresh thyme sprigs",
        "2 hearts of romaine lettuce, cut lengthwise in half",
        "3/4 cup vegetable broth",
        "2 tablespoons plus 1/2 cup extra-virgin olive oil",
        "2 15 1/2-ounce cans garbanzo beans (chickpeas), drained",
        "1/4 cup fresh cilantro leaves",
        "1 bay leaf",
        "2 large pinches of cayenne pepper",
        "1 tablespoon fresh lime juice",
        "1 teaspoon cumin seeds, toasted",
        "4 7 x 4 1/2-inch slices country-style white bread, toasted",
        "Parmesan cheese wedge"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Vegetable",
        "Braise",
        "Roast",
        "Sauté",
        "Parmesan",
        "Lime",
        "Chickpea",
        "Carrot",
        "Winter",
        "Lettuce"
    ],
    "title": "Roasted Carrot Sandwich with Hummus and Braised Romaine",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-carrot-sandwich-with-hummus-and-braised-romaine-107643"
}
