{
    "directions": [
        "Cut the greens from the beets, leaving about 1 inch of the stems attached, and reserve the greens. Scrub the beets, wrap them tightly in 2 foil packages, and roast them on a baking sheet in the middle of a preheated 350°F. oven for 1 to 1 1/2 hours, or until they are tender. Unwrap the beets carefully, discarding any liquid that may have accumulated in the foil, and let them cool until they can be handled. Peel and halve the beets and cut them into 1/4-inch slices.",
        "In a small bowl stir together the crème fraîche, the horseradish to taste, the zest, and salt and pepper to taste. Wash well and drain the reserved greens, in a large skillet cook them with salt and pepper to taste in 1 tablespoon of the butter over moderately high heat, stirring, for 3 to 4 minutes, or until they are wilted, and transfer them to a platter. In the skillet cook the beets with salt and pepper to taste in the remaining 1 tablespoon butter over moderately high heat, stirring, for 2 to 3 minutes, or until they are hot, and spoon them over the greens. Top the beets with the horseradish cream and sprinkle the cream with the chives and salt and pepper to taste."
    ],
    "ingredients": [
        "about 3 1/2 pounds beets including the greens",
        "2/3 cup crème fraîche or sour cream",
        "2 to 3 tablespoons finely grated peeled fresh horseradish or drained ;bottled",
        "1/2 teaspoon freshly grated lemon zest",
        "2 tablespoons unsalted butter",
        "1 tablespoon minced fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Vegetarian",
        "Root Vegetable",
        "Beet",
        "Sour Cream",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Beets with Horseradish Cream",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-beets-with-horseradish-cream-13337"
}
