{
    "directions": [
        "Remove the turkey from its packaging and remove the bags inside that hold the neck and giblets. Rinse them and put them in a plastic bag in the fridge; you'll need them for the gravy. Rinse the turkey thoroughly with cold water. Place the turkey into a large brining bag or pot. Pour in chilled My Favorite Turkey Brine and place in the fridge for 16 to 18 hours so the brine can work its magic.",
        "Preheat the oven to 275 degrees F.",
        "After the turkey has brined, remove it from the brining bag and rinse the turkey thoroughly again inside and out. Soak the turkey in cold water for 15 minutes, and then rinse again and pat dry.",
        "Truss the bird or tuck the legs and wings however you like. Then place the bird, breast-side up, on a rack in a large roasting pan. Cover the whole pan, tenting the bird, with heavy-duty foil so that it's well sealed. Place in the oven and roast the turkey for about 10 minutes per pound. (So for a 20-pound turkey, roast it for about 3 1/2 hours. For a 15-pound turkey, roast it for 2 1/2 hours.)*",
        "When it's time to remove the turkey from the oven, mix together the butter, rosemary and orange peel strips. Remove the turkey from the oven and increase the temperature to 375 degrees F. Remove the foil and set aside. (Put stuffing in the bird if you wish at this point.) Rub the butter mixture all over the skin of the turkey, getting in the crevices. Insert a meat thermometer into the thigh, near the hip joint. Place the turkey, uncovered, back into the oven. Continue roasting the turkey, basting/brushing with the juices from the pan every 30 minutes until the juices are no longer pink and the thermometer registers 165 degrees F. This could take another 1 1/2 to 2 1/2 hours, depending on the size of the bird.",
        "Remove the turkey from the oven and cover lightly with foil until you are ready to carve.",
        "Combine water with the apple cider, brown sugar, salt, peppercorns, bay leaves, garlic, rosemary and orange peels in a large pot. Stir until the salt and sugar dissolve. Bring to a boil, then turn off the heat and cover. Allow the brine to cool completely, then place into the fridge to chill."
    ],
    "ingredients": [
        "1 whole fresh or frozen turkey that has not been injected with sodium solution (I use a 20-pound turkey)",
        "My Favorite Turkey Brine, recipe follows",
        "2 sticks butter, at room temperature",
        "3 tablespoons chopped fresh rosemary",
        "2 tablespoons orange zest, julienned",
        "2 gallons cold water",
        "3 cups apple cider",
        "2 cups packed brown sugar",
        "3/4 cup kosher salt",
        "3 tablespoons tricolor peppercorns",
        "5 whole bay leaves",
        "5 cloves garlic, minced",
        "4 fresh rosemary sprigs, leaves stripped off",
        "Peel of 3 large oranges, cut into large strips"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Thanksgiving Turkey",
        "Holiday",
        "Poultry Recipes",
        "Thanksgiving",
        "Turkey Recipes",
        "Roasted Turkey",
        "Roasting",
        "Main Dish Recipes"
    ],
    "title": "Roasted Thanksgiving Turkey",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/roasted-thanksgiving-turkey"
}
