{
    "directions": [
        "Preheat oven to 450°F.",
        "Simmer raisins and rum in a small saucepan, stirring occasionally, until rum is absorbed, about 5 minutes.",
        "Cut a very thin slice off bottom of each orange so it will stand without rolling. Cut a 3/4-inch-thick slice off top of each, removing any flesh from tops and reserving them. Remove as much flesh as possible from orange with a sharp knife and a spoon (reserving flesh for another use if desired), leaving an empty shell.",
        "Sift together flour, baking soda and powder, and salt. Beat butter and sugar in a large bowl with an electric mixer until light and fluffy. Add eggs 1 at a time, beating well after each addition, then beat in vanilla and zest. Alternately fold in flour mixture and buttermilk in batches, beginning and ending with flour mixture. Fold in raisins.",
        "Fill orange shells two-thirds full with batter and put tops in place. Wrap oranges individually in foil and arrange on a baking sheet. Bake in middle of oven 50 minutes.",
        "Transfer oranges in foil to a rack. Remove foil when cool enough to handle, then cool oranges on racks at least 15 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1/3 cup golden raisins",
        "1/3 cup dark rum",
        "8 to 10 large navel oranges",
        "1 1/2 cups cake flour (not self-rising)",
        "1/8 teaspoon baking soda",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 cup sugar",
        "2 large eggs",
        "3/4 teaspoon vanilla",
        "1/2 teaspoon finely grated fresh orange zest",
        "3/4 cup well-shaken buttermilk",
        "Accompaniment: superpremium vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Rum",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Orange",
        "Raisin",
        "Vanilla",
        "Summer",
        "Gourmet"
    ],
    "title": "Roasted Orange Cakes",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-orange-cakes-103737"
}
