{
    "directions": [
        "Preheat oven to 450°F with rack in lower third.",
        "Rinse turkey inside and out and pat dry. Working from large cavity end, gently run your fingers between skin and meat to loosen skin, being careful not to tear skin. Push two thirds of truffle butter (4 ounces) under skin, including thighs and drumsticks, and massage skin from outside to spread butter evenly. Mix 2 1/2 teaspoons salt and 1 1/2 teaspoons pepper in a small bowl and sprinkle it evenly in turkey cavities and all over skin. Fold neck skin under body, then tuck wing tips under breast and tie drumsticks together with string.",
        "Put turkey on rack in roasting pan and pour in 2 cups water. Roast, rotating pan 180 degrees after 1 hour of roasting and adding remaining cup water, until an instant-read thermometer inserted into fleshy part of each thigh (test both; close to but not touching bone) registers 170°F, 1 3/4 to 2 hours total.",
        "Carefully tilt turkey so juices from inside large cavity run into pan. Transfer turkey to a platter and let stand, uncovered, 30 minutes (temperature of thigh meat will rise to 175 to 180°F). Discard string.",
        "Strain pan juices through a fine-mesh sieve into 2-quart measuring cup and skim off fat (or use a fat separator), reserving fat. Straddle roasting pan across 2 burners and cook shallots in 1/4 cup reserved fat over medium heat, stirring, until golden, about 2 minutes. Add wine and boil, stirring and scraping up brown bits, until mixture is reduced to about 1 cup, 5 to 8 minutes.",
        "Add enough turkey stock to reserved pan juices to bring total to 4 cups, then add to wine mixture and bring to a boil. Strain through a fine-mesh sieve into a 2-to 3-quarts heavy saucepan, pressing on and then discarding solids, and bring to a boil.",
        "Mix flour with remaining 2 ounces truffle butter to make a paste, then add to boiling sauce, whisking until thickened. Simmer, whisking occasionally, 3 to 5 minutes. Season with salt and pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "1 (12-to 14-pound) turkey at room temperature 1 hour, neck and giblets (excluding liver) reserved for turkey stock",
        "6 ounces black-truffle butter, softened, divided",
        "3 cups water, divided",
        "1/2 cup finely chopped shallots",
        "2 cups dry white wine",
        "4 cups hot classic turkey stock",
        "5 tablespoons all-purpose flour",
        "Equipment: kitchen string; a 17-by 14-inch flameproof roasting pan with a flat rack; a 2-quart measuring cup or a fat separator",
        "1 a 17-by 14-inch flameproof roasting pan with a flat rack",
        "1 a 2-quart measuring cup or a fat separator"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "White Wine",
        "Family Reunion",
        "Christmas Eve",
        "Gourmet"
    ],
    "title": "Roast Turkey with Black-Truffle Butter and White-Wine Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-black-truffle-butter-and-white-wine-gravy-350565"
}
