{
    "directions": [
        "Stir star anise in heavy large saucepan over medium heat until slightly darker, wrinkled-looking, and fragrant, about 8 minutes. Add 3 cups water and ginger; simmer 15 minutes. Add broth, soy sauce, and sugar; simmer 15 minutes. Season to taste with salt and pepper.",
        "Stir oil and garlic in small skillet over low heat until garlic is crisp and golden, about 8 minutes. Set garlic oil aside.",
        "Blanch chrysanthemum in large pot of boiling salted water until just wilted, about 5 seconds. Using strainer, transfer greens to colander. Rinse with cold water and drain. Return water in pot to boil. Add noodles and cook until just tender but still firm to bite, stirring often, about 3 minutes. Drain; transfer to large bowl. Let stand 2 minutes. Mix in 1 tablespoon garlic oil. Using kitchen shears, cut noodles crosswise in several places.",
        "Heat chicken in microwave in 10-second intervals at low setting until warmed through. Divide noodles among 4 soup bowls; top each with 1/4 of chrysanthemum, chicken, and onion. Ladle 2 cups broth mixture into each bowl. Drizzle with some garlic oil. Serve, passing red chiles separately."
    ],
    "ingredients": [
        "3 whole star anise",
        "3 cups water",
        "1 2-inch piece fresh ginger, peeled, sliced into thin rounds",
        "6 cups low-salt chicken broth",
        "2 tablespoons soy sauce",
        "2 teaspoons sugar",
        "3 tablespoons vegetable oil",
        "3 garlic cloves, thinly sliced",
        "2 bunches chrysanthemum, bottoms trimmed, upper stems and leaves cut into 2-inch strips (about 5 cups)",
        "1 14-ounce package thin fresh or dried Chinese egg noodles",
        "2 1/2 cups 1/2-inch cubes skinned and boned freshly roasted or purchased roast chicken (about 2/3 pound)",
        "1/4 large onion, sliced paper-thin",
        "3 red Thai bird chiles or 1 large red jalapeño chile, sliced into thin rounds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Chicken",
        "Leafy Green",
        "Pasta",
        "Poultry",
        "Roast",
        "Noodle"
    ],
    "title": "Roast Chicken Noodle Soup with Chrysanthemum",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-noodle-soup-with-chrysanthemum-232259"
}
