{
    "directions": [
        "With a mortar and pestle, grind together rosemary and kosher salt. Pour in olive oil and continue to mash until the oil starts to turn a darker green. Set aside for about an hour.",
        "Preheat oven to 425 degrees F (220 degrees C). Coat a shallow roasting pan with cooking spray.",
        "Place the squash, rutabagas, parsnips and potatoes in a large bowl. Pour the olive oil mixture through a fine-mesh strainer into the bowl. Toss vegetables with oil to coat.",
        "Evenly spread vegetables on the prepared pan. Roast 30 minutes in the preheated oven, until nicely browned and cooked through. You may need to remove some of the smaller pieces from the oven before all of the vegetables are cooked to avoid burning them.",
        "While the vegetables are roasting, simmer chicken stock in a large pot over medium low heat. When the vegetables are done add them to the simmering chicken stock and simmer together for about 10 minutes.",
        "Use an immersion blender to puree the soup in the pot, or puree in batches in a blender or food processor.  Add extra broth or water if the soup is too thick. Season with salt and pepper to taste. Serve in warmed bowls, garnishing each serving by drizzling a quarter teaspoon of balsamic vinegar and a quarter teaspoon of white truffle oil over the soup."
    ],
    "ingredients": [
        "2 sprigs fresh rosemary, chopped",
        "1 pinch kosher salt",
        "2 tablespoons extra virgin olive oil",
        "cooking spray",
        "1 small butternut squash - peeled, seeded, and cut into large chunks",
        "3 rutabagas, peeled and cubed",
        "4 parsnips, peeled and thickly sliced",
        "4 new potatoes, peeled and halved",
        "10 cups chicken stock",
        "salt to taste",
        "freshly ground black pepper to taste",
        "2 teaspoons aged balsamic vinegar",
        "2 teaspoons white truffle oil (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Winter Vegetable Soup",
    "url": "http://allrecipes.com/recipe/132065/roasted-winter-vegetable-soup/"
}
