{
    "directions": [
        "With flat side of a large knife smash garlic. In a small saucepan heat brown sugar, honey, and vinegar over moderate heat, stirring, until sugar is dissolved. Remove pan from heat and stir in garlic and remaining marinade ingredients until combined well. Cool marinade to room temperature.",
        "Fold up spareribs and fit into two 1-gallon heavy-duty sealable plastic bags. Divide marinade between bags and seal bags, pressing out excess air. Marinate ribs in bags in a large roasting pan, chilled, turning them once, 1 day.",
        "Preheat oven to 350°F.",
        "Open bags and, holding ribs in bags, pour marinade into a saucepan. Discard garlic. Simmer marinade until reduced to about 1‚ cups. Pour 1 cup marinade into a bowl and reserve as sauce for serving with ribs (remainder will be used for basting ribs).",
        "Arrange ribs, overlapping slightly, in 2 large roasting pans and roast in upper and lower thirds of oven 30 minutes. With tongs turn ribs over so they will brown evenly. Roast ribs 30 minutes more and with tongs turn them over.",
        "Switch position of pans in oven and baste ribs with some of remaining marinade in saucepan. Roast ribs 30 minutes and with tongs turn them over. Brush ribs with remaining marinade in saucepan and roast 30 minutes more, or until meat is very tender. Ribs may be made 30 minutes ahead and kept, tightly covered with foil, at room temperature.",
        "Transfer ribs to a cutting board and cut apart between bones. Serve ribs with reserved sauce."
    ],
    "ingredients": [
        "4 garlic cloves",
        "1 cup packed light brown sugar",
        "1 1/3 cups honey",
        "1/4 cup cider vinegar",
        "1/4 cup Worcestershire sauce",
        "1 1/2 tablespoons salt",
        "2 teaspoons ground ginger",
        "2 teaspoons Tabasco",
        "4 untrimmed racks pork spareribs (about 3‚ pounds each)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Ginger",
        "Pork",
        "Marinate",
        "Roast",
        "Vinegar",
        "Winter",
        "Honey",
        "Gourmet"
    ],
    "title": "Roasted Honey-Glazed Spareribs",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-honey-glazed-spareribs-100570"
}
