{
    "directions": [
        "Bring medium saucepan water to boil. Reduce heat to moderate, add potato chunks and simmer, uncovered, until tender but not falling apart, 8 to 10 minutes. Drain potatoes and let cool to room temperature.",
        "In large sealable plastic bag, combine olive oil, garlic, parsley, and thyme. Add racks of lamb and seal bag, pressing out air. Turn bag to coat lamb, then transfer to shallow baking pan and refrigerate, turning bag over occasionally, at least 2 hours and up to 12 hours.",
        "Preheat oven to 350°F. Thirty minutes before roasting, remove lamb from refrigerator and allow to come to room temperature.",
        "Remove lamb from marinade, discarding marinade. Sprinkle with salt and pepper and transfer to rack set in large roasting pan. Roast until thermometer inserted 2 inches into thickest part of lamb (do not touch bone) registers 130°F (for medium rare), approximately 25 minutes. Transfer to carving board, tent with foil, and let stand 10 minutes.",
        "In medium skillet over moderately high heat, heat canola oil until hot but not smoking. Add potatoes and sauté just until starting to brown, about 8 minutes. Add corn and celery and sauté until aromatic, 3 to 5 minutes. Add garlic and parsley and sauté 1 minute. Add black-eyed peas and wine and bring to simmer, then reduce heat to moderate and continue simmering, uncovered, until liquid is reduced by half and mixture is slightly thickened, 1 to 2 minutes. Add broth, raise heat to moderately high, and bring to boil. Reduce heat to moderate and simmer, uncovered, until liquid is reduced by half and mixture is slightly thickened, about 4 to 5 minutes. Remove from heat and stir in butter, 1 1/2 teaspoons lemon juice, 1 teaspoon salt, and 1/2 teaspoon pepper. Keep warm.",
        "In large, wide skillet over moderate heat, heat olive oil until hot but not smoking. Add spinach all at once and sauté, stirring occasionally, until just wilted, about 4 minutes. Transfer to medium bowl, sprinkle with remaining 1 teaspoon salt, 1/2 teaspoon pepper, and 1 1/2 teaspoons lemon juice, and toss to coat. Keep warm.",
        "Divide succotash evenly between 8 bowls and top each portion with small mound of spinach. Carve lamb into chops and place 4 chops on each serving. Serve immediately."
    ],
    "ingredients": [
        "1 medium Yukon gold potato, peeled and cut into 1/2-inch chunks",
        "3/4 cups extra-virgin olive oil",
        "24 cloves (about 2 heads) garlic, peeled and smashed with back of knife",
        "2 cups loosely packed fresh flat-leaf parsley leaves, chopped (from 1 bunch)",
        "1/4 cup loosely packed fresh thyme leaves, chopped (from 1/2 bunch)",
        "4 (1- to 1 1/2-pound) racks of lamb, trimmed of all but a 1/4-inch layer fat and frenched (each rack should have 8 ribs)*",
        "2 tablespoons sea salt",
        "1 tablespoon freshly ground black pepper",
        "2 tablespoons canola oil",
        "1 cup raw corn kernels (cut from 2 cobs)",
        "1 celery stalk, minced",
        "1 garlic clove, minced",
        "1/4 cup loosely packed fresh flat-leaf parsley leaves (from 8 sprigs)",
        "1/2 cup fresh black-eyed peas**",
        "1/2 cup dry white wine",
        "1 cup vegetable broth",
        "1/4 cup (1/2 stick) unsalted butter",
        "3 teaspoons fresh lemon juice (from 1 medium lemon)",
        "2 teaspoons sea salt",
        "1 teaspoon freshly ground black pepper",
        "3 tablespoon olive oil",
        "8 cups loosely packed baby spinach leaves (about 7 ounces)",
        "*1- to 1 1/2-pound racks of lamb are sometimes called \"baby racks of lamb.\" Ask your butcher to trim the fat from the meat and between the bones.",
        "**If fresh black-eyed peas are unavailable, canned are a good substitute. You will need 1/4 of a 15 1/2-ounce can.",
        "Special equipment: One large (2-gallon) heavy-duty sealable plastic bag"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Lamb",
        "Potato",
        "Marinate",
        "Roast",
        "Sauté",
        "Rack of Lamb",
        "Corn",
        "Spinach",
        "Pea",
        "Spring"
    ],
    "title": "Roasted Rack of Lamb with Spring Succotash and Wilted Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-rack-of-lamb-with-spring-succotash-and-wilted-spinach-237838"
}
