{
    "directions": [
        "In small saucepan over moderately high heat, whisk together 1 cup water, pomegranate juice, and sugar. Bring to boil and cook, uncovered, until thick and syrupy, about 15 to 20 minutes.",
        "Preheat oven to 375°F.",
        "Rinse poussins inside and out and pat dry. Cut out necks if attached and discard. In small bowl, whisk together salt, cumin, turmeric, pepper, and saffron. Sprinkle poussins with spice mixture; press to adhere.",
        "Set large roasting pan on stove top, straddling two burners. Add 2 tablespoons vegetable oil and heat over moderately high heat until hot but not smoking. Working in 2 batches, sear poussins until well browned, about 5 minutes per side, transferring as done to large platter and adding more oil as needed. Return poussins to pan and pour pomegranate syrup over.",
        "Roast 15 minutes. Baste poussins with pan juices and scatter walnuts around. Roast, basting occasionally, until instant-read thermometer inserted into 1 thigh (avoiding bone) registers 170°F, about 15 minutes more.",
        "In large bowl, stir together grated potato, rosemary, salt, and pepper. In heavy 10-inch nonstick skillet over moderate heat, heat 2 tablespoons oil until hot but not smoking. Pour in 1/2 potato batter and lightly press to form even layer that completely fills pan. Cook, without moving, until underside is browned, about 12 minutes. Invert large plate over skillet and flip pancake onto plate. Add 1 tablespoon oil to skillet, then slide pancake back, uncooked side down, into skillet. Cook until underside is golden brown, about 5 minutes. Remove from heat and keep warm, then repeat process with remaining oil and potato batter to make second pancake.",
        "Cut into wedges and serve with poussin."
    ],
    "ingredients": [
        "1 cup bottled pomegranate juice",
        "1 cup sugar",
        "8 (1-pound) poussins (small chickens) or 8 (1 1/4-pound) Cornish hens",
        "2 teaspoons salt",
        "2 teaspoons ground cumin",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon freshly ground black pepper",
        "1/8 teaspoon crumbled saffron threads",
        "3/4 cup roasted walnuts",
        "2 tablespoons or more vegetable oil, for frying",
        "4 russet (baking) potatoes, peeled and coarsely grated",
        "1 tablespoon fresh rosemary, chopped",
        "1 1/4 teaspoons salt",
        "1/2 teaspoon freshly ground black pepper",
        "6 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Potato",
        "Passover",
        "Rosh Hashanah/Yom Kippur",
        "Rosemary",
        "Walnut",
        "Saffron"
    ],
    "title": "Roasted Poussins with Pomegranate Sauce and Potato Rösti",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-poussins-with-pomegranate-sauce-and-potato-rosti-238000"
}
