{
    "directions": [
        "Roast peppers: rub oil on peppers and put them under the broiler until blackened, turn to get all sides. Put into paper bag and seal. Let rest for 15 minutes, then peel will come right off and core and seeds will fall out. Chop peppers. Reserve one chopped pepper; set aside.",
        "Heat olive oil over moderate heat. Add onion and garlic and cook until soft but not brown, about 5 minutes. Stir in tomato, bell peppers (except reserved), thyme, paprika, and sugar. Cook over medium-low heat until all the tomato juices have evaporated, about 25 minutes.",
        "Stir in chicken stock, salt and pepper, cayenne pepper, and hot sauce (if using). Bring to boiling, lower heat, and simmer, partially covered, for 25 minutes or until vegetables are tender.",
        "Strain soup, reserving broth. Place solids in food processor or blender, and process until fairly smooth.  Add puree back into broth.",
        "Melt butter and stir in the flour, cook for 1 minute. Stirring slowly, add the broth/vegetable mixture. Add reserved chopped pepper and bring to boiling. Lower heat and simmer 10 minutes.",
        "Ladle into bowls and add 1 tablespoon of sour cream to each bowl. For a lighter soup, this is also delicious without the sour cream."
    ],
    "ingredients": [
        "1 teaspoon olive oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "3 red bell peppers",
        "4 large tomatoes - peeled, seeded and chopped",
        "1 1/2 teaspoons dried thyme",
        "2 teaspoons paprika",
        "1/8 teaspoon white sugar",
        "6 cups chicken broth",
        "salt and pepper to taste",
        "1 pinch ground cayenne pepper",
        "1 dash hot pepper sauce",
        "2 tablespoons butter",
        "1 1/2 tablespoons all-purpose flour",
        "6 tablespoons sour cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Red Pepper and Tomato Soup",
    "url": "http://allrecipes.com/recipe/13004/roasted-red-pepper-and-tomato-soup/"
}
