{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Mix oil and curry paste in small bowl. Rinse chickens; pat dry. Sprinkle inside and out with salt and pepper. Place apple, garlic, cilantro and mint in cavities of chickens, dividing equally. Rub curry mixture over chickens. Tie legs together.",
        "Place chickens in large roasting pan. Roast until meat thermometer inserted into thickest part of thigh registers 175°F, basting occasionally, about 1 hour 15 minutes. Transfer chickens to platter. Tent with foil.",
        "Shake mustard seeds in medium skillet over low heat until color darkens and seeds begin to pop, about 2 minutes. Transfer mustard seeds to medium bowl.",
        "Melt 1 tablespoon butter in heavy large skillet over medium-high heat. Add shallots, thyme and brown sugar to skillet and sauté until shallots are translucent, about 3 minutes. Add chicken stock, apple juice, wine and cinnamon sticks. Boil until mixture is reduced to 1 cup, about 20 minutes. Strain into medium saucepan. Bring jus to simmer. Add apple cider vinegar, toasted mustard seeds and remaining 4 tablespoons butter and whisk just until butter melts. Season with salt and pepper. Serve jus with chickens."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil",
        "2 tablespoons Thai red curry paste",
        "2 3 1/2-pound whole chickens",
        "1 Granny Smith apple, quartered",
        "1 head of garlic, halved crosswise",
        "8 fresh cilantro sprigs",
        "8 fresh mint sprigs",
        "1 teaspoon yellow mustard seeds",
        "5 tablespoons butter",
        "6 tablespoons chopped shallots",
        "4 fresh thyme sprigs",
        "1 teaspoon (packed) brown sugar",
        "4 cups chicken stock or canned low-salt broth",
        "2 cups apple juice",
        "1/4 cup dry white wine",
        "2 cinnamon sticks",
        "2 tablespoons apple cider vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Garlic",
        "Herb",
        "Poultry",
        "Roast",
        "Valentine's Day",
        "Apple",
        "Curry",
        "Summer"
    ],
    "title": "Roasted Red Curry Chicken with Apple Jus",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-red-curry-chicken-with-apple-jus-4325"
}
