{
    "directions": [
        "Preheat oven to 350 degrees.",
        "Rinse chicken and pat dry with paper towels. Zest the lemon and set zest aside. Cut the zested lemon into 6 wedges, and place inside the chicken cavity along with 4 sprigs of thyme.",
        "Mince garlic, and mix with 1 tsp kosher salt. Remove leaves from 6 stems of thyme, and mix with the garlic, along with the lemon zest. Using your fingers or the end of a wooden spoon, separate the chicken skin from the breasts, starting at the neck. Using fingers, insert paste under the skin, working it across the breast.",
        "Rub the whole chicken with butter (or olive oil). Sprinkle all sides with remaining salt and pepper. Place a roasting rack in your roasting pan, and scatter onions and carrots around the edges. Place chicken breast-side-down in roasting pan.",
        "Roast chicken in preheated oven for 20 minutes. Rotate bird on its side, and roast another 20 minutes. Rotate bird to the opposite side and roast for 20 more minutes. Place chicken breast-side-up for the remaining 30 to 40 minutes. When juices run clear when cut into between the leg and thigh, the bird is done. (Total cooking time will be 1 hour 30 minutes to 1 hour 40 minutes.) Remove from oven and tent with foil; let rest for 10 minutes. Skim fat off pan juices and set aside.",
        "Plate chicken with carrots and onions scattered around, pour juices over chicken and veggies, and serve."
    ],
    "ingredients": [
        "1 whole chicken (4 to 5 lbs), rinsed (make sure cavity is clean)",
        "1 lemon, zested",
        "10 sprigs of fresh thyme, divided",
        "3 to 4 cloves garlic",
        "1 1/2 tsp kosher salt, divided",
        "1 tsp pepper, divided",
        "2 T butter, softened (or olive oil)",
        "2 onions, cut in wedges",
        "4 carrots, cut into 1 to 2-inch chunks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Roast",
        "Dinner",
        "Carrot",
        "Fall"
    ],
    "title": "Roast Chicken with Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-carrots-51192210"
}
