{
    "directions": [
        "Using small sharp knife, make small slits in skin all over breasts, sides, legs, and thighs of each goose to allow fat to be released during roasting (do not pierce flesh). Pull out remaining pin feathers with pliers. Place geese, side by side, on large rack set in large roasting pan. Place wing tips and necks in pan. Refrigerate uncovered at least 1 day and up to 2 days for skin to dry.",
        "Preheat oven to 325°F. Sprinkle main cavity of each goose with salt and pepper. Place half of herb sprigs, lemons, garlic, and onions into each. Using small metal pins, skewer cavities closed. Place each goose, breast side down, on rack. Pierce skin on back all over with small sharp knife (do not pierce flesh).",
        "Roast geese 1 1/2 hours. Using large spoon or bulb baster, transfer fat collected in bottom of roasting pan to bowl; leave juices in pan. Turn geese breast side up. Continue to roast geese until legs move easily, skin around thighs and breasts is puffed, and thermometer inserted into thickest part of thigh registers 175°F to 180°F, about 2 hours longer. Transfer to platter; tent loosely with foil. Let rest 30 to 45 minutes. If desired, reserve roasting pan with juices to make pan sauce.",
        "Carve geese and serve with aged balsamic vinegar or Balsamic Pan Sauce."
    ],
    "ingredients": [
        "2 8- to 10-pound heirloom geese, rinsed, patted dry, excess fat pockets removed, wing tips and necks reserved",
        "12 large fresh sage sprigs",
        "1 bunch fresh thyme sprigs",
        "4 lemons, pierced all over with fork",
        "2 heads of garlic, unpeeled, cut in half horizontally to expose cloves",
        "2 medium onions, unpeeled, quartered through root ends",
        "Aged balsamic vinegar or Balsamic Pan Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Roast",
        "Christmas",
        "Vinegar",
        "Lemon",
        "Goose",
        "Sage",
        "Thyme"
    ],
    "title": "Roast Heirloom Goose with Balsamic Vinegar",
    "url": "http://www.epicurious.com/recipes/food/views/roast-heirloom-goose-with-balsamic-vinegar-233402"
}
