{
    "directions": [
        "Preheat oven to 425°F (220°C). Place the zucchini in a single layer on baking trays lined with non-stick baking paper. Brush both sides of the ribbons with oil and sprinkle with salt. Roast for 12 to 14 minutes or until golden. Heat the extra oil in a medium non-stick frying pan over medium heat. Add the onion, garlic and oregano and cook for 4 to 5 minutes or until softened. Allow to cool slightly. Place the kale and spinach in paper towel or a clean tea towel and squeeze to remove any excess liquid. Roughly chop, add to the onion mixture and stir to combine. Place the ricotta, lemon rind, parsley, salt and pepper in a bowl and mix to combine. Line the base of a lightly greased 9x9-inch baking dish with one-third of the roasted zucchini. Top with half the ricotta mixture and half the kale mixture. Sprinkle with one-third of the mozzarella and Parmesan. Top with half the remaining zucchini, and the remaining ricotta and kale mixtures. Sprinkle with half the remaining mozzarella and Parmesan. Top with the remaining zucchini and sprinkle with the remaining mozzarella and Parmesan. Bake for 10 to 15 minutes or until crisp and golden. Slice and serve with the baby salad mix."
    ],
    "ingredients": [
        "8 medium zucchini, sliced into 1/16-inch ribbons",
        "Extra virgin olive oil, for brushing, plus 2 tablespoons extra",
        "Sea salt and cracked black pepper",
        "1 small onion, chopped",
        "2 cloves garlic, crushed",
        "2 tablespoons chopped oregano",
        "1 bunch kale (500 grams), trimmed and blanched",
        "1 bunch English spinach (375 grams), trimmed and blanched",
        "2 1/4 cups (540 grams) fresh ricotta",
        "1 tablespoon finely grated lemon rind",
        "1 cup flat-leaf parsley, finely chopped",
        "3/4 cup (75 grams) grated mozzarella",
        "3/4 cup (60 grams) finely grated Parmesan",
        "Baby (micro) salad mix (optional), to serve"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Lasagna",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Zucchini",
        "Spinach",
        "Ricotta",
        "Mozzarella",
        "Parmesan",
        "Kale",
        "Dinner"
    ],
    "title": "Roasted Zucchini Lasagna",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-zucchini-lasagna"
}
