{
    "directions": [
        "Preheat oven to 375  degrees F (190 degrees C).  Place the butternut, acorn and spaghetti squashes cut side down on a roasting pan.  Wrap garlic in foil, or place in a garlic roaster.  Roast squash and garlic in preheated oven for 50 to 60 minutes.",
        "Melt butter in a large pot or Dutch oven over medium heat.  Saute the onion for 5 minutes, stirring frequently.  Stir in ginger and curry powder; cook 3 more minutes.  Stir in apples and sherry; reduce heat to medium-low and simmer for 15 minutes.  Transfer mixture to a blender and set aside.",
        "When the squash and garlic are done squeeze half the garlic into the apple mixture.  Process mixture for 1 minute until blended, but still slightly chunky.  Return mixture to pot over medium-low heat.",
        "In the blender, puree small batches of squash flesh and vegetable broth.  Transfer each batch to the pot with the apple mixture.",
        "Stir in red bell pepper, rosemary, parsley, basil, thyme, black pepper, salt and cayenne.  Cover and simmer over low heat for 1 to 3 hours, stirring occasionally.",
        "About 30 minutes before serving add zucchini, green onions and hot water."
    ],
    "ingredients": [
        "1 butternut squash, halved and seeded",
        "1 acorn squash, halved and seeded",
        "1/2 spaghetti squash, seeded",
        "1 medium head garlic",
        "3 tablespoons butter",
        "1 large onion, chopped",
        "1 teaspoon minced fresh ginger root",
        "1 teaspoon curry powder",
        "2 Granny Smith apples - cored, peeled and chopped",
        "2/3 cup dry sherry",
        "3 (14.5 ounce) cans vegetable broth",
        "1 small red bell pepper, minced",
        "1 sprig fresh rosemary, chopped",
        "2 tablespoons chopped fresh parsley",
        "4 leaves fresh basil, chopped",
        "1 teaspoon dried thyme",
        "cracked black pepper to taste",
        "salt to taste",
        "cayenne pepper to taste",
        "2 zucchini, chopped",
        "3 green onions, chopped",
        "1 cup hot water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Three Squash Soup",
    "url": "http://allrecipes.com/recipe/25308/roasted-three-squash-soup/"
}
