{
    "directions": [
        "Whisk lemon juice, oil, garlic, 3 tablespoons thyme, rosemary, and sage in a small bowl; set marinade aside.",
        "Season chickens with salt and pepper inside and out. Place each inside a resealable plastic bag; divide marinade between bags. Spread marinade evenly to distribute. Seal bags and chill for at least 4 hours and up to 24 hours.",
        "Preheat oven to 450°F. Transfer chickens from bags to a small roasting pan; gently blot excess oil from marinade with paper towels, leaving herbs intact on chicken skin. Stuff each chicken with a lemon half and several thyme sprigs. Tie legs together with kitchen twine, if desired.",
        "Roast until well browned, 30-35 minutes. Reduce heat to 350°F and continue roasting, occasionally basting chickens with pan juices, until an instant-read thermometer inserted into the thickest part of the thigh registers 165°F, 20-30 minutes longer. Transfer chickens to a carving board; let rest for 20 minutes before carving.",
        "Heat oil in a large skillet over medium heat. Add onion, capers, and red pepper flakes. Season with salt and cook, stirring occasionally, until onion is soft but not brown, about 5 minutes. Add peppers and chiles; season with salt and cook, stirring occasionally, until soft, 10-12 minutes. Stir in caper brine, corn, parsley, and vinegar just before serving.",
        "Combine first 4 ingredients in a small bowl. Stir in oil. DO AHEAD: Can be made 2 days ahead. Cover and chill. Let come to room temperature before serving. Serve with chickens and peppers and corn."
    ],
    "ingredients": [
        "1/4 cup fresh lemon juice",
        "1/4 cup olive oil",
        "3 garlic cloves, minced, mashed to a paste with the back of a knife",
        "3 tablespoons chopped fresh thyme leaves plus sprigs for stuffing",
        "2 tablespoons chopped fresh rosemary",
        "1 tablespoon chopped fresh sage",
        "2 2 1/2-3-pounds whole chickens",
        "2 tablespoons kosher salt",
        "Freshly ground black pepper",
        "1 lemon, halved",
        "1/4 cup olive oil",
        "1/2 cup minced red onion",
        "1/4 cup minced capers plus 1-2 teaspoon caper brine",
        "1 teaspoon crushed red pepper flakes",
        "Kosher salt",
        "8 cups thinly sliced yellow, orange, and red bell peppers (about 5 large peppers)",
        "4 red Fresno chiles, seeded, thinly sliced",
        "3 cups fresh corn kernels (from about 4 ears)",
        "2 tablespoons minced flat-leaf parsley",
        "2 tablespoons red wine vinegar",
        "1 cup unsalted shelled pistachios, coarsely chopped",
        "1/4 cup thinly sliced fresh chives",
        "2 tablespoons finely grated lemon zest",
        "1 teaspoon kosher salt",
        "1 cup extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Pepper",
        "Roast",
        "Sauté",
        "High Fiber",
        "Dinner",
        "Pistachio",
        "Corn",
        "Bell Pepper",
        "Summer",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roast Chickens with Pistachio Salsa, Peppers, and Corn",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chickens-with-pistachio-salsa-peppers-and-corn-395941"
}
