{
    "directions": [
        "Preheat oven to 375°F. Blend first 5 ingredients in small bowl. Rinse turkey inside and out; pat dry. Place turkey on rack in large roasting pan. Starting at neck end, slide hand between skin and breast meat to loosen skin. Spread seasoned butter over breast meat under skin. Sprinkle turkey inside and out with salt and pepper. If stuffing turkey, spoon stuffing loosely into main cavity. Tuck wing tips under turkey; tie legs together.",
        "Roast turkey 1 hour. Add tomatoes to pan. Roast 1 1/2 hours longer, stirring tomatoes occasionally. Pour broth into pan. Cover turkey loosely with foil. Roast until thermometer inserted into thigh registers 180°F, basting occasionally with pan juices, about 1 hour 50 minutes longer if unstuffed or 2 hours 20 minutes longer if stuffed. Transfer turkey to platter. Tent with foil; reserve pan juices.",
        "Bring 5 cups chicken broth and porcini mushrooms to boil in medium saucepan. Remove from heat; let steep 15 minutes. Transfer mushrooms to work surface; reserve mushroom broth. Chop mushrooms coarsely. Mix 2 tablespoons butter and flour in small bowl to smooth paste. Strain juices from roasting pan into large measuring cup; spoon off fat. Add enough reserved mushroom broth to pan juices to measure 6 cups. Add wine to roasting pan and bring to simmer, scraping up browned bits; add to broth.",
        "Melt remaining 2 tablespoons butter in large saucepan over medium-high heat. Add garlic and sauté 1 minute. Add parsley, thyme, rosemary and mushrooms. Sauté until mushrooms are tender, about 4 minutes. Stir in broth mixture and simmer until slightly reduced, about 30 minutes. Gradually whisk in butter-flour paste. Boil until reduced to 4 cups, stirring occasionally, about 12 minutes. Season with salt and pepper."
    ],
    "ingredients": [
        "1/4 cup butter, room temperature",
        "2 tablespoons chopped fresh parsley",
        "2 teaspoons chopped garlic",
        "2 teaspoons chopped fresh thyme",
        "2 teaspoons chopped fresh rosemary",
        "1 20- to 22-pound turkey",
        "4 large plum tomatoes, chopped",
        "1/2 cup canned low-salt chicken broth",
        "5 cups (about) canned low-salt chicken broth",
        "3/4 ounce dried porcini mushrooms",
        "4 tablespoons (1/2 stick) butter",
        "2 tablespoons all purpose flour",
        "1 1/2 cups dry white wine",
        "1 tablespoon chopped garlic",
        "1 tablespoon chopped fresh parsley",
        "2 teaspoons chopped fresh thyme",
        "2 teaspoons chopped fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Tomato",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Rosemary",
        "Fall",
        "Thyme",
        "Parsley"
    ],
    "title": "Roast Turkey with Porcini Mushroom Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-porcini-mushroom-gravy-100364"
}
