{
    "directions": [
        "1. In a large bowl, mix the chicken pieces with the onions, olive oil, ginger, cinnamon, saffron, lemon juice, water, salt, and pepper. Leave to marinate for at least an hour, or overnight in the fridge.",
        "2. Preheat the oven to 375°F / 190°C. Spread the hazelnuts out on a baking sheet and toast for 10 minutes, until lightly browned. Chop coarsely and set aside.",
        "3. Transfer the chicken and marinade to a baking sheet large enough to accommodate everything comfortably. Arrange the chicken pieces skin side up and put the pan in the oven for about 35 minutes.",
        "4. While the chicken is roasting, mix the honey, rose water, and nuts together to make a rough paste. Remove the chicken from the oven, spoon a generous amount of nuts paste onto each piece, and spread it to cover. Return to the oven for 5 to 10 minutes, until the chicken is cooked through and the nuts are golden brown.",
        "5. Transfer the chicken to a serving dish and garnish with the chopped green onions."
    ],
    "ingredients": [
        "1 large organic or free-range chicken, divided into quarters: breast and wing, leg and thigh",
        "2 onions, coarsely chopped",
        "4 tbsp olive oil",
        "1 tsp ground ginger",
        "1 tsp ground cinnamon",
        "a generous pinch of saffron threads",
        "juice of 1 lemon",
        "4 tbsp cold water",
        "2 tsp coarse sea salt",
        "1 tsp freshly ground black pepper",
        "scant 3/4 cups / 100 g unskinned hazelnuts",
        "3 1/2 tbsp / 70 g honey",
        "2 tbsp rose water",
        "2 green onions, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Marinate",
        "Roast",
        "Rosh Hashanah/Yom Kippur",
        "Dinner",
        "Saffron",
        "Anniversary",
        "Honey",
        "Hazelnut",
        "Advance Prep Required",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roast Chicken with Saffron, Hazelnuts, and Honey",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-saffron-hazelnuts-and-honey-51184640"
}
