{
    "directions": [
        "Preheat an oven to 425 degrees F (220 degrees C).",
        "Toss the Jerusalem artichokes, potatoes, and garlic with 1 tablespoon olive oil in a large bowl; season with sea salt and black pepper. Spread the mixture into a baking dish. Toss the mushrooms with another tablespoon of olive oil in a separate bowl; spread into a separate baking dish.",
        "Bake the potato mixture in the preheated oven for 20 minutes. Place the mushrooms in the oven and continue baking until the potatoes are soft and slightly browned, about 25 minutes more. Remove both dishes from the oven and set aside.",
        "Melt the vegan margarine in a large stock pot over medium-low heat; cook the onion in the margarine until completely soft, 7 to 10 minutes. Stir the roasted potato mixture and the mushrooms into the onions, along with 1 teaspoon sea salt and the water; allow the mixture to come to a simmer, stirring occasionally, for 4 to 5 minutes. Stir the mushroom broth and sage into the mixture. Place a cover on the stock pot and cook to allow the flavors to blend, about 20 minutes.",
        "Allow the soup to cool slightly before pouring in batches into a blender, filling the pitcher no more than halfway. Hold the lid firmly with a folded kitchen towel and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree; transfer blended batches to a clean pot. Alternately, you can use a stick blender and puree the soup in the pot. Stir the soy milk, if using, into the finished bisque to serve."
    ],
    "ingredients": [
        "2 pounds Jerusalem artichokes, scrubbed and sliced 1/3-inch thick",
        "1 large Yukon Gold potato, diced",
        "6 large cloves garlic",
        "2 tablespoons olive oil, divided",
        "sea salt and freshly ground black pepper to taste",
        "8 ounces mushrooms, sliced",
        "2 tablespoons vegan margarine",
        "1 large onion, diced",
        "1 teaspoon sea salt",
        "2 cups water",
        "6 cups mushroom broth",
        "1 tablespoon chopped fresh sage",
        "1/2 cup soy milk (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Mushroom and Sunchoke Bisque",
    "url": "http://allrecipes.com/recipe/216662/roasted-mushroom-and-sunchoke-bisque/"
}
