{
    "directions": [
        "Preheat oven to 385 degrees F (196 degrees C).",
        "Pour olive oil into a large bowl; toss potatoes, carrots, bite-size pieces of celery, and 3/4 of the sliced onion in the oil to coat. Set remaining onion aside. Transfer oiled vegetables to a large cast iron skillet.",
        "Rinse chicken and pat thoroughly dry with paper towels. Generously season the chicken, inside and out, with salt, black pepper, and garlic powder. Place the remaining 1/4 of the sliced onion, 1/4 cup margarine, lemon slices, 1 teaspoon minced garlic, and large pieces of celery into the cavity of the chicken.",
        "Place the chicken atop the oiled vegetables; scatter remaining 1/4 cup of margarine pieces and 1 2/3 tablespoon minced garlic in small amounts around the vegetables.",
        "Roast chicken and vegetables in the preheated oven until the skin is browned and crisp, the vegetables are tender, and an instant-read meat thermometer inserted into the thickest part of a thigh reads 165 degrees F (75 degrees C), about 1 hour and 45 minutes. Let chicken rest for 10 minutes before carving and serving with vegetables."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "4 red potatoes, cut into large cubes",
        "1 (16 ounce) package carrots, cut diagonally into bite-size pieces",
        "1 stalk celery, cut diagonally into bite-size pieces",
        "1 sweet onion, sliced - divided",
        "1 (4.5 pound) whole chicken",
        "salt and ground black pepper to taste",
        "garlic powder, or to taste",
        "1/4 cup margarine",
        "1 large lemon, sliced",
        "1 teaspoon minced garlic",
        "1 stalk celery, cut into 3 pieces",
        "1/4 cup margarine, cut into pieces",
        "1 2/3 tablespoons minced garlic"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roast Chicken and Vegetables",
    "url": "http://allrecipes.com/recipe/228844/roast-chicken-and-vegetables/"
}
