{
    "directions": [
        "Bring 5 cups water to a boil in a medium pot, season with salt, and add sorghum. Cover and cook until tender, about 1 hour. Drain well.",
        "Place racks in upper and lower thirds of oven and set a rimmed baking sheet on lower rack; preheat oven to 400°F. Arrange squash on another rimmed baking sheet; season with salt and dot with 2 Tbsp. butter. Place on upper rack in oven. Roast, turning occasionally to recoat with butter, until tender, 40–45 minutes.",
        "Meanwhile, rub chicken all over with oil; season with salt and pepper. Place skin side down on heated baking sheet on lower rack in oven. Roast until an instant-read thermometer inserted into the thickest part of thigh registers 165°F, 30–35 minutes.",
        "Cook remaining 4 Tbsp. butter in a large skillet over medium heat until it foams, then browns (be careful not to let it burn), about 5 minutes. Reduce heat to medium-low; add sorghum, squash, broth, maple syrup, and vinegar to brown butter and toss to combine. Simmer until liquid is evaporated, about 4 minutes. Remove from heat and stir in lemon juice; season with salt, pepper, and more vinegar, if desired.",
        "Divide squash and sorghum among plates and top with chicken, parsley, and pomegranate seeds."
    ],
    "ingredients": [
        "Kosher salt",
        "1 cup sorghum",
        "1/2 large butternut squash, peeled, cut into 1-inch pieces (about 2 cups)",
        "6 tablespoons unsalted butter, cut into small pieces, divided",
        "4 bone-in chicken legs (thigh and drumstick; about 3 pounds total)",
        "1 tablespoon olive oil",
        "Freshly ground black pepper",
        "1/2 cup low-sodium chicken broth",
        "1 tablespoon pure maple syrup",
        "1 tablespoon (or more) sherry vinegar",
        "2 tablespoons fresh lemon juice",
        "1/2 cup coarsely chopped parsley",
        "1/2 cup pomegranate seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Chicken",
        "Grains",
        "Wheat/Gluten-Free",
        "Butternut Squash",
        "Maple Syrup",
        "Pomegranate",
        "Parsley"
    ],
    "title": "Roast Chicken With Sorghum and Squash",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-legs-with-sorghum-and-squash"
}
