{
    "directions": [
        "Combine oil and 1/4 cup vinegar in heavy large roasting pan. Add pork; turn to coat. Marinate pork 1 hour at room temperature or 2 hours in refrigerator. Transfer pork to large rimmed baking sheet; pat dry. Discard marinade in pan.",
        "Preheat oven to 400°F. Spread mustard over top of pork, then sprinkle with salt and pepper. Roast pork until thermometer inserted into center registers 145°F, about 25 minutes. Remove pork from oven; let stand 10 minutes.",
        "Meanwhile, melt butter in heavy medium saucepan over medium heat. Stir in chestnuts, garlic, sugar, and sage; cook 2 minutes. Add remaining 3 tablespoons vinegar and 3 tablespoons water; bring to boil. Reduce heat to low and simmer until mixture thickens slightly, about 3 minutes. Season glaze with salt and pepper.",
        "Slice pork into 1/2-inch-thick rounds. Transfer to platter. Drizzle with warm glaze and serve.",
        "*To prepare fresh chestnuts, start with heavy, glossy nuts with firm, smooth shells. Cut a small cross on one side of each shell to let steam escape as the nuts roast and to make them easier to peel afterward. Place chestnuts in a shallow roasting pan; sprinkle with water. Roast in 400°F oven for 25 to 20 minutes. Wrap hot chestnuts in towl and squeeze to crush the shells. Keep nuts wrapped for 5 minutes before removing the hard outer shell and the brown skin inside, being wary of burning your fingers. One pound of fresh chestnuts equals about two cups when shelled."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "1/4 cup plus 3 tablespoons balsamic vinegar",
        "2 pork tenderloins, each 12 to 16 ounces",
        "3 tablespoons Dijon mustard",
        "2 tablespoons (1/4 stick) butter",
        "1 1/2 cups peeled roasted chestnuts*, or jarred chestnuts, finely chopped",
        "3 garlic cloves, chopped",
        "1 tablespoon sugar",
        "2 teaspoons chopped fresh sage",
        "3 tablespoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Pork",
        "Roast",
        "Sauté",
        "Quick & Easy",
        "Vinegar",
        "Pork Tenderloin",
        "Fall",
        "Winter",
        "Sage",
        "Chestnut"
    ],
    "title": "Roast Pork Tenderloins with Balsamic-Chestnut Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-tenderloins-with-balsamic-chestnut-glaze-231290"
}
