{
    "directions": [
        "Melt butter in large pot over medium-high heat. Add onions and sauté until deep brown, about 40 minutes. Mix in rosemary and thyme, then flour; stir 1 minute. Add vinegar and honey; simmer until thickened, about 2 minutes. (Can be made 1 day ahead. Cover; chill.)",
        "Mix butter and herbs in small bowl. Rinse turkey inside and out; pat dry. Place on rack set in large roasting pan. Sprinkle inside and out with salt and pepper. Starting at neck end, slide hand between skin and breast meat to loosen skin. Spread 1/4 cup herb butter over breast meat under skin. Rub remaining butter over outside of turkey. Place turkey parts and onion quarters in pan around turkey. (Can be prepared 1 day ahead. Cover and chill.)",
        "Set rack at lowest position in oven and preheat to 350°F. If stuffing turkey, spoon stuffing loosely into main cavity and neck cavity. Tuck wing tips under; tie legs together loosely to hold shape. Roast turkey uncovered 1 hour. Tent turkey breast and tops of drumsticks loosely with foil; roast 1 hour longer. Add 1 cup broth, herb sprigs, and bay leaf to drippings in pan. Continue to roast until thermometer inserted into thickest part of thigh registers 175°F, basting with 3/4 cup broth and pan juices every 30 minutes, about 2 hours 30 minutes longer for unstuffed and 3 hours longer for stuffed. Transfer turkey to platter; let stand 30 minutes (internal temperature will increase 5 to 10 degrees).",
        "Strain pan juices into 8-cup measuring cup; spoon fat off top. Heat gravy base over medium heat. Whisk in flour, then pan juices. Boil until gravy is reduced to 7 cups, stirring occasionally, about 12 minutes. Season with salt and pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "1/2 cup (1 stick) butter",
        "4 large onions, thinly sliced",
        "1 1/2 tablespoons chopped fresh rosemary",
        "1 1/2 tablespoons chopped fresh thyme",
        "1 1/2 tablespoons all purpose flour",
        "1/2 cup balsamic vinegar",
        "3 tablespoons honey",
        "6 tablespoons (3/4 stick) butter, room temperature",
        "1 1/2 tablespoons chopped fresh thyme",
        "1 tablespoon chopped fresh rosemary",
        "1 21- to 22-pound turkey; neck, heart, and gizzard reserved",
        "1 large onion, quartered",
        "4 1/2 cups (about) low-salt chicken broth",
        "2 large fresh rosemary sprigs",
        "2 large fresh thyme sprigs",
        "1 bay leaf",
        "3 tablespoons all purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Onion",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Vinegar",
        "Fall"
    ],
    "title": "Roast Turkey with Herb Butter and Caramelized-Onion Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-herb-butter-and-caramelized-onion-gravy-107243"
}
