{
    "directions": [
        "Fill a 3-quart saucepan halfway with water and bring to a boil. Add garlic and simmer 5 minutes. Remove garlic with a slotted spoon and reserve. Add potatoes to water with bay leaf and salt to taste, then simmer, covered, 10 minutes (potatoes will not be fully cooked). Cool potatoes in hot water, uncovered, then drain and peel.",
        "Put a 17- by 11-inch roasting pan in middle of oven and preheat oven to 425°F.",
        "Melt 1 tablespoon butter and set aside. Mash together mustard, chives, remaining 5 tablespoons butter, and salt and pepper to taste. Reserve 1 tablespoon mustard butter for sauce.",
        "Remove excess fat from cavities and necks, then rinse hens and pat dry. Run your finger between skin and flesh of breast and legs of each hen to loosen skin (outsides of thighs are easier to access from neck end). Push mustard butter under skin and massage skin from outside to spread butter evenly over breast and legs. Season hens inside and out with salt and pepper and put half of herb stems in cavity of each bird. Tie legs together with kitchen string and close cavity with toothpicks.",
        "Brush melted butter over hens.",
        "Remove roasting pan from oven and add oil, tilting to coat. Put hens in pan, breast sides up, and scatter potatoes and shallots around them. Roast hens, basting every 10 minutes with a brush and turning vegetables, 30 minutes. Scatter reserved garlic and thyme leaves around hens and roast, basting frequently and turning vegetables, until a thermometer inserted in thickest part of a thigh (without touching bone) registers 170°F and vegetables are tender, 20 to 30 minutes more (30 to 40 minutes more for chickens). Discard string and toothpicks from hens and transfer hens to a platter. Surround with vegetables and keep warm, loosely covered, while making sauce.",
        "Skim fat from pan juices and add chicken broth, then deglaze by boiling, scraping up brown bits, until reduced to about 1/2 cup. Pour sauce through a sieve into a sauceboat and stir in reserved tablespoon mustard butter with salt and pepper to taste.",
        "Chop tarragon and parsley leaves and scatter over hens and vegetables. Serve with sauce."
    ],
    "ingredients": [
        "8 garlic cloves, each halved lengthwise and germ removed if green",
        "1 lb fingerling potatoes or small boiling potatoes",
        "1 bay leaf (not California)",
        "3/4 stick (6 tablespoons) unsalted butter, softened",
        "2 1/2 tablespoons whole-grain mustard",
        "1 tablespoon chopped fresh chives",
        "2 (2 1/2-lb) guinea hens or 2 (2 1/2- to 3-lb) free-range chickens",
        "4 large sprigs fresh thyme, leaves and stems separated",
        "4 sprigs fresh tarragon, leaves and stems separated",
        "4 sprigs fresh flat-leaf parsley, leaves and stems separated",
        "2 tablespoons extra-virgin olive oil",
        "6 medium shallots (1/2 lb), lobes separated if necessary",
        "1/2 cup low-sodium chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Game",
        "Garlic",
        "Herb",
        "Mustard",
        "Potato",
        "Poultry",
        "Roast",
        "Christmas",
        "Valentine's Day",
        "Dinner",
        "Fall",
        "Winter",
        "Anniversary",
        "Shallot",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roasted Guinea Hens with Whole-Grain Mustard and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-guinea-hens-with-whole-grain-mustard-and-herbs-103977"
}
