{
    "directions": [
        "With a sharp knife cut a cross on the flat side of each chestnut.  Simmer, covered with water, in a saucepan for 5 minutes.  Drain.  While hot, remove the shells and inner brown skins.  Cover with fresh water.  Boil for 20 to 30 minutes until tender.  Drain.  Chop coarsely.",
        "Melt the butter or margarine in a saucepan.  Add onions and celery, and cook until limp.  Add bread crumbs and spices.  Mix thoroughly.  Mix in chestnuts.   Salt to taste.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Remove neck and giblets: use for gravy if desired.  Wash turkey with cold water, and dry.  Rub salt and pepper into body cavities.  Spoon stuffing into body cavities.  Do not pack tightly.  Close skin with skewers or twine, and tie drumsticks together.  Place turkey on a roasting pan.",
        "Roast the turkey, uncovered, for 20 minutes per pound.  Test after three hours for doneness with a fork to see if juices run clear, and with a thermometer for an internal temperature of 175 degrees F (80 degrees C).  If the turkey gets too dark, place an aluminum foil \"tent\" over the breast.  Remove from oven, place on platter, and allow the turkey to stand for 20 minutes before carving.",
        "Any extra stuffing can be baked in a covered casserole in the oven with the turkey for the last hour."
    ],
    "ingredients": [
        "12 pounds whole turkey",
        "salt to taste",
        "ground black pepper to taste",
        "2 pounds chestnuts",
        "2 cups butter",
        "2 cups minced onion",
        "2 cups finely diced celery",
        "10 cups bread crumbs",
        "1 teaspoon dried thyme",
        "1 teaspoon dried marjoram",
        "1 teaspoon ground savory",
        "1 teaspoon dried rosemary"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roast Turkey With Tasty Chestnut Stuffing",
    "url": "http://allrecipes.com/recipe/9195/roast-turkey-with-tasty-chestnut-stuf/"
}
