{
    "directions": [
        "Combine 4 quarts water and 1 cup coarse salt in very large bowl. Let stand until salt dissolves, whisking occasionally, about 10 minutes. Place turkey in salted water, turning to coat. Let turkey stand at room temperature 2 hours, turning occasionally. Rinse turkey and pat dry with paper towels. Place turkey on rack set in large roasting pan. Tuck wings under turkey body.",
        "Position oven rack in bottom third of oven and preheat to 325°F. Whisk butter, orange juice, lemon juice, thyme, orange peel, lemon peel, 3/4 teaspoon salt and pepper in medium bowl until well blended. Rub 1/4 cup thyme butter inside turkey. Spoon stuffing loosely into main cavity and neck cavity. Generously rub remaining thyme butter over turkey. Tie legs together loosely to hold shape of turkey.",
        "Roast turkey until golden, basting occasionally with pan drippings, about 2 hours. Cover entire turkey loosely with heavy-duty foil and roast until meat thermometer inserted into innermost part of thigh registers 180°F or until juices run clear when thickest part of thigh is pierced with skewer, basting occasionally with pan juices, about 11/2 hours longer. Transfer turkey to platter. Tent turkey with foil and let stand while preparing gravy.",
        "Strain pan juices from roasting pan into large glass measuring cup. Spoon fat off top of pan juices. Pour juices and Giblet Broth into heavy medium saucepan. Boil broth mixture until reduced to 3 cups, about 10 minutes.",
        "Melt butter in heavy large saucepan over medium heat. Add flour; cook until golden brown, stirring often, about 3 minutes. Whisk in reduced broth mixture. Simmer until gravy thickens, stirring occasionally, about 5 minutes. Season to taste with salt and pepper. Add reserved chopped neck meat and giblets, eggs and brandy; simmer 5 minutes longer. Transfer to bowl. Serve gravy with turkey.",
        "Melt butter in heavy large pot over medium-high heat. Add neck and giblets; sauté until brown, about 10 minutes. Using slotted spoon, transfer neck and giblets to plate. Add carrots, onion and celery to pot. Sauté until vegetables brown, about 10 minutes. Add water, wine, neck and giblets to vegetables; bring to boil.",
        "Add all remaining ingredients to pot. Reduce heat to medium-low; partially cover and simmer until giblets are very tender, about 11/2 hours. Using slotted spoon, transfer neck and giblets to plate. Cool. Carefully remove all meat from turkey neck. Chop neck meat and giblets; reserve for gravy. Strain broth into bowl, pressing on solids. (Broth and giblets can be made 1 day ahead. Cover separately and chill.) Makes about 3 1/2 cups."
    ],
    "ingredients": [
        "4 quarts water",
        "1 cup coarse salt",
        "1 18-pound turkey; neck and giblets reserved for Giblet Broth",
        "1 cup (2 sticks) butter, cut into pieces, room temperature",
        "1/4 cup fresh orange juice",
        "1/4 cup fresh lemon juice",
        "2 tablespoons chopped fresh thyme or 1 tablespoon dried",
        "1 tablespoon grated orange peel",
        "1 teaspoon grated lemon peel",
        "3/4 teaspoon salt",
        "3/4 teaspoon pepper",
        "Corn Bread Stuffing",
        "6 tablespoons (3/4 stick) butter",
        "6 tablespoons all purpose flour",
        "Chopped turkey neck meat and giblets reserved from Giblet Broth",
        "3 hard-boiled eggs, finely chopped",
        "3 tablespoons brandy",
        "2 tablespoons (1/4 stick) butter",
        "Neck and giblets reserved from 18-pound turkey (discard liver, if desired)",
        "1 1/2 cups chopped carrots",
        "1cup chopped onion",
        "1/2 cup chopped celery",
        "5 cups water",
        "1 cup dry white wine",
        "2 3-inch pieces leek (white and pale green parts only)",
        "8 parsley sprigs",
        "2 teaspoons chopped fresh thyme or 1 teaspoon dried",
        "2 bay leaves",
        "2 whole cloves",
        "1/4 teaspoon whole black peppercorns"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Brine"
    ],
    "title": "Roast Turkey with Corn Bread Stuffing and Giblet Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-corn-bread-stuffing-and-giblet-gravy-2771"
}
