{
    "directions": [
        "In a roasting pan combine well the onions, the tomatoes, the oil, and salt and pepper to taste and roast the mixture in the middle of a preheated 500°F. oven for 10 minutes. Stir the mixture, put the beef, seasoned with salt and pepper, on top of it, and roast the beef and the onion mixture in the oven for 15 minutes. Reduce the temperature to 350°F. and roast the beef for 12 minutes more per pound, or until a thermometer registers 135°F., for medium-rare meat.",
        "Transfer the beef to a cutting board and let it stand for 30 minutes. Transfer three fourths of the onion mixture to a bowl and reserve it, keeping it warm, covered. To the mixture remaining in the roasting pan add the flour and cook the mixture over moderate heat, stirring, for 3 minutes. Whisk in the broth, the water, the Worcestershire sauce, and any juices that may have accumulated on the cutting board and simmer the gravy, whisking and scraping up the brown bits, for 10 minutes. Transfer the gravy to a small saucepan and skim the fat from the top. Just before serving, carve the beef, arrange it on a platter with the reserved onion mixture, and garnish it with the rosemary sprigs. Bring the gravy to a boil, transfer it to a gravy boat, and serve it with the beef."
    ],
    "ingredients": [
        "3 large onions (about 1 1/2 pounds), sliced thin",
        "a 14- to 16-ounce can tomatoes, crushed and drained in a sieve",
        "1 tablespoon vegetable oil",
        "a tied boneless 3-pound rib roast at room temperature",
        "1 tablespoon all-purpose flour",
        "1 cup beef broth",
        "1 cup water",
        "2 tablespoons Worcestershire sauce",
        "fresh rosemary sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Tomato",
        "Roast",
        "Winter",
        "Gourmet"
    ],
    "title": "Roast Beef with Glazed Onions and Worcestershire Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-beef-with-glazed-onions-and-worcestershire-gravy-10944"
}
