{
    "directions": [
        "Preheat oven to 400°F. Place bread in large roasting pan. Bake until golden, stirring occasionally, about 15 minutes. Transfer bread to very large bowl; cool. Maintain oven temperature.",
        "Spray 2 large rimmed baking sheets with nonstick spray. Combine onions, parsnips, peppers, mushrooms, rosemary, and 4 tablespoons butter in large bowl; toss to coat. Sprinkle generously with salt and pepper. Divide vegetable mixture between prepared baking sheets. Roast until vegetables are tender and beginning to brown, stirring every 10 minutes, about 35 minutes total.",
        "Add roasted vegetables to bowl with bread. Add chestnuts, parsley, and remaining 6 tablespoons melted butter; stir to blend. Season stuffing to taste with salt and pepper. Mix eggs into stuffing.",
        "Loosely fill neck and main cavities of turkey with stuffing. Add enough broth to remaining stuffing to moisten slightly (1/4 to 3/4 cup, depending on amount of remaining stuffing). Generously butter baking dish. Spoon remaining stuffing into prepared dish. Cover with buttered foil, buttered side down. Bake stuffing in dish along side turkey until heated through, about 25 minutes. Uncover stuffing. Bake until top of stuffing is slightly crisp and golden, about 15 minutes longer.",
        "Preheat oven to 350°F. Generously butter 13x9x2-inch glass baking dish, depending on recipe. Add enough extra broth to stuffing to moisten (3/4 cup to 1 1/4 cups). Transfer stuffing to prepared dish. Cover with buttered foil, buttered side down. Bake until heated through, about 40 minutes. Uncover and bake until top is slightly crisp and golden, about 20 minutes longer."
    ],
    "ingredients": [
        "16 ounces sliced sourdough bread with crusts, cut into 1/2-inch pieces (about 14 cups)",
        "Nonstick vegetable oil spray",
        "1 pound onions, cut into 3/4-inch pieces",
        "4 medium parsnips (about 15 ounces), peeled, cut into 1/2-inch pieces",
        "2 large red bell peppers, cut into 3/4-inch pieces",
        "1 pound fresh shiitake mushrooms, stemmed, caps cut into 1-inch pieces",
        "3 tablespoons chopped fresh rosemary",
        "10 tablespoons butter, melted",
        "2 1/2 7.4-ounce jars whole roasted chestnuts, quartered (about 4 cups)",
        "1/2 cup chopped fresh parsley",
        "2 large eggs",
        "Canned low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Side",
        "Bake",
        "Roast",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Fall",
        "Chestnut",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Roasted Vegetable and Chestnut Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-vegetable-and-chestnut-stuffing-105805"
}
