{
    "directions": [
        "Place the salt and sugar into a large resealable bag. Pour in enough water to cover the turkey legs, and squeeze the bag to dissolve salt and sugar. Immerse the turkey legs in the brine, and seal the bag. Refrigerate for at least 2 hours to brine.",
        "In a saucepan, stir together the white wine, pomegranate molasses, brown sugar, regular molasses, vinegar, ketchup and Worcestershire sauce. Bring to a boil, and cook until reduced by half. Season with 1 tablespoon of sage and 1 tablespoon of thyme. Taste and adjust sugar, salt and pepper if desired.",
        "Preheat the oven to 325 degrees F (165 degrees C). Remove the turkey legs from the brine and pat dry with paper towels. Discard the brine. Heat a large oven-proof skillet over medium-high heat. Cast iron will work well. Fry the turkey, turning frequently, until browned on all sides. Place the pan with the turkey into the oven.",
        "Roast uncovered for 45 minutes in the preheated oven. Remove and turn legs over. Season with some of the remaining thyme and sage, and spoon some of the sauce onto the legs to coat. Return to the oven for an additional 30 minutes.",
        "Repeat the seasoning and baste with the sauce again, and return to the oven. Roast for 15 more minutes, then test for doneness. The internal temperature should be 180 degrees F (82 degrees C) when taken with a meat thermometer. Serve turkey with remaining sauce on the side."
    ],
    "ingredients": [
        "1/2 cup salt",
        "1/2 cup white sugar",
        "4 turkey drumsticks",
        "2 cups white wine",
        "1/2 cup pomegranate molasses",
        "1/2 cup brown sugar",
        "1/4 cup molasses",
        "1/4 cup balsamic vinegar",
        "1/2 cup ketchup",
        "2 tablespoons Worcestershire sauce",
        "4 tablespoons dried sage leaves, divided",
        "4 tablespoons dried thyme leaves, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Turkey Legs",
    "url": "http://allrecipes.com/recipe/92624/roasted-turkey-legs/"
}
