{
    "directions": [
        "Bring cream, 1 cup sugar, and a pinch of kosher salt to a gentle simmer in a medium saucepan over medium heat, stirring to dissolve sugar and salt. Cook 3 minutes. Remove from heat and whisk in lemon juice. Let cool slightly, then transfer to a medium bowl and press a sheet of plastic wrap directly onto surface (this will help prevent a skin from forming). Chill lemon cream until it has set up to a pudding-like consistency, at least 12 hours.",
        "Preheat oven to 325°F. Combine gluten-free flour, butter, brown sugar, basil, vanilla, and a pinch of kosher salt in a medium bowl. Using your fingers, work mixture until it comes together in small clumps. Scatter crumble on a large parchment-lined baking sheet. Bake until golden brown and slightly firm, 30–35 minutes. Let cool and break into smaller pieces. Mix in granola.",
        "Increase oven temperature to 425°F. Toss strawberries, smoked salt, and remaining 1/4 cup sugar on a clean rimmed baking sheet to combine. Roast strawberries, tossing once, until they are juicy but still hold their shape, about 5 minutes. Let cool slightly.",
        "Just before serving, assemble trifles by spooning alternating layers of lemon cream, roasted strawberries, and granola crumble into 8–12-oz. glasses or jars, dividing evenly. Top off with some mint and basil leaves.",
        "Lemon cream can be made 2 days ahead. Keep chilled."
    ],
    "ingredients": [
        "3 cups heavy cream",
        "1 1/4 cups sugar, divided",
        "Kosher salt",
        "1/3 cup fresh lemon juice",
        "1 cup gluten-free baking flour or regular all-purpose flour",
        "5 tablespoons unsalted butter, room temperature, cut into pieces",
        "1/4 cup (packed) light brown sugar",
        "1 tablespoon finely chopped basil",
        "1 teaspoon vanilla extract",
        "3/4 cup granola",
        "2 pounds strawberries, hulled, halved if large",
        "1 teaspoon smoked sea salt or flaky sea salt",
        "Torn mint and basil leaves (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Summer",
        "Strawberry",
        "Lemon",
        "Milk/Cream",
        "Wheat/Gluten-Free",
        "Vegetarian",
        "Roast",
        "Basil",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted Strawberry Trifles With Lemon Cream",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-strawberry-trifles-with-lemon-cream"
}
