{
    "directions": [
        "Preheat oven to 425°F. Place carrots on a rimmed baking sheet and onions and fennel on another rimmed baking sheet. (Make sure to give them plenty of room, which is key to roasted veggies with nicely browned edges.) Drizzle vegetables with 2 Tbsp. oil, dividing evenly; season with salt and pepper. Roast, tossing occasionally, until golden brown and tender, 20–25 minutes for carrots and 35–45 minutes for onions and fennel. Let cool.",
        "Meanwhile, cook sunflower seeds, coriander seeds, Aleppo pepper, paprika, and remaining 2 Tbsp. oil in a small skillet over medium heat, stirring often, until oil is gently bubbling around seeds and spices are fragrant (be careful not to burn), about 2 minutes. Let cool. Stir in vinegar and lemon juice; season vinaigrette with salt and pepper.",
        "Combine roasted carrots, fennel, and onions onto the same baking sheet, drizzle vinaigrette over, and toss to coat well; transfer to a platter.",
        "Just before serving, re-toss vegetables to pull up any dressing that may have settled at the bottom of the platter and scatter mint over top.",
        "Dish (without mint) can be made 3 hours ahead. Store tightly wrapped at room temperature."
    ],
    "ingredients": [
        "2 pounds small carrots (about 2 bunches), peeled, cut into 3\" pieces",
        "2 large red onions, each cut through root end into 8 wedges",
        "1 fennel bulb, cut into 1/2\" wedges",
        "4 Tbsp. olive oil, divided",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons raw sunflower seeds",
        "1 teaspoon coriander seeds, coarsely chopped",
        "1/2 teaspoon Aleppo pepper or a pinch of crushed red pepper flakes",
        "1/2 teaspoon Hungarian hot paprika",
        "2 tablespoons Sherry vinegar or red wine vinegar",
        "1 tablespoon fresh lemon juice",
        "2 tablespoons torn mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Carrot",
        "Onion",
        "Fennel",
        "Side",
        "Mint",
        "Vegan",
        "Vegetarian",
        "Vegetable",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Carrots and Red Onions With Fennel and Mint",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-carrots-and-red-onions-with-fennel-and-mint"
}
