{
    "directions": [
        "Into a bowl of water squeeze juice from 2 lemon quarters, dropping squeezed quarters into water. Break off and discard stem of 1 artichoke. Bend back outer leaves until they snap off close to base and remove several more layers of leaves until pale inner leaves are reached. Trim base and sides of artichoke with a very sharp stainless-steel knife and cut off the top 1 1/2 inches. Cut artichoke into quarters and cut away choke and spiky purple-tipped leaves. Rub artichoke quarters all over with a remaining lemon quarter and drop them into bowl of water. Prepare remaining 3 artichokes in same manner, using other lemon quarter if necessary .",
        "Preheat oven to 475°F.",
        "In a saucepan of boiling salted water blanch artichokes 3 minutes and with a slotted spoon transfer to a bowl. In boiling salted water blanch Jerusalem artichokes 5 minutes and drain.",
        "In a flameproof roasting pan, 17 by 11 1/2 by 2 inches, toss artichokes, Jerusalem artichokes, onions, and garlic cloves with 2 tablespoons olive oil and salt and pepper to taste. Roast vegetables in middle of oven 20 minutes.",
        "While vegetables are roasting, heat a heavy 12-inch skillet over moderately high heat until hot. While skillet is heating, season lamb racks with salt and pepper. Add vegetable oil to skillet and brown lamb, meaty sides down, 2 minutes. Turn lamb over and brown 2 minutes more. Transfer lamb to a plate and cool slightly.",
        "In a small bowl stir together chopped garlic, oregano, coarse salt, freshly ground pepper, and remaining 2 teaspoons olive oil and rub all over lamb.",
        "Remove pan from oven and stir vegetables. Arrange lamb over vegetables, rib sides down, and roast 20 minutes, or until a meat thermometer inserted in fleshy section registers 130°F. for medium-rare.",
        "Remove 8 garlic cloves from pan and squeeze garlic out of skins into a blender. Add broth and blend until smooth. Transfer remaining vegetables and lamb to a heated platter, reserving juices in pan, and let rest, covered loosely, 10 minutes.",
        "To pan add garlic broth and salt and pepper to taste and on top of stove deglaze over moderately high heat, scraping up brown bits. Boil sauce until thickened slightly and transfer to a sauceboat.",
        "Cut lamb racks in half or into individual chops and serve with vegetables and sauce."
    ],
    "ingredients": [
        "1 lemon, quartered",
        "4 artichokes",
        "1 pound Jerusalem artichokes (sunchokes)*, peeled and cut into 1-inch  wedges",
        "4 medium red onions (about 1 1/2 pounds total), each cut into 6 wedges, leaving enough of root ends attached to keep wedges intact",
        "16 unpeeled large garlic cloves plus 1 tablespoon finely chopped garlic",
        "2 tablespoons plus 2 teaspoons extra-virgin olive oil",
        "1 teaspoon vegetable oil",
        "2 frenched racks of lamb** (8 ribs, about 1 1/4 pounds each), trimmed of  all but a thin layer of fat",
        "3 tablespoons fresh oregano leaves or 2 teaspoons dried oregano, crumbled",
        "1 1/2 teaspoons coarse salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 cup chicken broth",
        "*available at specialty produce markets and many supermarkets",
        "**available by request from butchers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Lamb",
        "Onion",
        "Vegetable",
        "Roast",
        "Lemon",
        "Rack of Lamb",
        "Artichoke",
        "Winter",
        "Gourmet"
    ],
    "title": "Roasted Racks of Lamb with Artichokes, Red Onions, and Garlic Cloves",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-racks-of-lamb-with-artichokes-red-onions-and-garlic-cloves-13627"
}
