{
    "directions": [
        "Preheat oven to 350°F. Place 6 cups strawberries and 6 tarragon sprigs in 13x9x2-inch glass baking dish. Sprinkle with 2 tablespoons sugar and lemon juice; toss to coat. Roast uncovered until strawberries are soft and syrup forms, stirring occasionally, about 20 minutes; cool 30 minutes.",
        "Strain strawberry mixture into medium bowl, pressing on fruit to release as much pulp as possible; discard seeds in strainer. Transfer 1 1/2 cups strawberry purée to another medium bowl; mix in crème fraîche. Reserve any remaining purée for another use.",
        "Place 2 1/2 tablespoons cold water in small saucepan; sprinkle gelatin over. Let stand until gelatin softens, about 15 minutes.",
        "Scrape seeds from vanilla bean halves into another small saucepan; add bean. Add cream and remaining 1/2 cup sugar. Bring to simmer over medium heat, stirring until sugar dissolves. Remove cream mixture from heat; add gelatin mixture and stir to dissolve. Cool slightly. Stir cream-gelatin mixture into strawberry cream. Strain into large measuring cup; divide among six 3/4-cup ramekins or small goblets. Cover and chill until panna cotta is set, at least 6 hours and up to 1 day. Garnish with whole strawberries and remaining tarragon sprigs."
    ],
    "ingredients": [
        "6 cups halved hulled strawberries, patted dry (2 to 2 1/2 pounds), plus 6 whole strawberries for garnish",
        "12 sprigs fresh tarragon, divided",
        "2 tablespoons plus 1/2 cup sugar",
        "1/2 teaspoon fresh lemon juice",
        "1 cup crème fraîche",
        "2 1/2 tablespoons cold water",
        "2 teaspoons unflavored gelatin",
        "1 4-inch piece vanilla bean, split lengthwise",
        "1/2 cup whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Roast",
        "Kid-Friendly",
        "Strawberry",
        "Vanilla",
        "Summer",
        "Tarragon",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roasted Strawberry Panna Cotta",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-strawberry-panna-cotta-234746"
}
