{
    "directions": [
        "In a large bowl stir together water and yeast and let stand until foamy, about 5 minutes. Stir in flour and salt and blend until mixture forms a dough, adding additional tablespoon water if too dry. On a lightly floured surface knead dough about 10 minutes, or until smooth and elastic. (Alternatively, dough may be made in a standing electric mixer, In a bowl of mixer make dough as described above. With dough hook knead dough about 5 minutes, or until smooth and elastic.)",
        "Put dough in a very lightly oiled deep bowl, turning to coat, and let rise, covered loosely, in a warm place 1 1/2 hours or until doubled in bulk. punch down dough and divide into 4 equal pieces. Dough keeps, each piece put in a small, sealable plastic bag and sealed, pressing out excess air, chilled overnight or frozen 2 weeks.If dough is frozen, thaw overnight in refrigerator before using. Makes enough dough for four 12- by 6-inch oval pizzas.",
        "Preheat oven to 450°F. and very lightly grease a large baking sheet.",
        "Cut smaller eggplant piece into 1/3-inch-thick slices. Spread eggplant slices in one layer on half of baking sheet and season with salt. Put remaining eggplant piece and all but 2 tomato halves on second half of baking sheet. Roast vegetables in middle of oven 15 minutes, or until eggplant slices are tender, and transfer eggplant slices to a plate. Roast remaining vegetables 15 minutes more, or until eggplant piece is very tender. Remove baking sheet from oven and cool vegetables slightly.",
        "Scoop out flesh from eggplant piece into a food processor and purée with roasted tomatoes, unroasted tomato, vinegar, sugar, and salt to taste. Sauce and sliced eggplant may be made 1 day ahead and kept separately, covered and chilled.",
        "On a work surface sprinkled with 1 teaspoon cornmeal roll out 1 piece of dough into a 12- by 6-inch oval and transfer to a baking sheet. Repeat with remaining cornmeal and dough, ending up with 2 ovals on each of 2 baking sheets.",
        "Increase temperature to 500°F.",
        "Spread sauce on dough ovals, leaving a 1/2-inch border around edge of each pizza. Arrange eggplant slices on sauce and sprinkle pizzas with basil and mozzarella.",
        "Bake pizzas in lower and middle thirds of oven 15 minutes, or until crusts are crisp and pale golden."
    ],
    "ingredients": [
        "1 medium eggplant (about 1 1/2 pounds), cut crosswise into 2 pieces",
        "3/4 pound plum tomatoes, halved",
        "2 teaspoons red-wine vinegar",
        "1/4 teaspoon sugar",
        "4 teaspoons yellow cornmeal",
        "1/2 cup fresh basil leaves, washed well, spun dry, and chopped coarse",
        "1/4 pound smoked mozzarella, grated coarse (about 1 cup)",
        "3/4 cup warm water (110° -115°F.) plus additional tablespoon if necessary",
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "2 cups all-purpose flour",
        "1 1/2 teaspoons salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Mozzarella",
        "Basil",
        "Eggplant",
        "Winter",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted Tomato, Eggplant, and Smoked Mozzarella Pizzas",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-tomato-eggplant-and-smoked-mozzarella-pizzas-11365"
}
