{
    "directions": [
        "Preheat oven to 425°F.",
        "Pat tenderloins dry and season with salt and pepper. Heat oil in a 12-inch nonstick skillet over moderately high heat until hot but not smoking, then brown tenderloins on all sides, turning with tongs, about 5 minutes total. (If the handle of your skillet is not ovenproof, wrap handle in a triple layer of foil, shiny side out.) Transfer skillet to upper third of oven and roast until a thermometer inserted diagonally into center of meat registers 155°F, 12 to 15 minutes. Transfer to a platter and let stand, loosely covered with foil, 15 minutes before slicing.",
        "While meat is standing, heat butter in same skillet (handle will be hot) over moderately high heat until foam subsides. Add apple wedges and sauté, turning occasionally, until tender and golden brown, 5 to 7 minutes. Transfer apples to a plate, then add chicken broth and cider to skillet. Bring to a boil over high heat and meanwhile whisk together arrowroot and water in a small bowl. Whisk arrowroot mixture into sauce and boil until thickened and reduced to about 1 cup, about 5 minutes. Remove from heat and stir in vinegar, measured salt and pepper, and any juices that have accumulated on platter.",
        "Cut meat into 1/2-inch-thick slices and serve topped with apples and sauce."
    ],
    "ingredients": [
        "2 (3/4-pound) pork tenderloins",
        "1 tablespoon vegetable oil",
        "2 teaspoons unsalted butter",
        "2 (1/2-pound) Granny Smith apples, peeled, cored, and each cut into 16 wedges",
        "1 cup low-sodium fat-free chicken broth",
        "2/3 cup unfiltered apple cider",
        "1/2 teaspoon arrowroot",
        "1 tablespoon water",
        "2 teaspoons cider vinegar",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Fruit",
        "Pork",
        "Roast",
        "Low Fat",
        "Quick & Easy",
        "Vinegar",
        "Apple",
        "Pork Tenderloin",
        "Fall",
        "Healthy",
        "Gourmet"
    ],
    "title": "Roast Pork Tenderloin with Apples and Cider Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-tenderloin-with-apples-and-cider-sauce-107206"
}
