{
    "directions": [
        "Season the veal and salt and pepper, spread the mustard over the top and sides, and cover the veal with the fatback. Arrange the veal, the garlic, and the shallot in a roasting pan just large enough to hold them, add the wine, and roast the veal in the middle of a preheated 325°F. oven, basting every 15 minutes, for 1 hour. Discard the fatback and roast the veal for 15 to 20 minutes more, or until it registers 150°F. on a meat thermometer. Transfer the veal to a cutting board and let it stand, covered loosely with foil, for 15 minutes. Transfer the garlic and the shallots with a slotted spoon to a bowl, toss them with 2 teaspoons of the chopped tarragon, and keep them warm, covered with foil.",
        "While the veal is standing, skim the fat from the pan juices, add the water, and deglaze the pan over high heat, scraping up the brown bits, until the mixture is reduced by half. Strain the mixture through a fine sieve into a bowl and season the gravy with salt and pepper. Cut the veal into 1/2-inch-thick slices, arrange the slices on a platter, and scatter the garlic and the shallots around them. Nap the veal with some of the gravy, sprinkle it with the remaining 1 teaspoon chopped tarragon, and garnish the platter with the tarragon strips. Serve the remaining gravy separately."
    ],
    "ingredients": [
        "a 2- to 2 1/2-pound boned veal loin (preferably naturally raised) trimmed and tied loosely at 1-inch intervals with kitchen string",
        "1/3 cup Dijon-style mustard",
        "thin slices of fatback for covering the veal (about 6 ounces)",
        "1 head of garlic, separated into cloves and peeled",
        "12 shallots, peeled",
        "1/2 cup dry white wine",
        "3 teaspoons finely chopped fresh tarragon plus tarragon sprigs for garnish",
        "1/4 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Mustard",
        "Roast",
        "Veal",
        "Shallot",
        "Gourmet"
    ],
    "title": "Roasted Loin of Veal with Garlic, Shallots, and Mustard Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-loin-of-veal-with-garlic-shallots-and-mustard-gravy-12143"
}
