{
    "directions": [
        "For the lamb: Remove 2 ribs from each rack to make it a 6-rib rack: Do this by starting from either end and removing the second and seventh bone. This creates 6 chops that are thicker than a normal lamb chop -- YUM!! Cut each rack into 6 equal chops, place on a baking sheet, and transfer to the fridge.",
        "For the harissa: Preheat a grill.",
        "Place the bell peppers on the grill and cook them on all sides until the skin is black and charred. Transfer the peppers to a large bowl, cover with plastic wrap, and let them hang out until cool. HINT, HINT: This can totally be done ahead! YAY!",
        "Scrape the black charred skin off the peppers and remove the stem and seeds. Coarsely chop the peppers and transfer them to the bowl of a food processor.",
        "Add the cumin, coriander, fennel, caraway, chiles, garlic, vinegar, and tomato paste to the food processor and season with salt. Puree until smooth.",
        "Add 1/4 cup of the olive oil to the mixture and pulse, pulse, pulse. Add the remaining 1/4 cup olive oil and pulse again until thoroughly combined. Taste and season with salt. Taste again and re-season if needed. Store in an airtight container until ready to use.",
        "To make the lamb: Preheat the oven to 250 degrees F. Remove the lamb from the fridge, season generously with salt, and let sit for 15 to 20 minutes before cooking.",
        "Coat a large saute pan with olive oil and bring the pan to medium-high heat. Working in batches to avoid crowding the pan, add the lamb chops and cook for 3 to 4 minutes on each side for medium rare (if you like your meat a little more well done, lower the heat and cook them a minute or 2 longer). If the pan begins to smoke, lower the heat. The chops will be beautifully browned on each side. Stand up the chops to brown the fat edge along each chop. YUM!!! Brown food tastes good! Place the cooked chops on a baking sheet and transfer to the oven to keep them hot while the others cook.",
        "Top each lamb chop with a spoonful of harissa and serve."
    ],
    "ingredients": [
        "Two 8-rib racks of lamb, Frenched",
        "Kosher salt",
        "Extra-virgin olive oil",
        "2 red bell peppers",
        "2 teaspoons cumin seed, toasted and ground",
        "2 teaspoons coriander seed, toasted and ground",
        "2 teaspoons fennel seed, toasted and ground",
        "2 teaspoons caraway seed, toasted and ground",
        "4 dried red chiles, coarsely chopped",
        "3 cloves garlic, smashed and finely chopped",
        "2 tablespoons red wine vinegar",
        "1/4 cup tomato paste",
        "Kosher salt",
        "1/2 cup extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Bell Peppers",
        "Vegetable",
        "Lamb Recipes",
        "Meat",
        "Main Dish Recipes",
        "Roasting"
    ],
    "title": "Roasted Lamb Chops with Harissa",
    "url": "http://www.foodnetwork.com/recipes/anne-burrell/roasted-lamb-chops-with-harissa"
}
