{
    "directions": [
        "Preheat oven to 375°F. Line a large roasting pan with 3/4 of rosemary sprigs. Place chickens on top.",
        "Whisk 1/2 cup oil, lemon juice, and honey in a small bowl to blend. Using your hands and beginning at the neck end of chicken, gently lift skin away from breast. Under skin of each chicken, rub 1/4 cup lemon mixture into meat. Drizzle remaining lemon mixture all over outside of chickens.",
        "Place 1 lemon half and 1 shallot inside each chicken cavity; stuff with remaining rosemary sprigs, dividing equally. Season chickens all over with salt and pepper. Place remaining shallots around chickens; arrange 4 lemon rounds on top of each chicken. Drizzle shallots and lemon rounds with remaining 2 tablespoons oil.",
        "Roast chickens, basting frequently with pan juices, for 45 minutes. Increase oven temperature to 425°F and continue roasting until an instant-read thermometer inserted into the thickest part of the thigh registers 165°F and skin is deep golden and crispy, about 10 minutes longer.",
        "Spoon pan juices over chickens, shallots, and lemon slices and serve in roasting pan."
    ],
    "ingredients": [
        "6 ounces rosemary sprigs (about 2 large or 4 small bunches), divided",
        "2 4-pound chickens",
        "1/2 cup plus 2 tablespoons extra-virgin olive oil",
        "1/4 cup fresh lemon juice",
        "2 tablespoons honey",
        "2 lemons, 1 halved, 1 sliced into eight 1/4\" rounds",
        "1 pound shallots, peeled",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Roast",
        "Kid-Friendly",
        "High Fiber",
        "Dinner",
        "Lemon",
        "Rosemary",
        "Honey",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roast Chicken with Rosemary, Lemon, and Honey",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-rosemary-lemon-and-honey-395509"
}
