{
    "directions": [
        "1. Preheat oven to 350°F. Mince the garlic with the salt; place in a bowl. Add the tangerine juice and peel, 1 tablespoon olive oil, dried tarragon, and pepper. Set aside.",
        "2. Blanch the carrots and potatoes for 7 to 8 minutes in boiling water. Drain and place in a bowl with the tomatoes. Reserve.",
        "3. Carefully loosen breast skin of the pheasant; place a sprig of tarragon underneath each side of the breast. Replace the skin neatly. Squeeze the halved tangerine into the cavity, then sprinkle with salt and pepper. Place the apple pieces, shallots, and sage in the cavity; tie legs together with kitchen string.",
        "4. Place reserved vegetables in a small roasting pan. Toss with garlic-tangerine mixture. Place the pheasant, breast side up, on top of the vegetables. Brush pheasant with the remaining tablespoon of oil. Lay bacon slices over the breast. Pour broth in the bottom of the pan.",
        "5. Roast in the center of the oven for 1 hour, basting 2 or 3 times. Remove bacon and continue to roast until the breast is brown and the pheasant is cooked through, about 20 to 30 minutes longer. Test for doneness with tip of a knife in the thickest part of the thigh. The juices should run clear. Let pheasant rest 10 minutes before carving.",
        "6. Carve the pheasant, remove to a serving platter and surround with the vegetables. Spoon some of the juices over top. Serve extra juices alongside. Garnish with fresh sage."
    ],
    "ingredients": [
        "1 clove of garlic",
        "Coarse salt",
        "Juice of 2 tangerines, plus 1 1/2 teaspoons finely grated peel and 1 tangerine, halved",
        "2 tablespoons olive oil",
        "1 teaspoon dried tarragon",
        "Freshly ground black pepper, to taste",
        "2 carrots, halved lengthwise and cut into 2-inch lengths",
        "1/2 pound white new potatoes, scrubbed and quartered",
        "4 large ripe plum tomatoes, halved lengthwise and seeded",
        "1 pheasant, about 2 1/2 pounds",
        "2 sprigs fresh tarragon, or flat-leaf parsley",
        "1/2 tart apple, cored and cut in pieces",
        "2 shallots, peeled and halved",
        "3 to 4 sprigs fresh sage, plus extra for garnish",
        "3 slices turkey bacon",
        "1/8 cup defatted chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Game",
        "Poultry",
        "Roast",
        "Christmas",
        "Winter",
        "Parade"
    ],
    "title": "Roasted Pheasant",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-pheasant-106695"
}
