{
    "directions": [
        "Mix yogurt, chopped cilantro, and lime juice in small bowl. Season to taste with salt and pepper. Cover and chill.",
        "Cut 2-inch-long, 1/2-inch-deep slits into outside of both sides of fish, spacing 2 inches apart. Sprinkle fish inside and out with salt and pepper. Place parsley sprigs, thyme sprigs, fennel fronds, and lemon slices in fish cavity. Sprinkle top side of fish with chopped parsley and 1 1/2 teaspoons chopped thyme. Cover and chill at least 1 hour. Do ahead Lime yogurt and fish can be made 1 day ahead. Keep refrigerated.",
        "Preheat oven to 400°F. Stir fennel seeds in small dry skillet over medium heat until lightly toasted, about 2 minutes. Mix fennel wedges, 2 tablespoons olive oil, toasted fennel seeds, and 1 1/2 teaspoons chopped thyme on rimmed baking sheet; toss. Sprinkle with salt and pepper. Roast until fennel is tender and beginning to brown, stirring often, about 30 minutes. Do ahead Can be made 2 hours ahead. Let stand at room temperature. Rewarm in 400°F oven until heated through, about 10 minutes.",
        "Place potatoes in large saucepan; fill with enough cold salted water to cover. Bring to boil. Reduce heat; simmer just until potatoes are tender, about 12 minutes. Drain, reserving 1/2 cup cooking liquid. Transfer potatoes to baking sheet and cool slightly. Using heel of hand, smash potatoes coarsely. Return potatoes to same saucepan. Add 3 tablespoons olive oil and preserved lemon. Do ahead Can be made 1 hour ahead. Let stand at room temperature.",
        "Preheat oven to 400°F. Drizzle 2 tablespoons olive oil over fish. Roast fish just until opaque in center, about 30 minutes. Let fish rest 5 minutes.",
        "Add 1/4 cup reserved potato cooking liquid to potato mixture; stir gently over medium heat until heated through, adding more cooking liquid by tablespoonfuls if mixture is dry, about 5 minutes. Season with salt and pepper.",
        "Using 2 large metal spatulas, transfer fish to platter. Arrange fennel and potato mixture around. Spoon some Charmoula , then some lime yogurt atop fish. Garnish with cilantro sprigs. Serve with remaining Charmoula and lime yogurt."
    ],
    "ingredients": [
        "1 cup plain whole-milk yogurt (preferably Greek-style)",
        "1 tablespoon chopped fresh cilantro",
        "2 teaspoons fresh lime juice",
        "1 (3- to 4-pound) whole black bass with head and tail, gutted, scaled, rinsed",
        "1/2 bunch fresh Italian parsley sprigs plus 2 tablespoons chopped fresh Italian parsley",
        "1/2 bunch fresh thyme sprigs plus 3 teaspoons chopped fresh thyme, divided",
        "1/3 cup coarsely chopped fresh fennel fronds",
        "1 lemon, thinly sliced",
        "2 teaspoons fennel seeds",
        "2 medium fresh fennel bulbs, trimmed, cut into 1/2-inch-thick wedges",
        "7 tablespoons extra-virgin olive oil, divided",
        "1 1/2 pounds small fingerling potatoes",
        "2 tablespoons chopped preserved lemon",
        "Charmoula",
        "Fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Roast",
        "Yogurt",
        "Lemon",
        "Bass",
        "Fennel",
        "Thyme",
        "Parsley"
    ],
    "title": "Roasted Whole Fish and Fennel with Crushed Potatoes, Perserved Lemon, and Charmoula",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-whole-fish-and-fennel-with-crushed-potatoes-perserved-lemon-and-charmoula-236191"
}
