{
    "directions": [
        "Trim all fat and connective tissue from lamb. Stir garlic, mustard seeds, 1 tablespoon dry mustard, Dijon mustard, salt and pepper in bowl to form paste. Spread half of paste over 1 side of lamb. Place piece of plastic wrap large enough to cover lamb in baking dish. Place lamb atop plastic wrap, paste side down. Spread remaining paste over second side of lamb. Gather plastic around lamb, covering completely. Chill overnight.",
        "Combine wine, beef stock, chicken broth and shallots in large saucepan. Boil until liquid is reduced to generous 1 cup, about 45 minutes. (Sauce can be made 1 day ahead. Cover and chill.)",
        "Preheat oven to 375°F. Remove plastic from lamb. Place lamb on rack in roasting pan. Sprinkle with additional dry mustard, salt and pepper. Roast until thermometer inserted into thickest part of lamb registers 125°F., about 1 hour 30 minutes. Place on platter. Add sauce to pan. Bring to boil, scraping up any browned bits. Garnish lamb with parsley; carve at the table. Pass sauce separately."
    ],
    "ingredients": [
        "1 6-to 6 1/4-pound leg of lamb, large bone removed, shank bone left intact",
        "5 large garlic cloves, pressed",
        "2 tablespoons mustard seeds",
        "1 tablespoon dry mustard",
        "1 tablespoon Dijon mustard",
        "1 teaspoon salt",
        "1 teaspoon ground pepper",
        "1 750-ml Cabernet Sauvignon or other dry red wine",
        "3 cups unsalted beef stock or canned unsalted broth",
        "1 14 1/2-ounce can low-salt chicken broth",
        "3 large shallots, finely chopped",
        "Additional dry mustard",
        "Fresh parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Mustard",
        "Roast",
        "Low Carb",
        "Red Wine",
        "Winter"
    ],
    "title": "Roast Leg of Lamb with Mustard and Red Wine Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-leg-of-lamb-with-mustard-and-red-wine-sauce-430"
}
