{
    "directions": [
        "Preheat the oven to 450°F.",
        "Quarter and core the apples. Dice half of them and set aside. Thinly slice the remainder lengthwise and set aside.",
        "In a medium sauté pan, heat the olive oil over medium-high heat. Add the carrot, celery, shallots, and diced apples and sauté until softened, about 5 minutes. Transfer to a bowl and add the crumbled corn bread, then add the chicken broth, melted butter, thyme, and chopped pecans and toss thoroughly with your hands to combine. Season with salt and pepper.",
        "Sprinkle the cavity of each quail with salt and pepper, then stuff a little of the corn bread mixture inside. Season the outside of the quail with salt and pepper and tie the legs together with kitchen twine.",
        "Heat the oil over high heat in a heavy ovenproof sauté pan just large enough to hold the quail without touching each other. Add the quail and sear, turning occasionally, until golden, 4 to 6 minutes. Transfer the pan to the oven and roast the quail, for 6 to 9 minutes; the breast meat should still be a rosy color.",
        "Remove the string from the quail before serving.",
        "TO DRINK: Chinon, Jouget; Pinot Noir, Bethel Heights"
    ],
    "ingredients": [
        "2 firm tart apples, such as Fuji, Braeburn, or Granny Smith",
        "1 teaspoon olive oil",
        "1 carrot, peeled and diced",
        "1 celery stalk, diced",
        "2 shallots, diced",
        "1 cup crumbledCorn Bread",
        "1/4 cup chicken broth or canned low-sodium broth",
        "4 tablespoons unsalted butter, melted",
        "2 thyme sprigs, leaves removed",
        "1/2 cup pecans, lightly toasted, half roughly chopped",
        "Kosher salt and freshly ground black pepper",
        "4 semi-boneless quail, wing tips trimmed, rinsed and patted dry",
        "1 tablespoon canola or olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Poultry",
        "Roast",
        "Sauté",
        "Christmas",
        "Thanksgiving",
        "Apple",
        "Pecan",
        "Quail",
        "Celery",
        "Carrot",
        "Fall",
        "Winter",
        "Thyme"
    ],
    "title": "Roast Quail with Apples and Pecans",
    "url": "http://www.epicurious.com/recipes/food/views/roast-quail-with-apples-and-pecans-231142"
}
