{
    "directions": [
        "Preheat oven to 425°F. Combine first 5 ingredients in medium bowl. Place chicken breasts in large baking pan. Divide vegetables among 2 large baking pans. Brush chicken on both sides with oil mixture. Sprinkle both sides with salt and pepper. Arrange skin side up in pan. Divide remaining oil mixture between pans of vegetables; mix to coat vegetables. Sprinkle with salt and pepper. Bake chicken until just cooked through, about 35 minutes, and vegetables until edges brown, about 40 minutes. Cool slightly.",
        "Combine mustard and vinegar in medium bowl. Gradually mix in oil. Add grated orange peel and chopped rosemary.",
        "Remove skin and bones from chicken. Cut chicken into 1/2-inch-wide strips. Add to dressing and mix to coat. Season to taste with salt and pepper. Mix with roasted vegetables in large bowl. Season entire salad to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Line platter with kale. Spoon salad over. Garnish with rosemary sprigs."
    ],
    "ingredients": [
        "2/3 cup olive oil",
        "2/3 cup balsamic vinegar or red wine vinegar",
        "1/4 cup chopped fresh rosemary or 2 tablespoons dried, crumbled",
        "5 garlic cloves, minced",
        "1/2 teaspoon dried crushed red pepper",
        "4 pounds chicken breast halves",
        "3 large red bell peppers, cut into 1/2-inch-wide strips",
        "2 large yellow bell peppers, cut into 1/2-inch-wide strips",
        "3 large red onions, cut into 1/2-inch-thick rounds",
        "2 teaspoons Dijon mustard",
        "2 teaspoons balsamic vinegar or red wine vinegar",
        "1/4 cup olive oil",
        "4 teaspoons grated orange peel",
        "1 teaspoon chopped fresh rosemary or 1/2 teaspoon dried, crumbled",
        "Ornamental kale leaves",
        "Fresh rosemary sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Chicken",
        "Onion",
        "Pepper",
        "Roast",
        "Summer"
    ],
    "title": "Roasted Chicken, Bell Pepper and Onion Salad",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-chicken-bell-pepper-and-onion-salad-2091"
}
