{
    "directions": [
        "Mince and mash garlic to a paste with 1/2 teaspoon salt. Transfer to a bowl and whisk in anchovy paste, vinegar, and 1/4 teaspoon pepper. Whisk in oil. Toss with remaining salad ingredients. Let stand, stirring occasionally, while fish roasts.",
        "Preheat oven to 425°F with rack in middle. Oil a 1 1/2-to 2-quart gratin or other shallow baking dish.",
        "Rub flesh sides of fish with 2 teaspoons oil (total) and season with 3/4 teaspoon salt and 1/4 teaspoon pepper (total). Divide onion slices and oregano sprigs into 2 portions and sandwich each portion between 2 fillets, skin sides out. Tie with kitchen string crosswise at 2-inch intervals and transfer to baking dish. Score skin on top in several places with a sharp knife and drizzle with remaining 4 teaspoons oil.",
        "Roast fish until just cooked through, about 15 minutes. Cut off string and cut sandwiched fillets in half crosswise. Serve topped with salad."
    ],
    "ingredients": [
        "1 garlic clove",
        "1/2 teaspoon anchovy paste",
        "2 tablespoons red-wine vinegar",
        "1/4 cup extra-virgin olive oil",
        "1/2 pound grape tomatoes (preferably mixed colors), halved if large",
        "1/2 pound cherry tomatoes (preferably mixed colors), quartered if large",
        "12 Kalamata olives, pitted and coarsely chopped",
        "4 sun-dried tomatoes packed in oil, chopped",
        "1 1/2 tablespoons chopped oregano",
        "4 (6-to 8-ounce) black sea bass fillets with skin, any pin bones removed",
        "2 tablespoons extra-virgin olive oil, divided",
        "1/2 medium red onion, thinly sliced",
        "6 (3-to 4-inch) oregano sprigs",
        "Equipment: kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Tomato",
        "Roast",
        "Quick & Easy",
        "Dinner",
        "Bass",
        "Healthy",
        "Gourmet",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Black Sea Bass with Tomato and Olive Salad",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-black-sea-bass-with-tomato-and-olive-salad-354196"
}
