{
    "directions": [
        "Preheat oven to 375°F. Place beets in small baking dish and bake until tender, approximately 1 hour 35 minutes. Cool beets completely.",
        "Meanwhile, combine potatoes, yam and carrots on heavy large baking sheet. Drizzle with 1 tablespoon olive oil and toss well. Season with salt and pepper and roast in oven until vegetables are golden brown and tender, stirring occasionally, about 1 hour. Cool potato mixture slightly.",
        "Meanwhile, rub pork with 1/2 teaspoon minced rosemary and season with salt and pepper. Place on small heavy baking sheet and roast in oven until thermometer registers 150°F. when inserted into thickest part of pork, approximately 35 minutes. Cool pork tenderloin slightly.",
        "Meanwhile, separate cloves from garlic head but do not peel. Place in heavy small pan and drizzle with 1 tablespoon olive oil. Roast in oven until garlic is very tender when pierced with small sharp knife, approximately 15 minutes. Cool and peel.",
        "Transfer potato mixture, garlic and remaining 1/2 teaspoon rosemary to large bowl. Add remaining 1 tablespoon olive oil, chicken broth and vinegar. Season to taste with salt and pepper and toss well. Peel beets and cut into 1-inch cubes. Toss just to combine. Fan arugula on 4 plates. Spoon vegetable mixture into centers of plates. Thinly slice pork and fan pork slices at bottom of vegetable mixture on plates. Garnish salads with fresh rosemary sprigs and then serve immediately."
    ],
    "ingredients": [
        "3 medium beets, trimmed, pierced with sharp knife",
        "3 medium russet potatoes (about 7 ounces each), cut into 1-inch cubes",
        "1 large (about 1 1/2 pounds) orange-fleshed sweet potato (yam), peeled, cut into 1-inch cubes",
        "6 small carrots, cut into 1-inch pieces",
        "3 tablespoons olive oil",
        "1 pound pork tenderloin",
        "1 teaspoon minced fresh rosemary",
        "1 garlic head",
        "3 tablespoons canned unsalted chicken broth",
        "2 tablespoons balsamic vinegar*",
        "Arugula",
        "4 fresh rosemary sprigs",
        "*Balsamic vinegar is available at specialty foods stores, Italian markets and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Pork",
        "Potato",
        "Roast",
        "Low Fat",
        "Rosemary",
        "Pork Tenderloin",
        "Arugula",
        "Beet"
    ],
    "title": "Roast Pork Tenderloin and Vegetable Salad",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-tenderloin-and-vegetable-salad-110"
}
