{
    "directions": [
        "Mix mayonnaise, garlic and chipotle chilies in medium bowl. Season with salt and pepper. Transfer to serving bowl.",
        "Char bell peppers over gas flame or in broiler until blackened on all sides. Place in bag; let stand 10 minutes. Peel; seed. Cut into 1-inch-wide strips. (Mayonnaise and peppers can be prepared 1 day ahead. Cover separately; refrigerate.) Arrange peppers on platter with greens and tomatoes.",
        "Preheat oven to 400°F. Lightly oil heavy large baking sheet. Place chicken on baking sheet. Brush chicken with oil. Sprinkle with salt and pepper. Bake until cooked through, about 10 minutes. Transfer chicken to cutting board. Cut crosswise into 1/2-inch-wide slices, keeping slices of each breast together. Return chicken to baking sheet. Top with cheese. Bake until cheese melts, about 2 minutes.",
        "Transfer chicken to platter and serve with bread, mayonnaise, roasted bell peppers, mixed greens and tomatoes."
    ],
    "ingredients": [
        "1 1/2 cups mayonnaise",
        "3 large garlic cloves, minced",
        "2 teaspoons minced canned chipotle chilies",
        "1 large red bell pepper",
        "1 large yellow bell pepper",
        "1 large orange bell pepper",
        "5 cups mixed baby greens",
        "5 medium tomatoes, thinly sliced",
        "12 6- to 8-ounce skinless boneless chicken breast halves",
        "2 tablespoons olive oil",
        "12 ounces Monterey Jack cheese with jalapeños, sliced",
        "4 French bread baguettes, ends trimmed, each cut crosswise into 3 equal pieces, halved lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Chicken",
        "Herb",
        "Pepper",
        "Poultry",
        "Bake",
        "Summer"
    ],
    "title": "Roasted Chicken Sandwiches with Jack Cheese and Chili Mayonnaise",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-chicken-sandwiches-with-jack-cheese-and-chili-mayonnaise-4065"
}
