{
    "directions": [
        "Wash chickens; pat dry. Starting at neck end, slide fingers under breast skin. Slide 2 rosemary sprigs and several garlic slices onto each breast half. Rub outside of each chicken with 1 teaspoon sea salt and 1/2 teaspoon pepper. Fold wing tips under; tie legs together. Wrap in plastic; chill 4 hours.",
        "Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 375°F. Spread 1 tablespoon butter all over each chicken. Place chickens, breast side down, on rack set on large rimmed baking sheet. Pour wine and water onto baking sheet.",
        "Coat another large rimmed baking sheet with nonstick spray. Toss potatoes, onions, chopped rosemary, unpeeled garlic cloves, and olive oil in large bowl; spread vegetables on prepared sheet and sprinkle with salt and pepper. Place chickens on top rack of oven and vegetables on bottom rack. Roast 30 minutes. Turn chickens over; stir vegetables. Roast chickens until thermometer inserted into thickest part of thigh registers 160°F, about 45 minutes longer. Let chickens rest 15 minutes. Continue roasting vegetables until brown and tender, about 30 minutes longer.",
        "Transfer 1 chicken to cutting board; reserve second for soup (recipe follows). Remove rack from baking sheet; scrape pan juices into small bowl. Spoon off fat. Carve chicken on cutting board; reserve carcass for soup. Arrange chicken and vegetables on platter. Serve with pan juices."
    ],
    "ingredients": [
        "2 3 1/4-to 3 1/2-pound chickens",
        "8 small fresh rosemary sprigs plus 2 tablespoons chopped",
        "3 peeled garlic cloves, thinly sliced, plus 15 unpeeled garlic cloves",
        "2 teaspoons fine sea salt plus additional (for seasoning)",
        "1 teaspoon freshly ground black pepper plus additional (for seasoning)",
        "2 tablespoons (1/4 stick) unsalted butter, room temperature",
        "1/2 cup dry white wine",
        "1/2 cup water",
        "Nonstick vegetable oil spray",
        "3 pounds Yukon Gold potatoes, peeled, cut into 3/4-inch wedges",
        "2 large onions, cut through root end into 1/2-inch wedges",
        "1/4 cup extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Onion",
        "Potato",
        "Marinate",
        "Roast",
        "Low Fat",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Fall",
        "Family Reunion",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Chicken with Potatoes and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-potatoes-and-onions-360589"
}
