{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Place potatoes into a large roasting pan and drizzle with 2 tablespoons olive oil. Sprinkle with salt and mix to coat potatoes with salt and olive oil. Turn so the cut sides are up.",
        "Roast in the preheated oven for 30 minutes.",
        "While potatoes are cooking, pour 1 teaspoon olive oil into a large skillet over medium heat and cook pancetta, stirring often, in the hot oil until pancetta releases some fat and looks like cooked ham, about 5 minutes. Stir in king trumpet, chanterelle, nameko, and clamshell mushrooms, adding a pinch of salt as they cook.",
        "Turn heat to high and cook mushrooms until most of the juices evaporate and mushrooms begin to brown, about 10 minutes.",
        "Turn oven heat up to 425 degrees F (220 degrees C).",
        "Stir potatoes in the baking dish; mix mushrooms and pancetta with potatoes. Return to oven and bake for 10 minutes; stir and continue baking until potatoes are browned, soft, and tender, about 10 more minutes. Let cool slightly, about 10 minutes.",
        "Drizzle sherry vinegar over potatoes and mushrooms, sprinkle with tarragon, garlic, and 1 tablespoon olive oil, and toss to mix. Taste and adjust seasoning. Transfer to a serving platter."
    ],
    "ingredients": [
        "2 pounds new potatoes (such as Yukon Gold), halved",
        "2 tablespoons olive oil, or more if needed",
        "salt to taste",
        "1 teaspoon olive oil",
        "2 ounces pancetta, chopped",
        "1/4 pound king trumpet mushrooms, cut into chunks",
        "1/4 pound chanterelle mushrooms, cut into chunks",
        "1/4 pound nameko mushrooms, trimmed",
        "1/4 pound clamshell (shimeji) mushrooms, trimmed",
        "3 tablespoons sherry vinegar",
        "2 tablespoons chopped fresh tarragon",
        "2 cloves garlic, minced",
        "1 tablespoon olive oil (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Wild Mushrooms and Potatoes",
    "url": "http://allrecipes.com/recipe/235278/roasted-wild-mushrooms-and-potatoes/"
}
