{
    "directions": [
        "Preheat oven to 400°F. Place beets in a small baking dish. Add just enough water to cover bottom of pan, drizzle beets with 2 Tbsp. oil, and sprinkle with 1/2 tsp. salt and 1/4 tsp. pepper. Cover pan tightly with aluminum foil (if foil is touching beets, line it with parchment paper) and bake beets until a knife can pierce them with little resistance, 55–70 minutes. Let cool slightly, then use a paper towel to slip skins off beets. Cut each beet into 1/4-inch-thick wedges and place in a medium bowl.",
        "While beets bake, heat a small skillet over medium and toast walnuts until fragrant, shaking pan often, about 5 minutes. Transfer to a cutting board and coarsely chop, then transfer to a plate and drizzle with 1 Tbsp. oil; toss to coat. Sprinkle with 1/2 tsp. salt.",
        "Whisk lemon juice, mustard, 2 tsp. vinegar, 1/4 tsp. salt, and 1/4 tsp. pepper in a small bowl until well combined. Whisk in 2 Tbsp. oil in a slow stream. While beets are still warm, toss with half of the vinaigrette to coat. Season with 1 tsp. pepper and 1/4 tsp. salt.",
        "Place chard stems and radishes into 2 separate medium bowls and cover each with 1/2 cup vinegar and a pinch of salt. Let rest 5 minutes, then transfer vegetables to paper towels to blot, discarding excess vinegar. Combine vegetables in one of the medium bowls and toss with remaining vinaigrette.",
        "Divide beets among 4 plates and top with walnuts, pickled radishes and chard stems, goat cheese, and top with a few grinds of black pepper.",
        "Beets can be roasted and refrigerated up to 3 days in advance. Vinaigrette can be made and refrigerated up to 5 days in advance."
    ],
    "ingredients": [
        "3 medium red or golden beets (about 1 pound)",
        "5 tablespoons olive oil, divided",
        "Kosher salt and freshly ground black pepper",
        "1/3 cup walnuts",
        "2 teaspoons fresh lemon juice",
        "3/4 teaspoon Dijon mustard",
        "1 cup plus 2 teaspoons white wine or Champagne vinegar, divided",
        "1/2 cup Swiss chard stems, sliced crosswise into 1/4-inch-thick pieces",
        "2 radishes, halved and thinly sliced into half moons",
        "2 ounces fresh goat cheese, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Side",
        "Vegetarian",
        "Kid-Friendly",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Goat Cheese",
        "Beet",
        "Radish",
        "Spring",
        "Summer",
        "Healthy",
        "Low Cholesterol",
        "Chard",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted Beet Salad with Flash-Pickled Radishes and Chard",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-beet-salad-with-flash-pickled-radishes-and-chard-56389491"
}
