{
    "directions": [
        "Combine 2 teaspoons caraway, garlic, salt and pepper in bowl. Place pork in glass baking dish. Rub pork with spice mixture. Cover and chill up to 24 hours.",
        "Preheat oven to 350°F. Heat 1 tablespoon oil in large skillet over medium-high heat. Add onion, carrots, bay leaves and 1 teaspoon caraway; sauté until softened, about 8 minutes. Transfer to roasting pan. Heat 1/2 tablespoon oil in same skillet over high heat. Add half of cabbage and 1/2 teaspoon caraway; sautéuntil cabbage begins to wilt, about 4 minutes. Repeat with 1/2 tablespoon oil, half of cabbage and 1/2 teaspoon caraway. Add to onion mixture; mix to blend. Season with salt and pepper.",
        "Heat 1 tablespoon oil in same skillet over high heat. Add pork; brown on all sides, about 10 minutes. Set atop vegetables in pan. Add beer and molasses to skillet; bring to boil, scraping up browned bits. Pour over vegetables. Add broth.",
        "Roast pork and vegetables 45 minutes. Turn pork over and roast until thermometer inserted into thick part registers 150°F., about 45 minutes or less Place pork on work surface. Discard bay leaves. Using slotted spoon, place vegetables on platter. Slice pork; place atop vegetables. Transfer Cooking juices to small saucepan. Boil 5 minutes. Spoon over pork."
    ],
    "ingredients": [
        "4 teaspoons caraway seeds, crushed in mortar with pestle",
        "2 large garlic cloves, minced",
        "2 teaspoons salt",
        "1 teaspoon ground pepper",
        "1 3-pound boneless double-loin center-cut pork roast*",
        "3 tablespoons olive oil",
        "1 large onion, sliced",
        "4 carrots, peeled, sliced on diagonal",
        "2 bay leaves",
        "1 2 1/2-pound head green cabbage, quartered, cored, sliced",
        "1 12-ounce can beer",
        "2 tablespoons light unsulfured molasses",
        "1/2 cup canned beef broth",
        "*Boneless double-loin center-cut pork roast is made by tying two boneless pork loins together. If you can't find one, ask your butcher to prepare it for you."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Braise",
        "Roast",
        "Pork Tenderloin",
        "Carrot",
        "Spring",
        "Winter",
        "Oktoberfest",
        "Cabbage"
    ],
    "title": "Roast Pork with Cabbage and Caraway",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-with-cabbage-and-caraway-487"
}
