{
    "directions": [
        "Boil all ingredients in heavy large saucepan until reduced to 2 cups, about 40 minutes. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 450°F. Place turkey on rack in roasting pan. Season with salt and pepper. Spoon 7 cups stuffing into main turkey cavity and 2 cups into neck cavity. Tuck wings under turkey body. Tie legs together. Add 1 egg and 1/4 cup pear nectar to remaining stuffing in bowl and toss well. Transfer to buttered 13x9x2-inch baking dish; cover with aluminum foil and refrigerate.",
        "Reserve 1 cup glaze for gravy. Brush some of remaining glaze over turkey. Pour 1 cup chicken stock into bottom of pan. Cover turkey completely with foil. Place turkey in oven and roast 45 minutes. Reduce oven temperature to 350°F. and continue roasting 2 hours, basting every 30 minutes with glaze and keeping turkey covered. Uncover, baste turkey and roast until meat thermometer inserted into thickest part of thigh registers 175°F. and turkey is golden, about 15 minutes longer. (Place stuffing in covered baking dish in oven for last 50 minutes.) Transfer turkey to platter. Tent with aluminum foil.",
        "Pour pan juices into heavy large saucepan. Degrease pan juices. Place roasting pan over medium-high heat. Add degreased pan juices and remaining 3 cups stock and bring to boil, scraping up any browned bits. Strain mixture back into saucepan, pressing on solids. Add reserved 1 cup glaze and simmer 5 minutes. Mix flour and butter to paste in small bowl; whisk in 1/2 cup stock mixture. Return mixture to remaining stock mixture in saucepan and boil until thick enough to coat spoon, whisking constantly, about 2 minutes.",
        "Garnish turkey with fresh herbs if desired. Serve turkey and stuffing, passing gravy separately."
    ],
    "ingredients": [
        "4 cups pear nectar",
        "2 cups tawny Port",
        "1/2 cup (1 stick) unsalted butter",
        "1/4 cup honey",
        "1 1/2 teaspoons minced fresh sage or 1/2 teaspoon dried rubbed sage",
        "1 20-pound turkey, patted dry",
        "Sausage, Leek and Currant Stuffing",
        "1 large egg, beaten to blend",
        "1/4 cup pear nectar",
        "4 cups chicken stock or canned low-salt broth",
        "1/4 cup all-purpose flour",
        "3 tablespoons unsalted butter, room temperature",
        "Assorted fresh herbs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Pear",
        "Port",
        "Winter"
    ],
    "title": "Roast Turkey with Pear and Port Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-pear-and-port-gravy-2810"
}
