{
    "directions": [
        "Finely chop enough fresh morels or reconstituted morels to measure 1/2 cup (packed); reserve remaining morels. Melt 1 tablespoon butter in medium nonstick skillet over medium heat. Add 1/4 cup shallots and garlic; sauté 1 minute. Add chopped morels and thyme; sauté 2 minutes. If using dried morels, add reserved soaking liquid to skillet, leaving any sediment behind. Increase heat; boil until almost all liquid evaporates, about 8 minutes. Transfer morel mixture to small bowl; cool. Mix remaining 7 tablespoons butter into morel mixture. Season lightly with salt and pepper. (Morel butter can be prepared 1 day ahead. Cover and chill.)",
        "Using scissors, cut along back shell of each prawn all the way up to tail, exposing vein; pull out vein. Turn prawns over. Using small sharp knife and starting just below tail end, butterfly each prawn by cutting 1/4-inch-deep slit to opposite end. Place prawns, shell side down, on rimmed baking sheet. (Can be made 6 hours ahead. Cover; chill.)",
        "Preheat oven to 500°F. Melt 2 tablespoons morel butter in heavy large skillet over medium-high heat. Add remaining 1/2 cup shallots; sauté until golden, about 3 minutes. Add remaining whole fresh morels or reconstituted morels and sauté until tender, about 4 minutes.",
        "Meanwhile, spread 1 teaspoon morel butter over each giant prawn (or 1/4 teaspoon over each of 24 large prawns). Roast just until prawns are opaque in center, about 7 minutes for giant prawns or 4 minutes for large prawns. Top prawns with remaining morel butter, dividing equally. Return to oven just long enough to melt butter slightly, about 10 seconds.",
        "Transfer prawns to plates. Serve sautéed morels alongside.",
        "*If using dried morels: Bring 3 cups water to boil in medium saucepan. Add dried morels. Remove from heat. Cover; let steep 1 hour. Using slotted spoon, transfer morels to bowl. Reserve soaking liquid."
    ],
    "ingredients": [
        "8 ounces fresh morel mushrooms or 2 ounces dried morel mushrooms*",
        "8 tablespoons (1 stick) unsalted butter, room temperature, divided",
        "3/4 cup chopped shallots, divided",
        "1 garlic clove, minced",
        "1 1/2 teaspoons chopped fresh thyme",
        "6 4 1/2- to 5-ounce uncooked giant prawns or 24 large prawns"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Shellfish",
        "Roast",
        "Mother's Day",
        "Dinner",
        "Shrimp",
        "Shallot",
        "Butter",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roasted Prawns with Morels and Morel Butter",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-prawns-with-morels-and-morel-butter-109379"
}
