{
    "directions": [
        "Position rack in center of oven; preheat to 400°F. Mince 1 shallot; mix with butter, rosemary and peel in small bowl. Season with salt and pepper. Set aside.",
        "Pat chicken dry. Using fingers, loosen skin from chicken breasts, legs and thighs. Sprinkle chicken cavity with salt and pepper. Spread half of rosemary-orange butter under chicken skin. Tie chicken legs together to hold shape. Spread remaining butter over chicken. Sprinkle chicken with salt and pepper.",
        "Place rack in large roasting pan. Add reserved chicken neck and heart to pan, then onion, carrots and celery. Chop 2 shallots; add to pan. Place chicken, breast side up, on rack in pan. Roast chicken until meat thermometer inserted into innermost part of thigh registers 180°F., stirring vegetables in pan occasionally, about 1 hour 40 minutes. Transfer chicken to platter. Tent with foil while making sauce (do not clean pan).",
        "Place same roasting pan over medium-high heat. Add wine to pan; simmer until most of wine evaporates, scraping up any browned bits, about 5 minutes. Add broth. Simmer until sauce is reduced to 1 1/2 cups, stirring often, about 6 minutes. Strain into 2-cup glass measuring cup; discard solids. Spoon fat from top of sauce. Season to taste with salt and pepper. Serve chicken with pan sauce."
    ],
    "ingredients": [
        "3 shallots",
        "6 tablespoons (3/4 stick) butter, room temperature",
        "4 teaspoons minced fresh rosemary",
        "1 tablespoon grated orange peel",
        "1 7-pound whole roasting chicken, neck and heart reserved",
        "1 medium onion, chopped",
        "2 medium carrots, peeled, chopped",
        "1 celery stalk, chopped",
        "3/4 cup dry white wine",
        "1 1/2 cups canned low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Citrus",
        "Herb",
        "Poultry",
        "Roast",
        "Spring"
    ],
    "title": "Roast Chicken with Rosemary-Orange Butter",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-rosemary-orange-butter-100978"
}
