{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Use a fork to prick the goose all over. Do not go into the meat, just through the skin. Season inside and out with sea salt, stuff with the orange, lemon, and apple; tie the wings behind the bird with cooking twine. Place breast-side-down into a roasting pan, and fill with 1/2-inch of water.",
        "Bake in the preheated oven for 45 minutes, then remove from the oven. Turn the goose breast-side-up, and prick the skin with a fork again. Add water to the pan to bring the level back up to 1/2-inch. Return the goose to the oven, and cook until an instant-read thermometer inserted into the thickest part of the thigh, near the bone reads 170 degrees F (75 degrees C), about 2 hours. Remove from the oven, and cover loosely with aluminum foil to rest.",
        "Spoon 2 tablespoons of goose fat from the roasting pan into a small saucepan, and heat over medium heat. Stir in the cherries and cook until the cherries have softened and begun to release their juice, about 10 minutes. Stir in the port wine, and bring to a boil over high heat. Boil for 2 minutes, then stir in the ginger, green onion, sugar, soy sauce, and chicken stock. Return to a boil, then reduce heat to medium, and simmer until the sauce has reduced by half, or to your desired consistency, about 10 minutes. Serve the sauce alongside the goose."
    ],
    "ingredients": [
        "1 (10 pound) whole goose",
        "sea salt to taste",
        "1/2 orange",
        "1/2 lemon",
        "1/2 Granny Smith apple",
        "2 tablespoons goose fat",
        "1 cup cherries, pitted and halved",
        "1 cup port wine",
        "1 1/2 teaspoons grated fresh ginger root",
        "1/4 cup thinly sliced green onion",
        "1 tablespoon white sugar",
        "1 1/2 teaspoons soy sauce",
        "1/2 cup chicken stock"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Goose with Port Wine Cherry Sauce",
    "url": "http://allrecipes.com/recipe/213374/roasted-goose-with-port-wine-cherry-s/"
}
