{
    "directions": [
        "Mix first 5 ingredients and duck legs and thighs in bowl. Cover leg-thigh mixture and breasts and carcasses separately; chill overnight.",
        "Preheat oven to 200°F. Heat duck fat in medium ovenproof pot over medium heat to 200°F. Add duck leg-thigh mixture; transfer to oven and cook until meat falls from bones, about 2 hours. Allow duck confit to cool 2 hours.",
        "Preheat oven to 400°F. Place duck carcasses in large ovenproof pot; roast uncovered until lightly browned, about 30 minutes. Transfer pot to stove top. Add leek and next 3 ingredients and sauté over medium-high heat until vegetables are lightly browned, about 3 minutes. Add Port; boil until liquid is reduced by half, about 2 minutes. Add 6 cups water; boil gently for 30 minutes. Add peppercorns; boil broth 10 minutes. Strain broth; skim fat from surface. Boil broth in medium saucepan until reduced to 1/2 cup, about 30 minutes. Whisk butter into sauce. (Can be made 1 day ahead. Chill confit and sauce separately.)",
        "Rewarm duck confit to melt fat; remove duck from fat. Cut meat from bones and add to sauce.",
        "Soak farro in cold water 20 minutes. Drain; rinse. Bring 8 cups water to boil in medium saucepan. Add 1/2 cup oil and farro. Simmer 20 minutes. Drain in strainer and rinse. Melt 1 tablespoon butter with 1 tablespoon oil in medium saucepan over medium heat. Add shallots; sauté 1 minute. Add farro and wine. Simmer until almost all liquid evaporates, stirring frequently, about 5 minutes. Add chicken broth 1 cup at a time and simmer until liquid is absorbed and farro is just tender, stirring frequently, about 14 minutes total. Stir in cheese and 1 tablespoon butter. Season with salt and pepper.",
        "Preheat oven to 450°F. Sprinkle duck breasts with salt and pepper. Heat oil in large ovenproof skillet over medium-high heat. Add duck breasts, skin side down; cook until skin is crisp, about 5 minutes. Turn duck over. Cook 1 minute; remove from heat.",
        "Bring honey to boil in medium saucepan over medium-high heat. Add nuts and star anise; boil until honey is reduced to thick syrup, stirring constantly, about 2 minutes. Spoon honey-nut mixture onto duck breasts. Cook in oven about 4 minutes for medium-rare.",
        "Rewarm duck confit sauce over low heat. Divide risotto among 4 plates. Using slotted spoon, remove duck meat from sauce and spoon over risotto. Slice breasts diagonally; arrange around risotto. Drizzle duck with confit sauce.",
        "*Farro is sold at some Italian markets and natural foods stores.",
        "**A brown star-shaped seed pod available at Asian markets and specialty foods stores and in the spice section of some supermarkets."
    ],
    "ingredients": [
        "1 onion, chopped",
        "1 carrot, chopped",
        "4 garlic cloves, chopped",
        "2 fresh thyme sprigs",
        "1 teaspoon sea salt",
        "2 ducks, legs, thighs, and breasts cut from carcasses; carcasses quartered",
        "4 cups rendered duck fat",
        "3 tablespoons chopped leek (white and pale green parts)",
        "2 tablespoons chopped celery",
        "2 tablespoons chopped onion",
        "2 tablespoons chopped carrot",
        "1/2 cup ruby Port",
        "6 cups water",
        "10 whole black peppercorns",
        "1 tablespoon butter",
        "1 cup farro*",
        "8 cups water",
        "1/2 cup plus 1 tablespoon olive oil",
        "2 tablespoons (1/4 stick) butter",
        "1/4 cup chopped shallots",
        "2/3 cup dry red wine",
        "2 cups low-salt chicken broth",
        "2 tablespoons freshly grated Parmesan cheese",
        "1 teaspoon vegetable oil",
        "1/2 cup honey",
        "3/4 cup assorted chopped nuts (such as pistachios, hazelnuts, and pecans)",
        "1 whole star anise**"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Roast",
        "Dinner",
        "Pistachio",
        "Port",
        "Red Wine",
        "Fall",
        "Honey",
        "Anise",
        "Soy Free"
    ],
    "title": "Roasted Duck Breasts with Farro Risotto and Duck Confit",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-duck-breasts-with-farro-risotto-and-duck-confit-108580"
}
