{
    "directions": [
        "In a saucepan combine the cranberries, the brown sugar, the apple juice, the cranberry juice, the Madeira, the nutmeg, the ginger, the mustard, 1/2 cup of the broth, 2 tablespoons of the butter, the zest, and salt and pepper to taste, bring the liquid to a boil, and simmer the mixture, stirring occasionally, for 25 minutes, or until it is thickened and the berries have burst. Strain the glaze through a fine sieve into a bowl, pressing hard on the solids and discarding them. The glaze may be made 1 day in advance, kept covered, and chilled, and reheated.",
        "Transfer 1/2 cup of the glaze to a small bowl and reserve it. In a large ovenproof skillet heat remaining 2 tablespoons butter over moderately high heat until the foam subsides, in it brown the quail, turning them, for 4 minutes, and arrange the quail breast side up. Baste the quail generously with some of the remaining glaze and roast them in the top third of a preheated 450°F. oven for 10 minutes. Reduce the heat 400°F. and roast the quail, basting them with some of the remaining glaze every 10 minutes, for 40 minutes more, or until the leg meat is no longer pink. Transfer the quail to a plate, discard the string, and pour off the fat in the skillet.",
        "Deglaze the skillet with the remaining 1/2 cup broth over moderately high heat, scraping up the brown bits, stir in the reserved 1/2 cup glaze, and boil the mixture, whisking, until it is thickened. Strain the sauce through a fine sieve into a heated sauceboat and season it with salt and pepper. Arrange 2 of the toasts on each of 6 dinner plates, top each toast with 1 of the quail, and serve the sauce with the quail."
    ],
    "ingredients": [
        "a 12-ounce bag fresh or thawed frozen cranberries (about 3 1/4 cups)",
        "2/3 cup firmly packed dark brown sugar",
        "1/2 cup apple juice",
        "1/2 cup cranberry juice",
        "1/3 cup Sercial Madeira",
        "1/4 teaspoon freshly grated nutmeg",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon dry mustard",
        "1 cup chicken broth",
        "1/2 stick (1/4 cup) unsalted butter",
        "the zest of 1 orange, removed with a vegetable peeler",
        "twelve 5-to-6 ounce quail, rinsed, patted dry, and the legs tied together with kitchen string",
        "12 slices of homemade-type white bread, each slice toasted and cut into a decorative shape"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Roast",
        "Thanksgiving",
        "Cranberry",
        "Quail",
        "Gourmet"
    ],
    "title": "Roast Quail with Cranberry Madeira Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-quail-with-cranberry-madeira-sauce-13375"
}
