{
    "directions": [
        "Preheat oven to 400°F. Rinse beets and remove any blemishes. Set aside 1 small beet. Place a large piece of foil on a rimmed baking sheet. Place remaining beets, oil, garlic, 3 thyme sprigs, and 1/4 tsp. salt in the center of foil, then wrap into a package to close. Bake beets until knife-tender, 60–70 minutes. Let cool.",
        "Meanwhile, toast hazelnuts on another rimmed baking sheet, tossing occasionally, until golden brown, 6–8 minutes.",
        "Cook vinegar, sugar, peppercorns, 1 thyme sprig, and 1/4 cup water in a small saucepan over medium heat, stirring, until sugar is dissolved. Transfer to a shallow bowl. Peel and thinly slice reserved beet into matchsticks and add to pickling liquid; liquid should cover all matchsticks. Let pickle while beets roast.",
        "When beets are cooled, carefully peel off skins. Pulse hazelnuts and 1/2 tsp. thyme leaves in a food processor until finely chopped. Add roasted beets, goat cheese, 1/4 tsp. ground black pepper, and remaining 1/4 tsp. salt and pulse until smooth. Transfer to a serving bowl.",
        "Pulse 3 Tbsp. pickled beets in food processor until coarsely chopped (or chop by hand). Stir into beet mixture. Top with remaining pickled beets and black pepper. Serve with crudité and crackers alongside.",
        "Beets can be roasted and pickles can be made 2 days ahead; cover in separate containers and chill. Dip can be made one day ahead; chill in an airtight container."
    ],
    "ingredients": [
        "1 1/2 pounds golden or red beets",
        "1 tablespoon olive oil",
        "1 large garlic clove, smashed",
        "5 sprigs thyme, divided",
        "1/2 teaspoon kosher salt, divided",
        "3/4 cup blanched hazelnuts (about 4 ounces)",
        "1/4 cup apple cider vinegar",
        "1 tablespoon sugar",
        "1/4 teaspoon whole black peppercorns",
        "1 ounce goat cheese",
        "1/4 teaspoon freshly ground black pepper, plus more",
        "Vegetable crudité and crackers (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Dip",
        "Beet",
        "Endive",
        "Christmas",
        "Hanukkah",
        "Winter",
        "Cocktail Party",
        "Hazelnut",
        "Thyme",
        "Goat Cheese",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Christmas Eve"
    ],
    "title": "Roasted Beet Dip With Hazelnuts and Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-beet-dip-with-hazelnuts-and-goat-cheese"
}
