{
    "directions": [
        "Preheat the oven to 450 degrees F. Rinse the chicken and pat it dry.",
        "In a small bowl, make a compound butter by combining the softened butter, minced thyme, garlic cloves, lemon zest, salt, and pepper.",
        "Season the cavity of the chicken generously with salt, and pepper. Stuff the cavity with the lemon quarters, a handful of fresh thyme leaves, and the quartered onion. Place the carrot, celery and onion in the bottom of a roasting pan and place the chicken on top of the vegetables. Cross the legs and tie with kitchen twine.",
        "Gently lift the skin away from the chicken and spread 2 tablespoons of the softened butter mixture underneath the skin, distributing it evenly. Spread the remaining butter over the entire surface of the chicken and season generously with salt, and pepper.",
        "Place the chicken in the oven and roast for 20 minutes. Reduce the oven temperature to 375 degrees F and roast the chicken until a meat thermometer inserted into the thickest part of the inner thigh, not touching the bone registers 160 to 165 degrees F, about 45 minutes. Transfer the chicken and vegetables to a cutting board to rest for about 15 minutes. Tent the chicken with aluminum foil to keep warm.",
        "Pour the pan juices into a large glass measuring cup. Spoon the fat off the top. Add the chicken broth to the roasting pan and place over high heat. Bring to boil, scraping up any browned bits. Return the pan juices to the pan. Whisk the flour into the broth mixture and bring to a boil until slightly thickened, about 2 minutes. Season the sauce to taste with salt, and pepper. Serve alongside the roast chicken.",
        "Roasted Chicken Variations:",
        "Honey-Glazed Chicken: Season the butter with 1/2 teaspoon cinnamon, 1/4 teaspoon nutmeg, and 2 tablespoons honey.",
        "Soy-Ginger Chicken: Season the butter with 1 tablespoon minced garlic, 2 teaspoons fresh ginger, and 2 teaspoons soy sauce."
    ],
    "ingredients": [
        "1 (6-pound) roasting chicken",
        "4 tablespoons unsalted butter, softened",
        "3 tablespoons minced fresh thyme, plus 1 handful for stuffing",
        "4 cloves garlic, chopped",
        "2 teaspoons fresh lemon zest",
        "Salt and freshly ground black pepper",
        "1 lemon, quartered",
        "1 onion, coarsely chopped",
        "3 celery stalks",
        "3 carrots, unpeeled cut into thirds",
        "1 onion cut into quarters",
        "1 cup low-sodium chicken broth",
        "2 teaspoons all-purpose flour",
        "Roasted Chicken Variations, recipes follow"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes",
        "Roasting"
    ],
    "title": "Roasted Chicken with Lemon, Garlic, and Thyme",
    "url": "http://www.foodnetwork.com/recipes/roasted-chicken-with-lemon-garlic-and-thyme"
}
