{
    "directions": [
        "Boil all ingredients in large saucepan until reduced to 2 1/3 cups, about 20 minutes. Cool. Puree in blender. DO AHEAD: Can be made 5 days ahead. Cover and refrigerate.",
        "Pulse grapes, olives, chopped rosemary, vinegar, and garlic clove in mini processor until olives are chopped. Transfer to bowl. Mix in ground lamb,1/2 teaspoon salt, and 1/4 teaspoon pepper.",
        "Sprinkle racks of lamb with salt and pepper. Heat 1 tablespoon oil in large skillet over medium-high heat. Add 1 rack, meat side down, and cook until browned, about 5 minutes. Set on rimmed baking sheet, meat side up. Repeat with 1 tablespoon oil and remaining rack; reserve skillet. Cool lamb completely.",
        "Add 1/2 cup broth to skillet. Boil until reduced to glaze, scraping up browned bits. Add to sauce. Cover and chill.",
        "Spread each rack with 1 tablespoon mustard. Press half of lamb sausage over top of each rack (layer will be thin). DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Preheat oven to 425°F. Combine breadcrumbs, 2 tablespoons oil, and 2 tablespoons mustard in medium skillet. Toss over medium heat until beginning to color, about 5 minutes. Press crumbs over sausage on each rack. Cut through crumb crust (not lamb) between bones to score. Roast until thermometer inserted into center registers 135°F, about 30 minutes for medium-rare.",
        "Transfer lamb to platter; let rest 10 minutes. Pour juices from baking sheet into sauce. Simmer in small saucepan until reduced to about 1 1/3 cups, about 9 minutes (sauce will thicken slightly). Season with salt and pepper.",
        "Cut lamb between bones into chops. Set two on each plate. Spoon sauce over.",
        "Martín Códax 2005 \"Ergo\"Tempranillo (Spain, $14), with lively fruit,full body, and supple texture."
    ],
    "ingredients": [
        "2 cups halved seedless red grapes",
        "2 cups tawny Port",
        "2 cups low-salt chicken broth",
        "2 teaspoons chopped fresh rosemary",
        "1/2 cup halved seedless red grapes",
        "1/4 cup halved pitted Kalamata olives",
        "1 tablespoon chopped fresh rosemary",
        "1 teaspoon balsamic vinegar",
        "1 small garlic clove",
        "8 ounces ground lamb",
        "1/2 teaspoon coarse kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "2 2- to 2 1/2-pound well-trimmed racks of lamb (each with 8 bones)",
        "4 tablespoons olive oil, divided",
        "1/2 cup low-salt chicken broth",
        "4 tablespoons Dijon mustard, divided",
        "2 1/2 cups fresh breadcrumbs made from crustless French bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Roast",
        "Christmas",
        "Hanukkah",
        "Lamb Chop",
        "Sausage",
        "Port",
        "Kosher",
        "Grape"
    ],
    "title": "Roast Lamb with Lamb Sausage Crust and Fresh Grape Pan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-lamb-with-lamb-sausage-crust-and-fresh-grape-pan-sauce-240704"
}
