{
    "directions": [
        "Butterfly the chicken.",
        "Tuck wing tips behind shoulder. Transfer to large rimmed baking sheet. Using fingertips, separate skin from chicken over breasts and thighs. Insert 1 thyme sprig between skin and flesh over each breast and each thigh. Repeat with second chicken. Mix 2 tablespoons coarse kosher salt and 2 teaspoons paprika in small bowl. Sprinkle all over chickens.",
        "Transfer uncovered chickens, skin side up, to refrigerator; chill at least 8 hours or overnight.",
        "Preheat oven to 400°F. Place potatoes in 11x7x2-inch baking dish. Drizzle with 2 tablespoons olive oil and sprinkle with 1/2 teaspoon paprika. Sprinkle with salt and pepper; toss. Drizzle chicken with 2 teaspoons oil. Place chicken and potatoes in oven; roast until thermometer inserted into thickest part of thigh registers 175°F, about 1 hour. Let chickens rest 10 minutes.",
        "Meanwhile, toss potatoes with 1 tablespoon chopped thyme. Return to oven and roast until tender and skins wrinkle slightly, about 5 minutes. Coarsely smash. Cut chickens into breast, wing, thigh, and leg pieces. Transfer to platter. Drizzle some drippings over; serve."
    ],
    "ingredients": [
        "2 (5-pound) roasting chickens",
        "8 large sprigs fresh thyme plus 1 tablespoon chopped fresh thyme",
        "2 tablespoons coarse kosher salt",
        "2 1/2 teaspoons hot smoked Spanish paprika* divided",
        "1 1/2 pounds baby potatoes (1 to 1 1/2 inches in diameter)",
        "2 tablespoons plus 2 teaspoons olive oil",
        "*Sometimes called hot Pimentón de La Vera; available at some supermarkets and at tienda.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Potato",
        "Roast",
        "Dinner",
        "Winter",
        "Thyme",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roast Chicken with Spanish Paprika and Herb-Roasted Smashed Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-spanish-paprika-and-herb-roasted-smashed-potatoes-237033"
}
