{
    "directions": [
        "Preheat oven to 350°F.",
        "Whisk 1/4 cup oil, 3 tablespoons fish sauce, 1 tablespoon sugar, and next 6 ingredients in large bowl. Add chicken; turn to coat. Marinate at room temperature 1 hour.",
        "Heat remaining 1 tablespoon oil in 12-inch ovenproof skillet over medium-high heat. Add chicken, skin side down, to skillet (reserve marinade in bowl). Cook 4 minutes. Turn chicken, add reserved marinade to skillet, and transfer to oven. Roast until thermometer inserted into thickest part of thigh registers 175°F, about 25 minutes. Transfer chicken to plate.",
        "Add 1/2 cup water, lime juice, remaining 2 tablespoons fish sauce, and remaining 1 tablespoon sugar to skillet. Bring to boil. Remove from heat, spoon fat from surface, and strain pan juices into small pitcher. Serve chicken with pan juices.",
        "*Available in the Asian foods section of many supermarkets and at Asian markets.",
        "**Available in the produce section of many supermarkets and at Asian markets."
    ],
    "ingredients": [
        "1/4 cup plus 1 tablespoon canola oil or vegetable oil",
        "5 tablespoons fish sauce (such as nuoc nam or nam pla),* divided",
        "2 tablespoons sugar, divided",
        "2 tablespoons chopped shallot",
        "2 tablespoons oyster sauce*",
        "2 fresh lemongrass stalks,** tough outer leaves removed, 4 inches of thick end finely chopped",
        "1 teaspoon chili-garlic sauce*",
        "1 garlic clove, chopped",
        "1/2 teaspoon ground black pepper",
        "1 3-pound chicken, quartered",
        "1/2 cup water",
        "1 tablespoon fresh lime juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Marinate",
        "Roast",
        "Dinner",
        "Lemongrass",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roasted Lemongrass Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-lemongrass-chicken-232701"
}
