{
    "directions": [
        "In a skillet heat oil over moderately high heat until hot but not smoking and sauté shallots, stirring occasionally, until soft and caramelized, 10 to 15 minutes.",
        "While shallots are sautéing, peel potatoes and in a food processor fitted with fine julienne or shredding blade shred potatoes. (Alternately, coarsely shred potatoes on small teardrop-shaped holes of a 4-sided grater.)",
        "Into shallots stir thyme, pepper, and salt to taste.",
        "Preheat oven 325°F.",
        "In an ovenproof 10-inch non-stick skillet (or a 10-inch non-stick skillet with handle covered with a double thickness of foil) heat butter over moderately high heat until hot but not smoking and spread half of potatoes evenly over bottom of skillet, pressing with back of a spatula. Spread shallots over potatoes with a slotted spoon and top with remaining potatoes in an even layer, gently pressing with back of spatula. Cook potato cake over high heat until underside begins to brown, about 2 minutes. Reduce heat to low and cook potato cake until underside is golden, 5 to 7 minutes.",
        "Roast potato cake in oven until underside is a rich golden brown, about 15 minutes (top will still be white.) Invert a plate or baking sheet without sides over skillet and carefully invert potato cake onto it. Carefully slide potato cake back into skillet and roast 20 minutes more.",
        "Sprinkle potato cake with more pepper and salt to taste and cut into wedges."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "1 cup thinly sliced shallots (about 6 large)",
        "2 pounds russet (baking) potatoes (about 3 large)",
        "3 tablespoons fresh thyme leaves, chopped",
        "freshly ground black pepper to taste",
        "3 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Appetizer",
        "Side",
        "Roast",
        "Fall",
        "Thyme",
        "Shallot",
        "Gourmet"
    ],
    "title": "Roasted Shallot-Potato Cake `21' Club",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-shallot-potato-cake-21-club-10792"
}
