{
    "directions": [
        "Let the meat stand at room temperature for 1 hour. In a small bowl combine the black pepper, the green pepper, the white pepper, the allspice, the thyme, and the salt and rub the meat with the mixture. Roast the meat rib side down in a roasting pan in a preheated 500°F. oven for 30 minutes, reduce the heat to 350°F., and roast the meat for 1 hour and 45 minutes to 2 hours more, or until a meat thermometer inserted in the fleshy part of the meat registers 130°F. for medium-rare. Twenty minutes before the roast is done add to the pan the carrots, the garlic, and the shallots, all patted dry. (Remove the vegetables with a slotted spoon if they brown too quickly.) Transfer the roast to a heated platter, drain the vegetables on paper towels, and keep them warm, covered loosely. Let the roast rest for at least 20 minutes and up to 30 minutes before carving it.",
        "Skim the fat from the pan juices, add the red wine, and deglaze the pan over moderately high heat, scraping up the brown bits. Boil the liquid until it is reduced by half and transfer it to a saucepan. Add the broth and 1/4 cup of the Madeira and boil the mixture for 5 minutes. In a small bowl stir together the remaining 2 tablespoons Madeira, the arrowroot, and",
        "the mustard and add the mixture to the pan in a stream, whisking. Bring the sauce to a boil, whisking, and boil it for 1 minute. Season the sauce with salt and pepper and transfer it to a heated sauceboat. Arrange the roasted vegetables around the roast with the fresh thyme and serve the roast with sauce."
    ],
    "ingredients": [
        "a 4-rib standing rib roast (trimmed weight about 10 to 10 1/2 pounds)",
        "1 tablespoon black peppercorns, ground coarse",
        "2 teaspoons dried green peppercorns (available at specialty foods shops), ground coarse",
        "1 teaspoon white peppercorns, ground coarse",
        "4 whole allspice, ground coarse",
        "1/2 teaspoon dried thyme",
        "1 teaspoon coarse salt",
        "3/4 pound very small carrots, peeled, trimmed, blanched in boiling salted water for 4 minutes, and refreshed under cold water",
        "1 head of garlic, separated into cloves, blanched in boiling water for 5 minutes, refreshed under cold water, and peeled",
        "1/2 pound large shallots, blanched in boiling water for 3 minutes, refreshed under cold water, and peeled",
        "1/2 cup dry red wine",
        "2 cups canned beef broth",
        "6 tablespoons Madeira",
        "1 tablespoon arrowroot",
        "2 tablespoons Dijon-style mustard",
        "fresh thyme sprigs for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Roast",
        "Red Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Roast Prime Ribs of Beef with Cracked Pepper Crust",
    "url": "http://www.epicurious.com/recipes/food/views/roast-prime-ribs-of-beef-with-cracked-pepper-crust-10673"
}
