{
    "directions": [
        "Rub softened butter over bottom of roasting pan and sprinkle with 12 bay leaves, 1 tablespoon coriander seeds, and 1 tablespoon sea salt.",
        "Rinse fish and pat dry, then arrange diagonally in roasting pan. If fish is more than 18 inches long, tail will curl up side of pan (wrap tail in foil to prevent burning).",
        "Stir together almonds, 1/2 teaspoon coriander seeds, and 1 teaspoon sea salt. Stuff fish with lemon slices, almond mixture, and 2 tablespoons butter, cut into small pieces. (Some nuts may spill out.) Sprinkle fish with remaining 8 bay leaves, 2 1/2 teaspoons coriander seeds, and 2 teaspoons sea salt. Dot fish with remaining 2 tablespoons butter, cut into small pieces.",
        "Put oven rack in middle position and place fish in cold oven. Set oven temperature to 500°F. Roast until fish is just cooked through, 40 to 45 minutes. (Cut into fish along backbone with a small knife to check doneness; fish should have turned from translucent to opaque.)",
        "Transfer fish to a large platter using 2 wide metal spatulas. Reserve any pan juices.",
        "Boil all sauce ingredients in a small nonreactive saucepan 1 minute. Stir in reserved pan juices and pour sauce over fish. Discard bay leaves."
    ],
    "ingredients": [
        "3/4 stick (6 tablespoons) unsalted butter, 2 tablespoons of it softened",
        "20 Turkish bay leaves",
        "2 tablespoons whole coriander seeds",
        "2 tablespoons coarse sea salt",
        "1 (4-lb) whole bluefish, cleaned, with head and tail intact",
        "1/2 lb whole almonds (1 1/2 cups), toasted and coarsely chopped",
        "1 lemon, thinly sliced",
        "1 cup white-wine vinegar",
        "2 Turkish bay leaves",
        "6 whole black peppercorns, slightly crushed",
        "1/4 teaspoon coarse sea salt",
        "Special equipment: a large (17- by 14- by 3-inch) nonreactive roasting pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Bake",
        "Low Carb",
        "Almond",
        "Coriander",
        "Gourmet"
    ],
    "title": "Roasted Fish with Coriander in Vinegar Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-fish-with-coriander-in-vinegar-sauce-235466"
}
