{
    "directions": [
        "Remove the roast from the refrigerator and let stand at room temperature for 2 hours.",
        "Preheat an oven to 450°F.",
        "Brush the roast lightly with olive oil and season generously all over with salt and pepper. Place the roast, fat side up, on a rack in a roasting pan. Lay the slices of fatback over the top of the roast. Transfer to the oven and roast for 20 minutes. Reduce the oven temperature to 300°F and continue to roast until an instant-read thermometer inserted into the center of the meat registers 130° to 135°F for medium-rare, 1 3/4 to 2 hours more. Remove the roast from the oven and let stand, loosely covered with aluminum foil, for at least 25 minutes.",
        "Meanwhile, put the onion in a bowl, add ice water to cover, and let stand for 30 to 45 minutes to crisp the onion and mellow the flavor.",
        "To make the vinaigrette, in a large bowl, whisk together the vinegar, mustard, peppercorns and salt. Whisking constantly, drizzle in the olive oil and continue to whisk until the vinaigrette is emulsified.",
        "Drain the onion well and pat dry. Add the onion, tangerines and arugula to the vinaigrette and toss gently.",
        "Discard the fatback and the string from the roast, if any. Cut the roast into large, even slices about 1/4 inch thick. Divide the salad among bowls and arrange the beef slices on top. Serve immediately. Serves 8 to 10.",
        "A note from the butcher:",
        "The day before you roast the beef for this salad, pat it dry with paper towels, rub it liberally with salt, place on a rack in a roasting pan and let rest, uncovered, in the refrigerator overnight. This process wicks away moisture from the outside of the roast, allowing the meat to absorb more flavors during roasting. The salt also penetrates the meat, giving it a well-seasoned flavor throughout.",
        "— Benjamin Dyer, Laurelhurst Market, Portland, OR",
        "Adapted from Williams-Sonoma",
        "The Cook and The Butcher",
        ", by Brigit Binns (Weldon Owen, Inc., 2011)."
    ],
    "ingredients": [
        "1 top round roast, about 4 lb., fat trimmed to 1/4 inch, meat patted dry",
        "Olive oil for brushing",
        "Kosher salt and freshly ground pepper, to taste",
        "2 oz. fatback or salt pork, thinly sliced (optional)",
        "1 large red onion, thinly sliced lengthwise, then cut crosswise into 1/2-inch pieces",
        "1/4 cup white wine vinegar",
        "2 Tbs. Dijon mustard",
        "2 tsp. coarsely cracked peppercorns",
        "1 tsp. kosher salt",
        "3/4 cup extra-virgin olive oil",
        "5 tangerines, peel and pith removed with a sharp knife, fruit cut into segments between the membranes and diced",
        "1 lb. baby arugula"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Roasted Beef, Arugula and Tangerine Salad",
    "url": "http://www.williams-sonoma.com/recipe/roasted-beef-arugula-and-tangerine-salad.html"
}
