{
    "directions": [
        "Rinse capon and snip away any excess fat from cavity using kitchen shears. Pat capon dry and season with salt inside and out. Let stand at room temperature 30 minutes.",
        "Preheat oven to 375°F.",
        "While capon is standing, mash garlic to a paste with salt using a mortar and pestle. Add cilantro, chile powder, cumin, and butter and mash to a paste again.",
        "Arrange capon, breast side up, with neck toward you, and gently work your fingers between skin and flesh of breast, working your way down to thighs. Rub one third of butter mixture under skin of breast and thighs. Rub another third of butter mixture in cavity of bird, then tie legs together with kitchen string.",
        "Put capon in a buttered roasting pan. Scatter carrots around bird and season with salt and pepper. Pour water over carrots. Roast in middle of oven 45 minutes. Remove pan from oven and brush top and sides of bird with remaining butter mixture. Roast, basting capon and carrots with pan juices every 20 minutes (tent capon with foil if it gets too brown), until a thermometer inserted 2 inches into fleshy part of a thigh registers 170°F, about 2 hours more.",
        "Transfer carrots with some of pan juices to a heated serving dish and keep warm, covered. Let capon stand 20 minutes before carving."
    ],
    "ingredients": [
        "1 8-pound capon or roasting chicken",
        "4 large garlic cloves, coarsely chopped",
        "2 teaspoons kosher salt",
        "1/2 cup finely chopped fresh cilantro",
        "1 tablespoon pure mild red chile powder such as ground ancho",
        "2 teaspoons ground cumin",
        "3 tablespoons unsalted butter, softened",
        "2 pounds medium carrots (16), halved lengthwise and cut into thirds crosswise",
        "1/2 cup water",
        "Accompaniment: Red Chile Sauce (Chile Colorado)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Poultry",
        "Vegetable",
        "Roast",
        "Spice",
        "Carrot",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Roast Capon with Chile-Cilantro Rub and Roasted Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/roast-capon-with-chile-cilantro-rub-and-roasted-carrots-104388"
}
