{
    "directions": [
        "In a heavy saucepan melt butter over low heat. Remove pan from heat and let butter stand 3 minutes. Skim froth and strain butter through a sieve lined with a double thickness of rinsed and squeezed cheesecloth into a bowl, leaving milky solids in bottom of pan. Pour clarified butter into a jar or crock and chill, covered. Butter keeps, covered and chilled, indefinitely. When clarified, butter loses about one fourth its original volume.",
        "Preheat oven to 475°F.",
        "In a small saucepan boil vinegar, honey, and thyme sprigs over moderate heat, stirring occasionally, until reduced to about 1/2 cup, about 5 minutes. Pour glaze through a fine sieve into a small bowl, discarding thyme, and reserve. In another small bowl stir together 2 tablespoons reserved glaze and 2 tablespoons clarified butter.",
        "In a saucepan of boiling salted water blanch onions 3 minutes. Drain onions and peel.",
        "Heat a flameproof roasting pan, 15 by 10 by 2 inches, in oven 10 minutes. In heated pan toss onions with remaining tablespoon clarified butter, chopped thyme, and salt and pepper to taste and roast in upper third of oven, stirring occasionally, about 15 minutes.",
        "While onions are roasting, prepare quail. Rinse quail and pat dry. Season inside and out with salt and pepper. Brush quail inside and out with about one third glaze-butter mixture and tie legs together with kitchen string.",
        "Add grapes to pan and toss with onions. Arrange quail, breast sides down, over onions and grapes and roast 15 minutes. Turn quail over and baste with about half of remaining glaze-butter mixture. Roast quail, basting with remaining glaze-butter mixture, 10 minutes more, or until juices run clear when fleshy part of a thigh is pierced.",
        "Discard string from quail and transfer to a platter. Arrange grapes and onions around quail using a slotted spoon and keep warm.",
        "To pan add reserved glaze and on stovetop boil over high heat 5 minutes, or until thickened and reduced to about 1/2 cup. Season sauce with salt and pepper and drizzle over quail.",
        "Garnish quail with thyme and serve with baked wild rice amandine."
    ],
    "ingredients": [
        "1 cup balsamic vinegar",
        "2 tablespoons honey",
        "10 fresh thyme sprigs plus 1 teaspoon chopped fresh thyme leaves",
        "3 tablespoons warm clarified butter (recipe follows)",
        "1 pound small pearl onions",
        "8 whole quail* (5 to 6 ounces each), cleaned and necks and feet removed  if necessary",
        "1 pound red seedless grapes (about 3 cups)",
        "Garnish: fresh thyme leaves",
        "Accompaniment:baked wild rice amandine",
        "unsalted butter, cut into 1-inch pieces",
        "*available at some butcher shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Onion",
        "Roast",
        "Dinner",
        "Vinegar",
        "Quail",
        "Winter",
        "Honey",
        "Thyme",
        "Grape",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roasted Quail with Red Grapes and Pearl Onions",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-quail-with-red-grapes-and-pearl-onions-13628"
}
