{
    "directions": [
        "Put oven racks in upper and lower thirds of oven and preheat oven to 425°F.",
        "Cut 3 (1/3-inch-thick) lengthwise slices from center of eggplant and reserve remainder for another use. Brush 2 large shallow baking pans with 1 tablespoon oil total, then arrange eggplant, zucchini, and bell peppers in 1 layer in pans. Brush vegetables with remaining 2 tablespoons oil and sprinkle with pepper and 1 1/4 teaspoons salt. Roast, switching position of pans halfway through roasting, until eggplant and zucchini are browned and tender, 15 to 20 minutes total, then transfer eggplant and zucchini to a plate. Turn peppers over and continue to roast until tender, about 10 minutes more. Transfer peppers to a bowl and cover, then let stand 10 minutes. Meanwhile, move 1 rack to middle position and leave oven on. Peel peppers.",
        "While vegetables roast, cook garlic in butter in a 1 1/2- to 2-quart heavy saucepan over moderate heat, whisking frequently, until fragrant, about 30 seconds. Whisk in flour and cook, whisking constantly, 2 minutes. Add milk in a slow stream, whisking, and bring to a boil, whisking constantly. Reduce heat and simmer, whisking frequently, 8 minutes (sauce will thicken slightly when it first comes to a boil). Remove from heat and cool béchamel sauce, stirring occasionally, 10 minutes. Stir in cheeses, basil, and remaining 1/2 teaspoon salt.",
        "Soak noodles in hot water just until pliable, 8 to 10 minutes.",
        "Spread 2/3 cup sauce in an 8-inch square baking dish. Drain 1 large noodle or 2 small noodles on a clean kitchen towel (not terry cloth) and put over sauce in dish. Top with half of zucchini in 1 layer, 1/2 cup sauce, and another noodle (or 2). Make another layer with all of eggplant, 1/2 cup sauce, and another noodle (or 2), and another with all of bell peppers, 1/2 cup sauce, and another noodle (or 2). Top with remaining zucchini, 1/2 cup sauce, and another noodle (or 2). Cover completely with remaining sauce.",
        "Bake until golden and bubbling, 25 to 30 minutes. Let stand in pan on a rack 20 minutes."
    ],
    "ingredients": [
        "1 large eggplant (1 1/2 pounds)",
        "3 tablespoons extra-virgin olive oil",
        "2 medium zucchini, trimmed and cut lengthwise into 1/4-inch-thick slices",
        "2 red bell peppers, quartered lengthwise",
        "1/2 teaspoon black pepper",
        "1 3/4 teaspoons salt",
        "2 garlic cloves, minced",
        "3 tablespoons unsalted butter",
        "1/4 cup all-purpose flour",
        "3 1/2 cups whole milk",
        "3 ounces Italian Fontina, coarsely grated (1 cup)",
        "1 ounces finely grated Parmigiano-Reggiano (1/2 cup)",
        "3 tablespoons finely chopped fresh basil",
        "5 (6 3/4- by 3 1/2-inch) or 10 (7- by 6 3/4-inch) no-boil lasagne noodles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Garlic",
        "Herb",
        "Pasta",
        "Pepper",
        "Vegetable",
        "Bake",
        "Roast",
        "Vegetarian",
        "Gourmet"
    ],
    "title": "Roasted-Vegetable Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-vegetable-lasagne-238397"
}
