{
    "directions": [
        "Stir beef, Worcestershire sauce, and Montreal steak seasoning together in a bowl. Marinate beef while preparing other items.",
        "Heat olive oil in skillet over high heat. Cook and stir onions in hot oil until golden brown, about 15 minutes; add balsamic vinegar, salt, and black pepper. Reduce heat to low and cook the onion mixture at a simmer until there is little liquid remaining and the mixture is syrup-like in texture, about 10 minutes.",
        "Preheat an outdoor grill to 400 degrees F (200 degrees C) and lightly oil the grate.",
        "Remove steak pieces from the marinade and shake off excess. Discard the remaining marinade. Combine beef and canola oil in a bowl and toss to coat.",
        "Preheat oven to 200 degrees F (95 degrees C).",
        "Cook the beef slices on the hot grill, turning frequently, until they start to firm and are reddish-pink and juicy in the center, 4 to 6 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C).",
        "Arrange rolls onto a baking sheet. Spoon onions into the bottom of the sandwich rolls; add beef. Top beef with Brie cheese.",
        "Heat in preheated oven until the cheese melts, about 5 minutes."
    ],
    "ingredients": [
        "1 pound top round beef, cut into 1-inch pieces",
        "1 tablespoon Worcestershire sauce",
        "2 teaspoons Montreal steak seasoning",
        "1 tablespoon extra-virgin olive oil",
        "2 small sweet onions, sliced",
        "1/3 cup balsamic vinegar",
        "1/4 teaspoon salt",
        "1/4 teaspoon cracked black pepper",
        "1 teaspoon canola oil",
        "4 (6 inch) submarine sandwich roll, split",
        "6 ounces Brie cheese, torn into pieces"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roast Beef Subs with Balsamic Onions and Brie Cheese",
    "url": "http://allrecipes.com/recipe/234910/roast-beef-subs-with-balsamic-onions/"
}
