{
    "directions": [
        "In a 1 1/2-quart heavy saucepan cook shallot in 1 teaspoon butter over moderately low heat, stirring, until softened. Carefully add Port and brandy and boil until reduced by half. Add demiglace and simmer 5 minutes, or until reduced to about 2/3 cup. Pour sauce through a fine sieve into a small bowl and return to pan. Stir in apricot, vinegar, and salt and pepper to taste. Simmer sauce until apricot is just heated through and stir in remaining tablespoon butter.",
        "Preheat oven to 450° F.",
        "Put duck breasts, skin sides down, on a cutting board. Using a sharp knife and following shape of breast, trim all sinews, excess skin, and fat. With a fork carefully prick skin all over without piercing meat.",
        "Heat an ovenproof cast-iron skillet over moderately high heat until hot and add oil, swirling skillet until coated evenly. Pat duck dry and season with salt and pepper. Put duck, skin sides down, in skillet. Reduce heat to moderate and cook duck until skin is deep golden, about 3 minutes. Turn duck over and cook 2 minutes more. Remove duck from skillet and pour off fat. Return duck, skin sides down, to skillet and roast in middle of oven 5 minutes for medium-rare. Keep duck warm and reheat sauce over low heat.",
        "Slice duck on the diagonal and serve with sauce."
    ],
    "ingredients": [
        "1/4 cup minced shallot",
        "1 tablespoon plus 1 teaspoon cold unsalted butter",
        "1/2 cup Tawny Port",
        "1 tablespoon brandy",
        "1 cup duck-and-veal demiglace (a 6 1/2-ounce container stirred together with 3 tablespoons water)",
        "1/3 cup julienne strips dried apricot",
        "1 tablespoon balsamic vinegar",
        "2 whole 1-pound boneless duck breasts with skin (preferably Long Island, or Pekin, halved",
        "1 teaspoon vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Fruit",
        "Poultry",
        "Roast",
        "Apricot",
        "Brandy",
        "Port",
        "Fall",
        "Gourmet"
    ],
    "title": "Roast Duck Breast with Balsamic and Apricot Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-duck-breast-with-balsamic-and-apricot-sauce-14499"
}
