{
    "directions": [
        "In a small heavy saucepan simmer water with 1 cup sugar, stirring until sugar is dissolved. (Syrup may be made up to this point 2 days ahead and cooled completely before being chilled, covered.)",
        "Preheat oven to 350° F and lightly butter a shallow baking pan.",
        "Coarsely chop hazelnuts. Stir nuts into syrup and simmer 1 minute. With a slotted spoon transfer nuts to baking pan, arranging in one layer, and reserve syrup. Cut butter into pieces. Bake nuts in middle of oven until golden brown, about 15 minutes. Immediately add butter to nuts, tossing to coat and separate, and with a spatula transfer nuts to a plate to cool (nuts will crisp as they cool). (Nuts may be candied 2 days ahead and kept in an airtight container in a cool, dry place. Reserved syrup may be kept, covered and chilled, 2 days.)",
        "Lightly butter a shallow ovenproof kettle or casserole dish (about 12 by 2 1/2 inches). With a sharp knife trim a very thin slice from bottom of each pear to enable pears to stand upright. Dip and roll each pear in reserved syrup to coat completely. Transfer pears as coated to kettle, standing them upright, and sprinkle with remaining 1/4 cup sugar. Add liqueur, lemon juice, and vanilla to remaining reserved syrup and pour down side of kettle or casserole.",
        "Roast pears, uncovered, in middle of oven until undersides are tender when pierced with a knife, about 30 minutes.",
        "Arrange pears on a serving platter. Spoon syrup around pears and sprinkle with candied nuts. Serve pears warm or at room temperature."
    ],
    "ingredients": [
        "1 cup water",
        "1 1/4 cups sugar",
        "3/4 cup hazelnuts",
        "1 tablespoon unsalted butter",
        "6 firm-ripe Bosc pears (about 2 1/4 pounds total), stems intact",
        "3 tablespoons hazelnut-flavored liqueur (preferably Frangelico)",
        "2 tablespoons fresh lemon juice, or to taste",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Roast",
        "Thanksgiving",
        "Lemon",
        "Pear",
        "Frangelico",
        "Fall",
        "Hazelnut",
        "Simmer",
        "Gourmet"
    ],
    "title": "Roasted Pears with Hazelnut Syrup and Candied Hazelnuts",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-pears-with-hazelnut-syrup-and-candied-hazelnuts-14468"
}
