{
    "directions": [
        "Preheat oven to 400°F. Brush rimmed baking sheet with 1 tablespoon olive oil. Toss mushrooms with 2 tablespoons olive oil in large bowl to coat. Arrange mushrooms, gill side up, in single layer on prepared baking sheet. Sprinkle with salt and pepper. Roast until tender, about 45 minutes. Cool. Cut mushrooms into 1/3-inch-thick slices.",
        "Meanwhile, heat remaining 2 teaspoons oil in medium nonstick skillet over medium heat. Add prosciutto; sauté until browned, about 3 minutes. Add shallots, rosemary, and thyme. Cook until shallots are tender, stirring frequently, about 5 minutes. (Mushrooms and prosciutto-shallot mixture can be made 1 day ahead. Cover separately and chill).",
        "Bring milk, broth, and bay leaf to simmer in heavy large saucepan over medium heat. Remove from heat. Let stand 10 minutes; discard bay leaf.",
        "Melt butter in heavy medium saucepan over medium-low heat. Whisk in flour; stir 2 minutes. Whisk in hot milk mixture; bring to boil, whisking frequently. Reduce heat to low; simmer 5 minutes, stirring frequently. Remove from heat; stir in Gruyère, Parmesan, and nutmeg. Season to taste with salt and pepper.",
        "Cook noodles in large pot of boiling salted water until almost tender but slightly undercooked (noodles will finish cooking in oven). Drain and rinse with cold water. Drain again; pat dry.",
        "Butter 13x9x2-inch glass baking dish. Spread 1 cup sauce over bottom of prepared dish. Arrange 1/3 of noodles over sauce, overlapping to fit. Spread about 1 2/3 cups sauce over noodles. Arrange 1/2 of mushrooms over sauce. Scatter 1/2 of prosciutto mixture over mushrooms. Arrange 1/2 of remaining noodles over mushrooms, overlapping to fit. Spread 1 2/3 cups sauce over noodles. Arrange remaining mushrooms over sauce, sprinkle with remaining prosciutto, and top with remaining noodles. Spread remaining sauce over noodles, sprinkle Parmesan cheese over, and dot with butter. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 350°F. Bake lasagna until top is golden brown and sauce is bubbling, about 45 minutes (about 1 hour if refrigerated). Let stand 20 to 30 minutes before serving."
    ],
    "ingredients": [
        "3 tablespoons plus 2 teaspoons olive oil",
        "2 1/2 pounds (about 10) portobello mushrooms, stems trimmed",
        "1 cup chopped prosciutto (about 6 ounces)",
        "2/3 cup chopped shallots (about 2 large)",
        "1 teaspoon chopped fresh rosemary",
        "1 teaspoon chopped fresh thyme",
        "4 cups whole milk",
        "1 14-ounce can low-salt chicken broth",
        "1 bay leaf",
        "1/2 cup (1 stick) butter",
        "2/3 cup all purpose flour",
        "2 cups (about 8 ounces) shredded Gruyère cheese",
        "1/3 cup grated Parmesan cheese",
        "1/8 teaspoon ground nutmeg",
        "1 pound lasagna noodles",
        "1/2 cup grated Parmesan cheese",
        "2 tablespoons butter, cut into 1/2-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Pasta",
        "Pork",
        "Bake",
        "Parmesan",
        "Fall",
        "Swiss Cheese",
        "Prosciutto",
        "Potluck"
    ],
    "title": "Roasted Portobello and Prosciutto Lasagna",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-portobello-and-prosciutto-lasagna-230941"
}
