{
    "directions": [
        "Preheat oven to 325°. Heat oil in a large skillet over medium high heat. Generously season lamb on all sides with salt and pepper and cook, turning often, until well browned, 12–15 minutes. Transfer lamb and oil to a roasting pan.",
        "Carefully add wine to skillet, scraping up browned bits. Bring to a simmer and cook until reduced by one-third, about 5 minutes. Add tomatoes, crushing with your hands, garlic, red pepper flakes, and 2 cups water and pour into roasting pan. Squeeze lemons over lamb; add to pan. Roast 3 hours.",
        "Meanwhile, remove tough dark outer leaves from artichokes. Using a serrated knife, trim 1\" from top. Trim stems and remove tough outer layer with a vegetable peeler. Halve artichokes lengthwise. Toss to coat with pan juices and tuck under and around lamb. Roast, turning artichokes occasionally, until artichokes are tender and meat is falling off the bone, 1 1/2–2 hours. (Remove artichokes if they become too soft before meat is done.)",
        "Pulse oil, anchovies, garlic, parsley, mint, and red pepper flakes in a food processor until smooth; season with salt.",
        "When done, place lamb in a large bowl and transfer artichokes, lemons, and garlic with a slotted spoon to bowl. Pour anchovy-herb oil over; tent with foil. Transfer pan juices to a glass measuring cup. Let sit a few minutes, then spoon off fat from surface. Serve lamb with artichoke mixture and pan juices."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "1 5–7-pound bone-in lamb shoulder",
        "Kosher salt, freshly ground pepper",
        "2 cups dry white wine",
        "1 14-ounces can whole peeled tomatoes",
        "1 head garlic, halved crosswise",
        "1/4 teaspoon crushed red pepper flakes",
        "2 lemons, halved crosswise",
        "6 baby artichokes",
        "1/2 cup olive oil",
        "4 anchovy fillets, packed in oil, drained",
        "1 garlic clove, finely chopped",
        "1/4 cup fresh flat-leaf parsley leaves",
        "2 tablespoons fresh mint leaves",
        "1/4 teaspoon crushed red pepper flakes",
        "Kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Roast",
        "Easter",
        "Dinner",
        "Artichoke",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roast Lamb with Artichokes and Lemons",
    "url": "http://www.epicurious.com/recipes/food/views/roast-lamb-with-artichokes-and-lemons-51234640"
}
