{
    "directions": [
        "Adjust a rack to lowest position and remove other racks. Preheat oven to 325 degrees F. Remove turkey parts from neck and breast cavities and reserve for other uses, if desired. Dry bird well with paper towels, inside and out. Salt and pepper inside the breast cavity and stuff the onion, garlic, herbs, and bay leaves inside. Set the bird on a roasting rack in a roasting pan; breast side up and brush generously with half the butter and season with salt and pepper. Tent the bird with foil.",
        "Roast the turkey for 2 hours. Remove the foil and baste with the remaining butter. Increase oven temperature to 425 degrees F and continue to roast until an instant read thermometer registers 165 degrees F in the thigh of the bird, about 45 minutes more.",
        "Remove turkey form the oven and set aside to rest for 15 minutes before carving. Carve and serve with dressing.",
        "Preheat oven to 325 degrees F.",
        "Put the stuffing cubes in a large bowl and set aside. Butter a 3-quart casserole dish.",
        "Melt 2 tablespoons of butter in a large skillet over medium-high heat. Add the sausage and break up with a wooden spoon. Cook until it loses most of its pink color, but not so much that it's dry, about 5 minutes. Add the sausage and pan drippings to the stuffing cubes. Melt the remaining butter in the pan. Add the onion, apple, celery, and salt. Cook until the vegetables get soft, about 5 minutes. Add the broth and parsley and bring to a boil.",
        "Pour the vegetable mixture over the stuffing cubes and toss until evenly moistened. Mix in the walnuts and eggs. Loosely pack the dressing in the prepared pan and cook uncovered until the top forms a crust, about 40 minutes. Drizzle about 2 tablespoons of turkey pan drippings or melted butter over the top. Cook until the top is crisp and golden, about 20 minutes more. Set immediately or warm.",
        "Prep Time: 20 minutes",
        "Cook Time: 1 hour"
    ],
    "ingredients": [
        "1 (8 to 10 pound) turkey",
        "Kosher salt and freshly ground black pepper",
        "1 medium onion, quartered",
        "1 head garlic, halved",
        "Several sprigs fresh herbs, such as; thyme, parsley, rosemary, and sage",
        "2 bay leaves",
        "8 tablespoons unsalted butter (1 stick), melted",
        "Serving Suggestions: Sage, Sausage and Apple Dressing, recipe follows",
        "16 -ounce bag stuffing cubes",
        "6 tablespoons unsalted butter, plus more for greasing the pan and topping",
        "1 pound fresh sage sausage, casing removed",
        "1 medium onion, chopped",
        "2 cooking apples, such as Gravenstein, Rome, or Golden Delicious, peeled, cored, and chopped",
        "1 to 2 ribs celery with leaves, chopped",
        "1/2 teaspoon kosher salt",
        "3 cups chicken broth, homemade or low-sodium canned",
        "1/4 cup chopped fresh flat-leaf parsley",
        "1/2 cup walnut pieces, toasted (See Note)",
        "2 eggs, beaten"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Dinner Recipes",
        "Thanksgiving Turkey",
        "Holiday",
        "Poultry Recipes",
        "Thanksgiving",
        "Turkey Recipes",
        "Roasted Turkey",
        "Roasting",
        "American",
        "Celery",
        "Vegetable",
        "Apple",
        "Fruit",
        "Meat",
        "Nut Recipes",
        "Sausage Recipes",
        "Fall"
    ],
    "title": "Roasted Turkey",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/roasted-turkey-recipe"
}
