{
    "directions": [
        "Bring first 4 ingredients to boil in medium saucepan. Reduce heat, cover, and simmer until cauliflower is very tender, about 17 minutes. Cool slightly. Transfer mixture to blender; add 3 tablespoons water and puree until smooth. Season with salt and pepper. (Can be made 1 day ahead. Cover; chill. Rewarm over medium heat, stirring, and adding more water to thin sauce, if desired.)",
        "Heat oil in medium saucepan over medium heat. Add onion, carrots, and celery; sauté until soft, about 8 minutes. Add lentils, curry, and paprika; stir 1 minute. Add 2 1/2 cups water; bring to boil. Reduce heat, cover, and simmer until lentils are tender, stirring occasionally, about 30 minutes. Uncover; stir until liquid is absorbed, about 5 minutes.",
        "Meanwhile, cook butter in large nonstick skillet over medium-high heat until browned, about 2 minutes. Add cauliflower; sauté until beginning to brown, about 5 minutes. Add 1/4 cup water; cover and cook until cauliflower is crisp-tender and water evaporates, about 3 minutes longer. Stir in lentil mixture. Season with salt and pepper. (Can be made 2 hours ahead. Let stand at room temperature. Rewarm before serving.)",
        "Mix parsley and lemon peel in bowl. Season with salt and pepper.",
        "Sprinkle monkfish with salt and pepper. Heat oil in large nonstick skillet over medium-high heat. Add fish; sauté until just opaque in center, about 6 minutes per side.",
        "Divide sauce among 4 plates. Spoon lentil mixture alongside. Place fish atop lentils; sprinkle with gremolata.",
        "*Available at specialty foods stores and some supermarkets."
    ],
    "ingredients": [
        "4 1/2 cups small cauliflower florets (from about one 22-ounce head)",
        "1 cup whipping cream",
        "4 garlic cloves, chopped",
        "1/8 teaspoon ground nutmeg",
        "3 tablespoons (or more) water",
        "1 tablespoon olive oil",
        "1/2 cup finely chopped onion",
        "1/2 cup finely chopped peeled carrots",
        "1/2 cup finely chopped celery",
        "1 cup French green lentils (lentilles de Puy)*",
        "3/4 teaspoon curry powder",
        "3/4teaspoon paprika",
        "2 3/4 cups water, divided",
        "2 tablespoons (1/4 stick) butter",
        "4 1/2 cups small cauliflower florets (from about one 22-ounce head)",
        "1/3 cup chopped fresh Italian parsley",
        "1 1/2 tablespoons grated lemon peel",
        "4 6-ounce monkfish fillets (each about 1 inch thick), skin removed",
        "1 tablespoon olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Bean",
        "Fish",
        "Sauté",
        "Curry",
        "Cauliflower",
        "Lentil",
        "Fall",
        "Simmer"
    ],
    "title": "Roasted Monkfish with Curried Lentils and Browned Butter Cauliflower",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-monkfish-with-curried-lentils-and-browned-butter-cauliflower-230628"
}
