{
    "directions": [
        "Preheat oven to 450°F. Sprinkle lamb with salt and pepper. Spread 1 tablespoon mustard on each side of each lamb rack. Mix breadcrumbs and mint in medium bowl. Press breadcrumb mixture onto lamb, coating completely.",
        "Arrange lamb, meat side up, on large baking sheet with rim. Roast lamb 10 minutes. Reduce oven temperature to 350°F. Roast until thermometer inserted into lamb registers 130°F. for medium-rare, about 20 minutes longer.",
        "Transfer lamb to work surface. Tent with foil; let stand 5 minutes. Cut lamb racks between bones into chops. Arrange chops on plates. Garnish with mint sprigs; pass Mint Sauce separately.",
        "Combine 1 cup mint, broth, shallots, vinegar and sugar in heavy small non-aluminum saucepan. Stir over medium heat until sugar dissolves. Simmer 2 minutes. Remove from heat. Cover and let stand 2 hours.",
        "Strain sauce into large glass measuring cup. Place cornstarch in same saucepan. Gradually whisk in sauce. Bring to simmer over medium heat, stirring constantly. Stir until sauce thickens slightly and turns translucent, about 2 minutes. Remove from heat. Cool to room temperature. (Can be prepared 1 day ahead. Cover and refrigerate. Bring to room temperature before continuing.) Stir in remaining 2 tablespoon mint. Season to taste with salt and pepper. Makes about 1 cup."
    ],
    "ingredients": [
        "3 8-chop racks of lamb, trimmed",
        "6 tablespoons Dijon mustard",
        "3 cups fresh white breadcrumbs",
        "6 tablespoons chopped fresh mint",
        "Fresh mint sprigs",
        "1 cup plus 2 tablespoons chopped fresh mint",
        "1/2 cup canned beef broth",
        "1/3 cup minced shallots",
        "6 tablespoons red wine vinegar",
        "1/4 cup sugar",
        "2 teaspoons cornstarch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Mustard",
        "Roast",
        "New Year's Eve",
        "Mint",
        "Rack of Lamb",
        "Winter"
    ],
    "title": "Roast Rack of Lamb with Mint Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-rack-of-lamb-with-mint-sauce-1260"
}
