{
    "directions": [
        "Preheat oven to 325°F.",
        "Rinse turkey and pat dry inside and out. Season turkey inside and out with salt and pepper and pack neck cavity loosely with some stuffing. Fold neck skin under body and fasten with a skewer. Fill body cavity loosely with some remaining stuffing and truss turkey. Transfer remaining stuffing to a buttered 1 1/2- to 2-quart shallow baking dish and reserve, covered and chilled.",
        "Spread turkey with butter and on a rack in a roasting pan roast in oven until a meat thermometer inserted in fleshy part of a thigh registers 180°F. and juices run clear when thigh is pierced, 3 1/4 to 4 hours.",
        "During last 1 1/2 hours of roasting, drizzle reserved stuffing with stock or broth and bake, covered, 1 hour. Transfer turkey to a heated platter, reserving juices in roasting pan, and discard string. Keep turkey warm, covered loosely with foil.",
        "Skim fat from pan juices, reserving 1/3 cup fat, and deglaze pan with Madeira over moderately high heat, scraping up brown bits. Bring Madeira to a boil and remove pan from heat.",
        "In a saucepan whisk together reserved fat and flour and cook roux over moderately low heat, whisking, 3 minutes. Add Madeira mixture and stock or broth in a stream, whisking, and simmer, whisking occasionally, 5 minutes. Season gravy with salt and pepper and transfer to a heated gravy boat.",
        "Garnish turkey with fennel, onions, and thyme."
    ],
    "ingredients": [
        "a 12- to 14-pound turkey, neck and giblets (excluding liver) reserved for making gravy",
        "sausage fennel stuffing",
        "1 stick (1/2 cup) unsalted butter, softened",
        "2 cups turkey giblet stock or chicken broth",
        "1 1/4 cups Sercial Madeira",
        "1/2 cup all-purpose flour",
        "4 cups turkey giblet stock or chicken broth",
        "Garnish: fresh small fennel bulbs, (sometimes called anise), quartered with fronds attached, fresh small white onions with greens attached, fresh thyme sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Roast",
        "Thanksgiving",
        "Gourmet"
    ],
    "title": "Roast Turkey with Sausage Fennel Stuffing and Madeira Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-sausage-fennel-stuffing-and-madeira-gravy-13279"
}
