{
    "directions": [
        "Preheat the oven to 400 degrees.",
        "Heat 2 tablespoons of the olive oil in a 10-or 12-inch heavy ovenproof skillet over medium-low heat. Add the fennel and saute for 8 to 10 minutes, until the fennel is tender. Add the garlic and cook for 1 minute. Add the wine and bring to a boil, scraping up any browned bits. Cook for 2 to 3 minutes, until the liquid is reduced by half. Add the tomatoes with the liquid, tomato paste, oregano, Pernod, salt, and pepper to the skillet. Simmer over medium-low heat, stirring occasionally, for 10 to 15 minutes.",
        "Arrange the shrimp, tails up, in one layer over the tomato-mixture in the skillet. Scatter the feta evenly over the shrimp. In a small bowl, combine the bread crumbs, parsley, and lemon zest with the remaining 2 tablespoons of olive oil and sprinkle over the shrimp.",
        "Bake for 15 minutes, until the shrimp are cooked and the bread crumbs are golden brown. Squeeze the juice of 1 lemon over the shrimp. Serve hot with the remaining lemon cut into wedges."
    ],
    "ingredients": [
        "4 tablespoons good olive oil, divided",
        "1 1/2 cups medium-diced fennel",
        "1 tablespoon minced garlic (3 cloves)",
        "1/4 cup dry white wine",
        "1 (14 1/2-ounce) can diced tomatoes",
        "2 teaspoons tomato paste",
        "1 teaspoon dried oregano",
        "1 tablespoon Pernod",
        "1 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 1/4 pounds (16 to 20 per pound) peeled shrimp with tails on",
        "5 ounces good feta cheese, coarsely crumbled",
        "1 cup fresh bread crumbs (see note)",
        "3 tablespoons minced fresh parsley",
        "1 teaspoon grated lemon zest",
        "2 lemons"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Shrimp Recipes",
        "Easy Recipes",
        "Shellfish Recipes",
        "Shrimp",
        "Roasted Tomato",
        "Roasted Vegetable",
        "Roasting",
        "Tomato",
        "Vegetable",
        "Cheese",
        "Feta"
    ],
    "title": "Roasted Shrimp with Feta",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/roasted-shrimp-with-feta-recipe"
}
