{
    "directions": [
        "Preheat oven to 325°F. Line rimmed baking sheet with parchment paper. Combine tomatoes, basil leaves, oil, vinegar, and sugar in medium bowl; toss to blend. Spread tomato mixture in single layer on prepared sheet; sprinkle with salt and pepper. Roast until tomatoes are slightly shriveled, about 40 minutes. Transfer tomato mixture to medium saucepan. Add clam juice, wine, saffron, and crushed red pepper; bring to boil. Reduce heat and simmer 10 minutes to blend flavors and reduce slightly. Add butter and stir until melted. Season sauce with salt and pepper. (Can be prepared 4 hours ahead. Rewarm over medium heat before serving.)",
        "Preheat oven to 425°F. Line another rimmed baking sheet with parchment. Arrange fish on parchment; brush fish with oil. Sprinkle fish with thyme, lemon peel, salt, and pepper. Roast fish, without turning, until just opaque in center, about 10 minutes for monkfish and 6 minutes for halibut.",
        "Spoon Celeriac Mash onto 4 plates. Top each with 1 fish fillet. Spoon sauce over. Garnish with basil sprigs, if desired."
    ],
    "ingredients": [
        "20 cherry tomatoes, halved",
        "1/2 cup fresh basil leaves",
        "1 tablespoon extra-virgin olive oil",
        "1 tablespoon balsamic vinegar",
        "1/2 teaspoon sugar",
        "1 cup bottled clam juice",
        "1/2 cup Riesling or other fruity white wine",
        "1/4 teaspoon (loosely packed) saffron threads",
        "Pinch of dried crushed red pepper",
        "1 tablespoon butter",
        "4 7- to 8-ounce monkfish fillets or halibut fillets",
        "1 tablespoon extra-virgin olive oil",
        "2 teaspoons chopped fresh thyme",
        "1 teaspoon grated lemon peel",
        "Celeriac Mash",
        "Fresh basil sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Tomato",
        "Roast",
        "Saffron",
        "Root Vegetable",
        "Winter"
    ],
    "title": "Roasted Monkfish with Saffron Tomato Sauce and Celeriac Mash",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-monkfish-with-saffron-tomato-sauce-and-celeriac-mash-231592"
}
