{
    "directions": [
        "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.",
        "Place red bell pepper on a baking sheet.",
        "Roast pepper in the preheated oven until skin is blackened, about 5 minutes per side. Allow pepper to cool.",
        "Peel and discard blackened skin; finely chop pepper and set aside.",
        "Season chicken tenders with 1 tablespoon cilantro, paprika, black pepper, and monosodium glutamate.",
        "Heat 2 tablespoons olive oil in a skillet over medium heat. Arrange chicken tenders in the skillet, cover, and reduce heat to low. Cook until chicken is no longer pink in the center and is browned on both sides, about 20 minutes. Transfer chicken to a plate and set aside to cool; reserve skillet.",
        "While the chicken is cooking, heat 1/4 cup olive oil in another skillet over medium-low heat. Cook and stir onion in the hot oil until very tender and dark brown, about 20 minutes.",
        "Stir roasted bell pepper, 2 cups jicama, 1 tablespoon salt, sugar, and 3/4 teaspoon cayenne pepper into caramelized onion. Cook and stir until jicama begins to soften, about 5 minutes more; remove from heat.",
        "Pour reserved tomato juices into the skillet used to cook chicken.",
        "Heat tomato juice over medium-high heat until reduced by half, 5 to 7 minutes, scrape up any brown bits in the skillet.",
        "Stir sour cream into reduced tomato juice until evenly mixed; remove from heat.",
        "Season jicama slices with salt and pepper to taste.",
        "Heat 1 tablespoon olive oil in a clean skillet. Pan-fry jicama slices in the hot oil until browned on both sides, 5 to 7 minutes.",
        "Mix tomatoes with green chiles, avocados, lemon juice, 1 tablespoon cilantro, 1/2 teaspoon cayenne pepper, cumin, and salt in a bowl until mixture is a slightly creamy guacamole.",
        "Spread tomato-sour cream mixture on a large platter.",
        "Pile guacamole atop sour cream.",
        "Spread red pepper salsa over guacamole.",
        "Chop chicken breast tenders into chunks; scatter chicken chunks and jicama slices over salsa."
    ],
    "image": "https://images.media-allrecipes.com/images/79591.png",
    "ingredients": [
        "1 large red bell pepper",
        "1 pound chicken breast tenders",
        "1 tablespoon dried cilantro",
        "2 teaspoons paprika",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon monosodium glutamate (MSG)",
        "2 tablespoons extra-virgin olive oil",
        "1/4 cup extra virgin olive oil",
        "1 large yellow onion, minced",
        "2 cups matchstick-cut jicama",
        "1 tablespoon salt",
        "1 tablespoon white sugar",
        "3/4 teaspoon cayenne pepper",
        "1 (10 ounce) can diced tomatoes with green chile peppers, drained and juices reserved.",
        "8 ounces sour cream",
        "1/4 cup thinly sliced jicama",
        "salt and ground black pepper to taste",
        "1 tablespoon extra-virgin olive oil",
        "2 large avocados, peeled, pitted, and diced",
        "2 tablespoons lemon juice",
        "1 tablespoon dried cilantro",
        "1/2 teaspoon cayenne pepper",
        "1/8 teaspoon ground cumin"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Red Pepper and Jicama Salsa with Zesty Chunk Guacamole",
    "url": "http://allrecipes.com/recipe/220591/roasted-red-pepper-and-jicama-salsa-w/"
}