{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.",
        "Bring water and bulgur to a boil in a saucepan; cover and reduce heat to medium-low. Simmer until water is absorbed and bulgur is soft, about 12 minutes. Keep warm.",
        "Place sweet potato in a bowl and drizzle 1 teaspoon olive oil over it; season with salt and pepper. Toss to coat. Transfer sweet potato to the prepared baking sheet, placing in 1 row. Place fennel in the same bowl, add 1 teaspoon olive oil, and season with salt and pepper. Toss to coat and place fennel next to sweet potato, keeping each separate.",
        "Roast in the preheated oven for 10 minutes. Place red onion in the same bowl; add 1 teaspoon olive oil, and season with salt and pepper. Toss to coat and place on the baking sheet with sweet potato and fennel, keeping them separate. Place red bell pepper in the same bowl; add 1 teaspoon olive oil, and season with salt and pepper. Toss to coat and place on the baking sheet next to the onion.",
        "Roast in the oven until all the vegetables are cooked to desired doneness, 10 to 15 minutes.",
        "Place tempeh in a bowl and season with 1/2 teaspoon curry powder, tossing to coat.",
        "Heat coconut oil in a skillet over medium-high heat; saute tempeh, turning occasionally, until all sides are evenly browned, about 10 minutes.",
        "Whisk orange juice, 2 tablespoons olive oil, red wine vinegar, 1/2 teaspoon curry powder, 1/4 teaspoon salt, and 1/4 teaspoon pepper in a small bowl until dressing is smooth.",
        "Divide bulgur between 2 bowls. Place half of sweet potato, fennel, red onion, and red bell pepper around bulgur; top each with 1 tablespoon pumpkin seeds. Drizzle dressing over each bowl."
    ],
    "ingredients": [
        "1 cup water",
        "1/2 cup bulgur",
        "1 sweet potato, peeled and cut into 1-inch cubes",
        "4 teaspoons olive oil, divided",
        "salt and ground black pepper to taste",
        "1/2 pound fennel bulb, trimmed and cut into 1-inch cubes",
        "1 small red onion, cut into 1-inch pieces",
        "1 red bell pepper, cut into 1-inch strips",
        "1 (8 ounce) package tempeh, cut into 1-inch pieces",
        "1/2 teaspoon curry powder",
        "2 teaspoons coconut oil",
        "Orange-Curry Dressing:",
        "1/4 cup fresh squeezed orange juice",
        "2 tablespoons olive oil",
        "2 teaspoons red wine vinegar",
        "1/2 teaspoon curry powder",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "2 tablespoons raw pumpkin seeds (pepitas)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Veggie Buddha Bowl",
    "url": "http://allrecipes.com/recipe/257074/roasted-veggie-buddha-bowl/"
}
