{
    "directions": [
        "Preheat the oven to 375°F. Using a long knife with a thin blade or a clean sharpening steel, make a channel lengthwise through the center of the loin running from one end to the other.",
        "Mix the chopped sage and rosemary in a small bowl. Add the minced garlic and 1 tablespoon oil. Season the mixture with salt and pepper, then poke it through the channel in the meat (I find it easiest to work from both ends more or less at once).",
        "Season the outside of the loin generously with salt and pepper. Heat 2 tablespoons oil over medium-high heat in an ovenproof skillet large enough to hold the loin. Brown the meat on all sides and on each end, about 8 minutes in all.",
        "Add the herb sprigs and crushed garlic to the pan and put it in the oven. Roast for 15 minutes, then turn the loin and roast 15 minutes more, basting from time to time with the pan drippings.",
        "Remove the pan from the oven, cover with foil, and set aside in a warm place for 15 minutes to rest the meat. To serve, cut the loin into generous slices, season with sea salt, and drizzle with the pan juices.",
        "If you are roasting a larger, thicker loin, make two channels through the meat so the seasoning can be better distributed. Cook the loin longer.",
        "If you want, you can use a meat thermometer to check the temperature. I prefer pork cooked so it's still a little pink at the center. You can expect a reading before the final resting of about 135°F. If you like your pork more thoroughly cooked, cook it until the internal temperature reaches 150°F."
    ],
    "ingredients": [
        "1 boneless pork loin (about 2 pounds)",
        "1 1/2 teaspoons chopped fresh sage plus 2 sprigs",
        "1 1/2 teaspoons chopped fresh rosemary plus 2 sprigs",
        "1 teaspoon minced garlic plus 2 cloves, peeled and lightly crushed",
        "3 tablespoons extra virgin olive oil",
        "Kosher salt and freshly ground black pepper",
        "Sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pork",
        "Roast",
        "Father's Day",
        "Dinner",
        "Rosemary",
        "Sage",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roasted Pork with Sage, Rosemary, and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-pork-with-sage-rosemary-and-garlic-359649"
}
