{
    "directions": [
        "Preheat oven to 425° F.",
        "Trim and quarter mushrooms. Halve tomatoes lengthwise. In a large non-stick skillet heat oil over moderately high heat until hot but not smoking and sauté shallot, stirring, until softened. Reduce heat to moderate and cook garlic, stirring, until fragrant, about 20 seconds. Add mushrooms and cook, stirring, 2 minutes. Remove skillet from heat. Stir in tomatoes and season with salt and pepper.",
        "Halve bell peppers lengthwise through stems and discard seeds and ribs. Season pepper shells with salt and pepper and in a large baking pan bake in upper third of oven 10 minutes.",
        "Spoon chick-pea and eggplant purée evenly into shells, smoothing tops. Mound mushroom mixture onto center of purée and sprinkle with pine nuts. Bake stuffed peppers in upper third of oven until heated through, about 15 minutes. (Alternatively, grill pepper shells, skin sides up, on an oiled rack set 5 to 6 inches over glowing coals 7 to 10 minutes, or until slightly charred. Transfer shells to a work surface and stuff them as above. Grill stuffed peppers, covered, until heated through, about 5 minutes.)"
    ],
    "ingredients": [
        "6 ounces fresh shiitake mushrooms",
        "6 ounces button mushrooms",
        "1 pound mixed vine-ripened red and yellow cherry tomatoes",
        "1 tablespoon extra-virgin olive oil",
        "1 shallot, sliced thin",
        "1 garlic clove, sliced thin",
        "4 medium yellow bell peppers with stems attached",
        "2 cupsChick-pea and Eggplant Purée",
        "1 tablespoon pine nuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Tomato",
        "Side",
        "Bake",
        "Broil",
        "Low Fat",
        "Vegetarian",
        "Pine Nut",
        "Bell Pepper",
        "Healthy",
        "Gourmet"
    ],
    "title": "Roasted Peppers Stuffed with Chick-Pea and Eggplant Purée and Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-peppers-stuffed-with-chick-pea-and-eggplant-puree-and-mushrooms-14145"
}
