{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.",
        "Arrange butternut squash halves, carrot chunks, sweet potato chunks, and whole garlic head onto the prepared baking sheet. Drizzle 1 1/2 tablespoons olive oil over the vegetables; season with rosemary, salt, and black pepper.",
        "Roast in preheated oven for 20 minutes, turn the carrot and sweet potato chunks, and continue roasting until everything is tender, 20 to 30 minutes more. Set aside to cool.",
        "Use a spoon to remove flesh of squash from skin. Cut carrot and sweet potato into small pieces. Squeeze roasted garlic from skin.",
        "Heat 1 tablespoon olive oil in a large pot over medium heat; add celery and onion. Season the celery mixture with nutmeg and cayenne pepper; saute until the celery and onion are tender, about 8 minutes. Add apple and continue to cook and stir until apples begin to get hot, about 2 minutes more.",
        "Pour vegetable broth and apple cider into the pot; bring just to a boil, reduce heat to medium-low, and cook at a simmer for 30 minutes.",
        "Stir squash, carrot, sweet potato, and garlic to the pot. Blend soup with an immersion blender until smooth."
    ],
    "ingredients": [
        "1 butternut squash, halved lengthwise and seeded",
        "1 large carrot, cut into large chunks",
        "1 sweet potato, cut into large chunks",
        "1 head garlic",
        "1 1/2 tablespoons olive oil",
        "1/2 teaspoon dried rosemary",
        "salt and ground black pepper to taste",
        "1 tablespoon olive oil",
        "2 stalks celery, chopped",
        "1 onion, chopped",
        "1/2 teaspoon nutmeg",
        "1/2 teaspoon cayenne pepper",
        "2 Granny Smith apples - peeled, cored, and sliced",
        "4 cups vegetable broth",
        "1 cup apple cider"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Butternut Squash, Garlic, and Apple Soup",
    "url": "http://allrecipes.com/recipe/235573/roasted-butternut-squash-garlic-and/"
}
