{
    "directions": [
        "Preheat the oven to 450°F. Rinse the chicken and pat dry. Remove the wings and reserve.",
        "Combine the bread, parsley, minced garlic, za'atar and lemon zest in a mixing bowl and toss with 1/4 cup of the olive oil to coat evenly. Season the stuffing with salt and pepper.",
        "Season the cavity of the chicken with salt and pepper and fill with the stuffing. Tie the legs together with kitchen string. Season the bird on the outside with salt and pepper and drizzle with the remaining 2 tablespoons of olive oil.",
        "Place the wings in a roasting pan and place the chicken on top of the wings. Roast for 20 minutes. Reduce the oven temperature to 350°F and add the garlic cloves to the roasting pan. Continue roasting for 25 to 30 minutes, or until the juices run clear when the leg is pierced. Transfer the chicken to a platter and let it rest for at least 10 minutes.",
        "Carve the chicken by removing the leg and thigh at the joint, then run the carving knife down one side of the breast bone and continue by following the rib cage, lifting the breast meat away from the bone. Repeat on the other side of the breast bone, removing the second breast. Slice the breast meat and leg meat. Place 2 slices each of breast and leg meat on each plate and spoon some of the stuffing alongside. Spoon some of the pan drippings over the chicken and serve immediately.",
        "Many recipes are inspired by memory and tradition. It is important to incorporate traditional recipes and techniques into cooking but it is also fun to experiment a little. This roast chicken recipe includes an exotic spice called za'atar, which ended up making the dish very robust and exciting.The two wines featured have roots in very traditional winemaking regions, and their producers understand the importance of old world style without alienating the flavors that go so well with worldly cuisine.",
        "LUCIANO SANDRONE DOLCETTO D'ALBA 2007. PIEDMONT, ITALY\nThe Piedmont region of Italy is quite a fantastic area with its breathtaking views of the majestic snow-covered Swiss and Italian Alps and, of course, the famously aromatic white truffles that grow there. Dolcetto, a varietal common in the Piedmont, is wine for everyday drinking. It is often soft, round, fruit-driven and fragrant, with flavors of licorice and almonds. Sandrone is often seen as a modernist in the Piedmont because he opts for shorter macerations and uses some new oak in his wines. His wines are often rich but very polished.",
        "JOSEPH DROUHIN GEVREY-CHAMBERTIN 2005/6. BURGUNDY, FRANCE\nGevrey-Chambertin is a small town in the Côte de Nuits producing some of Burgundy's most famous red wines made from Pinot Noir grapes. In 1847, Gevrey annexed the name of its finest vineyard, Chambertin. These Pinot Noirs are generally deeper in color and are a little firmer than the wines of their rivals from neighboring villages. Here in the 'Homeland' of Pinot Noir it is all about the terroir. Of course there are many great, top-level wines from all over the world, but once you have the luck to drink great red Burgundy at its peak, you will never forget that experience! Joseph Drouhin is a négociant in Burgundy who produces wonderful wines for a great value."
    ],
    "ingredients": [
        "1 4-pound chicken",
        "1 1/2 cups diced crusty bread",
        "2 tablespoons chopped fresh Italian parsley",
        "1 tablespoon minced garlic plus 1 head of garlic, cloves separated",
        "2 teaspoons za'atar",
        "1 teaspoon lemon zest",
        "1/4 cup plus 2 tablespoons olive oil",
        "Fine sea salt and freshly ground black pepper",
        "Special equipment: kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Roast",
        "Dinner",
        "Basil",
        "Thyme",
        "Oregano",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roasted Chicken with Za'atar Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-chicken-with-zaatar-stuffing-362209"
}
