{
    "directions": [
        "1. To make the romesco, preheat the oven to 375°F (190°C). Spread the almonds on a large, heavy-duty baking sheet and toast in the oven, stirring once or twice, until fragrant and slightly darkened, about 10 minutes. Remove from the oven and immediately pour onto a plate to cool; the nuts can burn easily. Leave the oven on.",
        "2. On the baking sheet, toss the tomatoes, bell peppers, onion slices, and garlic cloves with the 2 Tbsp olive oil and 1 tsp salt. Roast until all the vegetables are tender and slightly charred, 15-30 minutes. As each vegetable is done, transfer it to a bowl. The onions and garlic will cook first, followed by the peppers and then the tomatoes.",
        "3. When all the romesco vegetables are done, transfer them to a blender or food processor. Add the vinegar, paprika, and cayenne and process to a smooth purée. Taste and adjust the seasoning. Set the romesco aside.",
        "4. Clean off the baking sheet, then add the root vegetables and toss with the 2 Tbsp olive oil and 1 tsp salt. Spread the vegetables in a single layer and roast until tender and nicely caramelized, about 40 minutes. Arrange the roasted root vegetables on a platter and pour the romesco sauce over them. Serve right away."
    ],
    "ingredients": [
        "3/4 cup (3 oz/90 g) raw almonds",
        "6 plum tomatoes",
        "2 red bell peppers",
        "1 yellow onion, cut into slices about 1/2 inch (12 mm) thick",
        "3 garlic cloves",
        "2 Tbsp olive oil",
        "Kosher salt",
        "2 Tbsp sherry vinegar",
        "2 tsp smoked paprika",
        "1/4 tsp cayenne pepper",
        "4 lb (2 kg) mixed root vegetables such as carrots, parsnips, beets, celery root, and sweet potatoes, peeled and cut into 1 1/2-inch (4-cm) pieces",
        "2 Tbsp olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Vegetable",
        "Vegetarian",
        "Bell Pepper",
        "Root Vegetable",
        "Beet",
        "Carrot",
        "Parsnip",
        "Sweet Potato/Yam",
        "Fall"
    ],
    "title": "Roasted Root Vegetables with Romesco Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-root-vegetables-with-romesco-sauce-51116210"
}
