{
    "directions": [
        "Cook bok choy in pot of boiling salted water until crisp-tender, about 2 minutes. Drain. Set aside. Heat 2 teaspoons vegetable oil in heavy large skillet over medium heat. Add curry paste and stir 30 seconds. Add coconut milk, chopped lemongrass and 1 tablespoon brown sugar. Boil until mixture is slightly thickened and reduced to 1 cup, about 5 minutes. Stir in 2 1/2 tablespoons lime juice and 1 tablespoon fish sauce. Set curry sauce aside.",
        "Preheat oven to 400°F. Heat 1 tablespoon oil in heavy large ovenproof skillet over high heat. Sprinkle salmon with salt and pepper; add to skillet. Cook salmon 2 minutes per side. Transfer skillet to oven. Bake salmon until opaque in center, about 6 minutes. Meanwhile, heat remaining 1 tablespoon vegetable oil in large nonstick skillet over medium-high heat. Add bok choy and sauté until beginning to brown in spots, about 4 minutes. Drizzle bok choy with remaining 1 tablespoon fish sauce. Bring curry sauce to simmer and ladle onto 4 plates.",
        "Arrange 1 salmon fillet and 2 pieces of bok choy atop curry sauce on each plate and serve."
    ],
    "ingredients": [
        "8 whole baby bok choy",
        "2 teaspoons plus 2 tablespoons vegetable oil",
        "1/2 teaspoon Thai red curry paste*",
        "1 13 1/2- to 14-ounce can unsweetened coconut milk*",
        "1/4 cup finely chopped fresh lemongrass or 1 tablespoon grated lemon peel",
        "1 tablespoon brown sugar",
        "2 1/2 tablespoons fresh lime juice",
        "2 tablespoons fish sauce (nam pla*)",
        "4 6-ounce salmon fillets",
        "*Thai red curry paste and fish sauce (nam pla) are both available at Asian markets and in the Asian foods section of some supermarkets nationwide.",
        "**Canned unsweetened coconut milk is available at Indian markets, Southeast Asian markets, Latin American markets and many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Salmon",
        "Curry",
        "Spring",
        "Bok Choy"
    ],
    "title": "Roast Salmon with Thai Red Curry and Bok Choy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-salmon-with-thai-red-curry-and-bok-choy-101402"
}
