{
    "directions": [
        "Stir 6 tablespoons salt, sugar, and 4 cups water in a large pot until salt and sugar dissolve. Add 4 more cups cold water. Add chicken. Cover, chill, and let brine for 4-12 hours.",
        "Preheat oven to 400°F. Set a wire rack inside a roasting pan. Remove chicken from brine; pat dry. Let sit for 20 minutes. Season lightly with salt. Heat 1 tablespoon oil in a large cast-iron skillet over medium-high heat. Arrange leg pieces, skin side down, in skillet. Place 1 head of garlic, cut side down, in center of skillet. Tuck 5 sprigs each of thyme and rosemary around chicken. Cook until skin is golden brown, 10-12 minutes.",
        "Transfer herbs and garlic on prepared rack. Add 1 tablespoon butter to skillet; swirl to coat. Flip chicken; baste with pan juices. Transfer, skin side up, to prepared rack. Repeat with 1 tablespoon oil, chicken breasts, 1 head of garlic, 5 thyme sprigs, 5 rosemary sprigs, and 1 tablespoon butter. Reserve drippings in skillet.",
        "Transfer chicken to oven and roast until an instant-read thermometer inserted into thickest part of thigh registers 160°F, about 20 minutes. Transfer chicken, herbs, and garlic to a platter. Let rest for 15 minutes.",
        "Meanwhile, heat drippings over medium heat, adding 1 tablespoon oil if dry. Add remaining herbs and garlic, cut side down. Stir until aromatic, 3-4 minutes. Add 2 tablespoons butter; stir until butter browns, 1-2 minutes. Squeeze lemon over. Pour over chicken."
    ],
    "ingredients": [
        "6 tablespoons kosher salt plus more",
        "3 tablespoons sugar",
        "2 3 1/2-pound chickens, backbones and wing tips removed, quartered",
        "2 tablespoons (or more) vegetable oil, divided",
        "4 heads of garlic, halved crosswise",
        "20 sprigs thyme, divided",
        "14 sprigs rosemary, divided",
        "4 tablespoons unsalted butter, divided",
        "1/2 lemon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Herb",
        "Roast",
        "Dinner",
        "Rosemary",
        "Fall",
        "Thyme",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Chicken with Herb-and-Garlic Pan Drippings",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-herb-and-garlic-pan-drippings-367155"
}
