{
    "directions": [
        "Preheat oven to 425°F.",
        "Rinse turkey and pat dry inside and out. Season turkey inside and out with salt and pepper and pack neck cavity loosely with some stuffing. Fold neck and skin under body and fasten with a skewer. Fill body cavity loosely with some remaining and truss turkey. Transfer remaining to a buttered 3-quart baking dish and reserve it, covered and chilled.",
        "Spread turkey with butter and on a rack in a roasting pan in oven 30 minutes. Reduce oven temperature to 325°F. and baste turkey with pan juices. Add water to pan and roast, basting every 20 minutes, 2 1/2 to 3 hours more, or until a meat thermometer in fleshy part of thigh registers 180°F., and juices run clear when thigh is pierced.",
        "During last 1 1/2 hours of roasting, drizzle reserved stuffing with stock or broth and bake, covered, in 325°F. oven 1 hour. Bake stuffing uncovered, 30 minutes more. Transfer turkey to a heated platter, reserving juices in roasting pan, and discard string. Keep turkey warm, covered loosely with foil.",
        "Skim fat from roasting pan juices, reserving 1/4 cup fat, and deglaze pan with Port over moderately high heat, scraping up brown bits. Bring Port to a boil and remove pan from heat. In a saucepan whisk together reserved fat and flour and cook roux over moderately low heat, whisking, 3 minutes. Add Port mixture and stock or broth in a stream, whisking, and simmer, whisking occasionally, 10 minutes. Stir in lemon juice and salt and pepper to taste and transfer gravy to a heated gravy boat.",
        "Garnish turkey and stuffing with herbs and apple slices."
    ],
    "ingredients": [
        "A 12- to 14-pound turkey, neck, and giblets (excluding liver) reserved for making",
        "Potato, Apple, and Prune Stuffing",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 cup water",
        "1 cup turkey giblet stock or chicken broth",
        "1 cup Tawny Port, preferably reserved from stuffing recipe",
        "4 tablespoons all-purpose flour",
        "4 cups turkey giblet stock or chicken broth",
        "2 tablespoons fresh lemon juice",
        "Garnish: fresh thyme and flat-leafed parsley sprigs and apple slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Gourmet"
    ],
    "title": "Roast Turkey with Port Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-port-gravy-10840"
}
