{
    "directions": [
        "1. Heat the broiler. Lay the whole tomatoes and jalapeños out on a broiler pan or baking sheet. Set the pan 4 inches below the broiler and broil for about 6 minutes, until darkly roasted — even blackened in spots — on one side (the tomato skins will split and curl in places). With a pair of tongs, flip over the tomatoes and chiles and roast the other side for another 6 minutes or so. The goal is not simply to char the tomatoes and chiles, but to cook them through while developing nice, roasty flavors. Set aside to cool.",
        "2. Turn the oven down to 425 degrees. Separate the onions into rings. On a similar pan or baking sheet, combine the onion and garlic. Roast in the oven, stirring carefully every couple of minutes, until the onions are beautifully browned and wilted (even have a touch of char on some of the edges) and the garlic is soft and browned in spots, about 15 minutes total. Cool to room temperature.",
        "3. For a little less rustic texture or if you're canning the salsa, pull off the peels from the cooled tomatoes and cut out the \"cores\" where the stems were attached, working over your baking sheet so as not to waste any juices. In a food processor, pulse the jalapeños (no need to peel or seed them) with the onion and garlic until moderately finely chopped, scraping everything down with a spatula as needed to keep it all moving around. Scoop into a big bowl. Without washing the processor, coarsely puree the tomatoes — with all that juice that has accumulated around them — and add them to the bowl. Stir in enough water to give the salsa an easily spoonable consistency. Stir in the cilantro.",
        "4. Taste and season with salt and vinegar, remembering that this condiment should be a little fiesty in its seasoning. If you're planning to use your salsa right away, simply pour it into a bowl and it's ready, or refrigerate it covered and use within 5 days."
    ],
    "ingredients": [
        "1 1/2 pounds ripe tomatoes (about 10 medium), preferably plum",
        "2 to 3 fresh jalapeño chiles (1 to 1 1/2 ounces), stemmed",
        "Half of a small white onion (2 ounces), sliced 1/4 inch thick",
        "4 garlic cloves, peeled",
        "1/4 cup water",
        "1/3 cup chopped fresh cilantro, loosely packed",
        "1 generous teaspoon salt",
        "1 1/2 teaspoons cider vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Garlic",
        "Herb",
        "Pepper",
        "Tomato",
        "Roast",
        "Fall",
        "Jalapeño"
    ],
    "title": "Roasted Jalapeño-Tomato Salsa with Fresh Cilantro",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-jalapeno-tomato-salsa-with-fresh-cilantro-105450"
}
