{
    "directions": [
        "Preheat oven to 350°F.",
        "To make the stuffing, heat the vegetable oil in a skillet and sauté the shrimp over medium heat until cooked through, about 1 minute. Let cool, dice, and set aside.",
        "In a large skillet, melt the butter and sauté the onions, celery, carrot, serranos, garlic and chayote over high heat for 2 to 3 minutes. Deglaze the vegetables with the bourbon and continue cooking over high heat for 1 minute or until the liquid evaporates. Remove the skillet from the heat and add the thyme, sage, cilantro, shrimp, and crumbled blue corn sticks. Moisten with the stock and season with salt. Stir to combine.",
        "Wash the turkey well and season the cavity with salt and pepper. Stuff the turkey and truss with a needle and string. Rub the turkey generously with the softened butter and season the outside of the turkey with more salt and pepper.",
        "Place the turkey on a rack in a roasting pan, cover tightly with foil, and roast in the oven for 2 1/2 to 3 1/2 hours. Baste well with butter periodically Remove the foil in the last hour of cooking to allow the turkey to brown. When done, transfer the turkey to a platter and let it rest for 10 to 15 minutes before carving. Remove the string and serve the turkey with the stuffing and a gravy made from the giblets."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "1 pound medium shrimp - shelled and deveined",
        "1/2 cup (1 stick) unsalted butter",
        "1 cup chopped onions",
        "1/4 cup diced celery",
        "1/4 cup diced carrot",
        "4 serrano chiles - de-ribbed, seeded and minced",
        "6 cloves garlic - minced",
        "1/4 cup choppedchayote (optional)",
        "1/4 cup bourbon whiskey",
        "1 teaspoon minced thyme",
        "1 teaspoon minced sage",
        "2 teaspoons chopped cilantro",
        "8 cups coarsely crumbledblue corn bread",
        "1/2 cup chicken stock or turkey stock",
        "1 to 2 teaspoons salt",
        "1 wild turkey - 8 to 10 pounds",
        "salt to taste",
        "freshly ground black pepper to taste",
        "unsalted butter - at room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Cornmeal",
        "Shrimp",
        "Whiskey",
        "Hot Pepper"
    ],
    "title": "Roast Wild Turkey with Blue Cornbread-Shrimp Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/roast-wild-turkey-with-blue-cornbread-shrimp-stuffing-104162"
}
