{
    "directions": [
        "Bring rhubarb, orange juice, honey, and ginger to a simmer in a small saucepan over medium-low heat. Cook, stirring occasionally, until rhubarb is soft but not falling apart, about 5 minutes. Drain over a small bowl. Reserve cooking liquid and rhubarb separately; let cool.",
        "Mix rhubarb and butter in a small bowl until smooth; season with salt and pepper. Set aside 1 tablespoon rhubarb butter for vegetables.",
        "Preheat oven to 400°F. Place chicken, skin side up, on a rimmed baking sheet. Gently slide your fingers underneath skin to loosen and rub flesh all over with remaining rhubarb butter (try not to tear skin). Drizzle chicken with 1 tablespoon oil and some of the reserved rhubarb cooking liquid, scatter thyme over, and season with salt and pepper.",
        "Roast chicken until skin is browned and crisp and meat is cooked through (juices will run clear and an instant-read thermometer inserted into the thickest part of a thigh should register 165°F), 40–50 minutes. Let rest 10 minutes.",
        "Meanwhile, prepare grill for mediumhigh heat (or heat a grill pan over medium-high). Toss asparagus in a large bowl with remaining 1 tablespoon oil; season with salt and pepper. Grill asparagus and lemons (cut side down), turning asparagus often, until stalks are just tender, 2–3 minutes. Let lemon halves cool.",
        "Toss asparagus with reserved rhubarb butter. Serve chicken and asparagus with any pan juices drizzled over with grilled lemons for squeezing over."
    ],
    "ingredients": [
        "1 large rhubarb stalk, cut into 1/2\" pieces",
        "1/4 cup fresh orange juice",
        "2 tablespoons honey",
        "1 tablespoon finely grated peeled ginger",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "Kosher salt, freshly ground pepper",
        "1 (3 1/2–4-pounds) chicken, backbone removed, chicken patted dry",
        "2 tablespoons olive oil, divided",
        "1 tablespoon fresh thyme leaves",
        "1 bunch asparagus, trimmed",
        "2 lemons, halved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Roast",
        "Low Fat",
        "Kid-Friendly",
        "Dinner",
        "Lemon",
        "Asparagus",
        "Healthy",
        "Low Cholesterol",
        "Rhubarb",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Chicken with Rhubarb Butter and Asparagus",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-rhubarb-butter-and-asparagus-56389535"
}
