{
    "directions": [
        "Put oven rack in middle position and preheat oven to 450°F. Line a large shallow baking pan with foil and oil generously with olive oil.",
        "Cut off stem end of squash, then put cut side down and halve lengthwise. Discard seeds, then cut squash into 1/2-inch-thick slices. Peel if desired with a paring knife and transfer slices to a bowl. Add 1 tablespoon olive oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper and gently toss to coat. Arrange in 1 layer in lined baking pan and roast until golden, about 15 minutes. Remove from oven and turn squash over with a spatula. Add chestnuts to pan in an even layer, then continue to roast until squash is golden and tender, 10 to 15 minutes. Keep warm, covered with foil.",
        "While squash is roasting, cook pancetta in a dry 10-inch heavy skillet over high heat until browned, about 4 minutes total. Transfer pancetta with a slotted spoon to paper towels to drain, reserving fat in skillet.",
        "Reheat pancetta fat over moderately high heat until hot but not smoking, then add cranberries and brown sugar and stir once to combine. Remove from heat and add water, stirring and scraping up brown bits from bottom of skillet.",
        "Transfer cranberry mixture to a medium bowl and whisk in mustard, remaining tablespoon olive oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper.",
        "Toss together chicory, roasted acorn squash, and chestnuts. Just before serving, toss with dressing and sprinkle with pancetta."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil plus additional for greasing",
        "1 2-pound acorn squash",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 cup peeled cooked whole chestnuts (from a 7- to 8-oince jar), cut into thirds",
        "4 (1/4-inch-thick) slices pancetta (6 ounce total), cut into 1/4-inch dice",
        "1/4 cup fresh cranberries, finely chopped",
        "1 tablespoon packed dark brown sugar",
        "1/4 cup water",
        "2 tablespoons whole-grain mustard",
        "3/4 pound chicory (curly endive), trimmed and torn into 2-inch pieces (10 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Vegetable",
        "Side",
        "Roast",
        "Thanksgiving",
        "Wheat/Gluten-Free",
        "Cranberry",
        "Bacon",
        "Fall",
        "Healthy",
        "Chestnut",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Roasted Squash, Chestnut, and Chicory Salad with Cranberry Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-squash-chestnut-and-chicory-salad-with-cranberry-vinaigrette-230967"
}
