{
    "directions": [
        "Preheat the oven to 375°F.",
        "Have an ice bath (a bowl of ice water) ready. Using a vegetable peeler, peel ribbons of carrots from half of the carrots. Place in the ice water to chill (the ribbons will curl after a while in the water).",
        "Place the remaining whole carrots on a baking sheet; drizzle with some olive oil and season with salt and pepper. Roast until the edges start to caramelize, 15 to 20 minutes. Remove from the oven and set aside at room temperature. Lower the oven temperature to 350°F.",
        "Toast the pine nuts in the oven for about 10 minutes or in a small pan on the stove top over medium-low heat, shaking constantly, until brown and fragrant; pour into a bowl to cool and set aside. Toast the cumin seeds in a small sauté pan over medium heat, tossing or stirring constantly until fragrant, and then pour quickly into a mortar and pestle or spice grinder and grind into a powder. Alternatively, use ground cumin.",
        "For the dressing, in a medium bowl, whisk the cumin with the lemon and lime juices, salt, and pepper; slowly whisk in the 1/4 cup olive oil.",
        "Remove the carrot ribbons from the ice water and pat dry with paper towels. Peel, pit, and slice the avocado.",
        "Divide the avocado slices and roasted carrots among 4 salad plates. In a bowl, toss the carrot ribbons and greens in the dressing, and divide among the plates.",
        "Sprinkle a few pine nuts on each salad and serve."
    ],
    "ingredients": [
        "2 bunches (about 10 ounces total) baby carrots in assorted colors, tops trimmed",
        "1/4 cup olive oil, plus more as needed",
        "Salt and freshly ground black pepper",
        "1/4 cup pine nuts",
        "1 teaspoon cumin seeds",
        "2 tablespoons freshly squeezed lemon juice",
        "1 teaspoon freshly squeezed lime juice",
        "1 ripe avocado",
        "2 cups mizuna, watercress, ancho cress, or arugula greens"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Side",
        "Vegetarian",
        "Lunch",
        "Avocado",
        "Carrot",
        "Healthy",
        "Vegan",
        "Cumin",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted and Raw Carrot Salad with Avocado and Toasted Cumin Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-and-raw-carrot-salad-with-avocado-and-toasted-cumin-vinaigrette-51112700"
}
