{
    "directions": [
        "Preheat the oven to 450 degrees F (230 degrees C). Cut the squash into small equal-sized pieces (about 1/2-inch/2 cm). Toss the squash and onion with half the butter, the honey, garlic, rosemary, salt and pepper until well combined. Spread in a single layer on parchment-lined baking sheets. Roast, turning occasionally, for 20 to 25 minutes or until very tender (rotate the baking sheets halfway through cooking). Cool slightly; combine with the cottage cheese, milk, broth and Gorgonzola.",
        "Preheat the oven to 350 degrees F (180 degrees C). Grease a 9 x 13-inch (3 L) casserole dish. Spread one quarter of the cottage cheese mixture evenly into the dish. Cover with an even layer of noodles, trimming to fit. Repeat layers of cheese and noodles twice. Spread the remaining cheese mixture evenly over the noodles.",
        "Cover with foil and bake for 45 minutes. Remove foil and bake, uncovered, for 15 minutes. Meanwhile, toss breadcrumbs with walnuts, parsley and remaining butter; sprinkle the lasagna evenly with breadcrumb mixture. Broil for 3 minutes or until golden brown. Rest for 20 minutes before slicing."
    ],
    "ingredients": [
        "2 pounds peeled butternut squash",
        "1 large sweet onion, chopped",
        "1/4 cup melted Gay Lea Butter, divided",
        "1 tablespoon honey",
        "2 cloves garlic, minced",
        "1 tablespoon chopped fresh rosemary leaves",
        "1/2 teaspoon salt",
        "1/2 teaspoon pepper",
        "4 cups Nordica 1% Cottage Cheese",
        "3/4 cup milk",
        "3/4 cup sodium-reduced chicken broth",
        "1 1/4 cups crumbled Gorgonzola cheese",
        "9 ounces fresh lasagna noodles",
        "1 1/2 cups fresh breadcrumbs",
        "1/2 cup chopped walnuts",
        "1/4 cup chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Butternut Squash Lasagna with Gorgonzola",
    "url": "http://allrecipes.com/recipe/241594/roasted-butternut-squash-lasagna-with/"
}
