{
    "directions": [
        "In a spice grinder, a clean coffee grinder, or a mortar, grind the salt, oregano, rosemary, caraway, cumin, and turmeric to a fine powder. Transfer to a bowl and add the harissa and chopped garlic. Add the olive oil to make a thick paste. Make 8 or 9 deep slits all over the lamb and insert some of the spice paste, rubbing the paste all over the surface of the meat. Cover and let stand for 1 hour at room temperature or, preferably, refrigerate for at least 5 hours or overnight. Bring to room temperature before roasting.",
        "Preheat the oven to 450°F. Place the leg of lamb fat side down in a roasting pan that will hold the onions in one layer. Roast for 20 minutes. Mix the lemon juice and wine in a small bowl. Turn the meat and pour the lemon-wine mixture over it. (If you are roasting the lamb in a clay dish, warm the mixture first, because cold liquid can cause the clay to crack.) Reduce the oven temperature to 375°F and roast for 35 minutes, basting every 10 to 15 minutes with the pan juices. If the pan dries out, add a little more wine.",
        "Transfer the lamb to a plate and add the onions to the pan, tossing them well to coat them with the pan juices. Add the rosemary sprigs or sprinkle with dried rosemary, toss, place the lamb on the onions, and continue roasting, basting often, for another 30 minutes, or until an instant-read thermometer inserted into the thickest part of the meat reads 135°F. Transfer the meat to a heated platter, cover with a double layer of aluminum foil, and set aside. (Leave the oven on.) If the pan juices are watery, transfer most of them to a saucepan and cook briefly to reduce.",
        "Meanwhile, return the pan to the oven and continue baking the onions until tender, with browned edges. Turn the oven to broil. Place the lamb on the onions again and broil for 2 to 3 minutes, or until the surface is deep brown and crackling. Carve the lamb and serve, passing the pan juices in a bowl or sauceboat at the table."
    ],
    "ingredients": [
        "3 tablespoons coarse sea salt",
        "2 teaspoons dried Greek oregano or savory",
        "1 teaspoon chopped fresh rosemary leaves",
        "3 teaspoons caraway seeds",
        "1 teaspoon cumin seeds",
        "1/2 teaspoon ground turmeric",
        "2 tablespoons Harissa or Aleppo or Mara's pepper to taste",
        "1 teaspoon chopped garlic",
        "1/4 cup olive oil",
        "One 5-to 6-pound bone-in leg of lamb",
        "1/4 cup fresh lemon juice",
        "1/3 cup dry white wine, or more if needed",
        "1½ pounds medium or small red onions, peeled and halved or quartered",
        "2 or 3 fresh rosemary sprigs, or 1 tablespoon dried"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Garlic",
        "Herb",
        "Lamb",
        "Olive",
        "Onion",
        "Broil",
        "Roast",
        "Dinner",
        "Lemon",
        "Rosemary",
        "Meat",
        "Spice",
        "Oregano",
        "Caraway",
        "Cumin",
        "Coffee Grinder",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roasted Leg of Lamb with North African Spices, Lemon, and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-leg-of-lamb-with-north-african-spices-lemon-and-onions-355937"
}
