{
    "directions": [
        "Using a long-handled fork char the peppers over an open flame, turning them, for 2 to 3 minutes, or until the skins are blackened. (Or broil the peppers on the rack of a broiler pan under a preheated broiler about 2 inches from the heat, turning them every 5 minutes, for 15 to 25 minutes, or until the skins are blistered and charred.) Transfer the peppers to a bowl and let them steam, covered, until they are cool enough to handle. Keeping the peppers whole, peel them starting at the blossom end, cut off the tops, and discard the seeds and ribs. (Wear rubber gloves when handling chilies.)",
        "In a heavy saucepan cook the shallot, the thyme, and salt and pepper to taste in the butter over moderately low heat, stirring, until the shallot is soft, add the bell peppers and 1 1/2 cups of the broth, and simmer the mixture, covered, for 12 to 15 minutes, or until the peppers are very soft. In a blender purée the soup in batches until it is very smooth, forcing it as it is puréed through a fine sieve set over the pan, cleaned, and whisk in the cream, enough of the additional broth to reach the desired consistency, the lemon juice, and salt and pepper to taste. The soup may be made 1 day in advance, kept covered and chilled, and reheated.",
        "Spread the tomatoes, skin side down, in one layer in 2 foil-lined jelly-roll pans, add the garlic to 1 of the pans, and bake the tomatoes and the garlic in a preheated 350°F. oven for 45 minutes to 1 hour, or until the tomatoes are very soft and their skin is dark brown. Let the tomatoes and the garlic cool in the pans on racks. In a heavy saucepan cook the shallot, the orégano, salt and pepper to taste in the butter over moderately low heat, stirring, until the shallot is soft, add the tomatoes, the garlic (skins discarded), and 1 1/2 cups of the broth, and simmer the mixture, covered, for 15 minutes. In a blender purée the soup in batches until it is very smooth, forcing it as it is puréed through a fine sieve set over the pan, cleaned, and whisk in the cream, the additional broth if necessary (both soups should have the same consistency), the lemon juice, and salt and pepper to taste. The soup may be made 1 day in advance, kept covered and chilled, and reheated.",
        "In a blender blend together the chilies, the garlic paste, and the créme fraîche until the mixture is combined well. (Be careful not to overblend the mixture or the cream may curdle.) Force the mixture through a fine sieve set over a small bowl. The serrano cream may be made 1 day in advance, kept covered and chilled, and brought to room temperature before serving.",
        "For each serving ladle 1/2 cup of each soup into 2 glass measuring cups, pour the soups simultaneously into a shallow soup bowl from opposite sides of the bowl, and drizzle some of the serrano cream over each serving."
    ],
    "ingredients": [
        "3 tablespoons finely chopped shallot",
        "1/2 teaspoon dried thyme, crumbled",
        "1 tablespoon unsalted butter",
        "6 yellow bell peppers, roasted (procedure follows) and chopped coarse (about 6 cups)",
        "1 1/2 cups low-salt chicken broth plus additional to thin the soup",
        "1/4 cup heavy cream",
        "fresh lemon juice to taste",
        "3 pounds plum tomatoes, quartered lengthwise",
        "3 unpeeled large garlic cloves",
        "3 tablespoons finely chopped shallot",
        "1/2 teaspoon dried oregano, crumbled",
        "1 tablespoon unsalted butter",
        "1 1/2 cups low-salt chicken broth plus additional to thin the soup",
        "1/4 cup heavy cream",
        "fresh lemon juice to taste",
        "3 fresh serrano chilies or jalapeños, seeded and chopped fine (wear rubber gloves)",
        "1 large garlic clove, minced and mashed to a paste with 1/2 teaspoon salt",
        "1/2 cup crème fraîche or sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Garlic",
        "Tomato",
        "Side",
        "Roast",
        "Lunch",
        "Bell Pepper",
        "Winter",
        "Jalapeño",
        "Sour Cream",
        "Shallot",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roasted Yellow Pepper Soup and Roasted Tomato Soup with Serrano Cream",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-yellow-pepper-soup-and-roasted-tomato-soup-with-serrano-cream-11554"
}
