{
    "directions": [
        "Preheat oven to 375°F.",
        "Rinse capon inside and out and discard any excess fat from cavity. Pat capon dry and season cavity with salt and pepper. Put in a large roasting pan and let stand at room temperature 20 minutes.",
        "While capon is standing, stir together butter, zest, thyme, salt, and pepper in a small bowl.",
        "Turn capon so neck cavity is nearest you. To loosen breast skin, lift neck flap and work your fingers gently between skin and flesh, being careful not to tear skin. Slide your fingers down breast and along both sides all the way to thighs. Put half of butter mixture evenly under skin of each breast, then rub outside of capon to distribute evenly.",
        "Place 6 lemon wedges in cavity of bird and tie legs together with string.",
        "Roast capon in middle of oven, basting with pan juices every 30 minutes, 1 1/2 hours. Skim most of fat from pan, then add remaining 10 lemon wedges to pan, tossing with pan juices. Continue roasting capon, basting every 15 minutes, until thermometer inserted 2 inches into fleshy part of a thigh (do not touch bone) registers 170°F, about 45 minutes more.",
        "Tilt capon in pan to pour out juices in cavity, then transfer capon and lemon wedges to a carving platter and let stand 20 to 30 minutes before carving. Do not clean pan.",
        "Skim fat from pan juices and straddle roasting pan across 2 burners. Add water and jelly and deglaze pan by boiling over moderately high heat, stirring and scraping up brown bits, 1 minute. Continue to boil, stirring occasionally, until reduced to about 1 cup, about 5 minutes. Season sauce with salt and pepper, then pour through a fine-mesh sieve into a bowl.",
        "Carve capon and serve with sauce."
    ],
    "ingredients": [
        "1 (8-lb) capon or roasting chicken",
        "3/4 stick (6 tablespoons) unsalted butter, softened",
        "1 tablespoon finely grated fresh lemon zest",
        "1 teaspoon chopped fresh thyme",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "4 whole lemons, quartered lengthwise",
        "1 cup water",
        "2 teaspoons red-currant jelly",
        "Special equipment: kitchen string; an instant-read thermometer",
        "Garnish: fresh flat-leaf parsley and thyme sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Roast",
        "Lemon",
        "Winter",
        "Thyme",
        "Jam or Jelly",
        "Gourmet"
    ],
    "title": "Roast Capon with Lemon and Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/roast-capon-with-lemon-and-thyme-107968"
}
