{
    "directions": [
        "Preheat the oven to 325 degrees F. If you are short on time, you can cook the pork at temperatures up to 350 degrees F; however, slower and lower cooking results in more tender and juicy meat.",
        "To prepare the pork for cooking, set the pork on a baking sheet and score the skin into a criss-cross pattern. Be sure to only score the fat and not deep enough to cut into the meat. Scoring exposes more fat to the heat, which results in more fat being rendered during cooking.",
        "Bring the vinegar, sugar and 5 cups water to a boil in a saucepan; then add the baking soda and bring back up to a boil. Carefully pour the boiling liquid over the skin of the roast. Pat the skin dry and discard the liquid. Next, rub the grapeseed and olive oils all over the pork; then rub the pork with the rosemary and thyme. Sprinkle with salt and pepper.",
        "Place the pork in a roasting pan and transfer to the oven. Cook, uncovered, until the internal temperature reaches 145 degrees F, about 1 1/2 hours.",
        "When done, remove the pork from the pan and transfer it to a rack set over a baking sheet. Cover with vented foil and let rest for at least 15 minutes (the internal temp will increase by at least 5 or 10 degrees)."
    ],
    "ingredients": [
        "1 four-rib pork roast (approximately 3 pounds)",
        "3 tablespoons white vinegar",
        "2 tablespoons sugar",
        "1 1/2 tablespoons baking soda",
        "2 tablespoons grapeseed oil",
        "2 tablespoons olive oil",
        "2 tablespoons chopped fresh rosemary",
        "2 tablespoons chopped fresh thyme",
        "Sea salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pork Roast",
        "Meat",
        "Pork",
        "Roast Recipes",
        "Main Dish Recipes",
        "Roasting"
    ],
    "title": "Roasted Rack of Pork",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/roasted-rack-of-pork"
}
