{
    "directions": [
        "In a heavy saucepan melt butter over low heat. Remove pan from heat and let butter stand 3 minutes. Skim froth and strain butter through a sieve lined with a double thickness of rinsed and squeezed cheesecloth into a bowl, leaving milky solids in bottom of pan. Pour clarified butter into a jar or crock and chill, covered. Butter keeps, covered and chilled, indefinitely. When clarified, butter loses about one fourth its original volume.",
        "Preheat oven to 475°F.",
        "In a large bowl of water soak leeks 10 minutes, agitating occasionally to dislodge any sand and letting sand sink to bottom of bowl. Lift leeks out of water with a slotted spoon and drain on paper towels.",
        "Peel potatoes and trim if necessary to match diameter of leeks. Cut potatoes crosswise into 1/4-inch-thick slices. In a saucepan of boiling water blanch potatoes 5 minutes and drain.",
        "Cut half of garlic clove into several slivers and finely chop remaining half. Cut half of gingerroot into several slivers and finely chop remaining half. With a paring knife make several shallow slits in monkfish and insert a sliver of garlic and gingerroot into each.",
        "Heat a flameproof roasting pan, 13 by 9 by 2 inches, in oven 10 minutes. In heated pan toss together leeks, potatoes, mushrooms, chopped garlic and ginger, salt and pepper to taste, and 2 tablespoons clarified butter. Roast vegetables in middle of oven 15 minutes.",
        "Heat a 12-inch non-stick skillet over moderately high heat. Pat fish dry and season with white pepper and salt. Add remaining tablespoon butter to skillet and brown fish about 2 minutes on each side. With a slotted spatula transfer fish to a plate. To skillet add Port and soy sauce and on top of stove deglaze over moderately high heat, scraping up any brown bits, 30 seconds. Pour liquid over roasted vegetables, tossing to coat, and arrange fish on top. Roast fish and vegetables in middle of oven 15 to 18 minutes, or until fish is just cooked through (fish will be firm rather than flaky).",
        "Garnish fish with chives. Cut fish crosswise into slices and serve with vegetables."
    ],
    "ingredients": [
        "4 medium leeks (about 1 pound, white and pale green parts only), cut crosswise into 1/4-inch-thick slices",
        "3 small boiling potatoes (about 3/4 pound total)",
        "1 large garlic clove",
        "a 1-inch piece peeled fresh gingerroot",
        "a 1 3/4-pound piece monkfish fillet cut in half crosswise or two smaller fillets (1 3/4 pounds total), any membrane and any dark meat cut away",
        "1/2 pound fresh chanterelle mushrooms*, cleaned with a pastry brush or a dampened kitchen towel, stem ends trimmed and large mushrooms halved",
        "3 tablespoons warm clarified butter (recipe follows)",
        "freshly ground white pepper",
        "2 tablespoons Tawny Port",
        "1 tablespoon soy sauce",
        "Garnish: fresh chives, cut into 1-inch pieces",
        "unsalted butter, cut into 1-inch pieces",
        "*available at specialty produce shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Ginger",
        "Mushroom",
        "Onion",
        "Roast",
        "Dinner",
        "Leek",
        "Port",
        "Winter",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Roasted Monkfish with Chanterelles, Leeks, and Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-monkfish-with-chanterelles-leeks-and-ginger-13631"
}
