{
    "directions": [
        "Combine first 5 ingredients and reserved neck, heart, and gizzard in saucepan. Simmer over medium heat. Simmer until giblet broth is reduced to 3 3/4 cups, about 1 hour. Strain; discard solids. Chill 3/4 cup broth for Bread Dressing with Dried Apricots, Pistachios, and Mint .",
        "Position rack in bottom third of oven and preheat to 400°F. Rinse turkey inside and out and pat dry. Whisk orange juice and next 4 ingredients in small bowl to blend for glaze. Place turkey on rack in heavy large roasting pan. Starting at neck end, carefully slide hand between skin and breast, thighs, and legs to loosen skin. Using pastry brush or hand, apply thin coat of pomegranate glaze over meat under skin. Stuff main cavity with lemon, quartered onion, and mint. Tuck wing tips under; tie legs together loosely. Brush turkey with some of remaining glaze.",
        "Roast turkey 20 minutes. Pour 1 cup giblet broth into pan; brush turkey with glaze. Roast 20 minutes; brush with glaze. Roast 20 minutes. Add 1 cup broth to pan, brush with glaze, and cover turkey loosely with foil. Roast 20 minutes. Brush with glaze and reduce oven temperature to 325°F. Continue to roast until thermometer inserted into thickest part of thigh registers 175°F, brushing with glaze every 20 minutes, about 1 hour 10 minutes longer, about 2 1/2 hours total.",
        "Transfer turkey to platter. Tent loosely with foil. Let stand 30 minutes (internal temperature will increase 5 to 10 degrees).",
        "Meanwhile, tilt roasting pan and spoon fat from surface of juices. Add 1 cup giblet broth to pan. Place pan over 2 burners. Bring to simmer over medium-high heat, scraping up browned bits. Add chilled butter and simmer until gravy is smooth, whisking. Season with salt and pepper. Serve turkey with gravy.",
        "*A thick pomegranate syrup available at Middle Eastern markets, some supermarkets, and by mail from Adriana's Caravan (adrianascaravan.com). Do not use cane sugar molasses."
    ],
    "ingredients": [
        "6 cups water",
        "1 celery stalk, cut into 2-inch pieces",
        "1 carrot, peeled, cut into 2-inch pieces",
        "1 onion, coarsely chopped",
        "4 fresh parsley sprigs",
        "1 11- to 12-pound turkey; neck, heart, and gizzard reserved",
        "1 cup orange juice",
        "1/2 cup pomegranate molasses*",
        "2 tablespoons extra-virgin olive oil",
        "1 tablespoon coarse kosher salt",
        "1 teaspoon dried crushed red pepper",
        "1 lemon, quartered",
        "1 onion, quartered",
        "10 fresh mint sprigs",
        "3 tablespoons chilled unsalted butter, cut into 1/2-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Orange",
        "Mint",
        "Fall",
        "Pomegranate"
    ],
    "title": "Roast Turkey with Pomegranate Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-pomegranate-glaze-108821"
}
