{
    "directions": [
        "Cut leek crosswise into 1/2-inch slices and in a bowl soak in water to cover, agitating occasionally to dislodge any sand, 5 minutes. Lift leek out of water and drain in a colander.",
        "Trim any fat from pork. Season pork with salt and pepper and pat with 1 tablespoon chopped parsley. In a 10-inch oven-proof non-stick or cast-iron skillet heat butter or oil over moderately high heat until hot but not smoking and brown pork loin, turning it. Transfer pork to a plate.",
        "Preheat oven to 425°F.",
        "In fat remaining in skillet cook mushrooms and leek with salt over moderately high heat, stirring occasionally, until liquid mushrooms give off is evaporated, about 5 minutes. Add wine and broth and bring to a boil. Put pork on vegetables in skillet and roast in middle of oven 40 minutes, or until a thermometer inserted in center of pork registers 160°F.",
        "Transfer pork to a cutting board and let stand 10 minutes. If vegetable compote is too liquid, cook over high heat, stirring occasionally, until almost all liquid is evaporated. Stir remaining teaspoon chopped parsley into compote.",
        "Slice pork thin and serve, garnished with parsley, with compote."
    ],
    "ingredients": [
        "1 large leek (white and pale green parts only)",
        "a 1-pound center-cut boneless pork loin",
        "1 tablespoon plus 1 teaspoon chopped fresh parsley leaves",
        "1 teaspoon unsalted butter or olive oil",
        "1/2 pound fresh shiitake mushrooms, stems discarded and caps cut into 1/2-inch slices",
        "1/2 teaspoon salt",
        "1/2 cup dry red wine",
        "1/2 cup beef broth",
        "Garnish: fresh parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Roast",
        "Sauté",
        "Low Cal",
        "Pork Tenderloin",
        "Leek",
        "Red Wine",
        "Winter",
        "Healthy",
        "Gourmet"
    ],
    "title": "Roast Pork Loin with Shiitake and Leek Compote",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-loin-with-shiitake-and-leek-compote-10016"
}
