{
    "directions": [
        "Preheat an oven to 425 degrees F (220 degrees C).",
        "In a 9x13 inch baking dish, toss tomatoes, mushrooms, garlic, and olive oil with salt and pepper to taste.  Mix lightly with hands to coat all ingredients with oil, and spread the tomato-mushroom mixture to the edges of the dish, leaving the center free for the pork chops.",
        "Combine 1 teaspoon salt, 1/2 teaspoon black pepper, cumin, ground coriander, oregano, marjoram, thyme, rosemary, sage, basil, garlic powder, onion powder, ground paprika, sugar, and crushed red pepper in a bowl to make a spice rub.",
        "Sprinkle the pork chops with the spice rub, working the rub well into both sides of the meat.  Place pork chops in the center of the baking dish, surrounded by the tomato and mushroom mixture.",
        "Roast in preheated oven until the pork is no longer pink in the center and mushrooms are tender, about 45 to 50 minutes. An instant-read thermometer inserted into the center of a chop should read 145 degrees F (63 degrees C). Transfer pork chops to a serving dish and top with roasted tomato-mushroom mixture and all pan juices to serve."
    ],
    "ingredients": [
        "1 pound roma tomatoes, quartered",
        "1 pound sliced button mushrooms",
        "5 cloves garlic, chopped",
        "2 tablespoons extra virgin olive oil",
        "salt and pepper to taste",
        "Spice Rub",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon ground coriander",
        "1/4 teaspoon dried oregano leaves",
        "1/4 teaspoon dried marjoram leaves",
        "1/4 teaspoon dried thyme leaves",
        "1/4 teaspoon dried rosemary, crushed",
        "1/4 teaspoon dried sage leaves, crushed",
        "1/4 teaspoon dried basil leaves",
        "1/4 teaspoon garlic powder",
        "1/4 teaspoon onion powder",
        "1/4 teaspoon ground paprika",
        "1/4 teaspoon white sugar",
        "1/4 teaspoon crushed red pepper",
        "2 1/4 pounds pork chops"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Pork Chops with Tomatoes, Mushrooms, and Garlic Sauce",
    "url": "http://allrecipes.com/recipe/168201/roasted-pork-chops-with-tomatoes-mus/"
}
