{
    "directions": [
        "Preheat oven to 400°F. Cook potatoes in large saucepan of lightly salted water until almost tender, about 7 minutes. Drain.",
        "Meanwhile, place chicken thighs on large heavy-duty rimmed baking sheet. Sprinkle chicken generously with salt; drizzle with 1 tablespoon lime juice and set aside. Whisk 1 tablespoon lime juice, orange juice, chili powder, both paprikas, grated orange peel, ground cumin, dried oregano, and 1/2 teaspoon salt in small bowl. Rub chili mixture all over chicken. Arrange potato wedges on baking sheet, nestling around chicken. Drizzle olive oil over chicken and potatoes. Bake chicken and potatoes 20 minutes. Increase oven temperature to 425°F. Turn chicken and potato wedges; spoon juices over. Bake 10 minutes longer. Add chicken broth, 1 tablespoon chopped cilantro, and chopped parsley, stirring to scrape up any chili bits at bottom of baking sheet. Turn chicken over. Bake until chicken is cooked through and beginning to brown in spots, about 10 minutes longer.",
        "Carefully transfer chicken and potatoes to platter, keeping potatoes intact. Place baking sheet over 2 stovetop burners. Boil sauce until reduced to 1 cup, about 3 minutes. Mix in olives. Season sauce to taste with salt and pepper and additional lime juice, if desired. Pour sauce over chicken and potatoes; top with remaining tablespoon cilantro and serve."
    ],
    "ingredients": [
        "1 pound Yukon Gold potatoes, peeled, cut into 3/4-inch-wide wedges",
        "8 large skinless chicken thighs with bones",
        "2 tablespoons (or more) fresh lime juice, divided",
        "1/3 cup fresh orange juice",
        "3 tablespoons chili powder",
        "1 tablespoon paprika",
        "1 tablespoon smoked paprika",
        "2 teaspoons finely grated orange peel",
        "1 teaspoon ground cumin",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon salt",
        "2 tablespoons extra-virgin olive oil",
        "1 cup low-salt chicken broth",
        "2 tablespoons coarsely chopped fresh cilantro, divided",
        "1 tablespoon coarsely chopped fresh parsley",
        "50 olives (preferably mixed colors and sizes)",
        "Ingredient info: Smoked paprika is available at many supermarkets, at specialty foods stores, and from latienda.com.",
        "A heavy-duty rimmed baking sheet, a.k.a. half sheet pan or jelly roll pan (12x17 inches), is ideal for roasting the chicken thighs and lots of other foods. The low rim allows for efficient roasting, and this sturdy pan won't buckle at high heat.Try Chicago Metallic's large jelly roll pan ($16 at target.com)."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Olive",
        "Potato",
        "Roast",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Fall",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roasted Chili-Citrus Chicken Thighs with Mixed Olives and Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-chili-citrus-chicken-thighs-with-mixed-olives-and-potatoes-361192"
}
