{
    "directions": [
        "Preheat oven to 425°F.",
        "In a heavy skillet cook bread crumbs in 1 tablespoon oil with salt and pepper to taste over moderate heat, stirring, until golden brown. Transfer bread crumbs to a bowl and toss well with horseradish.",
        "Pat pork dry and season with salt and pepper. In skillet heat remaining tablespoon oil over moderately high heat until hot but not smoking and brown pork on all sides, about 5 minutes. Transfer pork to a shallow baking pan and coat top and sides evenly with mustard. Press bread crumb mixture evenly onto mustard and roast pork in middle of oven until a meat thermometer inserted in center registers 155°F. for slightly pink meat (if bread crumbs begin to get too browned arrange a sheet of foil loosely over pork), 25 to 30 minutes. Transfer pork to a cutting board and let stand 5 minutes.",
        "Cut pork into 1/4-inch-thick slices and serve with cabbage and onions.",
        "In a large heavy skillet heat oil over moderate heat until hot but not smoking and cook cabbage and onion, stirring, 10 minutes, or until just tender. Stir in water, vinegar, sugar, and salt and pepper to taste and simmer, stirring occasionally, until almost all liquid is evaporated and vegetables are tender, about 15 minutes. Serves 2."
    ],
    "ingredients": [
        "1 cup fresh bread crumbs (about 2 slices)",
        "2 tablespoons olive oil",
        "2 tablespoons drained bottled horseradish, or to taste",
        "a 1-pound piece boneless pork loin",
        "1 1/2 tablespoons Dijon mustard",
        "Accompaniment if desired:",
        "2 tablespoons vegetable oil",
        "3/4 pound red cabbage, sliced thin (about 6 cups)",
        "1 medium red onion, sliced thin",
        "1/4 cup water",
        "1/2 cup balsamic vinegar",
        "1 tablespoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Onion",
        "Pork",
        "Roast",
        "Sauté",
        "Quick & Easy",
        "Horseradish",
        "Vinegar",
        "Spring",
        "Cabbage",
        "Simmer",
        "Gourmet"
    ],
    "title": "Roast Pork Loin in Horseradish Crust",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-loin-in-horseradish-crust-11806"
}
