{
    "directions": [
        "Position rack in center of oven and preheat to 400°F. Boil wine in medium saucepan until reduced to 1 cup, about 5 minutes. Remove from heat and reserve.",
        "Generously brush 18x12x1-inch baking sheet with olive oil. Arrange fennel slices in single layer on prepared baking sheet. Top with onion slices in single layer. Sprinkle with salt and freshly ground black pepper. Drizzle 4 tablespoons oil over vegetables.",
        "Rinse fish inside and out; pat dry with paper towels. Sprinkle fish inside and out with salt and freshly ground black pepper. Lightly dust outside of fish with flour. Pour enough olive oil into extra-large skillet to reach depth of 1/4 inch; heat over medium-high heat until oil is very hot. Working with 1 fish at a time, add fish to skillet and fry until golden crust forms on skin, about 3 minutes per side. Carefully place fish atop vegetables on baking sheet. Gently stuff cavity of each fish with 2 crushed garlic cloves, then 1/4 cup chopped parsley. Pour reserved wine over vegetables on baking sheet.",
        "Roast fish uncovered until vegetables begin to soften, 35 to 40 minutes. Scatter tomato halves and olives around fish; bake until fish is just cooked through, about 15 minutes longer. Transfer fish to large platter; cover with foil to keep warm. Increase oven temperature to 475°F. Continue to bake vegetables uncovered until tender and tomatoes are very soft and beginning to color in spots, about 15 minutes longer.",
        "Arrange vegetable mixture around fish on platter. Drizzle with 2 tablespoons oil. Sprinkle chopped fennel fronds over fish and serve."
    ],
    "ingredients": [
        "2 cups dry white wine",
        "1 cup (about) extra-virgin olive oil",
        "2 large fresh fennel bulbs with fronds attached, trimmed; bulbs quartered lengthwise, then thinly sliced; fronds chopped and reserved for garnish",
        "1 large red onion, halved lengthwise through root end, thinly sliced (about 3 cups)",
        "3 1 1/4- to 1 1/2-pound whole striped bass, cleaned, gutted, scaled",
        "1/4 cup (about) all purpose flour",
        "6 large garlic cloves, peeled, crushed, divided",
        "3/4 cup chopped fresh Italian parsley, divided",
        "1 pound cherry tomatoes, halved",
        "1/2 cup oil-cured black olives, pitted, halved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Tomato",
        "Roast",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Bass",
        "Fennel",
        "Healthy",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted Striped Bass with Fennel, Tomatoes, and Oil-Cured Olives",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-striped-bass-with-fennel-tomatoes-and-oil-cured-olives-358535"
}
