{
    "directions": [
        "Preheat oven to 400°F.",
        "Coarsely crush coriander seeds with a mortar and pestle or an electric coffee/spice grinder, then stir together with bread crumbs, oil, pepper, and salt in a small bowl.",
        "Turn pork so a long side is closest to you and season with salt and pepper. Pat one third of seasoned crumbs onto pork, leaving a 2-inch border along top edge. Starting with side nearest you, roll meat into a cylinder and tie securely with kitchen string. Coat pork with remaining crumbs.",
        "Roast pork on a rack in a roasting pan in middle of oven 15 minutes. Reduce temperature to 325°F and roast until an instant-read thermometer diagonally inserted at least 2 inches into meat registers 155°F, 1 to 1 1/4 hours more. Let pork stand, loosely covered, 10 minutes.",
        "Simmer bell pepper, caribe, honey, lime juice, and salt in a 1-quart heavy saucepan over moderate heat, stirring occasionally, until sauce is slightly thickened, about 30 minutes. Cool sauce to warm or room temperature, then stir in cilantro just before serving.",
        "Slice pork and serve with sauce."
    ],
    "ingredients": [
        "1/3 cup coriander seeds",
        "1 1/2 cups fine dry bread crumbs",
        "1/2 cup extra-virgin olive oil",
        "1 teaspoon cracked black pepper",
        "3/4 teaspoon salt",
        "3 lb center-cut boneless pork loin roast, butterflied",
        "1 red bell pepper, cut into 1/2-inch pieces",
        "1/2 cup caribe* (crushed New Mexico red chiles)",
        "1 cup honey",
        "1/2 cup fresh lime juice",
        "1 teaspoon salt",
        "1/4 cup chopped fresh cilantro",
        "Special equipment: kitchen string",
        "*Available at specialty foods shops or by mail order from The Chile Shop (505-983-6080)."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Lime",
        "Pork Tenderloin",
        "Spice",
        "Bell Pepper",
        "Honey",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Roast Pork with Sweet-and-Sour Chile Cilantro Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-with-sweet-and-sour-chile-cilantro-sauce-105024"
}
