{
    "directions": [
        "Preheat oven to 350°F. Using long slender knife, carve out 3/4-inch-diameter horizontal tunnel through center of pork. Chop carved-out meat and reserve. Using handle of wooden spoon, firmly pack apricots and prunes into tunnel of roast. Place roast on rack in roasting pan; rub with 1 tablespoon oil. Sprinkle roast with 1/2 teaspoon marjoram, salt, and pepper. Scatter onion, carrots, garlic cloves, and chopped meat around rack in pan. Drizzle vegetables with 1 tablespoon oil; sprinkle with 1 teaspoon marjoram. Roast pork until instant-read thermometer inserted into thickest part of meat (not stuffing) registers 150°F, stirring vegetables occasionally, about 1 hour 25 minutes. Transfer pork to cutting board; tent with foil to keep warm.",
        "Whisk butter, flour, and both mustards in small bowl to blend. Add broth and wine to roasting pan; place on 2 burners and simmer juices over medium heat until mixture is reduced to 1 1/2 cups, scraping up browned bits, about 3 minutes. Strain liquid into small saucepan; skim fat from surface. Bring liquid to boil. Whisk in mustard mixture; simmer until sauce thickens slightly, whisking frequently, about 3 minutes. Season with salt and pepper.",
        "Cut pork between ribs into chops. Serve with sauce.",
        "Prinz von Hessen 2001 Riesling Kabinett Winkeler Hasensprung."
    ],
    "ingredients": [
        "1 4-bone center-cut pork rib roast, bones frenched, roast well trimmed (about 2 pounds)",
        "8 whole dried apricots",
        "8 whole pitted prunes",
        "2 tablespoons corn oil",
        "1 1/2 teaspoons dried marjoram",
        "1 onion, coarsely chopped",
        "2 large carrots, coarsely chopped",
        "6 garlic cloves, peeled",
        "1 1/2 tablespoons butter, room temperature",
        "1 1/2 tablespoons all purpose flour",
        "1 tablespoon Dijon mustard",
        "1 tablespoon coarse-grained Dijon mustard",
        "1 1/2 cups low-salt chicken broth",
        "1/2 cup dry white wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Pork",
        "Roast",
        "Dinner",
        "Dried Fruit",
        "Prune",
        "Apricot",
        "White Wine",
        "Fall",
        "Oktoberfest",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Pork with Fruit Stuffing and Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-with-fruit-stuffing-and-mustard-sauce-107121"
}
