{
    "directions": [
        "Heat oil in heavy large saucepan over medium-high heat. Add neck, heart, and gizzard, then celery and onion; sauté until deep brown, stirring often, about 18 minutes. Add 6 cups water and bring to boil, scraping up browned bits. Reduce heat to medium-low, cover, and simmer 1 1/2 hours. Strain stock into large measuring cup and reserve; discard solids. DO AHEAD Can be made 1 day ahead. Cool slightly, cover, and chill.",
        "Place turkey on rack in large roasting pan. Mix onion, apple, 1/2 teaspoon salt, 1/2 teaspoon pepper, and thyme in bowl. Spoon mixture into main turkey cavity. Tuck wing tips under; tie legs together loosely to hold shape. Rub oil over turkey; sprinkle with 3 teaspoons salt and 1 teaspoon pepper. DO AHEAD Can be made 1 day ahead. Cover with plastic; chill.",
        "Position rack in bottom third of oven and preheat to 400°F. Roast turkey uncovered 45 minutes. Reduce oven temperature to 375°F. Roast turkey 1 hour. Turn pan around; pour 1 cup turkey stock over. Roast until thermometer inserted into thickest part of thigh registers 175°F, about 1 hour longer. Transfer turkey to platter; tent loosely with foil and let stand 30 minutes (internal temperature will rise 5 to 10 degrees). Reserve pan juices for gravy.",
        "Blend butter and flour in small bowl to smooth paste. Tilt roasting pan; spoon off fat from pan juices. Place pan over 2 burners on medium-high heat. Add Port and 1 cup turkey stock; bring to boil, scraping up browned bits. Transfer to large saucepan. Measure 3 cups turkey stock, adding chicken broth if needed. Add to saucepan and bring to boil. Whisk in flour paste. Boil until gravy is thick enough to coat spoon, whisking occasionally, about 15 minutes. Season gravy with salt and pepper."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "Neck, heart, and gizzard reserved from one 13- to 14-pound turkey",
        "2 large celery stalks, coarsely chopped",
        "1 large onion, chopped",
        "6 cups water",
        "1 13- to 14-pound turkey, rinsed, patted dry",
        "1 medium onion, chopped",
        "1 medium McIntosh apple or Golden Delicious apple, quartered, cored, coarsely chopped",
        "3 1/2 teaspoons coarse kosher salt, divided",
        "1 1/2 teaspoons freshly ground black pepper, divided",
        "1/2 teaspoon dried thyme",
        "2 tablespoons olive oil",
        "1/4 cup (1/2 stick) butter, room temperature",
        "1/4 cup unbleached flour",
        "1/2 cup tawny Port",
        "Low-salt chicken broth (if needed)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "turkey",
        "Vegetable",
        "Roast",
        "Sauté",
        "Christmas",
        "Thanksgiving",
        "Dinner",
        "Apple",
        "Port",
        "Fall",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Turkey with Port Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-port-gravy-236500"
}
