{
    "directions": [
        "Place beans in large saucepan. Add enough water to cover by 4 inches. Let stand overnight.",
        "Preheat oven to 350°F. Heat oil in heavy large ovenproof pot over medium-high heat. Sprinkle chicken with salt and pepper. Working in batches, cook chicken until golden brown, about 7 minutes per side. Transfer chicken to large plate. Add pancetta and next 6 ingredients to same pot. Cook until vegetables begin to brown and soften, stirring frequently, about 10 minutes. Add garlic; stir 1 minute. Add tomato paste; stir 2 minutes. Add flour; stir 1 minute. Add wine and simmer 1 minute. Drain beans. Add beans to pot; stir to combine. Add broth; season with salt and pepper. Place rosemary sprig and chicken atop bean mixture.",
        "Cover pot; transfer to oven. Braise until chicken and beans are very tender, about 1 hour. Transfer chicken to plate. Season beans with salt and pepper.",
        "Mix 2 tablespoons finely chopped rosemary, parsley, and lemon peel in small bowl. Divide beans among 6 shallow bowls. Top each with chicken. Sprinkle each with parsley mixture and serve."
    ],
    "ingredients": [
        "2 cups dried cannellini (white kidney beans; about 1 pound)",
        "2 tablespoons olive oil",
        "6 whole chicken leg-thigh pieces",
        "6 ounces pancetta (Italian bacon), chopped",
        "1 leek (white part only), cut into 1/2-inch cubes",
        "1 small onion, cut into 1/2-inch cubes",
        "1 celery stalk, cut into 1/2-inch cubes",
        "1 small carrot, peeled, cut into 1/2-inch cubes",
        "1 small fennel bulb, trimmed, cut into 1/2-inch cubes",
        "1 bay leaf",
        "6 garlic cloves, chopped",
        "2 tablespoons tomato paste",
        "3 tablespoons all purpose flour",
        "1 cup dry white wine",
        "6 cups low-salt chicken broth",
        "1 6-inch-long fresh rosemary sprig plus 2 tablespoons finely chopped rosemary",
        "2 tablespoons chopped fresh parsley",
        "1 tablespoon finely grated lemon peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Chicken",
        "Garlic",
        "Onion",
        "Tomato",
        "Roast",
        "Rosemary",
        "Bacon",
        "Fennel",
        "Leek",
        "White Wine",
        "Winter"
    ],
    "title": "Roast Chicken with White Bean Stew and Pancetta",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-white-bean-stew-and-pancetta-236904"
}
