{
    "directions": [
        "Preheat an oven to 350ºF.",
        "Cut the lemon into quarters. Rub the outside of the chicken with one of the lemon quarters, then discard. In a small bowl, stir together the lemon and orange zests and 1 tablespoon of the grated ginger. Rub this mixture evenly in the cavity. Put the lemon and orange quarters inside the bird. Place the chicken on a rack in a roasting pan. Sprinkle it with salt and pepper. In the now-empty small bowl, combine the melted margarine or olive oil, lemon and orange juices, honey, and the remaining 2 tablespoons ginger. Mix well.",
        "Place the chicken in the oven and roast, basting with the citrus juice mixture at least 4 times during cooking, until the juices run clear when the thigh is pierced with a knife, about 1 hour.",
        "Transfer to a serving platter and let rest for 10 to 15 minutes. Carve the chicken. Garnish with orange sections.",
        "Variation: Use 4 tablespoons pomegranate juice in place of the lemon juice."
    ],
    "ingredients": [
        "1 lemon",
        "1 roasting chicken, about 5 pounds",
        "Grated zest of 1 lemon, then lemon cut into quarters",
        "Grated zest of 1 orange, then orange cut into quarters",
        "3 tablespoons peeled and grated fresh ginger root",
        "Salt and freshly ground black pepper",
        "5 tablespoons margarine, melted, or olive oil",
        "4 tablespoons fresh lemon juice",
        "1/2 cup fresh orange juice",
        "3 tablespoons honey",
        "Orange sections for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Ginger",
        "Rice",
        "Appetizer",
        "Roast",
        "Sauté",
        "Passover",
        "Rosh Hashanah/Yom Kippur",
        "Lemon",
        "Orange",
        "Fall",
        "Kosher",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Chicken with Orange, Lemon, and Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-orange-lemon-and-ginger-15413"
}
