{
    "directions": [
        "Place an oven rack in the bottom third of the oven and preheat oven to 450 degrees F (230 degrees C).",
        "Place potatoes in a large pot and cover with cold water and salt. Bring to a boil; reduce heat to medium and simmer until potatoes are just tender when pierced with a fork, about 12 minutes. Drain.",
        "Return potatoes to the pot; cover with a lid and shake pot vigorously, about 1 minute. Uncover and cool potatoes until easily handled, about 10 minutes. Peel potatoes and cut them crosswise into chunks.",
        "Place bacon in a skillet and cook over medium-high heat, turning occasionally, until most of the fat has melted and bacon is tender, 5 to 7 minutes. Drain bacon slices on paper towels, reserving bacon fat in the skillet.",
        "Brush the bottom of a shallow 10x15-inch baking pan with half of the bacon fat and olive oil. Sprinkle salt and pepper over potatoes and arrange in the baking pan.",
        "Roast potatoes in the preheated oven until golden brown on the bottom, about 30 minutes. Remove potatoes from oven and reduce oven temperature to 375 degrees F (190 degrees C).",
        "Turn potatoes over in baking pan. Top with bacon pieces, Parmigiano-Reggiano cheese, and garlic. Drizzle remaining bacon fat on top.",
        "Return to the preheated oven and continue roasting until Parmigiano-Reggiano cheese is melted, about 15 minutes. Sprinkle with parsley and serve."
    ],
    "ingredients": [
        "3 pounds Yukon Gold potatoes",
        "1 tablespoon salt",
        "6 slices bacon, halved and cut crosswise into 1/2-inch pieces",
        "2 tablespoons olive oil",
        "salt and freshly ground black pepper to taste",
        "1/2 cup grated Parmigiano-Reggiano cheese",
        "2 cloves garlic, finely chopped",
        "1/4 cup fresh Italian flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Potatoes with Bacon, Cheese, and Parsley",
    "url": "http://allrecipes.com/recipe/246569/roasted-potatoes-with-bacon-cheese/"
}
