{
    "directions": [
        "The night before roasting, dissolve salt and sugar in 3 gallons of cold water in a large, clean ice chest or similar container in a cold spot, such as an unheated basement or garage. For those in warm climates, add ice packs to keep turkeys cool. Add turkeys, breast-side down; cover and let stand about 12 hours. (This brining keeps the turkey from drying out and seasons it right down to the bone.) Drain. Rinse turkeys and pat dry.",
        "About five hours before serving, set oven to 425 degrees and adjust oven rack to lower-middle position. Place turkey No. 1 breast-side down and cut out the back with kitchen shears. Open up turkey and turn it breast-side up, pressing on it with your palms so it lies flat. Place turkey, skin-side up, on a lipped cookie sheet over a bed of half the chopped vegetables. Brush turkey with butter.",
        "Roast until a meat thermometer inserted into the thigh registers 175 degrees, 1 to 1 1/2 hours. Watch vegetables and pan drippings throughout - they should be kept dry enough to brown and produce the rich brown goo with which to brush Turkey No. 2 and make a rich gravy, but moist enough to keep from burning. So add water as needed throughout the cooking.",
        "Remove pan from oven and transfer turkey to a cutting board; reserve vegetables and pan juices for Turkey No. 2. Let the bird rest 30 minutes to 1 hour before carving, to allow the meat to firm up. Carve, transferring slices to an ovenproof serving platter or baking pan. Cover with aluminum foil. Refrigerate or set in a cool spot (below 40 degrees) until mealtime. Gently rewarm, covered, on platter or baking pan.",
        "Immediately after removing the first turkey, lower the oven temperature to 400 degrees and adjust oven rack to lowest position. Scrape vegetables and pan drippings from Turkey No. 1 into a roasting pan. Set a V-rack in the pan. Place remaining raw vegetables in the cavity of Turkey No. 2, then tie legs together with kitchen string for a nicer presentation. Set turkey, breast-side down, on rack. Brush with pan drippings from Turkey No. 1.",
        "Roast 1 hour. Remove from oven; baste back and sides with pan drippings. Using two wads of paper towels, carefully turn breast-side up and baste. Keep roasting until a thermometer inserted into the leg registers 175 degrees, 1 to 1 1/2 hours longer. Again, watch vegetables and drippings throughout and add water as needed. Transfer turkey to a platter for display (and then for seconds and leftovers).",
        "For gravy: Set roasting pan over 2 burners on medium-high heat. Add wine and, using a wooden spoon, stir to loosen brown bits. Strain contents of pan through a large strainer into a saucepan. Add broth and bring to a boil. Whisk cornstarch with 1/2 cup water (or 1/2 cup flour with 1 cup water), then gradually whisk into pan juices. Bring to a boil, reduce heat to low and simmer until thickened. Serve immediately."
    ],
    "ingredients": [
        "2 turkeys (10 to 12 pounds each), neck and giblets discarded",
        "3 cups kosher salt (do not use regular table salt)",
        "2 cups granulated sugar",
        "2 unpeeled medium onions, coarsely chopped",
        "2 unpeeled medium carrots, coarsely chopped",
        "2 stalks celery stalks, coarsely chopped",
        "2 tablespoons melted butter",
        "1 cup dry white wine or vermouth",
        "4 cups low-sodium chicken broth",
        "1/4 cup cornstarch"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roast Turkeys With Rich Pan Gravy",
    "url": "http://allrecipes.com/recipe/76953/roast-turkeys-with-rich-pan-gravy/"
}
