{
    "directions": [
        "Preheat oven to 400°F. Place corn on baking sheet. Brush with 1 tablespoon olive oil. Roast corn until tender and brown in spots, turning occasionally, about 40 minutes. Remove corn from oven. Toss mushrooms with chopped thyme and 1 tablespoon oil on large baking sheet. Sprinkle with salt and pepper. Roast mushrooms until tender and beginning to turn golden, stirring once, about 15 minutes.",
        "Cut corn kernels off cobs. Reserve 1/2 cup corn in small bowl. Combine remaining corn and 1/2 cup chicken stock in processor. Blend until almost smooth. Set corn puree aside.",
        "Bring 5 1/4 cups chicken stock to simmer in large pot. Reduce heat to low; keep stock hot.",
        "Heat remaining 2 tablespoons oil in heavy large saucepan over medium heat. Add onion and sauté 2 minutes. Add rice; stir 3 minutes. Add wine; stir until liquid is absorbed, about 2 minutes. Add 1 cup hot stock. Simmer until liquid is absorbed, stirring often. Continue adding stock 1/2 cup at a time until rice is tender but still slightly firm in center and mixture is creamy, simmering until stock is absorbed before each addition and stirring often, about 25 minutes.",
        "Mix corn puree, reserved corn kernerls, half of mushrooms, spinach, 2 tablespoons Parmesan cheese and butter into risotto. Stir in 1/2 cup chicken stock to moisten if necessary. Season to taste with salt and pepper. Remove from heat. Spoon risotto into soup bowls. Top with remaining mushrooms. Sprinkle with chives. Serve, passing additional Parmesan cheese separately."
    ],
    "ingredients": [
        "4 ears corn, husked",
        "4 tablespoons olive oil",
        "2 cups (about 8 ounces) assorted wild mushrooms (such as chanterelle, oyster, and stemmed shiitake), thinly sliced",
        "2 tablespoons chopped fresh thyme or 2 teaspoons dried",
        "5 3/4 cups (about) chicken stock or canned low-salt broth",
        "1 1/4 cups finely chopped onion",
        "1 1/2 cups arborio rice or medium-grain white rice",
        "1/4 cup dry white wine",
        "2 cups stemmed baby spinach",
        "2 tablespoons freshly grated Parmesan cheese",
        "1 tablespoon unsalted butter",
        "2 tablespoons chopped chives or green onion",
        "Additional freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mushroom",
        "Rice",
        "Side",
        "Roast",
        "Sauté",
        "Parmesan",
        "Corn",
        "Spinach",
        "White Wine",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roasted Corn, Wild Mushroom and Spinach Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-corn-wild-mushroom-and-spinach-risotto-4264"
}
