{
    "directions": [
        "Preheat the oven to 500 degrees F.",
        "For the marinade, whisk together the lemon juice, lemon zest, olive oil, mustard, garlic, 1 1/2 tablespoons salt and 1/2 tablespoon pepper in a small bowl and set aside.",
        "Place the salmon on a sheet pan that has been covered in aluminum foil, and drizzle the marinade over the salmon. Allow the salmon to sit for 15 minutes.",
        "Meanwhile, place the potatoes and 2 tablespoons salt in a large pot of water. Bring the water to a boil, then lower the heat and simmer for 10 to 15 minutes, until the potatoes are barely tender when pierced with a knife. Drain the potatoes in a colander, then place the colander with the potatoes over the empty pot off the heat and cover with a clean, dry kitchen towel. Leave the potatoes to steam for 15 to 20 minutes, until tender but firm. When the potatoes are cool enough to handle, slice them in thick slices and set aside.",
        "Place the salmon in the oven and cook for 12 to 15 minutes, or until it is almost cooked through. Remove to a plate and allow it to rest for 15 minutes. Remove the skin and break into large pieces.",
        "Blanch the haricots verts in a large pot of boiling salted water for 1 1/2 minutes only. Drain immediately and immerse in a bowl of ice water. Drain again and set aside.",
        "For the vinaigrette, combine the vinegar, mustard, salt, and pepper. Slowly whisk in the olive oil to make an emulsion. Set aside.",
        "Arrange the salmon, potatoes, haricots verts, tomatoes, eggs, watercress, olives and anchovies, if used, on a large flat platter. Drizzle some vinaigrette over the fish and vegetables and serve the rest in a pitcher on the side."
    ],
    "ingredients": [
        "4 lemons, zested and juiced",
        "1/4 cup olive oil",
        "1/4 cup Dijon mustard",
        "4 garlic cloves, minced",
        "Kosher salt and freshly ground black pepper",
        "6 pounds skin-on fresh salmon fillets",
        "3 pounds small Yukon gold potatoes",
        "1 1/2 pounds haricots verts, stems removed",
        "3 pounds ripe tomatoes, cut into wedges (6 small tomatoes)",
        "12 hard-cooked eggs, peeled and cut in 1/2",
        "1 bunch watercress or arugula",
        "1/2 pound large green olives, pitted",
        "1 can anchovies, optional",
        "1/4 cup champagne vinegar",
        "1 teaspoon Dijon mustard",
        "1 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 cup good olive oil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Roasted Tomato",
        "Roasted Vegetable",
        "Roasting",
        "Tomato",
        "Vegetable",
        "Steamer",
        "Olive Recipes",
        "Beans and Legumes",
        "Egg Recipes",
        "Fish",
        "Salmon",
        "Holiday",
        "Recipes for Parties"
    ],
    "title": "Roasted Salmon Nicoise Platter",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/roasted-salmon-nicoise-platter-recipe"
}
