{
    "directions": [
        "Place onion, garlic, apple cider vinegar, honey, ground allspice, chopped fresh ginger, chopped fresh thyme, salt, ground black pepper, seeded and minced chile, cinnamon, and nutmeg in processor. Purée marinade until coarse paste forms. Place chicken in large resealable plastic bag. Add marinade to chicken in bag and seal. Turn chicken to coat. Refrigerate at least 8 hours or overnight, turning chicken occasionally.",
        "Preheat oven to 400°F. Arrange chicken pieces, with marinade still clinging to chicken, on rimmed baking sheet. Brush chicken with oil. Roast until cooked through, about 45 minutes.",
        "Spray another rimmed baking sheet with nonstick spray. Whisk butter, honey, lime juice, and ground cinnamon in large bowl. Add potato slices; toss to coat. Arrange potato slices in single layer on prepared baking sheet. Sprinkle with salt and pepper. Bake potatoes alongside chicken until tender, about 25 minutes. Serve chicken with potatoes, passing mango chutney separately."
    ],
    "ingredients": [
        "1/2 cup chopped onion",
        "4 garlic cloves, chopped",
        "3 tablespoons apple cider vinegar",
        "2 tablespoons honey",
        "1 tablespoon allspice berries, ground in spice mill or coffee grinder",
        "1 tablespoon chopped peeled fresh ginger",
        "1 1/2 teaspoons finely chopped fresh thyme",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1/2 Scotch bonnet chile or habanero chile, seeded, minced",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "4 whole chicken leg-thigh pieces (about 2 1/4 to 2 1/2 pounds)",
        "2 tablespoons olive oil",
        "Nonstick vegetable oil spray",
        "2 tablespoons (1/4 stick) butter, melted",
        "2 tablespoons honey",
        "1 tablespoon fresh lime juice",
        "1/2 teaspoon ground cinnamon",
        "2 pounds red-skinned sweet potatoes (yams), peeled, cut into 1/3-inch-thick rounds",
        "Mango chutney"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Chicken",
        "Garlic",
        "Marinate",
        "Roast",
        "Hot Pepper",
        "Sweet Potato/Yam",
        "Honey",
        "Cinnamon"
    ],
    "title": "Roasted Spiced Chicken with Cinnamon- and Honey-Glazed Sweet Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-spiced-chicken-with-cinnamon-and-honey-glazed-sweet-potatoes-234808"
}
