{
    "directions": [
        "Sprinkle chicken all over with 2 teaspoons coarse kosher salt. Place chicken, breast side up, on rack set in roasting pan. Refrigerate uncovered overnight.",
        "Place parsley sprigs and 1/2 lemon in chicken cavity. Tie legs together. Place reserved heart and gizzard and garlic cloves under rack in roasting pan. Drizzle 2 teaspoons oil over chicken breast. Let stand at room temperature 30 minutes.",
        "Position 1 rack in bottom third and 1 rack in center of oven; preheat to 400°F. Place broccoli rabe and potatoes in large bowl; sprinkle with salt and pepper. Add 1/4 cup oil; toss to coat. Transfer vegetables to large rimmed baking sheet and spread out in even layer.",
        "Roast chicken on center oven rack 25 minutes. Add 3/4 cup broth to pan with chicken and place potatoes and broccoli on lower oven rack. Roast chicken until instantread thermometer inserted into thickest part of thigh registers 165°F, adding more broth by 1/4 cupfuls if pan is dry, 45 to 55 minutes longer. Let rest 15 minutes.",
        "Continue roasting vegetables until potatoes are tender and slightly browned and broccoli rabe stems are crisp-tender and leaves are crisp but not browned, tossing occasionally, about 10 minutes longer. Season to taste with salt and pepper. Tent with foil to keep warm.",
        "Tilt chicken to allow juices from cavity to pour into roasting pan. Discard heart and gizzard. Strain pan juices into heatproof measuring cup, pressing on solids to force garlic through strainer into cup. Spoon fat from surface of juices. Add wine to pan juices. Return mixture to roasting pan. Stir over medium heat until jus is heated through, scraping up browned bits, about 1 minute. Squeeze enough juice from second lemon half to measure 2 teaspoons; add to jus. Stir in chopped parsley. Season jus to taste with salt and pepper.",
        "Carve chicken; divide among plates. Spoon potatoes and broccoli rabe alongside. Drizzle jus over chicken and serve.",
        "An Italian leafy green vegetable with scattered clusters of tiny broccoli-like florets; available at some supermarkets and at specialty foods stores.",
        "Toasty, fruity Joseph Drouhin 2007 Rully, Burgundy ($21)."
    ],
    "ingredients": [
        "1 4-to 4 1/2-pound chicken, large deposits of fat removed, heart and gizzard reserved",
        "2 teaspoons coarse kosher salt",
        "6 large fresh parsley sprigs",
        "1 lemon, halved",
        "6 garlic cloves, peeled",
        "2 teaspoons plus 1/4 cup extra-virgin olive oil",
        "1 pound broccoli rabe (rapini),* stems cut into 1/4-inch pieces, leaves coarsely chopped",
        "1 pound fingerling potatoes or baby Yukon Gold potatoes, cut into 1/2-inch rounds",
        "3/4 cup (or more) low-salt chicken broth",
        "1/4 cup dry white wine",
        "1/3 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Potato",
        "Marinate",
        "Roast",
        "High Fiber",
        "Dinner",
        "Parsley",
        "Broccoli Rabe",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Chicken with Broccoli Rabe, Fingerling Potatoes, and Garlic-Parsley Jus",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-broccoli-rabe-fingerling-potatoes-and-garlic-parsley-jus-355199"
}
