{
    "directions": [
        "Preheat oven to 450°F.",
        "Quarter potatoes and in a bowl toss with shallots, 1 1/2 teaspoons oil, and salt and pepper to taste. Transfer mixture to a shallow baking pan.",
        "Wrap garlic tightly in foil and put in pan with potatoes.",
        "In a large bowl toss kale with remaining 1 1/2 teaspoons oil and salt and pepper to taste until combined well. Arrange kale in one layer in another shallow baking pan. Roast kale, potato mixture, and garlic in middle and bottom thirds of oven, switching position of pans in oven halfway through roasting and stirring vegetables occasionally, until potato mixture is golden brown and tender, kale is crisp, and garlic is soft, about 15 minutes. Transfer vegetables (except garlic) to a bowl and season with salt and pepper. Carefully remove garlic from foil and peel. In small bowl with a fork mash garlic with vinegar until smooth and season with salt and pepper. Add dressing to vegetables and toss. Potatoes may be made 4 hours ahead.",
        "Serve potatoes hot or at room temperature."
    ],
    "ingredients": [
        "1 pound small red potatoes (preferably about 1 inch in diameter)",
        "1/2 pound shallots, cut lengthwise into eighths (about 1 1/2 cups)",
        "1 tablespoon olive oil",
        "4 large garlic cloves, unpeeled",
        "1/2 pound kale (about 1 small bunch), rinsed and stems and tough ribs discarded",
        "1 teaspoon red-wine vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Potato",
        "Side",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Stuffing/Dressing",
        "Kale",
        "Vegan",
        "Shallot",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roasted Potatoes, Shallots, and Kale with Caramelized Garlic Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-potatoes-shallots-and-kale-with-caramelized-garlic-dressing-13290"
}
