{
    "directions": [
        "Heat small skillet over medium heat. Add cumin seeds and toast until aromatic and slightly darker, stirring occasionally, about 2 minutes. Transfer to processor. Add parsley leaves and next 6 ingredients to processor. Using on/off turns, process until coarse paste forms. With machine running, gradually add 4 tablespoons oil. Transfer 2 tablespoons charmoula to small bowl; whisk in lemon juice and remaining 2 tablespoons oil. Cover and chill to serve with lamb.",
        "Transfer remaining charmoula to large resealable plastic bag. Add lamb chops; seal bag and turn to coat well. Chill at least 4 hours and up to 24 hours.",
        "Let lamb and charmoula sauce in bowl stand at room temperature 1 hour.",
        "Preheat oven to 500°F. Line rimmed baking sheet with foil. Place rack on prepared baking sheet. Place lamb on rack and sprinkle with salt and pepper. Roast until thermometer inserted into center registers 130°F for medium-rare, about 13 minutes. Transfer lamb to platter. Tent with foil and let rest 5 minutes.",
        "Meanwhile, melt butter with 1 tablespoon oil in heavy large skillet over high heat. Add asparagus and sauté until tender, stirring often, about 3 minutes. Add shallot and lemon peel. Sauté 1 minute. Season to taste with salt and pepper.",
        "Place 2 lamb chops on each of 4 plates. Divide asparagus among plates. Drizzle lamb and asparagus with charmoula sauce, passing remaining sauce alongside."
    ],
    "ingredients": [
        "1 tablespoon cumin seeds",
        "1 1/2 cups (lightly packed) fresh Italian parsley leaves",
        "1/2 cup (lightly packed) fresh mint leaves",
        "1/2 cup (lightly packed) fresh cilantro leaves",
        "2 large garlic cloves",
        "1 tablespoon sweet smoked paprika (pimentón dulce)* or sweet Hungarian paprika",
        "1 teaspoon coarse kosher salt",
        "1/4 teaspoon cayenne pepper",
        "6 tablespoons extra-virgin olive oil, divided",
        "1 tablespoon fresh lemon juice",
        "8 (1 1/4- to 1 1/2-inch-thick) lamb loin chops (about 2 2/3 pounds)",
        "1 tablespoon butter",
        "1 tablespoon extra-virgin olive oil",
        "1 1/2 pounds thin asparagus, trimmed, peeled, tops cut into 3-inch-long pieces, stalks cut into 1/2-inch pieces",
        "3 tablespoons chopped shallot",
        "1 teaspoon finely grated lemon peel",
        "*Sometimes labeled sweet pimentón de La Vera; available at some supermarkets, at specialty foods stores, and from tienda.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Garlic",
        "Herb",
        "Lamb",
        "Onion",
        "Vegetable",
        "Freeze/Chill",
        "Marinate",
        "Roast",
        "Sauté",
        "Lamb Chop",
        "Asparagus",
        "Spring"
    ],
    "title": "Roasted Lamb Chops with Charmoula and Skillet Asparagus",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-lamb-chops-with-charmoula-and-skillet-asparagus-237904"
}
