{
    "directions": [
        "Position rack in top third of oven and preheat to 450°F. Spray large heavy baking sheet with nonstick vegetable oil spray. Combine eggplant, peppers, garlic and oil in large bowl. Toss well. Transfer to prepared sheet. Bake until eggplant is brown and vegetables are tender, stirring every 10 minutes, about 50 minutes. Remove garlic and reserve. Scrape vegetables and all pan juices into bowl.",
        "Combine vinegar, cumin, salt, pepper and cayenne in processor. Peel roasted garlic; add to processor. Puree until smooth. Toss vegetable mixture with 1/4 cup garlic dressing. Cool, tossing occasionally. (Can be made 1 day ahead. Cover and chill vegetables and remaining dressing separately. Bring to room temperature.)",
        "Mound salad in center of large platter. Surround with pita wedges. Serve, passing remaining dressing and Sesame Spread separately.",
        "Beat margarine, sesame seeds and salt to blend in small bowl. (Can be prepared 2 days ahead. Cover and refrigerate. Bring to room temperature before serving.)"
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 eggplants (about 2 1/2 pounds total), cut into 3 x 3/4 x 3/4-inch strips",
        "2 large green bell peppers, cut into 1/2-inch wide strips",
        "2 large red bell peppers, cut into 1/2-inch wide strips",
        "8 large garlic cloves (unpeeled)",
        "1/2 cup olive oil",
        "3/4 cup red wine vinegar",
        "1 tablespoon ground cumin",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons pepper",
        "3/8 teaspoon cayenne pepper",
        "8 warm pita bread rounds, cut into wedges",
        "1 cup (2 sticks) unsalted margarine, room temperature",
        "2/3 cup toasted sesame seeds",
        "1 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Food Processor",
        "Vegetable",
        "Side",
        "Bake",
        "Hanukkah",
        "Vegetarian",
        "Lunch",
        "Eggplant",
        "Bell Pepper",
        "Healthy",
        "Vegan",
        "Sesame",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Eggplant and Pepper Salad with Pita Bread and Sesame Spread",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-eggplant-and-pepper-salad-with-pita-bread-and-sesame-spread-1080"
}
