{
    "directions": [
        "Preheat oven to 250°F. Whisk honey, vinegar, and 1/4 teaspoon salt in a medium bowl. Toss peaches in mixture until completely coated. Arrange peaches, cut side down, in a 3-quart. baking dish and pour honey mixture over top. Roast until fruit is just beginning to soften, 20–25 minutes. Turn over and continue to roast, occasionally basting with pan juices, until flesh is soft and gives when gently pressed but fruit still holds its shape, 25–35 minutes more. Let peaches cool in roasting juices.",
        "Meanwhile, using an electric mixer on medium-high speed, beat butter, powdered sugar, and remaining 1/4 teaspoon salt in a small bowl until light and creamy, about 2 minutes. Add ricotta and beat, occasionally scraping down sides of bowl, until no streaks remain, about 1 minute. The finished buttercream will have a slightly coarse texture from the ricotta.",
        "Toss panko, raw sugar, and 2 teaspoons oil in a small skillet over medium heat to combine and cook, stirring and shaking pan often, until panko is golden brown (sugar will caramelize and turn medium amber before all the panko browns), about 3 minutes.",
        "Just before serving, dollop buttercream in the center of each peach where the pit used to be. Spoon pan juices over, drizzle with oil, and scatter panko over buttercream."
    ],
    "ingredients": [
        "1/2 cup honey",
        "1/2 cup white wine vinegar",
        "1/2 teaspoon kosher salt, divided",
        "4 firm but ripe peaches, halved, pitted",
        "6 tablespoons unsalted butter, room temperature",
        "2 tablespoons powdered sugar",
        "3/4 cup ricotta, room temperature",
        "1/4 cup panko (Japanese breadcrumbs)",
        "2 teaspoons raw sugar",
        "2 teaspoons olive oil, plus more for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Kid-Friendly",
        "Ricotta",
        "Peach",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Kosher"
    ],
    "title": "Roasted Peaches with Ricotta Buttercream and Breadcrumbs",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-peaches-with-ricotta-buttercream-and-breadcrumbs-56389716"
}
