{
    "directions": [
        "Heat oil in a large saucepan over medium-high heat. Add carrot, celery, onion, and garlic and cook, stirring often, until softened, 5–8 minutes. Mix in lentils and add broth to cover by 1\". Bring to a boil; reduce heat, cover, and simmer, adding more broth as needed to keep lentils covered, until lentils are tender, 20–30 minutes. Mix in vinegar; season with salt and pepper. Cover and set aside; keep warm.",
        "DO AHEAD: Lentils can be cooked 1 day ahead. Let cool; cover and chill.",
        "Bring shallot, garlic, star anise, bay leaf, peppercorns, verjus, and wine to a boil in a medium saucepan and cook until reduced to 1/4 cup, 15–20 minutes. Strain through a fine-mesh sieve into a small saucepan; discard solids.",
        "Place saucepan over low heat and gradually whisk in butter, until butter is melted and sauce is emulsified. Whisk in tarragon and lemon juice; season with salt and pepper. Cover and set aside; keep warm.",
        "Heat oil in a large nonstick skillet over medium-high heat. Season fish with salt and pepper. Place fish, skin side down, in pan and cook, undisturbed, until skin is crisp and releases from pan, about 4 minutes. Turn fish, add butter to pan, and cook, tilting pan and spooning butter over fish, until opaque throughout, about 2 minutes longer.",
        "Stir parsley into verjus beurre blanc just before serving. Serve fish with lentils and sauce."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 small carrot, peeled, finely chopped",
        "1 celery stalk, finely chopped",
        "1/2 small onion, finely chopped",
        "2 garlic cloves, finely chopped",
        "1 cup black beluga lentils or French green lentils",
        "2–3 cups low-sodium chicken broth",
        "2 teaspoons Sherry vinegar",
        "Kosher salt, freshly ground pepper",
        "1 small shallot, thinly sliced",
        "1 garlic clove, peeled, crushed",
        "1 whole star anise pod",
        "1 bay leaf",
        "6 black peppercorns",
        "1 cup white verjus",
        "1/2 cup dry white wine",
        "1/2 cup (1 stick) chilled unsalted butter, cut into pieces",
        "1 tablespoon chopped fresh tarragon",
        "1 tablespoon fresh lemon juice",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons olive oil",
        "4 6-ounce skin-on steelhead trout or salmon fillets",
        "Kosher salt, freshly ground pepper",
        "1 tablespoon unsalted butter",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "Ingredient info: Verjus is a tart juice made from unripe grapes. Find it at specialty foods stores and online."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Roast",
        "Christmas",
        "Dinner",
        "Seafood",
        "Trout",
        "Lentil",
        "Christmas Eve",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roasted Trout with Lentils and Verjus",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-trout-with-lentils-and-verjus-51204630"
}
