{
    "directions": [
        "Preheat oven to 450°F.",
        "Halve squash lengthwise and seed, then cut crosswise into 1 1/2-inch-wide slices and season with salt. Roast slices, skin side down, in a shallow baking pan in middle of oven until tender and golden, about 50 minutes.",
        "Set aside 6 crescent-shaped squash slices for serving and keep warm. Cut flesh from remaining slices into 1/2-inch pieces, discarding skin.",
        "Bring broth to a simmer and keep at a bare simmer, covered.",
        "Meanwhile, cook onion in butter in a 4-quart heavy pot over moderate heat, stirring, until softened, about 6 minutes. Add rice, garlic, and cumin and cook, stirring, 3 minutes.",
        "Stir in 1/2 cup simmering broth and cook at a strong simmer, stirring frequently, until broth is absorbed. Continue simmering and adding broth 1/2 cup at a time, stirring constantly and letting each addition be absorbed before adding the next, until rice is creamy-looking but still al dente (it should be the consistency of thick soup), about 18 minutes total. (There will be leftover broth.)",
        "Stir in squash pieces, then stir in cheese, salt, sage, and arugula and simmer, stirring, 1 minute. (If necessary, thin risotto with some leftover broth.)",
        "Serve risotto immediately, spooned over reserved squash slices."
    ],
    "ingredients": [
        "3 lb butternut squash",
        "6 cups nonfat chicken broth",
        "1 medium onion, chopped",
        "1 tablespoon unsalted butter",
        "1 1/2 cups Arborio rice (9 oz)",
        "1 teaspoon minced garlic",
        "1/2 teaspoon ground cumin",
        "5 tablespoons finely grated Parmigiano-Reggiano (1/2 oz)",
        "1 teaspoon salt",
        "1 1/2 teaspoons chopped fresh sage",
        "4 oz arugula or baby spinach (6 cups), stems discarded and leaves very coarsely chopped",
        "N/A arugula or baby spinach leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Vegetable",
        "Roast",
        "Low Fat",
        "Parmesan",
        "Arugula",
        "Butternut Squash",
        "Fall",
        "Healthy",
        "Simmer",
        "Gourmet"
    ],
    "title": "Roasted Butternut Squash Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-butternut-squash-risotto-105725"
}
