{
    "directions": [
        "Preheat the oven to 450 degrees F (230 degrees C). Spread garlic all over venison roast, season with salt and pepper, and place in a roasting pan.",
        "Heat butter in a skillet over medium-low heat and cook and stir 1/2 cup onion, cilantro, sage, and basil until onion has softened and turned translucent, about 5 minutes. Spread the butter mixture evenly over the roast.",
        "Roast in the preheated oven for 20 minutes. Add remaining 2 cups onion, orange juice, and cranberries to the roasting pan; reduce oven temperature to 325 degrees F (165 degrees C). Continue to roast, basting frequently, until a meat thermometer inserted into the thickest part reads 140 degrees F for medium rare, about 1 hour. Remove the roast from the pan; cover to keep warm while you prepare the sauce.",
        "Pour beef stock into the roasting pan, and bring to a boil while scraping the browned bits of food off the bottom of the pan with a wooden spoon. Continue boiling until the liquid is reduced by half, about 10 minutes. Skim off any fat; stir in the jelly and sherry. Continue to boil until the sauce is slightly thickened and evenly coats the back of a spoon, about 3 minutes. Season with salt and pepper."
    ],
    "ingredients": [
        "2 tablespoons minced garlic",
        "1 (8 pound) bone-in venison roast",
        "1 pinch kosher salt and freshly ground black pepper to taste",
        "1/2 cup butter",
        "2 1/2 cups finely chopped onion, divided",
        "1/4 cup chopped fresh cilantro",
        "1 1/2 teaspoons dried sage",
        "1 1/2 teaspoons dried basil",
        "2 cups fresh orange juice",
        "6 ounces fresh cranberries",
        "3 cups beef stock",
        "1/2 cup red currant jelly",
        "1/4 cup dry sherry (such as Oloroso)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Venison with Fresh Cranberry Sauce",
    "url": "http://allrecipes.com/recipe/233440/roasted-venison-with-fresh-cranberry/"
}
