{
    "directions": [
        "In a food processor purée the plums, the garlic paste, the oil, the soy sauce, the orange juice, the vinegar, the sugar, the jalapeño, the gingerroot, the mustard, and black pepper to taste until the mixture is smooth. In a large saucepan bring the marinade to a boil, simmer it, stirring occasionally, for 10 minutes, or until it is reduced to about 2 cups, and let it cool.",
        "In a large shallow dish arrange the chicken, pricked in several places with a fork, in one layer, pour the marinade over it, reserving 1/4 cup for the salsa, and let the chicken marinate, covered and chilled, turning it once, for at least 1 hour or, preferably, overnight. Transfer the chicken to an oiled rack set over a foil-lined roasting pan, spoon the marinade over it, and roast the chicken in the upper third of a preheated 450°F. oven for 30 to 35 minutes, or until it is cooked through.",
        "Make the salsa while the chicken is roasting.",
        "Arrange the chicken on a heated platter, garnish it with the plum wedges, the lime wedges, and the mint leaves, and serve it hot or at room temperature with the salsa."
    ],
    "ingredients": [
        "4 large ripe purple or red plums (about 1 pound), chopped",
        "2 garlic cloves, minced and mashed to a paste with 1 teaspoon salt",
        "1 tablespoon Oriental sesame oil",
        "1/4 cup soy sauce",
        "1/2 cup fresh orange juice",
        "1/4 cup white-wine vinegar",
        "3 tablespoons sugar",
        "1 tablespoon minced seeded fresh jalapeño pepper (wear rubber gloves)",
        "1 tablespoon minced peeled fresh gingerroot",
        "1/2 teaspoon dry mustard",
        "8 whole chicken legs (about 4 1/2 pounds)",
        "Plum Chili Salsa",
        "ripe plum wedges",
        "lime wedges",
        "whole fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Fruit",
        "Garlic",
        "Herb",
        "Pepper",
        "Poultry",
        "Roast",
        "Plum",
        "Mint",
        "Summer",
        "Gourmet"
    ],
    "title": "Roasted Chicken Legs with Plum Chili Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-chicken-legs-with-plum-chili-salsa-12153"
}
