{
    "directions": [
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 425°F. Coat 2 heavy large rimmed baking sheets with nonstick spray. Whisk 2 tablespoons mustard, 2 tablespoons tarragon, and 1 tablespoon oil in small bowl. Place turkey breast, skin side up, on 1 prepared baking sheet; sprinkle all over with salt and pepper. Spread mustard mixture over skin. Roast turkey in bottom third of oven 45 minutes.",
        "While turkey roasts, toss potatoes, sliced leeks, 1 tablespoon tarragon, and 1 tablespoon oil in large bowl. Sprinkle with salt and pepper; spread out on second baking sheet.",
        "After turkey has roasted 45 minutes, place potatoes in top third of oven. Roast along with turkey until potatoes are tender, stirring potatoes occasionally, about 45 minutes. Remove potatoes from oven.",
        "Toss beans with 1 tablespoon tarragon and 1/2 tablespoon oil in large bowl; sprinkle with salt and pepper. Spread beans around turkey; pour broth over beans. Continue roasting until thermometer inserted into thickest part of turkey registers 165°F and beans are crisp-tender, 10 to 15 minutes. Rewarm potatoes in oven 5 minutes.",
        "Place potatoes and beans on platter. Slice turkey; place on same platter. Whisk 2 tablespoons mustard into turkey juices on sheet; season with salt and pepper. Spoon some juices over turkey; sprinkle with 1 tablespoon tarragon. Pass remaining juices."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "4 tablespoons honey mustard, divided",
        "5 tablespoons chopped fresh tarragon, divided",
        "2 1/2 tablespoons olive oil, divided",
        "1 2 1/4-pound boneless turkey breast, net removed",
        "2 pounds baby potatoes, halved",
        "2 cups thinly sliced leeks (white and pale green parts only; about 2 large)",
        "2 8-ounce packages trimmed French green beans (haricots verts)",
        "1 cup low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Potato",
        "turkey",
        "Thanksgiving",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Green Bean",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roast Turkey Breast with Potatoes, Green Beans, and Mustard Pan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-breast-with-potatoes-green-beans-and-mustard-pan-sauce-361589"
}
