{
    "directions": [
        "Preheat oven to 425°F. and oil a 15- by 10- by 2-inch flameproof roasting pan.",
        "In a small bowl stir together spices, coarse salt, garlic, and fresh coriander. Reserve 3 tablespoons mixture in another small bowl and into remainder stir 3 tablespoons butter.",
        "Rinse chicken inside and out, removing any excess fat from opening of body cavity, and pat dry. Arrange chicken, breast side up, in center of roasting pan. With fingers loosen skin from breast at both ends and push half of seasoned butter under skin, spreading over breastbone to each side of breast. Massage skin from outside to spread butter evenly over breast. Put remaining seasoned butter in body cavity and with small metal or wooden skewers completely close body cavity and neck cavity. Tie drumsticks together with kitchen string and salt chicken lightly. Roast chicken in middle of oven 20 minutes.",
        "Scatter carrots and turnips around chicken and toss with fat in pan (if chicken is very lean, add remaining tablespoon of butter). Roast chicken and vegetables 30 minutes. Scatter zucchini around chicken and sprinkle vegetables with 2 tablespoons reserved spice mixture, tossing them. Roast chicken and vegetables 30 minutes, or until a meat thermometer inserted in fleshy part of a thigh registers 170°F.",
        "Remove string and skewers from chicken and pour any juices from inside chicken into pan. Transfer chicken to a platter and arrange vegetables around chicken, using a slotted spoon. Keep chicken and vegetables warm, covered loosely.",
        "Skim fat from pan juices in roasting pan. To pan add broth, water, and remaining tablespoon reserved spice mixture and on top of stove deglaze over moderately high heat, scraping up brown bits and dissolving caramelized juices. Boil mixture until reduced by about half and stir in beurre manié. Boil sauce, stirring, about 2 minutes, or until thickened slightly, and transfer to a sauceboat.",
        "Serve chicken and vegetables with sauce."
    ],
    "ingredients": [
        "1 teaspoon ground coriander seeds",
        "2 teaspoons ground cumin",
        "1 1/2 teaspoons coarse salt",
        "3 medium garlic cloves, chopped fine",
        "1/3 cup finely chopped fresh coriander sprigs (wash and spin dry before  chopping)",
        "3 to 4 tablespoons unsalted butter, softened",
        "a 4-pound chicken, giblets reserved for another use",
        "1 pound carrots (about 5 large), cut diagonally into 1-inch-thick pieces",
        "1 pound turnips (about 4 medium), peeled and cut into 1-inch wedges",
        "1 pound zucchini (about 2 medium), halved lengthwise and cut  diagonally into 1-inch-thick pieces",
        "1 cup chicken broth",
        "1/2 cup water",
        "a beurre manié made by kneading together 1/2 tablespoon softened unsalted butter and 1/2 tablespoon all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Poultry",
        "Vegetable",
        "Roast",
        "Spice",
        "Carrot",
        "Turnip",
        "Zucchini",
        "Winter",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Roasted Chicken with Carrots, Turnips, and Zucchini",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-chicken-with-carrots-turnips-and-zucchini-13626"
}
