{
    "directions": [
        "1. Bring a medium pot of water to a boil. Add the noodles and cook according to the package instructions until al dente, or the minimum amount of time suggested by the package. Drain the noodles, rinse under cold water, and drain again, shaking well to remove excess water. Return the noodles to the pot, toss with the sesame oil until the noodles are well coated, and set aside.",
        "2. Prepare the sauce: In a small bowl, combine the soy sauce, oyster sauce, rice wine, and honey. Set aside.",
        "3. Heat a wok or large skillet over high heat until a bead of water sizzles and evaporates on contact. Add the peanut oil and swirl to coat the bottom. Add the garlic, ginger, and scallions and stir-fry until aromatic, about 30 seconds. Add the mushrooms and cook until softened, 1 to 2 minutes.",
        "4. Add the noodles and pork. Pour in the sauce mixture and toss with tongs or chopsticks until the noodles and pork are heated through and well coated with sauce. Transfer to a platter and serve."
    ],
    "ingredients": [
        "12 ounces, thin dried Chinese egg noodles",
        "2 tablespoons sesame oil",
        "3 tablespoons soy sauce",
        "1 1/2 tablespoons oyster sauce",
        "1 1/2 tablespoons Chinese rice wine or dry sherry",
        "1 1/2 teaspoons honey",
        "1 tablespoon peanut or vegetable oil",
        "1 1/2 teaspoons minced garlic",
        "1 teaspoon minced or grated fresh ginger",
        "3 scallions, cut into 2-inch lengths",
        "4 or 5 fresh shiitake mushrooms, thinly sliced",
        "1/2 pound Chinese barbecued pork, store-bought or homemade, cut into small, bite-sized pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Pork",
        "Stir-Fry",
        "Dinner",
        "Lunar New Year",
        "Noodle",
        "Dairy Free",
        "Tree Nut Free"
    ],
    "title": "Roast Pork Lo Mein",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-lo-mein-51149600"
}
