{
    "directions": [
        "1. Preheat the broiler.",
        "2. Place the bell peppers on the baking sheet and set on the rack closest to the broiler unit. Broil the peppers for 6 to 8 minutes, turning them as necessary, until the skins are puffed and blackened on all sides.",
        "3. Remove the bell peppers from the broiler, place them in a bag, and seal the bag immediately. Allow the peppers to steam for 10 minutes. When they are cool enough to handle, slip off the skins and remove the stems and seeds. Rinse the bell peppers, pat dry, and set aside on paper toweling.",
        "4. While the bell peppers cool, heat the oil in the saucepan over medium heat and sauté the onion until it is translucent, 3 to 4 minutes. Raise the temperature to high, add the tomato juice, and simmer until the juice has reduced by half, about 3 minutes.",
        "5. Transfer the bell peppers, tomato juice, and onion to the bowl of the food processor fitted with the steel blade. Process until the sauce is smooth. Add the horseradish, vodka, lemon zest, and juice, and pulse three times to incorporate the ingredients. Season the sauce with salt and pepper to taste.",
        "Put this smoky-flavored, radiantly colored sauce in a deep serving dish and pass it.",
        "The sauce can be made a day in advance, covered, and refrigerated. Bring it to room temperature before serving.",
        "10 minutes",
        "15 minutes"
    ],
    "ingredients": [
        "2 large red bell peppers",
        "2 tablespoons extra virgin olive oil",
        "1 medium red onion, finely chopped",
        "1 1/2 cups tomato juice",
        "1 teaspoon drained bottled white horseradish",
        "1/4 cup vodka",
        "Zest and juice of 1 medium lemon",
        "Salt and freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Vodka",
        "Tomato",
        "Broil",
        "Horseradish",
        "Lemon",
        "Bell Pepper",
        "Winter"
    ],
    "title": "Roasted Red Bell Pepper-Bloody Mary Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-red-bell-pepper-bloody-mary-sauce-106378"
}
