{
    "directions": [
        "Preheat an oven to 425 degrees F (220 degrees C). Place the sweet potatoes into a 9x13 inch baking dish, drizzle with 1 tablespoon of corn oil, and season with salt and pepper. Stir to coat the sweet potatoes in oil.",
        "Roast in the preheated oven until the sweet potatoes are golden and tender, 15 to 20 minutes. Stir occasionally as they cook so the sweet potatoes cook evenly.",
        "Meanwhile, measure out 1 cup of corn kernels and set aside. Place the remaining corn into a blender, and puree with the water until smooth; set aside.",
        "Heat the remaining 1 tablespoon of corn oil in a large saucepan over medium heat. Stir in the celery, onion, and shallot. Cook and stir until the onion has softened, about 5 minutes. Stir in the tomato paste and dried thyme leaves; cook 1 minute more. Pour in the vegetable broth, corn puree, bay leaf, salt, and cubed potato. Bring to a boil over medium-high heat, then reduce the heat to medium-low, cover, and simmer until the potato is tender, 25 to 35 minutes.",
        "Once the potato is tender, remove and discard the  bay leaf. Stir in the whole corn kernels, sweet potato, and chopped parsley. Return to a simmer and season to taste with salt and pepper before serving."
    ],
    "ingredients": [
        "2 sweet potatoes, peeled and cubed",
        "1 tablespoon corn oil",
        "salt and pepper to taste",
        "1 (12 ounce) package frozen corn kernels, thawed",
        "1 cup water",
        "1 tablespoon corn oil",
        "1 1/2 cups finely diced celery",
        "1 cup diced red onion",
        "1/4 cup shallot, minced",
        "1 tablespoon tomato paste",
        "1/2 teaspoon dried thyme leaves",
        "3 cups vegetable broth",
        "1 bay leaf",
        "1 teaspoon salt",
        "1 potato, peeled and cubed",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Sweet Potato Corn Chowder",
    "url": "http://allrecipes.com/recipe/167163/roasted-sweet-potato-corn-chowder/"
}
