{
    "directions": [
        "If using dried porcini, soak in boiling-hot water to cover until soft, about 45 minutes. Lift out porcini, squeezing out excess liquid, and discard soaking liquid. Rinse in a sieve to remove any grit and pat dry. Halve larger slices.",
        "Preheat oven to 375°F.",
        "If using fresh porcini, halve or quarter larger ones, keeping smaller ones whole, and transfer all to a baking pan. Toss all mushrooms with onion wedges, garlic, thyme, wine, 3 tablespoons oil, salt, and pepper to taste. Toss pearl onions with remaining tablespoon oil and salt and pepper to taste in a shallow baking pan.",
        "Roast mushroom mixture, covered with foil, in upper third of oven and pearl onions, uncovered, in lower third, stirring occasionally and switching position of pans halfway through roasting, until pearl onions are tender and golden brown, about 45 minutes total. Remove pearl onions from oven.",
        "Uncover mushroom mixture and stir in 1/2 cup red-wine reduction. Continue roasting mixture in middle of oven, uncovered, stirring occasionally, until vegetables are tender and liquid is reduced by half, about 30 minutes. Stir in pearl onions and roast until hot, about 10 minutes more. Heat remaining red-wine reduction.",
        "Season mushrooms and onions with salt and pepper. Drizzle with some red-wine reduction and serve the rest on the side."
    ],
    "ingredients": [
        "3 lb fresh porcini (also known as cèpes) or 3 lb other exotic mushrooms and 2 oz large dried porcini slices",
        "2 medium onions, cut into 1/2-inch-thick wedges",
        "6 garlic cloves, minced",
        "3 tablespoons chopped fresh thyme",
        "1/4 cup dry Marsala wine",
        "4 tablespoons extra-virgin olive oil",
        "1 teaspoon salt",
        "1 1/2 lbs. assorted pearl onions, blanched and peeled",
        "2 cups red-wine reduction"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Mushroom",
        "Onion",
        "Side",
        "Roast",
        "Vegetarian",
        "Marsala",
        "Red Wine",
        "Fall",
        "Thyme",
        "Gourmet"
    ],
    "title": "Roasted Wild Mushrooms in Red-Wine Reduction",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-wild-mushrooms-in-red-wine-reduction-102569"
}
