{
    "directions": [
        "Preheat oven to 375 degrees F. Line a baking sheet with a (12x18 inches) sheet of Reynolds Wrap(R) Aluminum Foil. Add beets, along with 2 tablespoons of olive oil to the sheet and sprinkle with salt and pepper.",
        "Toss to combine. Center beets on the sheet of foil. Bring up foil sides. Double fold top and ends to seal packet, leaving room for heat circulation inside. Roast beets until cooked through, 35-45 minutes.",
        "Remove from oven. Open packets carefully by cutting along top fold with a sharp knife, allowing steam to escape; then open top of foil packet. Let beets rest until they are cool enough to touch. Then peel and chop them into 1/3-inch pieces. Toss with 1 tablespoon olive oil, red wine vinegar, and salt and pepper to taste.",
        "In a large bowl combine the ricotta cheese, feta cheese, 3 tablespoons olive oil, parsley, lemon zest and shallots. Beat with a whisk until well combined and fluffy. Season with salt and pepper.",
        "Spread the creamy feta on a serving platter and top with the beets. Sprinkle the chopped pistachios over the top and serve with toasted baguette slices for dipping."
    ],
    "ingredients": [
        "3/4 pound mixed red and golden beets, washed, tops and bottoms trimmed",
        "3 tablespoons olive oil, divided",
        "Salt and pepper to taste",
        "1 tablespoon red wine vinegar",
        "1 cup whole-milk ricotta cheese",
        "1/2 cup crumbled feta cheese",
        "3 tablespoons olive oil",
        "2 tablespoons finely chopped Italian parsley",
        "1 tablespoon lemon zest",
        "1 teaspoon finely minced shallots",
        "Salt to taste",
        "1/4 cup chopped pistachios",
        "1 baguette, sliced and toasted",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Beets with Creamy Feta",
    "url": "http://allrecipes.com/recipe/244902/roasted-beets-with-creamy-feta/"
}
