{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C). Position a turkey roasting rack in a roasting pan.",
        "Remove the neck and giblet package from the inside of the turkey, if any, and rinse the bird thoroughly, inside and out. Pat the turkey dry with paper towels. Place the turkey onto the roasting rack. With your fingers, reach under the skin over the breast, and loosen the skin. Place the butter cubes underneath the skin of the breast, distributing them as evenly as possible over the whole breast. Poke 4 or 5 wooden toothpicks through the skin into the meat to secure the skin as it cooks.",
        "In a bowl, mix the carrots, onions, celery, the two garlic head halves, thyme, sage, bay leaves, salt, and black pepper. Stuff the cavity of the turkey with as much of the vegetables and seasonings as will fit; sprinkle the rest, if any, into the bottom of the roasting pan. Lift the turkey upright so the cavity opening is uppermost, and pour the whole bottle of Chardonnay into the bird so that the wine flows into the pan. Lay the turkey back down onto the rack, and truss if desired. Cover the turkey with aluminum foil.",
        "Roast in the preheated oven until until no longer pink at the bone and the juices run clear, about 7 hours. Remove the turkey from the oven, remove the foil, and roast until the skin turns brown and crisp, 25 to 30 more minutes.  An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). Remove from oven and let rest 10 minutes before carving. Serve cooked carrots, onion, and celery alongside the turkey, if desired."
    ],
    "ingredients": [
        "1 (18 pound) whole turkey, thawed",
        "1 1/4 cups chilled butter, diced",
        "1 pound baby carrots",
        "2 large onions, roughly chopped",
        "3 stalks celery, roughly chopped",
        "1 whole head garlic, cut in half crosswise",
        "3 tablespoons chopped fresh thyme",
        "3 tablespoons chopped fresh sage",
        "2 bay leaves",
        "1 (750 milliliter) bottle chilled Chardonnay wine",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Turkey, Navy Style",
    "url": "http://allrecipes.com/recipe/216352/roasted-turkey-navy-style/"
}
