{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Line a baking sheet with parchment.",
        "Whisk together egg white, sugar, and salt until sugar is completely dissolved, then add almonds, stirring until coated. Spread mixture in a very thin layer on parchment-lined sheet, spreading almonds away from center of pan.",
        "Bake until deep golden, 15 to 25 minutes. Cool on baking sheet on a rack, then break into pieces.",
        "Increase oven temperature to 425°F.",
        "Halve pears lengthwise and core with melon-ball cutter or a paring knife.",
        "Spread 1 tablespoon butter on bottom of an 8-inch square glass baking dish and sprinkle with 1/4 cup sugar.",
        "Arrange pears, cut sides up, on sugar, then dot pears with remaining tablespoon butter. Sprinkle remaining tablespoon sugar over pears, then drizzle with 1 tablespoon Amaretto.",
        "Roast pears, uncovered, until barely tender, about 25 minutes (sugar will harden on bottom).",
        "Add water, a pinch of salt, and remaining 2 tablespoons Amaretto to baking dish and stir (around pears) until sugar is dissolved, then baste pears with pan juices.",
        "Roast pears, basting twice with pan juices, until tender, about 15 minutes more.",
        "Serve pears, warm or at room temperature, drizzled with pan juices and topped with almond crunch."
    ],
    "ingredients": [
        "1 large egg white",
        "3 tablespoons sugar",
        "1/8 teaspoon salt",
        "3/4 cup sliced almonds (preferably with skins; 2 3/4 oz)",
        "3 firm Bosc pears (1 1/2 lb total)",
        "2 tablespoons unsalted butter, softened",
        "1/4 cup plus 1 tablespoon sugar",
        "3 tablespoons Amaretto or other almond-flavored liqueur",
        "1/2 cup water",
        "Special equipment: parchment paper; a melon-ball cutter (optional)",
        "Accompaniment: mascarpone cheese (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Roast",
        "Pear",
        "Almond",
        "Fall",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted Pears with Almond Crunch",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-pears-with-almond-crunch-235775"
}
