{
    "directions": [
        "Preheat oven to 450°F. Cook beets in medium pot of boiling salted water until almost tender, about 15 minutes. Drain. Transfer beets to large roasting pan. Add sweet potatoes, squash, brussels sprouts and rosemary to pan. Drizzle with 2 tablespoons oil; sprinkle generously with salt and pepper. Toss to coat. Place garlic head, cut side up, on small piece of foil and drizzle with 1 teaspoon oil; wrap in foil. Place in roasting pan with vegetables. Roast vegetables and garlic until tender and vegetables are brown in spots, turning occasionally, about 45 minutes.",
        "Unwrap garlic. Peel and thinly slice garlic cloves. Transfer vegetables and garlic to large bowl. Whisk vinegar, lemon peel and 3 tablespoons oil in small bowl. Season with salt and pepper. (Vegetables and dressing can be made 8 hours ahead. Chill vegetables; let dressing stand at room temperature. Before continuing, rewarm vegetables in microwave.) Pour dressing over; toss to coat. Serve warm."
    ],
    "ingredients": [
        "12 baby beets, trimmed, peeled",
        "2 pounds red-skinned sweet potatoes (yams; about 3 medium), peeled, cut into 1-inch pieces",
        "2 3/4 pounds acorn squash, unpeeled, quartered lengthwise, seeded, cut crosswise into 1/2-inch-thick slices",
        "1 1/2 pounds brussels sprouts, trimmed, halved lengthwise",
        "2 teaspoons chopped fresh rosemary or 1 teaspoon dried",
        "5 tablespoons plus 1 teaspoon extra-virgin olive oil",
        "1 whole garlic head, top 1/2 inch trimmed",
        "1/4 cup balsamic vinegar",
        "2 teaspoons grated lemon peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "Kid-Friendly",
        "Back to School",
        "Squash",
        "Sweet Potato/Yam",
        "Fall",
        "Brussel Sprout"
    ],
    "title": "Roasted Vegetables with Balsamic-Lemon Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-vegetables-with-balsamic-lemon-vinaigrette-4381"
}
