{
    "directions": [
        "In a large saucepan stir together marinade ingredients. Bring marinade just to a boil, stirring (marinade will rise and foam), and remove pan from heat. In a blender purée marinade in 2 batches, transferring it as puréed to bowl. Cool marinade to room temperature and spoon off any remaining foam.",
        "In a large heavy resealable plastic bag combine pork and marinade and seal bag, pressing out any excess air. Put bag in a baking pan and marinate pork, chilled, turning bag once or twice, at least 8 hours and up to 24. Let pork in marinade come to room temperature, about 40 minutes. Transfer marinade to a saucepan and bring just to a boil.",
        "Preheat oven to 375°F.",
        "Pat pork dry with paper towels and season with salt and pepper. In a flameproof roasting pan heat oil over moderately high heat until hot but not smoking and brown pork on all sides. Roast pork in middle of oven, basting frequently with some marinade, until a meat thermometer registers 155°F. for slightly pink meat, 1 to 1 1/2 hours. Transfer pork to a cutting board, reserving juices in roasting pan and discarding string, and let stand, covered loosely with foil, about 15 minutes.",
        "While pork is standing, skim and discard fat from pan and add remaining marinade. Deglaze roasting pan over moderately high heat, scraping up brown bits. Bring sauce just to a boil and strain through a fine sieve into another saucepan. Bring sauce to a simmer and whisk in beurre manié, bit by bit, whisking until sauce is combined well and thickened slightly.",
        "Serve pork, sliced, with sauce."
    ],
    "ingredients": [
        "1/2 cup Dijon mustard",
        "1 large onion, chopped",
        "1/2 cup honey",
        "3 cups beer (not dark), preferably German",
        "a 3 1/2-pound boneless pork loin, tied (3 to 3 1/2 inches wide)",
        "2 tablespoons vegetable oil",
        "a beurre manié, made by rubbing together 1 tablespoon softened unsalted butter and 1 tablespoon all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Mustard",
        "Onion",
        "Pork",
        "Marinate",
        "Roast",
        "Fall",
        "Gourmet"
    ],
    "title": "Roast Pork Loin with Beer Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-loin-with-beer-sauce-10675"
}
