{
    "directions": [
        "Rinse capon inside and out and discard any excess fat from cavity. Pat capon dry inside and out, then sprinkle cavity with 1/2 teaspoon salt and 1/2 teaspoon pepper. Put capon in a large flameproof roasting pan (17 by 12 by 3 inches) and let stand at room temperature 30 minutes.",
        "Put oven rack in middle position and preheat oven to 425°F.",
        "While capon is standing, stir together butter, zest, 1 tablespoon chopped thyme, 1 teaspoon salt, and 1/2 teaspoon pepper in a small bowl.",
        "Starting at neck cavity, gently slide an index finger between skin and flesh of breast to loosen skin (be careful not to tear skin). Push butter mixture evenly under skin on both sides of breast, then rub outside of capon to distribute butter evenly. Tuck wings under.",
        "Put thyme sprigs and lemon halves in large cavity and tie legs together with string. Pour lemon juice all over capon and sprinkle with 1 teaspoon salt and 1/2 teaspoon pepper.",
        "Roast capon 30 minutes. Reduce oven temperature to 375°F and add shallots and onions to pan, tossing with pan juices. Continue roasting capon, basting with pan juices and stirring shallots and onions every 30 minutes, until thermometer inserted 2 inches into fleshy part of a thigh (do not touch bone) registers 170°F, about 1 1/2 hours more.",
        "Tilt capon so juices in large cavity run into roasting pan, then transfer capon to a cutting board (do not clean roasting pan) and let stand, uncovered, 20 to 30 minutes. Transfer shallots and onions to a sieve held over roasting pan to drain any pan juices. Transfer shallots and onions to a bowl and stir in remaining 1/4 teaspoon salt and 1/4teaspoon pepper.",
        "Pour pan juices into a 1-quart glass measure, then skim off fat and reserve fat and juices separately.",
        "Straddle roasting pan across 2 burners. Add 1 cup chicken stock to pan and deglaze pan by boiling over high heat, scraping up brown bits, about 1 minute. Add to glass measure with pan juices.",
        "Cook flour and 2 tablespoons reserved fat in a 3-quart heavy saucepan over moderately high heat, whisking, until smooth, then add remaining cup chicken stock in a stream, whisking constantly to prevent lumps. Whisk in reserved pan juices and cook, whisking occasionally, until sauce is reduced to about 1 1/2 cups, 10 to 15 minutes. Pour through a fine-mesh sieve into a bowl and stir in remaining teaspoon chopped fresh thyme and salt and pepper to taste.",
        "Carve capon and serve with shallots, onions, and sauce."
    ],
    "ingredients": [
        "1 (8- to 9-lb) capon or oven stuffer; preferably not frozen",
        "2 3/4 teaspoons salt",
        "1 3/4 teaspoons black pepper",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1 1/2 tablespoons finely grated fresh lemon zest",
        "4 teaspoons chopped fresh thyme plus 10 sprigs fresh thyme",
        "2 lemons, halved",
        "1/4 cup fresh lemon juice",
        "6 shallots, trimmed, leaving root ends intact, and halved lengthwise",
        "4 medium red onions, trimmed, leaving root ends intact, and cut lengthwise into 1-inch-wide wedges",
        "4 medium yellow onions, trimmed, leaving root ends intact, and cut lengthwise into 1-inch-wide wedges",
        "2 cups chicken stock or reduced-sodium chicken broth",
        "2 tablespoons all-purpose flour",
        "Special equipment: kitchen string; an instant-read thermometer",
        "Garnish: lemon wedges and fresh thyme sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Onion",
        "Poultry",
        "Roast",
        "Valentine's Day",
        "Dinner",
        "Lemon",
        "Fall",
        "Anniversary",
        "Thyme",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roast Capon with Lemon, Thyme, and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/roast-capon-with-lemon-thyme-and-onions-235739"
}
