{
    "directions": [
        "Bring 3 cups water, 20 juniper berries, and pinch of salt to boil in large saucepan. Reduce heat to medium; cover and simmer 10 minutes. Set juniper broth aside.",
        "Preheat oven to 450°F. Cut wing tips from duck; reserve. Sprinkle cavity of duck with salt and pepper. Place heart, liver, and gizzard in cavity, then 10 juniper berries, 4 thyme sprigs, and bay leaf. Tie legs together to hold shape. Place duck, breast side up, in roasting pan. Add wing tips and neck to pan. Pour 1 cup juniper broth over duck. Roast duck in center of oven until beginning to brown, about 30 minutes.",
        "Meanwhile, bring remaining juniper broth to boil. Add prunes; cover, reduce heat to medium, and simmer until prunes are soft, about 5 minutes. Using slotted spoon, transfer prunes to small bowl.",
        "Tilt roasting pan; spoon off 1/2 cup fat from top of liquid. Pour 1/2 cup prune poaching liquid over duck. Turn duck, breast side down. Pour 1/2 cup prune poaching liquid over duck. Return to oven; roast 15 minutes. Turn duck, breast side up. Arrange prunes around duck; spoon pan juices over prunes. Drizzle vinegar over duck. Return to oven and roast duck until skin is crisp and juices run clear when thigh is pierced, about 20 minutes longer. Transfer to cutting board, breast side down; let stand 20 minutes.",
        "Discard wing tips and neck. Using slotted spoon, transfer prunes to bowl. Pour pan juices into medium saucepan; spoon off fat. Add thyme sprig. Boil until juices are reduced to 1 1/4 cups and thickened slightly, stirring occasionally, about 8 minutes. Return prunes to juices to rewarm; season with salt and pepper. Turn duck, breast side up. Cut legs from duck. Cut off wings with some breast attached. Cut breasts from duck; thinly slice crosswise. Arrange duck on platter. Spoon juices with prunes over and serve."
    ],
    "ingredients": [
        "3 cups water",
        "30 juniper berries, slightly crushed",
        "1 5-pound duck; heart, liver, gizzard, and neck reserved",
        "5 large fresh thyme sprigs",
        "1 bay leaf",
        "16 large pitted prunes (about 10 ounces)",
        "2 tablespoons red wine vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Roast",
        "New Year's Eve",
        "Dinner",
        "Vinegar",
        "Dried Fruit",
        "Prune",
        "Winter",
        "Thyme",
        "Christmas Eve",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roast Duck with Prunes and Juniper Berries",
    "url": "http://www.epicurious.com/recipes/food/views/roast-duck-with-prunes-and-juniper-berries-108630"
}
