{
    "directions": [
        "In a large saucepan, heat 3 cups of chicken stock. Coarsely puree the Roasted Winter Vegetables and the chicken stock in the bowl of a food processor fitted with the steel blade (or use a handheld blender). Pour the soup back into the pot and season, to taste. Thin with more chicken stock and reheat. The soup should be thick but not like a vegetable puree, so add more chicken stock and/or water until it's the consistency you like.",
        "Serve with Brioche Croutons and a drizzle of good olive oil.",
        "Preheat the oven to 425 degrees F.",
        "Cut the carrots, parsnips, sweet potato, and butternut squash in 1 to 1 1/4-inch cubes. All the vegetables will shrink while baking, so don't cut them too small.",
        "Place all the cut vegetables in a single layer on 2 sheet pans. Drizzle them with olive oil, salt, and pepper. Toss well. Bake for 25 to 35 minutes, until all the vegetables are tender, turning once with a metal spatula.",
        "Sprinkle with parsley, season to taste, and serve hot.",
        "Slice the bread about 3/4-inch thick. Cut off the crusts and then cut the slices in 3/4-inch dice. You should have 3 to 4 cups of croutons.",
        "Place the croutons on a sheet pan and toss them with the olive oil, salt, and pepper. Bake for 10 to 15 minutes, tossing once, until they're nicely browned on all sides. Cool to room temperature before using and store in a sealed plastic bag."
    ],
    "ingredients": [
        "3 to 4 cups chicken stock, preferably homemade",
        "1 quart Roasted Winter Vegetables, recipe follows",
        "Kosher salt and freshly ground black pepper",
        "For serving:",
        "Brioche Croutons, recipe follows",
        "Good olive oil",
        "1 pound carrots, peeled",
        "1 pound parsnips, peeled",
        "1 large sweet potato, peeled",
        "1 small butternut squash (about 2 pounds), peeled and seeded",
        "3 tablespoons good olive oil",
        "1 1/2 teaspoons kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "6 ounces brioche loaf or challah",
        "1 tablespoon good olive oil",
        "1/4 teaspoon kosher salt",
        "1/8 teaspoon freshly ground black pepper",
        "Preheat the oven to 350 degrees F."
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "Vegetable Soup",
        "Soup",
        "Vegetable",
        "Roasted Vegetable",
        "Roasting",
        "Squash",
        "Carrot Recipes"
    ],
    "title": "Roasted Vegetable Soup",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/roasted-vegetable-soup-recipe2"
}
