{
    "directions": [
        "Preheat oven to 450°F. Combine zucchini, peppers, and onions in medium bowl. Add oil and 1 tablespoon rosemary; toss to coat. Spread evenly on rimmed baking sheet; sprinkle with salt and pepper. Roast until vegetables are tender, about 25 minutes. Remove from oven; cool.",
        "Preheat oven to 375°F. Mix ground beef, mozzarella, panko, basil, marjoram, 1 1/2 teaspoons salt, 1/2 teaspoon pepper, dried crushed pepper, 1 tablespoon rosemary, and 1 cup roasted vegetables in large bowl. Whisk 1/2 cup ketchup, eggs, and wine in medium bowl. Add to beef mixture; stir with wooden spoon until well incorporated; spoon into 9x5x3-inch loaf pan, forming rounded top.",
        "Spoon 1/2 cup ketchup over top of loaf. Bake meatloaf until cooked through, juices run clear, and top is browned, about 1 hour 10 minutes. Remove pan from oven; let meatloaf rest 20 minutes.",
        "Rewarm remaining vegetable mixture in large nonstick skillet. Turn meatloaf out; cut into 1-inch-thick slices. Top with warm roasted vegetable mixture; serve with mashed potatoes.",
        "*Flaky panko crumbs are the best substitute for fresh breadcrumbs in almost anything, including meatloaf. Look for them in the Asian foods section of the supermarket and at Asian markets."
    ],
    "ingredients": [
        "3 small zucchini, diced",
        "3 red bell peppers, diced",
        "2 medium-size red onions, diced",
        "2 tablespoons olive oil",
        "2 tablespoons chopped fresh rosemary, divided",
        "2 pounds ground beef chuck (20% fat)",
        "2 cups coarsely grated whole-milk mozzarella cheese (about 8 ounces)",
        "1 1/2 cups panko* (Japanese breadcrumbs)",
        "1 cup thinly sliced fresh basil",
        "1 tablespoon chopped fresh marjoram",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon dried crushed red pepper",
        "1 cup ketchup, divided",
        "2 large eggs",
        "1/4 cup dry red wine",
        "Mustard Mashed Potatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mustard",
        "Onion",
        "Potato",
        "Vegetable",
        "Bake",
        "Dinner",
        "Ground Beef",
        "Bell Pepper",
        "Zucchini"
    ],
    "title": "Roasted Vegetable Meatloaf with Mustard Mashed Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-vegetable-meatloaf-with-mustard-mashed-potatoes-231734"
}
