{
    "directions": [
        "Preheat the oven to 500 degrees.",
        "Parboil the sausages in water to cover for 8 minutes to rid them of excess fat.",
        "Melt the butter in a large heatproof roasting pan, add the grapes, and toss to coat. Over moderately high heat add the wine. Stir with a wooden spoon for a few minutes until the wine has reduced by half.",
        "Using tongs, transfer the parboiled sausages to the roasting pan and push them down in the grapes so the sausages will not brown too quickly. Roast in the oven, turning the sausages once, until the grapes are soft and the sausages have browned, 20 to 25 minutes.",
        "Place the roasting pan on top of the stove over a medium-high heat and add the balsamic vinegar. Scrape up any browned bits on the bottom of the roasting pan, and allow the vinegar and juices to reduce until they are thick and syrupy. With a slotted spoon, transfer the sausages and grapes to a serving platter.",
        "Pour the sauce over the sausages and grapes and serve immediately, accompanied with fresh bread.",
        "This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results."
    ],
    "ingredients": [
        "1 1/2 pounds Italian hot sausage",
        "1 1/2 pounds Italian sweet sausage",
        "3 tablespoons unsalted butter",
        "5 to 6 cups (2 pounds) red or green seedless grapes, stems removed",
        "2 to 4 tablespoons dry red wine, preferably Chianti",
        "3 tablespoons balsamic vinegar",
        "Fresh Foccaccia or Ciabatta bread, to serve"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sausage Recipes",
        "Fruit",
        "Grape Recipes",
        "Roasting"
    ],
    "title": "Roasted Sausages and Grapes",
    "url": "http://www.foodnetwork.com/recipes/roasted-sausages-and-grapes-recipe"
}
