{
    "directions": [
        "Heat oil in heavy large saucepan over medium heat. Add turkey wings, neck and onion. Cook until brown, about 15 minutes. Add giblets and remaining ingredients. Bring to boil, skimming surface occasionally. Reduce heat to low, cover partially and cook until liquid is reduced to 5 cups, about 3 hours. Strain. (Can be prepared 1 day ahead. Cover and chill.)",
        "Preheat oven to 425°F. Pat turkey dry. Combine herbs, salt and pepper in small bowl. Rub some of herb mixture in large cavity of turkey; place onion in cavity. Place turkey in large roasting pan. Tuck wing tips under turkey body. Tie legs together to hold shape. Rub butter onto turkey skin. Rub remaining herb mixture onto turkey skin. Roast 45 minutes.",
        "Reduce oven temperature to 350°F. Continue roasting turkey until thermometer inserted into thickest part of thigh registers 175°F., basting every 20 minutes with drippings, about 1 1/4 hours longer. Transfer turkey to platter, reserving pan juices. Let turkey stand while preparing gravy.",
        "Pour turkey pan juices into large measuring cup. Degrease pan juices, reserving 1/4 cup fat (do not wash roasting pan). Add enough turkey broth to juices to measure 3 1/3 cups liquid. Pour about 1/2 cup liquid into turkey roasting pan. Set over medium-high heat and bring to boil, scraping up any browned bits. Add to liquid in cup.",
        "Transfer reserved 1/4 cup turkey fat to heavy medium saucepan. Add flour and stir over medium-low heat 2 minutes. Gradually whisk in turkey broth mixture. Bring to boil, stirring frequently. Cook until thickened, about 2 minutes. Add cream and herbs and simmer until slightly thickened, about 2 minutes. Stir in Port. Season gravy to taste with salt and pepper."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "1 pound turkey wings, backs or necks",
        "Neck and giblets from 14- to 16-pound turkey",
        "1 large onion, chopped",
        "6 cups water",
        "2 celery stalks with leaves, chopped",
        "3 fresh parsley sprigs",
        "1 bay leaf",
        "1 14- to 16-pound turkey",
        "1 1/2 tablespoons minced fresh rosemary or 1 1/2 teaspoons dried, crumbled",
        "1 1/2 tablespoons minced fresh tarragon or 1 1/2 teaspoons dried, crumbled",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons pepper",
        "1/2 large onion, cut into chunks",
        "1/2 cup (1 stick) butter, room temperature",
        "6 tablespoons all purpose flour",
        "1/4 cup whipping cream",
        "3/4 teaspoon minced fresh rosemary or 1/4 teaspoon dried, crumbled",
        "1/4 teaspoon (generous) minced fresh tarragon or 1/4 teaspoon dried, crumbled",
        "1/4 cup Port",
        "Salt and pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Poultry",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Port",
        "Winter"
    ],
    "title": "Roast Turkey with Port Wine Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-port-wine-gravy-2876"
}
