{
    "directions": [
        "In a small saucepan, add garlic and avocado oil, and place over medium heat. Poach (\"roast\") garlic until just golden brown. Strain garlic from oil, save garlic oil for topping soup.",
        "Add all ingredients (avocado through white pepper--not the cashews) to blender and blend until silky smooth. Season to taste. Chill.",
        "Serve cold in bowl, topped with chopped cashews, some more garlic oil and with a healthy portion of yogurt crackers on the side. Enjoy! Yum! Summer!",
        "Herbed Yogurt Crackers: Preheat oven to 375 degrees F (350 if using convection).",
        "Add sifted almond flour to bowl, along with all dry ingredients. Whisk until combined.",
        "Using your (clean) hands, cut butter into dry mix, rubbing between your fingers until the consistency of very coarse sand or little pebbles.",
        "Using a wooden spoon, add yogurt and mix until just combined. Dough will be super wet and sticky - and delicious!",
        "Form into one big (or two smaller) oval shaped mound, about 1 inch thick, and refrigerate for at least one hour.",
        "Remove from refrigerator, and between two pieces of parchment paper on a sheet pan, roll (or press with another sheet pan) dough to a consistent thickness, around 1/16 inch.",
        "Using a knife or a pizza cutter, cut into squares, rectangles, triangles (any shape you want!), then, using a fork, poke lots of little holes in the dough and then top with sesame seeds, herbs and salt.",
        "Bake for about an hour, turning pan halfway through the process. Bake until golden brown, and dry to the touch."
    ],
    "ingredients": [
        "1 1/2 tablespoons crushed garlic",
        "4 tablespoons avocado oil",
        "2 cups avocado, pitted and scooped from shell",
        "1 cup cucumber, cut into 1/2-inch slices",
        "2 1/4 cups So Delicious® Dairy Free Cashew Milk",
        "3/4 cup So Delicious® Dairy Free Coconut Yogurt, Plain",
        "4 1/2 teaspoons cider vinegar",
        "1 tablespoon kosher salt",
        "1 teaspoon ground white pepper",
        "3 tablespoons chopped roasted cashews",
        "Herbed Yogurt Crackers:",
        "1 3/4 cups almond flour",
        "1 tablespoon organic granulated sugar",
        "1 1/2 teaspoons baking powder",
        "2 teaspoons kosher salt",
        "6 tablespoons cold vegan butter (soy-free), like Earth Balance®, cut into 1/2-inch pieces",
        "1 cup So Delicious® Dairy Free Original Yogurt, Plain",
        "1 tablespoon toasted sesame seeds",
        "1 tablespoon dried herbs (oregano, rosemary, tarragon)",
        "2 teaspoons kosher salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Garlic Avocado Soup with Herbed Yogurt Crackers",
    "url": "http://allrecipes.com/recipe/240824/roasted-garlic-avocado-soup-with-herb/"
}
