{
    "directions": [
        "Preheat oven to 400°F. Place porcini in small bowl. Pour enough hot water over to cover; let stand until mushrooms soften, about 20 minutes. Drain.",
        "Spread baguette cubes on small rimmed baking sheet. Bake until golden, about 10 minutes. Transfer toasted bread to bowl. Maintain oven temperature.",
        "Slice half of fresh mushrooms; set aside for sauce. Coarsely chop remaining fresh mushrooms. Melt butter in large skillet over medium-high heat. Add chopped mushrooms and shallots; sauté until tender, about 5 minutes. Add thyme and juniper berries, if desired; stir 1 minute. Add to bowl with bread. Mix in chopped liver, heart and gizzard, then 1/3 cup broth, parsley, salt and pepper.",
        "Rinse chicken inside and out; pat dry with paper towels. Sprinkle chicken cavity with salt and pepper. Fill with stuffing. Tie legs together. Sprinkle outside of chicken with salt and pepper. Place in roasting pan. Roast chicken until thermometer inserted into thickest part of thigh registers 180°F and juices run clear when thickest part of thigh is pierced with fork, about 1 hour 45 minutes. Transfer to platter; cover with foil.",
        "Pour pan drippings into measuring cup. Transfer 3 tablespoons fat from top of drippings to heavy large skillet. Spoon off remaining fat from pan drippings and discard. Heat 3 tablespoons fat in skillet over medium-high heat. Add sliced mushrooms and sauté until tender, about 5 minutes. Add remaining 2/3 cup chicken broth, degreased pan drippings and brandy and cook 3 minutes, adding more broth for desired sauce consistency. Season sauce to taste with salt and pepper. Serve chicken with stuffing and sauce."
    ],
    "ingredients": [
        "1 1/2-ounce package dried porcini mushrooms*",
        "2 cups 1-inch cubes baguette",
        "1 pound assorted fresh wild mushrooms (such as oyster and portobello)",
        "1/4 cup (1/2 stick) butter",
        "2 large shallots, chopped",
        "3/4 teaspoon dried thyme",
        "4 juniper berries (optional), crushed",
        "1 6- to 7-pound roasting chicken; liver, heart and gizzard reserved, finely chopped",
        "1 cup (or more) canned low-salt chicken broth",
        "2 tablespoons chopped fresh parsley",
        "3/4 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1 tablespoon brandy",
        "*Dried porcini mushrooms are available at Italian markets, specialty foods stores and many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Poultry",
        "Roast",
        "Dinner",
        "Fall",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Chicken with Mushroom Stuffing and Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-mushroom-stuffing-and-sauce-104080"
}
