{
    "directions": [
        "Set oven rack about 6 inches from the heating element in your oven and preheat the broiler. Line a baking sheet with aluminum foil.",
        "Arrange red bell pepper halves, yellow bell pepper halves, and orange bell pepper halves onto prepared baking sheet with cut sides down.",
        "Roast peppers under the preheated broiler until the skin of the peppers has blackened and blistered, 5 to 8 minutes. Place the blackened peppers into a bowl and tightly seal with plastic wrap. Steam as they cool until the skin has loosened completely, about 20 minutes. Remove and discard skins. Cut peppers into small dice.",
        "Heat olive oil in a large pot over medium heat; cook and stir onion and carrot in hot oil until onion is translucent, about 10 minutes. Add garlic, tarragon, thyme, and paprika; continue to cook and stir until garlic is fragrant, about 2 minutes.",
        "Stir roasted peppers, tomatoes, water, and hot sauce into the peppers mixture, place a cover on the pot, and cook until the tomatoes soften, about 5 minutes.",
        "Pour vegetable broth into the pot; add lentils, bay leaves, salt, and black pepper; bring to a boil, cover the pot, reduce heat to medium-low, and cook until lentils are tender, about 45 minutes.",
        "Pour soup into a blender or food processor no more than half full. Cover and hold lid down; pulse several time to get the soup to be only slightly chunky. Repeat processing until all soup has been blended."
    ],
    "ingredients": [
        "1 red bell pepper, halved lengthwise and seeded",
        "1 yellow bell pepper, halved lengthwise and seeded",
        "1 orange bell pepper, halved lengthwise and seeded",
        "1 tablespoon olive oil",
        "1 yellow onion, diced",
        "1 large carrots, chopped",
        "4 cloves garlic, minced",
        "1 teaspoon dried tarragon",
        "1 1/2 teaspoons dried thyme",
        "1 teaspoon paprika",
        "4 canned roma (plum) tomatoes, seeded and diced",
        "1 tablespoon water",
        "1 1/2 teaspoons hot sauce, or to taste",
        "4 cups vegetable broth",
        "1 cup lentils",
        "2 bay leaves",
        "3/4 teaspoon salt",
        "2 pinches freshly ground black pepper",
        "1 teaspoon chile oil, or to taste",
        "1 tablespoon chopped fresh parsley, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Pepper and Lentil Soup",
    "url": "http://allrecipes.com/recipe/238125/roasted-pepper-and-lentil-soup/"
}
