{
    "directions": [
        "Preheat oven to 400°F.",
        "In a shallow baking pan arrange squash, onion, and garlic in one layer and drizzle with oil, tossing to coat. Roast mixture in middle of oven 15 minutes, or until garlic is tender and transfer garlic to a work surface. Roast squash and onion until tender, about 15 minutes more. Discard peels from squash, onion, and garlic.",
        "In a food processor purée squash, onion and garlic with salt and pepper to taste until smooth. Squash purée may be made 2 days ahead and chilled, covered.",
        "Spread about one fourth squash purée on each of 4 tortillas and sprinkle each with about one fourth bell pepper and about one fourth cheese. Top each quesadilla with a plain tortilla, pressing gently together. Spread each side of quesadillas with 1/2 tablespoon butter.",
        "Heat a griddle or 7-inch non-stick skillet over moderately high heat until hot and cook quesadillas, 1 at a time, until golden, about 3 minutes on each side, transferring to a cutting board.",
        "Cut each quesadilla into 6 to 8 wedges and serve warm with chipotle dip.",
        "In a small bowl stir chili and lime juice into sour cram until combined well. Dip may be made 2 days ahead and chilled, covered. Makes about 1 cup."
    ],
    "ingredients": [
        "a 3/4-pound seedless piece butternut squash, peeled and cut into 3/4-inch dice (about 5 cups)",
        "1 medium onion, unpeeled, cut into eighths",
        "1 large garlic clove, unpeeled",
        "1 tablespoon vegetable oil",
        "eight 5- to 6-inch flour tortillas",
        "1 cup chopped red bell pepper (about 1 large)",
        "1 cup coarsely grated jack cheese",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "Accompaniment: chipotle lime sour cream dip",
        "1 canned chipotle chili in adobo*, minced",
        "2 teaspoons fresh lime juice",
        "1 cup sour cream",
        "*available at Hispanic markets and some specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Cocktail Party",
        "Super Bowl",
        "Vegetarian",
        "Fall",
        "Gourmet"
    ],
    "title": "Roasted Squash, Red Pepper, and Jack Cheese Quesadillas with Chipotle Lime Sour Cream Dip",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-squash-red-pepper-and-jack-cheese-quesadillas-with-chipotle-lime-sour-cream-dip-13075"
}
