{
    "directions": [
        "Preheat oven to 475°F. Sprinkle both sides of pork with 2 tablespoons marjoram, allspice, and generous amount of salt and pepper. Heat oil in heavy large nonstick skillet over high heat. Add pork and brown well, including edges, turning with tongs, about 7 minutes. Transfer pork to small rimmed baking sheet; reserve skillet. Roast pork in oven until thermometer inserted into center of chops from side registers 145°F, about 9 minutes.",
        "Meanwhile, add bacon to oil in reserved skillet. Sauté over medium heat until brown, about 3 minutes. Mix in garlic. Add greens. Cook until just wilted, turning with tongs, about 3 minutes. Add 1 teaspoon vinegar; season with salt and pepper. Using tongs, transfer greens to colander to drain, leaving some bacon pieces in skillet for sauce. Add broth, mustard, and 4 teaspoons vinegar to skillet. Simmer until slightly thickened, about 4 minutes. Mix in 1 tablespoon marjoram. Season with salt and pepper.",
        "Mound greens on plates; top with pork. Spoon sauce alongside and serve."
    ],
    "ingredients": [
        "2 1 1/2-inch-thick rib pork chops",
        "3 tablespoons chopped fresh marjoram, divided",
        "1/2 teaspoon ground allspice",
        "2 tablespoons olive oil",
        "2 thick-cut bacon slices, chopped",
        "2 garlic cloves, pressed",
        "8 cups (packed) wide strips assorted greens such as mustard greens and red Swiss chard, stems discarded",
        "5 teaspoons Sherry wine vinegar, divided",
        "1/2 cup low-salt chicken broth",
        "2 tablespoons Dijon mustard"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Pork",
        "Roast",
        "Dinner",
        "Meat",
        "Bacon",
        "Pork Chop",
        "Spring",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Pork Chops with Bacon and Wilted Greens",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-chops-with-bacon-and-wilted-greens-231880"
}
