{
    "directions": [
        "Preheat oven to 350°F. Toast walnuts on a small rimmed baking sheet, tossing once, until golden brown, 5–8 minutes. Let cool slightly, then finely chop.",
        "Increase oven temperature to 450°F. Place a shallow baking dish in oven to heat. Season salmon generously with salt; set aside.",
        "Cook bulgur according to package directions. Set aside.",
        "Halve turnips, or cut into quarters or sixths if larger. Toss in a large bowl with 1 Tbsp. oil; season with salt. Arrange, cut side down; in preheated roasting dish. Cook until deep brown underneath, 15–20 minutes. Reduce oven temperature to 325°F. Toss turnips and push them to one side of dish. Place salmon on the other side; roast until flesh is opaque and nearly cooked through, 12–15 minutes.",
        "Whisk yogurt, vinegar, 2 Tbsp. lemon juice, and 3 Tbsp. oil in a medium bowl to combine. Add walnuts, celery, preserved lemon, and raisins and toss to coat; season with salt. Fold in bulgur.",
        "Arrange turnips on serving platter and drizzle with lemon juice. Scatter bulgur salad over platter. Break salmon into large pieces and arrange over bulgur salad. Top with celery leaves and parsley leaves; drizzle with more oil, if desired."
    ],
    "ingredients": [
        "1/2 cup walnuts",
        "1 (1 1/2-pound) piece skin-on salmon fillet",
        "Kosher salt",
        "1/2 cup coarse whole grain bulgur (not quick-cooking)",
        "2 bunches small white turnips (about 1 1/2 pounds total), trimmed",
        "4 tablespoons olive oil, divided; plus more for drizzling (optional)",
        "1/4 cup plain Greek yogurt",
        "1 tablespoon white wine vinegar",
        "2 tablespoons fresh lemon juice, plus more for drizzling",
        "4 celery heart stalks, plus leaves for serving",
        "1/4 preserved lemon, flesh removed, rind finely chopped",
        "1/4 cup finely chopped golden raisins",
        "1/4 cup parsley leaves with tender stems"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Salmon",
        "Seafood",
        "Fish",
        "Bulgur",
        "Celery",
        "Roast",
        "Turnip",
        "Lemon",
        "Healthy",
        "Quick and Healthy"
    ],
    "title": "Roasted Salmon With Celery and Bulgur Salad",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-salmon-with-celery-and-bulgur-salad"
}
