{
    "directions": [
        "Let the rib roast stand at room temperature for 1 hour. In a small bowl knead together the rosemary, the salt, and 1/2 stick of the butter and rub the meat with the mixture. In a roasting pan roast the meat, ribs side down, in a preheated 500°F. oven for 30 minutes, reduce the heat to 350°F., and roast the meat for 1 3/4 to 2 hours more, or until a meat thermometer inserted in a fleshy section registers to 130°F. for medium-rare. Forty-five minutes before the roast is done add the onion and the bell pepper to the pan. During the last 40 minutes of roasting, in a bowl let the shiitake mushrooms soak in the water for 30 minutes, squeeze out the excess liquid, and reserve the soaking liquid in bowl. Discard the stems and slice the caps thin. Strain the reserved liquid through a fine sieve into another bowl. Transfer the roast to a heated platter, discarding the strings, transfer the onion and the bell pepper to paper towels to drain, and reserve them for the shiitake pan gravy. Let the roast stand for 20 to 30 minutes before carving.",
        "In a heavy skillet sauté the fresh mushrooms in the remaining 1 1/2 tablespoons butter over moderately high heat, stirring, for 1 minute, add the shiitake mushrooms, and sauté the mixture, stirring, for 1 minute. Add the broth and the reserved mushroom liquid and boil the liquid until it is reduced to about 2 1/2 cups. Skim all but 1 tablespoon of the fat from the pan juices in the roasting pan, add the reserved onion and bell pepper and the Sherry, and sauté the mixture over moderately high heat, scraping up the brown bits, for 1 minute. Boil the Sherry mixture until it is reduced by half, strain it through the fine sieve into the mushroom mixture, and bring the mixture to a boil. Stir the arrowroot mixture and add it to the gravy, stirring. Simmer the gravy, stirring, for 3 minutes, add salt and pepper to taste, and transfer the gravy to a heated sauceboat.",
        "Serve the roast with the pan gravy."
    ],
    "ingredients": [
        "a 4-rib standing rib roast (trimmed weight 10 to 10 1/2 pounds)",
        "1 tablespoon minced fresh rosemary leaves",
        "1 teaspoon salt",
        "1/2 stick (1/4 cup) plus 1 1/2 tablespoons unsalted butter, softened",
        "1 onion, chopped",
        "1 green bell pepper, chopped",
        "1 ounce dried shiitake mushrooms",
        "2 cups hot water",
        "1/4 pound fresh mushrooms, sliced",
        "2 1/2 cups canned beef broth",
        "1/2 cup medium-dry Sherry",
        "4 teaspoons arrowroot, dissolved in 2 tablespoons cold water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Beef",
        "Mushroom",
        "Roast",
        "Rosemary",
        "Winter",
        "Gourmet"
    ],
    "title": "Roast Prime Ribs of Beef with Shiitake Pan Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-prime-ribs-of-beef-with-shiitake-pan-gravy-10937"
}
