{
    "directions": [
        "Preheat oven to 300°F. Melt butter in a small skillet over medium, remove from heat, and mix in salt and cayenne. Whisk egg white in a medium bowl until soft peaks form; stir in brown sugar. Add seasoned butter and walnuts and fold to coat nuts.",
        "Spread nuts out on a parchment–lined rimmed baking sheet; bake, tossing every 10 minutes or so, until mixture is dry and nuts are toasted, 25–30 minutes. Let cool.",
        "Increase oven temperature to 350°F. Toast cashews on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool.",
        "Pulse cashews, bread, garlic, lemon juice, coriander, and 3/4 cup water in a food processor to combine. With motor running, stream in oil; process just to incorporate. Pulse, adding a splash or so of water if too thick, until a coarse purée forms; season with salt.",
        "Increase oven temperature to 475°F. Heat butter and 1 Tbsp. oil in a large skillet over medium-high. Once butter is foaming, place chicken in pan, skin side up. Tilt pan and spoon butter mixture over chicken until the entire surface is coated. Sprinkle with a generous pinch of salt and transfer to oven. Roast chicken, rotating pan halfway through, until skin is golden brown and an instant-read thermometer inserted into the thickest part of a thigh registers 165°F, 25–30 minutes. Transfer chicken to a cutting board and let rest 5 minutes.",
        "Meanwhile, toss celery, celery leaves, mixed seeds, lemon juice, and 1/2 cup spicy walnuts in a medium bowl. Drizzle with oil, season with salt, and toss again.",
        "Spoon tarator onto a platter and top with celery salad and chicken.",
        "Spicy Walnuts can be made 5 days ahead. Store airtight at room temperature.\nCashew Tarator can be made 1 day ahead. Cover and chill. Bring to room temperature before using."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon cayenne pepper",
        "1 large egg white",
        "1/2 cup (packed) light brown sugar",
        "2 cups walnut halves",
        "2 cups cashews",
        "1 1/4-inch-thick slice white bread, torn",
        "1 garlic clove, finely grated",
        "1/4 cup fresh lemon juice",
        "1/2 teaspoon ground coriander",
        "1/2 cup olive oil",
        "Kosher salt",
        "2 tablespoons unsalted butter",
        "1 tablespoon olive oil, plus more",
        "1/2 (3 1/2–4-pound) chicken (backbone removed)",
        "Kosher salt",
        "1 celery stalk, thinly sliced, plus 1/4 cup celery leaves",
        "1 tablespoon mixed unsalted, roasted seeds (such as pumpkin, sunflower, and/or hemp)",
        "2 teaspoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Roast",
        "Cashew",
        "Coriander",
        "Walnut",
        "Seed",
        "Celery",
        "Dinner",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Roast Half Chicken With Cashew Tarator and Celery",
    "url": "http://www.epicurious.com/recipes/food/views/roast-half-chicken-with-cashew-tarator-and-celery"
}
