{
    "directions": [
        "Prepare the rub and the chicken: Preheat the oven to 375°.",
        "In a large mixing bowl, combine the cinnamon, cumin, turmeric, paprika, sea salt, and ghee or oil. Add the chicken to the bowl and, using your hands, work the rub into the chicken, ensuring the entire chicken is coated.",
        "In a deep cast-iron pot or slow cooker, combine the tomatoes, apricots, garlic, raisins, and broth. Place the chicken on top of the veggies and place the pot in the oven for 50 minutes, or until the chicken reaches an internal temperature of 150°F.",
        "Remove the chicken from the pot and set aside to rest for 15 minutes. Bring the pot with the veggies and broth to a simmer over medium-low heat. Simmer for 10 to 15 minutes or until reduced by half and thickened.",
        "Meanwhile, prepare the butternut squash: Toss the squash with the olive oil, sea salt, fresh sage, and mint. Spread out in an even layer on a baking sheet and roast in the preheated oven for 15 minutes, or until knife-tender.",
        "To finish the dish: Using a large knife and fork, carve the chicken meat from the carcass. Cut the chicken into bite-size pieces and mix thoroughly into the simmering sauce. Remove from the heat and serve over the roasted butternut squash.",
        "Store leftover, refrigerated, for up to 1 week."
    ],
    "ingredients": [
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground cumin",
        "1 teaspoon ground turmeric",
        "1 1/2 teaspoon Spanish paprika",
        "1 teaspoon sea salt",
        "1 teaspoon ghee or olive oil",
        "1 (4- to 6-pound) whole chicken",
        "3 plum tomatoes, cut into small dice",
        "1/2 cup chopped dried Turkish apricots",
        "4 large garlic cloves, minced",
        "1/4 cup golden raisins",
        "3 cups Chicken Bone Broth",
        "1 butternut squash, peeled, cut in half, and seeds removed, cut into small dice",
        "1 teaspoon olive oil",
        "1 tablespoon roughly chopped fresh sage",
        "1 tablespoon roughly chopped fresh mint",
        "2 teaspoons sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Chicken",
        "Dinner",
        "Butternut Squash",
        "Kid-Friendly",
        "Low Fat",
        "Apricot",
        "Healthy",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roasted Apricot Chicken with Mint and Sage Butternut Squash",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-apricot-chicken-with-mint-and-sage-butternut-squash"
}
