{
    "directions": [
        "Bring 10 1/2 cups water, coarse salt, honey, lemon juice, lemon peel, bay leaf, and thyme sprigs to boil in large pot. Cool slightly, then refrigerate brine until cold. Place chicken in very large resealable plastic bag; add brine and seal. Refrigerate chicken 6 hours.",
        "Drain chicken from brine; rinse and pat dry. Place chicken on plate. Let stand uncovered in refrigerator at least 2 hours and up to 24 hours.",
        "Preheat oven to 375°F. Place chicken on rack in roasting pan. Roast chicken 20 minutes; add 1 cup broth to roasting pan. Roast chicken 20 minutes longer; add 1 cup broth to roasting pan. Roast chicken until thermometer inserted into thickest part of thigh registers 170°F, about 45 minutes. Let chicken rest 10 minutes.",
        "Meanwhile, pour juices from roasting pan into 2-cup measuring cup. Add more broth if needed to equal 2 cups. Simmer butter in medium saucepan over medium heat until beginning to brown, about 2 minutes. Add flour; stir 1 minute. Whisk in broth mixture; bring to boil. Stir in mustard and 1 teaspoon thyme leaves. Season sauce with salt and pepper.",
        "Slice chicken. Divide chicken among plates. Drizzle with sauce and serve Green Salad with Olives alongside."
    ],
    "ingredients": [
        "10 1/2 cups water",
        "1/2 cup coarse kosher salt",
        "3 tablespoons honey",
        "2 tablespoons fresh lemon juice",
        "Peel from 1 lemon, cut into long strips with vegetable peeler",
        "1 bay leaf",
        "3 large fresh thyme sprigs plus 1 teaspoon fresh thyme leaves",
        "1 4 1/2-pound chicken (giblets reserved for another use)",
        "2 cups (or more) low-salt chicken broth, divided",
        "1 tablespoon butter, room temperature",
        "1 tablespoon all purpose flour",
        "2 tablespoons whole grain mustard",
        "Green Salad with Olives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mustard",
        "Roast",
        "Fall",
        "Winter",
        "Honey",
        "Thyme"
    ],
    "title": "Roast Chicken with Mustard-Thyme Sauce and Green Salad with Olives",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-mustard-thyme-sauce-and-green-salad-with-olives-239804"
}
