{
    "directions": [
        "Place an oven rack in the center of the oven and preheat to 400 degrees F. Spray a heavy baking sheet with vegetable oil cooking spray or line with parchment paper.",
        "For the vegetables: Toss the zucchini, bell pepper, squash, oil, cumin, oregano and salt in a medium bowl. Spread the mixture in a single layer on the prepared baking sheet. Roast until the vegetables are golden and tender, 25 to 30 minutes.",
        "For the tostadas: Brush both sides of the tortillas with the oil using a pastry brush. Heat a 12-inch nonstick skillet over medium heat. Working in batches, cook the tortillas until crispy, 2 to 3 minutes on each side. Drain on paper towels.",
        "For the cream: Mix the pepper, sour cream, lime juice and agave until smooth in a small bowl.",
        "Spoon the vegetables on top of the tostadas and serve with a dollop of the chipotle cream."
    ],
    "ingredients": [
        "Vegetable oil cooking spray",
        "2 medium zucchini, cut into 1/2-inch cubes",
        "1 red bell pepper, cored, seeded and cut into 1/2-inch pieces",
        "One 1-pound butternut squash, peeled, seeded and diced into 1/2-inch cubes (3 cups)",
        "1/4 cup extra-virgin olive oil",
        "2 teaspoons ground cumin",
        "1 1/2 teaspoons dried oregano",
        "1 teaspoon kosher salt",
        "Six 6 1/2 or 7 1/2-inch diameter corn or whole grain tortillas",
        "1/2 cup extra-virgin olive oil",
        "1 canned chipotle pepper, finely diced",
        "1 cup sour cream or refrigerated egg-free mayonnaise, such as Vegenaise",
        "1 tablespoon fresh lime juice",
        "1 teaspoon agave"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Roasted Vegetable",
        "Roasting",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Roasted Vegetable Tostadas with Chipotle Cream",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/roasted-vegetable-tostadas-with-chipotle-cream-recipe"
}
