{
    "directions": [
        "Preheat oven to 325° F.",
        "Rinse turkey inside and out and pat dry. Fold neck skin under body and fasten with a small skewer. Using small skewers secure wings to body. Transfer turkey to a rack set in a roasting pan and melt butter. Brush inside of turkey with some butter and season with salt and pepper. Put herb sprigs inside body cavity. Brush outside of turkey with remaining butter and season with salt and pepper. Loosely tie drumsticks together with kitchen string. Roast turkey in middle of oven 1 hour.",
        "Add water to pan and roast turkey, basting every 20 minutes, 2 hours more, or until a meat thermometer inserted in fleshy part of a thigh registers 175° F. and juices run clear when thigh is pierced. Transfer turkey to a heated platter and reserve juices in pan. Remove skewers and discard string. Let turkey stand 30 minutes.",
        "Finely chop onion. Skim fat from reserved pan juices and reserve 1/2 cup fat (for sautéing onions, below, and for stuffing). On top of stove deglaze pan with wine over moderately high heat, scraping up brown bits, and boil mixture until reduced to about 1/2 cup. Add 4 cups stock and bring to a simmer. Pour wine mixture through a sieve into a saucepan.",
        "In a large, heavy skillet sauté onion in 1/4 cup reserved fat over moderately high heat, stirring frequently, until browned, about 15 minutes. Stir in flour and cook roux over moderately low heat, whisking, 3 minutes. Bring wine mixture to a simmer. Add hot wine mixture to roux in a fast stream, whisking constantly to prevent lumps, and simmer, whisking occasionally, 10 minutes. Whisk in additional stock to thin gravy to desired consistency. Season gravy with salt and pepper and transfer to a heated sauceboat.",
        "Garnish turkey with herb bouquet and serve with gravy."
    ],
    "ingredients": [
        "12-to-14 pound turkey (reserving neck and giblets, but excluding liver, for making stock)",
        "1 stick (1/2 cup) unsalted butter",
        "8 sprigs mixed fresh herbs such as thyme, sage, rosemary, and/or marjoram",
        "1 1/2 cups water",
        "1 large onion",
        "1 1/2 cups dry white wine",
        "4 cups Turkey Giblet Stock plus additional for thinning gravy",
        "1/3 cup all-purpose flour",
        "Garnish: large bouquet of mixed fresh herb sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "turkey",
        "Roast",
        "Sauté",
        "Thanksgiving",
        "White Wine",
        "Simmer",
        "Gourmet"
    ],
    "title": "Roast Turkey with White-Wine Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-white-wine-gravy-14455"
}
