{
    "directions": [
        "To make roasted winter squash: Heat oven to 375 degrees F. Heat butter over medium-high heat in an ovenproof saute pan; add diced squash, salt and pepper. When squash begins to brown, place pan in oven. Roast for 15 minutes or until medium-brown on all sides. Remove from oven and let cool slightly. Puree in food processor, or mash with potato masher or ricer. Measure 1 1/2 cups squash; reserve.",
        "To make soup: Heat the olive oil in a large saucepan over medium heat until hot. Add the onion, celery, carrot and cinnamon stick; saute until soft but not brown, about 10 minutes. Season with salt and pepper. Add the broth and the coriander; bring to a boil. Simmer for several minutes. Stir in reserved squash until smooth; simmer gently to let the flavors meld, about 10 minutes. Discard the cinnamon stick.",
        "Puree the soup using an immersion blender or in a blender until smooth. (The soup can be made ahead to this point, cooled, covered, and refrigerated for several days or frozen for about 1 month. It will thicken as it cools and may need thinning with broth or water when reheating.)",
        "Return the soup to the pan and reheat gently. Add the half-and-half. Adjust the seasoning with salt and pepper. Top each serving with pumpkin seeds and toasted bread crumbs."
    ],
    "ingredients": [
        "Roasted Winter Squash:",
        "2 tablespoons butter",
        "2 cups raw winter squash (butternut, hubbard, acorn)",
        "Salt and pepper",
        "Soup:",
        "2 tablespoons extra-virgin olive oil",
        "1/2 cup diced onion (1/4-inch)",
        "1/4 cup diced celery (1/4-inch)",
        "1/4 cup diced carrot (1/4-inch)",
        "1 cinnamon stick",
        "Sea salt and freshly ground pepper",
        "1 (32 ounce) carton Progresso® chicken broth",
        "1/2 teaspoon ground toasted coriander (optional)",
        "Roasted Winter Squash (above)",
        "1/2 cup half-and-half, if desired* (optional)",
        "2 tablespoons toasted pumpkin seeds",
        "1/2 cup Progresso® plain Panko crispy bread crumbs, toasted light brown in saute pan over medium heat"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Butternut Squash Soup",
    "url": "http://allrecipes.com/recipe/215602/roasted-butternut-squash-soup/"
}
