{
    "directions": [
        "Preheat the oven to 475°F / 240°C.",
        "Wash the sweet potatoes, halve them lengthwise, and then cut each half again similarly into 3 long wedges. Mix with 3 tablespoons of the olive oil, 2 teaspoons salt, and some black pepper. Spread the wedges out, skin side down, on a baking sheet and cook for about 25 minutes, until soft but not mushy. Remove from the oven and leave to cool down.",
        "To make the balsamic reduction, place the balsamic vinegar and sugar in a small saucepan. Bring to a boil, then decrease the heat and simmer for 2 to 4 minutes, until it thickens. Be sure to remove the pan from the heat when the vinegar is still runnier than honey; it will continue to thicken as it cools. Stir in a drop of water before serving if it does become too thick to drizzle.",
        "Arrange the sweet potatoes on a serving platter. Heat the remaining oil in a medium saucepan over medium heat and add the green onions and chile. Fry for 4 to 5 minutes, stirring often to make sure not to burn the chile. Spoon the oil, onions, and chile over the sweet potatoes. Dot the figs among the wedges and then drizzle over the balsamic reduction. Serve at room temperature. Crumble the cheese over the top, if using."
    ],
    "ingredients": [
        "4 small sweet potatoes (2 1/4 lb / 1 kg in total)",
        "5 tbsp olive oil",
        "scant 3 tbsp / 40 ml balsamic vinegar (you can use a commercial rather than a premium aged grade)",
        "1 1/2 tbsp / 20 g superfine sugar",
        "12 green onions, halved lengthwise and cut into 1 1/2-in / 4cm segments",
        "1 red chile, thinly sliced",
        "6 ripe figs (8 1/2 oz / 240 g in total), quartered",
        "5 oz / 150 g soft goat's milk cheese (optional)",
        "Maldon sea salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Vegetarian",
        "Fig",
        "Sweet Potato/Yam",
        "Fall"
    ],
    "title": "Roasted Sweet Potatoes & Fresh Figs",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-sweet-potatoes-fresh-figs-51115420"
}
