{
    "directions": [
        "Mix butter, chopped herbs, fennel seeds and 1/2 teaspoon coarse salt in bowl; blend well. (Can be prepared 1 day ahead. Cover and refrigerate. Bring to room temperature before continuing.)",
        "Position rack in bottom third of oven; preheat to 400°F. Sprinkle main cavity of chicken with salt and pepper; fill with herb sprigs. Starting at neck end, slide fingers under skin of breast and upper part of legs, loosening skin. Spread 3 tablespoons herb butter under skin on breast and upper leg meat. Place chicken on rack in large roasting pan; tie legs together loosely to hold shape. Scatter onions around chicken. Brush chicken and onions with 2 tablespoons herb butter; sprinkle with salt and pepper.",
        "Roast chicken 30 minutes. Remove pan from oven. Scatter garlic cloves around chicken. Brush chicken, onions and garlic with 1 tablespoon herb butter. Roast chicken and vegetables 30 minutes. Reserve 1 tablespoon herb butter for sauce; brush remainder on chicken and vegetables. Continue to roast until chicken is golden and thermometer inserted into thickest part of thigh registers 180°F, about 30 minutes longer. Insert wooden spoon into main cavity; tilt chicken so that juices drain into pan. Transfer chicken to platter; surround with onions and garlic. Tent with foil.",
        "Set roasting pan over medium-high heat. Add broth and wine; bring to simmer, scraping up browned bits. Pour pan juices into large glass measuring cup. Spoon off fat; discard fat. Pour juices into medium saucepan. Stir reserved 1 tablespoon herb butter and flour in small bowl to smooth paste. Bring pan juices to simmer; whisk in paste. Simmer sauce until slightly thickened, whisking occasionally, about 4 minutes. Season with salt and pepper. Serve chicken with sauce."
    ],
    "ingredients": [
        "7 tablespoons unsalted butter, room temperature",
        "1 tablespoon chopped fresh parsley plus 3 large sprigs",
        "1 tablespoon chopped fresh thyme plus 3 large sprigs",
        "1 tablespoon chopped fresh rosemary plus 3 small sprigs",
        "1/4 teaspoon fennel seeds, crushed",
        "1/2 teaspoon coarse salt",
        "1 7- to 71/4-pound roasting chicken, rinsed, patted dry",
        "3 medium onions, peeled, quartered lengthwise (do not remove root end)",
        "14 garlic cloves, peeled",
        "1 cup canned low-salt chicken broth",
        "1/2 cup dry white wine",
        "1 1/2 teaspoons all purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Herb",
        "Onion",
        "Poultry",
        "Roast",
        "Kid-Friendly",
        "Back to School",
        "Dinner",
        "Fall",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Chicken with Herb Butter, Onions and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-herb-butter-onions-and-garlic-104597"
}
