{
    "directions": [
        "Combine prunes, stock, 1 1/2 cups wine and 1 cup prune juice in heavy medium saucepan. Simmer 10 minutes. Remove mixture from heat. Transfer 12 prunes to small bowl, using slotted spoon.",
        "Preheat oven to 375°F. Pat goose dry. Pull out fat from cavity. Rub inside and out with cut side of orange. Combine salt and pepper and rub inside and outside goose. Place orange, onion, bay leaves and 12 drained prunes in goose cavity. Tie legs together. Place goose on rack in roasting pan. Pierce all over with small metal skewer or toothpick.",
        "Roast goose 15 minutes. Reduce temperature to 350°F and roast 30 minutes longer. Remove fat from roasting pan. Combine remaining 1/4 cup wine and 1/4 cup prune juice and brush some over goose. Continue roasting goose until juices run clear when pierced in thickest part of thigh, basting goose with wine mixture and removing fat from pan occasionally, about 2 hours.",
        "Transfer goose to platter and tent with foil. Let stand 20 minutes.",
        "Strain prune poaching liquid, reserving prunes. Degrease roasting juices. Add 1/2 cup poaching liquid to roasting pan and bring to boil, scraping up any browned bits. Transfer to heavy medium saucepan. Add Armagnac, remaining poaching liquid and degreased roasting juices. Boil until flavors are intense, about 15 minutes. Knead butter and flour together. Whisk into sauce in small bits and simmer until thick, about 8 minutes. Add poached prunes and chestnuts and heat through. Sprinkle with parsley.",
        "Carve goose into thin slices. Spoon sauce, chestnuts and prunes over."
    ],
    "ingredients": [
        "1 16-ounce package pitted prunes",
        "3 cups beef stock or canned beef broth",
        "1 3/4 cups dry red wine",
        "1 1/4 cups prune juice",
        "1 12- to 13-pound goose",
        "1 orange, quartered",
        "1 tablespoon salt",
        "1 tablespoon ground pepper",
        "1 large onion, cut into 8 pieces",
        "4 bay leaves",
        "6 tablespoons Armagnac, Cognac or other brandy",
        "1 tablespoon butter, room temperature",
        "1 tablespoon all purpose flour",
        "1 7 2/5-ounce jar steamed or roasted chestnuts",
        "Chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Roast",
        "Christmas",
        "Prune",
        "Goose",
        "Cognac/Armagnac",
        "Winter",
        "Chestnut"
    ],
    "title": "Roast Goose with Chestnuts, Prunes and Armagnac",
    "url": "http://www.epicurious.com/recipes/food/views/roast-goose-with-chestnuts-prunes-and-armagnac-1086"
}
