{
    "directions": [
        "Combine first 10 ingredients in blender. Blend until spices are finely ground, about 2 minutes. Place pork in large glass baking dish. Pour marinade over pork; turn to coat. Arrange bone side up, tent loosely with foil and refrigerate at least 12 hours or overnight.",
        "Preheat oven to 350°F. Scrape marinade from pork. Pat pork dry with paper towels. Sprinkle pork generously with 1/2 teaspoon cardamom, salt and pepper. Heat oil in large roasting pan set over 2 burners on medium heat. Add pork and cook until brown, turning occasionally, about 4 minutes.",
        "Add wine, prunes, prune juice, brandy, cinnamon sticks and bay leaves to pan. Transfer to oven. Roast uncovered until meat thermometer inserted into thickest part of pork registers 160°F, basting often with pan juices, about 1 hour 30 minutes. Transfer pork and prunes to platter. Tent with foil. Strain pan juices into large glass measuring cup. Spoon 4 tablespoons fat off top of pan juices. Pour pan juices into heavy small saucepan. Add jelly and remaining 1/2 teaspoon cardamom. Simmer until jelly melts and sauce lightly coats spoon, about 8 minutes. Season sauce to taste with salt and pepper.",
        "Serve pork with sauce."
    ],
    "ingredients": [
        "12 cardamom pods",
        "12 juniper berries",
        "1/2 navel orange, peeled, cut into pieces",
        "1/2 cup dry red wine",
        "1/2 cup olive oil",
        "3 whole cloves",
        "3 cinnamon sticks, broken into pieces",
        "3 bay leaves",
        "1 teaspoon salt",
        "1/2 teaspoon whole black peppercorns",
        "1 6-pound center-cut pork rib roast with 8 to 10 bones",
        "1 teaspoon ground cardamom",
        "3 tablespoons olive oil",
        "2 cups dry red wine",
        "1 1/2 cups pitted prunes (about 10 ounces)",
        "3/4 cup prune juice",
        "1/2 cup brandy",
        "3 cinnamon sticks",
        "3 bay leaves",
        "1/2 cup red currant jelly"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Fruit",
        "Pork",
        "Marinate",
        "Roast",
        "Christmas",
        "Prune",
        "Pork Tenderloin",
        "Spice",
        "Brandy",
        "Red Wine",
        "Winter",
        "Cinnamon"
    ],
    "title": "Roasted Pork Loin with Cardamom-Currant Jelly Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-pork-loin-with-cardamom-currant-jelly-sauce-3005"
}
