{
    "directions": [
        "Heat oil in heavy medium saucepan over medium heat. Add reserved chicken fat and sauté until fat is rendered and solid pieces brown, about 8 minutes. Strain rendered fat into small bowl. Reserve solid fat pieces.",
        "Freeze 2 tablespoons rendered chicken fat. Heat 1 tablespoon rendered fat in same saucepan over medium-high heat. Add neck and heart pieces and sauté until brown, about 8 minutes. Add 1/2 cup onion and 1/2 cup carrots; sauté until vegetables are tender, scraping up any browned bits, about 3 minutes. Add 4 cups cold water and reserved solid fat pieces. Bring to boil. Add parsley, thyme, peppercorns and bay leaf. Simmer over low heat until stock is reduced to 2 cups, about 2 hours 30 minutes. (Stock can be made 1 day ahead. Cover and chill.)",
        "Rinse chicken inside and out; pat dry with paper towels. Let stand at room temperature 30 minutes.",
        "Preheat oven to 400°F. Rub 2 tablespoons frozen fat over chicken. Sprinkle chicken inside and out with salt and pepper. Place chicken, breast side down, on rack in heavy large roasting pan. Fill main cavity with 1/2 cup onion and 1/2 cup carrots. Roast chicken until skin is pale golden and begins to crisp, about 30 minutes. Remove from oven. Insert large kitchen fork into main cavity of chicken and turn chicken breast side up. Roast until meat thermometer inserted into innermost part of thigh registers 180°F, about 1 hour 15 minutes longer. Transfer chicken to platter. Tent with foil while preparing jus.",
        "Pour pan juices into 4-cup glass measuring cup. Do not clean roasting pan. Strain chicken stock into pan juices, pressing on solids to release liquid. Freeze stock mixture 5 minutes.",
        "Spoon fat off top of stock mixture and place 1 tablespoon fat in same roasting pan. Heat fat over medium heat. Add shallot and sauté until tender, about 2 minutes. Add stock mixture and tarragon and bring to boil, scraping up browned bits. Boil until reduced to 1 cup, about 8 minutes. Remove from heat. Add butter, 1 piece at a time, and whisk until melted and well blended. Season jus with salt and pepper. Serve chicken with jus."
    ],
    "ingredients": [
        "2 teaspoons vegetable oil",
        "1 7 1/2-pound whole roasting chicken, excess fat from tail reserved, neck and heart cut into 1-inch pieces",
        "1 cup chopped onion",
        "1 cup chopped peeled carrots",
        "4 cups cold water",
        "2 large fresh parsley sprigs",
        "1 fresh thyme sprig",
        "6 whole black peppercorns",
        "1 bay leaf",
        "1 large shallot, minced",
        "2 teaspoons chopped fresh tarragon",
        "2 tablespoons (1/4 stick) chilled unsalted butter, cut into pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Roast",
        "Kid-Friendly",
        "Low/No Sugar",
        "Wheat/Gluten-Free",
        "Carrot",
        "Winter",
        "Tarragon",
        "Parsley"
    ],
    "title": "Roast Chicken with Tarragon",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-tarragon-5128"
}
