{
    "directions": [
        "Preheat oven to 325°F. Rinse turkey inside and out; pat dry. Place on rack in roasting pan. Sprinkle cavities with salt and pepper. If not stuffing turkey, place rosemary and sage sprigs in main cavity. If stuffing turkey, spoon stuffing loosely into main cavity. Melt butter in saucepan. Mix in chopped rosemary, sage, orange peel, pepper and salt. Brush herb butter over turkey. Tuck wing tips under turkey; tie legs together to hold shape. Roast turkey 1 hour. Baste with pan juices. Continue roasting turkey until thermometer inserted into thigh registers 180°F, basting every 20 minutes, about 2 3/4 hours longer if unstuffed or about 3 1/4 hours longer if stuffed.",
        "Combine turkey neck and giblets, 5 1/2 cups broth, quartered onion and bay leaf in saucepan. Simmer until reduced to 3 cups liquid, skimming occasionally, about 1 hour. Strain turkey stock.",
        "Melt butter in large skillet over medium-high heat. Add sliced onions; sauté 10 minutes. Add 1 tablespoon rosemary and 1 tablespoon sage and sauté until onions are golden, about 10 minutes. Add flour; stir 1 minute. Gradually whisk in turkey stock. Boil until gravy thickens, stirring often, about 3 minutes. Add 1 teaspoon each rosemary and sage.",
        "Transfer turkey to platter. Tent with foil. Pour juices from pan into large glass measuring cup; spoon off fat. Add juices to gravy. Add vinegar to roasting pan. Bring vinegar to simmer over medium heat, scraping up browned bits. Pour mixture into heavy small saucepan. Boil until reduced to 1/4 cup, about 3 minutes; add to gravy. Rewarm gravy; thin with more chicken broth, if desired. Season with salt and pepper."
    ],
    "ingredients": [
        "1 16- to 18-pound turkey, neck and giblets reserved for gravy",
        "Fresh rosemary sprigs (optional)",
        "Fresh sage sprigs (optional)",
        "6 tablespoons (3/4 stick) butter",
        "3 tablespoons chopped fresh rosemary",
        "3 tablespoons chopped fresh sage",
        "1 1/2 tablespoons grated orange peel",
        "1 tablespoon ground black pepper",
        "4 teaspoons salt",
        "5 1/2 cups (or more) canned low-salt chicken broth",
        "1 onion, quartered",
        "1 bay leaf",
        "6 tablespoons (3/4 stick) butter",
        "2 large onions, halved, thinly sliced",
        "1tablespoon plus 1 teaspoon chopped fresh rosemary",
        "1 tablespoon plus 1 teaspoon chopped fresh sage",
        "1/3 cup all purpose flour",
        "1/2 cup balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Vinegar",
        "Rosemary",
        "Fall",
        "Sage"
    ],
    "title": "Roast Turkey with Herb Butter and Caramelized Onion-Balsamic Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-herb-butter-and-caramelized-onion-balsamic-gravy-100367"
}
