{
    "directions": [
        "Let the rack(s) come to room temperature and season all over with salt and pepper. Preheat the oven to 450°F.",
        "Spread the stew meat and onion on the bottom of a roasting pan just large enough to hold the rack(s). Place the rack(s) on top. Slide the pan into the oven and roast for about 25 minutes, or until an instant-read thermometer inserted into the center of the roast without touching bone reads 125°F to 130°F or until the meat feels firm when you press both ends of the rack(s).",
        "Transfer the rack(s) to a platter or cutting board, tent loosely with aluminum foil, and let rest for 15 minutes before carving.",
        "While the rack(s) are resting, make the jus. Put the roasting pan on the stove top over high heat and stir around the pieces of meat until the meat is browned and any juices have caramelized on the bottom of the pan. Discard the fat and return the pan to high heat. Deglaze the pan with 1/2 cup of the broth, scraping up any brown bits on the bottom of the pan with a wooden spoon. Boil down the broth until it caramelizes into a crusty brown layer with a layer of clear fat on top. Pour off the fat, return the pan to high heat, and deglaze the pan with a second 1/2 cup broth, again boiling it down. Deglaze the pan with the remaining 1 cup broth, stirring until the crust has dissolved into the liquid, and then strain the liquid through a fine-mesh strainer into a warmed sauceboat.",
        "Carve the rack(s), cutting between the ribs. Pass the jus at the table."
    ],
    "ingredients": [
        "1 American rack of lamb (8 chops) or 2 New Zealand racks of lamb (16 chops total), about 1 1/2 pounds, ribs frenched",
        "Salt",
        "Pepper",
        "1 pound lamb stew meat or trimmings, cut into 1/2-inch strips",
        "1/2 onion, coarsely chopped",
        "2 cups chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Onion",
        "Roast",
        "Dinner",
        "Rack of Lamb",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roast Rack of Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/roast-rack-of-lamb-51119040"
}
