{
    "directions": [
        "Place butter in large bowl. Mix in hazelnuts, vinegar, thyme, crushed pepper, garlic, and salt. Mix in prosciutto and green onions.",
        "Melt 2 tablespoons prosciutto butter in heavy large pot over medium-high heat. Add neck, heart, gizzard, shallots, and bay leaf; sauté until brown, about 20 minutes. Add wine, thyme, and rosemary; boil until liquid is reduced almost to glaze, about 3 minutes. Add 4 cups broth; bring to boil. Reduce heat to medium-low, cover, and simmer until giblets and neck are tender, about 1 hour. Discard bay leaf and thyme sprig. Transfer neck and giblets to work surface. Chop enough giblets to measure 1 cup. Remove meat from neck and chop. Combine neck meat and chopped giblets in bowl with broth from pot. (Prosciutto butter and gravy base can be made 1 day ahead. Cover and chill butter; bring to room temperature before using. Chill gravy base until cold, then cover and keep chilled.)",
        "Set rack at lowest position in oven and preheat to 325°F. Rinse turkey inside and out; pat dry. Starting at neck end, slide hand between skin and breast, thigh, and leg meat to loosen skin. Set aside 1/4 cup prosciutto butter for gravy. Spread 1 cup prosciutto butter over turkey meat under skin. Spread 1 cup prosciutto butter over outside of turkey. Sprinkle turkey inside and out with salt and pepper; place on rack set in large roasting pan. Place onion and next 4 ingredients in main turkey cavity. Tuck wing tips under; tie legs together loosely.",
        "Roast turkey uncovered 1 1/2 hours. Tent turkey with foil; add 2 cups broth to pan. Roast until thermometer inserted into thickest part of thigh registers 175°F, occasionally basting with pan drippings and adding more broth to pan, about 2 hours longer. Transfer to platter; tent with foil. Let stand 30 minutes (internal temperature will increase 5 to 10 degrees).",
        "Strain pan juices into 8-cup measuring cup; spoon fat off top. Add reserved gravy base. Add enough chicken broth to mixture to measure 5 cups total. Melt reserved 1/4 cup prosciutto butter in heavy large pot over medium-high heat. Add flour; whisk 1 minute. Gradually add pan-juice mixture, whisking constantly. Boil, whisking frequently, until gravy is very slightly thickened, about 5 minutes. Season with salt and pepper. Serve turkey with gravy."
    ],
    "ingredients": [
        "1 1/2 cups (3 sticks) unsalted butter, room temperature",
        "6 tablespoons chopped hazelnuts",
        "1 1/2 tablespoons Sherry wine vinegar",
        "1 tablespoon chopped fresh thyme",
        "2 teaspoons crushed black peppercorns",
        "1 garlic clove, minced",
        "3/4 teaspoon salt",
        "9 ounces thinly sliced prosciutto, chopped",
        "3 green onions, chopped",
        "Neck, heart, and gizzard reserved from one 16- to 18-pound turkey",
        "3 large shallots, finely chopped",
        "1 bay leaf",
        "1 cup dry white wine",
        "1 large fresh thyme sprig",
        "1/2 teaspoon chopped fresh rosemary",
        "4 cups low-salt chicken broth",
        "1 16- to 18-pound turkey",
        "1 onion, quartered",
        "3 garlic cloves, peeled, halved",
        "5 large fresh thyme sprigs",
        "2 large fresh summer savory sprigs",
        "1 tablespoon crushed black peppercorns",
        "5 cups (about) low-salt chicken broth",
        "1/4 cup all purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Nut",
        "Pork",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Fall",
        "Prosciutto",
        "Hazelnut"
    ],
    "title": "Roast Turkey with Prosciutto-Hazelnut Crust",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-prosciutto-hazelnut-crust-108822"
}
