{
    "directions": [
        "To make the orange oil, reduce the citrus juices over medium heat until syrup-like then cool to room temperature. Whisk in or blend an equal amount of grapeseed oil and reserve.",
        "Meanwhile, roast the beetroot. Preheat the oven 350 degrees. Trim the stems of the beetroot, leaving 1/2 inch. Wrap the stems in foil and roast the beetroot in the oven for one hour. Allow to cool, then peel and cut each beetroot into 12 wedges.",
        "To make the walnut vinaigrette, whisk together the walnut oil and olive oil. Season to taste with salt and pepper.",
        "To serve, toss the whitloof, frisee, and mache leaves in the walnut vinaigrette and place in the center of the plate. Arrange the beetroot, blood orange, asparagus and pine nuts over the greens. Drizzle with orange oil and serve."
    ],
    "ingredients": [
        "2 cups strained orange juice",
        "2 1/2 tablespoons lemon juice",
        "grapeseed oil",
        "2 beetroot (beets)",
        "2 bulbs red whitlof (Belgian Endive) leaves separated, washed and dried",
        "1 bunch frisee (curly endive) washed and dried",
        "1 bunch mache leaves (or any other mild soft gourmet salad green)",
        "2 blood oranges, peeled and sliced into rounds",
        "24 green asparagus spears, peeled and blanched",
        "2 tablespoons pine nuts, toasted",
        "1 tablespoon white wine vinegar",
        "1 tablespoon walnut oil",
        "4 tablespoons olive oil",
        "salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Citrus",
        "Appetizer",
        "Vegetarian",
        "Orange",
        "Asparagus",
        "Beet",
        "Spring",
        "Summer",
        "Winter",
        "Vegan",
        "Endive",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Beetroot (Beet), Blood Orange, Red Witlof (Belgian Endive) and Asparagus with Orange Oil",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-beetroot-beet-blood-orange-red-witlof-belgian-endive-and-asparagus-with-orange-oil-104027"
}
