{
    "directions": [
        "Cut a 1/2-inch-thick slice from tops of onions, discarding tops, and trim just enough from bottoms for onions to stand upright. Scoop out all but outer 2 or 3 layers from each using a small ice cream scoop or spoon (don't worry if you make a hole in the bottom), reserving scooped-out onion and onion shells separately.",
        "Coarsely chop enough scooped-out onion to measure 3 cups.",
        "Cook bacon in 2 batches in a 12-inch heavy skillet over moderate heat, stirring, until crisp, about 10 minutes, then transfer with a slotted spoon to paper towels to drain, reserving about 1/3 cup fat in skillet.",
        "Add chopped onion, celery, salt, and pepper to skillet and sauté over moderately high heat, stirring, until vegetables are softened, about 5 minutes. Add garlic and sauté, stirring, 1 minute. Transfer mixture to a large bowl and stir in spinach, bread, cashews, butter, 1 cup stock, and bacon, then cool completely.",
        "Preheat oven to 425°F.",
        "Arrange onion shells, open sides up, in a 13- by 9- by 2-inch baking pan, then add 1/2cup water and cover pan tightly with foil. Roast onions in middle of oven until tender but not falling apart, 25 to 30 minutes.",
        "Reduce oven temperature to 350°F.",
        "Transfer shells to a work surface and pour off water in pan. Fill shells with stuffing, mounding it, and return to pan. Reserve 5 to 7 cups stuffing for turkey cavity, then put remaining stuffing in a buttered shallow 3 1/2-quart baking dish and drizzle with remaining 1/4 cup stock. Bake stuffed onions and stuffing in dish in middle of oven, uncovered, until heated through, about 25 minutes."
    ],
    "ingredients": [
        "10 medium red and yellow onions (4 lb)",
        "1 lb sliced bacon, cut crosswise into 1-inch-wide pieces",
        "3 celery ribs, cut crosswise into 1/2-inch-thick slices",
        "1 teaspoon salt",
        "1 teaspoon black pepper",
        "3 garlic cloves, minced",
        "15 oz baby spinach, trimmed and coarsely chopped (14 cups)",
        "1 (9-inch) round loaf country-style bread (1 1/4 lb), cut into 1/2-inch cubes (10 cups), lightly toasted",
        "2 cups salted roasted cashews (10 oz), coarsely chopped",
        "1 stick (1/2 cup) unsalted butter, melted",
        "1 1/4 cups turkey giblet stock"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Side",
        "Bake",
        "Roast",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Fall",
        "Gourmet",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Roasted Stuffed Onions",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-stuffed-onions-107369"
}
