{
    "directions": [
        "Put oven racks in upper and lower thirds of oven and preheat oven to 400°F.",
        "Twist off and reserve stems from portabellas. Using a paring knife, scrape off and discard gills from underside of portabella caps, then cut caps into 1-inch pieces. Cut off and reserve stems from shiitakes, then quarter shiitakes and white mushrooms. Toss portabella, shiitake, and white mushrooms (but not reserved stems) with 2 tablespoons oil and spread in a 17- by 11-inch flameproof roasting pan. Roast in upper third of oven, stirring occasionally, until golden, about 1 hour.",
        "Meanwhile, spread barley in a shallow baking pan and roast in lower third of oven, stirring occasionally, 1 hour (barley will be dark brown and smell burned after about 10 minutes, but don't worry — just continue roasting).",
        "While mushrooms and barley roast, peel onion, reserving skin, and coarsely chop onion. Trim celery, reserving trimmings and leaves, and coarsely chop celery. Bring onion skin, celery trimmings, mushroom stems, bay leaf, and 7 cups water to a boil in a 4-quart pot, then reduce heat and simmer 40 minutes.",
        "Add hot roasted barley to broth, then remove from heat and let stand 5 minutes. Pour through a fine-mesh sieve into a 2-quart glass measure, pressing hard on and then discarding solids (you will have about 6 cups broth).",
        "Heat remaining 2 tablespoons oil in a 5- to 6-quart heavy pot over moderately high heat until hot but not smoking, then sauté onion, celery, and thyme, stirring occasionally, until vegetables are golden, about 15 minutes. Add tomato paste and cook, stirring frequently, until paste is very thick, about 1 minute. Add wine and cook, stirring and scraping up any brown bits, 1 minute. Stir in roasted mushrooms (reserve roasting pan) and strained broth and bring to a simmer.",
        "Straddle mushroom-roasting pan across 2 burners and add remaining cup water, then deglaze pan by boiling over high heat, stirring and scraping up any brown bits, 1 minute. Pour into mushroom mixture and stir in salt and pepper, then simmer, partially covered, until vegetables are very tender, about 30 minutes.",
        "Purée in 2 batches in a blender (use caution when blending hot liquids). Force through fine-mesh sieve into a bowl, discarding solids. Season with salt and pepper."
    ],
    "ingredients": [
        "1/2 lb portabella mushrooms",
        "1/2 lb fresh shiitake mushrooms",
        "1/2 lb white mushrooms",
        "1/4 cup olive oil",
        "3 tablespoons pearl barley",
        "1 large onion, left unpeeled",
        "2 celery ribs with leaves",
        "1 Turkish or 1/2 California bay leaf",
        "8 cups water",
        "2 fresh thyme sprigs",
        "1 tablespoon tomato paste",
        "1/2 cup dry white wine",
        "1 teaspoon salt",
        "1 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Mushroom",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "Barley",
        "Fall",
        "Winter",
        "Vegan",
        "Gourmet"
    ],
    "title": "Roasted Mushroom and Barley Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-mushroom-and-barley-gravy-232991"
}
