{
    "directions": [
        "Preheat oven to 375°F. Place eggplant cut side down on oiled rimmed baking sheet. Bake until very tender, about 1 hour. Cool.",
        "Melt butter in heavy large pot over medium heat. Add onion, fennel, potato, leek, garlic and oregano; sauté 10 minutes. Add wine; cook 2 minutes. Add 7 1/2 cups stock; simmer until vegetables are tender, 15 minutes. Scoop out eggplant flesh; discard skins. Add eggplant to soup. Simmer 10 minutes. Working in batches, puree soup in blender. Return soup to pot. Mix in cream. Season with salt and pepper. (Can be made 1 day ahead; cool slightly. Cover; chill.)",
        "Heat oil in small skillet over medium heat. Add shallots; sauté 4 minutes. Cool. Mix in cheese, tomatoes and basil. Season filling with salt and pepper. Place wrappers on work surface. Place 2 teaspoons filling in center. Brush edges with water. Fold wrappers diagonally in half; press edges to seal. (Can be made 4 hours ahead. Place in single layer on floured baking sheet. Cover; chill.)",
        "Bring soup to simmer, thinning with more stock if necessary. Cook dumplings in pot of boiling salted water until tender, about 1 minute. Ladle soup into bowls. Using slotted spoon, place 2 dumplings atop soup in each bowl."
    ],
    "ingredients": [
        "3 pounds eggplant (about 2 large), halved lengthwise",
        "3 tablespoons unsalted butter",
        "1 large onion, chopped",
        "1 fennel bulb, trimmed, chopped",
        "1 small russet potato, peeled, chopped",
        "1 leek (white and pale green parts), sliced",
        "2 garlic cloves, minced",
        "1 1/2 teaspoons dried oregano",
        "1/2 cup dry white wine",
        "7 1/2 cups (or more) chicken stock or canned low-salt chicken broth",
        "1/2 cup whipping cream",
        "1 tablespoon olive oil",
        "3 shallots, chopped",
        "1/2 cup (packed) soft fresh goat cheese (such as Montrachet), crumbled",
        "1/2 cup chopped seeded plum tomatoes",
        "1/4 cup chopped fresh basil",
        "20 wonton wrappers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Tomato",
        "Roast",
        "Vegetarian",
        "Goat Cheese",
        "Basil",
        "Fennel",
        "Leek",
        "Eggplant",
        "White Wine",
        "Fall",
        "Simmer"
    ],
    "title": "Roasted Eggplant Soup with Goat Cheese Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-eggplant-soup-with-goat-cheese-dumplings-104341"
}
