{
    "directions": [
        "Make turkey giblet stock and herbed bread stuffing.",
        "Preheat oven to 425°F.",
        "Rinse turkey inside and out and pat dry. Season with salt and pepper inside and out. Loosely fill neck cavity with some of stuffing. Fold neck skin under body and fasten with a small skewer. Loosely fill body cavity with some stuffing and tie drumsticks together with kitchen string. Transfer remaining stuffing to a buttered 3-quart shallow baking dish and chill, covered. Secure wings to body with small skewers if desired for a nicer appearance.",
        "Put turkey on a rack set in a flameproof roasting pan. Roast turkey in middle of oven 30 minutes. Melt 1/2 stick butter. Reduce oven temperature to 325°F and pour melted butter over turkey. Roast turkey, basting every 20 minutes, for 3 to 3 1/2 hours more, or until a thermometer inserted in center of stuffing in body cavity registers 165°F (thigh will be about 180°F). Transfer turkey to a heated platter and keep juices in pan. Remove skewers and discard string. Transfer stuffing from cavities to a serving dish and keep warm, covered. Let turkey stand at least 30 minutes and up to 45.",
        "Increase temperature to 375°F. Stir together chicken broth and water and drizzle over uncooked stuffing in baking dish. Dot stuffing with remaining 2 tablespoons butter and bake in middle of oven 40 minutes while turkey stands; for moist stuffing, bake covered entire time; for less moist stuffing with a slightly crisp top, uncover after 10 minutes.",
        "Skim fat from pan juices and reserve 1/4 cup fat. Add 1 cup giblet stock to roasting pan and deglaze over moderately high heat, scraping up brown bits. Add to remaining 3 cups stock and bring to a simmer. Whisk together reserved fat and flour in a large heavy saucepan and cook roux over moderately low heat, whisking, 3 minutes. Add hot stock to roux in a fast stream, whisking constantly to prevent lumps, and simmer, whisking occasionally, until thickened, about 10 minutes. Stir in additional juices from turkey platter and season gravy with salt and pepper."
    ],
    "ingredients": [
        "12- to 14-lb kosher turkey, feathers removed if necessary, neck and giblets (excluding liver) reserved for making stock",
        "Herbed bread stuffing",
        "3/4 stick unsalted butter",
        "1/4 cup chicken broth",
        "1/4 cup water",
        "Pan juices reserved from turkey",
        "4 cups turkey giblet stock",
        "1/4 cup all-purpose flour",
        "Garnish: fresh sage, rosemary, and thyme sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Fall",
        "Gourmet"
    ],
    "title": "Roast Turkey with Herbed Bread Stuffing and Giblet Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-herbed-bread-stuffing-and-giblet-gravy-102568"
}
