{
    "directions": [
        "Preheat oven to 500°F.",
        "Trim roots from ramps and slip off outer skin on bulbs if loose. Cut off and reserve leaves, leaving white bulbs attached to slender pink stems.",
        "Put leaves and bulbs in separate bowls.",
        "Pat chicken dry. Put in a flameproof large shallow roasting pan, without crowding, and surround with potatoes. Drizzle with 2 tablespoons oil and rub all over to coat evenly. Arrange chicken skin sides up and season with salt and pepper. Roast in upper third of oven 20 minutes.",
        "Toss bulbs with remaining 1/2 tablespoon oil and season with salt. Scatter bulbs around chicken and roast mixture until breast pieces are just cooked through, 10 to 15 minutes. Transfer breast pieces to a platter and keep warm. Roast remaining chicken and vegetables 5 minutes more, or until cooked through. Transfer to platter and keep warm, loosely covered with foil. (If crisper skin is desired, broil chicken only, skin sides up, about 2 minutes.)",
        "Pour off fat from roasting pan and straddle pan across 2 burners. Add wine and deglaze pan by cooking over high heat, scraping up brown bits.",
        "Boil wine until reduced to about 1/4 cup and add broth. When broth boils, add ramp leaves and stir until wilted and tender, 1 to 2 minutes. Remove with tongs and add to chicken. Boil pan juices until reduced to about 1/2 cup and pour around chicken."
    ],
    "ingredients": [
        "3/4 pound ramps",
        "1 (3- to 3‚-pound) chicken, cut into 8 pieces",
        "1 pound small red potatoes, halved",
        "2 1/2 tablespoons olive oil",
        "1/2 cup dry white wine",
        "1 cup chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Potato",
        "Poultry",
        "Roast",
        "White Wine",
        "Spring",
        "Gourmet"
    ],
    "title": "Roasted Chicken, Ramps, and Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-chicken-ramps-and-potatoes-103313"
}
