{
    "directions": [
        "Mix first 4 ingredients and 1/2 cup brown sugar in small bowl. Rub spice mixture over pork. Place in large glass baking dish. Cover and refrigerate overnight.",
        "Preheat oven to 375°F. Transfer pork to large roasting pan. Reserve juices in glass dish. Roast pork until thermometer inserted into center registers 155°F., about 1 hour 45 minutes, basting with reserved juices from glass dish every 30 minutes.",
        "Meanwhile, combine Port, shallots and remaining 1 tablespoon brown sugar in heavy medium saucepan. Boil until syrupy, about 25 minutes. Add both stocks and thyme. Boil until reduced to 1 1/4 cups, about 30 minutes. Strain sauce. Return to saucepan. Mix any pan drippings from pork into sauce (do not scrape roasting pan). Add butter; whisk until melted. Season with salt and pepper.",
        "Cut pork into 1/4-inch-thick slices. Divide among 6 plates. Spoon Chipotle-glazed Apples alongside, dividing equally. Spoon sauce over and around pork."
    ],
    "ingredients": [
        "2 tablespoons ground cumin",
        "2 teaspoons salt",
        "2 teaspoons ground black pepper",
        "2 teaspoons chili powder",
        "1/2 cup (packed) plus 1 tablespoon golden brown sugar",
        "1 3-pound boneless center-cut pork rib roast",
        "3 cups ruby Port",
        "1/4 cup chopped shallots",
        "1 3/4 cups beef stock or canned beef broth",
        "1 3/4 cups chicken stock or canned low-salt chicken broth",
        "1 fresh thyme sprig",
        "3 tablespoons chilled unsalted butter, cut into small pieces",
        "Chipotle-glazed Apples"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Pork",
        "Roast",
        "Apple",
        "Port",
        "Fall",
        "Winter"
    ],
    "title": "Roast Pork with Port Jus and Chipotle-Glazed Apples",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-with-port-jus-and-chipotle-glazed-apples-101395"
}
