{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Spread green, red, and yellow peppers, green beans, white onion, garlic, broccoli, cauliflower, celery, and mushrooms onto several baking sheets and drizzle with olive oil; toss lightly to coat.",
        "Roast the vegetables in the preheated oven until slightly browned and softened, about 30 minutes, stirring occasionally.",
        "While vegetables are roasting, pour ketchup into a large pot over medium heat and stir in tomatoes, white vinegar, balsamic vinegar, salt, and black pepper; bring to a boil. Reduce heat to low and simmer for 5 minutes; stir in roasted vegetables, black olives, green olives, and basil. Simmer until cooked through, about 5 more minutes.",
        "Sterilize jars and lids in boiling water for at least 5 minutes. Pack the roasted vegetable mixture into the sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, for 24 hours. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "1 green bell pepper, chopped",
        "1 red bell pepper, chopped",
        "1 yellow bell pepper, chopped",
        "1 1/2 cups fresh green beans, cut into 1/2-inch pieces",
        "1 large white onion, finely chopped",
        "12 cloves garlic, pressed",
        "1 head broccoli, finely chopped",
        "1/2 head cauliflower, finely chopped",
        "2 stalks celery, finely chopped",
        "2 cups finely chopped fresh mushrooms",
        "1/4 cup olive oil",
        "2 cups ketchup",
        "4 tomatoes, peeled and chopped",
        "3/4 cup white vinegar",
        "1 dash balsamic vinegar",
        "salt and ground black pepper to taste",
        "1 (6 ounce) can pitted black olives, drained and coarsely chopped",
        "1 (5 ounce) jar pitted green olives, drained and coarsely chopped",
        "1 bunch fresh basil, chopped",
        "12 half-pint canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Veggie Antipasto",
    "url": "http://allrecipes.com/recipe/223533/roasted-veggie-antipasto/"
}
