{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Spread the onion, summer squash, zucchini, eggplant, and red bell pepper out onto two baking sheets with rims; drizzle vegetables with olive oil, and sprinkle with salt and black pepper.",
        "Roast the vegetables in the preheated oven until soft and starting to brown, 20 to 25 minutes; stir and turn over vegetables after about 10 minutes of baking. Decrease oven temperature to 375 degrees F (190 degrees C).",
        "While vegetables are roasting, fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the penne, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.",
        "Grease a 2-quart casserole dish. In a saucepan, mix together the Alfredo sauce with chicken broth, and bring to a boil. Pour the sauce mixture into a large bowl, and stir in the roasted vegetables, penne pasta, 1/4 cup of Parmesan cheese, and 1/4 cup of mozzarella cheese until thoroughly combined. Spoon the mixture into the prepared casserole dish; sprinkle top evenly with breadcrumbs. Cover the dish.",
        "Bake in the hot oven until mixture is bubbling, about 30 minutes. Remove cover, and sprinkle top of casserole with remaining 1/4 cup of Parmesan and 1/4 cup of mozzarella cheeses; return to oven, and bake until the top is lightly browned and the cheese has melted, 5 to 10 more minutes."
    ],
    "ingredients": [
        "1 onion, cut into 1-inch squares",
        "1 small summer squash, thinly sliced",
        "1 small zucchini, thinly sliced",
        "1 eggplant, thinly sliced",
        "1 red bell pepper, cut into chunks",
        "2 tablespoons olive oil, or as needed",
        "salt and ground black pepper to taste",
        "3/4 pound penne pasta",
        "1 (16 ounce) jar Alfredo sauce",
        "1 (14 ounce) can low-sodium chicken broth",
        "1/2 cup grated Parmesan cheese, divided",
        "1/2 cup shredded mozzarella cheese, divided",
        "1/4 cup dry bread crumbs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Veggie Pasta Bake",
    "url": "http://allrecipes.com/recipe/217988/roasted-veggie-pasta-bake/"
}
