{
    "directions": [
        "Peel potatoes and cut into 1/2-inch pieces. In a saucepan of boiling salted water boil potatoes with garlic and bay leaf until tender, about 15 minutes. Drain potato mixture, return it to pan, and cook over high heat, shaking pan, until any excess liquid is evaporated, about 30 seconds. Remove pan from heat and discard bay leaf. Add milk, butter, and thyme. Mash potatoes and garlic with a potato masher until smooth and stir in salt and pepper to taste.",
        "Preheat oven to 450°F.",
        "Rinse chicken inside and out and pat dry completely. Fill cavity loosely with some of stuffing and reserve remaining stuffing in a small baking dish. Truss chicken and rub all over with butter. Season chicken with salt and pepper and arrange, breast side down, on a rack set in a large shallow roasting pan. In a small bowl toss shallots and garlic with oil and add to roasting pan.",
        "Roast chicken in lower third of oven for 30 minutes. Turn chicken breast side up and baste with pan juices. Arrange vegetables and thyme sprigs in pan and season with salt and pepper. Roast chicken and vegetables, stirring and basting frequently, 1 hour, or until a meat thermometer inserted in fleshy part of thigh registers 180°F. During last 30 minutes of roasting bake reserved stuffing, covered with foil.",
        "Let chicken stand 10 minutes before carving. Discard thyme sprigs. Serve chicken, stuffing, and vegetables sprinkled with parsley."
    ],
    "ingredients": [
        "3 pounds russet (baking) potatoes (about 6 large)",
        "1 garlic head, separated into cloves and peeled (about 14 cloves)",
        "1 bay leaf",
        "1/2 cup milk",
        "3 tablespoons unsalted butter, softened",
        "1 tablespoon fresh thyme leaves",
        "a 5-pound whole chicken, giblets reserved for another use",
        "2 tablespoons unsalted butter, softened",
        "12 shallots, peeled",
        "2 garlic heads, outer skins discarded and heads intact",
        "1 tablespoon vegetable oil",
        "6 thin carrots (about 1 pound), peeled and cut into 1-inch pieces",
        "2 small turnips (about 1 pound), peeled and each cut into 8 wedges",
        "6 thin parsnips (about 1 pound), peeled and cut into 2-inch pieces",
        "1 small celery root (about 3/4 pound), peeled and cut into 8 wedges",
        "8 fresh thyme sprigs",
        "chopped fresh parsley leaves for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Potato",
        "Roast",
        "High Fiber",
        "Carrot",
        "Parsnip",
        "Turnip",
        "Winter",
        "Thyme",
        "Shallot",
        "Gourmet"
    ],
    "title": "Roast Chicken with Mashed-Potato Stuffing and Root Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-mashed-potato-stuffing-and-root-vegetables-11623"
}
