{
    "directions": [
        "Preheat oven to 400°F. Wrap beets tightly in foil. Place directly on oven rack. Roast until tender when pierced with knife, about 1 hour. Cool beets. Peel and quarter beets. Transfer to large bowl. Add 2 tablespoons olive oil, 2 teaspoons thyme, salt, and pepper; toss to coat.",
        "Spray 2 large rimmed baking sheets with nonstick spray. Divide onion wedges between prepared baking sheets. Brush onions on both sides with 2 tablespoons oil; sprinkle with 4 teaspoons thyme, salt, and pepper. Arrange onions cut side down and roast until golden brown on bottom, about 10 minutes. Turn onions over. Roast until golden brown and tender, about 10 minutes longer. Transfer to another large bowl.",
        "Divide green beans between same baking sheets. Drizzle beans with remaining 2 tablespoons olive oil, 1/4 cup water, and 2 teaspoons thyme. Sprinkle with salt and pepper. Cover tightly with foil and roast until almost crisp-tender, about 14 minutes. Uncover and continue to roast until water evaporates and beans are crisp-tender, about 5 minutes. Transfer to bowl with onions. (Beets, onions, and green beans can be prepared 2 hours ahead. Let stand at room temperature.)",
        "Drizzle onions and green beans with balsamic vinegar; toss to coat. Season to taste with salt and pepper. Top with beets and serve warm or at room temperature."
    ],
    "ingredients": [
        "10 large beets, trimmed",
        "6 tablespoons extra-virgin olive oil",
        "8 teaspoons chopped fresh thyme",
        "Nonstick vegetable oil spray",
        "4 red onions, each cut into 6 wedges",
        "2 1/2 pounds slender green beans, trimmed, cut into 3-inch lengths",
        "1/4 cup water",
        "3 tablespoons balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Onion",
        "Vegetable",
        "Side",
        "Roast",
        "Vinegar",
        "Green Bean",
        "Beet",
        "Summer",
        "Thyme",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Green Bean, Red Onion, and Beet Salad",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-green-bean-red-onion-and-beet-salad-106619"
}
