{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Stir together 2 tablespoons of smoked paprika, chili powder, 7 1/2 teaspoons curry powder, 4 1/2 teaspoons onion powder, salt, 1 teaspoon garlic powder, black pepper, 1/4 teaspoon sage, and ginger in a small bowl. Pour in 2 tablespoons lemon juice, 1/2 cup chicken broth, and vegetable oil; stir to form a paste.",
        "Rub a little of the paste on the inside cavity of the chicken, then massage the remaining paste all over the chicken, placing it under the skin where you can. Truss the chicken if desired, and place onto a roasting pan.",
        "Roast in preheated oven until the chicken is no longer pink and the juices run clear, about 90 minutes. If using a meat thermometer, be sure the chicken has reached at least 165 degrees F (75 degrees C) in the thickest part of the thigh.",
        "While the chicken is roasting, bring 1 cup chicken broth, water, 2 tablespoons lemon juice, and butter to a boil in a large saucepan. Stir together the couscous 1 tablespoon curry powder, 2 teaspoons onion powder, 2 teaspoons paprika, 1/2 teaspoon sage, 1/4 teaspoon garlic powder, and the bay leaf in a large bowl. Stir the couscous into the boiling liquid, and cook for 3 minutes. Turn the heat off and cover. Keep the couscous warm until the chicken is ready."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=250&h=131&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F116290.jpg",
    "ingredients": [
        "2 tablespoons smoked paprika",
        "1 tablespoon chili powder",
        "7 ½ teaspoons curry powder",
        "4 ½ teaspoons onion powder",
        "1 ¼ teaspoons salt",
        "1 teaspoon garlic powder",
        "¼ teaspoon ground black pepper",
        "¼ teaspoon rubbed sage",
        "1 pinch ground ginger (optional)",
        "2 tablespoons fresh lemon juice",
        "½ cup chicken broth",
        "¼ cup vegetable oil",
        "1 (2 1/2 pound) whole chicken, rinsed and patted dry",
        "1 cup chicken broth",
        "3 cups water",
        "2 tablespoons fresh lemon juice",
        "2 tablespoons butter",
        "2 ¼ cups dry couscous",
        "1 tablespoon curry powder",
        "2 teaspoons onion powder",
        "2 teaspoons smoked paprika",
        "½ teaspoon rubbed sage",
        "¼ teaspoon garlic powder",
        "1  bay leaf"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Curried Chicken with Couscous",
    "url": "http://allrecipes.com/recipe/159251/roasted-curried-chicken-with-couscous/"
}