{
    "directions": [
        "Let rib roast stand at room temperature 1 hour.",
        "Preheat oven to 500°F.",
        "In a small bowl combine crust ingredients, stirring to form a paste.",
        "Pat beef dry and sprinkle with salt and pepper. In a roasting pan roast beef, ribs side down, 30 minutes. Transfer beef to a platter and discard remaining drippings.",
        "Reduce oven temperature to 350°F. Return beef to roasting pan, ribs side down, and spread with peppercorn paste. Roast beef 1 to 1 1/4 hours more, or until a meat thermometer inserted in fleshy section registers 135°F. for medium-rare meat.",
        "Transfer beef to a cutting board and discard strings if necessary. Let beef stand, covered loosely, at least 20 minutes and up to 30 minutes before carving.",
        "Skim fat from drippings in roasting pan. To pan add wine and deglaze over moderately high heat, scraping up brown bits. Boil mixture until reduced by about half and transfer to a saucepan. Add broth and boil 5 minutes.",
        "In a small bowl dissolve cornstarch in Worcestershire sauce and water and add to pan in a stream, whisking. Bring sauce to a boil, whisking, and boil 1 minutes. Season sauce with salt and pepper.",
        "Garnish rib roast and serve with sauce."
    ],
    "ingredients": [
        "a 4-rib standing rib roast (about 7 1/2 to 8 pounds trimmed)",
        "2 teaspoons whole allspice berries, crushed",
        "3 tablespoons pink peppercorns*, crushed lightly",
        "3 tablespoons freeze-dried green peppercorns, crushed lightly",
        "3 tablespoons unsalted butter, softened",
        "2 tablespoons all-purpose flour",
        "1 tablespoon firmly packed brown sugar",
        "1 tablespoon Dijon mustard",
        "1 1/2 teaspoons salt",
        "*available at specialty foods shops",
        "2/3 cup dry red wine",
        "2 cups low-salt beef broth",
        "1 1/2 tablespoons cornstarch",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon water",
        "Garnish: rosemary sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Roast",
        "Red Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Roast Prime Ribs of Beef with Pink and Green Peppercorn Crust and Red-Wine Pan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roast-prime-ribs-of-beef-with-pink-and-green-peppercorn-crust-and-red-wine-pan-sauce-11003"
}
