{
    "directions": [
        "Pat turkey dry. Run hands under skin of turkey, separating skin from breast and thighs. Rub 3 tablespoons rosemary and 3 tablespoons garlic under skin over breast and thighs. Carefully arrange half of prosciutto under skin over breast and thighs. Rub 1 tablespoon rosemary and 1 tablespoon garlic inside cavity of turkey. Sprinkle remaining prosciutto into cavity. Place turkey in heavy large roasting pan. Cover with plastic and chill overnight.",
        "Preheat oven to 450°F. Rub outside of turkey with oil. Season with pepper. Place 1 head of garlic in cavity of turkey. Place 2 heads of garlic in roasting pan. Tie turkey legs together. Roast turkey 30 minutes. Reduce oven temperature to 325°F. Continue roasting turkey until thermometer inserted into thickest part of thigh registers 180°F, basting occasionally with 2 cups broth, about 3 hours. Transfer turkey to platter. Surround with roasted garlic and garlic from turkey cavity. Remove prosciutto from turkey cavity; reserve. Tent turkey with foil.",
        "Pour pan juices into large glass measuring cup. Skim fat from surface of pan juices, reserving 3 tablespoons fat. Set roasting pan over medium-high heat. Add wine and bring to boil, scraping up any browned bits. Add wine mixture to pan juices in cup (liquids should measure 2 1/2 cups; if not, add more both or boil until reduced to 2 1/2 cups).",
        "Heat reserved 3 tablespoons fat in heavy medium saucepan over medium heat. Add flour; stir until golden, about 2 minutes. Whisk in pan juices. Mix in 1/2 teaspoon rosemary. Boil until thickened to sauce consistency, stirring occasionally, about 5 minutes. Mix in reserved prosciutto. Garnish turkey with rosemary springs. Serve with gravy."
    ],
    "ingredients": [
        "1 18- to 20-pound turkey",
        "4 tablespoons plus 1/2 teaspoon minced fresh rosemary",
        "4 tablespoons chopped garlic",
        "8 ounces thinly sliced prosciutto",
        "Olive oil",
        "3 whole heads garlic, each cut in half horizontally",
        "2 cups (or more) canned low-salt chicken broth",
        "1/2 cup dry white wine",
        "3 1/2 tablespoons all purpose flour",
        "Fresh rosemary sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Pork",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Rosemary",
        "Prosciutto"
    ],
    "title": "Roast Turkey with Prosciutto, Rosemary and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-prosciutto-rosemary-and-garlic-965"
}
