{
    "directions": [
        "Combine first 6 ingredients in processor and chop finely. Blend in oil. Transfer marinade to glass baking dish. Add pork tenderloins to marinade, turning to coat. Cover dish with plastic wrap and refrigerate at least 2 hours. (Can be prepared 1 day ahead. Keep refrigerated.)",
        "Cook 1 cup corn kernels in heavy medium pot of boiling salted water until tender, about 2 minutes. Drain well and set aside. Heat 1 tablespoon oil in heavy large saucepan over medium heat. Add onion and garlic and sauté until soft, about 3 minutes. Add flour and stir 2 minutes. Slowly whisk in chicken broth; whisk until mixture thickens and boils. Stir in cream. Bring mixture to simmer. Add remaining 5 cups corn kernels and simmer until mixture is thick, stirring occasionally, about 10 minutes. Cool slightly. Transfer to processor and coarsely puree. Stir in 1 cup cooked corn kernels. (Can be prepared 1 day ahead. Chill.)",
        "Preheat oven to 400°F. Heat 3 tablespoons oil in heavy large ovenproof skillet over medium-high heat. Remove pork from marinade. Add pork to skillet and sauté until brown on all sides, about 5 minutes. Transfer skillet to oven and roast pork until a meat thermometer inserted into center registers 180°F, about 10 minutes.",
        "Bring corn to simmer. Spoon corn onto plates, dividing equally. Slice pork tenderloins and place atop corn, dividing equally. Top with Apple-Raisin Chutney and serve."
    ],
    "ingredients": [
        "1 bunch fresh mint leaves, chopped (about 2/3 cup)",
        "5 garlic cloves",
        "3 fresh rosemary sprigs",
        "2 shallots",
        "1 1/2 teaspoons salt",
        "1 1/2 teaspoons ground black pepper",
        "3/4 cup olive oil",
        "2 12- to 14-ounce pork tenderloins, trimmed",
        "6 cups fresh corn kernels or frozen, thawed",
        "4 tablespoons olive oil",
        "1/2 cup chopped onion",
        "1 garlic clove, minced",
        "3 tablespoons all purpose flour",
        "1 1/2 cups low-salt chicken broth",
        "2 cups whipping cream",
        "Apple-Raisin Chutney"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Garlic",
        "Pork",
        "Roast",
        "Dinner",
        "Mint",
        "Rosemary",
        "Corn",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roast Pork Tenderloin with Creamed Corn and Apple-Raisin Chutney",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-tenderloin-with-creamed-corn-and-apple-raisin-chutney-107862"
}
