{
    "directions": [
        "Preheat the oven to 400°F (200°C).",
        "With the tip of a sharp knife, cut slits 3/4 inch (2 cm) deep all over the pork loin. Insert the garlic slivers into the slits. Sprinkle the meat generously with salt and pepper and place in a roasting pan.",
        "Roast until an instant-read thermometer inserted into the thickest part of the loin away from the bone registers 135°-140°F (57°-60°C) for medium, about 55 minutes. Transfer to a cutting board, tent with aluminum foil, and let rest while you make the sauce.",
        "In a sauté pan over low heat, melt the butter. Add the shallot and sauté slowly until soft, about 5 minutes. Add the broth and let cook until almost totally evaporated, about 5 minutes. Whisk in 2 tablespoons of the mustard and the cream and simmer until the sauce is slightly thickened, about 5 minutes. Stir in 2 tablespoons of the tarragon and season with salt and pepper. Taste and adjust the seasoning with more mustard or tarragon. Remove from the heat and keep warm.",
        "To serve, carve the pork roast into single chops with the bone and arrange on a warmed platter or individual plates. Spoon the sauce over the chops.",
        "Enriching, or finishing, a sauce with cream adds a bit more fat, but it gives the sauce a luscious, velvety quality. Always use heavy (double) cream for this step. Its high fat content keeps it from curdling at high temperatures."
    ],
    "ingredients": [
        "1 bone-in pork loin, 3-4 lb (1.5-2 kg)",
        "3 large cloves garlic, slivered",
        "Salt and ground pepper",
        "4 tablespoons (2 oz/60 g) unsalted butter",
        "3 tablespoons minced shallot",
        "1/2 cup (4 fl oz/125 ml) chicken broth",
        "2-3 tablespoons Dijon mustard",
        "1 cup (8 fl oz/250 ml) heavy (double) cream",
        "2-3 tablespoons chopped fresh tarragon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Pork",
        "Roast",
        "Dinner",
        "Winter",
        "Tarragon",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roast Pork Loin with Tarragon Cream",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-loin-with-tarragon-cream-363211"
}
