{
    "directions": [
        "Place a baking rack in the top of the oven.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Line a baking sheet with aluminum foil.",
        "Spread asparagus spears and eggplant slices on the baking sheet, and drizzle vegetables with 1/4 cup olive oil; sprinkle with garlic powder.",
        "Roast the asparagus and eggplant in the preheated oven until tender, 12 to 15 minutes.",
        "Remove from oven and cool. When cool, roughly chop the vegetables; set aside.",
        "Fill a large pot with lightly salted water and bring to a boil. Stir in penne and return to a boil. Cook, stirring occasionally, until the pasta has cooked through but is still slightly firm, about 9 minutes. Drain well.",
        "Transfer about 1/4 of the penne at a time into a large salad bowl, drizzling each batch with about 1 teaspoon of olive oil and a 1 teaspoon of Parmesan cheese. Stir between additions.",
        "Stir in roasted asparagus and eggplant, lemon juice, 1/4 cup Parmesan cheese, balsamic vinegar, and Worcestershire sauce until thoroughly combined.",
        "Sprinkle pasta salad with salt-free seasoning and black pepper.",
        "Cover the bowl and refrigerate the pasta salad until thoroughly chilled and the flavors have blended, at least 3 hours."
    ],
    "ingredients": [
        "1 pound fresh asparagus, trimmed",
        "2 eggplant, cut crosswise into 3/4-inch-thick slices",
        "1/4 cup extra-virgin olive oil, or as needed",
        "garlic powder, or to taste",
        "1 (1 pound) package whole-wheat penne pasta",
        "extra-virgin olive oil, or as needed",
        "1 1/3 tablespoons grated Parmesan cheese",
        "1/2 lemon, juiced",
        "1/4 cup grated Parmesan cheese",
        "2 teaspoons balsamic vinegar, or to taste",
        "1 dash Worcestershire sauce",
        "1 pinch salt-free seasoning blend",
        "freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Eggplant and Asparagus Pasta Salad",
    "url": "http://allrecipes.com/recipe/220315/roasted-eggplant-and-asparagus-pasta/"
}
