{
    "directions": [
        "Combine water and salt in large stockpot; stir to dissolve salt. Rinse turkey inside and out. Add turkey to brine. Cover pot; refrigerate overnight. Stir butter and jelly in small sauce-pan over medium heat until melted. Mix in marjoram, orange peel and lemon peel. Freeze mixture until semi-firm, whisking occasionally, about 1 hour.",
        "Position rack in bottom third of oven and preheat to 375°F. Drain turkey; pat dry inside and out. Sprinkle shallots in roasting pan. Place turkey atop shallots. Starting at neck end, slide hand between skin and breast meat to loosen skin. Spread 1/2 cup chilled jelly mixture over breast meat under skin and over outside of turkey (reserve remaining jelly mixture for gravy and glaze). If stuffing turkey, spoon stuffing loosely into neck and main cavities. Tuck wing tips under tur-key; tie legs together to hold shape.",
        "Roast turkey 45 minutes, adding some broth to pan if drippings threaten to burn. Reduce oven temperature to 350?F. Cover turkey loosely with foil. Roast until thermometer inserted into thigh registers 180?°F, adding more broth to pan if necessary to keep drippings from burning and basting turkey occasionally with drippings, about 3 hours longer if unstuffed or 3 1/2 hours longer if stuffed. If necessary, uncover turkey during last 20 minutes to brown skin. Transfer turkey to platter. Tent with foil; let stand 30 minutes. Re-serve mixture in pan for gravy.",
        "Strain pan juices into large measuring cup; spoon off fat. Add Giblet Stock; if necessary, add enough broth to measure 4 cups. Transfer mixture to large saucepan; bring to boil. Stir 4 tablespoons reserved jelly mixture and flour in bowl to form paste. Whisk paste into stock mixture. Add Port and citrus juices; boil until reduced enough to coat spoon thickly, about 12 minutes. Mix in orange peel. Season with salt and pepper.",
        "Brush warm turkey with enough remaining jelly mixture to glaze."
    ],
    "ingredients": [
        "7 quarts water",
        "1 cup salt",
        "1 16- to 18-pound turkey, neck, heart and gizzard reserved for Giblet Stock",
        "9 tablespoons butter",
        "1/2 cup red currant jelly",
        "4 teaspoons chopped fresh marjoram",
        "1 tablespoon grated orange peel",
        "1 tablespoon grated lemon peel",
        "1 cup sliced shallots",
        "1 cup (or more) canned low-salt chicken broth",
        "Giblet Stock",
        "1/2 cup (about) canned low-salt chicken broth",
        "1/4 cup all purpose flour",
        "1/4 cup ruby Port",
        "2 tablespoons fresh orange juice",
        "2 tablespoons fresh lemon juice",
        "1/4 teaspoon grated orange peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Port",
        "Shallot",
        "Jam or Jelly"
    ],
    "title": "Roast Turkey with Red Currant Jelly and Citrus Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-red-currant-jelly-and-citrus-glaze-100380"
}
