{
    "directions": [
        "Stir jelly, 1/2 cup butter, apple juice concentrate and 2 tablespoons tarragon in small saucepan over medium heat until butter and jelly melt. Remove glaze from heat. (Can be made 2 days ahead. Cover and chill. Bring to room temperature and rewhisk before using.)",
        "Set rack at lowest position in oven and preheat to 375°F. Place small rack in center of large roasting pan. Melt 1/4 cup butter in heavy large skillet over medium-high heat. Add mushrooms, onion and carrot; saut\u2029 until dark brown, about 12 minutes. Sprinkle vegetables and turkey neck pieces around rack in pan.",
        "Stir remaining 6 tablespoons butter and 2 tablespoons tarragon in heavy small saucepan until butter melts. Rinse turkey inside and out; pat dry with paper towels. Place turkey on rack in pan. Starting at neck end, slide hand between skin and breast meat to loosen skin. Brush 3 tablespoons tarragon butter over breast meat under skin. If stuffing turkey, spoon stuffing loosely into main cavity. Brush remaining tarragon butter over outside of turkey. Sprinkle turkey with salt and pepper. Tuck wing tips under turkey; tie legs together to hold shape.",
        "Roast turkey 45 minutes. Reduce oven temperature to 350°F; add 1 cup broth to pan. Cover turkey loosely with foil. Roast until thermometer inserted into thickest part of thigh registers 180°F., adding 1 cup broth and basting with pan juices every 1/2 hour and brushing with 1/3 cup glaze twice during last 2 hours, about 4 1/4 hours longer if unstuffed or 4 3/4 hours longer if stuffed.",
        "Transfer turkey to platter. Tent with foil; let stand 1/2 hour. Reserve pan juices.",
        "Mix 1/2 cup glaze and flour in small bowl to blend. Strain pan juices into large measuring cup, pressing on solids; spoon off fat. Add enough broth to measure 6 cups.",
        "Sauté bacon in heavy large saucepan over medium heat until crisp. Pour off fat. Add broth mixture to saucepan and bring to boil. Whisk in glaze-flour mixture and tarragon, then applejack. Simmer until thickened to sauce, about 5 minutes. Season with salt and pepper."
    ],
    "ingredients": [
        "1 10-ounce jar crabapple jelly",
        "3/4 cup plus 6 tablespoons (2 1/4 sticks) butter",
        "1/3 cup frozen apple juice concentrate, thawed",
        "4 tablespoons chopped fresh tarragon",
        "12 ounces mushrooms, quartered",
        "1 large onion, coarsely chopped",
        "1 large carrot, coarsely chopped",
        "1 22- to 24-pound turkey, neck cut into 4 pieces",
        "10 cups (about) canned low-salt chicken broth",
        "1/4 cup all purpose flour",
        "3 cups (about) canned low-salt chicken broth",
        "8 bacon slices, cut into 1/2-inch pieces",
        "2 tablespoons chopped fresh tarragon",
        "1/4 cup applejack or other apple brandy (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Mushroom",
        "Onion",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Bacon",
        "Brandy",
        "Fall",
        "Tarragon",
        "Jam or Jelly"
    ],
    "title": "Roast Turkey with Bacon, Tarragon and Applejack Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-bacon-tarragon-and-applejack-gravy-100365"
}
