{
    "directions": [
        "Place racks in lower and upper thirds of oven; preheat to 375°F. Pulse flour and almonds in a food processor until almonds are very finely ground. Add baking powder and salt and pulse to blend. Using an electric mixer on high speed, beat butter and sugar until light and fluffy, about 4 minutes. Add egg and vanilla and beat until pale and fluffy, about 4 minutes. Reduce speed to low and gradually add dry ingredients; mix just to combine.",
        "Place sanding sugar in a shallow bowl. Scoop out dough by the tablespoonful and roll into balls (if dough is sticky, chill 20 minutes). Roll in sugar and place on 2 parchment-lined baking sheets, spacing 2\" apart. Using your thumb, make a deep indent in each ball. (For more exaggerated cracks, bake dough 5 minutes before indenting.)",
        "Bake cookies, rotating baking sheets halfway through, until golden, 12–14 minutes. Transfer to wire racks and let cool. Fill with jam or curd (use a small spoon).",
        "MAKE AHEAD: Cookies can be baked (but not filled) 2 weeks ahead; wrap tightly and freeze. Thaw before filling. Cookies can be filled 1 day ahead; store airtight at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1 1/2 cups unsalted, roasted almonds",
        "1 teaspoon baking powder",
        "1/2 teaspoons kosher salt",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1/2 cup granulated sugar",
        "1 large egg",
        "1 teaspoon vanilla extract",
        "1/2 cup coarse sanding or raw sugar",
        "Jams and/or lemon curd (for filling)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Kid-Friendly",
        "Tree Nut",
        "Almond",
        "Edible Gift",
        "Christmas Eve",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted-Almond Thumbprints",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-almond-thumbprints-51205400"
}
