{
    "directions": [
        "Tuck wing tips under chicken. Starting at neck opening, gently loosen skin from breast of chicken. Slide 2 sage leaves, 1 thyme sprig, and 1 rosemary sprig under skin of each chicken breast half. Sprinkle 1/4 teaspoon coarse salt inside chicken cavity and insert 1 thyme sprig and 1 rosemary sprig into cavity. Sprinkle outside of chicken all over with 2 teaspoons coarse salt. Place chicken, breast side up, on plate. Let stand uncovered at room temperature 2 hours or cover and chill overnight.",
        "Position oven rack in lower third of oven; preheat to 450°F. Coat large rimmed baking sheet with nonstick spray. Place chicken in center of prepared sheet. Place beets in medium bowl. Add 2 teaspoons olive oil, 1/2 tablespoon chopped thyme, 1/2 tablespoon chopped rosemary, and 1 teaspoon chopped sage; sprinkle with salt and pepper and toss to coat. Place parsnips and Jerusalem artichokes in another medium bowl. Add remaining 2 teaspoons olive oil, 1/2 tablespoon chopped thyme, 1/2 tablespoon chopped rosemary, and 1 teaspoon chopped sage; sprinkle with salt and pepper and toss to coat. Arrange all vegetables around chicken on sheet. Roast chicken and vegetables 20 minutes. Reduce heat to 375°F. Roast until instant-read thermometer inserted into thickest part of chicken thigh registers 165°F and vegetables are tender, turning vegetables occasionally, about 50 minutes longer.",
        "Using tongs, tilt chicken to allow juices to drain from main cavity onto baking sheet. Transfer chicken to platter. Arrange vegetables around chicken. Place baking sheet over 2 burners. Add beer to baking sheet and boil until pan juices are slightly reduced, scraping up browned bits, 3 to 4 minutes. Season juices to taste with salt and pepper. Transfer juices to small pitcher. Serve chicken and vegetables, passing pan juices alongside."
    ],
    "ingredients": [
        "1 4-to 4 1/2-pound chicken",
        "4 large fresh sage leaves plus 2 teaspoons chopped fresh sage, divided",
        "3 fresh thyme sprigs plus 1 tablespoon chopped fresh thyme, divided",
        "3 fresh rosemary sprigs plus 1 tablespoon chopped fresh rosemary, divided",
        "2 1/4 teaspoons coarse kosher salt",
        "Nonstick vegetable oil spray",
        "3 2 1/2-inch-diameter golden beets, peeled, cut into 3/4-inch wedges",
        "4 teaspoons extra-virgin olive oil, divided",
        "1 pound parsnips, peeled, quartered lengthwise, cut crosswise into 1 1/2-inch pieces",
        "8 to 10 ounces Jerusalem artichokes (also called sunchokes), scrubbed, halved lengthwise, cut crosswise into 1-inch pieces",
        "1 cup lager or pale ale",
        "Ingredient info: Jerusalem artichokes, the tubers of a variety of sunflower, are available in the produce section of some supermarkets and at farmers' markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beer",
        "Chicken",
        "Herb",
        "Roast",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Beet",
        "Parsnip",
        "Jerusalem Artichoke",
        "Fall",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roast Chicken with Parsnips, Golden Beets, and Jerusalem Artichokes with Beer Pan Juices",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-parsnips-golden-beets-and-jerusalem-artichokes-with-beer-pan-juices-361289"
}
