{
    "directions": [
        "Melt butter in heavy large saucepan over medium heat. Add cabbage; sauté 2 minutes. Add 2 cups juice, 1 cup wine, vinegar, sugar, orange and cinnamon. Simmer until cabbage is tender and almost all liquid has evaporated, stirring occasionally, about 1 hour. Discard orange. Season to taste with salt and pepper. (Cabbage can be made 1 day ahead. Cool slightly. Refrigerate uncovered until cool, then cover and chill.)",
        "Preheat oven to 450°F. Place duck on rack in roasting pan. Place 10 prunes and apple in duck cavity. Sprinkle duck with salt and pepper. Roast duck 25 minutes. Reduce oven temperature to 350°F. Continue roasting until meat thermometer inserted into thickest part of thigh registers 160°F, about 1 hour 15 minutes.",
        "Meanwhile, combine remaining 1 cup juice and 16 prunes in heavy medium saucepan. Cook over medium heat until prunes absorb almost all liquid, stirring occasionally, about 10 minutes.",
        "Transfer duck to platter. Tent with foil to keep warm. Pour off fat from pan. Add remaining 3/4 cup wine to roasting pan, set over medium heat and bring to boil, scraping up any browned bits. Add wine mixture to prune mixture; simmer until sauce is reduced to 1 cup, about 4 minutes.",
        "Bring cabbage to simmer, tossing occasionally. Slice duck; arrange on plates. Spoon prune sauce over. Serve cabbage alongside."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) butter",
        "6 cups thinly sliced red cabbage (from half of large head)",
        "3 cups blackberry-cranberry juice",
        "1 3/4 cups dry red wine",
        "1/2 cup red wine vinegar",
        "1/4 cup sugar",
        "1/2 orange, sliced",
        "1 cinnamon stick",
        "1 5 1/4-pound duck",
        "26 large prunes, pitted",
        "1 Granny Smith apple, halved, cored, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Duck",
        "Fruit",
        "Poultry",
        "Vegetable",
        "Braise",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Dried Fruit",
        "Prune",
        "Apple",
        "Red Wine",
        "Winter",
        "Cabbage",
        "Christmas Eve",
        "Party"
    ],
    "title": "Roast Duck with Prunes and Wine-Braised Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/roast-duck-with-prunes-and-wine-braised-cabbage-104500"
}
