{
    "directions": [
        "Stir coriander seeds in small skillet over medium-high heat until darkened in color and fragrant, about 4 minutes. Cool seeds; grind in spice mill or enclose in plastic bag and crush finely with mallet. Place seeds in small bowl. Mix in butter, sugar, orange peel, and lemon peel. Season butter with salt and pepper. (Can be made 1 week ahead. Cover and chill.)",
        "Position rack in bottom third of oven and preheat to 375°F. Spray heavy large rimmed baking sheet with nonstick spray. Toss yams and olive oil in large bowl to coat. Spread yams in single layer on prepared sheet. Sprinkle with salt and pepper. Roast until tender and golden brown, stirring occasionally, about 30 minutes. (Can be prepared 1 day ahead. Cover and refrigerate on sheet.)",
        "Drop butter onto yams in small dollops. Roast until heated through, glazed, and browned, stirring occasionally, about 20 minutes (or 25 minutes if refrigerated). Season with salt and pepper. Mound in bowl; sprinkle with parsley."
    ],
    "ingredients": [
        "1 tablespoon coriander seeds",
        "1/4 cup (1/2 stick) butter, room temperature",
        "1 tablespoon golden brown sugar",
        "1 tablespoon grated orange peel",
        "1 1/2 teaspoons grated lemon peel",
        "Nonstick vegetable oil spray",
        "3 pounds long narrow yams (red-skinned sweet potatoes), unpeeled, halved lengthwise, cut crosswise into 1/2-inch-thick slices",
        "1 1/2 tablespoons olive oil",
        "2 tablespoons minced fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "Lemon",
        "Orange",
        "Sweet Potato/Yam",
        "Fall",
        "Healthy",
        "Coriander",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted Yams with Citrus and Coriander Butter",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-yams-with-citrus-and-coriander-butter-108836"
}
