{
    "directions": [
        "Toast pistachios in a dry skillet over medium-low heat, stirring occasionally, until golden brown, about 6 minutes. Transfer to a small plate and let cool. Add sesame seeds, coriander seeds, cumin seeds, fennel seeds, and peppercorns to same skillet. Toast, stirring often, until fragrant, 1-2 minutes. Transfer spices to plate with nuts and let cool. Transfer nut and spice mixture and 1 teaspoon salt to a food processor or a mortar and pestle and coarsely grind. DO AHEAD: Dukkah spice blend can be made 1 week ahead. Store airtight at room temperature.",
        "Preheat oven to 425°F. Place the carrots on a rimmed baking sheet. Drizzle with melted butter, season to taste with salt and pepper, and toss to coat. Roast until the carrots are tender and just beginning to brown, about 25 minutes. Let the carrots cool slightly.",
        "Transfer the carrot mixture to a blender. Add the vegetable broth. Blend mixture until soup is very smooth, 1-2 minutes. Pour the soup into a medium saucepan and bring to a gentle simmer over medium heat, stirring occasionally. Add water by 1/4-cupfuls to soup for a thinner consistency, if desired. Season soup to taste with salt and pepper.",
        "Divide hot soup among bowls. Spoon a dollop of yogurt into center of each. Sprinkle with dukkah."
    ],
    "ingredients": [
        "1/2 cup unsalted, shelled raw natural pistachios",
        "2 tablespoons sesame seeds",
        "2 teaspoons coriander seeds",
        "2 teaspoons cumin seeds",
        "1/2 teaspoon fennel seeds",
        "1/4 teaspoon whole black peppercorns",
        "1 teaspoon kosher salt plus more",
        "2 pounds carrots, peeled, cut into",
        "2 tablespoons (1/4 stick) unsalted butter, melted",
        "Freshly ground black pepper",
        "1 quart vegetable broth",
        "Low-fat plain Greek yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Vegetarian",
        "Quick & Easy",
        "Yogurt",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Carrot",
        "Winter",
        "Healthy",
        "Low Cholesterol",
        "Potluck",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Carrot Soup with Dukkah Spice and Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-carrot-soup-with-dukkah-spice-and-yogurt-51134010"
}
