{
    "directions": [
        "Whisk 1/2 cup oil, garlic, and mustard in small bowl to blend. Transfer 1/3 cup mustard mixture to large bowl; add potatoes and toss to coat. Brush remaining mustard mixture over lamb. Transfer to large rimmed baking sheet.",
        "Puree all ingredients except mint sprigs in processor.",
        "Preheat oven to 425°F. Heat 1 tablespoon oil in large skillet over medium-high heat. Add 1 lamb rack, rounded side down, and cook until brown, about 3 minutes. Return to baking sheet. Repeat with remaining lamb rack. Let stand until cool enough to handle, about 10 minutes. Arrange racks facing each other, bone ends up and brown side out, about 2 inches apart on same baking sheet; tip toward each other, intertwining bones loosely. Scatter potatoes around lamb.",
        "Roast lamb and potatoes until thermometer inserted into center of lamb registers 130°F for medium-rare, about 20 minutes. Transfer lamb to platter and tent with foil. Continue roasting potatoes until cooked through and crisp, stirring once, about 15 minutes longer. Surround lamb with potatoes, garnish with mint sprigs, and serve with pesto."
    ],
    "ingredients": [
        "1/2 cup plus 1 tablespoon olive oil",
        "6 garlic cloves, minced",
        "2 tablespoons Dijon mustard",
        "1 3/4 pounds unpeeled new red potatoes (about 22 1 1/2-inch-diameter), scrubbed, quartered",
        "2 racks of lamb (about 1 1/4 to 1 1/2 pounds each), trimmed, frenched",
        "2 cups (packed) fresh mint leaves",
        "3/4 cup olive oil",
        "1/4 cup fresh lemon juice",
        "4 garlic cloves",
        "1 teaspoon salt",
        "1/2 teaspoon dried crushed red pepper",
        "Fresh mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Lamb",
        "Potato",
        "Roast",
        "Easter",
        "Mint",
        "Spring"
    ],
    "title": "Roast Racks of Lamb with New Potatoes and Mint Pesto",
    "url": "http://www.epicurious.com/recipes/food/views/roast-racks-of-lamb-with-new-potatoes-and-mint-pesto-109391"
}
