{
    "directions": [
        "In a heavy, nonstick fry pan over medium heat, combine the brown sugar and water. Bring to a boil and cook until the mixture thickens slightly, about 20 seconds. Add the walnuts and sauté until the nuts are lightly toasted and coated with the sugar mixture, about 4 minutes. Transfer the nuts to a piece of parchment paper and sprinkle with salt. Using a fork, separate the nuts and let cool completely.",
        "Preheat an oven to 400°F (200°C). Brush a large rimmed baking sheet with olive oil.",
        "Place the squash in a bowl, drizzle with 1 Tbs. of the olive oil, sprinkle with 1 tsp. of the curry powder and toss to coat evenly. Spread the squash cubes in a single layer on the prepared baking sheet and season with salt and pepper. Roast, stirring once, until tender and golden brown, 23 to 25 minutes. Let cool completely.",
        "In a small bowl, whisk together the shallot, vinegar, the remaining 1/2 tsp. curry powder and the remaining 3 Tbs. olive oil.",
        "In a large bowl, combine the salad greens, squash and pear. Add about two-thirds of the vinaigrette and toss to coat. Taste and add more vinaigrette if needed. Top the salad with the goat cheese and walnuts and serve immediately. Serves 2 to 4.",
        "Adapted from Williams-Sonoma",
        "Healthy Dish of the Day,",
        "by Kate McMillan (Weldon Owen, 2014)."
    ],
    "ingredients": [
        "1/4 cup (2 oz./60 g) firmly packed light brown sugar",
        "4 tsp. water",
        "1 cup (4 oz./125 g) walnut halves",
        "Salt, to taste",
        "Olive oil for brushing, plus 4 Tbs. (2 fl. oz./60 ml)",
        "1 acorn squash, halved, seeded, peeled and cut into 3/4-inch\n  (2-cm) cubes",
        "1 1/2 tsp. curry powder",
        "Freshly ground pepper, to taste",
        "2 Tbs. minced shallot",
        "2 Tbs. white wine vinegar",
        "6 cups (6 oz./185 g) mixed salad greens, preferably including\n  radicchio and arugula",
        "1 large pear, peeled, cored and diced",
        "2 oz. (60 g) crumbled fresh goat cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Roasted Squash Salad with Curry Vinaigrette",
    "url": "http://www.williams-sonoma.com/recipe/roasted-squash-salad-with-curry-vinaigrette.html"
}
