{
    "directions": [
        "Preheat oven to 350°F. Trim all fat and silver skin from lamb. Cut small slits all over lamb with a sharp knife and put a slice of garlic and a pinch of thyme and rosemary into each slit.",
        "Peel potatoes and thinly slice about 1/16 inch thick with a mandoline or other manual slicer, then toss with 4 tablespoons oil, 1 1/2 teaspoons salt, and 1/2 teaspoon pepper in a large bowl. Spread potatoes evenly in a 17- by 12- by 2-inch casserole or roasting pan. Put lamb on top of potatoes, then rub with honey and sprinkle with remaining 2 1/2 teaspoons salt and 1/2 teaspoon pepper.",
        "Roast lamb in middle of oven 1 hour, then drizzle with 1 tablespoon oil. Continue to roast until an instant-read thermometer inserted into thickest part of lamb (do not touch bone) registers 135°F for medium-rare, 30 to 45 minutes more. Let lamb stand, covered loosely with foil, 15 minutes.",
        "While lamb stands, heat remaining 2 tablespoons oil in a 4- to 6-quart heavy pot over moderately high heat until hot but not smoking, then sauté minced garlic, stirring, until fragrant, about 30 seconds. Add a handful of greens and sauté, tossing with tongs, then add more greens as preceding ones wilt and sauté until all greens are wilted and tender, 5 to 6 minutes total. Season with salt and pepper.",
        "Transfer lamb to a cutting board and carve, then serve with potatoes and greens."
    ],
    "ingredients": [
        "1 (6- to 8-pounds) leg of lamb, aitchbone removed by butcher and leg left untied",
        "3 large garlic cloves, 2 thinly sliced and 1 minced",
        "1 tablespoon chopped fresh thyme",
        "2 teaspoons chopped fresh rosemary",
        "4 pounds yellow-fleshed potatoes",
        "7 tablespoons extra-virgin olive oil",
        "4 teaspoons salt",
        "1 teaspoon black pepper",
        "2 tablespoons honey",
        "1 1/4 pounds mixed tender greens (16 cups) such as arugula, mizuna, kale, or dandelion, tough stems or ribs removed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Lamb",
        "Potato",
        "Roast",
        "Sauté",
        "Spring",
        "Gourmet"
    ],
    "title": "Roast Leg of Lamb on a Bed of Potatoes and Wilted Greens",
    "url": "http://www.epicurious.com/recipes/food/views/roast-leg-of-lamb-on-a-bed-of-potatoes-and-wilted-greens-106267"
}
