{
    "directions": [
        "Trim leeks, discarding dark green part, and halve lengthwise. Cut leeks crosswise into 1/2-inch-thick slices and in a large bowl of cold water wash well. Drain leeks.",
        "In a 12-inch heavy ovenproof skillet cook leeks and onions in oil over moderate heat, stirring, until softened, about 15 minutes. Add garlic and cook, stirring, 1 minute. Add flour and cook, stirring, 3 minutes. Add broth in a stream, stirring, and simmer, stirring, until thickened, about 3 minutes. Stir in lemon juice and salt and pepper to taste and remove skillet from heat.",
        "Preheat oven to 400°F.",
        "Peel potatoes and halve lengthwise. Arrange each potato flat side down and make crosswise slices about 1/4 inch apart, cutting down to about 1/4 inch from flat side but not all the way through (a metal skewer inserted lengthwise about 1/4 inch from flat side will prevent slicing all the way through). Remove skewer if using.",
        "Arrange potato halves, flat sides down, in leek mixture and bring mixture to a simmer. Brush potatoes with butter and sprinkle with paprika and salt and pepper to taste. Bake mixture in lower third of oven 1 hour and 15 minutes, or until potatoes are tender within and crisp and golden on top."
    ],
    "ingredients": [
        "3 pounds leeks",
        "3 large onions, sliced (about 6 cups)",
        "3 tablespoons vegetable oil",
        "2 large garlic cloves, minced",
        "1 tablespoon all-purpose flour",
        "1 1/2 cups chicken broth",
        "1 tablespoon fresh lemon juice",
        "4 russet (baking) potatoes (about 2 pounds)",
        "2 tablespoons unsalted butter, melted",
        "paprika to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Potato",
        "Appetizer",
        "Side",
        "Roast",
        "Leek",
        "Fall",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Roasted Potato Fans with Creamed Leeks",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-potato-fans-with-creamed-leeks-10847"
}
