{
    "directions": [
        "Put the radishes, carrots and celery root in a medium bowl. In a small saucepan, combine the vinegar, water, the sugar and salt. Bring to a boil over high heat, stirring until the sugar and salt are dissolved. Pour the pickling liquid over the radishes, carrots and celery, and cover with a plate to keep them submerged. Let cool to room temperature.",
        "Cover the bowl with plaster wrap and refrigerate for about an hour. Transfer the pickles and liquid to a container, cover and refrigerate.",
        "In a medium skillet, heat the oil over medium-low-heat. Add the leek, shallot and garlic and cook until soft, about 7 minutes. Season with salt and pepper and set aside to cool. Meanwhile, make the brown butter. In a small skillet, cook the butter over medium heat, swirling the pan, until the better melts and the milk solids turn golden brown, about 3 minutes. Set aside to cool.",
        "Preheat the oven to 450°F, or prepare an outdoor grill and let the coals burn until they turn white.",
        "To keep the oysters from tipping, spread the rock salt in a large baking pan and nestle the oyster in the salt, being careful not to spill the juices. With a spoon, gently lift each oyster from the shell, slip about 1/4 teaspoon of the cooked leek mixture into the shell, and set the oyster on top. Drizzle with a little brown butter.",
        "Bake in the over or cook on the grill until the oysters are just heated through, about 5 minutes. Top each oyster with a few pieces of pickled radishes, carrots, celery root and chives."
    ],
    "ingredients": [
        "1 1/2 tablespoons olive oil",
        "1/4 cup minced leek (white part)",
        "1 shallot, minced",
        "1 garlic clove, minced",
        "Salt and pepper",
        "6 tablespoons (3/4 stick) unsalted butter, cubed",
        "20 oysters on the half shell (detached from the bottom shells)",
        "1/2 cup minced radishes",
        "1/2 cup minced carrot",
        "1/2 cup minced celery root",
        "3/4 cup rice vinegar",
        "1/4 cup water",
        "1/4 cup sugar",
        "1 tablespoon kosher salt",
        "5 cups rock salt",
        "1/4 cup pickled radishes, carrots, and celery root",
        "2 tablespoons minced chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Oyster",
        "Party",
        "Appetizer",
        "Pickles",
        "Radish",
        "Leek",
        "Epi + USHG",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roasted Oysters with Pickled Radishes, Carrots and Celery Root",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-oysters-with-pickled-radishes-carrots-and-celery-root"
}
