{
    "directions": [
        "Put the duck, breast side down, on a cutting board and using kitchen shears, cut up 1 side of the spine, starting at the tail or pope's nose, all the way to the top. Turn the bird around and cut back down the other side of the spine, being careful not to cut into the thigh. Press down on the bird to flatten and make a shallow cut through the breastbone to further flatten the duck. Remove the neck flap and any extra pockets of fat. Turn the duck over, breast side up, and make a long slash in the skin and fat of each breast, making sure not to puncture the meat.",
        "Sprinkle both sides of the duck with the kosher salt and lay the duck, breast side up, on top of a broiler pan. Line the bottom of the pan with paper towels. Put the duck, uncovered, on the bottom shelf of the refrigerator for 3 to 4 days or until the skin is dry and reaches a near parchment consistency.",
        "Preheat the oven to 350 degrees F.",
        "If there is still salt visible, brush it off. Remove the paper towels from the bottom of the pan. Put the pan in the middle of the oven and roast for 30 minutes. Rotate the pan 180 degrees and continue to cook until the thigh reaches an internal temperature of 180 degrees F on an instant-read thermometer, about 30 more minutes.",
        "Remove the duck from the oven and increase the heat to 450 degrees F. Once the oven has come to temperature, return the duck to the oven and roast until the skin is golden brown and crispy, about 10 minutes.",
        "Remove the top of the broiler pan, with the duck still on it, and put it on a sheet pan to rest. Pour off the duck fat from the bottom of the pan, measure 1/4 cup, and reserve the rest for another use.",
        "Decrease the oven heat to 350 degrees F.",
        "Put the broiler pan on the stove over medium heat and add the 1/4 cup of the fat. Add the onions, celery, salt, and pepper. Cook, stirring frequently, until the onions and celery are translucent, approximately 10 minutes.",
        "Meanwhile, combine the cornbread, oyster crackers, thyme, sage, eggs, oysters and their liquor in a large mixing bowl and use your hands to mix well, breaking up the oysters as you go. Add the onion and celery mixture to the bowl and stir to combine. Transfer the dressing back into the broiler pan and spread evenly. Put the dressing on the middle rack of the oven and bake until golden brown and crisp around the edges, about 30 to 35 minutes. Transfer the duck to a serving platter and serve with the dressing."
    ],
    "ingredients": [
        "5 to 5 1/2 pound Peking duck, giblets removed",
        "3 teaspoons kosher salt per pound of duck, approximately 1/3 cup",
        "1/4 cup duck fat",
        "1 1/2 cups chopped onions",
        "1 cup chopped celery",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 pound stale cornbread, crumbled",
        "5 ounces oyster crackers, crumbled",
        "1 1/2 teaspoons dried thyme",
        "1 teaspoon dried sage",
        "2 eggs, lightly beaten",
        "1 pint small oysters with their liquor"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Stuffing",
        "Cornbread",
        "Onion Recipes",
        "Vegetable",
        "Celery",
        "Egg Recipes",
        "Duck Recipes",
        "Poultry Recipes",
        "Oyster Recipes",
        "Shellfish Recipes",
        "Main Dish Recipes",
        "Holiday",
        "Winter",
        "Broiling",
        "Roasting"
    ],
    "title": "Roast Duck with Oyster Dressing",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/roast-duck-with-oyster-dressing-recipe"
}
