{
    "directions": [
        "Preheat oven to 425°F.",
        "Rinse turkey inside and out and pat dry. Season with salt and pepper inside and out. Fold neck skin under body and secure with a small skewer. Tie drumsticks together with kitchen string and secure wings to body with small skewers.",
        "Put turkey on a rack set in a large flameproof roasting pan. Roast turkey in middle of oven 30 minutes.",
        "While turkey is roasting, blanch onions in boiling water 1 minute and rinse under cold water. Peel onions, then toss with 1 tablespoon melted butter and salt and pepper to taste. Toss apples with 1 tablespoon melted butter and salt and pepper to taste in another bowl.",
        "Reduce temperature to 350°F. Brush remaining 1/4 cup melted butter over turkey and roast 30 minutes more.",
        "Baste turkey and scatter onions around it, then roast 30 minutes more.",
        "Baste turkey and add apples to roasting pan. Roast another 1 to 1 1/2 hours, or until a thermometer inserted into fleshy part of a thigh registers 180°F.",
        "Transfer turkey, onions, and apples to a heated platter, leaving juices in pan. Remove skewers and discard string. Let turkey stand at least 30 minutes, up to 45.",
        "Skim fat from pan juices and reserve 1/4 cup fat. Pour pan juices into a 2-quart glass measure and add enough turkey giblet stock to make 4 1/2 cups total. Set pan to straddle 2 burners. Add 1 cup stock mixture and deglaze by boiling over moderately high heat, stirring and scraping up brown bits. Add remaining 3 1/2 cups stock mixture, cider, and vinegar and bring to a simmer. Transfer to glass measure.",
        "Whisk together reserved fat and flour in a large heavy saucepan and cook roux over moderately low heat, whisking, 3 minutes. Add hot stock mixture in a fast stream, whisking constantly to prevent lumps, then simmer, whisking occasionally, until thickened, about 10 minutes.",
        "Stir in any additional turkey juices from platter and season gravy with salt and pepper. Pour gravy through a fine sieve into a gravy boat."
    ],
    "ingredients": [
        "1 (12- to 14-pound) turkey (preferably kosher), feathers removed if necessary and neck and giblets (excluding liver) reserved for making stock",
        "1 pound pearl onions (preferably red)",
        "unsalted butter",
        "16 to 20 (2-inch) Lady apples (2 pounds)",
        "Pan juices from roast turkey",
        "About 4 cups Turkey Giblet Stock",
        "1 cup apple cider",
        "2 tablespoons cider vinegar",
        "1/4 cup all-purpose flour",
        "Accompaniment: Fried Sage Leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Onion",
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Apple",
        "Fall",
        "Sage",
        "Gourmet"
    ],
    "title": "Roast Turkey with Apples, Onions, Fried Sage Leaves, and Apple Cider Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-apples-onions-fried-sage-leaves-and-apple-cider-gravy-104276"
}
