{
    "directions": [
        "Heat oil in heavy large skillet over medium-high heat. Add chicken wings and sauté until deep brown, about 15 minutes. Add carrots and celery to skillet; sauté 5 minutes. Add both broths; bring to boil. Reduce heat, cover, and simmer 1 hour. Strain, reserving broth and discarding wings and vegetables. If necessary, return broth to skillet and boil until reduced to 1 cup; reserve for sauce.",
        "Using small brush, scrub fresh or frozen truffles under cold running water. Using sharp thin knife, remove peel from truffles and reserve for sauce. Thinly shave truffles using V-slicer or truffle shaver; cover and set aside.",
        "Pat duck breasts dry with paper towels. Cut off any sinew from breast meat. Place breasts on work surface. Using fingers or small sharp knife, pull or cut skin with fat away from meat from both long sides of duck breast almost to center, leaving 1-inch-wide strip of fat attached to meat in center (do not cut through center strip). Lift up flaps of duck skin and fat and arrange sliced truffles over breast meat under fat on each, dividing equally. Press skin flaps down over truffles to cover completely. Using sharp knife, score top of duck skin in 1/2-inch diamond pattern, being careful not to cut through fat. (Can be made 1 day ahead. Cover broth, duck, and truffle peel separately and chill.)",
        "Preheat oven to 400°F. Heat heavy large ovenproof skillet over medium heat. Sprinkle duck breasts with salt and pepper. Place duck, skin side down, in skillet. Cook until skin is deep golden and crisp and fat renders, occasionally pouring off accumulated drippings from pan, about 10 minutes. Turn duck breasts over; place pan in oven and roast just until duck is cooked to desired doneness, about 8 minutes for medium. Transfer duck to platter; cover and let rest 10 minutes. Reserve skillet. Finely chop reserved truffle peel.",
        "Drain remaining fat from skillet. Add 1 tablespoon butter to skillet and melt over medium-high heat. Add shallots; sauté until golden, about 2 minutes. Add wine and boil until almost evaporated, about 4 minutes. Add reserved broth and any accumulated juices from duck; simmer until mixture is reduced to 1 generous cup. Strain mixture into small saucepan; add reserved chopped truffle peel. Season sauce to taste with salt and pepper. Stir in remaining 1 tablespoon butter.",
        "Thinly slice duck breasts crosswise. Arrange duck slices on plates; drizzle with sauce and serve."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 1/2 pounds chicken wings",
        "1 cup diced peeled carrots",
        "1 cup diced celery",
        "2 1/4 cups beef broth",
        "2 cups low-salt chicken broth",
        "2 ounces fresh black truffles or frozen, unthawed",
        "3 boneless magret duck breast halves or Muscovy duck breast halves (about 3 pounds total)",
        "2 tablespoons (1/4 stick) butter, divided",
        "1/4 cup finely chopped shallots",
        "1 cup Pinot Noir"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Duck",
        "Poultry",
        "Roast",
        "Sauté",
        "Christmas",
        "Quick & Easy",
        "Celery",
        "Carrot",
        "Red Wine",
        "Winter",
        "Shallot"
    ],
    "title": "Roast Magret Duck Breasts with Shaved Black Truffles",
    "url": "http://www.epicurious.com/recipes/food/views/roast-magret-duck-breasts-with-shaved-black-truffles-233930"
}
