{
    "directions": [
        "Preheat oven to 450°F with rack in middle.",
        "Wash leek halves and pat dry.",
        "Toss leek, carrots, garlic, bell peppers, plum tomatoes, fennel, and onions with oil, then spread in a 17- by 14-inch roasting pan and roast, stirring occasionally, until well browned and tender, 1 1/4 to 1 1/2 hours.",
        "Pour boiling water over porcini in a bowl and soak until softened, 10 to 20 minutes.",
        "Meanwhile, wrap celery, parsley stems, thyme sprig, peppercorns, and bay leaves in a piece of cheesecloth and tie with string.",
        "Lift out porcini, squeezing excess liquid back into bowl, and rinse to remove any grit. Pour soaking liquid through a sieve lined with a dampened paper towel into another bowl.",
        "Transfer roasted vegetables to a 6- to 8-quart pot and add wine to roasting pan, then deglaze pan by boiling, scraping up brown bits, 1 to 2 minutes. Add wine to vegetables in pot along with water (4 quarts), porcini and soaking liquid, bouquet garni, sun-dried tomatoes, and 2 teaspoons salt. Bring to a boil, then simmer, uncovered, until stock is reduced to about 6 cups, about 2 hours. Pour through a fine-mesh sieve into a large bowl, pressing firmly on and then discarding solids.",
        "Melt butter in a 3-quart heavy saucepan over medium heat and whisk in flour, then cook roux, whisking, 3 minutes. Add stock in a stream, whisking constantly to prevent lumps, then bring to a boil, whisking. Reduce heat and simmer, whisking occasionally, until slightly thickened, about 10 minutes. Season with salt and pepper."
    ],
    "ingredients": [
        "1 large leek (white and pale green parts only), halved lengthwise",
        "5 carrots, quartered",
        "1 head garlic, separated into cloves and peeled",
        "2 red bell peppers, quartered",
        "1 pound plum tomatoes, halved",
        "1 fennel bulb, stalks discarded and bulb quartered",
        "2 large onions, quartered",
        "2 tablespoons olive oil",
        "1 cup boiling water",
        "1/2 ounce dried porcini mushrooms (1 cup)",
        "1 (4-inch) piece celery",
        "4 parsley stems",
        "1 large thyme sprig",
        "8 black peppercorns",
        "2 Turkish bay leaves or 1 California",
        "1 cup dry red wine",
        "4 quart water",
        "1/2 cup sun-dried tomatoes (not packed in oil; 1 1/2 ounces)",
        "1/2 stick unsalted butter",
        "1/3 cup all-purpose flour",
        "Equipment: cheesecloth; kitchen string",
        "kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Mushroom",
        "Onion",
        "Tomato",
        "Side",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "Fennel",
        "Leek",
        "Bell Pepper",
        "Carrot",
        "Red Wine",
        "Winter",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Roasted-Vegetable and Wine Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-vegetable-and-wine-sauce-240602"
}
