{
    "directions": [
        "Arrange racks in upper and lower thirds of oven; preheat to 375°F. Spread out pumpkin seeds in a single layer on a rimmed baking sheet and toast on top rack, stirring once or twice, until lightly browned, puffed, and aromatic, about 7 minutes. Toss pumpkin seeds on sheet with 1 teaspoon oil and a pinch of salt. Let cool on sheet; transfer to a work surface and coarsely chop. DO AHEAD: Pumpkin seeds can be prepared 1 day ahead. Store airtight at room temperature.",
        "Increase oven temperature to 425°F. Place squash, cut side down, on a cutting board. Using a sharp knife, carefully remove peel. Cut squash lengthwise into 3/4\"-thick wedges. Place squash, 1/4 cup oil, and thyme in a large bowl. Season with salt and pepper. Toss to coat. Divide squash between 2 large rimmed baking sheets, cut side down, in a single layer.",
        "Roast squash, rotating sheets halfway through, until tender when pierced with a fork, 25-30 minutes; set aside.",
        "Mix remaining 1/2 cup oil, 1/4 cup lemon juice, and parsley in a medium bowl. Season dressing with salt, pepper, and additional lemon juice, if desired. Place dandelion greens in a large bowl; drizzle with 1 tablespoon dressing. Season with salt and pepper; toss to coat. Add dates and Parmesan, if using, to remaining dressing in bowl for date relish.",
        "Arrange dandelion greens on a large platter; top with warm squash. Spoon date relish over; garnish with pumpkin seeds."
    ],
    "ingredients": [
        "1/3 cup shelled raw pumpkin seeds (pepitas)",
        "1 teaspoon plus 3/4 cup extra-virgin olive oil, divided",
        "Kosher salt",
        "4 pound kabocha or acorn squash, each squash halved through root end, seeded",
        "1 tablespoon fresh thyme leaves",
        "Freshly ground black pepper",
        "1/4 cup (or more) fresh lemon juice",
        "1/4 cup chopped flat-leaf parsley",
        "1 bunch dandelion greens, tough ends trimmed (about 4 ounces)",
        "1 cup Deglet Noor dates (about 3 1/2 ounces), pitted, thinly sliced lengthwise",
        "2 ounces Parmesan, cut into 1/4\" cubes (about 1/3 cup; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Roast",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Parmesan",
        "Date",
        "Squash",
        "Pumpkin",
        "Fall",
        "Low Cholesterol",
        "Seed",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Squash with Date Relish and Pumpkin Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-squash-with-date-relish-and-pumpkin-seeds-51123130"
}
