{
    "directions": [
        "Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 425°F. Spray 2 large rimmed baking sheets with nonstick spray. Whisk 6 tablespoons oil, 2 tablespoons thyme, and 2 tablespoons marjoram in large bowl. Add yams, carrots, parsnips, rutabagas, and onions and toss to coat. Sprinkle vegetables generously with salt and pepper and divide between prepared baking sheets. Roast vegetables until tender and brown in spots, turning occasionally, about 50 minutes. (Can be made 4 hours ahead. Let stand at room temperature. If desired, rewarm in 350°F oven about 15 minutes, or microwave on high until heated through, about 6 minutes, before continuing.)",
        "Whisk balsamic vinegar, remaining 3 tablespoons oil, 1 1/2 teaspoons thyme, and 1 1/2 teaspoons marjoram to blend in small bowl. Drizzle over roasted vegetables. Sprinkle with chopped parsley and lemon peel. Season with more salt and pepper, if desired. Transfer to platter; garnish with parsley sprigs. Serve hot or at room temperature."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "9 tablespoons extra-virgin olive oil",
        "2 tablespoons plus 1 1/2 teaspoons chopped fresh thyme",
        "2 tablespoons plus 1 1/2 teaspoons chopped fresh marjoram",
        "2 pounds medium yams (red-skinned sweet potatoes), peeled, halved lengthwise, then cut crosswise into 1 1/4- to 1 1/2-inch pieces",
        "1 1/2 pounds carrots, peeled, cut into 3/4-inch-thick rounds (about 4 cups)",
        "1 1/2 pounds parsnips, peeled, cut into 3/4-inch-thick rounds (about 4 cups)",
        "1 1/2 pounds rutabagas, peeled, cut into 1/2-inch pieces (about 4 cups)",
        "2 medium-size red onions (about 1 pound), peeled, root ends left intact, cut into 1/2-inch-thick wedges",
        "3 tablespoons balsamic vinegar",
        "3 tablespoons chopped fresh parsley",
        "2 teaspoons grated lemon peel",
        "Fresh parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Carrot",
        "Parsnip",
        "Sweet Potato/Yam",
        "Fall",
        "Thyme",
        "Rutabaga",
        "Christmas Eve"
    ],
    "title": "Roasted Root Vegetables with Thyme and Marjoram Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-root-vegetables-with-thyme-and-marjoram-vinaigrette-107312"
}
