{
    "directions": [
        "Wearing gloves, halve and seed chiles. Purée chiles, pepper, zest, 2 tablespoons liqueur, 1 tablespoon salt, and garlic in a blender. Transfer to a bowl, cover with plastic wrap, and let ferment at room temperature for 12 hours.",
        "Purée chile mixture in a blender with vinegar, remaining 2 tablespoons liqueur, and remaining 1 tablespoon salt until smooth. Set a fine-mesh strainer over a small saucepan. Strain mixture, pressing on solids. Heat hot sauce over medium heat. Stir cornstarch and 2 teaspoons water in a small bowl until smooth. Whisk cornstarch mixture into hot sauce. Simmer, whisking constantly, until thickened, about 2 minutes. Whisk in 3 tablespoons butter. Season to taste with salt. Keep warm.",
        "Preheat oven to 450°. Season chicken with salt and pepper. Heat remaining 1 tablespoon butter in a large ovenproof skillet over medium-high heat. Cook chicken, skin side down, until golden, about 5 minutes. Turn chicken and cook 6 minutes. Remove breasts from pan and transfer to a plate. Place skillet in oven and roast legs for 12 minutes. Return breasts to skillet; roast until legs and breasts are cooked through, about 10 minutes longer. Serve with hot-sauce butter."
    ],
    "ingredients": [
        "3 ounces orange Scotch bonnet or habanero chiles (about 10)",
        "1 orange bell pepper, halved, seeded, coarsely chopped",
        "4 1x3 inch strips orange zest",
        "4 tablespoons St-Germain liqueur, divided",
        "2 tablespoons kosher salt, divided, plus more for seasoning",
        "1 garlic clove, smashed",
        "1 cup Champagne vinegar",
        "2 teaspoons cornstarch",
        "4 tablespoons unsalted butter, softened, divided",
        "1 3-pound chicken, cut into 4 pieces, backbone removed",
        "Freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Roast",
        "Fourth of July",
        "Cinco de Mayo",
        "Father's Day",
        "Dinner",
        "Vinegar",
        "Bell Pepper",
        "Family Reunion",
        "Butter",
        "Chile Pepper",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Chicken with Hot-Sauce Butter",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-hot-sauce-butter-366723"
}
