{
    "directions": [
        "Preheat oven to 425° F.",
        "Rinse turkey and pat dry inside and out. Season turkey inside and out with salt and pepper and pack neck cavity with 1 lemon wedge, 1 sage sprig, and 1 bread slice. Fold neck skin under body and fasten with a skewer. Fill body cavity with apple, onion, 3 sage sprigs, and remaining lemon wedge and bread slice and truss turkey.",
        "Rub turkey with remaining 3 sage sprigs and arrange sprigs on a rack set in a roasting pan. Spread turkey with butter and arrange on rack in roasting pan. Roast turkey in middle of oven 30 minutes.",
        "Reduce temperature to 325° F. and baste turkey with pan juices. Add water to roasting pan and roast turkey, basting every 20 minutes, 2 1/2 to 3 hours more, or until a meat thermometer inserted in fleshy part of a thigh registers 180° F. and juices run clear when thigh is pierced. Transfer turkey to a heated platter, reserving juices in roasting pan, and discard string. Keep turkey warm, covered loosely with foil.",
        "Skim fat from pan juices, reserving 1/4 cup fat, and on top of stove deglaze pan with Sherry over moderately high heat, scraping up brown bits. Stir in cider. Bring Sherry mixture to a boil and remove pan from heat.",
        "In a heavy saucepan whisk together reserved fat and flour and cook roux over moderately low heat, whisking, 3 minutes. Add Sherry mixture and 2 cups stock or broth in a stream, whisking to prevent lumping, and simmer, whisking occasionally, 10 minutes. Whisk in additional stock or broth to thin gravy if desired. Season gravy with salt and pepper and transfer to a heated gravy boat.",
        "Garnish turkey with sage."
    ],
    "ingredients": [
        "a 12- to 14-pound turkey, neck and giblets (excluding liver) reserved for making stock",
        "1/2 lemon, cut into 2 wedges",
        "7 large fresh sage sprigs",
        "2 slices firm whole-wheat sandwich bread",
        "1/2 Granny Smith apple, quartered lengthwise",
        "1/2 onion, quartered lengthwise",
        "8 tablespoons unsalted butter, softened",
        "1 cup water",
        "1 cup dry Sherry",
        "1 cup apple cider (preferably sparkling)",
        "6 tablespoons all-purpose flour",
        "2 cups turkey giblet stock or chicken broth plus additional stock or broth for thinning gravy",
        "Garnish: assorted fresh sage sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Roast",
        "Thanksgiving",
        "Fall",
        "Sage",
        "Gourmet"
    ],
    "title": "Roast Turkey with Sage and Sherried Cider Giblet Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-sage-and-sherried-cider-giblet-gravy-13419"
}
