{
    "directions": [
        "In skillet, melt butter over medium heat. Stir in onions, celery, sage, thyme, marjoram, salt and pepper; cook, stirring occasionally, for 10 minutes or until browned. Stir in sherry; bring to boil. Boil for 5 minutes or until liquid is almost completely evaporated. Cool slightly. Gently stir in bread and parsley; drizzle over chicken stock, stirring to combine. Reserve.",
        "Remove giblets and neck from the turkey cavity; reserve for gravy. Rinse turkey inside and out with running water. Pat dry. Stir together butter, sage, salt and pepper; rub over turkey, inside and out. Loosely pack stuffing into neck and body cavities, fold over and skewer neck flap closed over stuffing. Tie legs together. Bend wing tips underneath bird.",
        "Place turkey, breast side up, on rack in roasting pan. Tent with foil and roast in 325°F oven for about 1 1/2 hours, basting with pan juices every 30 minutes. Remove foil and continue to roast or 1 3/4 hours, basting every half hour, or until instant-read meat thermometer inserted into thickest part of thigh reads 185°F. Let rest for 2 minutes before carving.",
        "Meanwhile, in saucepan, bring chicken stock turkey neck, giblets, onion and bay leaf to boil, reduce heat and simmer, covered, for 1 hour; strain, reserving liquid. While cooked turkey rests, skim excess fat from roasting pan. Set pan over high hear; whisk in flour until well combined. Gradually whisk in reserved giblet stock; Bring to boil and cook, stirring constantly, for 2 minutes or until thickened. Season to taste with salt and pepper. Strain and serve alongside turkey."
    ],
    "ingredients": [
        "1 10 lb turkey",
        "2 tablespoons butter, softened",
        "1 teaspoon crumbled sage leaves",
        "1/2 teaspoon each salt and pepper",
        "2 tablespoons butter",
        "2 onions, chopped",
        "1 cup finely chopped celery",
        "1 teaspoon each crumbled sage, thyme, and marjoram leaves",
        "3/4 teaspoon each salt and pepper",
        "1/2 cup sherry",
        "10 cups cubed bread, lightly toasted",
        "1/2 cup chopped fresh parsley",
        "1/4 cup chicken stock",
        "3 cups chicken stock",
        "1 onion, chopped",
        "1 bay leaf",
        "2 tablespoons all-purpose flour",
        "Salt and pepper",
        "Savory Cranberry Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Cranberry",
        "Sage",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Turkey with Savory Cranberry Sauce From the Titanic",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-savory-cranberry-sauce-from-the-titanic-362829"
}
