{
    "directions": [
        "Allow the leg of lamb to rest at room temperature for 1 hour before cooking.",
        "Preheat an oven to 400 degrees F (200 degrees C). Place the oven rack in the lower third of the oven.",
        "Whisk the garlic, pepper, red pepper flakes, bay leaf, rosemary, 1/2 cup olive oil, vinegar, and honey together in a small bowl. Rub the mixture over the lamb, then season with 2 tablespoons coarse salt. Set aside. Place carrots, potatoes, beet, yam, and turnips in a large roasting pan. Toss with 2 tablespoons olive oil and a pinch of salt. Arrange the seasoned leg of lamb on top of the vegetables.",
        "Roast the lamb in the preheated oven for 20 minutes, then reduce oven temperature to  325 degrees F (165 degrees C). Continue roasting  to your desired degree of doneness, about 90 minutes more for medium-rare. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C).",
        "Allow the leg of lamb on a cutting board, tented with aluminum foil, for 30 minutes before carving. Place the vegetables on a serving platter and cover with aluminum foil to keep warm until ready to serve."
    ],
    "ingredients": [
        "1 (6 pound) leg of lamb",
        "5 cloves garlic, minced",
        "2 teaspoons coarsely ground black pepper",
        "1 teaspoon crushed red pepper flakes",
        "1 bay leaf, crushed",
        "1 tablespoon chopped fresh rosemary",
        "1/2 cup olive oil",
        "2 tablespoons balsamic vinegar",
        "2 tablespoons honey",
        "2 tablespoons coarse salt, or as needed",
        "8 carrots, peeled and trimmed",
        "16 small potatoes, unpeeled",
        "1 large beet, peeled and cut into wedges",
        "1 yam, peeled and cut into wedges",
        "8 baby turnips, peeled",
        "2 tablespoons olive oil",
        "salt to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Lamb with Root Vegetables",
    "url": "http://allrecipes.com/recipe/216678/roasted-lamb-with-root-vegetables/"
}
