{
    "directions": [
        "Cook bacon in heavy large saucepan over medium heat until crisp. Using tongs, transfer bacon to paper towels. Discard drippings from pan. Add broth, wine, jelly and rosemary to pan. Boil until reduced to 2 1/2 cups, about 35 minutes. Return bacon to sauce. Boil until liquid is reduced to 1 1/3 cups, about 10 minutes longer. Strain sauce into small saucepan. Add butter. Whisk over low heat until sauce is smooth, about 2 minutes. Season with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Finely grind first 4 ingredients. Place pork in 13x9x2-inch glass baking dish. Rub oil, then spice mixture all over pork. Cover; refrigerate 4 hours and up to 1 day.",
        "Position racks in center and bottom third of oven and preheat to 400°F.. Place potatoes, parsnips, carrots, shallots, garlic and rosemary in large roasting pan. Drizzle with 5 tablespoons oil; sprinkle with salt and pepper. Roast on center rack 45 minutes, turning vegetables occasionally.",
        "Place beets in small roasting pan. Drizzle with 1 tablespoon oil; sprinkle with salt and pepper. Remove large roasting pan from oven. Push vegetables to sides of pan, clearing space in center for pork. Place pork in center of pan. Return large roasting pan to center rack. Place pan with beets on bottom rack.",
        "Roast pork with vegetables until vegetables are brown and cooked through and thermometer inserted into center of pork registers 150°F., turning vegetables occasionally, about 1 hour. Roast beets until tender, turning occasionally, about 1 hour. Remove pork and all vegetables from oven and let stand 10 minutes.",
        "Place pork roast in center of large platter; surround with all vegetables. Rewarm sauce over low heat, whisking constantly."
    ],
    "ingredients": [
        "6 bacon slices, cut in half",
        "6 cups canned low-salt chicken broth",
        "1 1/2 cups dry white wine",
        "1/2 cup red currant jelly",
        "1 1/4 teaspoons minced fresh rosemary",
        "3 tablespoons unsalted butter",
        "A mortar and pestle or even a coffee grinder can be used to grind the spices.",
        "2 teaspoons cumin seeds",
        "2 teaspoons coarse salt",
        "1 teaspoon black peppercorns",
        "1 teaspoon black cardamom seeds (from about 30 whole green or white cardamom pods)",
        "1 4- to 4 1/4-pound center-cut boneless pork loin (about",
        "1 tablespoon olive oil",
        "2 1/2 pounds large russet potatoes (about 5), peeled, halved lengthwise, cut into 2-inch pieces",
        "1 1/2 pounds large parsnips (about 4), peeled, cut into 2-inch pieces, thick portions halved lengthwise",
        "1 1/2 pounds large carrots (about 4), peeled, cut into 2-inch pieces, thick portions halved lengthwise",
        "8 large shallots, peeled, halved",
        "8 large garlic cloves, peeled",
        "3 large fresh rosemary sprigs",
        "6 tablespoons olive oil",
        "8 medium beets, peeled, cut into 1-inch wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Pork",
        "Potato",
        "Vegetable",
        "Roast",
        "Rosemary",
        "Carrot",
        "Parsnip",
        "White Wine",
        "Spring"
    ],
    "title": "Roasted Spiced Pork Loin with Root Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-spiced-pork-loin-with-root-vegetables-5343"
}
