{
    "directions": [
        "Boil the potatoes: Add the potatoes to a medium pot with the cream, garlic, butter and some kosher salt. Bring to a boil over medium-high heat, then reduce the heat to medium-low and gently simmer until the potatoes are easily pierced with a fork, about 25 minutes.",
        "Cook the chateaubriand: Preheat the oven to 350 degrees F. Let the beef rest at room temperature for 15 minutes, then season with salt and pepper. Heat the olive oil in a large, oven-safe skillet over high heat until it shimmers, about 2 minutes. Set the meat in the pan and sear it on all sides until browned, about 8 minutes total. Reduce the heat to low and add 2 tablespoons of the butter, the mushrooms, garlic and the thyme. Transfer the skillet to the oven and cook the roast until an instant-read thermometer inserted into the thickest part reads 125 to 130 degrees F., 6 to 8 minutes for medium-rare. Remove the skillet from the oven, transfer the roast to a cutting board, loosely tent with foil and let it rest for 10 minutes.",
        "Make the red wine reduction: Transfer the mushrooms to a bowl and pour off all but 1 tablespoon of the fat from the pan (discard the garlic and thyme). Set the skillet over medium-high heat, add the shallot and red wine, and cook, stirring to scrape up any browned bits from the bottom of the pan, until the pan is almost dry, about 2 minutes. Add the broth and cream, bring to a boil, and simmer until the sauce thickens, 3 to 5 minutes. Return the mushrooms to the pan, adjust the seasoning with salt and pepper, if needed.",
        "Make the pomme puree: Place a colander over a large bowl. Pour the hot potatoes into the colander. Shake the potatoes to drain off the excess liquid. Press the potatoes through a ricer (or mash them with a fork for a chunkier texture) and into a medium bowl, occasionally clearing the sides of the ricer with a spoon. Pour the reserved and still-hot cream over the potatoes in small increments, folding in to combine, until you get your desired consistency. Season with olive oil and a sprinkle of sea salt and serve immediately, or keep warm in a covered oven-safe casserole dish in a 250 degree F. oven.",
        "To serve, remove the twine from the roast and slice the roast crosswise into 2 equal portions. Sprinkle with salt and pepper. Spoon the potato puree onto 2 warm plates. Place a slice of chateaubriand on each plate and spoon the red wine-mushroom reduction over the top. Garnish with fresh thyme leaves and serve."
    ],
    "ingredients": [
        "2 pounds Yukon Gold potatoes, peeled and cut into 2- to 3-inch pieces",
        "2 cups cold heavy cream",
        "3 cloves garlic",
        "1 stick (8 tablespoons) unsalted butter, cut into pieces",
        "Kosher salt",
        "Extra-virgin olive oil, for seasoning",
        "Coarse sea salt",
        "1 1/2 pounds chateaubriand roast (the center-cut portion of the beef tenderloin), trimmed of fat and silver skin and tied at 1/2-inch intervals with butcher's twine",
        "Kosher salt and freshly ground black pepper",
        "3 tablespoons extra-virgin olive oil",
        "4 tablespoons unsalted butter",
        "1 1/2 cups quartered mushrooms such as cremini, shiitake or chanterelle",
        "4 garlic cloves, peeled and smashed",
        "4 sprigs fresh thyme plus extra fresh thyme leaves, for garnishing",
        "2 tablespoons minced shallot",
        "1/2 cup dry red wine",
        "2 cups veal or beef broth",
        "1/4 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Potato",
        "Vegetable",
        "Beef",
        "Meat",
        "Mushroom",
        "Main Dish Recipes"
    ],
    "title": "Roasted Chateaubriand with Red Wine-Mushroom Reduction and Pommes Puree",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/roasted-chateaubriand-with-red-wine-mushroom-reduction-and-pomme-puree"
}
