{
    "directions": [
        "Preheat oven to 325°F. Rinse turkey inside and out. Pat dry. Transfer to roasting pan. Mix vinegar and orange juice in bowl. Pour over turkey. Spoon 5 1/2 cups stuffing into main cavity and 1 cup stuffing into neck cavity of turkey. Close cavities with skewers. Place remaining stuffing in casserole; cover. Season turkey with salt and pepper. Tuck wings under turkey. Tie legs together. Rub butter all over turkey. Cover with foil and roast 1 1/2 hours. Remove foil. Increase oven temperature to 350°F. Continue roasting until thermometer inserted into thickest part of thigh registers 175°F, basting occasionally with pan juices, about 2 hours 15 minutes later. (Bake stuffing in covered casserole alongside turkey for final 20 minutes and while preparing Sherry vinegar gravy.)",
        "Transfer turkey to platter. Tent with foil. Pour turkey pan juices into bowl. Do not wash roasting pan. Degrease juices. Pour juices back into roasting pan and place atop stove. Bring to boil, scraping up any browned bits. Pour into heavy large saucepan. Whisk in flour. Add stock and boil until slightly thickened, stirring often, about 10 minutes. Season with salt. Pour gravy into sauceboat."
    ],
    "ingredients": [
        "1 14- to 16-pound turkey",
        "1/2 cup Sherry wine vinegar",
        "1/4 cup orange juice",
        "Currant Pecan Stuffing",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "6 tablespoons all purpose flour",
        "3 cups chicken stock or canned low-salt broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Poultry",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Vinegar",
        "Fortified Wine",
        "Sherry",
        "Fall",
        "Winter",
        "Christmas Eve"
    ],
    "title": "Roast Turkey with Sherry Wine Vinegar Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-sherry-wine-vinegar-gravy-5008"
}
