{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Combine squash, sweet potatoes, olive oil, salt, and pepper together in a bowl; toss to coat. Pour out onto a baking sheet.",
        "Bake in the preheated oven, flipping the vegetables once, until slightly caramelized and tender, about 60 minutes.",
        "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until slightly crisp, 7 to 10 minutes. Reserve 1 tablespoon bacon drippings. Drain the bacon slices on paper towels; crumble bacon.",
        "Heat bacon drippings and butter together in Dutch oven over medium heat. Saute onion and butter in hot butter mixture until onion is translucent, 7 to 10 minutes.",
        "Pour the white wine into the pan and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Cook until white wine is reduced by half, 3 to 5 minutes.",
        "Stir roasted squash mixture into onion mixture; add stock and bring to a boil. Reduce heat to low and simmer until all vegetables are tender, about 10 minutes.",
        "Pour vegetable mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth. Return pureed soup to Dutch oven.",
        "Stir half-and-half into pureed soup; cook and stir over medium-low heat until soup is warmed through, about 5 minutes. Stir nutmeg into soup; season with salt and pepper to taste. Ladle into bowls and top each with crumbled bacon."
    ],
    "ingredients": [
        "1 (2 pound) butternut squash - peeled, seeded, and cubed",
        "1 pound sweet potatoes, peeled and cubed",
        "2 tablespoons olive oil",
        "salt and ground black pepper to taste",
        "8 slices applewood-smoked bacon",
        "1 tablespoon butter",
        "1 large onion, chopped",
        "2 cloves garlic, chopped",
        "1/2 cup white wine",
        "1 1/2 quarts chicken stock",
        "1 1/2 cups half-and-half",
        "1 teaspoon ground nutmeg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roasted Butternut Squash and Sweet Potato Bisque with Smoked Applewood Bacon",
    "url": "http://allrecipes.com/recipe/235704/roasted-butternut-squash-and-sweet-po/"
}
