{
    "directions": [
        "In a large stockpot, combine the bones, water, carrots, onion, celery, rosemary, sage, and peppercorns and bring to a boil. Reduce the heat and simmer for about 3 hours, skimming occasionally. Strain the stock. Measure 3 1/2 cups of stock for cooking the farro, and reserve any leftovers for later use.",
        "Preheat the oven to 350°F.",
        "Cut each of the game hens, chickens, or pigeons in half then season all over with kosher salt and freshly ground black pepper.",
        "In a large sauté pan over moderately high heat, warm the oil. Working in batches, add the birds, skin side down, to the pan and sear until the skin is golden brown and caramelized. Transfer the birds, as done, to a roasting pan or large rimmed baking sheet and roast in the oven until an instant-read thermometer inserted into the thickest part of the thigh (do not touch the bone) registers 165°F.",
        "In a medium saucepan over moderate heat, cook the bacon until crispy. Transfer the bacon to a paper towel–lined plate and pour half the rendered bacon fat into a medium sauté pan and set aside. Add the shallot to the original saucepan and sauté, stirring occasionally, until translucent then add the farro and sauté, stirring occasionally, until just toasted. Add the reserved 3 1/2 cups of stock to the farro and bring to a simmer. Continue simmering until soft and tender.",
        "While the farro is simmering, heat the rendered bacon fat in the medium sauté pan. Add the mushrooms and sauté, stirring occasionally, until the liquid released by the mushrooms is evaporated, about 5 minutes. Season with kosher salt and freshly ground black pepper. Add the mushrooms and bacon to the farro and stir to combine. Keep warm.",
        "In a small saucepan over moderately low heat, bring the olive oil, sage, and peppercorns to a simmer. Shut off the heat and let the oil cool until it's fragrant with sage and peppercorn. Once cool, strain the oil.",
        "In small saucepan over moderate heat, bring the blackberries, currants, red wine, honey, and vinegar to a simmer. Continue simmering until the mixture is thick and jamlike, 8 to 12 minutes. Remove from the heat and set aside.",
        "Preheat the oven to 450°F.",
        "Arrange the fennel and carrots in separate baking dishes or baking sheets. Drizzle each with 1 tablespoon olive oil then season with kosher salt and freshly ground black pepper. Roast, turning occasionally, until tender and well caramelized, about 15 minutes. Transfer to a large bowl, drizzle with the maple syrup and vinegar, season with kosher salt and freshly ground black pepper, if desired, and toss to combine.",
        "Divide the farro among 4 plates, then top each with vegetables and poultry. Garnish the plates with the berry compote and sage oil."
    ],
    "ingredients": [
        "Bones from 4 whole game hens, small chickens, or pigeons",
        "5 cups water",
        "2 medium carrots",
        "1 medium onion",
        "1 medium celery rib",
        "2 sprigs fresh rosemary",
        "2 sprigs fresh sage",
        "5 whole black peppercorns",
        "4 whole game hens, small chickens, or pigeons",
        "2 tablespoons kosher salt",
        "1 tablespoon freshly ground black pepper",
        "Canola oil",
        "1/2 cup chopped wild boar or regular bacon",
        "1 medium shallot, minced",
        "2 cups farro",
        "1 cup sliced mushrooms",
        "Kosher salt",
        "Freshly ground black pepper",
        "1/4 cup extra-virgin olive oil",
        "2 tablespoons chopped fresh sage leaves",
        "2 whole green peppercorns",
        "5 ounces blackberries",
        "1/2 cup dried currants",
        "1/2 cup dry red wine",
        "3 tablespoons honey",
        "1 tablespoon red wine vinegar",
        "2 medium fennel bulbs, cut into wedges and cored",
        "3 medium carrots, cut into 1-inch pieces",
        "2 tablespoons olive oil",
        "Kosher salt",
        "Freshly ground black pepper",
        "2 tablespoons maple syrup",
        "1 tablespoon vinegar",
        "Equipment: Large roasting pan or rimmed baking sheet; instant-read thermometer; 2 baking dishes or baking sheets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Poultry",
        "Roast",
        "Sauté",
        "Dinner",
        "Bacon",
        "Fennel",
        "Carrot",
        "Fall",
        "Winter",
        "Simmer",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roasted Poultry, Wild Boar Bacon, and Mushroom Farro with Pan-Roasted Fennel and Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-poultry-wild-boar-bacon-and-mushroom-farro-with-pan-roasted-fennel-and-carrots-51183200"
}
