{
    "directions": [
        "Position rack in bottom third of oven and preheat to 325°F. Pat turkey dry with paper towels. Turn turkey breast side down; fold wing tips under. Pull out excess fat from neck cavity and reserve. Spoon 3 cups stuffing into neck cavity. Pin down neck-skin flap with skewers to enclose stuffing. Rub back of turkey with 2 tablespoons butter; sprinkle with salt and pepper. Place turkey, breast side up, on rack in roasting pan. Spoon remaining 6 cups stuffing into main cavity. Pin with skewers to enclose stuffing. Tie legs together to hold shape. Rub 4 tablespoons butter over turkey. Sprinkle with salt and pepper. Add reserved turkey fat and 2 cups Turkey Stock to pan.",
        "Cover breast with heavy-duty foil. Roast turkey 3 1/2 hours, basting turkey, including breast under foil, every 30 minutes with pan juices and adding stock to pan, 1/2 cup at a time, if liquid evaporates. Remove foil. Roast turkey until meat thermometer inserted into thickest part of thigh registers 180°F, basting occasionally with pan juices, about 1 hour longer. Transfer turkey to platter and let stand 20 minutes.",
        "Strain juices from roasting pan into 8-cup glass measuring cup; spoon off fat. Return 1/2 cup fat to roasting pan. Add enough Turkey Stock to pan juices in measuring cup to measure 5 cups. Heat fat in roasting pan atop 2 burners over medium heat. Whisk in flour. Cook until mixture is smooth and golden, whisking constantly, about 4 minutes. Pour in wine, then whisk in stock mixture. Simmer until gravy thickens, whisking often, about 5 minutes. Season with salt and pepper. Serve turkey with gravy."
    ],
    "ingredients": [
        "1 18- to 20-pound turkey, excess fat from tail reserved; neck, heart and gizzard reserved for Turkey Stock",
        "9 cups Oyster Stuffing with Shiitake Mushrooms and Leeks",
        "6 tablespoons (3/4 stick) butter, room temperature",
        "5 cups (about) Turkey Stock",
        "1/2 cup all purpose flour",
        "1 cup dry white wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "White Wine",
        "Fall"
    ],
    "title": "Roast Turkey with White Wine Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/roast-turkey-with-white-wine-gravy-104281"
}
