{
    "directions": [
        "Set 1 rack in center and 1 rack at lowest position in oven and preheat to 375°F. Line 2 large baking sheets with foil. Place sweet potatoes on 1 sheet; drizzle with 6 tablespoons oil. Sprinkle with garlic, 1 1/2 teaspoons salt, and 1 teaspoon pepper. Toss to coat, then spread in single layer. Place onions on second baking sheet; drizzle with remaining 2 tablespoons oil and sprinkle with remaining 1 teaspoon salt and 1/2 teaspoon pepper. Toss to coat, then spread in single layer.",
        "Place sheet with potatoes on center rack and sheet with onions on lower rack in oven. Roast until potatoes are tender and onions are tender and brown around edges, stirring every 10 minutes, about 30 minutes total for potatoes and 35 minutes total for onions. (Can be prepared 4 hours ahead. Let stand at room temperature loosely covered with foil. Rewarm uncovered in 375°F oven about 10 minutes.)",
        "Combine sweet potatoes and onions in shallow bowl. Sprinkle with Parmesan cheese and rosemary and toss to coat. Season with salt and pepper; serve."
    ],
    "ingredients": [
        "2 3/4 pounds tan-skinned sweet potatoes, peeled, cut into 1-inch cubes",
        "8 tablespoons canola oil",
        "3 garlic cloves, minced",
        "2 1/2 teaspoons salt",
        "1 1/2 teaspoons coarsely ground black pepper",
        "1 1/2 pounds red onions (about 3 medium), halved lengthwise, cut crosswise into 1/4-inch-thick slices",
        "1/2 cup freshly grated Parmesan cheese",
        "1 tablespoon chopped fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Onion",
        "Side",
        "Roast",
        "Thanksgiving",
        "Parmesan",
        "Sweet Potato/Yam",
        "Fall",
        "Clove",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Sweet Potatoes and Onions with Rosemary and Parmesan",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-sweet-potatoes-and-onions-with-rosemary-and-parmesan-107314"
}
