{
    "directions": [
        "Preheat oven to 450°F. Mix first 4 ingredients in bowl. Rinse chicken; pat dry. Place chicken in roasting pan. Rub all but 1 tablespoon garlic-thyme oil over. Sprinkle with salt and pepper. Place lemon in cavity of chicken. Tie legs with string.",
        "Roast chicken 20 minutes. Reduce oven temperature to 375°F. Roast chicken until meat thermometer inserted into thickest part of inner thigh registers 180°F, about 1 hour 15 minutes. Lift chicken and tilt slightly, emptying juices from cavity into pan. Transfer chicken to serving platter. Tent chicken with aluminum foil to keep warm.",
        "Pour pan juices into large glass measuring cup. Spoon fat off top. Add wine to pan; place over high heat. Bring to boil, scraping up any browned bits. Pour wine mixture into measuring cup with pan juices (do not clean roasting pan). Add enough chicken broth to cup to measure 1 1/2 cups. Return broth mixture to same roasting pan. Mix flour into reserved 1 tablespoon garlic-thyme oil. Whisk into broth mixture. Boil broth mixture in roasting pan set over 2 burners until slightly thickened, about 2 minutes. Season pan-juice mixture to taste with salt and pepper. Pour into sauceboat. Serve chicken, passing pan-juice mixture separately."
    ],
    "ingredients": [
        "3 tablespoons minced fresh thyme",
        "2 tablespoons extra-virgin olive oil",
        "5 garlic cloves, chopped",
        "2 teaspoons grated lemon peel",
        "1 7-pound roasting chicken",
        "1 lemon, quartered",
        "1/4 cup dry white wine",
        "1 cup (about) canned low-salt chicken broth",
        "2 teaspoons all purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Roast",
        "Kid-Friendly",
        "Back to School",
        "Lemon",
        "Thyme"
    ],
    "title": "Roast Chicken with Lemon and Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-lemon-and-thyme-102159"
}
