{
    "directions": [
        "Preheat oven to 450°F. Arrange racks in upper and lower thirds of oven and place a rimmed baking sheet on each rack. In a medium saucepan over high heat, bring water for rice to a boil according to package directions.",
        "Meanwhile, in a medium bowl, toss bok choy with 2 tablespoons vegetable oil and 1/2 teaspoon salt and set aside. In another medium bowl, combine red-pepper flakes, honey, soy sauce, remaining 1 tablespoon vegetable oil, and 1/2 teaspoon salt. Toss shrimp in mixture to coat.",
        "Carefully remove the hot baking sheets from the oven; spread the boy choy mixture on one sheet and place on the lower rack; spread the shrimp mixture on the other sheet and place on the upper rack. Roast, tossing halfway through, until shrimp is pink and starting to caramelize (about 8 minutes) and bok choy is softened and lightly browned in spots (13 to 15 minutes).",
        "While shrimp and bok choy are roasting, add rice and 1/2 teaspoon salt to boiling water. Cover and cook according to package directions. Once cooked, fluff rice with a fork and stir in kimchi.",
        "To serve, divide kimchi rice among four wide bowls. Remove shrimp from the oven and drizzle with 1 tablespoon toasted sesame oil; toss to combine. Top rice with shrimp and bok choy. Sprinkle with sesame seeds and scallions, and serve with lime wedges."
    ],
    "ingredients": [
        "1 1/2 pounds baby bok choy (about 3 heads), halved lengthwise (quartered lengthwise if large)",
        "3 tablespoons vegetable oil, such as grapeseed, divided",
        "1 1/2 teaspoons kosher salt, divided",
        "1/2 teaspoon red-pepper flakes",
        "2 tablespoons honey",
        "1 tablespoon low-sodium soy sauce",
        "1 1/2 pounds large tail-on shrimp, peeled and deveined",
        "1 tablespoon toasted sesame oil",
        "3/4 cup jasmine rice",
        "3/4 cup kimchi, thinly sliced",
        "1 scallion, thinly sliced",
        "1 1/2 teaspoons toasted sesame seeds",
        "4 lime wedges, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Quick & Easy",
        "Dinner",
        "Shrimp",
        "Bok Choy",
        "22-Minute Meals",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Roasted Hot-Honey Shrimp With Bok Choy and Kimchi Rice",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-hot-honey-shrimp-with-bok-choy-and-kimchi-rice-51261050"
}
