{
    "directions": [
        "Stir cumin seeds in a small dry skillet over medium heat until fragrant, 3-4 minutes. Let cool. Finely grind in a spice mill.",
        "Whisk cumin, lemon juice, vinegar, and Dijon mustard in a medium bowl. Gradually whisk in 1/2 cup oil, then mint. Season vinaigrette with salt and pepper.",
        "Cook carrots in a large pot of boiling salted water for 1 minute; using a slotted spoon, transfer carrots to a bowl. Add beets to same pot of boiling water and cook until just tender, 20-25 minutes. Drain. Let stand at room temperature to cool slightly, about 15 minutes. Peel and trim beets; halve lengthwise. DO AHEAD: Vinaigrette and vegetables can be made 1 day ahead. Cover separately; chill. Return vinaigrette to room temperature and whisk before using.",
        "Preheat oven to 450°F. Season carrots with salt and pepper. Toss with 1 1/2 teaspoons oil. Arrange on half of a large rimmed baking sheet. Place beets in same bowl; season with salt and pepper and toss with remaining 1 1/2 teaspoons oil. Arrange in single layer opposite carrots on same baking sheet. Roast vegetables, turning once, until slightly charred and just tender, about 15 minutes.",
        "Place carrots, 1/2 cup parsley leaves, and feta in a medium bowl; drizzle 1/4 cup vinaigrette over and toss to coat. Arrange carrot mixture on a small platter. Place beets in another medium bowl. Add 2 tablespoons vinaigrette; toss to coat. Tuck beets in among carrots. Sprinkle remaining 1/4 cup parsley leaves over. Drizzle with remaining dressing."
    ],
    "ingredients": [
        "1 teaspoon cumin seeds",
        "2 teaspoons fresh lemon juice",
        "2 teaspoons Sherry vinegar",
        "1 teaspoon Dijon mustard",
        "1/2 cup plus 3 teaspoons extra-virgin olive oil, divided",
        "1 tablespoon finely chopped fresh mint",
        "Kosher salt and freshly ground black pepper",
        "1 pound baby carrots with 1/2\" of tops attached, peeled",
        "6 small (1 1/2\" diameter) red beets, scrubbed, trimmed leaving 2\" of stem attached",
        "3/4 cup (lightly packed) flat-leaf parsley leaves, divided",
        "1/2 cup crumbled feta (about 4 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Side",
        "Vegetarian",
        "Dinner",
        "Feta",
        "Root Vegetable",
        "Beet",
        "Carrot",
        "Fall",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Carrot and Beet Salad with Feta",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-carrot-and-beet-salad-with-feta-368264"
}
