{
    "directions": [
        "Preheat oven to 425°F.",
        "Blanch onions in boiling salted water 1 minute. Drain in a colander and rinse under cold running water to stop cooking. Trim root ends and peel.",
        "Pat chicken dry. Coat a 17- by 12-inch flameproof roasting pan with oil and put chicken in pan. Rub 2 tablespoons softened butter into skin over entire chicken. Season chicken inside and out with salt and pepper. Put 1 lemon half in cavity and squeeze remaining half over chicken.",
        "Roast chicken in middle of oven 20 minutes. Baste chicken, then continue to roast, basting about every 7 minutes, 20 minutes more. Scatter onions around chicken and continue to roast, turning onions and basting every 7 to 8 minutes, until chicken is golden and a thermometer inserted into fleshy part of a thigh registers 170°F (juices will run clear), 25 to 35 minutes more.",
        "Once chicken begins roasting, soak morels in warm water 20 minutes. Lift mushrooms out of water, squeezing excess liquid back into bowl, and reserve liquid. Rinse morels thoroughly to remove grit and squeeze dry. Trim any tough stems.",
        "Pour reserved soaking liquid through a sieve lined with several layers of cheesecloth or a paper towel into a small bowl.",
        "Cut asparagus diagonally into 2-inch lengths. Arrange on a steamer rack and sprinkle with kosher salt. Steam asparagus, covered, over boiling water until crisp-tender, about 5 minutes, then transfer to a bowl of ice water to stop cooking.",
        "Transfer roast chicken to a platter, then discard string and cover chicken loosely with foil. Transfer onions and pan juices to 2 separate small bowls (do not clean roasting pan). Skim and discard fat from juices.",
        "Set roasting pan over a burner. Add wine and deglaze by boiling over high heat, stirring and scraping up brown bits, until reduced to about 2 tablespoons. Add pan juices from bowl, any juices that have accumulated on platter (from chicken), mushroom-soaking liquid, and morels, then boil until liquid is reduced to about 1/3 cup.",
        "Cut remaining 2 tablespoons butter into pieces and add to morels with onions and asparagus. Cook over moderately high heat, shaking pan, until butter is just incorporated and vegetables are glazed. Season vegetables with salt and pepper and spoon around chicken."
    ],
    "ingredients": [
        "10 ounces pearl onions",
        "1 (3- to 3 1/2-pound) chicken, excess fat removed and legs tied",
        "1 tablespoon olive oil",
        "4 tablespoons unsalted butter (2 tablespoons cold, 2 tablespoons softened)",
        "1 lemon, halved",
        "1 ounce small dried morel mushrooms",
        "1 cup warm water",
        "1 pound medium green asparagus, peeled and trimmed",
        "Kosher salt to taste",
        "1/4 cup dry white wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Onion",
        "Vegetable",
        "Roast",
        "Dinner",
        "Asparagus",
        "Spring",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Roast Chicken with Asparagus, Morel, and Pearl-Onion Ragoût",
    "url": "http://www.epicurious.com/recipes/food/views/roast-chicken-with-asparagus-morel-and-pearl-onion-ragout-104757"
}
