{
    "directions": [
        "Preheat oven to 425°F. Melt butter in heavy large pot over medium-high heat. Add 2 teaspoons ras el hanout and stir 1 minute. Add pears and sauté until tender, stirring occasionally, about 4 minutes. Transfer pears to plate.",
        "Heat 1 tablespoon oil in same pot over medium heat. Add onion and apricots. Sauté until onion begins to soften, about 3 minutes. Add broth and honey. Simmer until sauce thickens slightly, about 8 minutes. Return pears to pot. Remove from heat. (Sauce can be made 2 hours ahead. Let stand at room temperature.)",
        "Mix remaining 2 tablespoons oil and 2 teaspoons ras el hanout in small bowl to blend. Rub mixture all over pork tenderloins. Transfer pork to roasting pan. Roast until meat thermometer inserted into center of pork registers 155°F, about 30 minutes. Transfer pork to cutting board. Let stand 10 minutes.",
        "Meanwhile, reheat sauce over medium heat, stirring constantly. Cut pork crosswise into 1/2-inch-thick slices. Divide pork among 6 plates. Spoon sauce and pears over pork. Sprinkle with almonds."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter",
        "4 teaspoonsRas el Hanout",
        "5 ripe pears, peeled, cored, each cut into 6 wedges",
        "3 tablespoons olive oil",
        "1 onion, chopped",
        "9 ounces dried apricots, soaked in warm water 30 minutes, drained, chopped (about 2 cups)",
        "1 1/2 cups canned beef broth",
        "1/4 cup honey",
        "2 1-pound pork tenderloins",
        "1/2 cup slivered almonds (about 4 ounces), toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Pork",
        "Roast",
        "Dinner",
        "Dried Fruit",
        "Pear",
        "Apricot",
        "Meat",
        "Pork Tenderloin",
        "Fall",
        "Winter",
        "Anniversary",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Roast Pork Tenderloin with Pears and Dried Apricots",
    "url": "http://www.epicurious.com/recipes/food/views/roast-pork-tenderloin-with-pears-and-dried-apricots-106114"
}
