{
    "directions": [
        "Into a large kettle of boiling salted water plunge the lobster and boil it, covered, for 2 minutes. Transfer the lobster with tongs to a buttered baking dish and with kitchen shears cut down the back of the shell without piercing the flesh.",
        "Sprinkle the lobster with salt and pepper, brush it with the butter, and sprinkle it with the herbes à tortue.",
        "Roast the lobster in a preheated moderately hot oven (375° F), basting it frequently with the pan juices, for 12 to 15 minutes, or until the flesh is firm.",
        "Halve the lobster lengthwise, arrange it on a heated plate, and serve it with the butter sauce.",
        "In a stainless steel or enameled saucepan combine the wine, the shallot, the thyme, the bay leaf, and salt and pepper to taste and reduce the wine over moderately high heat to about 2 tablespoons.",
        "Add the cream and reduce the liquid by half. Whisk in the butter, 1 piece at a time, over low heat, adding each new piece before the previous one has melted completely. (The butter must not get hot enough to liquefy. The sauce should be the consistency of a light hollandaise.) Add the lemon juice and salt and pepper to taste and strain the sauce through a fine sieve into a heated serving bowl."
    ],
    "ingredients": [
        "1 1/4–1 1/2 pound lobster",
        "1/4 cup unsalted butter, melted",
        "Kosher salt, freshly ground pepper",
        "1/4 teaspoon herbes á tortue (or a pinch each of dried thyme, dried oregano, dried basil, and dried marjoram)",
        "1 cup pink butter, recipe follows",
        "1 cup dry red wine",
        "2 tablespoons minced shallot",
        "1/2 teaspoon dried thyme",
        "1/2 bay leaf, crumbled",
        "1/3 cup heavy cream",
        "1 cup unsalted butter, cut into pieces",
        "Freshly squeezed lemon juice, to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lobster",
        "Gourmet",
        "Butter",
        "Seafood"
    ],
    "title": "Roast Lobster with Pink Butter Sauce (Langouste Rôtie au Beurre Rose Hostelleries Saint-Roch)",
    "url": "http://www.epicurious.com/recipes/food/views/roast-lobster-with-pink-butter-sauce"
}
