{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "Fill a large pot with water, add 1 tablespoon of salt and a splash of oil, and bring the water to a boil. Add the orzo and simmer for 9 to 11 minutes, stirring occasionally, until it's cooked al dente. Drain and pour into a large bowl. Whisk together the lemon juice, 1/2 cup olive oil, 2 teaspoons salt and 1 teaspoon of pepper. Pour over the hot pasta and stir well.",
        "Meanwhile, place the shrimp on a sheet pan, drizzle with olive oil, and sprinkle with salt and pepper. Toss to combine and spread out in a single layer. Roast for 5 to 6 minutes, until the shrimp are cooked through. Don't overcook!",
        "Add the shrimp to the orzo and then add the scallions, dill, parsley, cucumber, onion, 2 teaspoons salt, and 1 teaspoon pepper. Toss well. Add the feta and stir carefully. Set aside at room temperature for 1 hour to allow the flavors to blend, or refrigerate overnight. If refrigerated, taste again for seasonings and bring back to room temperature before serving."
    ],
    "ingredients": [
        "Kosher salt",
        "Good olive oil",
        "3/4 pound orzo pasta (rice-shaped pasta)",
        "1/2 cup freshly squeezed lemon juice (3 lemons)",
        "Freshly ground black pepper",
        "2 pounds (16 to 18 count) shrimp, peeled and deveined",
        "1 cup minced scallions, white and green parts",
        "1 cup chopped fresh dill",
        "1 cup chopped fresh flat-leaf parsley",
        "1 hothouse cucumber, unpeeled, seeded, and medium-diced",
        "1/2 cup small-diced red onion",
        "3/4 pound good feta cheese, large diced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Make Ahead",
        "Pasta Recipes",
        "Salad Recipes",
        "Onion Recipes",
        "Vegetable",
        "Shellfish Recipes",
        "Shrimp",
        "Cucumber",
        "Cheese",
        "Feta",
        "Main Dish Recipes",
        "Lunch"
    ],
    "title": "Roasted Shrimp and Orzo",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/roasted-shrimp-and-orzo-recipe"
}
