{
    "directions": [
        "Preheat oven to 450°F. and oil 2 large shallow baking pans.",
        "In a large bowl toss squash with oil until coated well and spread in one layer in pans. Roast squash in oven 10 minutes and season with salt. Stir squash and roast 10 to 15 minutes more, or until tender and beginning to turn golden.",
        "While squash is roasting, in a saucepan bring milk to a simmer with rosemary. Heat milk mixture over low heat 10 minutes and pour through a sieve into a large pitcher or measuring cup.",
        "In a large heavy saucepan cook garlic in butter over moderately low heat, stirring, until softened. Stir in flour and cook roux, stirring, 3 minutes. Remove pan from heat and whisk in milk mixture in a stream until smooth. Return pan to heat and simmer sauce, whisking occasionally, about 10 minutes, or until thick. Stir in squash and salt and pepper to taste. Sauce may be made 3 days ahead and chilled, its surface covered with plastic wrap.",
        "Reduce temperature to 375°F. and butter a baking dish, 13 by 9 by 2 inches.",
        "Pour 1 cup sauce into baking dish (sauce will not cover bottom completely) and cover with 3 lasagne sheets, making sure they do not touch each other. Spread half of remaining sauce over pasta and sprinkle with 1/2 cup Parmesan. Make 1 more layer in same manner, beginning and ending with pasta.",
        "In a bowl with an electric mixer beat cream with salt until it holds soft peaks and spread evenly over top pasta layer, making sure pasta is completely covered. Sprinkle remaining 1/3 cup Parmesan over cream. Cover dish tightly with foil, tenting slightly to prevent foil from touching top layer, and bake in middle of oven 30 minutes. Remove foil and bake lasagne 10 minutes more, or until top is bubbling and golden. Let lasagne stand 5 minutes.",
        "Garnish each serving with rosemary."
    ],
    "ingredients": [
        "3 pounds butternut squash, quartered, seeded, peeled, and cut into 1/2-inch dice (about 9 1/2 cups)",
        "3 tablespoons vegetable oil",
        "4 cups milk",
        "2 tablespoons dried rosemary, crumbled",
        "1 tablespoon minced garlic",
        "1/2 stick (1/4 cup) unsalted butter",
        "4 tablespoons all-purpose flour",
        "nine 7- by 3 1/2-inch sheets dry no-boil lasagne pasta",
        "1 1/3 cups freshly grated Parmesan (about 5 ounces)",
        "1 cup heavy cream",
        "1/2 teaspoon salt",
        "Garnish: fresh rosemary sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Garlic",
        "Herb",
        "Pasta",
        "Vegetable",
        "Bake",
        "Dinner",
        "Fall",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Roasted Butternut Squash, Rosemary, and Garlic Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/roasted-butternut-squash-rosemary-and-garlic-lasagne-13479"
}
