{
    "directions": [
        "Preheat an oven to 375 degrees F (190 degrees C). Grease a large pie plate or baking dish.",
        "Place olive oil, garlic, ginger, curry paste, cilantro, cumin, turmeric, cayenne pepper, and cinnamon into the work bowl of a food processor, and process into a paste. Place the curry paste into a large mixing bowl, and stir with red onions, eggplant, celery, and red bell pepper to coat all the vegetables with curry mixture. Turn the vegetables into a large skillet over medium heat, and cook and stir until the vegetables are tender, about 7 minutes. Stir in the cooked lamb, and cook and stir until the lamb is hot and coated with spice mixture, 2 to 3 more minutes. Turn off the heat under the skillet.",
        "Heat milk, butter, and wine in a saucepan over medium heat until the mixture is hot but not boiling, and the butter is melted. Whisk 3 tablespoons of flour into the hot milk mixture, and cook, whisking constantly, until the sauce has thickened. Turn the heat under the skillet of lamb and vegetables to medium, and cook and stir until hot, about 2 minutes; pour the sauce into the lamb and vegetables, and stir to combine. Season to taste with salt, and pour the hot filling into the prepared pie plate.",
        "To make crust, mix together 1 cup flour, 1/2 teaspoon of salt, and curry powder in a bowl until thoroughly combined. Cut in the shortening with a pastry cutter until the mixture resembles coarse crumbs. Sprinkle with water, and stir gently until the dough just comes together. Form into a rough ball, place on a floured work surface, and roll out into a crust to fit the pie dish. Lay the crust over the dish and lamb filling, crimp it to the dish with a fork, and cut several slits in the top of the crust.",
        "Bake in the preheated oven until the crust is golden brown and the filling is hot, about 35 minutes. Let cool 7 to 10 minutes before serving."
    ],
    "ingredients": [
        "Filling:",
        "3 tablespoons olive oil",
        "3 cloves garlic",
        "1 (3/4 inch thick) slice fresh ginger root, coarsely chopped",
        "1 tablespoon red curry paste",
        "1/2 cup fresh cilantro leaves",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground turmeric",
        "1/2 teaspoon cayenne pepper",
        "1/4 teaspoon ground cinnamon",
        "3 red onions, chopped",
        "1 eggplant, chopped",
        "3/4 cup chopped celery",
        "1 large red bell pepper, chopped",
        "3 cups diced leftover roast lamb",
        "Sauce:",
        "1 1/2 cups milk",
        "3 tablespoons butter",
        "1/2 cup sweet white wine",
        "3 tablespoons all-purpose flour",
        "salt to taste",
        "Crust:",
        "1 cup all-purpose flour",
        "1/2 teaspoon salt",
        "1 tablespoon curry powder",
        "6 tablespoons shortening",
        "3 tablespoons cold water, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rob's Lamb Curry Pie",
    "url": "http://allrecipes.com/recipe/214008/robs-lamb-curry-pie/"
}
