{
    "directions": [
        "Place eggs (and water to cover) in a medium saucepan. Bring water to a boil, remove from heat and let cool. Peel eggs and remove yolks. Mash yolks and set aside.",
        "In a large bowl, stir together the flour, sugar, yolks, orange zest, and salt. Using your fingertips, quickly press the butter into the flour mixture until it holds together. Shape the dough into a disc and place it between two large pieces of waxed paper. Set it aside at room temperature for 1 hour.",
        "Preheat the oven to 375 degrees F (190 degrees C).",
        "Using a rolling pin, roll the dough out between the waxed paper to a 1/4-inch thickness.   Cut out the cookies using a star-shape cookie cutter, a fluted or plain 2 1/2-inch round cutter, or a juice glass.",
        "Carefully transfer the cookies to a baking sheet, leaving about 1 inch between the cookies. (If   the dough is too soft and it is difficult to transfer the cookies, slide the waxed paper with the cutout cookies onto a baking sheet and freeze or refrigerate for 5 to 10 minutes.)  Gather together any scraps of dough and repeat the process.",
        "Bake for 8 minutes or until the cookies are lightly browned on the edges.",
        "Transfer the baking sheet to a wire rack and cool for 2 to 4 minutes. Using a metal spatula, lift the cookies   to a wire rack and cool completely. When cool, store the cookies in an airtight container. These cookies   freeze well."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=4000&h=2094&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F821163.jpg",
    "ingredients": [
        "3  eggs",
        "2 ⅓ cups all-purpose flour",
        "½ cup white sugar",
        "1 ½ teaspoons orange zest",
        "¼ teaspoon salt",
        "1 cup butter, cut into pieces"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rochelle Sable",
    "url": "http://allrecipes.com/recipe/10964/rochelle-sable/"
}