{
    "directions": [
        "Set a fine-mesh sieve over a medium bowl. Working over sieve, squeeze tomatoes to release juices and break up flesh. Let tomatoes drain in sieve, collecting juices in bowl, until ready to use.",
        "Heat 1/3 cup oil in a large Dutch oven or other heavy pot over medium. Cook fennel, garlic, and half of chile, stirring often, until garlic is golden and fennel is starting to brown around the edges, 5–8 minutes. Transfer fennel mixture with a slotted spoon to a small bowl.",
        "Increase heat to high; cook drained tomatoes in same pot, stirring occasionally, until broken down and starting to brown, about 5 minutes. Add wine, scraping up browned bits, and cook until almost completely evaporated, about 1 minute. Add fennel mixture and collected tomato juices, bring to a simmer, and cook, stirring occasionally, until slightly thickened, 5–10 minutes.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 3 minutes less than package directions.",
        "Using a spider or a slotted spoon, transfer pasta to pot with sauce; add shrimp and 1/2 cup pasta cooking liquid. Cook, tossing often, until pasta is al dente and coated in sauce and shrimp are cooked through, about 3 minutes. Thin sauce with more pasta cooking liquid if needed; season with salt. Remove from heat; add butter and toss to combine. Season with more salt if needed.",
        "Divide pasta among bowls. Top with fennel fronds and remaining chile and drizzle with oil."
    ],
    "ingredients": [
        "1 (28-ounce) can whole peeled tomatoes, preferably San Marzano, drained",
        "1/3 cup olive oil, plus more for drizzling",
        "1/2 medium fennel bulb, fronds reserved, core removed, bulb thinly sliced",
        "8 garlic cloves, smashed",
        "1 Fresno chile, very thinly sliced, divided",
        "1/4 cup dry white wine",
        "12 ounces strozzapreti or casarecce pasta",
        "Kosher salt",
        "1 pound rock shrimp or 1 small shrimp, peeled, deveined",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Shrimp",
        "Seafood",
        "Tomato",
        "Fennel",
        "Chile Pepper",
        "Quick & Easy"
    ],
    "title": "Rock Shrimp Pasta With Spicy Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/rock-shrimp-pasta-with-spicy-tomato-sauce"
}
