{
    "directions": [
        "Bake the cake according to the directions on the box. Use two 8 or 9 inch pans. When the cakes are done, turn them out of the pans. Let them cool for about forty minutes. When the cakes are almost cool, but still slightly warm to the touch, cut small slits in the tops of each layer.",
        "Melt about 1 1/2 cups of the marshmallows and the chocolate frosting together in the microwave. Stir together ever thirty seconds or so to keep the sauce smooth.",
        "Melt the caramels in the microwave with a tablespoon or two of milk. Stir every twenty seconds or so.",
        "Place 1 layer of cake on serving dish. Pour enough of the chocolate frosting mixture over the bottom layer of the cake to cover the top and sink into the slits. It is okay if the frosting drips over the edges. Pour enough of the caramel sauce over the bottom layer to cover it liberally. Sprinkle about half of the nuts and remaining marshmallows over the caramel. Go easy on the marshmallows though, or the top won't sit well on the cake.",
        "Place top layer over marshmallows, and pour on the remaining chocolate frosting mixture to cover the top of the cake. Let it drip over the edges and cover the sides of the cake as well. Some of the frosting will pool at the bottom and that's fine.",
        "Now sprinkle remaining nuts and marshmallows over the top. Try to get them to stick to the sides as well. I use a lot of nuts and marshmallows on top. Finally, drizzle caramel sauce over the top of the cake."
    ],
    "ingredients": [
        "1 (18.25 ounce) package chocolate cake mix",
        "1 (16 ounce) package prepared chocolate frosting",
        "20 individually wrapped caramels",
        "3 cups miniature marshmallows",
        "1 cup chopped walnuts",
        "2 tablespoons milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rocky Road Turtles® Cake",
    "url": "http://allrecipes.com/recipe/8264/rocky-road-turtles-cake/"
}
