{
    "directions": [
        "Preheat oven to 450 degrees F (230 degrees C).",
        "Rinse the roast and pat dry with paper towels. Mix the onion soup mix and pepper together in a small bowl. Rub the pepper mixture generously over all sides of the roast. Place the roast on a clean, dry baking sheet, and rest 30 to 45 minutes.",
        "Meanwhile, mix the rock salt, flour, rosemary together in a bowl. Gradually pour in the water and mix by hand (wear gloves if desired) to make a thick, sticky batter or paste. Add more water if necessary. Spread the salt batter into the bottom of a roasting pan to make a layer 1/2 to 3/4 inch thick., reserving 1 to 2 cups. Place the roast, bones facing down, in the middle of the batter in the pan. Pull the batter up and around the roast to completely cover the meat. Pat on extra batter if necessary. Insert meat thermometer into the roast with its gauge positioned to be visible from the front of the oven (or use a regular meat thermometer).",
        "Cook in preheated oven for 15 to 20 minutes. Remove, and use remaining salt batter to patch any holes or breaks in the coating.",
        "Meanwhile, prepare au jus according to package directions leaving out 1/4 cup water to boost flavor, and keep warm.",
        "Return roast to the oven, and cook until internal temperature reaches 130 degrees F (54 degrees C), or to desired doneness. Remove roast, and rest 20 to 30 minutes until internal temperature reaches 140 degrees F (60 degrees C). Chip off the crust and discard and then slice to serve. Serve garnished with horseradish and au jus."
    ],
    "ingredients": [
        "20 pounds standing rib roast (weight with bones), top fat trimmed",
        "2 (1 ounce) packages dry onion soup mix",
        "2 tablespoons freshly ground black pepper",
        "8 cups rock salt",
        "8 cups all-purpose flour",
        "2 tablespoons crushed dried rosemary",
        "2 cups water, or more if needed",
        "1 (4 ounce) jar prepared horseradish, for serving",
        "3 (1 ounce) packages au jus gravy mix, for serving"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rock Salt Encrusted Prime Rib",
    "url": "http://allrecipes.com/recipe/154851/rock-salt-encrusted-prime-rib/"
}
