{
    "directions": [
        "Set the loin on a cutting board with one of the short, cut ends facing you. With a sharp knife, make a lengthwise horizontal cut, about a third of the way up one of the long sides, like asymmetrically splitting open a hot dog bun. Don’t cut all the way through, but nearly—far enough so that you can open up the roast like a book. If you started on the right, the left side will now be twice as thick as the right. At the hinge where they meet, make another horizontal cut midway up the left (thicker) side, so that you can open the roast again, like a magazine gatefold. Sprinkle the pork all over with the salt and pepper and set it aside.",
        "Heat the oven to 425°F and make the stuffing by mixing all the remaining ingredients together (except the cooking oil). Spread the stuffing over the cut side of the pork loin, then roll it up and back into shape. Using cotton string, bind the roast with six little string belts.",
        "Heat a skillet to high, add the cooking oil, and then carefully lay in the pork roast. Brown the roast on all sides and then put the skillet in the oven. Roast until it is just cooked through, about 20 minutes, then remove it from the pan and let it rest on a platter in a warm place for 10 minutes. Remove the strings, slice, and serve."
    ],
    "ingredients": [
        "2-pound boneless pork loin roast",
        "1/2 teaspoon salt",
        "Freshly ground black pepper",
        "2/3 cup olives, pitted and finely chopped (Niçoise, Picholine, Lucques, and/or Castelvetrano)",
        "2 tablespoons capers (salt-packed and very well soaked to desalinate, or brined capers rinsed well)",
        "1 garlic clove, pounded with a pinch of salt",
        "1 teaspoon finely chopped rosemary or sage leaves",
        "1 tablespoon chopped thyme leaves",
        "2 tablespoons chopped parsley",
        "1/4 cup good olive oil",
        "1 tablespoon cooking oil, olive or vegetable"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Pork",
        "Olive",
        "Dinner",
        "Roast",
        "Capers",
        "Parsley",
        "Entertaining",
        "Christmas Eve",
        "Fall",
        "Winter",
        "Wheat/Gluten-Free"
    ],
    "title": "Rolled Pork Loin Roast Stuffed With Olives and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/rolled-pork-loin-roast-stuffed-with-olives-and-herbs"
}
