{
    "directions": [
        "Let the beef roast stand at room temperature for about 1 hour.",
        "In a nonreactive bowl, combine the heavy cream and sour cream and whisk until smooth. Add the lemon juice, salt, pepper and horseradish and whisk until blended. Cover and refrigerate until ready to serve.",
        "Position a rack in the lower third of an oven and preheat to 350°F.",
        "In a small sauté pan over medium heat, warm 2 Tbs. of the olive oil. Add the garlic and fry, stirring constantly, until golden, 1 to 2 minutes. Remove the pan from the heat and immediately skim the garlic from the oil, reserving the garlic.",
        "Season the beef generously with salt and pepper and rub the fried garlic over the roast. Set the beef on a rack in a roasting pan and roast until an instant-read thermometer inserted into the center of the meat registers 125°F for very rare to rare, 1 3/4 to 2 hours; or 130° to 135°F for medium-rare to medium, 2 1/4 to 2 3/4 hours. Transfer the roast to a carving board, cover loosely with aluminum foil and let rest for 20 minutes before carving.",
        "Meanwhile, in a saucepan over medium-high heat, warm the remaining 2 Tbs. oil. Add the carrots, celery and leek, and sauté until tender and golden, 6 to 8 minutes. Add 4 cups of the stock and the thyme sprigs, bring to a simmer and reduce the heat to low. Simmer until the liquid is reduced by half, about 1 hour.",
        "After removing the roast from the pan, set the pan over medium heat, pour in the remaining 1 cup stock and whisk to scrape up the browned bits from the pan bottom. Pour the pan juices into the simmering stock, add the chopped thyme and simmer for 10 minutes. Strain the sauce through a fine-mesh sieve set over a bowl. Skim off the fat and taste and adjust the seasonings with salt and pepper. Transfer the sauce to a sauceboat or pitcher.",
        "Carve the beef into 1/2-inch-thick slices and arrange on a warmed platter. Pass the sauce and the horseradish cream alongside."
    ],
    "ingredients": [
        "1 boneless beef rib roast, about 8 lb., tied with&nbspkitchen string",
        "3/4 cup heavy cream",
        "1 cup sour cream",
        "Juice of 1 lemon",
        "Salt and freshly ground pepper, to taste",
        "1/2 cup freshly grated or prepared horseradish",
        "1/4 cup olive oil",
        "1 Tbs. finely minced garlic",
        "2 large carrots, chopped",
        "3 celery stalks, chopped",
        "1 leek, white and light green portions, chopped&nbspand rinsed well",
        "5 cups beef stock",
        "4 fresh thyme sprigs plus 1 tsp. chopped fresh thyme"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Rolled Beef Rib Roast with Horseradish Cream",
    "url": "http://www.williams-sonoma.com/recipe/rolled-beef-rib-roast-with--horseradish--cream.html"
}
