{
    "directions": [
        "Cook pancetta in 2 tablespoons oil in a 10- to 12-inch heavy skillet over moderate heat, stirring occasionally, until golden and crisp, 4 to 7 minutes. Transfer with a slotted spoon to paper towels to drain, reserving fat in skillet.",
        "Strip romaine leaves from stems, reserving both separately, then tear leaves into roughly 2-inch pieces. Measure 4 loosely packed cups of leaves and reserve remainder. With motor running, add garlic to food processor to finely chop. Turn off and add the 4 cups romaine leaves along with the parsley, 1/4 teaspoon salt, 1/4 teaspoon pepper, and cheese, then pulse until finely chopped. With motor running, add remaining cup oil in a slow stream, blending until incorporated.",
        "Put oven rack in upper third of oven and preheat oven to 400°F.",
        "Cut off about 1/8 inch from top of each tomato with a sharp knife. Gently scrape out pulp and seeds with a spoon and discard them. Put tomatoes, cut sides up, in a 9-inch glass or ceramic dish and spoon 1 tablespoon romaine-parsley pesto into each tomato (you will have extra pesto). Crack 1 egg into each tomato and season with salt and pepper. Bake eggs in tomatoes until whites are set and yolks are still runny, 18 to 22 minutes.",
        "While eggs bake, heat fat in skillet over moderate heat until hot but not smoking, then cook remaining torn romaine leaves and stems, 1/4 teaspoon salt, and 1/8 teaspoon black pepper, turning and stirring with tongs, until leaves are wilted and stems are crisp-tender, about 3 minutes. Stir in pancetta and divide mixture among 6 plates. Top each serving with a tomato and sprinkle with additional cheese."
    ],
    "ingredients": [
        "6 oz sliced pancetta (Italian unsmoked cured bacon), chopped",
        "1/2 cup plus 2 tablespoons extra-virgin olive oil",
        "1 large head romaine (about 1 1/2 lb)",
        "1 large garlic clove",
        "1/4 cup loosely packed fresh flat-leaf parsley leaves",
        "1/2 teaspoon salt",
        "3/8 teaspoon black pepper",
        "1 oz finely grated Parmigiano-Reggiano (1/2 cup), plus additional for serving",
        "6 large tomatoes (about 3 inches in diameter)",
        "6 large eggs at room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Leafy Green",
        "Herb",
        "Pork",
        "Tomato",
        "Brunch",
        "Bake",
        "Lettuce",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Romaine- and Egg-Stuffed Tomatoes with Pancetta",
    "url": "http://www.epicurious.com/recipes/food/views/romaine-and-egg-stuffed-tomatoes-with-pancetta-235770"
}
