{
    "directions": [
        "Place a rack in lower third of oven; preheat to 400°. Toss potato, sweet potato, carrots, parsnip, and onion with oil on a rimmed baking sheet; season with salt and pepper and arrange vegetables in a single layer. Roast until golden around the edges and tender, 30-35 minutes. Let cool.",
        "Meanwhile, cook sugar and 2 tablespoons water in a small saucepan over mediumhigh heat, swirling pan occasionally, until mixture is amber-colored, 5-7 minutes. Remove from heat and add vinegar and a pinch of salt, swirling pan to combine. Quickly pour caramel into a 9\"-diameter pie pan; tilt and rotate pan to evenly coat bottom with caramel. Scatter rosemary and sage over top.",
        "Arrange potatoes, carrots, and parsnips snugly in a single layer on top of caramel, using smaller carrot and parsnip pieces to fill in any holes. Scatter onion rings and crumble goat cheese over vegetables.",
        "Roll out dough on a lightly floured surface to a 12\" round. Drape over vegetables, tucking edges into pan. Prick dough all over with a fork. Bake until crust looks dry, about 20 minutes; reduce heat to 350° and bake until crust is golden brown, 15-20 minutes.",
        "Let tart cool 5 minutes before inverting carefully onto a large plate.",
        "Do ahead: Vegetables can be roasted 4 hours ahead. Keep at room temperature."
    ],
    "ingredients": [
        "1 medium Yukon Gold potato, peeled, sliced into 1/2\" rounds",
        "1 medium sweet potato, peeled sliced into 1/2\" rounds",
        "2 medium carrots, peeled, sliced into 1/2\" rounds",
        "1 medium parsnip, peeled, sliced into 1/2\" rounds",
        "1 small red onion, sliced into 1/2\" rounds",
        "1/4 cup olive oil",
        "Kosher salt, freshly ground pepper",
        "1/3 cup sugar",
        "1 tablespoon white wine vinegar",
        "1 1/2 teaspoons chopped fresh rosemary",
        "1 1/2 teaspoons chopped fresh sage",
        "4 ounces fresh goat cheese",
        "1 disk All-Butter Pie Dough",
        "All-purpose flour (for surface)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Potato",
        "Side",
        "Bake",
        "Kid-Friendly",
        "Goat Cheese",
        "Carrot",
        "Parsnip",
        "Sweet Potato/Yam",
        "Healthy",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Root Vegetable Tarte Tatin",
    "url": "http://www.epicurious.com/recipes/food/views/root-vegetable-tarte-tatin-51263490"
}
