{
    "directions": [
        "Preheat oven to 400°F. Butter a shallow 2-quart baking dish. Melt 2 tablespoons butter in a medium skillet over medium-high heat. Add breadcrumbs; cook, stirring often, until golden brown, 5—7 minutes. Transfer to a small bowl and toss with 1/2 cup Parmesan and 1 tablespoon thyme leaves; season with salt and pepper.",
        "Bring cream, broth, thyme sprigs, and remaining 2 tablespoons butter to a simmer in a medium saucepan over medium heat; season with salt and pepper. Remove from heat, cover, and let sit 10 minutes; discard thyme. Cover and keep warm.",
        "Toss vegetables and garlic in a large bowl; season with salt and pepper. Arrange 1/3 of vegetables in dish and top with 1/2 cup Parmesan. Repeat layers; top with remaining vegetables. Pour cream mixture over; place a piece of parchment paper directly on top of vegetables.",
        "Bake until vegetables are crisp-tender and cream is thickened, 50–60 minutes. Uncover, top with breadcrumbs, and bake until gratin is bubbling and breadcrumbs are brown, 15–20 minutes longer. Let sit 10 minutes before serving."
    ],
    "ingredients": [
        "4 tablespoons unsalted butter, divided, plus more for baking dish",
        "1 1/2 cups coarse fresh breadcrumbs",
        "1 1/2 cups grated Parmesan, divided",
        "6 sprigs thyme plus 1 tablespoon leaves",
        "Kosher salt, freshly ground pepper",
        "3 cups heavy cream",
        "1 cup low-sodium chicken broth",
        "1 1/2 pounds celery root, peeled, sliced 1/16\" thick",
        "1 pound rutabaga, peeled, sliced 1/16\" thick",
        "1 pound turnips, peeled, sliced 1/16\" thick",
        "1 pound Yukon Gold potatoes, peeled, sliced 1/16\" thick",
        "2 garlic cloves, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Bake",
        "Thanksgiving",
        "Casserole/Gratin",
        "Root Vegetable",
        "Turnip",
        "Fall",
        "Rutabaga"
    ],
    "title": "Root Vegetable Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/root-vegetable-gratin-51198860"
}
