{
    "directions": [
        "Pour sesame oil, chile-garlic sauce, and 1 teaspoon salt in a bowl. Stir to dissolve salt. Place ribs onto a square of aluminum foil and brush sesame oil mixture onto ribs on both sides. Place ribs into a heavy resealable plastic bag.",
        "Pour root beer over the ribs and seal the bag. Refrigerate at least 12 hours, or overnight. Remove ribs from marinade; reserve marinade in a bowl and keep refrigerated.",
        "Preheat oven to 250 degrees F (120 degrees C). Place a large piece of aluminum foil onto a baking sheet.",
        "Place rib racks, meat-side up, onto the foil and season both sides with salt and black pepper. Place a piece of parchment paper on top of the meat; place another piece of foil over the parchment paper. Fold edges and seal sides to make an airtight package.",
        "Bake ribs in the preheated oven until almost fork-tender, about 2 hours. Open foil packet and test for doneness; a fork inserted into the meat will go in with some effort.",
        "Transfer reserved marinade to a small saucepan. Add garlic, green onions, and rice vinegar to marinade and bring to a boil. Reduce heat to medium-high and cook until sauce is reduced by half, about 5 minutes; stir often.",
        "Pour pan juices from foil packet into saucepan with the sauce. Add Asian chile pepper sauce. Bring back to a simmer and cook sauce until slightly thickened to a glaze, about 5 more minutes.",
        "Increase oven heat to 450 degrees F (230 degrees C). Line another baking sheet with foil and transfer ribs to baking sheet.",
        "Brush both sides of ribs with thickened glazing sauce. Cook in hot oven until glaze begins to cook onto meat, 6 to 7 minutes. Brush another coat of glaze onto the ribs; repeat 4 more times, cooking 5 to 6 more minutes per time, until meat is shiny, glazed, browned, and fully fork-tender. Brush 1 more coat of glaze onto meat.",
        "Sprinkle ribs with sesame seeds and cook for 5 more minutes to set the last glaze coat."
    ],
    "ingredients": [
        "3 tablespoons Asian (toasted) sesame oil",
        "3 tablespoons chile-garlic sauce (such as Sriracha)",
        "1 teaspoon salt",
        "2 (8 bone) racks lamb ribs",
        "1 (12 fluid ounce) can or bottle root beer",
        "salt and ground black pepper to taste",
        "3 cloves garlic, peeled",
        "1/4 cup finely chopped green onions",
        "1/4 cup rice vinegar",
        "1 tablespoon Asian chile pepper sauce (such as sambal oelek)",
        "2 teaspoons toasted sesame seeds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Root Beer and Sesame Glazed Ribs",
    "url": "http://allrecipes.com/recipe/233272/root-beer-and-sesame-glazed-ribs/"
}
