{
    "directions": [
        "Preheat oven to 350 degrees F. Line a baking sheet with two long sheets of Reynolds Wrap(R) Aluminum Foil, overlapping them in opposing directions so you make a cross, with plenty of foil at each end to eventually fold over into the center. Lightly spray with cooking spray and set aside.",
        "In a large mixing bowl, stir together cream, shallot and garlic. Add parsnips, sweet potato and turnip and carefully toss together until all the pieces are well coated. In another mixing bowl combine 1 cup of the grated cheese, green onion, and thyme and toss together.",
        "To assemble, place a single layer of cream-coated root vegetable pieces onto the foil-lined baking sheet and season generously with salt and pepper. Sprinkle 1/4 of the cheese mixture over the surface. Repeat with another layer of vegetables, salt and pepper and cheese mixture and continue with this pattern until all the ingredients have been used (finishing with a layer of vegetables).",
        "Bring each side of the excess foil hanging over the baking sheet together and seal tightly, leaving room for heat circulation inside. Bake gratin in the oven for 40 to 45 minutes or until vegetables are fork tender. Open foil carefully by cutting along top fold with a sharp knife, allowing steam to escape; then open top of foil.",
        "Uncover gratin and sprinkle remaining cheese over the top. Place gratin under a broiler and broil for 30 seconds to 1 minute or until cheese has melted and the top has browned slightly. Allow gratin to cool for about 10 minutes before cutting up and serving."
    ],
    "ingredients": [
        "2 cups heavy cream",
        "1 shallot, minced",
        "2 cloves garlic, minced",
        "1 sweet potatoes",
        "2 parsnips, peeled and thinly sliced",
        "1 large turnip, peeled and thinly sliced",
        "1 1/4 cups shredded Gruyere cheese, divided",
        "1 green onion, thinly sliced",
        "1 tablespoon minced fresh thyme",
        "Salt and pepper to taste",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Root Vegetable Gratin from Reynolds Wrap®",
    "url": "http://allrecipes.com/recipe/244905/root-vegetable-gratin-from-reynolds-w/"
}
