{
    "directions": [
        "Toast coriander, cumin, and caraway seeds in small skillet over medium heat until beginning to brown, about 2 minutes. Cool. Transfer to spice mill; process until finely ground. Transfer to small bowl. Add red pepper, turmeric, and 1/2 teaspoon salt.",
        "Mix lemon slices, lemon juice, and 4 teaspoons coarse salt in small skillet. Bring to boil. Reduce heat, cover, and simmer until lemon slices are almost tender, about 10 minutes. Cool preserved lemon. Drain and chop. DO AHEAD: Spice blend and preserved lemon can be made 1 week ahead. Store spice blend airtight at room temperature. Transfer preserved lemon to small bowl; cover and chill.",
        "Heat olive oil in heavy large pot over medium-high heat. Add onion; sprinkle with salt and sauté until beginning to soften, about 5 minutes. Add toasted spice blend, garlic, and tomato paste; stir 1 minute. Add carrots and celery; stir 2 minutes. Add chopped preserved lemon, 4 cups water, sweet potatoes, turnips, olives, and sun-dried tomatoes. Simmer with lid ajar until vegetables are tender, stirring occasionally, about 35 minutes. Stir in parsley, cilantro, and mint. Season to taste with salt and pepper. Remove from heat and let stand 10 minutes to allow flavors to blend.",
        "Spoon couscous into large bowl, spreading out to edges and leaving well in center. Spoon vegetable tagine into well in center. Sprinkle Spice-Roasted Chickpeas over and serve."
    ],
    "ingredients": [
        "1 teaspoon coriander seeds",
        "1 teaspoon cumin seeds",
        "1/2 teaspoon caraway seeds",
        "1/2 teaspoon dried crushed red pepper",
        "1/4 teaspoon turmeric",
        "4 1/2 teaspoons coarse kosher salt, divided",
        "1/2 cup fresh lemon juice",
        "3 tablespoons extra-virgin olive oil",
        "1 1/2 cups chopped onion",
        "3 garlic cloves, minced",
        "1 1/2 tablespoons tomato paste",
        "1 1/4 cups 1/2-inch cubes peeled carrots",
        "1 celery stalk, chopped",
        "4 cups water",
        "1 1/4 pounds red-skinned sweet potatoes",
        "(yams), peeled, cut into 1-inch cubes",
        "1 pound turnips (about 2 medium), peeled, cut into 3/4-inch wedges",
        "3/4 cup brine-cured green olives, pitted, coarsely chopped",
        "1/4 cup sun-dried tomatoes (about 1 ounce; not oil-packed), thinly sliced",
        "1/4 cup chopped fresh Italian parsley",
        "2 tablespoons chopped fresh cilantro",
        "1 teaspoon dried mint",
        "1 10-ounce box plain couscous (cooked according to package directions)",
        "Spice-Roasted Chickpeas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Low Fat",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Chickpea",
        "Root Vegetable",
        "Carrot",
        "Turnip",
        "Sweet Potato/Yam",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Root Vegetable Tagine with Sweet Potatoes, Carrots, Turnips, and Spice-Roasted Chickpeas",
    "url": "http://www.epicurious.com/recipes/food/views/root-vegetable-tagine-with-sweet-potatoes-carrots-turnips-and-spice-roasted-chickpeas-361252"
}
