{
    "directions": [
        "Preheat the oven to 350°F.",
        "Grease the bottom and sides of a 10-inch cake pan well with some of the butter.",
        "Cut out a piece of parchment paper so it fits closely into the bottom of the cake pan. Line the bottom of the pan with the parchment, and then grease the parchment with more butter.",
        "Shake 1 tablespoon of the flour into the cake pan, and shake it around so it sticks to the butter. Tap out any excess flour that doesn't stick to the parchment or to the sides of the pan.",
        "Pour the root beer and molasses into a deep medium-sized pot, and bring the mixture to a boil over high heat. (You need those high sides because the baking soda will froth up very high, and you don't want it to spill over! So make sure there's some meaningful space between the liquid and the top of the pot.)",
        "Pull the pot off the heat and whisk in all the baking soda, so it froths up. Then put the pot right in the fridge to cool down a little.",
        "While the root beer mix is cooling down, whisk the brown sugar, vegetable oil, granulated sugar, ginger, and vanilla extract together in a mixing bowl. The mixture will be a little chunky at this point.",
        "Crack the egg into the bowl and whisk well. The egg is what makes everything come together smoothly: you should have a thick paste. Set this aside.",
        "In another mixing bowl, combine rest of the flour with the baking powder, star anise, and cardamom. Grate in the nutmeg and lemon zest, and add the salt and pepper. Whisk everything together so it's well combined.",
        "Take the root beer mixture out of the fridge. Pour a third of the flour mixture into a large mixing bowl; pour in one-third of the root beer mixture, then one-third of the sugar paste. Whisk everything together slowly (so it doesn't splash everywhere), and then add another one-third of the flour, another one-third of the root beer, and so forth, until everything is combined in the bowl. (The mix doesn't need to be completely and smoothly combined until the last of the wet and dry mixtures are in the bowl.) You should have a very wet, almost liquid batter.",
        "Pour the batter into the cake pan, put the pan on a cookie sheet (to catch drips and splashes), and put it on the middle oven rack.",
        "Bake the cake for 45 minutes without opening the oven at all (this cake will sink if you shake it up while it's baking). Check it: the cake should be high and dark brown, with a little bit of spring-back when you touch it (but not too much—it's a very moist cake). If it's not quite ready, rotate the pan and put it back in the oven for another 5 minutes before checking it again. The whole baking process shouldn't take longer than 55 minutes, even in a slow oven.",
        "Whisk the cream and sassafras together in a small pot, and bring it up to a boil over medium-high heat.",
        "As soon as it boils, pull the mixture off the heat, pour it into a glass or ceramic container (something that won't crack from the heat), and put it in the fridge. Let the mixture cool for about 30 minutes while the sassafras steeps into the cream, so you have a nice root beer flavor.",
        "In a mixing bowl, combine the powdered sugar, star anise, cardamon, and salt. Grate in the nutmeg and lemon zest, and whisk everything together.",
        "Strain the cooled cream through a fine-mesh strainer into a small mixing bowl (so the sassafras pieces don't end up in the glaze).",
        "Gently whisk 1/2 cup of the cream into the powdered sugar mixture, holding back the last 2 tablespoons to see if you need it. If the mixture is dry and not coming together as a glaze, add more cream. Whisk the mixture well, until you have a shiny, thick liquid.",
        "When the cake is ready, pull it out of the oven and let it rest for about 5 minutes.",
        "Flip the cake out of the pan onto a serving plate.",
        "Spread the glaze thickly on top of the warm cake with a spoon. The glaze will melt and drip down the sides as you slather it on.",
        "You can serve the cake as soon as it's cooled to room temperature—but like all spice cakes, it's even better the day after you make it. Store it covered at room temperature."
    ],
    "ingredients": [
        "1 tablespoon unsalted butter, at room temperature, for the pan",
        "1 1/2 cups plus 1 tablespoon all-purpose flour",
        "One 12-ounce bottle (1 1/4 cups) root beer",
        "1/2 cup molasses",
        "1/2 teaspoon plus 1/8 teaspoon baking soda",
        "3/4 cup dark brown sugar",
        "1/4 cup plus 2 tablespoons vegetable oil",
        "3 tablespoons plus 1 teaspoon granulated sugar",
        "One 1-inch piece of fresh ginger, peeled and grated on a microplane or on the finest side of a box grater (1 teaspoon)",
        "2 teaspoons vanilla extract",
        "1 large egg",
        "1 3/4 teaspoons baking powder",
        "1 1/4 teaspoons ground star anise",
        "1 1/2 teaspoons ground cardamom",
        "1/2 whole nutmeg, grated (or 2 teaspoons ground nutmeg)",
        "Finely grated zest of 2 lemons",
        "1 teaspoon kosher salt",
        "1/2 teaspoon fresh-ground black pepper",
        "3/4 cup heavy cream",
        "1 tablespoon sassafras bark (or 1/2 teaspoon sassafras extract; see Note))",
        "2 cups powdered sugar",
        "Pinch of ground star anise",
        "Pinch of ground cardamom",
        "1/4 teaspoon kosher salt",
        "1/4 whole nutmeg, grated (or about 1 teaspoon ground nutmeg)",
        "Finely grated zest of 1/2 lemon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Ginger",
        "Dessert",
        "Bake",
        "Birthday",
        "Chill",
        "Party",
        "Boil",
        "Advance Prep Required",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Root Beer Cake",
    "url": "http://www.epicurious.com/recipes/food/views/root-beer-cake-369449"
}
