{
    "directions": [
        "In the bowl of a food processor, pulse the flour, salt, and sugar. Add butter and pulse until coarse, pea-sized crumbs appear, about 10 seconds. With the machine running, add vodka and 2 tablespoons ice water and process until the dough just holds together, about 30 seconds. Squeeze a small amount of dough between your fingers -- if it is very crumbly, add more ice water, 1 tablespoon at a time (2 tablespoons maximum). Do not over process.",
        "Turn dough out onto a lightly floured surface and push together into a rough ball. Knead a few times to combine, then place on a piece of plastic wrap and push together using the plastic wrap to form a 5x7-inch rectangular slab. Refrigerate at least 1 hour (or overnight).",
        "Assemble the tart: Preheat oven to 375°F. In a small sauté pan, heat 1 1/2 tablespoons each olive oil and butter over medium-low heat. Add the leek, salt, sugar and a pinch of pepper and cook, stirring occasionally, until soft and slightly caramelized, about 10 minutes. Transfer leeks to the bowl of a food processor and let cool slightly.",
        "To the food processor, add the cream cheese, farmer cheese, and tarragon to the leek mixture. Pulse until smooth. Taste and adjust the seasoning, then add the egg and pulse a few more times until combined. Transfer to a bowl and refrigerate until ready to use.",
        "Bring a large pot of well-salted water to a boil. Add the vegetables (if using red beets, cook in a separate pot so they don't bleed). Bring to a boil then turn down to a simmer and cook until tender but still holding their structure, about 10 minutes. Drain and set aside to cool slightly.",
        "On a floured piece of parchment paper, roll your dough to 12x15-inch rough rectangle. Place 1 1/2 to 2 cups of filling in the center of the dough and spread out, leaving a 2-inch border on all sides. Arrange your vegetable rounds in a shingled pattern over the filling, then gently fold up the sides to create a border. Brush the vegetables lightly with oil and brush the pastry edges with egg wash, sprinkle the galette with coarse sea salt. Bake until vegetables are lightly golden and pastry is golden brown, 45 to 50 minutes. Transfer baking sheet to a wire rack to cool.",
        "In a small bowl, combine the mustard, vinegar, lemon, garlic, and sugar. Gradually whisk in the oil and blend until emulsified. Taste and add 1/2 teaspoon warm water if necessary to balance flavors. Stir in the tarragon.",
        "Once galette has cooled, brush the vegetables with the mustard vinaigrette. Sprinkle with chopped tarragon, cut into squares, and serve warm or at room temperature.",
        "DO AHEAD: Dough can be made and refrigerated up to 3 days in advance, or frozen for up to 3 months; thaw in the refrigerator before using. Tart can be assembled and frozen for up to 3 months. Tarragon vinaigrette can be made up to 1 day in advance and refrigerated."
    ],
    "ingredients": [
        "2 1/2 cups unbleached all-purpose flour",
        "1 teaspoon kosher alt",
        "2 teaspoons granulated sugar",
        "1 cup (2 sticks) cold unsalted butter, cut in pieces",
        "3 tablespoons vodka, chilled",
        "1 1/2 tablespoons extra-virgin olive oil, plus more for brushing",
        "1 1/2 tablespoons butter",
        "1 large leek, white and light-green parts only, halved lengthwise and cut into 1/4-inch thick slices",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon granulated sugar",
        "Freshly ground black pepper",
        "4 ounces bar cream cheese, softened",
        "6 ounces farmer cheese, drained",
        "1 tablespoon chopped tarragon",
        "1 large egg, plus additional egg for egg wash",
        "2 pounds medium-sized root vegetables, such as parsnips, carrots, beets, turnips, celery root, purple potatoes, and/or Yukon gold potatoes, peeled and cut in 1/4-inch rounds",
        "Coarse sea salt",
        "1 teaspoon Dijon mustard",
        "1 tablespoon champagne or white-wine vinegar",
        "1 1/2 teaspoons lemon juice",
        "1 small garlic clove, smashed to a paste with 1/4 teaspoon salt",
        "1/4 teaspoon sugar",
        "1 1/2 tablespoons grapeseed or other neutral vegetable oil",
        "1 1/2 teaspoons roughly chopped tarragon, plus more for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Appetizer",
        "Christmas",
        "Root Vegetable",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Root Vegetable and Farmers Cheese Galette",
    "url": "http://www.epicurious.com/recipes/food/views/root-vegetable-and-farmers-cheese-galette-51259700"
}
