{
    "directions": [
        "Lasagna: Preheat oven to 325°F. Place a double layer of butternut squash in the bottom of a 12\" baking pan that's been greased with butter and sprinkled with salt and pepper. Season squash with salt and pepper to taste and top with 2 tbsp shallots, garlic, and thyme. Layer remaining vegetables individually, seasoning each layer with shallots, garlic, thyme, salt, and pepper. Dot top with butter, sprinkle with salt and freshly ground pepper to taste. Bake 1 1/2 to 2 hours or until you can easily pierce vegetables with a knife. Remove from oven and let rest at least 15 minutes before serving.",
        "Broth: In a medium pot, combine mushrooms, vinegar, soy sauce, and 5 cups water and bring to a boil, stirring constantly. Lower heat and simmer 30 minutes. Strain broth through a fine-mesh strainer into a bowl. Melt butter in a saucepan and whisk into broth. Salt and pepper to taste, whisk again and pour over lasagna."
    ],
    "ingredients": [
        "1 1/2 lb butternut squash, thinly sliced",
        "1 1/2 lb carrots, thinly sliced",
        "1 lb parsnips, thinly sliced",
        "1 lb potatoes, thinly sliced",
        "1 lb rutabagas (may substitute turnips), thinly sliced",
        "1 cup sliced shallots",
        "1/2 cup sliced garlic",
        "3 tbsp fresh thyme, chopped",
        "2 tbsp butter, cut in small pieces",
        "3 lb white button mushrooms, thinly sliced and sautéed in 1 tbsp butter and 3 oz honey until lightly colored",
        "4 oz sherry vinegar",
        "3 oz soy sauce",
        "3 tbsp cold butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Mushroom",
        "Onion",
        "Vegetable",
        "Bake",
        "Christmas",
        "Low Fat",
        "Carrot",
        "Parsnip",
        "Butternut Squash",
        "Winter",
        "Rutabaga",
        "Christmas Eve",
        "Self"
    ],
    "title": "Root Vegetable \"Lasagna\" with Mushroom Broth",
    "url": "http://www.epicurious.com/recipes/food/views/root-vegetable-lasagna-with-mushroom-broth-230238"
}
