{
    "directions": [
        "Melt 2 tablespoons butter in heavy large pot over medium-high heat. Add onion and sauté until deep golden, about 7 minutes. Add next 7 in-gredients and stir 1 minute. Add broth and 1 cup water; bring to boil. Reduce heat, cover and simmer until vegetables are almost tender, about 10 minutes. Stir in cream, shiitake mushrooms, peas and chives. Season to taste with salt. Bring mixture to simmer. Mix remaining 1 tablespoon butter and flour in small bowl to blend. Stir into vegetable mixture; simmer until mixture thickens slightly, about 5 minutes. Divide vegetable mixture among six 2-cup soufflé or baking dishes; set aside. (Can be prepared 1 1/2 hours ahead. Let stand at room temperature.)",
        "Preheat oven to 425°F. Sift flour, baking powder and salt into bowl. Stir in chives. Add butter; rub in with fingertips until mixture re-sembles coarse meal. Add eggs and milk and stir until soft moist dough forms.",
        "Turn dough out onto generously floured surface. Knead gently just to combine. Divide dough into 6 equal pieces; pat out each piece to 31/2-inch round. Place 1 dough round atop vegetable filling in each dish (some filling will show around edges). Place dishes on large baking sheet. Bake until topping is golden and vegetable mixture is heated through, about 18 minutes. Let stand 5 minutes. Serve hot."
    ],
    "ingredients": [
        "3 tablespoons butter",
        "1 large onion, chopped",
        "1 1/2 pounds white-skinned potatoes, peeled, cut into 1/2-inch pieces (about 3 2/3 cups)",
        "1 8- to 9-ounce turnip, peeled, cut into 1/2-inch pieces",
        "1 large carrot, peeled, cut into 1/2-inch pieces",
        "1 1/2-ounce package dried porcini mushrooms*",
        "1 1/2 teaspoons dried thyme",
        "3/4 teaspoon ground cumin",
        "1/2 teaspoon ground black pepper",
        "1 14 1/2-ounce can vegetable broth",
        "1 cup water",
        "1 cup whipping cream",
        "8 ounces fresh shiitake mushrooms, stemmed, caps diced",
        "1 cup frozen peas",
        "1/4 cup chopped fresh chives",
        "1 tablespoon all purpose flour",
        "2 cups all purpose flour",
        "1 tablespoon baking powder",
        "1 teaspoon salt",
        "1/4 cup chopped fresh chives",
        "6 tablespoons chilled unsalted butter, cut into 1/2-inch pieces",
        "2 large eggs",
        "1/2 cup whole milk",
        "*Dried porcinis are available at Italian markets and many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Mushroom",
        "Potato",
        "Vegetable",
        "Side",
        "Bake",
        "Vegetarian",
        "Lunch",
        "Casserole/Gratin",
        "Pea",
        "Root Vegetable",
        "Turnip",
        "Winter",
        "Chive",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Root Vegetable Cobbler with Chive Biscuit Topping",
    "url": "http://www.epicurious.com/recipes/food/views/root-vegetable-cobbler-with-chive-biscuit-topping-104335"
}
