{
    "directions": [
        "With a sharp knife peel rutabaga and cut into 1/8-inch-thick wedges. In a large saucepan of boiling salted water cook rutabaga until crisp-tender, 6 to 8 minutes, and transfer with a slotted spoon to a colander. Drain rutabaga and pat dry between paper towels.",
        "Peel turnips and cut into 1/8-inch-thick wedges. Cook turnips in boiling salted water until crisp-tender, 3 to 4 minutes, and transfer with slotted spoon to colander. Drain turnips and pat dry between paper towels.",
        "Peel parsnips and cut diagonally into 1/8-inch-thick slices. Cook parsnips in boiling salted water until crisp-tender, 3 to 4 minutes, and transfer with slotted spoon to colander. Drain parsnips and pat dry between paper towels.",
        "In a bowl toss together vegetables. Vegetables may be cooked 1 day ahead and chilled, covered.",
        "Preheat oven to 350° F. and butter a 2-quart gratin dish, about 12 by 9 by 2 inches.",
        "In gratin dish arrange one third vegetables and sprinkle with 1 tablespoon flour, 1/4 cup Gruyère, and salt and pepper to taste. Top cheese with half of remaining vegetables, remaining tablespoon flour, 1/4 cup cheese, and salt and pepper to taste. Arrange remaining vegetables over cheese and pour cream and milk over vegetables.",
        "Sprinkle remaining 3/4 cup cheese over vegetables and bake in middle of oven, covered, 30 minutes. Uncover gratin and bake until bubbling and golden, about 40 minutes more."
    ],
    "ingredients": [
        "1 1/2 pounds rutabaga (about 1 small)",
        "1 pound white turnips (about 5 medium)",
        "3/4 pound parsnips (about 5 medium)",
        "2 tablespoons all-purpose flour",
        "1 1/4 cups grated Gruyère (about 5 ounces)",
        "1 cup heavy cream",
        "1 cup milk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Side",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Parsnip",
        "Turnip",
        "Fall",
        "Rutabaga",
        "Boil",
        "Gourmet"
    ],
    "title": "Root Vegetable Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/root-vegetable-gratin-13424"
}
