{
    "directions": [
        "Bring 6 cups water and bouillon base to boil in large pot over medium-high heat, stirring to dissolve bouillon. Add carrots and next 5 ingredients. Simmer until vegetables are tender, about 7 minutes. Drain; reserve vegetables and broth.",
        "Melt butter in same pot over medium heat. Add onions; sauté until beginning to brown, about 10 minutes. Mix in garlic and rosemary; stir 2 minutes. Add flour; stir 1 minute. Gradually whisk in reserved broth, then cream and Sherry. Cook until sauce is thick and reduced to 4 cups, whisking often, about 8 minutes. Mix in reserved vegetables and parsley. Season with salt and pepper. Transfer filling to buttered 13x9x2-inch baking dish. DO AHEAD: Can be made 2 days ahead. Cover with foil; chill.",
        "Preheat oven to 400°F. Bake filling, covered, until bubbling, about 50 minutes. Meanwhile, prepare biscuits.",
        "Stir first 4 ingredients in large bowl to blend. Add butter. Using fingertips, rub in butter until mixture resembles coarse meal. Gradually add 1 1/3 cups buttermilk, tossing with fork until dough is evenly moistened and adding more buttermilk by tablespoonfuls if dry.",
        "Drop biscuit dough atop hot filling by heaping tablespoonfuls; sprinkle with pepper. Bake uncovered until tester inserted into center of biscuits comes out clean, about 45 minutes. Cool 15 minutes.",
        "Available in the produce section of many supermarkets and at specialty foods stores and Italian markets."
    ],
    "ingredients": [
        "6 cups water",
        "2 tablespoons vegetarian bouillon base",
        "2 very large carrots, peeled, quartered lengthwise, cut crosswise into 1/2-inch pieces",
        "1 large celery root (celeriac), peeled, cut into 1/2-inch pieces",
        "2 large parsnips, peeled, quartered lengthwise, cut crosswise into 1/2-inch pieces",
        "1 large rutabaga, peeled, cut into 1/2-inch cubes",
        "1 turnip, peeled, cut into 1/2-inch cubes",
        "1 ounce dried porcini mushrooms,* broken into 1/2-inch pieces, rinsed",
        "3 tablespoons butter",
        "3 cups chopped onions",
        "4 large garlic cloves, chopped",
        "1/2 teaspoon minced fresh rosemary",
        "1/2 cup all purpose flour",
        "1/4 cup heavy whipping cream",
        "2 tablespoons imported dry Sherry",
        "1/4 cup chopped fresh Italian parsley",
        "2 1/4 cups unbleached all purpose flour",
        "1 tablespoon baking powder",
        "2 teaspoons minced fresh rosemary",
        "1 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, diced",
        "1 1/3 cups (or more) chilled buttermilk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Rosemary",
        "Parsnip",
        "Turnip",
        "Winter",
        "Family Reunion",
        "Rutabaga",
        "Christmas Eve",
        "Potluck"
    ],
    "title": "Root Vegetable and Mushroom Pie with Rosemary Biscuit Topping",
    "url": "http://www.epicurious.com/recipes/food/views/root-vegetable-and-mushroom-pie-with-rosemary-biscuit-topping-351510"
}
