{
    "directions": [
        "Heat 1 Tbsp. oil in a large pot over medium-high and cook bacon, stirring occasionally, until brown and crisp, 5–7 minutes. Transfer bacon to paper towels and let drain.",
        "Pour off all but 2 Tbsp. fat in pot and reduce heat to medium. Add onion and cook, stirring occasionally, until browned around the edges and softened, 8–10 minutes. Add garlic and cook, stirring constantly, until garlic is very fragrant, about 1 minute. Return bacon to pot and add oregano sprigs, thyme sprigs, bay leaf, and broth. Bring soup to a simmer and cook 15 minutes to allow flavors to come together.",
        "Taste soup and season with salt and pepper; add carrot, parsnip, turnip, and brussels sprouts and cook 3 minutes (vegetables should be very al dente). Remove from heat. Discard oregano and thyme sprigs and bay leaves. Let soup sit 5 minutes (vegetables will soften a little more).",
        "Meanwhile, combine anchovies (if using), basil, lemon zest, and remaining 4 Tbsp. oil in a small bowl; season basil oil with salt and pepper.",
        "Divide soup among bowls; drizzle with basil oil.",
        "Soup can be made 3 days ahead. Let cool; cover and chill."
    ],
    "ingredients": [
        "5 tablespoons olive oil, divided",
        "4 ounces hardwood-smoked bacon, cut into 1/4-inch pieces",
        "1 large red onion, halved through root end, thinly sliced",
        "3 garlic cloves, finely grated",
        "2 sprigs oregano",
        "2 sprigs thyme",
        "1 bay leaf",
        "3 quarts low-sodium chicken broth",
        "Kosher salt, freshly ground pepper",
        "1 very large carrot, peeled, spiralized using a medium blade or cut into matchsticks",
        "1 large parsnip, peeled, spiralized using a medium blade or cut into matchsticks",
        "1 medium turnip, peeled, spiralized using a medium blade or cut into matchsticks",
        "8 ounces brussels sprouts, trimmed, thinly sliced",
        "2 oil-packed anchovy fillets, finely chopped (optional)",
        "1/2 cup finely chopped basil",
        "1 teaspoon finely grated lemon zest"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Vegetable",
        "Root Vegetable",
        "Mushroom",
        "Carrot",
        "Parsnip",
        "Dinner",
        "Bacon",
        "Brussel Sprout",
        "Turnip"
    ],
    "title": "Root Vegetable Zoodle Soup With Bacon and Basil Oil",
    "url": "http://www.epicurious.com/recipes/food/views/root-vegetable-zoodle-soup-with-bacon-and-basil-oil"
}
