{
    "directions": [
        "Quarter tomatoes lengthwise, discarding seeds, and drain, cut sides down, on paper towels for about 15 minutes. Cut tomatoes into 1/4-inch dice.",
        "In a small heatproof bowl sprinkle gelatin over Sherry to soften 1 minute.",
        "In a small saucepan bring consommé just to a boil and remove pan from heat. Stir hot consommé into gelatin mixture, continuing to stir until mixture is dissolved completely, and let cool.",
        "Rinse a 4-cup ring mold with cold water and drain but do not dry. Pour 2 tablespoons consommé mixture into mold and chill 10 minutes, or until set. Sprinkle aspic layer with 2 tablespoons each tomatoes and chives and spoon about 2 tablespoons consommé mixture over to just cover. Chill aspic 10 minutes, or until set.",
        "In a bowl with an electric mixer beat cream cheese just until light and fold in Roquefort and remaining tomatoes and chives. Gently stir in remaining consommé mixture until incorporated and ladle over aspic. Chill mousse, covered, 3 hours, or until set. Dip bottom of mold into a sink of warm water 10 seconds and run a thin knife around edge of mold. Invert a serving plate over mold and invert mold onto it.",
        "Serve mousse with toasts or crackers."
    ],
    "ingredients": [
        "4 plum tomatoes",
        "1 envelope unflavored gelatin (about 1 tablespoon)",
        "1/4 cup medium-dry Sherry",
        "a 10 1/2-ounce can beef consommé (not beef broth)",
        "3/4 cup finely chopped fresh chives (about 1 large bunch)",
        "8 ounces cream cheese, softened",
        "4 ounces Roquefort, crumbled (about 1/2 cup)",
        "Accompaniment: toasts or crackers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Tomato",
        "Appetizer",
        "Blue Cheese",
        "Cream Cheese",
        "Sherry",
        "Summer",
        "Chill",
        "Chive",
        "Boil",
        "Gourmet"
    ],
    "title": "Roquefort Aspic Mousse with Tomatoes and Chives",
    "url": "http://www.epicurious.com/recipes/food/views/roquefort-aspic-mousse-with-tomatoes-and-chives-14191"
}
