{
    "directions": [
        "Rinse turkey inside and out and pat dry. In 8-gallon bucket or plastic tub lined with large, heavy-duty garbage bag, combine 5 gallons ice water, salt, and Creole seasoning. Stir until salt dissolves. Add turkey and, if necessary, place large plate on top to submerge. Close bag tightly and refrigerate entire bucket at least 12 hours and up to 36 hours. (If bucket does not fit in refrigerator, use large cooler instead: Enclose ice or freezer packs in resealable plastic bags and add to brining liquid until probe thermometer inserted into liquid registers 40°F or just below. Check every few hours and add additional ice or freezer packs if necessary to keep liquid at or just below 40°F.)",
        "Remove turkey from brine and place, breast side up, on wire rack set over paper towel-lined rimmed baking sheet. Allow to drain completely. Pat dry.",
        "Set rack at lowest position in oven preheated to 450°F.",
        "Place turkey on rack in large roasting pan. Using pastry brush, brush turkey, inside and out, with melted butter, then sprinkle with salt and pepper. Loosely fill body cavity with cubed butter, onions, garlic, celery, and herbs. Tie legs together loosely with kitchen string and tuck wings under body.",
        "Place turkey in oven and roast until light golden brown, about 40 minutes. Reduce oven temperature to 350°F and roast, basting with drippings every 30 minutes, until instant-read thermometer inserted into thickest part of thigh (do not touch bone) registers 170°F. If skin starts to brown too much, tent breast with foil.",
        "Transfer turkey to platter and discard string; let stand 30 minutes before carving. Serve with Turkey Gravy ."
    ],
    "ingredients": [
        "3 3/4 cups (2 pounds) kosher salt",
        "1 cup (8 ounces) Creole seasoning, such as Tony Chachere's Original or Konriko",
        "1 16- to 18-pound turkey, quills removed if necessary and neck, giblets, and liver removed (reserve for another use)",
        "1/2 cup (1 stick) unsalted butter, melted, plus 1 cup (2 sticks), cut into 1-inch cubes",
        "2 tablespoons kosher salt",
        "2 tablespoons coarsely cracked black pepper",
        "1 medium white onion, roughly chopped (about 1 1/2 cups)",
        "1 head garlic, cloves separated, peeled, and smashed with back of knife",
        "1 stalk celery, roughly chopped (about 3/4 cup)",
        "1/2 cup fresh sage leaves, roughly torn (about 1 ounce)",
        "1/2 bunch fresh thyme (about 45 sprigs or 1 ounce)",
        "1/2 bunch fresh parsley (about 1/2 cup)",
        "1/2 bunch fresh rosemary, roughly chopped (about 20 sprigs)",
        "Turkey Gravy"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Rosemary",
        "Fall",
        "Winter",
        "Brine"
    ],
    "title": "Rosemary-Roasted Turkey with Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-roasted-turkey-with-gravy-236464"
}
