{
    "directions": [
        "Heat oven to 500°F with rack in middle.",
        "Make a deep cut into the top side of tenderloin, about 4 inches from tail end, to facilitate folding the tail end under the roast to give the meat a more uniform thickness. Tie roast at 1-inch intervals with kitchen string.",
        "Cook pancetta in a large rimmed baking sheet in oven, stirring once, until fat is rendered and pancetta is crisp, 4 to 8 minutes. Transfer pancetta with a slotted spoon to a bowl.",
        "Add tomatoes and 1/4 teaspoon each salt and pepper to fat in rimmed baking sheet and stir, then roast in oven 15 minutes.",
        "Stir in garlic and olives and roast until tomatoes are falling apart and browned in patches, 2 to 4 minutes.",
        "Remove sheet from oven, then add pancetta and 1/2 cup water, scraping up brown bits.",
        "Lower oven temperature to 350°F.",
        "Toss together bread crumbs, 2 tablespoons oil, and 1/4 teaspoon each salt and pepper in a bowl.",
        "Stir together mustard and rosemary in a small bowl.",
        "Pat tenderloin dry and sprinkle all over with 1 1/4 teaspoons each salt and pepper, rubbing into meat.",
        "Set roasting pan over 2 burners, then add remaining 3 tablespoons oil and heat over medium-high heat until shimmering. Brown tenderloin on all sides, about 10 minutes.",
        "Spread top and upper part of sides with mustard mixture, then sprinkle evenly with bread crumbs. Pat lightly to adhere.",
        "Roast tenderloin until thermometer inserted diagonally 2 inches into center of thickest part of meat registers 120°F, 30 to 40 minutes. Transfer beef to a cutting board and let stand 15 minutes (internal temperature will rise to about 130°F for medium-rare).",
        "Set roasting pan over 2 burners and add remaining 1 cup water. Bring to a boil, scraping up brown bits, then stir in tomato mixture and parsley.",
        "Cut tenderloin into 1/2-inch-thick slices, discarding string, and serve with tomato mixture."
    ],
    "ingredients": [
        "1 (6- to 6 1/2-pound) whole beef tenderloin, trimmed of fat, silverskin, and the chain (see Cooks' Notes); or a 5- to 5 1/2-pound well-trimmed tenderloin roast",
        "4 ounces diced pancetta",
        "2 pounds grape tomatoes",
        "Salt",
        "Freshly ground black pepper",
        "6 large garlic cloves, finely chopped",
        "2/3 cup pitted kalamata olives, quartered lengthwise (3 ounces)",
        "1 1/2 cups water, divided",
        "1 1/4 cups panko (Japanese bread crumbs)",
        "5 tablespoons extra-virgin olive oil, divided",
        "5 tablespoons Dijon mustard",
        "2 tablespoons finely chopped fresh rosemary",
        "1/4 cup finely chopped flat-leaf parsley",
        "Special equpment: Kitchen string; large (18- by 13-inch) rimmed baking sheet; large heavy roasting pan; instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pork",
        "Tomato",
        "Roast",
        "Christmas",
        "Dinner",
        "Rosemary",
        "Meat",
        "Beef Tenderloin",
        "Winter",
        "Christmas Eve",
        "Breadcrumbs",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free"
    ],
    "title": "Rosemary-Crumb Beef Tenderloin with Pancetta-Roasted Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-crumb-beef-tenderloin-with-pancetta-roasted-tomatoes-387491"
}
