{
    "directions": [
        "Preheat oven to 300°F.",
        "Whisk together flour, salt, baking powder, and rosemary in a bowl.",
        "Mix together butter, honey, and confectioners sugar in a large bowl with an electric mixer at low speed, then add flour mixture and mix until dough resembles coarse meal with some small (roughly pea-size) butter lumps. Gather dough into a ball and transfer to a lightly floured surface. Knead dough until it just comes together, about 8 times. Halve dough and form each half into a 5-inch disk.",
        "Roll out 1 disk (keep remaining dough at room temperature) between 2 sheets of parchment into a 9-inch round (trim as necessary). Remove top sheet of parchment and transfer dough on bottom sheet of parchment to a baking sheet. Score dough into 8 wedges by pricking dotted lines with a fork, then mark edges decoratively. Arrange rosemary sprigs (if using) decoratively on top of dough, pressing lightly to help adhere, and sprinkle dough with 1/2 tablespoon granulated sugar.",
        "Bake shortbread in middle of oven until golden brown, 20 to 25 minutes. Slide shortbread on parchment to a rack and cool 5 minutes. Transfer with a metal spatula to a cutting board and cut along score marks with a large heavy knife.",
        "Make another shortbread with remaining dough."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "3/4 teaspoon salt",
        "1/2 teaspoon baking powder",
        "1 tablespoon chopped fresh rosemary",
        "1 1/2 sticks (3/4 cup) unsalted butter, softened",
        "2 tablespoons mild honey",
        "1/2 cup confectioners sugar",
        "1 tablespoon granulated sugar",
        "Garnish: small rosemary sprigs",
        "Special equipment: parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Herb",
        "Bake",
        "Christmas",
        "Rosemary",
        "Winter",
        "Honey",
        "Gourmet"
    ],
    "title": "Rosemary Shortbread",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-shortbread-107452"
}
