{
    "directions": [
        "In a medium saucepan over medium-high heat, sauté the onion and garlic in the oil until translucent, 3 to 4 minutes. Add 3 tablespoons salt after the onion and garlic have cooked for 30 seconds or so. Add the rosemary and cook to heat it, 30 seconds or so. Add the water and lemon, squeezing the juice from the wedges into the water and removing any seeds. Bring the water to a simmer, stirring to dissolve the salt. Remove from the heat and allow the brine to cool. Refrigerate until chilled.",
        "Place all the chicken pieces in a large, sturdy plastic bag. Set the bag in a large bowl for support. Pour the cooled brine and aromatics into the bag. Seal the bag so that you remove as much air as possible and the chicken is submerged in the brine. Refrigerate for 8 to 24 hours, agitating the bag occasionally to redistribute the brine and the chicken.",
        "Remove the chicken from the brine, rinse under cold water, pat dry, and set on a rack or on paper towels. The chicken can be refrigerated for up to 3 days before you cook it, or it can be cooked immediately. Ideally, it should be refrigerated, uncovered, for a day to dry out the skin, but usually I can't wait to start cooking it.",
        "Combine the flour, black pepper, paprika, sea salt, cayenne, and baking powder in a bowl. Whisk to distribute the ingredients. Divide this mixture between two bowls. Pour the buttermilk into a third bowl. Set a rack on a baking sheet/tray. Dredge the chicken in the flour, shake off the excess, and set the dusted pieces on the rack. Dip the pieces in the buttermilk, then dredge them aggressively in the second bowl of flour and return them to the rack.",
        "Heat oil in a pan for deep-frying to 350°F/180°C. Add as many chicken pieces as you can without crowding the pan. Cook the chicken, turning the pieces occasionally, until they are cooked through, 12 to 15 minutes depending on their size. Remove to a clean rack and allow them to rest for 5 to 10 minutes before serving."
    ],
    "ingredients": [
        "1 small onion, thinly sliced",
        "4 garlic cloves, smashed with the flat side of a knife",
        "1 teaspoon vegetable oil",
        "Kosher salt",
        "5 or 6 branches rosemary, each 4 to 5 inches/10 to 12 centimeters long",
        "4 1/2 cups/1 liter water",
        "1 lemon, quartered",
        "8 chicken legs, drumsticks and thighs separated",
        "8 chicken wings, wing tips removed",
        "3 cups/420 grams all-purpose/plain flour",
        "3 tablespoons freshly ground black pepper",
        "2 tablespoons paprika",
        "2 tablespoons fine sea salt",
        "2 teaspoons cayenne pepper",
        "2 tablespoons baking powder",
        "2 cups/480 milliliters buttermilk",
        "Oil for deep-frying"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Herb",
        "Poultry",
        "Fry",
        "Picnic",
        "Kid-Friendly",
        "Rosemary",
        "Family Reunion",
        "Buttermilk"
    ],
    "title": "Rosemary-Brined, Buttermilk Fried Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-brined-buttermilk-fried-chicken-368790"
}
