{
    "directions": [
        "Preheat oven to 350°F.",
        "Cut off and discard pith from zested lemon and cut off and discard zest and pith from other lemon. In a saucepan of boiling water blanch zest 1 minute and drain in a colander. Cut each lemon crosswise into 6 slices.",
        "In a small food processor blend rosemary, garlic, zest, 1 tablespoon oil, lemon juice, and salt until mixture is chopped fine.",
        "With tip of a small sharp knife cut small slits all over lamb and rub rosemary mixture over lamb, rubbing into slits. Arrange lemon slices in middle of a large roasting pan and arrange lamb on them. Roast lamb in middle of oven 45 minutes.",
        "Quarter potatoes and in a saucepan cover with salted cold water by 1 inch. Bring water to a boil and cook potatoes, covered, 5 minutes. Drain potatoes in colander and in a bowl toss with remaining tablespoon oil. Arrange potatoes around lamb and sprinkle with salt and pepper to taste.",
        "Roast lamb and potatoes, stirring potatoes occasionally, 55 minutes, or until a meat thermometer registers 140°F. for medium-rare. Transfer lamb to a cutting board and let stand 15 minutes. Increase temperature to 500°F. and roast potatoes and lemons in one layer 5 to 10 minutes more, or until golden. Transfer potatoes and lemons with a slotted spoon to bowl and toss with chives. Transfer potato mixture to a platter.",
        "Serve lamb, sliced thin across grain, with potatoes, garnished with rosemary and lemon wedges."
    ],
    "ingredients": [
        "2 large lemons, zest of 1 removed in strips with a vegetable peeler",
        "1/4 cup fresh rosemary leaves",
        "3 large garlic cloves",
        "2 tablespoons olive oil",
        "2 teaspoons fresh lemon juice",
        "1/2 teaspoon salt",
        "a 7-pound leg of lamb (ask butcher to remove pelvic bone and tie lamb  for easier carving)",
        "2 1/2 pounds small red potatoes",
        "3 tablespoons minced fresh chives",
        "Garnish: fresh rosemary sprigs and lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Herb",
        "Lamb",
        "Potato",
        "Roast",
        "Easter",
        "Lemon",
        "Rosemary",
        "Spring",
        "Gourmet"
    ],
    "title": "Rosemary, Lemon, and Garlic Leg of Lamb with Roasted Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-lemon-and-garlic-leg-of-lamb-with-roasted-potatoes-11998"
}
