{
    "directions": [
        "Simmer syrup ingredients in a 1- to 1 1/2-quart nonreactive saucepan (see cooks' note, below) over moderate heat until just syrupy and reduced to about 1/4 cup, about 8 minutes. Pour through a sieve into a small bowl, discarding rosemary and peppercorns.",
        "Cut stems and center ribs from chard, discarding any tough portions, then cut stems and ribs crosswise into 1/4-inch-thick slices. Stack chard leaves and roll into cylinders. Cut cylinders crosswise to make 1-inch-wide strips.",
        "Cook onion and garlic in oil in a 12-inch nonstick skillet over moderate heat, stirring occasionally, until onion begins to soften, about 4 minutes. Add chard stems and ribs, salt, and pepper and cook, stirring occasionally, until stems are just tender, about 6 minutes. Stir in chard leaves and water and cook, stirring occasionally, until tender, about 8 minutes.",
        "Preheat broiler. Sprinkle chops with garlic, salt, rosemary, and pepper, then broil on a lightly oiled broiler pan, 4 to 5 inches from heat, turning over once, for medium-rare, 6 to 7 minutes total. Serve chops and chard drizzled with balsamic syrup."
    ],
    "ingredients": [
        "3/4 cup balsamic vinegar",
        "1/4 teaspoon minced fresh rosemary",
        "1/8 teaspoon black peppercorns",
        "1 bunch Swiss chard (1 lb)",
        "1/4 cup chopped red onion",
        "1 teaspoon finely chopped garlic",
        "1 tablespoon olive oil",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 tablespoon water",
        "8 rib lamb chops (1 1/4 lb total), trimmed of all fat",
        "1 teaspoon finely chopped garlic",
        "1/2 teaspoon salt",
        "1/2 teaspoon finely chopped fresh rosemary",
        "1/4 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Broil",
        "Sauté",
        "Quick & Easy",
        "Rosemary",
        "Lamb Chop",
        "Chard",
        "Gourmet"
    ],
    "title": "Rosemary Lamb Chops with Swiss Chard and Balsamic Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-lamb-chops-with-swiss-chard-and-balsamic-syrup-232611"
}
