{
    "directions": [
        "Preheat an oven to 350ºF. Line a 12-cup muffin pan with paper liners.",
        "Sift the flour and 1 pinch of salt into a small bowl. Set aside.",
        "In the bowl of a stand mixer fitted with the flat beater, beat together 12 Tbs. (1 1/2 sticks) of the butter and the granulated sugar on medium-high speed until light and fluffy, scraping down the sides of the bowl as needed. Add the 4 1/2 tsp. rose water and 1 1/2 tsp. of the vanilla. Reduce the speed to medium and add the eggs one at a time, scraping down the sides of the bowl and making sure each egg is fully incorporated before adding the next one. Reduce the speed to low, gradually add the flour mixture and beat until just incorporated.",
        "Divide the batter evenly among the prepared muffin cups. Bake until the cupcakes are golden and a toothpick inserted in the center of a cupcake comes out clean, 15 to 20 minutes. Transfer the pan to a wire rack and let the cupcakes cool completely.",
        "Meanwhile, make the buttercream: In the bowl of the stand mixer fitted with the flat beater, beat together the remaining 8 Tbs. (1 stick) butter, the 3 cups confectioners' sugar and 1 pinch of salt until smooth. Mix in the 1 Tbs. rose water, the remaining 1 tsp. vanilla and a few drops of food coloring. Place the buttercream in a pastry bag fitted with a star tip.",
        "Using a small paring knife, cut a cone-shaped piece from the top of each cupcake. Each cone should be about 1 1/2 inches in diameter and about 1 inch long. Cut each cone in half lengthwise. These 2 pieces will be the wings for each cupcake. Pipe buttercream into the center and over the top of each cupcake. Insert the wings in the center, poking the tips into the frosting and turning the flat side of each piece outward. Sprinkle the cupcakes with pistachios, dust with confectioners' sugar and serve. Makes 12 cupcakes.",
        "Adapted from Williams-Sonoma",
        "Cooking for Friends,",
        "by Alison Attenborough and Jamie Kimm (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "1 1/2 cups self-rising flour",
        "2 pinches of salt",
        "20 Tbs. (2 1/2 sticks) unsalted butter, at room temperature",
        "3/4 cup granulated sugar",
        "4 1/2 tsp. plus 1 Tbs. rose water",
        "2 1/2 tsp. vanilla extract",
        "3 eggs, lightly beaten",
        "3 cups confectioners' sugar, sifted, plus more for dusting (optional)",
        "3 drops pink food coloring",
        "2 Tbs. finely chopped pistachio nuts"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Rose and Vanilla Cupcakes",
    "url": "http://www.williams-sonoma.com/recipe/rose-and-vanilla-cupcakes.html"
}
