{
    "directions": [
        "Preheat oven to 425°F. Rub lamb with garlic, rosemary, pepper, and 1/2 tsp. salt.",
        "Combine miso, paprika, 4 Tbsp. butter, and 1/2 tsp. salt in a small bowl; set aside.",
        "Peel potatoes. Working with one potato at a time, slice a thin sliver off one long side to make a flat bottom. Trim ends off, then slice vertically every 1/16\", cutting down to 1/4\" from the bottom. (To make sure you do not cut all the way through the potato, line it with chopsticks on each side to stop your knife.) Brush potatoes with miso butter, fanning slices open to get butter between each slice. Transfer to a rimmed baking sheet and roast 15 minutes.",
        "Remove baking sheet from oven and brush potatoes with more miso butter. Arrange lamb on baking sheet alongside potatoes and roast, brushing potatoes with miso butter halfway through, until an instant-read thermometer inserted into the thickest part of the lamb registers 125°F for medium-rare, and the potatoes are fork-tender, 20–25 minutes. Transfer lamb to a cutting board and let rest 10 minutes, and continue roasting the potatoes if needed until fork-tender.",
        "Meanwhile, mix honey, coriander, and remaining 1 Tbsp. butter and 1/4 tsp. salt in a small bowl, then brush over carrots. Arrange carrots on a baking sheet and roast until lightly browned and fork-tender, 15–20 minutes.",
        "Slice lamb between each rib. Brush potatoes with remaining miso butter, top carrots with parsley, and serve alongside lamb."
    ],
    "ingredients": [
        "1 (1–1 1/2-pound) rack of lamb, fat cap scored",
        "1 garlic clove, finely chopped",
        "2 teaspoons chopped rosemary",
        "1/8 teaspoon freshly ground black pepper",
        "1 1/4 teaspoons kosher salt, divided",
        "1 tablespoon white miso paste",
        "1/4 teaspoon smoked paprika",
        "5 tablespoons unsalted butter, softened, divided",
        "2 medium yukon gold potatoes (about 1 pound)",
        "1 teaspoon honey",
        "1/4 teaspoon ground coriander",
        "1/2 pound medium carrots, peeled",
        "1 tablespoon finely chopped parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Valentine's Day",
        "Lamb",
        "Dinner",
        "Carrot",
        "Potato",
        "Winter",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Rosemary Rack of Lamb With Roasted Potatoes and Carrots for Two",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-rack-of-lamb-with-roasted-potatoes-and-carrots-for-two"
}
