{
    "directions": [
        "Sprinkle the yeast over the warm water. Let stand for a few minutes.",
        "In a mixer, combine the flour and salt. With the mixer running on low speed (with the paddle attachment), drizzle in the olive oil until combined with the flour. Next, pour in yeast/water mixture and mix until just combined and the dough comes together in a very sticky mass.",
        "Form the dough into a ball, drizzle over olive oil and toss to coat the dough. Then cover the bowl tightly with plastic wrap and set it aside for 1 to 2 hours, or store in the fridge until you need it.",
        "To make focaccia, remove half the dough from the bowl (leave the rest for another time) and place on a lightly floured surface. Place the chopped rosemary on top of the dough, then very gently knead it into the dough. (Don't over knead!) Roll into a large, thin oval. Place on a sheet pan drizzled with olive oil. Drizzle more olive oil on top of the dough, then cover with plastic wrap. Put in a draft-free/warm place for 1 hour.",
        "Preheat the oven to 400 degrees F.",
        "Remove the plastic wrap (the dough will be puffy) and use your fingertips to press dimples all over the surface of the dough. Drizzle the surface with more olive oil and sprinkle with kosher salt. Bake until the focaccia is golden brown, 30 to 40 minutes.",
        "Cut into pieces with a pizza wheel or sharp knife. Serve immediately."
    ],
    "ingredients": [
        "1 1/2 teaspoons active dry yeast",
        "1 1/2 cups warm water (not lukewarm)",
        "4 cups all-purpose flour, plus more for dusting",
        "1 teaspoon kosher salt, plus more for sprinkling",
        "1/3 cup olive oil, plus more for drizzling",
        "1 sprig fresh rosemary, chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Focaccia Recipes"
    ],
    "title": "Rosemary Focaccia",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/rosemary-focaccia-recipe"
}
