{
    "directions": [
        "Adjust oven rack to upper-middle position and heat oven to 250 degrees. Heat oil in a small skillet over medium-low heat. Add whole garlic cloves and cook, stirring occasionally, until soft and golden, about 5 minutes. Remove with a slotted spoon; reserve oil.",
        "Turn pork loin fat-side down. Slit lengthwise, almost but not quite all the way through, to form a long pocket, leaving a 1/2-inch border of unslit meat at each end. Brush cavity with some of the reserved garlic cooking oil, and sprinkle generously with salt and pepper and 1 Tb. of the rosemary. Line cavity with sauteed garlic and apricots; sprinkle in cranberries. Tie loin together with kitchen twine or heavy-duty string at 1 1/2-inch intervals.",
        "Brush with remaining oil, and sprinkle generously with salt and pepper. Set roast, fat-side up, diagonally or curved (so it fits) on a large, lipped cookie sheet or jellyroll pan. Warm 1/4 cup apple jelly along with the minced garlic and remaining rosemary. Brush mixture onto meat.",
        "Roast until a meat thermometer stuck into the center registers 125 to 130 degrees. (Start checking at about 1 1/2 hours.) Remove from oven; raise oven temperature to 400 degrees. Brush loin with pan drippings, return to oven, and continue to roast until the loin is golden brown and a meat thermometer stuck into the center registers 145 degrees F (63 degrees C), about 20 minutes longer. For even more attractive coloring, broil until spotty brown, 3 to 5 minutes.",
        "Let roast rest 15 to 20 minutes; transfer to a carving board. Stir juices around pan to loosen brown bits. Pour through a strainer into a small pan, and stir in port, chicken broth and remaining 2 Tbs. of jelly; bring to a simmer. Mix cornstarch with a couple of tablespoons of cold water; whisk into sauce. Simmer until lightly thickened. Slice pork and serve with a little sauce."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "16 whole peeled garlic cloves",
        "2 tablespoons minced garlic cloves",
        "1 (8 pound) whole boneless pork loin, patted dry, at room temperature",
        "Salt and freshly ground pepper",
        "3 tablespoons minced fresh rosemary (snip with scissors), divided",
        "16 dried apricots (or similar amount of your favorite dried fruit)",
        "1/3 cup dried cranberries",
        "Heavy kitchen string or twine",
        "1/4 cup apple jelly",
        "1/4 cup port",
        "1/2 cup chicken broth",
        "2 tablespoons apple jelly",
        "2 teaspoons cornstarch"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rosemary-Scented Pork Loin Stuffed With Roasted Garlic, Dried Apricots and Cranberries and Port Wine Pan Sauce",
    "url": "http://allrecipes.com/recipe/77008/rosemary-scented-pork-loin-stuffed-wi/"
}
