{
    "directions": [
        "In a small bowl, whisk together the flour, cornmeal, and salt.",
        "In a stand mixer fitted with the paddle attachment (or in a bowl by hand), beat together the butter and sugar on medium speed just until smooth. Mix in the egg yolks, then the rosemary. Add the flour mixture and mix until the dough is smooth and holds together.",
        "On a lightly floured work surface, divide the dough in half. Shape each half into a log about 6 inches (15 cm) long and 1 3/4 inches (4 cm) in diameter. Wrap the logs in plastic wrap and refrigerate until chilled and firm, at least 1 hour.",
        "Position racks in the upper and lower thirds of the oven; preheat the oven to 350°F (175°C). Line 2 baking sheets with parchment paper or silicone baking mats.",
        "Slice the logs into disks 1/4 inch (6 mm) inch thick and place the disks about 1/2 inch (1.5 cm) apart on the prepared baking sheets.",
        "Bake, rotating the baking sheets midway through baking, until the edges of the cookies are lightly browned, about 12 minutes. Let cool completely.",
        "Spread a scant 1 1/2 teaspoons of the jam on the underside of half of the cookies. Top the jam with a second cookie, bottom side down, to make sandwiches.",
        "The dough can be frozen for up to 1 month. Once filled, the cookies can be stored in an airtight container for up to 3 days."
    ],
    "ingredients": [
        "2 cups (280 g) all-purpose flour",
        "1/4 cup (40 g) stone-ground yellow cornmeal or polenta",
        "1/2 teaspoon salt",
        "1 cup (8 ounces/225 g) unsalted butter, at room temperature",
        "10 tablespoons (135 g) sugar",
        "2 large egg yolks",
        "1 1/2 tablespoons finely chopped fresh rosemary leaves",
        "Tomato Jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Herb",
        "Dessert",
        "Bake",
        "Picnic",
        "Vegetarian",
        "Rosemary",
        "Summer",
        "Party",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rosemary Cookies with Tomato Jam",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-cookies-with-tomato-jam-358790"
}
