{
    "directions": [
        "For the cookies: Preheat the oven to 350 degrees F. Line a 9-by-13-inch baking pan with foil, leaving a 2-inch overhang on two sides. Lightly butter the foil and sides of the pan.",
        "Pulse the sugar with the lemon zest and rosemary in a food processor until well combined. Remove 2 tablespoons of the sugar mixture and reserve.",
        "Add the butter, salt and vanilla to the food processor with the sugar and pulse until combined. Add the flour, about 1 cup at a time, pulsing to combine after each addition. (After the last addition, you may need to stir and scrape down the sides of the food processor to incorporate all of the flour.) Continue to pulse until a dough comes together.",
        "Turn the dough out onto the prepared baking pan and press it evenly into the pan. Poke the dough all over with a fork and sprinkle it with the reserved sugar.",
        "Bake until the edges are golden brown and the center is golden, about 25 minutes. As soon as it's out of the oven, use a bench scraper or knife to cut the shortbread into 1-by-3-inch cookies. Cool in the pan for 15 minutes, then carefully remove the cookies using the foil as handles. Cool completely on a rack.",
        "For the icing: Combine the confectioners' sugar, lemon zest and juice in a medium bowl. Whisk to combine. Whisk in 1 tablespoon water or more for the desired thickness.",
        "Drizzle the icing over the cookies and allow to set, or serve the icing alongside to dip or drizzle upon serving."
    ],
    "ingredients": [
        "3 sticks (1 1/2 cups) unsalted butter, softened, plus more for the pan",
        "1 cup sugar",
        "1 tablespoon finely grated lemon zest",
        "2 teaspoons finely chopped fresh rosemary",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon vanilla",
        "3 1/2 cups all-purpose flour",
        "1 1/2 cups confectioners' sugar",
        "1 lemon, zested and juiced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Shortbread Cookie",
        "Cookie",
        "Fruit",
        "Lemon Recipes",
        "Dessert"
    ],
    "title": "Rosemary-Lemon Shortbread Cookies",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/rosemary-lemon-shortbread-cookies"
}
