{
    "directions": [
        "Place rib roast, fat side up, in heavy roasting pan. Mix 4 teaspoons crushed rosemary, salt, and pepper in small bowl. Stir in 1/2 cup oil. Rub mixture all over roast. DO AHEAD Can be made 1 day ahead. Cover and chill. Let stand at room temperature 45 minutes before roasting.",
        "Combine 2 cups boiling water and porcini; let soak until mushrooms soften, about 20 minutes. Strain soaking liquid through fine strainer set over measuring cup; reserve porcini. If needed, add enough water to soaking liquid to measure 1 cup. Coarsely chop porcini.",
        "Melt 2 tablespoons butter with remaining 2 tablespoons oil in large skillet over medium-high heat. Add fresh mushrooms; sauté until browned, about 6 minutes. Add porcini and garlic; stir 1 minute. Remove from heat. Combine flour, remaining 2 tablespoons butter, and remaining 2 1/2 teaspoons crushed rosemary in small bowl; mash with fork to smooth paste. DO AHEAD Porcini soaking liquid, mushroom mixture, and flour-butter mixture can be made 1 day ahead. Cover separately; chill.",
        "Place rack in bottom third of oven and preheat to 350°F. Cook roast until instant-read thermometer inserted straight down into top center of roast registers 125°F to 130°F for medium-rare, about 2 hours 30 minutes.",
        "Transfer roast to platter; cover loosely with foil and let rest 35 to 40 minutes. Skim any fat from top of pan juices (there will be a small amount of pan drippings); reserve juices in pan.",
        "Set roasting pan atop 2 burners over medium-high heat. Add reserved 1 cup porcini soaking liquid, broth, and wine; bring to boil, scraping up any browned bits. Add mushroom mixture, then butter-flour mixture; whisk constantly over medium-high heat until sauce thickens, about 2 minutes. Season sauce to taste with salt and pepper.",
        "Garnish roast on platter with fresh rosemary sprigs. Slice roast and serve, passing mushroom sauce separately."
    ],
    "ingredients": [
        "1 well-trimmed 8- to 9-pound rib roast (with 4 bones)",
        "6 1/2 teaspoons crushed dried rosemary, divided",
        "1 tablespoon coarse kosher salt",
        "2 teaspoons freshly ground black pepper",
        "1/2 cup plus 2 tablespoons olive oil",
        "2 cups boiling water",
        "1 1/2 ounces dried porcini mushrooms",
        "4 tablespoons (1/2 stick) butter, room temperature, divided",
        "10 ounces fresh button mushrooms, cut into 1/4-inch-thick slices",
        "4 garlic cloves, minced",
        "2 tablespoons all purpose flour",
        "1 1/2 cups low-salt beef broth",
        "3/4 cup dry red wine",
        "2 bunches fresh rosemary (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Mushroom",
        "Roast",
        "Christmas",
        "New Year's Eve",
        "Rosemary",
        "Beef Rib",
        "Red Wine",
        "Winter"
    ],
    "title": "Rosemary-and-Pepper Standing Rib Roast with Two-Mushroom Pan Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-and-pepper-standing-rib-roast-with-two-mushroom-pan-sauce-236584"
}
