{
    "directions": [
        "Make slits in lamb shoulder all over at 2-inch intervals with a paring knife.",
        "Pound garlic with kosher salt, zest, and 1/2 teaspoon black pepper to a coarse paste with mortar and pestle (or mince and mash with a large knife), then stir together with oil and 1 tablespoon each of rosemary and thyme. Rub paste all over lamb. Put in heavy pot or roasting pan, then chill, covered, 12 to 24 hours.",
        "Bring roast to room temperature (about 1 hour).",
        "Preheat oven to 350°F with rack in lower third.",
        "Pour wine and water around lamb and add herb sprigs. Cover roast with a sheet of parchment. Cover pot with lid or cover roasting pan tightly with heavy-duty foil. Braise lamb in oven until tender but not falling off the bone, about 3 hours.",
        "Increase oven to 450°F and remove parchment, then braise lamb, covered with lid (or foil), until very tender and top is browned, about 1 hour more. Carefully transfer lamb to a platter and loosely cover with foil. Let it stand 10 minutes.",
        "Pour braising liquid through a fine-mesh sieve, then spoon off and discard fat remaining on liquid (you should have about 2 cups liquid; reserve pot). Whisk together flour and 1 cup liquid in a small bowl until smooth. Bring remaining liquid to a boil in uncleaned pot, then whisk in flour mixture and boil, whisking, until thickened, about 4 minutes. Stir in thyme and rosemary and season with salt and pepper.",
        "Remove and discard strings. Meat is too tender to slice with a carving knife; use a meat fork to pull meat into serving pieces."
    ],
    "ingredients": [
        "1 (6-pound) bone-in lamb shoulder roast, tied",
        "1 large head garlic, separated into cloves (about 12), peeled",
        "1 1/2 tablespoons kosher salt",
        "1 tablespoon grated lemon zest",
        "Freshly ground black pepper",
        "1/4 cup extra-virgin olive oil",
        "1 tablespoon minced fresh rosemary plus 1 sprig",
        "1 tablespoon minced fresh thyme plus 5 sprigs",
        "2 cups dry white wine",
        "2 cups water",
        "2 tablespoons all-purpose flour",
        "1/2 teaspoon minced fresh rosemary",
        "1/2 teaspoon minced fresh thyme",
        "a heavy 6 1/2 - 7 quart nonreactive heavy pot with a tight fitting lid, or a heavy-duty nonreactive roasting pan with heavy-duty foil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Braise",
        "Easter"
    ],
    "title": "Rosemary and Thyme Braised Lamb Shoulder",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-and-thyme-braised-lamb-shoulder-51233210"
}
