{
    "directions": [
        "To make the red wine–rosemary butter, in a small saucepan over medium heat, combine the wine and rosemary sprig. Bring the wine to a boil and then simmer until the wine has reduced to a syrup and measures approximately 2 Tbs., about 20 minutes. Allow the wine to cool to room temperature. Place the butter and salt in a food processor and pulse to combine. Add the wine and process until the mixture is smooth, about 1 minute.",
        "Scrape the butter into a line on a large sheet of parchment paper. Fold the parchment over the butter and drag a clean spatula down along the line of butter to push it into a log. Twist both ends of the parchment to seal the ends and refrigerate the butter until ready to use, at least 1 hour.",
        "To prepare the beef tenderloin, place a rack in the center of the oven and preheat the oven to 400°F (200°C).",
        "In a small bowl, stir together 2 Tbs. of the olive oil, the garlic, rosemary, salt and pepper. Rub the mixture all over the tenderloin.",
        "In a large fry pan over medium-high heat, warm the remaining 1 Tbs. olive oil. Sear the tenderloin on all sides until browned, about 3 minutes per side.",
        "Transfer the pan to the oven and roast until an instant-read thermometer inserted into the thickest part of the meat reads 125°F (52°C) for medium rare, 30 to 35 minute. Remove from the oven and transfer the meat to a cutting board. Cover the roast loosely with foil and let rest for 20 minutes.",
        "To serve, slice the meat into slices 1/4 inch (6 mm) thick and arrange on a platter. Slice the butter into rounds 1/8 inch (3 mm) thick and arrange on top of the warm meat slices. Serves 6.",
        "Recipe from Giada De Laurentiis,",
        "Happy Cooking",
        "(Pam Krauss Books, 2015)"
    ],
    "ingredients": [
        "1 cup (8 fl. oz./250 ml) dry red wine",
        "1 sprig fresh rosemary",
        "2 sticks (8 oz./250 g) unsalted butter, at room temperature",
        "1 tsp. kosher salt",
        "3 Tbs. olive oil",
        "3 garlic cloves, minced",
        "1 Tbs. finely chopped fresh rosemary",
        "1 Tbs. kosher salt",
        "1/2 tsp. freshly ground pepper",
        "1 center-cut beef tenderloin, about 3 lb. (1.5 kg), trimmed and tied"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Rosemary Garlic-Rubbed Beef Tenderloin with Red Wine-Rosemary Butter",
    "url": "http://www.williams-sonoma.com/recipe/rosemary-garlic-rubbed-beef-tenderloin-with-red-wine-rosemary-bu.html"
}
