{
    "directions": [
        "1. Peel and coarsely chop the potatoes. Squeeze the garlic from the garlic head into a medium bowl and add the potatoes.",
        "2. In the bowl of a stand mixer fitted with the dough hook, combine the yeast, 2 cups warm water, and the sugar and let the yeast bloom for about 7 minutes, or until bubbly. Add the olive oil, potatoes, garlic, salt, and flours. Mix on medium speed for 15 minutes.",
        "3. Turn the dough out into an oiled bowl, cover it with plastic wrap, and let it rise in a warm place for 1 1/2 hours, or until doubled in size.",
        "4. Punch it down and let it rise again for 1 hour. Punch it down again and cut the dough in half. Shape each loaf into a ball, place them on a baking sheet, and let them rise for 45 minutes, or until nice and poofy.",
        "5. Preheat the oven to 400°F.",
        "6. Brush the loaves with olive oil and sprinkle them with a wee bit of salt and some rosemary. Cut a big slash across the top of each and bake for about 45 minutes, or until the loaves are a nice rich brown and sound hollow when tapped. Let cool on a wire rack. Never refrigerate!"
    ],
    "ingredients": [
        "2 large russet potatoes, well baked and still warm",
        "1 garlic head, roasted and still warm",
        "2 (1/4-ounce) envelopes active dry yeast",
        "2 tablespoons sugar",
        "3 tablespoons olive oil, plus extra for brushing",
        "2 teaspoons kosher salt, plus more for sprinkling",
        "4 cups all-purpose flour, plus more as needed",
        "4 cups bread flour",
        "1 1/2 tablespoons chopped fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Potato",
        "Side",
        "HarperCollins",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rosemary Garlic Potato Bread",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-garlic-potato-bread"
}
