{
    "directions": [
        "Blend rosemary, salt, and pepper in processor until finely chopped. With machine running, gradually add 4 tablespoons oil; process to coarse paste.",
        "Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 450°F. Toss potatoes, parsnips, 2 tablespoons oil, and 3 tablespoons rosemary mixture in large bowl. Transfer vegetable mixture to rimmed baking sheet, arranging in even layer. Roast vegetables on lower rack 20 minutes.",
        "Line large rimmed baking sheet with parchment. Place salmon, skin side down, on sheet. Spread with remaining rosemary mixture. Toss mushrooms with vegetable mixture. Return vegetable mixture to lower rack; place salmon on upper rack. Roast salmon until just opaque in center and vegetables until tender, about 20 minutes.",
        "Line platter with salad greens; place salmon on top of greens. Transfer vegetables to serving bowl. Place vegetable baking sheet over 2 burners on high heat. Add wine and bring to boil, scraping up browned bits. Drizzle juices over salmon."
    ],
    "ingredients": [
        "1 1/2 cups loosely packed fresh rosemary leaves",
        "4 teaspoons coarse kosher salt",
        "2 teaspoons freshly ground black pepper",
        "6 tablespoons olive oil, divided",
        "1 pound red-skinned or white-skinned potatoes, cut into 3/4-inch pieces",
        "1 pound parsnips, peeled, cut into 3/4-inch pieces",
        "1 3 1/2-to 3 3/4-pound whole side of salmon with skin",
        "1 pound crimini (baby bella) mushrooms, quartered if large, halved if small assorted salad greens",
        "1/3 cup Pinot Noir or other dry red wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Potato",
        "Roast",
        "Christmas",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Rosemary",
        "Salmon",
        "Parsnip",
        "Christmas Eve",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Rosemary-Rubbed Side of Salmon with Roasted Potatoes, Parsnips, and Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-rubbed-side-of-salmon-with-roasted-potatoes-parsnips-and-mushrooms-362532"
}
