{
    "directions": [
        "In a food processor or blender blend together the mint, the rosemary, and 1 cup of the wine until the herbs are chopped fine and transfer the mixture to a bowl. In a small saucepan bring the remaining 1 cup wine to a boil, add it to the herb mixture, and let the herb mixture stand, covered, for 45 minutes. Strain the herb mixture through a sieve lined with several layers of rinsed and squeezed cheesecloth set over a large measuring cup, pressing hard on the solids,and add 1/4 cup of the lemon juice. (There should be exactly 2 cups liquid; if there is less add enough of the additional lemon juice to measure 2 cups liquid.) Transfer the liquid to a kettle, stir in the sugar, stirring until the mixture is combined well, and bring the mixture to a rolling boil over high heat, stirring constantly. Stir in the pectin quickly, bring the mixture again to a full rolling boil, stirring constantly, and boil it, stirring constantly, for 1 minute. Remove the kettle from the heat, skim off any foam with a large spoon, and ladle the mixture immediately into 4 sterilized 1/2-pint Mason-type jars, filling the jars to within 1/8 inch of the tops. Wipe the rims with a dampened cloth and seal the jars with the lids. Invert the jars for 5 minutes and turn them upright. (Instead of being inverted, the jars may be put in a water bath canner or on a rack set in a deep kettle. Add enough hot water to the canner or kettle to cover the jars by 1 to 2 inches and bring it to a boil. Process the jars, covered, for 5 minutes, transfer them with tongs to a rack, and let them cool completely.) Store the jars in a cool, dark place."
    ],
    "ingredients": [
        "2 1/2 cups firmly packed fresh mint leaves",
        "1/4 cup fresh rosemary leaves",
        "2 cups dry white wine",
        "1/4 cup fresh lemon juice plus additional if needed",
        "3 1/2 cups sugar",
        "a 3-ounce pouch liquid pectin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Easter",
        "Lemon",
        "Mint",
        "Rosemary",
        "White Wine",
        "Chill",
        "Gourmet"
    ],
    "title": "Rosemary Mint Wine Jelly",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-mint-wine-jelly-10389"
}
