{
    "directions": [
        "Finely grind garlic and salt in processor. Place lamb, cut side up, on work surface. Sprinkle with pepper. Spread garlic-salt mixture evenly over lamb, then sprinkle with chopped rosemary. Roll lamb into its original shape. Using kitchen string, tie lamb roll crosswise every 2 inches, then tie lengthwise. Slide rosemary sprigs under string to cover both sides of lamb. Place lamb in 13x9-inch baking dish. Drizzle lamb all over with oil. Cover with plastic wrap and refrigerate 1 day.",
        "Preheat oven to 350°F. Transfer lamb to large roasting pan. Sprinkle with salt and pepper. Place reserved lamb bone alongside; pour 1 cup water into pan. Arrange lemon slices from 1 lemon atop lamb. Roast lamb 1 hour. Turn lamb over; pour 1 cup more water into pan. Continue to roast lamb until meat thermometer inserted into thickest part registers 140°F, about 1 hour longer. Transfer to cutting board; let rest 15 minutes. Add 1 cup more water to pan, scraping up browned bits. Pour pan juices into 2-cup measuring cup; spoon off fat and discard. Transfer pan juices and any accumulated juices from roast lamb to small saucepan. Bring juices to simmer. Season with pepper.",
        "Discard string and rosemary from lamb. Slice lamb; place on platter. Spoon pan juices over. Garnish with parsley and remaining lemon slices."
    ],
    "ingredients": [
        "8 large garlic cloves",
        "2 teaspoons salt",
        "1 6-pound leg of lamb, boned, trimmed, butterflied, bone reserved",
        "1 tablespoon chopped fresh rosemary plus 20 large sprigs",
        "4 tablespoons extra-virgin olive oil",
        "3 cups water",
        "2 lemons, thinly sliced",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Lamb",
        "Roast",
        "Low Carb",
        "Dinner",
        "Rosemary",
        "Meat",
        "Spring",
        "Winter",
        "Party"
    ],
    "title": "Rosemary-Roasted Lamb with Pan Juices",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-roasted-lamb-with-pan-juices-104715"
}
