{
    "directions": [
        "Combine the flour, yeast, and salt in a food processor. Turn on the machine and add the olive oil through the feed tube, followed by 3/4 cup water. Process for about 30 seconds, adding more water, 1 tablespoon at a time, until the mixture forms a ball and is slightly sticky to the touch.",
        "Turn the dough onto a floured work surface and, by hand, knead in the rosemary until the dough feels smooth. Put it in a bowl, cover with plastic wrap, and let rise until the dough doubles in size, about 2 hours. (You can cut this rising time as short as 1 hour if you are in a hurry, or you can let the dough rise more slowly, in the refrigerator, for up to 8 hours. At this point, you may also wrap the dough tightly in plastic and freeze for up to a month; defrost in a covered bowl in the refrigerator or at room temperature.)",
        "Lightly dust a work surface with flour. Shape the dough into a boule, sprinkling with flour as necessary but keeping it to a minimum. Line a colander or large bowl with a well-floured kitchen towel, set the loaf in the bowl, and cover with another towel (this keeps it from spreading too much). Let the dough rise for at least an hour and preferably longer, up to 2 hours.",
        "About 45 minutes before the dough has risen, heat the oven to 425°F. Put an ovenproof skillet (preferably cast iron) on the floor or the lowest rack while the oven heats. If you’re using a baking stone, put it on the rack above the skillet while the oven heats; if not, line a baking sheet with parchment paper.",
        "Once you’re ready to bake, slide or turn the dough out onto a lightly floured peel or flexible cutting board, seam side down, or just transfer it to the prepared baking sheet. Rub the loaf with a little flour (this helps prevent scorching) and slash the top with a sharp knife or razor blade. Use the peel or cutting board to slide the loaf onto the baking stone or slide the baking sheet into the oven. Partially pull out the rack with the heated skillet and very carefully pour 1 cup hot water into the skillet (it will create a lot of steam). Slide the rack back in and immediately close the oven door",
        "Bake for 45 to 50 minutes, turning the bread or the baking sheet halfway through, until the crust is golden brown, the bottom sounds hollow when tapped, and the internal temperature reaches 200°F on a quick-read thermometer. If the bread is browning too quickly, lower the temperature to 400°F. Remove and cool on a wire rack.",
        "Rosemary Olive Oil Bread With Olives or Tomatoes: In Step 2, knead 1 cup halved pitted oil-cured olives, roughly chopped dried tomatoes, or a combination into the dough along with the rosemary.",
        "Olive Oil Bread With Onions and Mint: A nice combo; you can make this with olives too (see the preceding variation), but omit the rosemary. In Step 2, knead 1 large onion, chopped, into the dough in place of or along with the olives. Add 1 tablespoon chopped fresh mint if you like.",
        "Pancetta and Black Pepper Bread: Rich, savory, and packed with flavor: You can use olive oil here if you’d rather not use the pancetta pan drippings: Omit the rosemary. Chop 1 pound pancetta (or bacon) and cook until it’s crisp. Drain the meat and set it aside, reserving 1/3 cup of the rendered fat. If you don’t have enough, add olive oil or good-quality lard to make up the balance. Proceed with the recipe, using the reserved fat in place of the oil. In Step 2, knead in the pancetta pieces and 2 tablespoons coarsely ground black pepper."
    ],
    "ingredients": [
        "3 cups all-purpose or bread flour, plus more as needed",
        "2 teaspoons instant yeast",
        "2 teaspoons coarse kosher or sea salt",
        "1/3 cup olive oil",
        "1 tablespoon fresh rosemary leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bake",
        "Bread",
        "Rosemary"
    ],
    "title": "Rosemary Olive Oil Bread",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-olive-oil-bread"
}
