{
    "directions": [
        "1. In a large heavy saucepan, bring the milk almost to a boil, then remove from the heat. Remove 1/2 cup of the milk and set aside. Gently mix the rose petals into the warmed milk in the pan and let infuse for 15 to 20 minutes. Strain the milk through cheesecloth or a fine strainer, discarding the petals.",
        "2. Pour the infused milk back into the saucepan, add the sugar and vanilla, and bring to a simmer over medium heat.",
        "3. Whisk the cornstarch into the reserved 1/2 cup milk until there are no lumps. Add the cornstarch mixture to the pan and simmer over low heat, stirring gently with a rubber spatula, for 7 to 10 minutes, or until it is thickened and coats the spatula. Remove from the heat and let cool.",
        "4. Eddy loves the subtle taste of the wild roses in this dish but if you prefer a stronger rose flavor, add the rosewater. Gently fold in the raspberries. Ladle into separate dessert dishes and sprinkle the top with ground pistachios. Cool in the refrigerator. Serve chilled or at room temperature."
    ],
    "ingredients": [
        "1 quart whole milk",
        "4 ounces (5 cups) wild rose petals, plus more for decoration (from 2 grocery bagfuls of flower-laden branches)",
        "1/4 cup sugar",
        "1 teaspoon pure vanilla extract",
        "1/2 cup cornstarch",
        "1 teaspoon rosewater, or to taste (optional)",
        "1 pint fresh raspberries",
        "2 tablespoons coarsely ground unsalted pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Berry",
        "Dairy",
        "Fruit",
        "Nut",
        "Dessert",
        "Raspberry",
        "Tree Nut",
        "Pistachio",
        "Summer",
        "Shower",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rose Petal and Pistachio Raspberry Custard",
    "url": "http://www.epicurious.com/recipes/food/views/rose-petal-and-pistachio-raspberry-custard-51104880"
}
