{
    "directions": [
        "Stir together 1 2/3 cups lukewarm (105 to 115°F) water and yeast in bowl of mixer and let stand until creamy, about 5 minutes. Add 5 cups flour, 1/4 cup oil, and 2 1/2 teaspoons table salt and beat with paddle attachment at medium speed until a dough forms. Replace paddle with dough hook and knead dough at high speed until soft, smooth, and sticky, 3 to 4 minutes.",
        "Turn dough out onto a lightly floured surface and knead in 1 to 2 tablespoons more flour. Knead dough 1 minute (it will still be slightly sticky), then transfer to a lightly oiled bowl and turn dough to coat with oil. Let rise, covered with plastic wrap, at warm room temperature, until doubled in bulk, 1 to 1 1/2 hours.",
        "Press dough evenly into a generously oiled 15- by 10- by 1-inch baking pan. Let dough rise, covered completely with a kitchen towel, until doubled in bulk, about 1 hour.",
        "Preheat oven to 425°F.",
        "Stir together rosemary and remaining 3 tablespoons oil. Make shallow indentations all over dough with your fingertips, then brush with rosemary oil, letting it pool in indentations. Sprinkle sea salt evenly over focaccia and bake in middle of oven until golden, 20 to 25 minutes.",
        "Immediately invert a rack over pan and flip focaccia onto rack, then turn right side up. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 (1/4-ounce) package active dry yeast",
        "5 cups unbleached all-purpose flour plus additional for kneading",
        "1/4 cup plus 3 tablespoons extra-virgin olive oil",
        "1 tablespoon finely chopped fresh rosemary",
        "1 teaspoon coarse sea salt",
        "Special equipment: a standing electric mixer with paddle attachment and dough hook"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Bake",
        "Rosemary",
        "Gourmet"
    ],
    "title": "Rosemary Focaccia",
    "url": "http://www.epicurious.com/recipes/food/views/rosemary-focaccia-106275"
}
