{
    "directions": [
        "Preheat oven to 425°F. Melt 3 tablespoons butter in large ovenproof nonstick skillet over medium heat. Add onion; sauté 5 minutes. Place 2 1/2 cups grated potatoes in medium bowl. Sprinkle with salt and pepper; toss to blend (reserve any remaining potatoes for another use). Stir onion mixture, ham, and chives into potatoes.",
        "Melt 2 tablespoons butter in same skillet over high heat. Add potato mixture. Using spatula, press mixture to even thickness, covering skillet bottom completely. Cook 2 minutes. Reduce heat to medium-high. Cook until potato cake is golden on bottom, about 7 minutes. Loosen cake; slide out onto large plate or rimless baking sheet. Turn skillet upside down atop cake. Invert skillet and plate, dropping cake back into skillet. Cook cake until golden on bottom, about 7 minutes. Place skillet in oven. Bake until Rösti is crisp, about 7 minutes.",
        "Meanwhile, melt remaining 1 tablespoon butter in heavy medium skillet over medium heat. Crack each egg and drop into skillet. Sprinkle with salt and pepper. Partially cover skillet; cook until egg whites are set, about 3 minutes.",
        "Cut Rösti into 4 wedges. Overlap 2 wedges of Rösti on each of 2 plates; top Rösti wedges on each plate with 1 egg."
    ],
    "ingredients": [
        "6 tablespoons (3/4 stick) butter",
        "3/4 cup chopped onion",
        "1 1/4 pounds russet potatoes, peeled, coarsely grated",
        "1/2 cup 1/4-inch cubes Black Forest ham or other smoked ham",
        "1/4 cup chopped fresh chives",
        "2 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Onion",
        "Potato",
        "Appetizer",
        "Breakfast",
        "Brunch",
        "Side",
        "Bake",
        "Sauté",
        "Valentine's Day",
        "Mother's Day",
        "Father's Day",
        "Ham",
        "Winter",
        "Chive",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Rösti with Black Forest Ham and Chives",
    "url": "http://www.epicurious.com/recipes/food/views/rosti-with-black-forest-ham-and-chives-104685"
}
