{
    "directions": [
        "Cook bacon in a small nonstick skillet over medium heat, stirring occasionally, until most of fat is rendered and bacon begins to brown, about 5 minutes. Set 1 tablespoon of dark-green part of scallions aside. Add remaining scallions to skillet and cook, stirring occasionally, until bacon is crisp and scallions are soft, 4-5 minutes longer. Using a slotted spoon, transfer bacon mixture to a paper towel-lined plate.",
        "Pour bacon fat into a small bowl; reserve skillet. Add olive oil to bowl to measure 3 tablespoons Add butter. Place 2 tablespoons fat mixture in skillet. Pour 2 tablespoons into another bowl; add bacon mixture. Reserve remaining 2 tablespoons in small bowl.",
        "Coarsely grate potatoes into a large bowl. Working in batches, squeeze potatoes with your hands to release liquid; transfer to another large bowl. Add the reserved bacon mixture, 1 teaspoon salt, and pepper; toss to evenly distribute.",
        "Heat reserved skillet over medium-low heat. Scrape potato mixture into hot skillet, pressing with a spatula into an even layer. Tent with foil; cook for 10 minutes, rotating skillet frequently to avoid hot spots. Remove foil; cook rösti until bottom is golden brown, about 5 minutes longer. Run a silicone spatula around sides and underneath rösti. Invert a large plate over skillet. Using oven mitts, carefully flip rösti onto plate.",
        "Heat remaining 2 tablespoons fat in skillet. Slide rösti back in, browned side up. Tent with foil; cook for 5 minutes. Uncover; cook until browned on bottom and potatoes are cooked through, about 10 minutes longer. Gently run spatula around sides and underneath rösti and slide onto a serving plate. Sprinkle with reserved scallions and season with more salt, if desired."
    ],
    "ingredients": [
        "4 slices thick-cut smoked bacon (4 ounces), chopped",
        "6 scallions, chopped, divided",
        "Olive oil",
        "3 tablespoon unsalted butter, melted",
        "1 1/2 pounds russet potatoes, peeled",
        "1 teaspoon smoked salt or kosher salt plus more",
        "3/4 teaspoon freshly ground black pepper",
        "Ingredient info: Smoked salt can be found at specialty stores and saltworks.us."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Brunch",
        "Side",
        "Christmas",
        "Low Cal",
        "Bacon",
        "Pan-Fry",
        "Christmas Eve",
        "Green Onion/Scallion",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Rösti with Bacon and Scallions",
    "url": "http://www.epicurious.com/recipes/food/views/rosti-with-bacon-and-scallions-368978"
}
