{
    "directions": [
        "Put flour into a Dutch oven or large heavy pot and add flour. Turn heat to medium-high, put the pot on the burner, and cook, stirring constantly with a wooden spoon, until thick and bubbly, has a 'peanutty' smell, and is dark brown, about 10 minutes. Set aside to cool and thicken.",
        "Melt butter in a skillet over medium heat. Cook and stir celery, green onions, and bell pepper in hot butter until tender, about 10 minutes; add to pot with the roux.",
        "Stir water, tomato sauce, Worcestershire sauce, garlic, 2 teaspoons salt, hot pepper sauce, and thyme into the vegetable mixture. Bring the mixture to a gentle boil, reduce heat to medium-low, and simmer for 1 hour.",
        "Stir okra into the vegetable mixture and cook until tender, about 15 minutes. Add catfish, stir gently, and cook until the flesh is easily flaked with a fork, about 5 minutes. Gently stir shrimp into the mixture; cook until the shrimp are bright pink, about 3 minutes. Season with the file powder and salt; stir."
    ],
    "ingredients": [
        "Roux:",
        "1/2 cup all-purpose flour",
        "1/2 cup vegetable oil",
        "Vegetables:",
        "1 tablespoon butter",
        "1 cup chopped celery",
        "1 cup chopped green onions",
        "1 green bell pepper, chopped",
        "Tomato Sauce and Spices:",
        "6 cups water",
        "1 (8 ounce) can tomato sauce",
        "2 tablespoons Worcestershire sauce",
        "2 cloves garlic, minced",
        "2 teaspoons salt, or to taste",
        "1 teaspoon hot pepper sauce (such as Tabasco®), or to taste",
        "1/2 teaspoon dried thyme",
        "Seafood and Okra:",
        "1 pound frozen chopped okra",
        "1 pound catfish, cut into 2-inch pieces",
        "1 1/2 pounds peeled and deveined shrimp",
        "Last Addition:",
        "1 tablespoon gumbo file powder, or to taste",
        "1/2 teaspoon salt, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Roux-Based Authentic Seafood Gumbo with Okra",
    "url": "http://allrecipes.com/recipe/233464/roux-based-authentic-seafood-gumbo-wi/"
}
