{
    "directions": [
        "Put the yogurt into a bowl. Beat it lightly until it is smooth and creamy. Add 1/2 teaspoon of the salt, some black pepper, the ground cumin, ground coriander, cayenne, and cilantro. Mix and set aside.",
        "Using the remaining 1/2 teaspoon salt, season the chicken pieces on both sides and sprinkle on some freshly ground black pepper.",
        "Put the oil in a wide, preferably nonstick pan and set over medium-high heat. When the oil is hot, put in the cardamom pods, cloves, cinnamon, and bay leaves. Stir once and put in some of the chicken pieces, only as many as the pan will hold easily in a single layer. Brown on both sides and remove to a large bowl. Brown all the chicken pieces this way and transfer them to the bowl. Put the almonds and raisins into the same hot oil. Stir quickly. The almonds should turn golden and the raisins should plump up, which will happen very fast. Then put the chicken and its accumulated juices back into the pan. Add the seasoned yogurt. Stir to mix and bring to a simmer. Cover, turn the heat to low, and simmer gently for 20 minutes, stirring once or twice during this time. Remove the cover, turn the heat up a bit, and reduce the sauce until it is thick and just clings to the chicken pieces. Turn the chicken pieces over gently as you do this."
    ],
    "ingredients": [
        "1 cup plain yogurt",
        "1 teaspoon salt",
        "Freshly ground black pepper",
        "1 teaspoon ground cumin",
        "1 teaspoon ground coriander",
        "1/4 teaspoon cayenne pepper, or to taste",
        "1/4 cup finely chopped fresh cilantro (Chinese parsley, fresh green coriander)",
        "3 1/2 pounds chicken, cut into serving portions",
        "1/4 cup vegetable oil",
        "8 cardamom pods",
        "6 whole cloves",
        "2-inch stick cinnamon",
        "3 bay leaves",
        "2 1/2 tablespoons blanched, slivered almonds",
        "2 1/2 tablespoons golden raisins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Curry",
        "Chicken",
        "Yogurt",
        "Cardamom",
        "Cinnamon",
        "Clove",
        "Almond",
        "Raisin",
        "Cilantro",
        "Dinner",
        "Quick & Easy"
    ],
    "title": "Royal Chicken Cooked in Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/royal-chicken-cooked-in-yogurt"
}
