{
    "directions": [
        "In a medium bowl, cream together the butter and cream cheese. Beat in 1/4 cup of sugar and vanilla. Combine the flour and salt; stir until well blended. Turn out dough onto a piece of plastic wrap and press together to form a ball. Divide the ball into 4 portions, wrap each one in plastic and refrigerate for at least 2 hours or overnight.",
        "Preheat the oven to 350 degrees F (175 degrees C). In a small bowl, toss together the brown sugar, 6 tablespoons white sugar, 1/2 teaspoon of cinnamon and the chopped dried apricots. Set aside.",
        "Roll out each portion of dough into a circle about 1/8 inch thick. Spread about 2 tablespoons of the apricot preserves over each circle, then sprinkle each one with some of the dried apricot mixture. Using a knife, cut each circle into 12 wedges like a pizza. Starting at the wide end, roll each piece individually up towards the point. Bend the ends around to form a crescent. If dough is sticky, return it to the refrigerator to chill. Place rugelach point sides down, two inches apart into a parchment lined or greased baking sheet. Brush with milk then sprinkle with a mixture of the remaining 1 teaspoon cinnamon and 2 tablespoons sugar.",
        "Bake for 16 to 18 minutes in the preheated oven, until golden. Rotate the cookie sheet halfway through to ensure even baking. Remove from baking sheet to cool on wire racks."
    ],
    "ingredients": [
        "1 cup unsalted butter, softened",
        "1 (8 ounce) package cream cheese, softened",
        "1/4 cup white sugar",
        "1 teaspoon vanilla extract",
        "2 cups all-purpose flour",
        "1/4 teaspoon salt",
        "1/2 cup apricot preserves",
        "1/4 cup packed light brown sugar",
        "1/2 teaspoon ground cinnamon",
        "3/4 cup chopped dried apricots",
        "6 tablespoons white sugar",
        "1/4 cup milk",
        "2 tablespoons white sugar",
        "1 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rugelach III",
    "url": "http://allrecipes.com/recipe/24441/rugelach-iii/"
}
