{
    "directions": [
        "Bring rum with raisins to a boil in a 1-quart heavy saucepan, then remove from heat and let stand, covered, 1 hour.",
        "Put oven rack in middle position with a large heavy baking sheet on rack and preheat oven to 425°F.",
        "Rub together brown sugar, flour, zest, cinnamon, nutmeg, and salt with your fingers in a large bowl until no lumps remain. Peel and core apples, then cut into 1/2-inch-wide wedges and add to sugar mixture, tossing gently to coat. Add raisins with any liquid and toss until combined.",
        "Roll out larger piece of dough into a 13-inch round (keep remaining piece chilled) on a lightly floured surface with a lightly floured rolling pin. Fit into a 9-inch pie plate (4-cup capacity) and trim edge, leaving a 1/2-inch overhang. Chill shell while rolling out top crust.",
        "Roll out smaller piece of dough on a lightly floured surface with lightly floured rolling pin into an 11-inch round.",
        "Spoon filling evenly into shell, then dot top with butter. Brush pastry overhang with some of milk, then cover pie with pastry round. Trim pastry flush with edge of pie plate using kitchen shears, then press edges together and crimp decoratively.",
        "Lightly brush top of pie with some of remaining milk and sprinkle all over with sanding sugar. Cut 3 steam vents in top crust with a small sharp knife.",
        "Bake pie on hot baking sheet 20 minutes. Reduce oven temperature to 375°F and continue to bake until crust is golden and filling is bubbling, 45 to 50 minutes more. Cool pie on a rack to warm or room temperature, about 1 1/2 hours."
    ],
    "ingredients": [
        "3 tablespoons dark rum",
        "1/3 cup raisins",
        "2/3 cup packed light brown sugar",
        "3 tablespoons all-purpose flour",
        "1 teaspoon finely grated fresh lemon zest",
        "1/2 teaspoon cinnamon",
        "1/8 teaspoon freshly grated nutmeg",
        "1/8 teaspoon salt",
        "6 medium apples, ranging from sweet to tart (2 1/2 lb)",
        "Pastry dough for a double-crust > pie",
        "1 tablespoon unsalted butter, cut into small pieces",
        "2 teaspoons milk",
        "1 tablespoon sanding sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Raisin",
        "Apple",
        "Fall",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rum Raisin Apple Pie",
    "url": "http://www.epicurious.com/recipes/food/views/rum-raisin-apple-pie-236430"
}
