{
    "directions": [
        "For the cake: Grease a Bundt pan and spread pecans on the bottom of the pan. Beat eggs, oil, water and rum in mixer just until incorporated. Add pudding mix and cake mix and beat on med, about 3 to 5 minutes just until you get a smooth texture. Pour into pan and bake at 350 degrees F for 40 to 45 minutes. The cake should have a light golden brown color, but will darken with the glaze.",
        "For the glaze: Melt butter in saucepan and add the sugar and water, bring to a boil. Once it starts to boil, take off the heat and add the rum. Pour into a large measuring cup that will hold that amount or more. Set aside.",
        "Once cake is ready, take out of oven and leave in pan. Gently prick holes into the cake with a skewer. Slowly pour half of the glaze over the cake making sure to fill in all the holes. Once the cake has soaked up the glaze, turn cake over, removing pan, onto the base that the cake will stay on. Gently prick more holes on other side and slowly pour other half of glaze over cake. Fill the center of the cake with reserved pecans. Let cool and enjoy. The cake is best if left at room temperature."
    ],
    "ingredients": [
        "1 1/2 cups pecan pieces, reserve 1/4 cup",
        "4 whole eggs",
        "1/2 cup water",
        "1/2 cup canola oil",
        "1/2 cup gold rum, Bacardi",
        "1 (18.25-ounce) box classic yellow cake mix (recommended: Duncan Hines Moist Deluxe)",
        "1 (1-ounce) small box sugar-free instant vanilla pudding mix (recommended: Jell-O)",
        "1 cup granulated sugar",
        "1/4 cup water",
        "1 stick butter",
        "1/2 cup gold rum (recommended: Bacardi)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Rum Cake",
        "Cake",
        "Rum Recipes",
        "Sugar"
    ],
    "title": "Rum Cake - Semi-Homemaker Recipe",
    "url": "http://www.foodnetwork.com/recipes/rum-cake-semi-homemaker-recipe-recipe"
}
