{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch cake pan.",
        "Melt 1 tablespoon of butter in a small skillet over medium heat. Stir in the apple, raisins, 1 tablespoon rum, and pinch of cinnamon. Cook until the apples are soft. Toss apples with bread cubes, and spoon into prepared pan.",
        "Combine brown sugar, white sugar, 3/4 cup milk, evaporated milk, 1 tablespoon cinnamon, and 1/4 cup butter in a small saucepan over medium heat. Cook, stirring, until butter is melted.",
        "Whisk the eggs and 1/2 teaspoon vanilla extract in a small bowl. Whisking constantly, pour hot milk mixture into beaten eggs. Pour custard over bread cubes and apples.",
        "Cover pan with aluminum foil; bake in preheated oven for 40 minutes. Remove foil and bake until pudding is puffed and lightly browned, about 10 additional minutes.",
        "While the pudding bakes, prepare the rum sauce. Whisk together 3 tablespoons milk and the cornstarch in a small bowl until smooth. Melt the butter over medium heat in a small saucepan. Stir in 1 tablespoon rum, 1/2 cup milk, and 1/4 cup white sugar; bring to a boil. Slowly add cornstarch mixture, stirring until sauce thickens. Remove from heat and stir in 1 tablespoon vanilla.",
        "Pour rum sauce over warm pudding. Let rest for 5 minutes before serving. The sauce will continue to thicken and form a beautiful glaze."
    ],
    "ingredients": [
        "Pudding",
        "1 tablespoon butter",
        "1 apple, peeled and thinly sliced",
        "1/4 cup raisins",
        "1 tablespoon rum",
        "1 pinch ground cinnamon",
        "8 slices cinnamon raisin bread, crusts removed, cut into 3/4 inch cubes",
        "3/4 cup brown sugar",
        "1/4 cup white sugar",
        "3/4 cup nonfat milk",
        "1 cup lowfat evaporated milk",
        "1 tablespoon ground cinnamon",
        "1/4 cup butter",
        "2 eggs",
        "1/2 teaspoon vanilla extract",
        "Rum Sauce",
        "3 tablespoons nonfat milk",
        "5 teaspoons cornstarch",
        "1 tablespoon butter",
        "1 tablespoon rum",
        "1/2 cup nonfat milk",
        "1/4 cup white sugar",
        "1 tablespoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rum Raisin Bread Pudding with Warm Vanilla Sauce",
    "url": "http://allrecipes.com/recipe/151866/rum-raisin-bread-pudding-with-warm-va/"
}
