{
    "directions": [
        "In a small heavy saucepan sprinkle the gelatin over the rum and let it soften for 1 minute. Stir in the lime juice, the lemon juice, the zest, the yolks, and 1/4 cup of the sugar, cook the mixture over moderately low heat, stirring constantly, until it is thickened slightly and a candy thermometer registers 175°F., and transfer it to a metal bowl set in a larger bowl of ice and cold water. Let the mixture cool, stirring occasionally, until it is cold and has the consistency of raw egg white, but do not let it set.",
        "In a bowl beat the egg whites with a pinch of salt until they hold soft peaks, beat in the remaining 1/4 cup sugar, 1 tablespoon at a time, and beat the whites until they just hold stiff peaks. Stir one fourth of the whites into the lime mixture and fold in the remaining whites gently but thoroughly.",
        "In another bowl beat the cream until it just holds stiff peaks and fold it into the lime mixture with the food coloring. Spoon the mousse into dessert glasses and chill it, covered loosely with plastic wrap, for at least 1 hour and up to 24 hours. Garnish the desserts with the lime twists."
    ],
    "ingredients": [
        "1 envelope (about 1 tablespoon) of unflavored gelatin",
        "1/4 cup light rum",
        "1/3 cup fresh lime juice (about 2 limes)",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon freshly grated lime zest",
        "3 large eggs, separated, the whites at room temperature",
        "1/2 cup sugar",
        "3/4 cup heavy cream",
        "1 drop of green food coloring if desired",
        "twists of lime zest for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Egg",
        "Dessert",
        "Lime",
        "Chill",
        "Gourmet",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Rum Lime Mousses",
    "url": "http://www.epicurious.com/recipes/food/views/rum-lime-mousses-10371"
}
