{
    "directions": [
        "Spread powdered sugar evenly in large nonstick skillet. Cook over medium-high heat without stirring until sugar begins to melt and caramelize on bottom (sugar layer will slide when skillet is tilted), then stir until all sugar is melted and deep amber and caramel is smooth, 3 to 4 minutes. Add 1 cup cream, rum, and 1/4 teaspoon salt (some clumps will form). Stir until caramel is thick and smooth, about 1 minute. Mix in remaining 1/4 cup cream. Remove from heat and add butter; stir until sauce is thick and smooth, about 1 minute. Strain sauce into small bowl. DO AHEAD: Sauce can be made 1 week ahead. Cool, cover, and chill. Rewarm, stirring over low heat, before using.",
        "Preheat oven to 350°F.",
        "Spread bread cubes out on rimmed baking sheet. Toast until beginning to feel dry but not hard, about 7 minutes. Cool on sheet. Whisk eggs, 3/4 cup sugar, and 1/8 teaspoon salt in large bowl to blend. Bring cream and half and half to simmer in medium saucepan. Very gradually whisk cream mixture into egg mixture. Strain custard into medium bowl; mix in vanilla. Cool to lukewarm, about 30 minutes.",
        "Whisk brown sugar and butter in large skillet over medium-high heat until smooth sauce forms, about 1 minute. Whisk in rum, lemon juice, and 1/4 teaspoon salt. Add bananas and toss just until coated, about 30 seconds. Remove from heat.",
        "Lightly butter 8x8x2-inch glass baking dish (8-cup capacity). Scatter 1/3 of bread in dish. Top with half of bananas and half of syrup from skillet. Scatter half of remaining bread over. Top with remaining bananas and syrup from skillet, then remaining bread. Pour custard over. Let pudding stand 30 minutes, occasionally pressing down bread to submerge and to absorb custard.",
        "Preheat oven to 350°F. Place dish with pudding in 13x9x2-inch metal baking pan. Add enough warm water to pan to reach halfway up sides of pudding dish. Cover baking pan with foil. Bake pudding 30 minutes. Uncover and bake until puffed and set in center, about 45 minutes longer. Remove from water bath and let stand 15 minutes. Serve warm or at room temperature with warm caramel sauce."
    ],
    "ingredients": [
        "2 cups powdered sugar",
        "1 1/4 cups heavy whipping cream, divided",
        "1 tablespoon dark rum",
        "1/4 teaspoon salt",
        "1 tablespoon unsalted butter",
        "7 cups 3/4-inch cubes crustless brioche or egg bread (from 1-pound loaf)",
        "6 large eggs",
        "3/4 cup sugar",
        "1/8 teaspoon plus 1/4 teaspoon salt",
        "1 1/2 cups heavy whipping cream",
        "1 1/2 cups half and half",
        "1 teaspoon vanilla extract",
        "1/4 cup (packed) dark brown sugar",
        "3 tablespoons unsalted butter",
        "2 tablespoons dark rum",
        "1 tablespoon fresh lemon juice",
        "4 medium just-ripe bananas, peeled, cut lengthwise in half, then crosswise into 1/3-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Dessert",
        "Bake",
        "Kentucky Derby",
        "Banana",
        "Family Reunion",
        "Potluck",
        "Simmer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rum, Caramel, and Banana Bread Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/rum-caramel-and-banana-bread-pudding-351558"
}
