{
    "directions": [
        "Season roast with salt and pepper. Press garlic all over roast and wrap well in plastic wrap. Chill roast at least 12 hours and up 10 1 day.",
        "Preheat oven to 350°F. Let roast stand at room temperature 30 minutes.",
        "While roast is standing, in a large saucepan simmer onions in water, covered, until tender, about 20 minutes. Pour mixture through a large sieve into a bowl, pressing on solids, and reserve onion broth.",
        "Unwrap roast and discard garlic. Dredge toast completely with 1/3 cup flour, shaking off any excess flour. In a large Dutch oven heat shortening over moderately high heat until hot but not smoking and brown roast on all sides. Add 1/2 cup reserved onion broth and braise, covered, in oven, turning roast every 40 minutes, 2 hours. Add 2 cups onion broth and braise, covered, 45 minutes to 1 hour more, or until roast is very tender.",
        "Transfer roast to a cutting board, reserving braising liquid in Dutch oven, and let stand, covered loosely, while making gravy. In a small bowl stir together with a fork remaining 2 tablespoons flour and 1/3 cup onion broth until smooth. Bring reserved braising liquid to a boil and add flour mixture in a stream, stirring until smooth. Simmer gravy until thickened, adding enough onion broth to thin to desired consistency.",
        "Serve rump roast with gravy."
    ],
    "ingredients": [
        "a 4-to-5 pound boneless beef rump roast",
        "10 garlic cloves, quartered",
        "5 medium onions, halved",
        "6 cups water",
        "1/3 cup plus 2 tablespoons all-purpose flour",
        "1/4 cup vegetable shortening"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Onion",
        "Braise",
        "Roast",
        "Winter",
        "Chill",
        "Simmer",
        "Gourmet"
    ],
    "title": "Rump Roast Brooks",
    "url": "http://www.epicurious.com/recipes/food/views/rump-roast-brooks-14250"
}
