{
    "directions": [
        "1. Rinse the toast, and pat it dry. Place in a Dutch oven, and pour in enough water to come halfway up the sides of the roast. Cover and bring to a boil. Reduce the heat and simmer for about 1 hour, turning occasionally. Remove the beef from the pan, setting it side until cool enough to handle. Reserve the cooking liquid in the pan.",
        "2. Make several slits along the top of the beef. Combine the salt, pepper, cloves, nutmeg, mace, marjoram, savory, thyme, and parsley, and rub the mixture into the slits and over the surface of the roast. Coat all over with the egg yolk.",
        "3. Return the roast to the Dutch oven. Pour in the red wine and balsamic vinegar, stirring to combine with the cooking liquid. Cover and bring to a boil over medium-high heat. Reduce the heat, cover, and simmer for about 1 hour, until the roast is tender. Add the onion, cover again, and continue simmering for about 1 hour more, turning occasionally and stirring the gravy until the beef is fork-tender.",
        "4. Transfer the roast to a cutting board, and cover loosely with aluminum foil. Stir the gravy, and bring back to a simmer. Add more salt and pepper, if necessary, and whisk in the butter, stirring until dissolved and the gravy is smooth.",
        "5. To serve, cut the beef into thin slices, and arrange on a platter. Pour some of the gravy over the beef. Surround with boiled potatoes, and pour more gravy over the potatoes. Pour the remaining gravy into a sauceboat, and serve on the side. Garnish the roast and potatoes with orange slices, and send to the table."
    ],
    "ingredients": [
        "1 boneless rump roast (3 1/2 to 4 pounds)",
        "Water as needed",
        "2 teaspoons salt",
        "1 teaspoon ground black pepper",
        "1/4 teaspoon ground cloves",
        "1/2 teaspoon ground nutmeg",
        "1/2 teaspoon ground mace",
        "1 teaspoon dried marjoram",
        "3/4 teaspoon dried savory",
        "2 teaspoons dried thyme",
        "2 tablespoons chopped fresh parsley",
        "1 large egg yolk, lightly beaten",
        "2 cups dry red wine, such as claret or merlot",
        "1/2 cup balsamic vinegar",
        "1 medium onion, peeled, halved lengthwise, and thinly sliced",
        "2 tablespoons unsalted butter",
        "Peeled boiled new potatoes for serving",
        "Orange slices for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Wine",
        "Beef",
        "Herb",
        "Dinner",
        "Spice",
        "Thyme",
        "Clove",
        "Nutmeg",
        "Simmer",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Rump of Beef to Stew",
    "url": "http://www.epicurious.com/recipes/food/views/rump-of-beef-to-stew-394706"
}
