{
    "directions": [
        "Heat milk, sugar, butter, saffron, and salt in a 1-quart heavy saucepan over moderate heat, stirring occasionally, until butter is melted and sugar is dissolved, about 2 minutes. Remove from heat and cool to lukewarm.",
        "Meanwhile, stir together yeast, warm water, and pinch of sugar and let stand until foamy, about 5 minutes. (If mixture doesn't foam, discard and start over with new yeast.)",
        "Put flour in a large bowl and make a large well in center. Lightly beat 3 eggs and add to well along with milk and yeast mixtures. Carefully stir together with a wooden spoon, gradually incorporating flour, until a soft dough forms. Transfer dough to a lightly floured surface and knead, dusting with just enough flour to keep dough from sticking, until smooth and elastic, about 10 minutes. Put dough in a lightly oiled large bowl, turning to coat with oil, and let rise, covered with a clean kitchen towel, in a draft-free place at warm room temperature until doubled in bulk, about 3 hours.",
        "Punch down dough and let rise again, covered with towel, until doubled in bulk, about 1 hour.",
        "Generously butter soufflé dishes. Punch down dough and divide in half. Loosely wrap 1 piece in plastic wrap and set aside. Cut away one third of remaining piece of dough and reserve, then roll remaining two thirds into a large ball and transfer to a soufflé dish.",
        "Roll reserved piece of dough into an 18-inch-long rope on work surface with palms of your hands. Cut rope into 3 equal pieces and lay pieces vertically side by side on work surface, about 1/4 inch apart. Gather 3 ends farthest from you and press them together, then braid strands, pressing together other ends to secure braid. Lay braid over top of dough in soufflé dish (trim braid if using coffee cans). Form another loaf with remaining dough in same manner.",
        "Cover loaves with clean kitchen towel and let rise in draft-free place at warm room temperature until doubled in bulk, about 1 1/2 hours (loaves will rise about 1 inch above rims of dishes).",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Lightly beat remaining egg with a large pinch of salt, then brush egg over top of each loaf. Bake loaves until golden brown and bread sounds hollow when tapped on bottom, about 1 hour. Turn loaves out onto a rack, then turn right side up and cool completely."
    ],
    "ingredients": [
        "1 cup whole milk",
        "1/2 cup sugar plus a pinch",
        "1 1/2 sticks (3/4 cup) unsalted butter",
        "Pinch of saffron threads, crumbled",
        "2 teaspoons salt",
        "2 1/2 teaspoons active dry yeast (from a 1/4-oz package)",
        "1/4 cup lukewarm water (105–115°F)",
        "6 cups all-purpose flour plus additional for dusting",
        "4 large eggs",
        "Special equipment: 2 (5- to 6-cup) soufflé dishes or 2 (2-pound) cleaned empty coffee cans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Egg",
        "Bake",
        "Easter",
        "Saffron",
        "Spring",
        "Gourmet"
    ],
    "title": "Russian Easter Bread",
    "url": "http://www.epicurious.com/recipes/food/views/russian-easter-bread-109326"
}
