{
    "directions": [
        "Preheat oven to 425°F. Line heavy rimmed baking sheet with parchment paper. Melt butter in large nonstick skillet over medium-high heat. Add pears. Sauté until almost tender, about 8 minutes. Sprinkle with 1 tablespoon sugar; toss 1 minute. Add cranberries, juice concentrate, and jelly. Sauté until pears are tender and juices are thick, 2 to 3 minutes longer. Scrape pear mixture onto large plate and place in freezer 5 minutes to cool quickly.",
        "Unroll dough onto prepared sheet. Cut 1 1/2-inch-wide strip off 1 short end, forming rough 9-inch square. Pull dough strip to twice its length and cut crosswise in half.",
        "Scrape pear mixture into center of dough square. Spread mixture to cover, leaving 1 1/2-inch plain border. Fold up border over edge of filling. Place 2 dough strips diagonally over filling, spacing strips 2 to 3 inches apart; press ends to border to adhere. Sprinkle border and strips with 1 tablespoon sugar.",
        "Bake tart until dough is golden and cooked through, 22 to 23 minutes. Cool to lukewarm on baking sheet."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "2 large Bosc pears (1 to 1 1/4 pounds total), halved, cored, cut into 1/2- to 3/4-inch cubes",
        "2 tablespoons sugar, divided",
        "1/4 cup sweetened dried cranberries",
        "2 tablespoons frozen cranberry juice cocktail concentrate, thawed",
        "1 tablespoon red currant jelly",
        "1 13.8-ounce tube refrigerated pizza dough"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Dessert",
        "Bake",
        "Sauté",
        "Low Fat",
        "Quick & Easy",
        "Low Cal",
        "Cranberry",
        "Pear",
        "Fall",
        "Winter",
        "Low Cholesterol",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rustic Pear-Cranberry Tart",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-pear-cranberry-tart-357233"
}
