{
    "directions": [
        "To make the dough, in a large bowl, sprinkle the yeast over the warm water and let stand until foamy, about 5 minutes. Stir in the olive oil. Gradually stir in 2 cups of the flour and the salt until a soft dough forms.",
        "In the bowl of an electric mixer fitted with the dough hook, beat the dough on high speed until it is soft and smooth and no longer feels sticky, beating in more flour 1 Tbs. at a time as needed to prevent sticking, 5 to 7 minutes. Transfer the dough to a clean bowl and cover with plastic wrap. Let the dough rise until doubled in volume, 35 to 45 minutes. Punch the dough down, cover and refrigerate for at least 8 hours or up to overnight.",
        "About 2 hours before serving, bring the dough to room temperature (this will take 45 minutes to 1 hour).",
        "Preheat an oven to 450°F. Lightly oil two 12-by-15-inch baking sheets and sprinkle with the cornmeal.",
        "Scrape the dough onto a lightly floured work surface and press gently to expel any air. Divide the dough in half. Cover with a clean kitchen towel and let rest for 10 minutes. Roll or stretch one portion of dough into a 13-by-7-inch oval about 1/8 inch thick and place on a prepared baking sheet. Repeat with the remaining dough and baking sheet. Brush each oval with 1/2 Tbs. of the olive oil and sprinkle each with half of the cheese and bell pepper strips.",
        "Bake the flatbreads for 8 minutes. Remove from the oven and break 4 eggs onto each oval. Season the eggs lightly with salt and pepper. Return the flatbreads to the oven, switching the positions of the baking sheets, and bake until the crusts are well browned, 5 to 8 minutes more.",
        "In a large bowl, whisk together the remaining 1/2 Tbs. olive oil and the vinegar. Add the arugula and frisée and toss to coat. Slide each flatbread onto a cutting board and pile the greens on top, dividing evenly. Cut into wedges and serve. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "Eat Well,",
        "by Charity Ferreira (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "1 tsp. active dry yeast",
        "3/4 cup warm water (110°F)",
        "2 Tbs. olive oil",
        "2 to 2 1/4 cups all-purpose flour",
        "1/2 tsp. salt",
        "Olive oil for baking sheets, plus 1 1/2 Tbs.",
        "2 Tbs. cornmeal",
        "2/3 cup grated pecorino romano or Parmigiano-Reggiano cheese",
        "1/4 cup roasted red bell pepper strips",
        "8 eggs",
        "Salt and freshly ground pepper, to taste",
        "2 tsp. sherry vinegar or red wine vinegar",
        "1 cup baby arugula leaves",
        "1 cup frisée lettuce leaves, torn into bite-size pieces"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Rustic Flatbread with Egg, Arugula and Pecorino",
    "url": "http://www.williams-sonoma.com/recipe/rustic-flatbread-with-egg-arugula-and-pecorino.html"
}
