{
    "directions": [
        "Combine flour, salt, and sugar in large bowl. Add butter and shortening; rub in with fingertips until mixture resembles coarse meal. Mix 3 tablespoons ice water and vinegar in small bowl. Pour over flour mixture. Stir with fork until moist clumps form, adding more water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic and refrigerate at least 30 minutes.",
        "Melt butter in heavy large skillet over medium-high heat. Add apples and sauté until brown and almost tender, about 15 minutes. Reduce heat to medium; mix in cardamom. Pour 1/3 cup honey over and cook 1 minute.",
        "Position rack in top third of oven; preheat to 400°F. Roll out dough between 2 sheets of parchment paper to 12-inch round. Remove top sheet of paper. Sprinkle crust evenly with nuts. Replace paper atop crust and roll to 13-inch round, embedding nuts in dough (crust will be thin). Invert crust onto rimless baking sheet. Remove top paper. Spoon half of apple mixture over crust, leaving 2-inch plain border. Sprinkle dates over apples. Top with remaining apple mixture. Using paper as aid, fold outer edge of crust over apples (dough is delicate; press together any tears). Whisk egg and milk in bowl. Brush edges generously with egg mixture. Sprinkle crust and apples with raw sugar.",
        "Bake tart until crust begins to brown, about 15 minutes. Reduce heat to 375°F; bake until crust is golden brown, about 10 minutes longer. Loosen tart from parchment paper with spatula. Cool on baking sheet until warm, about 45 minutes.",
        "Beat cream and 2 tablespoons honey in large bowl until peaks form.",
        "Slide 9-inch-diameter removable tart pan bottom under tart and transfer to platter. Serve with honeyed whipped cream."
    ],
    "ingredients": [
        "1 1/3 cups all purpose flour",
        "1/2 teaspoon salt",
        "1/2 teaspoon sugar",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1/4 cup frozen solid vegetable shortening, cut into 1/2-inch cubes",
        "3 tablespoons (or more) ice water",
        "1/2 teaspoon apple cider vinegar",
        "3 tablespoons butter",
        "8 small Granny Smith apples (about 3 pounds), peeled, cored, each cut into 12 slices",
        "2 teaspoons ground cardamom",
        "1/3 cup plus 2 tablespoons honey",
        "2/3 cup chopped assorted nuts (such as walnuts, almonds, and pistachios)",
        "7 large Medjool dates, pitted, cut into matchstick-size strips",
        "1 large egg",
        "2 tablespoons whole milk",
        "3 tablespoons raw sugar",
        "1 cup chilled whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Date",
        "Apple",
        "Fall",
        "Honey",
        "Vegetarian",
        "Pescatarian",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rustic Apple Tart with Honey, Dates, and Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-apple-tart-with-honey-dates-and-nuts-108599"
}
