{
    "directions": [
        "Blend flour, sugar, and salt in processor until combined. Add butter; using on/off turns, cut in until mixture resembles coarse meal. Add egg yolk and wine; using on/off turns, mix just until moist clumps form. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 40 minutes and up to 2 days.",
        "Position rack in center of oven and preheat to 375°F. Roll out dough between 2 sheets of parchment paper to 12-inch round. Remove top sheet of parchment and transfer dough, with bottom parchment, to rimmed baking sheet. Place pear slices, 1 tablespoon sugar, and flour in large bowl; toss to combine. Spoon pear mixture into center of dough, leaving 1 1/2-inch border. Using parchment as aid, fold up outer edge of dough over edge of filling. Bake until pears are tender, about 20 minutes.",
        "Meanwhile, boil 1 cup wine, 1/2 cup water, and remaining 1/2 cup sugar in medium saucepan until syrup is reduced to 1/2 cup, about 10 minutes.",
        "Reduce oven temperature to 325°F. Drizzle half of syrup over filling. Continue baking tart until juices are bubbling thickly, about 20 minutes. Cool.",
        "Whisk 2 tablespoons wine into remaining syrup. Cut tart into wedges. Drizzle with syrup. Serve with ice cream."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "3 tablespoons sugar",
        "1/2 teaspoon salt",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into pieces",
        "1 large egg yolk",
        "1 tablespoon late-harvest Riesling or other sweet white dessert wine",
        "3 large ripe Anjou pears, peeled, cored, thinly sliced",
        "1 tablespoon plus 1/2 cup sugar",
        "1 tablespoon all purpose flour",
        "1 cup plus 2 tablespoons late-harvest Riesling or other sweet white dessert wine",
        "1/2 cup water",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Pear",
        "White Wine",
        "Fall",
        "Oktoberfest"
    ],
    "title": "Rustic Pear Tart with Late-Harvest Riesling",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-pear-tart-with-late-harvest-riesling-107175"
}
