{
    "directions": [
        "Preheat oven to 375°F. Using long serrated knife, cut bottom crust and short ends off bread; discard. Cut remaining bread with crust into 1-inch cubes (about 10 cups loosely packed). Place cubes in large bowl. Add oil, thyme, and garlic; toss to coat. Spread cubes out on large rimmed baking sheet. Sprinkle with salt and pepper. Bake until golden and slightly crunchy, stirring occasionally, about 20 minutes. Return cubes to same large bowl.",
        "Melt butter in large skillet over medium-high heat. Add onion, celery, and bell pepper. sauté until vegetables are soft, about 10 minutes; add parsley. DO AHEAD Bread cubes and vegetable mixture can be made 1 day ahead. Cover separately. Store bread at room temperature. Chill vegetable mixture.",
        "Preheat oven to 375°F. Butter 11x7x2-inch glass baking dish. Stir vegetable mixture into bread cubes. Gradually add hot broth, tossing to coat evenly. Season stuffing to taste with salt and pepper and transfer to prepared dish. Cover dish with buttered foil, buttered side down. Bake stuffing until heated through, about 25 minutes. Uncover and bake until top is brown, about 25 minutes longer, and serve."
    ],
    "ingredients": [
        "1 (1-pound) loaf crusty country-style white bread",
        "1/4 cup olive oil",
        "4 teaspoons chopped fresh thyme",
        "1 large garlic clove, minced",
        "6 tablespoons (3/4 stick) butter",
        "1 1/2 cups finely chopped onion",
        "1 1/2 cups thinly sliced celery",
        "1 cup finely chopped green bell pepper",
        "1/3 cup chopped fresh parsley",
        "1 3/4 cups low-salt chicken broth or turkey stock, heated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Vegetable",
        "Side",
        "Bake",
        "Sauté",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Bell Pepper",
        "Fall",
        "Thyme",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Rustic Bread Stuffing with Bell Pepper and Fresh Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-bread-stuffing-with-bell-pepper-and-fresh-thyme-236496"
}
