{
    "directions": [
        "Position rack in center of oven and preheat to 375°F. Cut bottom crust and short ends off bread and discard. Cut bread into 3/4- inch cubes; place in large bowl. Whisk oil and pressed garlic clove in small bowl. Add to bread cubes; toss to coat. Spread bread cubes in single layer on large rimmed baking sheet; sprinkle with salt and freshly ground pepper. Bake until slightly crunchy, stirring occasionally, about 15 minutes. Cool slightly, then return to same large bowl.",
        "Generously butter 13 x 9 x 2-inch glass baking dish. Melt 1 tablespoon butter in heavy large skillet over medium heat.",
        "Add pine nuts; stir until golden, about 2 minutes. Add to bowl with bread cubes. Melt remaining 3 tablespoons butter in same skillet over medium-high heat. Add onions; sauté until brown, about 10 minutes. Add mustard greens, thyme, and minced garlic; sauté until greens are wilted and tender, 3 to 4 minutes. Transfer to bowl with bread cubes. Add 2 cups stock to same skillet; boil until reduced to 1 cup, about 5 minutes. Pour stock over bread mixture and toss. Mix in currants and lemon peel. Season with salt and freshly ground black pepper. Transfer stuffing to prepared baking dish. DO AHEAD: Can be made 6 hours ahead. Cover; chill.",
        "Preheat oven to 350°F. Bake stuffing uncovered until heated through and starting to brown on top, 20 to 30 minutes. Let stand 5 minutes and serve."
    ],
    "ingredients": [
        "1 1-pound loaf pain rustique or other rustic country-style bread",
        "2 tablespoons extra-virgin olive oil",
        "2 garlic cloves; 1 pressed, 1 minced",
        "4 tablespoons (1/2 stick) butter, divided",
        "1/3 cup pine nuts",
        "2 cups chopped onions",
        "6 cups coarsely chopped stemmed red mustard greens",
        "1 tablespoon chopped fresh thyme",
        "2 cups turkey stock or low-salt chicken broth",
        "1/3 cup dried currants",
        "1/2 teaspoon finely grated lemon peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Leafy Green",
        "Onion",
        "Side",
        "Bake",
        "Thanksgiving",
        "High Fiber",
        "Stuffing/Dressing",
        "Currant",
        "Pine Nut",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Rustic Bread Stuffing with Red Mustard Greens, Currants, and Pine Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-bread-stuffing-with-red-mustard-greens-currants-and-pine-nuts-355796"
}
