{
    "directions": [
        "Blend flour, sugar, and salt in processor. Add butter and cut in using on/off turns until mixture resembles coarse meal. Add 2 tablespoons ice water; blend until moist clumps form, adding more water by teaspoonfuls if mixture is dry. Gather dough into ball; flatten into disk. Wrap dough in plastic and refrigerate at least 1 hour.",
        "Preheat oven to 400°F. Toss plums, 4 tablespoons sugar, ginger and cinnamon in bowl. Roll out dough on floured surface to 12 1/2-inch round. Transfer to rimmed baking sheet. Mix 1 tablespoon sugar and 1 tablespoon flour in small bowl; sprinkle over dough, leaving 2-inch plain border. Arrange plums in concentric circles on dough, leaving 2-inch plain border; drizzle with melted butter. Fold dough border in toward center. Brush border with egg glaze; sprinkle with 1 tablespoon sugar. Bake tart until plums are tender and crust is golden, about 45 minutes.",
        "Stir preserves in saucepan over low heat until melted. Brush over plums. Cool tart 1 hour on baking sheet. Run long thin knife under tart to loosen. Using 9-inch tart pan bottom, transfer tart to plate; serve at room temperature."
    ],
    "ingredients": [
        "1 1/4 cups all purpose flour",
        "2 tablespoons sugar",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "3 tablespoons (about) ice water",
        "1 1/2 pounds plums, halved, pitted, each half cut into 6 slices",
        "6 tablespoons sugar",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon ground cinnamon",
        "1 tablespoon all purpose flour",
        "2 tablespoons (1/4 stick) unsalted butter, melted",
        "1 egg, beaten to blend (for glaze)",
        "1/4 cup apricot preserves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Plum",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rustic Plum Tart",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-plum-tart-105191"
}
