{
    "directions": [
        "In a large skillet over medium heat, crisp the bacon until golden brown. Drain and crumble the bacon; set aside. Add butter to the pan with the bacon drippings. Add carrots, celery, onion, garlic, thyme and red pepper flakes, making sure to scrape up any bits left over from the bacon. Season with salt and pepper. Allow the vegetables to cook for 10-15 minutes, or until slightly tender but still firm.",
        "Add the chicken and the flour to the vegetables. Mix to combine. Add the chicken stock and bring the mixture to a boil to thicken. Once the filling has thickened and most of the liquid has evaporated, take the skillet off the heat. Stir in half of the cheese. Season with salt and pepper to taste.",
        "Lightly dust your work surface with flour. Roll out 1 sheet of the puff pastry until it is large enough to cover a 9-inch dish. Place the pastry in the greased 9-inch dish. Fill pastry with filling. Top with the remaining cheese and bacon. Roll out the remaining sheet of puff pastry. Gently score the pastry in a crisscross pattern with a paring knife and place the pastry on top of the filling. Fold over and tuck in any remaining pastry.",
        "Brush with the slightly beaten egg. Place in the refrigerator for 15-30 minutes. Place the chilled potpie on a rimmed baking sheet lined with Reynolds Wrap® Aluminum Foil. Bake in a 400 degree F oven for 20-25 minutes or until golden and puffy. Serve immediately."
    ],
    "ingredients": [
        "2 strips bacon",
        "4 tablespoons unsalted butter plus additional for greasing",
        "2 medium carrots, chopped",
        "2 stalks celery, chopped",
        "1 medium onion, chopped",
        "3 cloves garlic, finely chopped",
        "3 sprigs fresh thyme, leaves only",
        "1 teaspoon red pepper flakes",
        "1 (3 1/2) pound roasted chicken, meat hand-torn into bite-size pieces",
        "2 tablespoons all-purpose flour plus additional for dusting pastry",
        "1 cup chicken stock",
        "2 cups shredded white Cheddar cheese, divided",
        "1 (17.5 ounce) package frozen puff pastry, thawed",
        "1 egg, slightly beaten",
        "Salt and black pepper to taste",
        "Reynolds Wrap® Aluminum Foil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rustic Chicken Pot Pie",
    "url": "http://allrecipes.com/recipe/245242/rustic-chicken-pot-pie/"
}
