{
    "directions": [
        "Cut butter into bits and in a bowl with a pastry blender or in a food processor blend or pulse together with, flour, sugar, and salt until mixture resembles coarse meal. Add 2 tablespoons ice water and toss or pulse until incorporated. Add enough remaining ice water, 1 tablespoon at a time, tossing with a fork or pulsing to incorporate, to form a dough. Gather dough into a ball. On a work surface smear dough with heel of hand in 3 or 4 forward motions to make dough easier to work with. Form dough into a ball and flatten into a disk. Chill dough, wrapped in plastic wrap, 1 hour.",
        "Preheat oven to 375°F.",
        "Halve and pit plums. Cut plums into 3/4-inch-thick wedges and in a bowl toss with sugar, cornstarch, and lemon juice.",
        "On a lightly floured surface with floured rolling pin roll out dough into an 11-inch round (about 1/8 inch thick). Transfer dough to a 9-inch (1-quart) glass pie plate. (Do not trim overhang.) Spoon filling into shell and fold edge of dough over filling, leaving center uncovered. Bake pie in middle of oven 35 minutes. Brush crust with milk and sprinkle with sugar. Bake pie 10 minutes more, or until filling is bubbling and crust is golden. Cool pie on a rack."
    ],
    "ingredients": [
        "1 stick (1/2 cup) plus 1 tablespoon cold unsalted butter",
        "1 1/4 cups all-purpose flour",
        "2 tablespoons sugar",
        "1/2 teaspoon salt",
        "3 to 5 tablespoons ice water",
        "3/4 pound Italian prune plums",
        "2/3 cup sugar",
        "1 1/2 tablespoons cornstarch",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon milk",
        "1 tablespoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Thanksgiving",
        "Vegetarian",
        "Plum",
        "Summer",
        "Pastry",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rustic Plum Pie",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-plum-pie-100775"
}
