{
    "directions": [
        "Combine first 5 ingredients in processor and blend 5 seconds. Add butter; using on/off turns, blend just until butter is reduced to pea-size pieces. (To ensure a flaky crust, be careful not to overwork the butter.) Add 1/3 cup ice water. Using on/off turns, blend until dough comes together in moist clumps, adding more water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap; chill at least 1 hour. (Can be made 1 day ahead. Chill. Let soften slightly at room temperature before rolling out.)",
        "Roll out dough on lightly floured sheet of parchment paper to 14-inch round, turning dough occasionally to prevent sticking. Slide rimless baking sheet under parchment. Transfer dough on parchment to refrigerator. Chill until dough firms slightly, about 30 minutes.",
        "Stir sugar and cornstarch in medium bowl to blend. Mix in fruit and vanilla. Let stand until juices are released, stirring fruit occasionally, about 30 minutes.",
        "Preheat oven to 375°F. Transfer baking sheet with dough to work surface. Let stand 8 minutes to allow dough to soften slightly if too firm to fold. Spoon fruit and juices into center of dough. Arrange fruit in even 10-inch-diameter layer in center. Brush 2-inch border of dough with egg glaze. Lift about 2 inches of dough border and pinch to form vertical seam. Continue around tart, pinching seam every 2 inches to form standing border. Fold border down over fruit (center 6 inches of fruit remain uncovered). Brush folded border with egg glaze; sprinkle with raw sugar.",
        "Place baking sheet with tart in oven. Bake until crust is golden brown and fruit filling is bubbling at edges, about 55 minutes. Remove from oven; slide large metal spatula under tart to loosen from parchment. Brush fruit with preserves. Slide tart onto rack. Cool 45 minutes. Serve warm or at room temperature with ice cream.",
        "Available at Italian markets, natural foods stores, and some supermarkets."
    ],
    "ingredients": [
        "1 2/3 cups all purpose flour",
        "1/4 cup polenta (coarse cornmeal)*",
        "3 tablespoons sugar",
        "1 teaspoon (packed) grated orange peel",
        "3/4 teaspoon salt",
        "14 tablespoons (1 3/4 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "1/3 cup (or more) ice water",
        "1/4 cup sugar",
        "1 1/2 teaspoons cornstarch",
        "4 medium nectarines, each pitted and cut into 16 slices",
        "1 1/2-pint basket blackberries",
        "1/2 teaspoon vanilla extract",
        "1 egg, beaten to blend (for glaze)",
        "Raw sugar crystals",
        "Peach preserves, heated",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Dessert",
        "Bake",
        "Blackberry",
        "Nectarine",
        "Summer"
    ],
    "title": "Rustic Nectarine and Blackberry Crostata with Cornmeal Crust",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-nectarine-and-blackberry-crostata-with-cornmeal-crust-106869"
}
