{
    "directions": [
        "Mix flour, sugar, grated lemon peel, salt and ground mace in processor. Add butter and cut in using on/off turns until mixture resembles coarse meal. Mix yolk and water in small bowl. Add to processor and mix in using on/off turns until large moist clumps form. Gather dough into ball; flatten into disk. Wrap in waxed paper and freeze 10 minutes.",
        "Butter 9-inch metal pie plate. Roll out dough between sheets of waxed paper to 13-inch round. Peel off top sheet of paper. Invert dough into prepared pan; peel off paper. Fold in edges to form double thickness. Crimp edges decoratively. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 375°F. Finely chop slivered almonds in processor. Spread almonds on bottom of crust. Combine apples and pears in large bowl. Mix sugar, grated lemon peel and ground mace in small bowl. Toss half of sugar mixture with apples and pears. Pile into crust. Sprinkle remaining sugar mixture over fruit. Dot with 1 1/2 tablespoons butter.",
        "Bake until crust is brown and filling bubbles, about 1 hour. Cool on rack.",
        "Beat cream, sugar and schnapps in large bowl until medium-stiff peaks form. (Can be prepared 4 hours ahead. Cover and chill.)",
        "Serve tart warm or at room temperature with whipped cream."
    ],
    "ingredients": [
        "1 1/3 cup all purpose flour",
        "3 tablespoons sugar",
        "1 1/2 teaspoons grated lemon peel",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground mace",
        "7 tablespoons cold butter, cut into 1/2-inch pieces",
        "1 large egg yolk",
        "2 tablespoons ice water",
        "1/2 cup slivered almonds, toasted",
        "2 large Golden Delicious apples, peeled, cored, cut into 1/2-inch-thick wedges",
        "2 Bartlett pears, peeled, cored, cut into 1/2-inch-thick wedges",
        "1/2 cup sugar",
        "1 1/2 teaspoons grated lemon peel",
        "1/4 teaspoon ground mace",
        "1 1/2 tablespoons butter",
        "1 cup chilled whipping cream",
        "2 tablespoons sugar",
        "2 tablespoons pear schnapps or brandy"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Apple",
        "Pear",
        "Almond",
        "Fall",
        "Kidney Friendly"
    ],
    "title": "Rustic Pear and Apple Tart",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-pear-and-apple-tart-2491"
}
