{
    "directions": [
        "Stir cumin seeds in small skillet over medium heat until starting to smoke and pop, about 4 minutes. Pour seeds onto plate; cool. Grind finely in spice mill. DO AHEAD: Can be made 1 week ahead. Chill in airtight container.",
        "Heat oil in large pot over medium heat. Add onions. Cover and cook until tender but not brown, stirring often, about 8 minutes. Remove from heat. Using garlic press, squeeze in garlic. Add achiote and allspice. Stir over low heat 1 minute. Add tomatoes with juice, broth, and guajillo chile. Bring to simmer. Reduce heat to low; cover and simmer 15 minutes.",
        "Working in 2-cup batches, blend soup in processor to coarse puree (some texture should remain). Return to same pot. Mix in 11/2 teaspoons toasted cumin; season with cayenne, if desired, and coarse salt and freshly ground black pepper. DO AHEAD: Can be made 2 days ahead. Chill uncovered until cold, then cover and keep chilled.",
        "Pour enough oil into heavy medium saucepan to reach depth of 3/4 inch. Heat oil over medium heat 4 minutes. Fry half of tortilla strips until just golden. Using slotted spoon, transfer strips to paper towels to drain (color will darken slightly). Repeat with remaining strips.",
        "Heat 1 1/2 tablespoons tortilla-frying oil from saucepan in medium skillet over medium-high heat. Add mini peppers. Toss until tender, about 2 minutes. Sprinkle with salt and freshly ground black pepper. DO AHEAD: All rajas can be made 2 hours ahead. Let stand at room temperature.",
        "Reheat soup over medium heat. Ladle into bowls. Top with tortilla and pepper rajas and sprinkle with toasted cumin. Serve, passing additional cumin separately.",
        "A paste made from achiote seeds; sold at Latin markets.",
        "** A maroon-colored, fairly hot dried chile up to 6 inches long and about 11/2 inches wide; available at some supermarkets and at Latin markets."
    ],
    "ingredients": [
        "2 tablespoons cumin seeds",
        "6 tablespoons olive oil",
        "4 cups chopped onions (about 2 large)",
        "6 large garlic cloves, peeled",
        "2 teaspoons achiote paste*",
        "1/4 teaspoon ground allspice",
        "2 28-ounce cans peeled whole tomatoes with basil in juice, tomatoes diced, all juice reserved",
        "4 cups low-salt chicken broth",
        "1 3-to 4-inch dried guajillo chile,** stemmed, seeded, coarsely torn",
        "Cayenne pepper (optional)",
        "Coarse kosher salt",
        "Vegetable oil (for frying)",
        "4 4-inch corn tortilla squares (cut from round tortillas), halved, cut into 2 x 1/4-inch strips",
        "1 5-ounce package mini bell peppers, stemmed, seeded, cut into thin strip"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Onion",
        "Tomato",
        "Appetizer",
        "Hanukkah",
        "Low Cal",
        "High Fiber",
        "Bell Pepper",
        "Deep-Fry",
        "Tortillas",
        "Cumin",
        "Chile Pepper",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Rustic Tomato Soup with Toasted Cumin and Mini Rajas",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-tomato-soup-with-toasted-cumin-and-mini-rajas-356360"
}
