{
    "directions": [
        "Put oven rack in lower third of oven and preheat oven to 425°F.",
        "Cook 1/3 cup sugar in a dry 10-inch heavy skillet over moderate heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally with a fork, until sugar is melted into a pale golden caramel. Tilt skillet and carefully pour in cider and vinegar (caramel will harden and steam vigorously). Simmer over moderately low heat, stirring occasionally, until caramel is dissolved.",
        "While syrup simmers, cut apples into 1/8-inch-thick slices with slicer, rotating around core of each (discard cores). Add apple slices to hot syrup in skillet, gently tossing to coat. Remove from heat and let stand, stirring occasionally, until apples are wilted by syrup, 5 to 10 minutes.",
        "While apples stand, roll out puff pastry sheet into a 12-inch square on a lightly floured surface with a floured rolling pin. Cut into quarters, forming 4 (6-inch) squares and brush off excess flour from both sides.",
        "Transfer squares to a large shallow baking pan, overlapping if necessary (squares will fit without touching after edges are folded in later).",
        "Drain apples in a sieve set over a bowl (reserve syrup), then mound slices decoratively on each square, leaving a 3/4-inch border all around. Fold border over apples along edges, pinching edges together as necessary, then dot tops of apples with a total of 1 tablespoon butter and sprinkle with remaining 1/2 tablespoon sugar.",
        "Bake tarts until apples are tender, pastry is puffed, and edges and undersides are golden brown, 25 to 30 minutes.",
        "While tarts bake, boil reserved syrup in skillet with Calvados and remaining 2 tablespoons butter until thickened and reduced to about 1/3 cup. Brush or drizzle hot syrup over tarts.",
        "Beat cream with sugar and Calvados in a chilled bowl with a whisk or electric mixer until cream holds soft peaks. Serve with tarts."
    ],
    "ingredients": [
        "1/3 cup plus 1/2 tablespoon sugar",
        "1/2 cup apple cider or apple juice",
        "1 tablespoon cider vinegar",
        "1 lb small Gala apples (about 4; left unpeeled)",
        "1 frozen puff pastry sheet (from a 17 1/4-oz package), thawed",
        "3 tablespoons unsalted butter",
        "1 tablespoon Calvados",
        "1/2 cup chilled heavy cream",
        "1 teaspoon sugar",
        "1 teaspoon Calvados",
        "Special equipment: an adjustable-blade slicer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fruit",
        "Dessert",
        "Bake",
        "Apple",
        "Calvados",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rustic Apple Tarts with Calvados Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-apple-tarts-with-calvados-whipped-cream-235777"
}
