{
    "directions": [
        "Whisk together 1 1/2 cups all-purpose flour and whole-wheat flour, salt, and baking powder in a medium bowl; set aside.",
        "Simmer lemon juice and zest in a small skillet over medium heat until syrupy and golden, 1-2 minutes, stirring frequently.",
        "Using an electric mixer, beat butter, both sugars, and lemon reduction on medium-high speed until fluffy, about 3 minutes. Add whole egg and yolk and beat until just combined. Reduce speed to low and gradually add flour mixture; beat until just combined.",
        "Preheat oven to 350°F.",
        "Transfer dough to a work surface, flatten into a disc, then wrap in plastic and freeze for 10 minutes. Roll dough on a lightly floured surface to a 12\" round, about 1/4-inch thick. Fit dough into tart pan, pressing it into the fluted sides. If the dough breaks, just press it back together with your fingers. Trim the excess by running a rolling pin over the tart pan. Prick the pastry several times with a fork and freeze tart shell until firm, about 15 minutes. Bake on the middle rack until the tart shell is golden and dry, 30 minutes. Let cool completely.",
        "Reduce oven temperature to 275°F.",
        "Combine cream, lemon zest, and 1/4 cup sugar in a medium saucepan and bring just to a simmer.",
        "Whisk egg yolks and remaining 1/4 cup sugar together in a medium bowl. Gradually whisk in hot cream. Add lemon juice and strain mixture into a heat-proof pitcher or large measuring cup with spout.",
        "Set tart pan on a sturdy baking sheet and pour in filling. Bake until custard is just set when jiggled, about 1 hour (the filling should not start to brown). Cool to room temperature on a wire rack, then refrigerate until completely chilled, at least 4 hours.",
        "Meanwhile make the Pine Nut Lace Cookies: Preheat oven to 350°F and line a cookie sheet with parchment.",
        "Using a wooden spoon, stir butter and corn syrup in a medium bowl until smooth. Add sugar and stir to thoroughly combine. Add flour and pine nuts and stir until blended and smooth.",
        "Working in batches, scoop level teaspoons batter onto baking sheet 2 inches apart, allowing room for the cookies to spread. Bake until cookies are golden and lacy, 8–10 minutes. Let cool on baking sheet and then transfer to a plate. Wipe parchment and repeat with remaining batter.",
        "Cut torta into wedges and garnish each slice with toasted pine nuts, candied lemon zest, and Pine Nut Lace Cookies.",
        "Torta can be refrigerated up to 1 day before serving and Pine Nut Lace Cookies can be stored in an airtight container at room temperature for up to 1 day before serving."
    ],
    "ingredients": [
        "1 1/2 cups (6 ounces) all-purpose flour, plus more for surface",
        "1 cup (4 ounces) whole-wheat flour",
        "1/4 teaspoon salt",
        "1/4 teaspoon baking powder",
        "1/3 cup lemon juice",
        "1 teaspoon grated lemon zest",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/3 cup turbinado sugar",
        "1/3 cup confectioners' sugar",
        "1 large egg",
        "1 large egg yolk",
        "1 3/4 cups heavy cream",
        "Grated zest of 1 lemon (about 1 teaspoon)",
        "1/2 cup sugar, divided",
        "12 large egg yolks",
        "1/3 cup fresh lemon juice",
        "6 tablespoons unsalted butter, room temperature",
        "2 tablespoons light corn syrup",
        "5 tablespoons sugar",
        "1/4 cup all-purpose flour",
        "6 tablespoons (1 3/4 ounces) pine nuts, finely chopped",
        "1/2 cup toasted pine nuts, for garnish",
        "1/4 cup candied julienned lemon zest or thinly sliced candied lemon peel",
        "A 10-inch round fluted tart pan with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Cookies",
        "Lemon",
        "Kid-Friendly",
        "Christmas",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rustic Lemon Tart (*Torta Della Nonna al Limone*) With Pine Nut Lace Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-lemon-tart-torta-della-nonna-al-limone-with-pine-nut-lace-cookies"
}
