{
    "directions": [
        "Put oven rack in middle position and preheat oven to 375°F. Butter a 13- by 9-inch baking pan (2 inches deep) and line with 2 crisscrossed sheets of foil, leaving a 2-inch overhang on all sides. Butter foil.",
        "Whisk together flour, sugar, baking powder, and salt, then blend in butter with your fingertips or a pastry blender (or pulse in a food processor) until mixture resembles coarse meal with pea-size butter lumps. Add egg and stir with a fork (or pulse) until a ball begins to form.",
        "Turn out dough onto a work surface and divide into 4 portions. With heel of your hand, smear each portion once or twice in a forward motion. Gather dough together with scraper.",
        "Press dough evenly onto bottom (but not up sides) of baking pan and bake until edges are golden and begin to pull away from sides of pan, 15 to 25 minutes. Cool in pan on a rack, about 40 minutes.",
        "Reduce oven temperature to 350°F. Toast almonds and hazelnuts on separate sides of a shallow baking pan until fragrant and golden on the inside, 8 to 10 minutes. Rub hazelnuts in a kitchen towel to remove any loose skins (some skins may remain).",
        "Increase oven temperature to 375°F.",
        "Bring honey, brown sugar, and salt to a boil in a 3- to 4-quart heavy saucepan over moderate heat, stirring until sugar is dissolved, then boil, without stirring, 2 minutes. Add butter and cream and boil, stirring, 1 minute. Remove from heat and stir in all nuts until coated.",
        "Spread mixture evenly over crust and bake until topping is caramelized and bubbling, 15 to 25 minutes. Cool completely in pan on a rack. Lift dessert out of pan using foil overhang and cut into 64 bars. Peel bars from foil."
    ],
    "ingredients": [
        "2 1/3 cups all-purpose flour",
        "1/2 cup sugar",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1 1/2 sticks (3/4 cup) cold unsalted butter, cut into pieces",
        "1 large egg, lightly beaten",
        "1 cup whole almonds with skins (3 oz)",
        "1 cup hazelnuts (4 oz)",
        "2/3 cup mild honey",
        "1/2 cup packed light brown sugar",
        "1/4 teaspoon salt",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into pieces",
        "2 tablespoons heavy cream",
        "1 cup salted roasted cashews (6 oz)",
        "1 cup salted roasted shelled pistachios (5 oz)",
        "Special equipment: a pastry or bench scraper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Christmas",
        "Almond",
        "Cashew",
        "Pistachio",
        "Honey",
        "Hazelnut",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Rustic Nut Bars",
    "url": "http://www.epicurious.com/recipes/food/views/rustic-nut-bars-233301"
}
