{
    "directions": [
        "Combine carrots, rutabaga, onion, chicken stock, 3 tablespoons butter, brown sugar, and nutmeg in a large saucepan; bring to a boil. Reduce heat, partially cover saucepan with a lid, and simmer, stirring occasionally, until vegetables are very tender, about 45 minutes.",
        "Transfer vegetables using a slotted spoon to a food processor or blender. Continue to cook remaining broth mixture in saucepan over high heat, stirring constantly, until liquid reduced to about 1 tablespoon, 2 to 3 minutes. Add reduced broth mixture to vegetables in food processor; blend until very smooth. Transfer mixture to a bowl and cool to room temperature.",
        "Stir eggs, flour, baking powder, salt, and pepper into pureed vegetable mixture until evenly combined; spoon into a buttered 6-cup casserole or souffle dish.",
        "Melt remaining 1 tablespoon butter in a saucepan over low heat; stir in pecans until fragrant and coated, 1 to 2 minutes. Spread buttered pecans around the edge the vegetable mixture, creating a border. Cover dish with plastic wrap and refrigerate, 8 hours to overnight.",
        "Bring vegetable mixture to room temperature, about 30 minutes before baking.",
        "Preheat oven to 350 degrees F (175 degrees C). Remove plastic wrap from casserole dish.",
        "Bake in the preheated oven until puffed, set in the middle, and golden brown, about 30 minutes."
    ],
    "ingredients": [
        "4 carrots, peeled and cut into 1/2-inch chunks",
        "1 rutabaga, peeled and cut into 1/2-inch chunks",
        "1/2 onion, chopped",
        "1 1/2 cups chicken stock",
        "1/4 cup butter, divided",
        "1 tablespoon brown sugar",
        "1 pinch freshly grated nutmeg",
        "2 eggs, slightly beaten",
        "1 tablespoon all-purpose flour, or as needed",
        "2 tablespoons baking powder",
        "salt and ground black pepper to taste",
        "1/2 cup finely chopped pecans"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Rutabaga and Carrot Puff",
    "url": "http://allrecipes.com/recipe/234649/rutabaga-and-carrot-puff/"
}
