{
    "directions": [
        "Stir together yeast and warm water in bowl of a standing electric mixer fitted with paddle attachment and let stand until foamy, about 5 minutes. Add rye flour, 1 cup all-purpose flour, caraway, and salt and beat at medium speed until incorporated. Attach dough hook to mixer and gradually beat in remaining 2/3 cup flour at medium speed. Beat dough until it begins to pull away from side of bowl, then beat 5 minutes more.",
        "Gather dough into a ball and put in a lightly oiled large bowl, turning dough to coat with oil. Cover bowl with plastic wrap and let dough rise at room temperature until doubled in bulk, about 1 1/2 hours.",
        "Preheat oven to 400°F.",
        "Punch down dough and divide in half. Flatten dough with lightly floured fingers to form 2 (6- by 4-inch) rectangles and let stand 3 minutes. Roll out each piece of dough on a floured surface into a 15- by 10-inch rectangle (1/8 inch thick). Transfer each rectangle to a lightly oiled large baking sheet, trimming any overhang. Cover each rectangle with a dampened kitchen towel or with plastic wrap and let stand 15 minutes.",
        "Make perforated lines lengthwise and crosswise on rectangles, about 2 inches apart, with tines of a fork (to facilitate breaking crispbreads into crackers). Bake in upper and lower thirds of oven, switching position of sheets halfway through baking, until golden brown and crisp, about 20 minutes total. Transfer to racks and cool. Break each crispbread into about 24 (roughly 2-inch) crackers.",
        "Stir together crème fraîche, dill, pepper, and salt. Spoon 1/2 teaspoon crème fraîche onto each cracker, then drape a piece of salmon on top and sprinkle with zest."
    ],
    "ingredients": [
        "1 teaspoon active dry yeast (from a 1/4-oz package)",
        "1 cup warm water (105–115°F)",
        "1 cup rye flour",
        "1 2/3 cups unbleached all-purpose flour",
        "1 tablespoon caraway seeds, toasted and finely ground in an electric coffee/spice grinder",
        "1 1/2 teaspoons kosher salt",
        "1/2 cup crème fraîche",
        "2 tablespoons chopped fresh dill",
        "1/2 teaspoon black pepper",
        "1/4 teaspoon salt",
        "4 oz thinly sliced fine-quality smoked salmon, cut into 1-inch pieces",
        "1 teaspoon finely grated fresh orange zest",
        "Garnish: fresh dill sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Fish",
        "Bake",
        "Cocktail Party",
        "Salmon",
        "Dill",
        "Caraway",
        "Gourmet"
    ],
    "title": "Rye Crispbread Crackers with Pepper-Dill Crème Fraîche and Smoked Salmon",
    "url": "http://www.epicurious.com/recipes/food/views/rye-crispbread-crackers-with-pepper-dill-creme-fraiche-and-smoked-salmon-105902"
}
