{
    "directions": [
        "Preheat oven to 350°. Brush a shallow 3-quart baking dish and a sheet of foil with oil. Place bread in a very large bowl.",
        "Toast seeds on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool; add to bowl with bread.",
        "Heat 2 tablespoons oil in a large skillet over medium-high. Add half of mushrooms, season with salt and pepper, and cook, tossing occasionally, until softened, 6–8 minutes. Transfer to bowl. Repeat with 2 tablespoons oil and remaining mushrooms.",
        "Heat 1/4 cup oil in skillet. Add celery and shallots, season with salt and pepper, and cook, stirring often, until shallots are golden brown and soft, 8–10 minutes. Add kale, sage, and rosemary and cook, tossing often, until kale is wilted, about 2 minutes. Transfer to bowl.",
        "Reduce heat to medium and cook wine in skillet, scraping up any browned bits, until almost all evaporated, about 1 minute. Drizzle over bread mixture.",
        "Whisk eggs, 2 cups stock, and 1/2 cup oil in a medium bowl; pour over bread mixture. Season with salt and pepper and toss, adding more stock 1/4-cupful at a time as needed (you may not use it all), until combined and bread is hydrated. Transfer to prepared dish and drizzle with oil.",
        "Cover with oiled foil; bake until a paring knife inserted into the center comes out hot, 30–35 minutes. Increase oven temperature to 450°. Uncover and bake until top is golden brown and crisp, 20–25 minutes. Let sit 10 minutes before serving.",
        "Do ahead: Stuffing can be assembled 1 day ahead. Cover and chill."
    ],
    "ingredients": [
        "4 tablespoons plus 3/4 cup olive oil, divided, plus more",
        "10 cups coarsely torn seeded rye, dried out overnight",
        "1/4 cup raw pumpkin seeds (pepitas)",
        "1 pound mixed mushrooms (such as maitake, oyster, or crimini), cut into large pieces",
        "Kosher salt, freshly ground pepper",
        "4 celery stalks, chopped",
        "6 medium shallots, chopped",
        "1 bunch kale, ribs and stems removed, leaves torn",
        "2 tablespoons finely chopped fresh sage",
        "1 tablespoon chopped fresh rosemary",
        "1/2 cup dry white wine",
        "2 large eggs",
        "3 cups chicken stock or low-sodium chicken broth, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Side",
        "Thanksgiving",
        "Kid-Friendly",
        "Stuffing/Dressing",
        "Kale",
        "Seed",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Rye, Kale, Mushroom, and Pumpkin Seed Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/rye-kale-mushroom-and-pumpkin-seed-stuffing-51255160"
}
