{
    "directions": [
        "In a large bowl cover rice noodles with cold water and soak 30 minutes, or until softened. Drain noodles.",
        "While noodles are soaking, wrap tofu in paper towels and put a heavy weight, such as a skillet, on top. Let tofu stand 30 minutes to press out any excess liquid.",
        "In a small bowl combine tamarind and 1/4 cup hot water and let stand, stirring occasionally, 20 minutes. Strain tamarind mixture through a fine sieve into another bowl, pressing hard on solids and scraping bottom of sieve, and discard solids. Stir in brown sugar until dissolved.",
        "Cut tofu into 1/2-inch dice. Put cornstarch and half of egg in separate bowls. In a heavy saucepan at least 4 inches deep heat 2 1/2 cups oil (about 1 inch) over moderately high heat to 360°F. on a deep-fat thermometer. Dredge a small batch of tofu in cornstarch, shaking off excess, and dip in egg, letting excess drip off. Carefully drop coated tofu, 1 piece at a time, into hot oil and fry until golden. Transfer tofu with a slotted spoon as fried to paper towels to drain. Coat and fry remaining tofu in the same manner.",
        "In a 12-inch heavy skillet heat 2 tablespoons oil over moderate heat until hot but not smoking and stir-fry garlic until fragrant, about a few seconds. Add shrimp, radish, and fried tofu and stir-fry 3 minutes. Add remaining egg and stir-fry until egg sets. Add noodles, tamarind mixture, remaining 2 tablespoons oil, and fish sauce, tossing. Cook mixture, stirring, until noodles are al dente and most of cooking liquid is absorbed, about 5 minutes. Add bean sprouts, chives, and red pepper flakes, tossing to combine well.",
        "Mound noodles on a serving plate and sprinkle with peanuts and chives. Arrange bean sprouts and lime wedges around noodles."
    ],
    "ingredients": [
        "1/2 pound dried flat rice noodles* (sen lek or kway tio, about 1/4 to 1/2 inch wide)",
        "a 1/4-pound piece firm tofu, rinsed, patted dry, and hard edges trimmed",
        "1 tablespoon tamarind* (from a pliable block)",
        "1 teaspoon firmly packed brown sugar",
        "1/4 cup cornstarch for dredging",
        "2 large eggs, beaten lightly",
        "1/4 cup vegetable oil plus about 2 1/2 cups for frying tofu",
        "4 garlic cloves, minced",
        "1/4 cup dried small shrimp*",
        "1 tablespoon chopped pickled salted radish*(hau pak kad khem, usually sold in plastic packages)",
        "2 tablespoons Asian fish sauce* (preferably naam pla), or to taste",
        "1 cup fresh bean sprouts, rinsed and drained",
        "1/4 cup chopped fresh chives",
        "1 teaspoon dried hot red pepper flakes",
        "1 tablespoon chopped roasted peanuts",
        "1/4 cup chopped fresh chives",
        "1 cup fresh bean sprouts, rinsed and drained",
        "1 lime, cut into wedges",
        "*available at some Asian markets, and specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pasta",
        "Stir-Fry",
        "Shrimp",
        "Tofu",
        "Gourmet",
        "California"
    ],
    "title": "Paad Thai Pailin",
    "url": "http://www.epicurious.com/recipes/food/views/paad-thai-pailin-11411"
}
