{
    "directions": [
        "In a large bowl soak the noodles in cold water to cover for 30 minutes, or until they are softened, and drain them well. In a small bowl stir together the fish sauce, the ketchup, the vinegar, the brown sugar, and the cayenne.",
        "In a wok or non-stick skillet heat 1 tablespoon of the oil over moderate heat until it is hot but not smoking, add the eggs, and cook them, stirring, until they are scrambled and just cooked through. Transfer the eggs to a bowl and break them into pieces with a spoon.",
        "In the wok or a large heavy skillet heat the remaining 2 tablespoons oil over moderately high heat until it just begins to smoke and in it stir-fry the garlic and the shallots until the mixture is golden. Add the shrimp and stir-fry the mixture 1 to 2 minutes, or until the shrimp are just cooked through. Add the ketchup mixture, the noodles, 2 cups of the bean sprouts, the scallions, and the water and cook the mixture, stirring, for 3 to 5 minutes, or until the noodles are tender and the excess liquid is evaporated. Add the egg, toss the mixture well, and mound it on a platter.",
        "Sprinkle the noodle mixture with the peanuts and the red pepper flakes and arrange the remaining 1 cup bean sprouts around it. Garnish the dish with the chilies, the coriander sprigs, and the lime wedges."
    ],
    "ingredients": [
        "3/4 pound dried flat rice noodles* (about 1/4 to 1/2 inch wide)",
        "3 tablespoons Asian fish sauce such as naam pla*",
        "3 tablespoons ketchup",
        "2 tablespoons rice vinegar",
        "1 1/2 tablespoons firmly packed brown sugar",
        "1/4 teaspoon cayenne, or to taste",
        "3 tablespoons vegetable oil",
        "3 large eggs, beaten lightly",
        "8 garlic cloves, minced",
        "4 shallots, minced (about 1/2 cup)",
        "3/4 pound medium shrimp, peeled, deveined, and cut into 1/2-inch pieces",
        "3 cups fresh bean sprouts, rinsed and spun dry",
        "4 scallions, halved lengthwise and cut crosswise into 1-inch pieces",
        "3/4 cup water",
        "1/3 cup crushed roasted peanuts (use a rolling pin)",
        "1/4 teaspoon dried hot red pepper flakes",
        "small fresh red chilies if desired",
        "fresh coriander sprigs if desired",
        "lime wedges",
        "*available at Asian markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Egg",
        "Pasta",
        "Shellfish",
        "Stir-Fry",
        "Peanut",
        "Shrimp",
        "Hot Pepper",
        "Gourmet"
    ],
    "title": "Paad Thai",
    "url": "http://www.epicurious.com/recipes/food/views/paad-thai-12713"
}
