{
    "directions": [
        "Sprinkle chicken with salt and pepper. Heat oil in heavy large skillet over medium-high heat. Add chicken, skin side down, to skillet and cook until golden, about 7 minutes per side. Transfer chicken to plate. Add onions and garlic to drippings in skillet; sauté until onions are slightly softened, 7 to 8 minutes. Add wine and saffron to skillet; bring to boil. Continue to boil until liquid is thickened and reduced by less than half, about 8 minutes. Add 2 cups chicken broth to skillet. Return chicken to skillet; bring to boil. Reduce heat to low. Cover; simmer gently until chicken is very tender (adjust heat to prevent boiling and turn chicken over after 30 minutes), about 1 hour total. Transfer chicken to plate and cool.",
        "Reserve skillet with juices. Remove skin and bones from chicken and discard. Tear chicken meat into bite-size pieces; place in medium bowl and reserve.",
        "Cook pasta in pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain; return to pot.",
        "Meanwhile, spoon off fat from juices in skillet; discard fat. Add cream to juices in skillet and boil until sauce is reduced to 2 1/2 cups and is thick enough to coat spoon, about 10 minutes. Stir in 2 tablespoons lemon juice, then chicken pieces. Stir over medium heat until heated through, adding more broth by 1/4 cupfuls to thin sauce as needed and adding more lemon juice by teaspoonfuls, if desired, about 5 minutes. Season with salt and pepper. Add chicken mixture to pasta in pot and toss to coat. Stir in basil. Transfer pasta to plates.",
        "Serve a floral, fruity white, like the Montinore Estate 2008 \"Almost Dry\" Riesling (Oregon, $12)."
    ],
    "ingredients": [
        "2 1/2 to 2 3/4 pounds chicken thighs with skin and bones",
        "2 tablespoons olive oil",
        "2 cups chopped white onions",
        "6 garlic cloves, peeled, crushed",
        "2 cups dry white wine",
        "1 teaspoon saffron threads, crushed",
        "2 cups (or more) low-salt chicken broth",
        "1 pound paccheri (giant rigatoni) or regular rigatoni",
        "1 cup heavy whipping cream",
        "2 tablespoons (or more) fresh lemon juice",
        "2/3 cup chopped fresh basil",
        "Ingredient info: Paccheri is available at markethallfoods.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chicken",
        "Pasta",
        "Braise",
        "High Fiber",
        "Dinner",
        "Saffron",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Paccheri Pasta with Braised Chicken and Saffron Cream",
    "url": "http://www.epicurious.com/recipes/food/views/paccheri-pasta-with-braised-chicken-and-saffron-cream-360710"
}
