{
    "directions": [
        "Place tofu on several layers of paper towels. Cover with more paper towels. Let drain, pressing down occasionally, about 30 minutes.",
        "Heat a nonstick skillet over medium heat; spray with cooking spray. Add garlic; cook and stir until fragrant, about 1 minute. Transfer to a large bowl. Cook and stir onion and green onions until softened, about 5 minutes. Stir into garlic in the bowl. Cook red cabbage until slightly tender, about 3 minutes. Add to garlic and onion mixture. Cook eggs, stirring frequently, until scrambled, about 3 minutes. Stir into bowl.",
        "Stir 1/4 cup peanut butter, chili sesame oil, lime juice, soy sauce, chili-garlic sauce, tamarind paste, and lime zest into bowl; toss until vegetable and egg mixture is evenly coated.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Spoon a small amount of filling into the middle of an egg roll wrapper. Fold over bottom and sides to enclose filling. Roll wrapper upwards to a form a neat roll shape. Use a pea-sized dot of peanut butter on the flap to seal. Repeat with remaining filling and wrappers.",
        "Arrange rolls on a baking sheet. Lightly spray all sides with cooking spray.",
        "Bake in the preheated oven until edges are slightly browned, 15 to 20 minutes."
    ],
    "ingredients": [
        "1 (12 ounce) package extra-firm tofu, cut into small cubes",
        "cooking spray (such as Pam®)",
        "4 cloves garlic, diced",
        "1/4 onion, diced",
        "1/2 cup chopped green onions",
        "1/2 small head red cabbage, chopped",
        "2 eggs, beaten",
        "1/4 cup peanut butter",
        "2 tablespoons chili sesame oil, or to taste",
        "1 tablespoon lime juice (optional)",
        "1 teaspoon soy sauce to taste",
        "1 teaspoon chili-garlic sauce",
        "1 teaspoon tamarind paste, or to taste",
        "1 teaspoon grated lime zest (optional)",
        "20 egg roll wrappers",
        "2 teaspoons peanut butter, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pad Thai Egg Rolls",
    "url": "http://allrecipes.com/recipe/246139/pad-thai-egg-rolls/"
}
