{
    "directions": [
        "Place noodles in a large bowl; pour hot water over to cover. Let soak until tender but not mushy, 5-10 minutes. Drain; set aside.",
        "Heat vegetable oil in a wok or large skillet over medium-high heat. Add egg; stir until barely set, about 30 seconds. Add shrimp, if using. Cook, stirring, until shrimp and egg are almost cooked through, 2-3 minutes. Add tofu and radish; cook for 30 seconds. Add noodles and cook for 1 minute. Stir in sprouts. Add tamarind water, fish sauce, and simple syrup and stir-fry until sauce is absorbed by noodles and noodles are well coated, about 1 minute. Stir in chopped garlic chives. Add 1/4 teaspoon ground chiles and 1 tablespoon peanuts and toss well. Transfer to serving plates.",
        "Garnish with remaining 1/4 teaspoon ground chiles, 1 tablespoon peanuts, and lime wedges."
    ],
    "ingredients": [
        "5 ounces pad thai rice noodles",
        "3 tablespoons vegetable oil",
        "1 large egg, room temperature",
        "6 medium shrimp, peeled, deveined (optional)",
        "2 tablespoons 1x1/2x1/8\" slices pressed tofu (bean curd)",
        "1 tablespoon sweet preserved shredded radish, rinsed, chopped into 1\" pieces",
        "1 cup bean sprouts",
        "5 tablespoons tamarind water, or 2 tablespoons plus 1 teaspoon tamarind paste mixed with 2 tablespoons plus 1 teaspoon water",
        "1 1/2 tablespoons (or more) Thai fish sauce (nam pla)",
        "1 1/2 tablespoons simple syrup, preferably made with palm sugar",
        "4 garlic chives, 2 cut into 1\" pieces",
        "1/2 teaspoon ground dried Thai chiles, divided",
        "2 tablespoons crushed roasted, unsalted peanuts, divided",
        "2 lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Peanut",
        "Shrimp",
        "Tofu",
        "Tamarind",
        "Noodle"
    ],
    "title": "Pad Thai",
    "url": "http://www.epicurious.com/recipes/food/views/pad-thai-380593"
}
