{
    "directions": [
        "Light several chimney starters filled with charcoal and let burn until the briquettes are covered with gray ash. Put the charcoal in the center of the bottom of a large kettle grill, place the grate on and cover the grill. Let heat for at least 30 minutes before cooking.",
        "Brush the chicken with some of the canola oil and sprinkle with salt and pepper. Place the chicken skin-side down on the cooler part of the grill (the outer rim), to cook indirectly and slowly, and put the lid on. Cook the chicken until golden brown on both sides and almost completely cooked through, about 12 minutes for breasts and 15 minutes for thighs and wings. Remove to a sheet pan. Cut the breasts into 3 or 4 pieces.",
        "Combine the chicken stock and saffron in a medium saucepan and bring to a simmer, either on the hot part of the grill or on a burner. Add the clams, cover and cook until the clams open, 8 to 10 minutes. Remove the clams to a bowl. Add the mussels to the broth, cover and cook until the mussels open, about 5 minutes. Transfer to a bowl. Discard any shellfish that don't open.",
        "Brush the shrimp, the cut sides of the lobsters, scallops, and cut sides of the lemons with some of the oil and sprinkle with salt and pepper on all sides. Grill the shrimp for about 1 minute per side. Grill the lobster cut-side down until charred and just cooked through, about 5 minutes. Remove the claws and the tails but leave the shells on; discard the bodies. Grill the scallops until slightly charred and almost cooked through, about 1 minute per side. Grill the lemon cut-side down until charred, about 45 seconds. Remove all ingredients to sheet pans.",
        "Heat 3 tablespoons canola oil in a large paella pan over direct heat. Add the onions and cook until soft. Add the garlic and cook for 1 minute. Add the chorizo and cook, stirring occasionally, until brown and crisp, about 5 minutes.",
        "Add the rice and cook, stirring constantly, for a few minutes. Begin adding the stock 1 cup at a time and cook, stirring constantly, until the rice is al dente, about 25 minutes.",
        "Arrange the chicken, clams mussels, shrimp, scallop, peas, lobster and piquillo peppers in the rice. Squeeze the juice from 4 of the lemon halves over the top, and nestle the 4 other halves in the rice. Scatter the parsley over the top. Stir gently to bring some of the rice up from the bottom, and serve."
    ],
    "ingredients": [
        "One 3-pound chicken, cut into 8 pieces",
        "1/4 cup canola oil",
        "Kosher salt and freshly ground black pepper",
        "8 cups chicken stock",
        "1 large pinch saffron",
        "2 pounds clams, scrubbed",
        "2 pounds mussels, de-bearded and scrubbed",
        "18 colossal shrimp, tails on, peeled and deveined",
        "Two 2-pound lobsters, par-cooked in salted boiling water for about 12 minutes, drained well and halved lengthwise",
        "15 sea scallops, patted dry",
        "4 lemons, halved",
        "1 large Spanish onion, finely chopped",
        "6 cloves garlic, finely chopped",
        "4 cups short grain paella rice",
        "1 pound Spanish chorizo (a cross between hard and soft), thinly sliced",
        "1 cup frozen peas, thawed",
        "1 jar piquillo peppers, chopped or thinly sliced (6 or 8 peppers)",
        "1 cup chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Grilled Chicken",
        "Chicken",
        "Grilling",
        "Poultry Recipes",
        "Chorizo",
        "Sausage Recipes"
    ],
    "title": "Paella on the Grill",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/paella-on-the-grill-recipe"
}
