{
    "directions": [
        "Make the sofrito: In a heavy 12-inch skillet heat 3 tablespoons olive oil until hot, add the onions, and pepper strips and cook, stirring, for 5 minutes. Add tomatoes, garlic, and thyme and cook, stirring for 5 minutes more, until most of the liquid in the pan evaporates and the mixture is thick.",
        "Season the chicken with salt and pepper. In the skillet heat 3 tablespoons of the olive oil over moderately high heat until hot. Add the chicken and cook it, turning. Add sausages and cook until lightly browned. Transfer to a plate and deglaze pan with 1/2 cup dry white wine.",
        "About a 30 minutes before you plan to serve the paella, preheat the oven to 400 degrees F. In a 14-inch paella pan or shallow casserole at least 14-inches in diameter, combine the sofrito, rice, and the saffron. Pour in 5 cups simmering stock and, stirring constantly, bring to a boil over high heat. Remove the pan from the heat immediately and season with salt. Arrange the chicken, sausage, shrimp, clams, and mussels on top of the rice. Set the pan on the floor of the oven or the lowest shelf and bake uncovered for 20 minutes. Scatter the peas at random over the whole and bake for 5 to 10 minutes more or until all the liquid has been absorbed by the rice and the grains are tender but not too soft. If necessary, add the remaining cup stock, if the rice needs to be more soft. Do not stir the paella once it goes in oven.",
        "Let paella stand at room temperature covered with a cloth for 5 minutes before serving. Garnish with the lemons and parsley."
    ],
    "ingredients": [
        "Minced fresh parsley",
        "6 tablespoons olive oil",
        "1 cup minced onions",
        "1 each small-sized sweet red and green bell peppers, seeded, and cut into strips",
        "1 cup drained, chopped canned tomatoes",
        "1 tablespoon minced garlic",
        "1 tablespoon minced fresh thyme",
        "1 (2 1/2 pound) chicken, cut into serving pieces, patted dry",
        "Salt and freshly ground black pepper",
        "3 chorizos, sliced into 1/4-inch thick half circles",
        "1/2 cup dry white wine",
        "3 cups long-grain rice",
        "1/4 teaspoon ground saffron or saffron threads",
        "5 to 6 cups simmering chicken stock",
        "12 extra-large shrimps in their shells, shelled and deveined, leaving tails intact",
        "12 hard-shelled clams, such as littlenecks, scrubbed",
        "12 mussels, scrubbed",
        "1 cup peas",
        "Lemon wedges, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Skillet Recipes",
        "European Recipes",
        "Spanish",
        "Wine Recipes",
        "Chicken",
        "Poultry Recipes",
        "Rice Recipes",
        "Clam Recipes",
        "Shellfish Recipes",
        "Beans and Legumes",
        "Pea Recipes",
        "Shrimp",
        "Grain Recipes",
        "Mussel",
        "Fruit",
        "Lemon Recipes",
        "Tomato",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Paella",
    "url": "http://www.foodnetwork.com/recipes/paella-recipe0"
}
