{
    "directions": [
        "Cook asparagus in large saucepan of boiling salted water until crisp-tender, about 2 minutes. Drain, rinse under cold water, and drain again.",
        "Bring 4 1/2 cups broth to simmer in medium saucepan over medium heat. Add reserved shrimp shells; simmer 10 minutes. Bring wine to simmer in small saucepan over medium heat; add saffron and set aside 5 minutes to steep. Strain saffron-infused wine into 8-cup measuring cup. Strain in shrimp broth. Add enough chicken broth to measure 5 cups broth mixture.",
        "Heat oil in large wide pot (at least 3 inches deep) over medium-high heat. Add chorizo and sauté until lightly browned, breaking into 1/2-inch pieces with side of spoon, about 5 minutes. Add onions. Reduce heat to medium and sauté until onions are slightly soft, about 5 minutes. Add garlic and stir 2 minutes. Add tomato and peppers. Sauté until tomato is soft and juices evaporate, about 3 minutes. Mix in paprika and salt, then rice. (Asparagus, broth mixture, and rice mixture can be prepared 2 hours ahead. Let each stand at room temperature.)",
        "Preheat oven to 350°F. Add broth mixture to rice mixture and bring to boil over high heat, stirring frequently. Reduce heat to low and simmer 2 minutes, stirring occasionally. Remove pot from heat. Scatter shrimp over. Tuck clams and mussels into rice mixture, hinged side down. Place pot in oven and bake paella, uncovered, 15 minutes. Sprinkle peas and asparagus over. Continue to bake until broth is absorbed, rice is tender, and clams and mussels open, about 5 minutes longer. Transfer pot to work surface. Cover with foil; let stand 5 minutes.",
        "Transfer paella to large shallow dish. Garnish with lemon wedges and serve."
    ],
    "ingredients": [
        "1 pound slender asparagus, trimmed, cut into 1-inch lengths",
        "5 cups (about) low-salt chicken broth, divided",
        "1 pound uncooked large shrimp, peeled, deveined, tails left intact, shells reserved",
        "3/4 cup dry white wine",
        "1/2 teaspoon crumbled saffron threads",
        "1/4 cup olive oil",
        "2 Spanish chorizo sausage links (6 ounces), casings removed",
        "2 1/2 cups chopped onions",
        "3 large garlic cloves, finely chopped",
        "1 large tomato (12 to 13 ounces), halved, seeded, cut into 3/4-inch cubes",
        "1/3 cup drained roasted canned Piquillo peppers or drained roasted red peppers from jar, coarsely chopped",
        "2 teaspoons Pimentón de la Vera (hot Spanish smoked paprika) or hot Hungarian paprika",
        "1 teaspoon salt",
        "2 1/2 cups Spanish Bomba rice, Italian arborio rice, or medium-grain white rice (about 17 ounces)",
        "18 small littleneck clams (about 1 1/4 pounds), scrubbed",
        "24 mussels, scrubbed, debearded",
        "5 ounces sugar snap peas, trimmed",
        "Lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Shellfish",
        "Sausage",
        "Clam",
        "Mussel",
        "Shrimp",
        "Asparagus",
        "Spring",
        "Party",
        "Sugar Snap Pea"
    ],
    "title": "Paella with Asparagus and Sugar Snap Peas",
    "url": "http://www.epicurious.com/recipes/food/views/paella-with-asparagus-and-sugar-snap-peas-231728"
}
