{
    "directions": [
        "1. Bring 10 cups of water to a boil over medium-high heat and add the dried beans. Reduce the heat to a simmer and cook until just tender, 1 to 1 1/2 hours. Stir in 2 teaspoons of salt and let rest in their liquid for about 30 minutes before draining.",
        "2. Cut up the rabbit: Cut off the hind legs, using a sharp boning knife to slice between each leg and the hip joint. Cut each hind leg into two pieces, slicing at the joint between the thigh and leg. Cut off the front legs, slicing between each leg and the shoulder joint. Cut the body into three sections: ribs, loin, and bottom, using a heavy meat cleaver. Cut the loin in half, then cut the ribs in half through the breast and backbone, then cut each half in half.",
        "3. Prepare a wood (or charcoal) fire and heat the oil in a large paella pan set over the hottest part of the fire. Season the chicken and rabbit with 2 teaspoons each of salt and pepper. When the oil is hot, add the chicken and rabbit and fry over medium-high heat, turning the meat to brown all sides evenly, 8 to 10 minutes.",
        "4. Add the tomatoes, onions, garlic, and green beans and continue to cook over medium heat until the beans are nearly tender, about 15 minutes. Add 10 cups of water and the rosemary sprig and move to the hottest part of the grill, or rearrange or add coals to raise the heat to high. Cover the pan with a grill lid.",
        "5. Remove the lid when the water comes to a boil. Stir in 2 1/2 teaspoons of salt and the saffron, then sprinkle the rice evenly around the pan directly into the liquid, avoiding the meat.",
        "6. Add the broad beans. Stir gently one time only to evenly distribute the rice (do not stir again). Remove the rosemary.",
        "7. Cook, uncovered, turning the pan one-quarter turn every 5 minutes to help ensure even heat distribution. Cook the rice over high heat for 10 minutes, or until the water is almost absorbed, then move to a cooler part of the grill and cook at a gentle simmer over low heat for another 10 minutes, or until the rice has absorbed all of the liquid. The rice should be al dente when it is done; if it is too firm when the liquid is absorbed, add additional water 1 cup at a time, continuing cooking until the rice is done. During this period, keep the heat at a level that allows the liquid to simmer gently.",
        "8. Remove the paella from the heat, and cover and allow to sit for 5 to 10 minutes before serving. Serve about 2 cups of the rice and vegetables and 1 piece each of the rabbit and chicken for each of 8 servings in large heated soup bowls. Or place the warm paella pan on the table and allow guests to serve themselves."
    ],
    "ingredients": [
        "1 3/4 cups dried lima beans (broad beans), soaked overnight in 10 cups water and drained",
        "6 1/2 teaspoons salt, divided use",
        "1 rabbit (about 2 pounds or 900 g)",
        "1/2 cup extra virgin olive oil",
        "1 large chicken (about 4 pounds 8 ounces or 2 kg), cut into 8 pieces",
        "2 teaspoons freshly ground black pepper",
        "4 ripe tomatoes, peeled and puréed",
        "1 3/4 cups chopped onions",
        "2 1/2 teaspoons minced garlic",
        "2 3/4 cups green beans (preferably flat romano beans)",
        "2 1/2 to 3 quarts (2 1/2 to 3 liters) water, plus more as needed",
        "1 rosemary sprig",
        "2 generous pinches saffron",
        "4 cups Bomba rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Tomato",
        "Dinner",
        "Rabbit",
        "Saffron",
        "Green Bean",
        "Lima Bean",
        "Family Reunion",
        "Party",
        "Potluck",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Paella Valenciana",
    "url": "http://www.epicurious.com/recipes/food/views/paella-valenciana-357152"
}
