{
    "directions": [
        "Pour the water into a bread machine pan; add the flour. Sprinkle the milk powder over the flour. Place the sugar, salt, and 2 tablespoons of softened butter into the corners of the pan. Make a small indent in the top of the dry ingredients and put the yeast in the indent. Run the bread machine on the basic dough setting.",
        "Meanwhile, lay out a sheet of waxed or parchment paper. Shape the remaining 1/2 cup of butter into a 3x5 inch rectangle on the waxed paper; wrap and chill until ready to use.",
        "Remove the butter from the refrigerator and allow to soften while you roll out the dough. Turn the dough out onto a lightly floured surface. Roll the dough into a 8x12 inch rectangle. Place the  butter on half of the dough, leaving a 1/2 inch border of dough on 3 sides. Fold the other half of the dough over the butter and press the edges firmly to seal.",
        "Roll the dough out to a  6x14 inch rectangle. Fold the dough in thirds from the long ends, as you would fold a business letter. Cover the dough loosely with plastic wrap and refrigerate for 20 minutes.",
        "Remove the dough from the refrigerator. Place it onto a lightly floured surface so that the folded edge faces you. Roll the dough out again into a 6x14 inch rectangle, and fold into thirds. Cover with plastic and chill for 20 minutes.",
        "Repeat step 5, chilling for 30 minutes.",
        "In a small bowl, beat together the egg yolk and milk; set aside. Grease two baking sheets.",
        "Roll the dough out into a 12x21 inch rectangle. Cut the dough into thirds in both directions, to make 9 rectangles. Divide the chocolate among the rectangles. Lightly brush the egg yolk mixture around the edges of each piece. Starting at a short end, roll each piece of dough around the chocolate as if you were rolling a cigar. Press the edges together to seal.",
        "Place the pastries onto the prepared baking sheets; cover with greased plastic wrap and allow to rise in a warm place until they have doubled in size, about 30 minutes.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Brush the top of the pastries with the remaining egg yolk mixture.",
        "Bake in the preheated oven until golden brown, about 15 minutes. Cool for 5 minutes on the baking sheets, then transfer pastries to wire racks. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1/4 cup warm water",
        "2 1/4 cups bread flour",
        "2 tablespoons instant nonfat dry milk",
        "1 tablespoon white sugar",
        "1/2 teaspoon salt",
        "2 tablespoons butter, softened",
        "1 1/2 teaspoons instant yeast",
        "1/2 cup butter, softened",
        "1 egg yolk",
        "1 tablespoon milk",
        "8 (7 ounce) bars chocolate candy bar, broken into pieces",
        "8 ounces semisweet chocolate chunks"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pain au Chocolat (Chocolate-Filled Croissant)",
    "url": "http://allrecipes.com/recipe/142764/pain-au-chocolat-chocolate-filled-cr/"
}
