{
    "directions": [
        "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels; crumble and set aside. Leave 1 tablespoon bacon drippings in the skillet.",
        "Place halved and seeded spaghetti squash cut sides down in a large glass baking dish with 1/4 cup water. Microwave on high until squash is steaming and tender, 10 to 12 minutes. Using a fork, scrape spaghetti squash strands from skin. Set aside in a large serving dish and keep warm.",
        "Cook and stir onion and eggplant in remaining bacon drippings in a large skillet over medium heat until the onion turns translucent and eggplant is tender, 8 to 10 minutes. Stir in garlic and Italian herb blend. Add coconut milk, bring to a simmer, and cook until warmed through, 2 to 4 minutes. Remove from heat and use an immersion blender to puree the eggplant-coconut mixture until smooth.",
        "Return blended coconut milk sauce to skillet over medium-high heat and stir in crumbled bacon and spinach. Simmer, stirring often, until spinach is wilted and sauce is heated through, about 5 minutes. Pour sauce over spaghetti squash and sprinkle with nutritional yeast to taste."
    ],
    "ingredients": [
        "1/2 pound bacon",
        "1 tablespoon bacon drippings",
        "1 large spaghetti squash, halved and seeded",
        "1/4 cup water",
        "1 large onion, coarsely chopped",
        "1 eggplant, chopped",
        "1 clove garlic, minced, or to taste",
        "1 teaspoon Italian herb blend",
        "1 (14 ounce) can coconut milk",
        "2 cups fresh spinach leaves",
        "salt and ground black pepper to taste",
        "2 tablespoons nutritional yeast, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Paleo Spaghetti Squash with Spinach and Bacon Cream",
    "url": "http://allrecipes.com/recipe/228089/paleo-spaghetti-squash-with-spinach-a/"
}
