{
    "directions": [
        "Melt 1 tablespoon coconut oil in a large pot over medium heat. Add carrots and onion; season with salt and pepper. Cook and stir until onion is translucent and carrots begin to soften, about 5 minutes.",
        "Stir peas, garlic, curry powder, garlic powder, turmeric, paprika, oregano, and cumin into the pot; cook until combined, about 2 minutes. Add extra coconut oil as needed. Stir in ground beef; cook until browned, about 5 minutes. Add tomato paste and stir until fully incorporated, about 2 minutes.",
        "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower, cover, and steam until tender, 5 to 7 minutes. Drain and pat dry with paper towels.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Combine drained cauliflower, butter, and cream cheese in a large bowl. Mash with an immersion blender until smooth.",
        "Spread beef mixture evenly in a large casserole dish. Cover with mashed cauliflower. Brush beaten egg lightly on top.",
        "Bake in the preheated oven until hot, about 10 minutes. Turn on oven broiler; cook until top is browned in places, about 5 minutes."
    ],
    "ingredients": [
        "1 tablespoon coconut oil, or more to taste",
        "3 large carrots, peeled and diced",
        "1 onion, diced",
        "salt and ground black pepper to taste",
        "1 (10 ounce) package frozen peas, or more to taste",
        "4 cloves garlic, diced",
        "1 1/2 teaspoons curry powder",
        "1 1/2 teaspoons garlic powder",
        "1 teaspoon ground turmeric",
        "1 teaspoon ground paprika",
        "1 teaspoon oregano",
        "1/2 teaspoon ground cumin",
        "2 pounds ground beef",
        "2 tablespoons tomato paste",
        "1 head cauliflower, cut into florets",
        "3 tablespoons butter",
        "3 tablespoons cream cheese",
        "1 egg, beaten until frothy"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Paleo Shepherd's Pie",
    "url": "http://allrecipes.com/recipe/255202/paleo-shepherds-pie/"
}
