{
    "directions": [
        "Dissolve salt in warm water, and mix in 1 cup of flour to make a soft dough. Turn the dough out onto a well-floured work surface, and knead until slightly springy, about 5 minutes. If the dough is sticky, knead in 1/4 teaspoon of vegetable oil. Divide the dough into 8 equal-size pieces, and keep the pieces covered with a cloth.",
        "In a bowl, mix 1/4 cup of flour with 1 tablespoon vegetable oil to make a mixture like fine crumbs.",
        "On a floured work surface, roll a piece of dough out into a thin square about 5x7 inches in size, brush the dough with toasted sesame oil, and sprinkle lightly with about 1 1/2 teaspoon of the flour-oil mixture. Sprinkle about 1 tablespoon of chopped green onion onto the dough, and spread the onion out evenly. Starting with a long end, roll the dough up into a rope shape, and pinch the seam and the ends closed. Roll the rope shape into a flat spiral, and press lightly with your hands to compact the spiral and keep it from unrolling.",
        "Place the spiral down onto the floured work surface, and gently roll it out into a pancake with the onions folded inside, turning the pancake over often as you roll it out. Roll gently and turn often to avoid making holes in the pancakes. Finished pancakes should be about 5 inches in diameter. Repeat with the rest of the dough pieces, making 8 onion pancakes.",
        "Heat a non-stick skillet over medium heat, and brush with vegetable oil. Pan-fry each pancake in the hot skillet until golden brown on both sides, about 5 minutes per side. Cut into wedges and serve warm."
    ],
    "ingredients": [
        "1/4 teaspoon salt",
        "3/4 cup warm water",
        "1 cup all-purpose flour",
        "1/4 teaspoon vegetable oil (optional)",
        "1/4 cup all-purpose flour",
        "1 tablespoon vegetable oil",
        "1 tablespoon Asian (toasted) sesame oil, or as needed",
        "1/2 cup finely chopped green onion",
        "1 tablespoon vegetable oil, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pan-Fried Chinese Pancakes",
    "url": "http://allrecipes.com/recipe/214564/pan-fried-chinese-pancakes/"
}
