{
    "directions": [
        "Preheat oven to 350°F. Squeeze excess liquid from daikon and cucumber. Mix with yogurt, lemon juice, mint, and cayenne in a small bowl; season with salt and pepper. Set the raita aside.",
        "Heat 1 tablespoon oil in a large heavy pot over medium heat. Add garlic and cook, stirring constantly, just until fragrant, about 1 minute. Add collard greens to pot, reduce heat to low, cover, and cook, tossing occasionally, until tender, 10-15 minutes.",
        "Meanwhile, heat 1 tablespoon oil in a large ovenproof skillet over medium heat. Season fish with salt and pepper; cook skin side down until skin is crisp, 5-8 minutes. Transfer to oven (do not turn fish); roast until opaque in the center, about 4 minutes.",
        "Add radishes and vinegar to collard greens; season with salt and pepper and toss to combine. Divide greens, salmon, and reserved raita among plates."
    ],
    "ingredients": [
        "4 ounces daikon (Japanese white radish) or white turnip, peeled, shredded (about 1/2 cup)",
        "1/4 English hothouse cucumber, grated (about 1/2 cup)",
        "1 cup plain 2% fat Greek yogurt",
        "2 tablespoons fresh lemon juice",
        "1 tablespoon chopped fresh mint",
        "Pinch of cayenne pepper",
        "Kosher salt, freshly ground pepper",
        "2 tablespoons olive oil, divided",
        "2 garlic cloves, sliced",
        "2 bunches collard greens, center ribs and stems removed, leaves cut into 1\" strips (about 14 cups)",
        "4 6-ounce pieces skin-on salmon fillets",
        "2 red radishes, trimmed, thinly sliced",
        "1 tablespoon Sherry vinegar",
        "Ingredient info: Daikon is available at Asian markets and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Quick & Easy",
        "Yogurt",
        "Low Cal",
        "High Fiber",
        "Low Sodium",
        "Dinner",
        "Seafood",
        "Salmon",
        "Radish",
        "Healthy",
        "Collard Greens",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pan-Roasted Salmon with Collards and Radish Raita",
    "url": "http://www.epicurious.com/recipes/food/views/pan-roasted-salmon-with-collards-and-radish-raita-51148410"
}
