{
    "directions": [
        "Preheat oven to 350°F. Place 15x10x2-inch glass baking dish on rimmed baking sheet. Combine 8 cups water, 3 tablespoons olive oil, and 2 teaspoons salt in dish. Gradually mix in polenta.",
        "Place baking sheet with polenta in oven. Bake polenta 1 hour. Add pepper and stir to blend. Bake 20 minutes. Stir again and spread evenly. Bake until polenta is very thick, about 20 minutes longer. Cool polenta to room temperature, 1 to 2 hours (polenta will become firm). Using metal spatula, press polenta all over to even thickness. DO AHEAD: Can be made 2 days ahead. Cover with plastic wrap; chill.",
        "Preheat oven to 325°F. Cut polenta lengthwise into 4 strips. Cut each strip crosswise into 6 squares. Heat 2 tablespoons oil in large nonstick skillet over medium-high heat. Working in batches, add polenta squares. Sauté until crisp and beginning to color, about 8 minutes per side. Transfer polenta to small baking sheet; place in oven to keep warm. Repeat with remaining polenta, adding oil to skillet as needed.",
        "Divide polenta among plates. Top with warm Spicy Tomato-Basil Sauce. Garnish with fresh basil sprigs, if desired.",
        "Sold at some supermarkets and at natural foods stores and Italian markets. If unavailable, substitute an equal amount of regular yellow cornmeal.",
        "A medium-bodied red Italian wine is great with the spicy sauce. One to try: Montresor NV \"Il Veronese\" Valpolicella ($14), a lovely red blend with dried fruit flavors and vanilla notes."
    ],
    "ingredients": [
        "8 cups water",
        "5 tablespoons (or more) olive oil, divided",
        "2 teaspoons salt",
        "2 cups polenta (coarse cornmeal)*",
        "1/4 teaspoon freshly ground",
        "Spicy Tomato-Basil Sauce",
        "Fresh basil sprigs (for garnish; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Bake",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Pan-Fry",
        "Low Cholesterol",
        "Hominy/Cornmeal/Masa"
    ],
    "title": "Pan-Seared Polenta with Spicy Tomato-Basil Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pan-seared-polenta-with-spicy-tomato-basil-sauce-356870"
}
