{
    "directions": [
        "Drain beans and transfer to a large pot. Cover with water by at least 2\" and add shallot, bay leaves, and 1 1/2 tablespoons salt. Bring to a boil, then reduce heat and simmer gently, adding water to keep beans submerged, until very soft but not split, 1 1/2 - 2 hours. Let beans cool in liquid.",
        "Mix anchovies, garlic, parsley, capers, lemon zest, lemon juice, and 1/2 cup oil in a medium bowl; season with salt and pepper. Drain beans and discard shallot and bay leaves. Add to parsley mixture, tossing to coat (save bean cooking liquid to make soup or add to your next batch of beans; it freezes well). Season beans with salt and more lemon juice, if desired.",
        "Whisk remaining 1/4 cup salt with 4 cups water in a shallow baking dish until salt is dissolved; add halibut (it should be submerged) and let sit 30 minutes (don't let it sit any longer or fish will be too salty).",
        "Remove halibut and pat dry. Heat remaining 1 tablespoon oil in a large skillet over medium-high and cook halibut (do not season) until a golden brown crust has formed, about 4 minutes. Flip and cook another minute or so, just to finish cooking through and sear the second side. Turn off heat and add butter to skillet. Tilt skillet and spoon foaming butter over fillets for another minute. Serve halibut with beans and lemon wedges for squeezing over."
    ],
    "ingredients": [
        "1 1/2 cups dried corona or gigante beans, soaked overnight",
        "1 shallot, halved",
        "2 bay leaves, torn in half",
        "1 1/2 tablespoons plus 1/4 cup kosher salt, plus more",
        "2 anchovy fillets packed in oil, drained, finely chopped",
        "1 garlic clove, finely grated",
        "3/4 cup finely chopped fresh parsley",
        "1 tablespoon drained capers, finely chopped",
        "1 tablespoon finely grated lemon zest",
        "1 tablespoon fresh lemon juice",
        "1/2 cup plus 1 tablespoon olive oil",
        "Freshly ground black pepper",
        "6 5-6 ounce skinless halibut fillets",
        "1 tablespoon unsalted butter",
        "1 lemon, cut into wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Healdsburg"
    ],
    "title": "Pan-Roasted Halibut with Herbed Corona Beans",
    "url": "http://www.epicurious.com/recipes/food/views/pan-roasted-halibut-with-herbed-corona-beans-51263770"
}
