{
    "directions": [
        "Preheat oven to 450 degrees F (230 degrees C).",
        "Heat canola oil in a large, ovenproof skillet over high heat until it begins to smoke. Season halibut to taste with salt and pepper. Dredge in flour, and shake off the excess. Sear the halibut until golden brown on both sides, about 1 minute per side. Pour excess oil from skillet, then place into preheated oven, and bake until flakey, 7 to 8 minutes.",
        "When cooked, remove fish from skillet, and keep warm. Melt 2 tablespoons butter in the pan, stir in shallots, and cook over medium heat until they turn translucent, about 1 minute. Add the ham, drained raisins, capers, and pine nuts; continue cooking for another minute. Pour in Calvados, and cook until reduced by half. Add the chicken stock, increase heat to high, and boil until 1/4 of the stock has evaporated.",
        "Remove the skillet from the heat, and quickly whisk in 1/2 cup butter until dissolved. Whisk in the parsley and thyme; season to taste with salt. To serve, arrange halibut on a warmed serving platter or individual plates, pour the sauce overtop. Serve immediately."
    ],
    "ingredients": [
        "1/4 cup canola oil for pan-frying",
        "4 (7 ounce) halibut fillets",
        "Kosher salt and fresh cracked pepper to taste",
        "1/4 cup all-purpose flour for dredging",
        "For the sauce:",
        "2 tablespoons unsalted butter",
        "2 shallots, minced",
        "2 ounces thickly sliced Spanish serrano ham (or prosciutto) cut into 1/4-inch dice",
        "1/4 cup golden raisins, soaked in hot water to soften",
        "2 tablespoons capers, rinsed and patted dry",
        "1/4 cup pine nuts, lightly toasted",
        "1/3 cup Calvados (apple brandy)",
        "1/2 cup chicken stock",
        "1/2 cup cold unsalted butter, cut into pieces",
        "1 tablespoon minced fresh parsley",
        "2 teaspoons minced fresh thyme",
        "Kosher salt to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pan Roasted Halibut with Calvados and Serrano Ham-Butter Sauce",
    "url": "http://allrecipes.com/recipe/106269/pan-roasted-halibut-with-calvados-and/"
}
