{
    "directions": [
        "Cook broccolini in a pot of boiling salted water just until tender, about 3 minutes. Drain and transfer to a bowl of ice water; let cool. Drain and pat dry with paper towels.",
        "Heat butter in a medium skillet over medium until foaming. Add broccolini, lemon zest, and red pepper flakes; season with salt and pepper. Cook, tossing, just until broccolini is warmed through and coated in butter.",
        "Heat a grill pan over medium-high until hot but not smoking. Pat black bass fillets dry; this will help keep the fish from sticking to the pan while cooking. Place flour on a plate and season generously with salt and pepper (you are not seasoning the fish itself). Working one at a time, dredge fillets in flour, shaking off excess. Spread butter over flesh side of fillets as if buttering a slice of bread.",
        "Add fillets, flesh side down, to pan; they should sizzle upon contact. Cook just until grill marks appear and butter is browned, about 1 minute. Turn and cook, pressing gently so entire skin side is in contact with the pan's ridges, until skin is browned and crisp and fillets are cooked through, about 4 minutes longer.",
        "Serve black bass fillets with broccolini and flavored butters, which will soften on contact with the warm fish."
    ],
    "ingredients": [
        "1 pound broccolini or broccoli rabe, trimmed",
        "Kosher salt",
        "2 tablespoons unsalted butter",
        "1 teaspoon finely grated lemon zest",
        "1/2 teaspoon crushed red pepper flakes",
        "Freshly ground black pepper",
        "4 (6-ounce) black bass or trout fillets or skinless cod or haddock fillets",
        "1 cup all-purpose flour",
        "Kosher salt, freshly ground pepper",
        "6 tablespoons unsalted butter, room temperature, divided Maître d'Hôtel Butter , Nasturtium Butter , and Chile-Cilantro Butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Kid-Friendly",
        "Dinner",
        "Bass",
        "Spring",
        "Summer",
        "Grill/Barbecue",
        "Healthy",
        "Broccoli Rabe",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Pan-Grilled Black Bass with Flavored Butters",
    "url": "http://www.epicurious.com/recipes/food/views/pan-grilled-black-bass-with-flavored-butters-56389548"
}
