{
    "directions": [
        "Place wine and shallots in heavy small saucepan. Boil until almost dry, about 6 minutes. Add cream. Boil until reduced by half, about 2 minutes. Stir in mascarpone, lemon peel, and chives. DO AHEAD: Can be made 1 day ahead. Transfer to small bowl; cover and chill. Rewarm before serving.",
        "Place cider, vinegar, and shallots in heavy medium saucepan. Boil until reduced to 3/4 cup, about 15 minutes. Strain; discard solids in strainer. Return cider mixture to pan. DO AHEAD: Cider reduction can be made 1 day ahead. Cover and refrigerate.",
        "Press thin end of cloves into peeled onion. Place onion in heavy large saucepan. Add 6 cups water, lentils, and bay leaves. Bring to boil. Reduce heat to medium-low and simmer until lentils are tender, stirring occasionally, about 30 minutes.",
        "Meanwhile, cook bacon in heavy large skillet over medium heat until crisp. Using slotted spoon, transfer bacon to paper towels. Pour all but 3 tablespoons fat from skillet. Add shallots to skillet and sauté over medium heat until golden, about 2 minutes.",
        "Drain lentils, discarding onion and bay leaves. Add reserved bacon, lentils, and thyme to shallots. DO AHEAD: Lentils can be made 2 hours ahead. Let stand at room temperature. Rewarm over medium heat, stirring often.",
        "Bring cider reduction to simmer. Whisk in 5 tablespoons butter, 1 tablespoon at a time. Keep warm.",
        "Season scallops with salt and pepper. Melt 1 tablespoon butter with oil in heavy large skillet over medium-high heat. Add scallops and cook until brown, about 2 minutes per side.",
        "Divide lentils among 6 plates. Arrange 3 scallops atop lentils on each plate. Drizzle cider reduction over scallops and around lentils. Drizzle warm mascarpone cream over."
    ],
    "ingredients": [
        "1/2 cup dry white wine",
        "2 tablespoons chopped shallots",
        "1/4 cup whipping cream",
        "1/4 cup mascarpone cheese",
        "1 teaspoon finely grated lemon peel",
        "1/2 teaspoon chopped fresh chives",
        "2 cups apple cider",
        "1 cup apple cider vinegar",
        "1/4 cup chopped shallots",
        "6 whole cloves",
        "1 medium onion, peeled",
        "6 cups water",
        "1 1/2 cups French green lentils (lentilles du Puy; about 12 ounces)",
        "2 bay leaves",
        "6 slices thick-cut applewood-smoked bacon, cut crosswise inch thick",
        "1/4 cup chopped shallots",
        "1 teaspoon chopped fresh thyme",
        "6 tablespoons butter, divided",
        "18 sea scallops, patted dry",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Dairy",
        "Fish",
        "Fruit",
        "Herb",
        "Onion",
        "Pork",
        "Bacon",
        "Lentil",
        "White Wine"
    ],
    "title": "Pan-Seared Sea Scallops with Lentils, Bacon, and Cider Reduction",
    "url": "http://www.epicurious.com/recipes/food/views/pan-seared-sea-scallops-with-lentils-bacon-and-cider-reduction-235838"
}
