{
    "directions": [
        "Preheat oven to 450°F. Using a small sharp knife, cut off all peel and white pith from fruit. Working over a medium bowl, cut between membranes to release segments into bowl. Squeeze in juices from membranes; discard membranes. Drain fruit, reserving 1/2 cup juices. Return segments and juices to bowl. Season with salt and pepper.",
        "Pat fish dry. Season with salt and pepper. Heat a large heavy ovenproof skillet over high heat. Add grapeseed oil. Add fish; cook without moving, occasionally pressing fish gently with a spatula to keep all of surface in contact with pan, until fish is golden brown and releases easily from pan, 4-5 minutes.",
        "Turn fish, transfer to oven, and roast until just opaque in the center, 3-5 minutes.",
        "Place fruit and avocado on plates. Top with fillets. Spoon 2 tablespoons citrus juices over fruit on each plate. Drizzle 1 tablespoon avocado oil over fish and fruit."
    ],
    "ingredients": [
        "2 oranges",
        "2 pink grapefruits",
        "Kosher salt, freshly ground pepper",
        "4 6-ounce skinless fillets white or Mexican sea bass or grouper (about 1\" thick)",
        "1 tablespoon grapeseed oil",
        "1 avocado, halved, pitted, peeled, cut into wedges",
        "4 tablespoons avocado oil",
        "Ingredient info: Avocado oil is sold at some supermarkets, at natural and specialty foods stores, and at spectrumorganics.com."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fish",
        "Roast",
        "Low Cal",
        "Low Sodium",
        "Dinner",
        "Grapefruit",
        "Seafood",
        "Bass",
        "Avocado",
        "Healthy",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Pan-Roasted Sea Bass with Citrus and Avocado Oil",
    "url": "http://www.epicurious.com/recipes/food/views/pan-roasted-sea-bass-with-citrus-and-avocado-oil-388663"
}
