{
    "directions": [
        "Heat a 12-inch cast-iron skillet over high heat until very hot, about 3 minutes. Meanwhile, thoroughly pat the steaks dry with paper towels. Lightly coat each side of the steaks with canola oil and sprinkle generously with salt and pepper.",
        "Add 1 to 2 tablespoons canola oil to the skillet (this will help create a great crust on the steaks) and add the steaks. Do not crowd them; if you cannot leave room between the steaks, use 2 skillets. Without moving them, cook the steaks 3 minutes. Using tongs, flip them and cook 1 more minute for rare, 2 more minutes for medium rare or 4 more minutes for medium. Transfer the steaks to a plate and cover loosely with foil. Let rest at least 5 minutes before cutting into them.",
        "Pour out the used oil from the skillet and add a glug of new oil. Reduce the heat to medium. Add the shallots and garlic to the skillet and cook until they just begin to brown, 3 to 5 minutes. Add the beef broth, Worcestershire sauce and sherry vinegar and bring the sauce to a boil. Cook until reduced by half, 3 to 5 minutes. Turn off the heat and whisk in the butter until it has melted and the sauce has thickened. Stir in the olives, if using.",
        "Put each steak on a plate; spoon the sauce over the top and sprinkle with chives.",
        "Photograph by Anna Williams"
    ],
    "ingredients": [
        "2 bone-in rib-eye steaks (about 1 inch thick, 1 pound each), at room temperature",
        "Canola oil",
        "Kosher salt and cracked black pepper",
        "2 shallots, thinly sliced",
        "1 clove garlic, minced",
        "1/2 cup low-sodium beef broth",
        "2 tablespoons Worcestershire sauce",
        "2 tablespoons sherry vinegar",
        "2 tablespoons unsalted butter",
        "1/4 cup sliced Spanish olives (optional)",
        "1 tablespoon chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Steak",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Pan-Seared Spanish Steaks",
    "url": "http://www.foodnetwork.com/recipes/pan-seared-spanish-steaks"
}
