{
    "directions": [
        "In a large bowl or baking dish, whisk together the oil, rosemary, thyme, salt, and pepper. Add the halibut and stir to coat it in the marinade. Cover with plastic wrap and marinate, in the refrigerator, 20 to 30 minutes.",
        "In a blender or food processor, blend together the peas, spinach, and lemon juice, stopping and scraping down the sides occasionally, and blending until smooth. Season with salt and pepper and set aside.",
        "Fill a large bowl with ice water.",
        "In a medium saucepan over high heat, bring salted water to a boil. Add the asparagus and boil, uncovered, until crisp-tender, 2 to 3 minutes. Drain, then immediately plunge the spears into the ice water to stop cooking. Drain the asparagus again and pat dry.",
        "In a medium saucepan sauté pan over moderately high heat, melt 2 tablespoons of the butter. Add the asparagus and toss it in the melted butter. Season with salt and pepper and set aside.",
        "In a medium saucepan over moderate heat, warm the chicken stock. Keep the stock hot on the stove.",
        "In a second medium saucepan over moderate heat, warm the olive oil. Add the shallot and sauté, stirring occasionally, until tender. Add the rice and sauté, stirring constantly, until just toasted. Add 1 cup of hot stock and simmer, stirring frequently, until the stock is almost absorbed, about 4 minutes. Add more stock, 1 cup at a time, allowing each addition to be absorbed before adding the next and stirring often, until the rice is tender and the mixture creamy, about 20 minutes longer. Add the remaining 4 tablespoons of butter, Parmesan cheese, chives, and parsley. Season with salt and pepper and keep warm.",
        "Preheat the oven to 350°F.",
        "Remove the halibut from the marinade and pat dry, then roll each fillet in a piece of caul fat. In a large sauté pan over moderate heat, warm the olive oil. Sear the halibut on all sides, then finish in the oven for 3 to 5 minutes.",
        "Divide the risotto among 4 plates. Top with asparagus and halibut, and drizzle with pea purée."
    ],
    "ingredients": [
        "3 tablespoons grapeseed oil",
        "2 tablespoons minced fresh rosemary",
        "2 tablespoons minced fresh thyme",
        "1 tablespoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "4 (6- to 8-ounce) skinless, boneless halibut fillets",
        "4 pieces caul fat*",
        "2 tablespoons olive oil",
        "1 cup blanched peas",
        "1/4 cup blanched baby spinach",
        "1 tablespoon freshly squeezed lemon juice",
        "Kosher salt and freshly ground black pepper",
        "1 bunch white asparagus, peeled",
        "6 tablespoons unsalted butter",
        "Kosher salt and freshly ground black pepper",
        "4 cups chicken stock or low-sodium chicken broth",
        "1 tablespoon olive oil",
        "1 medium shallot, minced",
        "2 cups arborio rice",
        "1/2 cup freshly grated Parmesan cheese",
        "1 tablespoon minced fresh chives",
        "2 tablespoons minced fresh flat-leaf parsley",
        "*Caul fat is a weblike membrane of fatty material that encases the organs of some animals, including pigs, sheep, and cows. When wrapped around meat or fish, it adds flavor, moisture, and fat, and basically melts into the meat or fish as it cooks. Some butchers and specialty markets carry caul fat, but you may need to ask your butcher or supermarket meat counter to order it. If you can't find caul fat, try wrapping the halibut in thin strips of bacon."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Halibut",
        "Asparagus",
        "Anniversary",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pan-Seared Halibut with White Asparagus Risotto and Pea Purée",
    "url": "http://www.epicurious.com/recipes/food/views/pan-seared-halibut-with-white-asparagus-risotto-and-pea-puree-51184410"
}
