{
    "directions": [
        "Cut an X in bottom of tomato. Blanch tomato in a saucepan of boiling water 10 seconds, then transfer tomato with a slotted spoon to a bowl of ice water. Peel and core tomato, then cut crosswise into 1/4-inch-thick slices and remove and discard seeds.",
        "Line drip tray of smoker with foil and spread wood chips over center of smoker pan (cover roughly the diameter of burner). Put drip tray on top of chips and put a lightly oiled rack in tray. Arrange tomato slices in 1 layer on rack and put smoker on stove, centered on 1 burner, then heat, uncovered, over moderate heat until chips begin to smolder, 2 to 3 minutes. Slide cover on, then smoke tomatoes over moderate heat 25 minutes. Remove cover from smoker. Cool tomatoes to room temperature, then purée in a food processor along with butter, salt, and a pinch of pepper. Force mixture through a fine-mesh sieve into a small bowl, then transfer to a sheet of wax paper or parchment paper and roll into a log about 1 inch thick. Twist ends of paper to enclose butter and chill until firm, at least 30 minutes.",
        "Cook bacon in a 10-inch heavy skillet over moderate heat, stirring occasionally, until browned and crisp, 8 to 12 minutes. Transfer with a slotted spoon to paper towels to drain. Discard bacon fat or reserve for another use.",
        "Toss together spinach and watercress in a medium bowl.",
        "Put oven rack in middle position and preheat oven to 400°F.",
        "Whisk together lemon juice, lime juice, garlic, salt, and a pinch of pepper in a medium bowl. Whisk in olive oil.",
        "Pat scallops dry and season with salt and pepper. Heat oil in cleaned 10-inch skillet over high heat until hot but not smoking, then sear scallops, turning over once, until golden brown and almost cooked through, about 4 minutes total. Transfer to a plate.",
        "Whisk vinaigrette and toss greens with just enough vinaigrette to coat, then add bacon, tossing to combine. Divide salad among scallop shells or small plates and arrange 2 scallops on top of each salad. Cut 8 (1/4-inch-thick) slices tomato butter and place a slice on top of each scallop.",
        "Arrange shells or plates on a baking sheet and heat in oven until butter is melted and scallops are just cooked through (greens will wilt slightly), 3 to 4 minutes. If using shells, transfer to larger plates."
    ],
    "ingredients": [
        "1 large tomato (about 1/2 pound)",
        "1 stick (1/2 cup) unsalted butter at room temperature",
        "1/4 teaspoon salt",
        "1 (2-ounce) piece slab bacon (rind discarded), cut into 1/4-inch-thick sticks",
        "2 cups loosely packed baby spinach (1 ounce)",
        "1 cup loosely packed watercress sprigs (3/4 ounce), coarse stems discarded",
        "1 teaspoon fresh lemon juice",
        "1 teaspoon fresh lime juice",
        "1/2 teaspoon minced garlic",
        "1/8 teaspoon salt",
        "1 1/2 tablespoons extra-virgin olive oil",
        "8 sea scallops (9 to 10 ounces total), tough muscle removed from side of each if necessary",
        "1 tablespoon grapeseed oil*",
        "Special equipment: a stovetop smoker/cooker; 1 teaspoon fine hickory wood chips**; 4 (2 1/2- to 3-inch) scallop shells or small ovenproof plates"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Shellfish",
        "Tomato",
        "Appetizer",
        "Seafood",
        "Scallop",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pan-Seared Scallops with Smoked-Tomato Butter and Warm Spinach Salad",
    "url": "http://www.epicurious.com/recipes/food/views/pan-seared-scallops-with-smoked-tomato-butter-and-warm-spinach-salad-231481"
}
