{
    "directions": [
        "In a wide flat dish, combine the bread crumbs, garlic, parsley, oregano, red pepper flakes, zest of 1 lemon and salt, to taste.",
        "In a small bowl, mix together the mustard and the juice of 1 lemon. Brush both sides of the trout with mustard mixture. Coat the fish on both sides with the seasoned bread crumbs and press firmly to adhere the crumbs to the fish.",
        "Preheat the oven to 250 degrees F.",
        "Coat a large skillet with about 1/4 to 1/2-inch of olive oil and bring to a medium-high heat. Add the fish to the pan, skin side down, and cook the fish 2/3's of the way, about 6 to 7 minutes. Carefully turn the fish over and cook the other side until the fish is brown and crispy, about 2 to 3 minutes. Remove the fish from the pan and drain on paper towels. You will probably need to work in batches to do 4 fish. After the first batch is done and dried on paper towels reserve it on a rack in a warm oven.",
        "When all the fish has been fried, remove the oil and any brown bits from the pan. Add the butter and remaining lemon juice and swirl to combine as the butter melts. Season with salt, to taste, and reduce by about half. Transfer the fish to a serving platter, drizzle with the butter lemon sauce and serve.",
        "What a fishtale!"
    ],
    "ingredients": [
        "1 1/2 cups bread crumbs",
        "1 clove garlic, smashed",
        "2 tablespoons finely chopped flat-leaf parsley",
        "2 tablespoons finely chopped fresh oregano leaves",
        "Pinch crushed red pepper flakes",
        "3 lemons, juiced and 1 lemon, zested and reserved",
        "Kosher salt",
        "1/2 cup Dijon mustard",
        "4 (10 to 12-ounce) trout, boned, belly flap removed, rinsed and patted dry, heads and tails left on",
        "Extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fruit",
        "Lemon Recipes",
        "Fish",
        "Trout Recipes",
        "Main Dish Recipes"
    ],
    "title": "Pan-Fried Trout",
    "url": "http://www.foodnetwork.com/recipes/anne-burrell/pan-fried-trout-recipe"
}
