{
    "directions": [
        "Preheat an oven to 400°F. Cut the chicken into 9 pieces, then season with the 1 1/2 tsp. salt and the 1/2 tsp. pepper.",
        "In a large ovenproof fry pan over medium-high heat, warm the oil until very hot but not smoking. Working in batches, add the chicken, skin side down, and cook, turning once, until golden brown on both sides, about 6 minutes per batch. Transfer to a platter. Pour off the fat from the pan.",
        "Return all of the chicken, skin side up, to the pan, transfer to the oven, and roast until an instant-read thermometer inserted in the thickest part of the breast, away from the bone, registers 160°F, about 30 minutes. Transfer the chicken pieces to a platter and cover loosely with aluminum foil.",
        "Pour the pan juices into a liquid measuring cup, let stand for 2 minutes and then skim the fat from the surface.",
        "Place the pan on the stovetop over medium heat and melt 2 Tbs. of the butter. Add the chopped fennel bulb and stir well to coat with the butter. Cover, reduce the heat to medium-low and sauté until the fennel softens, about 5 minutes. Stir in the leeks and the remaining 1 Tbs. butter, cover and cook, stirring occasionally, until the fennel is tender, about 5 minutes more. Stir in the wine, cream and reserved pan juices. Increase the heat to high and boil until the liquid lightly coats the back of a spoon, about 3 minutes. Adjust the seasonings with salt and pepper.",
        "Transfer the chicken to warmed individual plates. Spoon some of the sauce over each portion and sprinkle with the fennel fronds. Serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "New Flavors for Chicken",
        ", by Rick Rodgers (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "1 chicken, about 3 1/2 lb.",
        "1 1/2 tsp. kosher salt, plus more, to taste",
        "1/2 tsp. freshly ground pepper, plus more, to taste",
        "1 Tbs. peanut or grapeseed oil",
        "3 Tbs. unsalted butter",
        "1 fennel bulb, about 1 lb., cored and cut into 1/2-inch pieces",
        "3 leeks, white and light green portions, cut into 1/2-inch pieces and rinsed well",
        "1/4 cup dry white wine",
        "1 cup heavy cream",
        "2 Tbs. chopped fennel fronds"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pan-Roasted Chicken with Fennel, Leeks and Cream",
    "url": "http://www.williams-sonoma.com/recipe/pan-roasted-chicken-with-fennel-leeks-and-cream.html"
}
