{
    "directions": [
        "Stir sesame seeds in heavy small skillet over medium heat until golden, about 5 minutes. Place toasted sesame seeds in small bowl; cool. Mix in soy sauce, unseasoned rice vinegar, fresh lime juice, oriental sesame oil, and cayenne pepper.",
        "Mix soy sauce, mirin, and sake in small bowl to blend; set stir-fry sauce aside. (Dipping sauce and stir-fry sauce can be made 1 day ahead. Cover separately and refrigerate.)",
        "Place chicken slices in medium bowl; sprinkle with salt and pepper. Add cornstarch and toss to coat. Heat 2 tablespoons oriental sesame oil in large deep nonstick skillet over high heat. Add chicken slices and sauté until cooked through, about 4 minutes. Using slotted spoon, transfer chicken slices to bowl. Heat remaining 1 tablespoon oriental sesame oil in same nonstick skillet. Add sliced red onion, red bell pepper strips, and carrot strips; sauté 2 minutes. Add both cabbages and bean sprouts; sauté until vegetables are crisp-tender, about 2 minutes. Return chicken slices to skillet. Add stir-fry sauce and toss to coat. Season stir-fry mixture to taste with salt and pepper. Transfer mixture to strainer set over bowl to drain.",
        "Arrange romaine lettuce leaves on serving platter. Divide stir-fry mixture among leaves. Sprinkle with chopped green onions and serve, passing dipping sauce separately.",
        "*Unseasoned rice vinegar and mirin (sweet Japanese rice wine) are available at Japanese markets and in the Asian foods section of some supermarkets."
    ],
    "ingredients": [
        "3 tablespoons sesame seeds",
        "3/4 cup soy sauce",
        "3/4 cup unseasoned rice vinegar*",
        "1 tablespoon fresh lime juice",
        "1 tablespoon oriental sesame oil",
        "1/8 teaspoon cayenne pepper",
        "1/4 cup soy sauce",
        "1/4 cup mirin (sweet Japanese rice wine)*",
        "1/4 cup sake",
        "1 1/4 pounds skinless boneless chicken breast halves, cut crosswise into 1/3-inch-thick slices",
        "1 tablespoon cornstarch",
        "3 tablespoons oriental sesame oil, divided",
        "1 medium-size red onion, halved, thinly sliced",
        "1 medium-size red bell pepper, cut into matchstick-size strips",
        "1 medium carrot, cut into matchstick-size strips",
        "4 cups thinly sliced Napa cabbage (about 1/4 large head)",
        "1 cup thinly sliced red cabbage",
        "1 1/2 cups bean sprouts (about 3 ounces)",
        "18 leaves from hearts of romaine lettuce",
        "1 bunch green onions, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Leafy Green",
        "Poultry",
        "Appetizer",
        "Sauté",
        "Cocktail Party",
        "Vinegar",
        "Carrot",
        "Sake",
        "Fall",
        "Winter",
        "Cabbage",
        "Soy Sauce",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Pan-Asian Chicken and Vegetable Lettuce Wraps",
    "url": "http://www.epicurious.com/recipes/food/views/pan-asian-chicken-and-vegetable-lettuce-wraps-109058"
}
