{
    "directions": [
        "Mince the anchovies, capers, garlic and red pepper flakes together on a cutting board, then sprinkle with 1 teaspoon salt and mash into a paste using the flat side of a chef's knife. Transfer to a food processor along with the parsley, mint and marjoram. With the motor running, drizzle in the olive oil and process until smooth; transfer to a medium bowl.",
        "Toast the fennel seeds in a skillet over medium heat, 3 to 4 minutes. Transfer to a cutting board and crush with the bottom of a small skillet. Combine with 1/4 cup of the herb mixture and the herbes de Provence in a small bowl. Put the fish fillets in a shallow dish and brush with the fennel seed-herb mixture. Cover and refrigerate 2 to 4 hours.",
        "Meanwhile, add the lemon juice, bell pepper and cucumbers to the remaining herb mixture. Cover and refrigerate until ready to serve.",
        "Heat 2 large nonstick skillets over medium-high heat. Brush the excess marinade off the fish. Working in batches, add the fish to the skillets, skin-side up, and cook until browned on the bottom, about 4 minutes. Flip the fillets, pressing with a spatula to sear the skin, and cook 2 more minutes. Serve with the herb salsa and lemon wedges.",
        "Photograph by Kana Okada"
    ],
    "ingredients": [
        "4 anchovy fillets, rinsed",
        "1 tablespoon drained capers",
        "1 clove garlic, smashed",
        "1/2 teaspoon red pepper flakes",
        "Kosher salt",
        "1 cup loosely packed fresh parsley",
        "1/2 cup loosely packed torn fresh mint",
        "1 tablespoon fresh marjoram or oregano",
        "2/3 cup extra-virgin olive oil",
        "2 tablespoons fennel seeds",
        "2 teaspoons herbes de Provence",
        "12 skin-on branzino fillets (4 to 5 ounces each), pin bones removed",
        "Juice of 1 lemon, plus wedges for serving",
        "1 small green bell pepper, diced",
        "2 medium cucumbers, peeled, seeded and diced"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Salsa",
        "Fish"
    ],
    "title": "Pan-Seared Branzino With Herb Salsa",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/pan-seared-branzino-with-herb-salsa-recipe"
}
