{
    "directions": [
        "Preheat oven to 450°F.",
        "Trim beets, leaving about 1 inch of stems attached, and reserve greens with stems. Wrap beets tightly in foil and in a baking pan roast in middle of oven until tender, about 1 hour. Unwrap beets carefully. When beets are cool enough to handle, slip off skins and stems.",
        "In a blender or food processor puree beets with water, soy sauce, vinegar, and salt and pepper to taste until smooth. Transfer sauce to a small saucepan and keep warm, covered.",
        "Cut greens into 1/2-inch-wide slices and chop stems. In a 12-inch nonstick skillet heat 1 1/2 tablespoons butter over moderate heat until foam subsides and cook gingerroot, stirring, 30 seconds. Add greens and cook, stirring occasionally, until tender, about 10 minutes. Season greens with salt and pepper and keep warm, covered.",
        "Pat sea bass fillets dry. Sprinkle fillets with coriander and season with salt and pepper. In a large nonstick skillet heat remaining 1 1/2 tablespoons butter over moderately high heat until foam subsides and sauté fillets, skin sides down, pressing gently with a spatula if fillets curl, until skin is golden, about 3 minutes. Turn fish over and sauté about 2 minutes more, or until just cooked through.",
        "Serve sea bass with beet greens and sauce."
    ],
    "ingredients": [
        "1 pound red beets with greens (about 3 medium)",
        "1 cup water",
        "1 1/2 tablespoons soy sauce",
        "1 tablespoon balsamic vinegar",
        "3 tablespoons unsalted butter",
        "1 teaspoon minced peeled fresh gingerroot",
        "4 sea bass fillets (about 1/2 pound each)",
        "1/2 teaspoon ground coriander"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Leafy Green",
        "Sauté",
        "Beet",
        "Fall",
        "Gourmet"
    ],
    "title": "Pan-Seared Sea Bass with Beet Sauce and Beet Greens",
    "url": "http://www.epicurious.com/recipes/food/views/pan-seared-sea-bass-with-beet-sauce-and-beet-greens-15294"
}
