{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Make a lengthwise cut in each pork tenderloin about 3/4 of the way through. Open each tenderloin, creating a rectangular shape, and place each between two sheets of plastic wrap. Pound each tenderloin into a thin rectangle, about 1/2 to 1/2-inch thick. Remove the plastic wrap, and season each tenderloin to taste with salt and pepper on both sides.",
        "Spread tapenade on 2/3 of each tenderloin sheet, leaving about 1/2 inch of space on the edges. Sprinkle blue cheese and thyme over the tapenade. Starting from the side with the stuffing, roll the meat firmly towards the side without stuffing, being careful not to roll so tightly that you squeeze the stuffing out. Use toothpicks or butcher's twine to secure each roll.",
        "Heat 3 tablespoons canola oil in a large, ovenproof skillet over medium-high heat until it begins to smoke. Lightly dredge each tenderloin roll in flour, and shake off excess. Sear the tenderloins in hot oil until golden brown on all sides, about 6 minutes.",
        "Roast in preheated oven to an internal temperature of 145 degrees F (63 degrees C), 20 to 22 minutes. Remove the pork from the skillet, and set aside to rest in a warm place.",
        "Return skillet to stove over medium-high heat. Heat remaining 1 tablespoon canola oil, then stir in shallots and cook until translucent, 1 to 2 minutes. Pour in white wine, and boil until reduced by half, scraping the caramelized bits off of the bottom of the pan. Whisk in the Dijon mustard, honey, and lemon juice until smooth. Remove pan from the heat, and rapidly whisk in butter cubes until dissolved. Stir in minced parsley, and season to taste with salt and pepper.",
        "To serve, remove toothpicks or twine from the pork, and slice into 1/2-inch medallions. Serve the pork slices ladled with sauce."
    ],
    "ingredients": [
        "3 pounds whole pork tenderloins",
        "Kosher salt and fresh cracked pepper to taste",
        "1 cup prepared olive tapenade",
        "1/2 cup crumbled bleu cheese",
        "3 tablespoons minced fresh thyme",
        "4 tablespoons canola oil, divided",
        "1/2 cup all-purpose flour",
        "3 shallots, minced",
        "1 cup dry white wine",
        "4 teaspoons Dijon mustard",
        "2 tablespoons honey",
        "2 tablespoons lemon juice",
        "6 tablespoons cold unsalted butter, cut into pieces",
        "2 tablespoons minced parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pan Roasted Pork Tenderloin with a Blue Cheese and Olive Stuffing",
    "url": "http://allrecipes.com/recipe/132197/pan-roasted-pork-tenderloin-with-a-bl/"
}
