{
    "directions": [
        "Cook garlic in 2 tablespoons oil in a 2-quart flameproof gratin dish over moderate heat (on stovetop), stirring until softened (but with no change in color), 1 to 2 minutes. Add wine and boil until reduced by half, about 3 minutes. Add tomatoes with juice, breaking them up with a spoon, and gently simmer, stirring occasionally, until thickened, about 20 minutes. Add sea salt and pepper to taste and remove from heat.",
        "Preheat oven to 400°F.",
        "Pulse olives, basil, and anchovy to a coarse paste in a food processor (or finely chop with a knife). Add 2 tablespoons oil and pulse to combine.",
        "Lay fish fillets, skinned sides down, on a work surface and season with pepper. Divide olive paste among fillets and spread evenly. Beginning at narrow end, roll up each fillet.",
        "Arrange fish rolls, seam sides down, on tomato sauce in gratin dish. Drizzle with remaining tablespoon oil and bake, uncovered, in middle of oven, until fish is just cooked through, about 15 minutes.",
        "Transfer fish to 4 heated plates. Heat tomato sauce in gratin dish over moderate heat (on stovetop), then add spinach and cook, stirring, until wilted, about 1 minute. Spoon sauce with spinach alongside fish."
    ],
    "ingredients": [
        "2 garlic cloves, sliced",
        "5 tablespoons extra-virgin olive oil",
        "1/2 cup Chardonnay or other dry white wine",
        "1 (28- or 32-oz) can whole tomatoes in juice",
        "Fine sea salt to taste",
        "1/2 cup brine-cured black olives (3 oz), pitted",
        "1/4 cup packed fresh basil leaves",
        "1 flat anchovy fillet",
        "4 (7-oz) lemon sole fillets",
        "5 oz baby spinach"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Tomato",
        "Bake",
        "Basil",
        "Spinach",
        "White Wine",
        "Gourmet"
    ],
    "title": "Pan-Baked Lemon Sole with Spinach, Olives, and Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/pan-baked-lemon-sole-with-spinach-olives-and-tomatoes-107980"
}
