{
    "directions": [
        "Grind 1 teaspoon rosemary with coriander seeds and garlic with a mortar and pestle to make a paste, then stir in 1/2 teaspoon oil.",
        "Pat venison dry and put in a bowl, then rub with paste. Season well with pepper, then cover and chill 20 minutes.",
        "Preheat oven to 450°F.",
        "Heat a well-seasoned cast-iron skillet over high heat until hot, then add remaining teaspoon oil, tilting skillet to coat evenly. Season venison well with salt, then brown, turning once, about 6 minutes total.",
        "Transfer skillet to middle of oven and roast venison until an instant-read thermometer inserted diagonally into center registers 125°F, 7 to 10 minutes. Transfer meat to a plate and cover tightly with foil.",
        "Add wine and cherries to skillet and deglaze by boiling over moderately high heat, stirring and scraping up brown bits. Stir together broth, water, cornstarch, and remaining 1/2 teaspoon rosemary in a bowl and add to skillet. Simmer, stirring, until mixture is thickened, about 5 minutes. Whisk in jelly and salt and pepper to taste.",
        "Cut venison into 1/4-inch-thick slices and serve with sauce."
    ],
    "ingredients": [
        "1 1/2 teaspoons chopped fresh rosemary",
        "1 teaspoon coriander seeds",
        "1 large garlic clove",
        "1 1/2 teaspoons extra-virgin olive oil",
        "1 (1-lb) venison tenderloin",
        "1/4 cup dry red wine",
        "1/4 cup dried tart cherries",
        "3/4 cup fat-free beef broth",
        "1/2 cup water",
        "1 teaspoon cornstarch",
        "2 tablespoons black-currant jelly"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Dried Fruit",
        "Rosemary",
        "Venison",
        "Red Wine",
        "Fall",
        "Gourmet"
    ],
    "title": "Pan-Seared Venison with Rosemary and Dried Cherries",
    "url": "http://www.epicurious.com/recipes/food/views/pan-seared-venison-with-rosemary-and-dried-cherries-104558"
}
