{
    "directions": [
        "Mix salt and black pepper together; season both sides of each pork chop.",
        "Press both sides of apple slices into brown sugar to coat them.",
        "Cook bacon in a non-stick skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels, reserving bacon grease in the skillet.",
        "Mix 1 tablespoon olive oil and 1 tablespoon butter into the reserved bacon grease over medium heat; cook the brown sugar-coated apple slices until apples are tender and glazed, about 5 minutes. Transfer glazed apples to a plate in a single layer leaving room between each apple.",
        "Stir in the remaining 1 tablespoon olive oil and 1 tablespoon butter to the skillet over medium-high heat. Brown pork chops, about 2 minutes per side. Transfer pork chops to a plate.",
        "Mix Swanson(R) Unsalted Chicken Stock, lemon juice, and 1/2 of the green onions into the skillet mixture; bring liquid to a simmer. Check sauce for seasoning; add salt to taste, if desired.",
        "Place the browned pork chops in the skillet and simmer in the sauce until pork chops are cooked through, about 20 minutes.",
        "Serve topped with 4 glazed apple slices per chop. Sprinkle with crumbled bacon; spoon a generous amount of the pan sauce over top. Finish with a sprinkle of green onions."
    ],
    "ingredients": [
        "1 teaspoon kosher salt",
        "1/2 teaspoon black pepper",
        "4 thin-cut, bone-in center-cut pork loin chops",
        "1 tart red apple (such as Braeburn), cored, cut into 16 slices",
        "1/2 cup packed light brown sugar",
        "6 slices bacon",
        "2 tablespoons olive oil, divided",
        "2 tablespoons butter, divided",
        "1 cup Swanson® Unsalted Chicken Stock",
        "1 lemon, juiced",
        "4 green onions, chopped, divided",
        "salt to taste (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pan Seared Pork Chops Topped with Brown Sugar Glazed Apples and Bacon",
    "url": "http://allrecipes.com/recipe/244814/pan-seared-pork-chops-topped-with-bro/"
}
