{
    "directions": [
        "Sprinkle fillets with 2 1/2 teaspoons salt and 1 teaspoon pepper. In large nonstick skillet over moderately high heat, heat 1/2 tablespoon oil until hot but not smoking. Working in two batches (wipe pan clean and add 1 1/2 teaspoons oil between batches), fry fish until golden, about 3 minutes per side. Transfer to platter and loosely cover with foil to keep warm.",
        "In large nonstick skillet over moderate heat, heat remaining tablespoon oil. Add leeks and garlic and sauté 2 minutes. Add butter, broccolini, cauliflower, and green beans and sauté until vegetables are crisp-tender, about 8 to 10 minutes.",
        "Transfer vegetables to serving platter and sprinkle with remaining teaspoon salt and 1/2 teaspoon pepper. Top with fish and drizzle with any butter and pan juices remaining in skillet."
    ],
    "ingredients": [
        "4 (6- to 8-ounce) fillets Petrale sole*",
        "3 1/2 teaspoons kosher salt",
        "1 1/2 teaspoons freshly ground black pepper",
        "2 tablespoons olive oil",
        "2 small leeks (white and pale green parts only), halved lengthwise, rinsed, and thinly sliced",
        "2 cloves garlic, finely chopped",
        "2 tablespoons unsalted butter",
        "1 bunch broccolini (6 to 8 ounces), quartered**",
        "1 1/2 cups baby cauliflower, quartered (about 4 heads)***",
        "1/2 pound green beans, trimmed",
        "*Lemon sole, gray sole, or flounder may be substituted.",
        "**Broccolini is sometimes called baby broccoli. If unavailable, use 1 1/2 cups broccoli florets (about 1 head).",
        "***If baby cauliflower is unavailable, use 1 1/2 cups cauliflower florets (about 1 head)."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Garlic",
        "Onion",
        "Vegetable"
    ],
    "title": "Pan-Seared Petrale Sole with Local Winter Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/pan-seared-petrale-sole-with-local-winter-vegetables-235808"
}
