{
    "directions": [
        "Discard any bruised or wilted outer leaves from bok choy, then cut leaves from stalks, keeping leaves and stalks separate. Thinly slice leaves and cut stalks diagonally into 1/2-inch-wide slices. Halve carrot lengthwise and cut diagonally into 1/4-inch-thick slices.",
        "Heat 1 tablespoon vegetable oil in a 4- to 5-quart heavy pot over moderately high heat until hot but not smoking, then stir-fry bok choy stalks, carrot, and ginger 1 minute. Stir in Sherry, broth, and sugar and simmer, covered, 5 minutes.",
        "Meanwhile, cut scallions crosswise into 2-inch pieces, then halve lengthwise and cut into very thin matchsticks.",
        "Add bok choy leaves and scallions to carrot mixture and simmer, covered, until vegetables are tender, 3 to 5 minutes.",
        "While vegetables simmer, pat fish dry and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper. Stir together cornstarch and curry powder, then rub into skin of each fillet. Halve each fillet diagonally with a sharp knife.",
        "Stir sesame oil, remaining 1/2 teaspoon salt, and remaining 1/4 teaspoon pepper into vegetable mixture and keep warm, uncovered, on turned-off burner.",
        "Heat remaining 1 1/2 tablespoons vegetable oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then cook fish, skin sides down, gently pressing occasionally with a metal spatula (to keep skin flat), until skin is golden, 2 to 3 minutes. Turn fish over and cook until just cooked through, about 2 minutes more. Remove from heat.",
        "Divide broth and vegetables among 4 shallow bowls and stack 2 fish halves, skin sides up, in center of each bowl."
    ],
    "ingredients": [
        "1/4 lb Shanghai bok choy (about 3 small heads)",
        "1 medium carrot",
        "2 1/2 tablespoons vegetable oil",
        "1 (1 1/2-inch) piece peeled fresh ginger, cut into very thin matchsticks",
        "1/4 cup medium-dry Sherry",
        "2 cups reduced-sodium chicken broth (16 fl ounces)",
        "2 teaspoons sugar",
        "3 scallions",
        "4 (4- to 5-ounce) sea bass or striped bass fillets with skin, pin bones removed",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1 teaspoon cornstarch",
        "1 teaspoon curry powder",
        "1 teaspoon Asian sesame oil",
        "Garnish: fresh cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Quick & Easy",
        "Dinner",
        "Bass",
        "Curry",
        "Sherry",
        "Pan-Fry",
        "Bok Choy",
        "Gourmet"
    ],
    "title": "Pan-Seared Fish Fillets in Ginger Broth",
    "url": "http://www.epicurious.com/recipes/food/views/pan-seared-fish-fillets-in-ginger-broth-233537"
}
