{
    "directions": [
        "Combine cornstarch, paprika, kosher salt, white pepper, and cayenne (if using) in a plate. Pat fish dry with paper towels. Coat fish on all sides with the seasoning mix.",
        "Heat butter and oil in a 12-inch skillet over medium heat. Add minced garlic and cook until garlic is fragrant but not brown, about 30 seconds. Add quartered mushrooms and a pinch of salt; cook until mushrooms are lightly browned, about 3 minutes. Remove mushrooms from skillet. If pan is dry, add a tablespoon of additional olive oil.",
        "Increase heat to medium high. Gently place fish into skillet in a single layer. Sear until a crust forms on the bottom, about 5 minutes. Turn the fish and sear the other side for about 4 minutes. Remove fish from pan.",
        "Reduce heat to medium low. Return the mushrooms to the skillet along with the chopped green onions; stir. Pour in the Classico Creamy Alfredo Sauce and heat for 4 minutes but do not bring to a boil. Place the fish into the sauce. Reduce heat to low to keep warm.",
        "In a separate lidded skillet, heat 1 tablespoon olive oil over medium heat. Add minced garlic and cook for about 30 seconds. Place broccoli in the pan and season with a large pinch of kosher salt and white sugar. Add water, cover; steam over medium heat until broccoli is bright green and stalks are tender, about 8 to 10 minutes.",
        "Arrange broccoli along the rim of a platter in a circle with the crowns facing out. Carefully place fish in the middle. Squeeze two wedges of lemon over fish and broccoli. Pour sauce and mushrooms over the fish. Garnish with toasted pecans.",
        "Serve with additional lemon wedges if desired."
    ],
    "ingredients": [
        "Seasoning Mix:",
        "2 tablespoons cornstarch",
        "1/2 teaspoon paprika",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon white pepper",
        "1 pinch cayenne pepper (optional)",
        "4 (4 ounce) cod fillets",
        "1 tablespoon olive oil",
        "1 tablespoon butter",
        "1 large clove garlic, minced",
        "1 (8 ounce) package fresh mushrooms, quartered",
        "Salt to taste",
        "4 green onions, diced",
        "1 (15 ounce) jar Classico® Fresh Creamy Alfredo Sauce",
        "For the broccoli:",
        "1 tablespoon olive oil",
        "1 large clove garlic, minced",
        "1 1/2 pounds broccoli crowns, trimmed into individual florets",
        "1 pinch white sugar",
        "1/8 teaspoon kosher salt",
        "1/4 cup water",
        "1 lemon, cut into wedges",
        "2 tablespoons pecan halves, toasted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pan-Seared Cod, Broccoli, and Mushrooms with Creamy Alfredo Sauce",
    "url": "http://allrecipes.com/recipe/238612/pan-seared-cod-broccoli-and-mushroo/"
}
