{
    "directions": [
        "Halve the bread horizontally, hollow out the top and the bottom, leaving 1/2-inch-thick shells, and brush the bottom shell with 1 tablespoon of the oil. In a blender combine the remaining 3 tablespoons oil with the garlic, the vinegar, and salt to taste and blend the dressing until it is emulsified. Spread the goat cheese in the bottom shell and top it with the olives, the arugula, the radishes, and salt and pepper to taste. Drizzle the radishes with one third of the dressing, top them with the tuna and salt and pepper to taste, and drizzle half the remaining dressing over the tuna. Top the tuna with the tomatoes, the basil, and salt and pepper to taste, drizzle the mixture with the remaining dressing, and fit the top shell over it. Wrap the pan bagna tightly in plastic wrap and put it in a shallow baking pan. Top the pan bagna with a baking sheet and a large gratin dish filled with several 1-pound weights and chill it for 1 hour. The pan bagna may be made 6 hours in advance and kept covered and chilled. Serve the pan bagna cut into 2-inch slices."
    ],
    "ingredients": [
        "a 16-inch sourdough or whole wheat baguette",
        "4 tablespoons olive oil",
        "1 small garlic clove",
        "1 tablespoon balsamic vinegar",
        "3 ounces mild goat cheese, such as Montrachet",
        "6 Kalamata olives (not available at farmers markets, but a great addition), pitted and sliced",
        "1 cup arugula leaves, rinsed and spun dry",
        "3 large radishes, sliced",
        "1 1/2 cups sliced cooked fresh tuna steak (about 6 ounces)",
        "3 small tomatoes, sliced thin",
        "8 large fresh basil leaves, shredded"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Olive",
        "Tomato",
        "No-Cook",
        "Lunch",
        "Goat Cheese",
        "Basil",
        "Tuna",
        "Arugula",
        "Radish",
        "Summer",
        "Chill",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pan Bagna",
    "url": "http://www.epicurious.com/recipes/food/views/pan-bagna-12303"
}
