{
    "directions": [
        "Cut off the ends of the plantains and slice a slit into the skin on two sides. Cut the plantains into 1 inch pieces, soak them in ice water for 10 minutes. Remove from the water and use a sharp knife to peel the skin away. Place the plantain pieces in a pot with 3 cups water and bring to a boil. Reduce heat and simmer for 15 minutes, then drain, reserving the cooking liquid, and mash the plantains in a potato ricer or with a potato masher. Add a bit of cooking liquid to loosen, then add the butter, garlic, and scallions. Season with salt and pepper and hold, keeping warm, until ready to use.",
        "Clean the scallops of the connective muscle, and rinse lightly. Drain and pat dry.",
        "Combine the flour, pimenton, paprika, salt, and pepper in a wide, shallow bowl.",
        "Heat the olive oil in a heavy-bottomed skillet over medium heat. Dust the scallops in the flour-pimenton mixture, add them to the skillet and sauté until lightly browned on one side. Turn and cook the second side. Add the chorizo and cook several more minutes. Stir in the drained raisins.",
        "Place a spoonful of mashed plantains on each plate, and top with several scallops and some of the raisins and chorizo. Sprinkle with cilantro leaves and pistachios and serve."
    ],
    "ingredients": [
        "2 pounds (4 large) ripe, black, plantains",
        "Ice water",
        "3 cups water",
        "1/4 cup sweet butter",
        "1 tablespoons finely chopped garlic (2 large cloves)",
        "3 tablespoons chopped scallions (3 large)",
        "2 pounds U10 scallops - large, dry, day boat quality",
        "1/3 cup olive oil",
        "1/2 cup flour",
        "2 tablespoons Spanish Pimenton (smoked, hot paprika)",
        "8 ounces dry-cured Spanish chorizo sausage, thinly sliced",
        "1/2 cup white raisins, soaked in hot water for 10 minutes and drained",
        "3 sprigs cilantro leaves only",
        "1/2 cup shelled pistachio nuts (about 1 ounce)",
        "Salt and pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Pork",
        "Shellfish",
        "Sauté",
        "Raisin",
        "Sausage",
        "Pistachio",
        "Plantain"
    ],
    "title": "Pan Seared Sea Scallops with Chorizo and Fu Fu",
    "url": "http://www.epicurious.com/recipes/food/views/pan-seared-sea-scallops-with-chorizo-and-fu-fu-107667"
}
