{
    "directions": [
        "Season both sides of chicken with salt, pepper, and dried thyme. Place flour in a shallow dish and dredge both sides of chicken pieces in flour.",
        "Heat oil in pan over medium-high heat. When oil starts to shimmer, add the chicken. (If the chicken browns too quickly, reduce heat.) Cook, turning as needed, until chicken is browned on both sides, is no longer pink in the center, and the juices run clear, 4 or 5 minutes total on each side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Transfer chicken to a plate and tent with foil.",
        "In the same pan, reduce heat to low and add thyme sprigs and cook until aromatic, 1 or 2 minutes. Increase heat to high; pour in Swanson(R) Chicken Stock and wine. Stir up browned bits to deglaze the pan. Add the chicken bouillon granules and mix well. Reduce heat to medium and cook until sauce reduces and is slightly thickened, about 5 minutes. Remove pan from heat.",
        "Remove and discard the thyme sprigs. Add to the pan any accumulated juices from the tented chicken plate. Finish the sauce by whisking in the cold butter. Season with salt and pepper to taste.",
        "Spoon sauce over chicken before serving."
    ],
    "ingredients": [
        "Chicken:",
        "4 skinless, boneless chicken breast halves, cut in half lengthwise to make thin cutlets",
        "salt and ground black pepper to taste",
        "1 teaspoon dried thyme",
        "1/4 cup flour",
        "4 tablespoons olive oil",
        "Sauce:",
        "2 sprigs fresh thyme",
        "1 cup Swanson® Chicken Stock",
        "1/4 cup white wine",
        "2 teaspoons chicken bouillon granules",
        "2 teaspoons cold butter",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pan-Seared Chicken with Thyme",
    "url": "http://allrecipes.com/recipe/245077/pan-seared-chicken-with-thyme/"
}
