{
    "directions": [
        "Preheat oven to 400°F. Arrange eggplant, celery root and potato separately in single layer on 3 nonstick baking sheets. Brush both sides of vegetables with oil. Sprinkle with salt and pepper. Working in batches, bake until vegetables are tender, and celery root and potato are pale golden, about 6 minutes for eggplant, 10 minutes for celery root, and 14 minutes for potato. Transfer vegetables to separate small bowls. Cool completely.",
        "Char red bell peppers over gas flame or in broiler until blackened on all sides. Enclose in paper bag; let stand 10 minutes. Peel and seed peppers. Quarter peppers lengthwise.",
        "Place 12x12-inch foil sheet on work surface. Arrange half of potato slices over foil, forming 9x9-inch square. Arrange half of celery root slices over potato slices. Arrange half of eggplant slices over celery root slices. Arrange basil leaves over eggplant. Repeat layering with goat cheese, mozzarella. and red peppers. Press firmly to compress layers. Repeat layering with remaining eggplant, celery root, then potato slices.",
        "Using foil as aid, carefully roll up terrine as for jelly roll. Wrap terrine in additional foil. (Can be prepared 1 day ahead. Refrigerate.)",
        "Freeze terrine until firm on edges but not frozen through, about 2 hours. Slice terrine into eight 1-inch-thick slices (do not remove foil). Transfer slices to baking sheet and freeze 10 minutes.",
        "Lightly coat cut sides of terrine slices with flour. Heat 1 tablespoon oil in large nonstick skillet over medium-high heat. Add slices and cook until vegetables are heated through and cheese begins to melt, about 2 minutes per side. Remove foil from slices. Arrange slices on plates and serve."
    ],
    "ingredients": [
        "1 1 1/4-pound eggplant, cut crosswise into 1/4-inch-thick slices",
        "1 1 1/4-pound celery root, peeled, cut crosswise into 1/8-inch-thick slices",
        "1 14-ounce russet potato, peeled, cut crosswise into 1/8-inch-thick slices",
        "Olive oil (for brushing vegetables)",
        "2 large red bell peppers",
        "2 3.5-ounce logs fresh goat cheese (such as Montrachet), cut into 1/4-inch-thick slices",
        "12 large fresh basil leaves",
        "1 7-ounce ball drained fresh water-packed mozzarella, cut into 1/4-inch-thick slices (Regular mozzarella can be substituted.)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Appetizer",
        "Sauté",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Goat Cheese",
        "Mozzarella",
        "Basil",
        "Celery",
        "Eggplant",
        "Bell Pepper",
        "Winter",
        "Pan-Fry",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Pan Fried Celery Root, Potato, and Goat Cheese Terrine",
    "url": "http://www.epicurious.com/recipes/food/views/pan-fried-celery-root-potato-and-goat-cheese-terrine-5355"
}
