{
    "directions": [
        "Preheat oven to 400°F.",
        "Cook shallots and garlic in butter in an ovenproof 12-inch heavy skillet over moderate heat, stirring, until golden, about 5 minutes. Add chard stems and center ribs and cook, covered, stirring occasionally, until crisp-tender, 3 to 4 minutes. Add leaves and cook, uncovered, stirring occasionally, until tender, 6 to 7 minutes. Season with salt and pepper, then transfer chard to a heavy saucepan and wipe out skillet.",
        "Pat chops dry and season with salt and pepper. Heat oil in skillet over moderately high heat until hot but not smoking, then brown chops, about 3 minutes per side.",
        "Transfer skillet to oven and roast until an instant-read thermometer inserted horizontally 2 inches into meat registers 155°F, 7 to 9 minutes. Transfer chops with tongs to a platter, leaving fat in skillet, and cover chops loosely with foil to keep warm.",
        "Sauté shallots in fat remaining in skillet over moderately high heat, stirring, until golden, about 5 minutes. Add wine and deglaze by boiling over high heat, scraping up brown bits, until reduced by half. Add cranberries and stock and simmer, stirring occasionally, until cranberries begin to burst, about 2 minutes. Stir in brown sugar and thyme and simmer, stirring, until berries are collapsed, about 3 minutes. Remove from heat and stir in butter until incorporated, then season with salt and pepper.",
        "While sauce is cooking, reheat chard over moderate heat, stirring. Divide among 4 plates and top with chops, then spoon sauce over."
    ],
    "ingredients": [
        "1/3 cup minced shallots (2 medium)",
        "1 tablespoon minced garlic",
        "2 tablespoons unsalted butter",
        "1 lb red Swiss chard, stems and center ribs cut out and chopped together, leaves coarsely chopped separately",
        "4 (1 1/4-inch-thick) rib pork chops",
        "1 1/2 tablespoons extra-virgin olive oil",
        "1/3 cup minced shallots (2 medium)",
        "1/2 cup dry red wine",
        "1 cup fresh or thawed frozen cranberries (4 1/2 oz)",
        "3/4 cup chicken stock or broth",
        "3 tablespoons packed light brown sugar",
        "1 1/2 teaspoons chopped fresh thyme or 1/2 teaspoon dried, crumbled",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Pork",
        "Roast",
        "Cranberry",
        "Red Wine",
        "Fall",
        "Chard",
        "Shallot",
        "Gourmet"
    ],
    "title": "Pan-Roasted Pork Chops with Cranberries and Red Swiss Chard",
    "url": "http://www.epicurious.com/recipes/food/views/pan-roasted-pork-chops-with-cranberries-and-red-swiss-chard-105723"
}
