{
    "directions": [
        "Heat a skillet to high and add 1/4 cup cooking oil, then the onion, carrot, celery, and 1/2 teaspoon salt. Stir until it gets going, then turn to medium and cook, stirring occasionally, until the vegetables are soft and browned very lightly, if at all, about 20 minutes. Use a lid or a splash of water if it's coloring too much before getting soft. Turn the mirepoix out onto a plate and set it aside to cool completely. Grate 1/2 teaspoon zest from the lime and set it aside.",
        "Chop the cod into 1/4-inch dice, place it in a medium bowl, and season it with 3/4 teaspoon salt and some grindings of black pepper. In the bowl of a food processor, combine a quarter of the fish with the cream and pulse until smooth, scraping down the sides as needed. Add the fish purée back to the bowl of chopped fish along with the cooled vegetable mixture, cilantro, jalapeño, lime zest, 1 1/2 cups bread crumbs, and 2 of the eggs. Stir with your hands and squeeze through your fingers to mix everything really well, then heat a skillet to medium, add a teaspoon of oil and fry a little piece for tasting. Adjust as needed and when you have the seasoning right, begin breading: Beat the remaining 2 eggs in a wide, shallow bowl, put the flour in another bowl, and the remaining 2 cups bread crumbs in a third. Have a baking sheet ready to receive the breaded cakes. Pat the fish mixture down in the bowl, smooth the top, divide it in half, then separate each half into 3 parts to make sixths. Scoop up half of one of the sixths, form it into a ball with your hands, flatten it into a patty, and place it in the flour. Turn the patty to coat, shake off the excess, and then place it in the eggs. Turn it to coat completely, let excess egg drip off, and then place it in the crumbs. Coat it completely with crumbs, set it on the baking sheet, and repeat with the remaining mixture until you have 12 fishcakes. Refrigerate them for 20 minutes to 6 hours before cooking.",
        "When you’re ready, heat a skillet to medium-high and heat the oven to warm for holding one batch of fishcakes as you fry the rest. Add 1/4 inch of oil to the skillet and then as many fishcakes as will fit in a single layer. Fry, adjusting the heat as needed, until one side of the cakes is golden brown, about 4 minutes. Turn and brown the other side. Peek into one of the cakes to be sure it’s cooked through and then keep the batch warm in the oven while you fry the rest. Right before serving, squeeze lime juice over the fishcakes."
    ],
    "ingredients": [
        "Cooking oil, olive or vegetable",
        "1 yellow onion, diced",
        "1 carrot, finely diced",
        "1 celery stalk, finely diced",
        "Salt",
        "1 lime",
        "1 pound cod fillet, or other mild white fish",
        "Freshly ground black pepper",
        "1/3 cup heavy cream",
        "1/4 cup chopped cilantro leaves and stems",
        "1 jalapeño, seeded and finely diced (or less or more)",
        "3 1/2 cups fresh bread crumbs",
        "4 eggs",
        "1 cup all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Dinner",
        "Fish",
        "Jalapeño",
        "Lime",
        "Cod",
        "Celery",
        "Breadcrumbs"
    ],
    "title": "Pan-Fried Fishcakes",
    "url": "http://www.epicurious.com/recipes/food/views/pan-fried-fishcakes"
}
