{
    "directions": [
        "Heat the 1/4 cup oil in a medium saucepan over high heat until smoking. Add the tortillas and fry until crisp, about 1 minute. Remove to a plate.",
        "Add the pumpkin seeds to the pan and cook until golden, 2 to 3 minutes. Transfer to a plate.",
        "Add the onion to the pan and cook until soft, 3 to 4 minutes. Add the garlic and cook for 1 minute. Add the stock, yellow peppers, mango, tomatillos, and raisins and boil, stirring occasionally, until reduced by half, 25 to 30 minutes.",
        "Transfer the yellow pepper mixture, the fried tortillas, and the pumpkin seeds to a food processor and process until smooth. Strain the sauce into a clean medium saucepan and simmer over medium heat until it reaches a sauce consistency, 15 to 20 minutes. Keep warm over low heat.",
        "Preheat the oven to 425 degrees F.",
        "Heat the 2 tablespoons oil in a large ovenproof sauté pan over high heat until almost smoking. Season the chops on both sides with salt and pepper. Place the chops in the pan and cook until golden brown, 4 to 5 minutes; flip the chops over and place the pan in the oven. Roast until medium, 8 to 10 minutes.",
        "Remove the chops from the pan and let rest for 5 minutes before serving. While the chops are resting, add the chocolate, honey, cloves, and cinnamon to the sauce and season with salt and pepper. Cook for 5 minutes. The mole sauce can be made up to 1 day in advance and refrigerated. Reheat before serving.",
        "Ladle some of the sauce onto each of 4 large dinner plates and top with a pork chop."
    ],
    "ingredients": [
        "1/4 cup plus 2 tablespoons canola oil",
        "2 (6-inch) yellow corn tortillas, coarsely chopped",
        "1/4 cup raw pumpkin seeds",
        "1 medium red onion, chopped",
        "4 cloves garlic, chopped",
        "4 cups low-sodium chicken broth",
        "3 yellow bell peppers, roasted, peeled, seeded, and chopped",
        "1 ripe mango, peeled, pitted, and chopped",
        "2 tomatillos, husked, scrubbed, and chopped",
        "3 tablespoons golden raisins",
        "4 (10- to 12-ounce) center-cut bone-in pork chops",
        "Kosher salt and freshly ground white pepper",
        "1/2 ounce white chocolate, chopped",
        "1 tablespoon honey",
        "1/4 teaspoon ground cloves",
        "1/2 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Roast",
        "Cinco de Mayo",
        "Dinner",
        "Pork Chop",
        "Bell Pepper",
        "Tomatillo",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pan-Roasted Pork Chops with Yellow Pepper Mole Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pan-roasted-pork-chops-with-yellow-pepper-mole-sauce-363310"
}
