{
    "directions": [
        "Place fish in a flat-bottomed glass or ceramic dish just large enough to hold fillets in 1 layer. Stir together juices in a small bowl, then combine 1 tablespoon mixed juices with sake in another small bowl and pour over fillets. Marinate fish, covered, at room temperature, 10 minutes. Stir together mirin and 2 tablespoons soy sauce, then pour over fillets and marinate, covered, at room temperature, 5 minutes more (or in refrigerator up to 1 hour). Remove fish from marinade and pat dry. Discard marinade.",
        "Stir together water, sugar, and remaining tablespoon each mixed juices and soy sauce in a small bowl.",
        "Heat oil in a 12-inch heavy nonstick skillet over moderately high heat until hot but not smoking, then sauté fillets, skin side down, until just crisp and golden brown, 1 to 2 minutes. Turn fillets over and sauté until browned, about 1 minute more. Add soy mixture to skillet and cook, swirling skillet occasionally, until sauce is reduced to a glaze and fillets are just cooked through, about 3 minutes. (If sauce reduces before fish is cooked through, swirl in 1 additional tablespoon water, repeating as necessary until fish is done.)"
    ],
    "ingredients": [
        "4 (4-ounce) pieces Spanish mackerel fillet, any bones removed",
        "1 tablespoon fresh grapefruit juice",
        "1 tablespoon fresh lime juice",
        "2 tablespoons sake",
        "3 tablespoons mirin (Japanese sweet rice wine)",
        "3 tablespoons Japanese light soy sauce",
        "1 tablespoon water",
        "2 teaspoons sugar",
        "2 teaspoons vegetable oil",
        "Garnish: lime slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Citrus",
        "Fish",
        "Marinate",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Grapefruit",
        "Lime",
        "Sake",
        "Soy Sauce",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Pan-Glazed Fish with Citrus and Soy",
    "url": "http://www.epicurious.com/recipes/food/views/pan-glazed-fish-with-citrus-and-soy-108732"
}
