{
    "directions": [
        "Preheat broiler. Brush large baking sheet with oil. Place tomatoes and bell peppers, cut side down, on prepared sheet. Broil until tomatoes and peppers begin to char and blister, about 5 minutes. Cool. Peel skins from 1 pepper half, then cut into thin strips; set aside. Chop tomatoes and remaining peppers (do not peel).",
        "Melt 1 tablespoon butter in large nonstick skillet over medium heat. Add shallots and sauté until tender, about 4 minutes. Add broth and wine; bring to boil. Add chopped tomatoes, chopped bell peppers, 1/2 cup basil, and crushed red pepper. Boil mixture gently until reduced to 2 cups, stirring occasionally, about 15 minutes. Cool slightly. Puree mixture in blender until smooth. Pour into strainer set over bowl, pressing on solids to extract as much liquid as possible; set aside. (Sauce can be made 1 day ahead. Cover and chill.)",
        "Heat heavy large skillet (preferably cast iron) over high heat. Sprinkle steaks with salt and pepper. Working in batches, add steaks to hot dry skillet and cook about 4 minutes per side for medium-rare. Transfer to platter; cover to keep warm. Add 1/4 cup water to skillet; stir to scrape up browned bits. Add sauce to skillet; reduce heat and simmer until heated through, about 4 minutes. Remove from heat. Whisk in remaining 4 tablespoons butter, then remaining 1/4 cup basil. Season sauce with salt and pepper.",
        "Place 1 steak on each of 8 plates. Drizzle sauce over. Garnish steaks with reserved pepper strips and serve."
    ],
    "ingredients": [
        "Olive oil",
        "1 1/4 pounds plum tomatoes, halved lengthwise",
        "2 large red bell peppers, halved lengthwise, seeded",
        "5 tablespoons butter",
        "4 large shallots, minced",
        "1 14 1/2-ounce can low-salt chicken broth",
        "1/2 cup dry white wine",
        "3/4 cup chopped fresh basil",
        "1/2 teaspoon dried crushed red pepper",
        "8 8-ounce filet mignon steaks (each about 1 inch thick)",
        "1/4 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Tomato",
        "Low Carb",
        "Basil",
        "Bell Pepper",
        "Summer"
    ],
    "title": "Pan-Seared Filet Mignon with Red Bell Pepper, Tomato, and Basil Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pan-seared-filet-mignon-with-red-bell-pepper-tomato-and-basil-sauce-105168"
}
