{
    "directions": [
        "In a medium saucepan of salted boiling water blanch onions 3 minutes, or until barely tender, and drain in a colander. Peel skin away from each onion, keeping it attached at root end, and pat onion dry. In a heavy saucepan heat 2 cups oil until a deep-fat thermometer registers 375°F. and fry onions in 2 batches until crisp and brown, about 1 minute. Transfer onions as fried with a slotted spoon to paper towels and drain. Season onions with salt and pepper and cool. Onions may be made 8 hours ahead and kept, covered, at room temperature.",
        "Preheat oven to 425°F. and oil 2 baking sheets.",
        "Cut potatoes lengthwise into 1/2-inch-thick slices and arrange in one layer on baking sheets. Lightly brush slices with some oil and season with salt and pepper. Roast potatoes in middle and lower thirds of oven until golden brown and tender, about 35 minutes, and keep warm.",
        "Pat filets mignons dry and season with salt and pepper. In a large heavy skillet heat 2 tablespoons oil over moderately high heat until hot but not smoking and brown filets on both sides, without crowding, about 5 minutes total. Transfer filets to a shallow baking pan and roast in middle of oven about 10 minutes for medium-rare.",
        "On each of 6 plates fan 3 potato slices and top with a filet. Drizzle filets with some sauce and garnish with onions. Serve remaining sauce on the side."
    ],
    "ingredients": [
        "12 assorted red and yellow pearl onions, unpeeled",
        "2 cups vegetable oil for frying onions",
        "4 large russet (baking) potatoes (about 2 pounds total)",
        "about 1/4 cup vegetable oil",
        "6 1 1/4-inch-thick filets mignons (about 3 pounds total)",
        "Accompaniment: about 2 cups Merlot sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Potato",
        "Roast",
        "Sauté",
        "Steak",
        "Winter",
        "Gourmet"
    ],
    "title": "Pan-Seared Filet Mignon with Roasted Potatoes and Merlot Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pan-seared-filet-mignon-with-roasted-potatoes-and-merlot-sauce-13608"
}
