{
    "directions": [
        "Pound cutlets between sheets of waxed paper to 1/8-inch thickness. Overlap 2 pancetta slices on work surface to form oval of same size as pork. Place 1 pork cutlet atop pancetta. Repeat with remaining pancetta and pork. Mix Parmesan, breadcrumbs, parsley and garlic in small bowl. Mix in 2 tablespoons oil. Season with salt and pepper. Divide mixture among cutlets. Fold in short ends and roll up pork and pancetta, enclosing filling completely. Use toothpicks to secure rolls.",
        "Heat remaining 3 tablespoons oil in heavy large skillet over medium-high heat. Add rolls and cook until pancetta is crisp, turning frequently, about 2 minutes. Transfer rolls to plate. Remove toothpicks. Add onion and fennel seeds to drippings in skillet; sauté until soft, about 10 minutes. Add tomatoes; sauté 5 minutes. Add wine and simmer 5 minutes. Season with salt and pepper. Return rolls to skillet. Cover skillet and cook over low heat until pork is just cooked through, about 10 minutes. Serve hot."
    ],
    "ingredients": [
        "10 ounces boneless pork loin, cut into 1/4-inch-thick cutlets",
        "16 thin pancetta slices",
        "1/2 cup freshly grated Parmesan cheese",
        "1/4 cup fresh breadcrumbs",
        "1/4 cup chopped fresh parsley",
        "1 garlic clove, minced",
        "5 tablespoons olive oil",
        "1 large onion, thinly sliced",
        "1 tablespoon fennel seeds",
        "1 1-pint basket cherry tomatoes, halved",
        "1/2 cup dry white wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pork",
        "Tomato",
        "Sauté",
        "Dinner",
        "Meat",
        "Fall",
        "Summer",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pancetta-Wrapped Pork with Breadcrumb Filling and Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/pancetta-wrapped-pork-with-breadcrumb-filling-and-tomatoes-104060"
}
