{
    "directions": [
        "1. In a medium bowl, whisk the pancake mix, flour, milk, eggs, and melted butter together until smooth. Cover the bowl tightly with plastic wrap and refrigerate for at least 2 hours, and as long as overnight.",
        "2. Put the coffee in a small saucepan, bring to a simmer over medium heat, and cook until reduced by about half. Remove from the heat and cool completely.",
        "3. Put 4 tablespoons of the softened butter in a small bowl and whisk in the cooled reduced coffee until completely incorporated. Set aside until ready to serve.",
        "4. Melt 1 tablespoon of the butter on a pancake griddle or heavy skillet over medium-low heat. Add the batter by 1/4-cup amounts to make 4- to 5-inch pancakes and cook until bubbles appear on the surface and the bottoms are browned and crisp, 3 to 4 minutes. Flip the pancakes and continue cooking until browned on the bottom, 2 to 3 minutes more. Transfer to a plate in a low oven to keep warm until ready to serve. Continue with the remaining batter, adding the remaining butter as needed.",
        "5. To serve, put 3 warm pancakes on each plate. Top each serving with 1 tablespoon of the coffee butter and some warm syrup, garnish with the fruit, and serve immediately."
    ],
    "ingredients": [
        "2 cups high-quality store-bought pancake mix (such as Robby's pancake mix)",
        "1/4 cup all-purpose flour",
        "2 cups whole milk",
        "2 large eggs",
        "4 tablespoons unsalted butter, melted",
        "1/2 cup brewed coffee",
        "6 tablespoons unsalted butter, softened",
        "Pure maple syrup, warmed, for serving",
        "Sliced fresh strawberries or blueberries, sprinkled with sugar, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Breakfast",
        "Brunch",
        "Fall",
        "Spring",
        "Summer",
        "Winter",
        "Butter",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pancakes with Warm Maple Syrup & Coffee Butter",
    "url": "http://www.epicurious.com/recipes/food/views/pancakes-with-warm-maple-syrup-coffee-butter-51190420"
}
