{
    "directions": [
        "Blend flour and salt in processor 5 seconds. Add butter and cream cheese. Using on/off turns, blend until moist clumps form. Gather dough; shape into 6-inch-long log. Wrap and chill at least 1 hour and up to 1 day.",
        "Cut log into 24 1/4-inch-thick rounds. Press 1 round into each cup of 2 nonstick 12-cup mini muffin pans; freeze 30 minutes.",
        "Preheat oven to 350°F. Melt butter in large skillet over medium heat. Add leeks and sauté 10 minutes; cool. Heat oil in small skillet over medium-high heat. Add pancetta; sauté until crisp, about 6 minutes. Using slotted spoon, transfer pancetta to paper towels. Whisk half and half and next 3 ingredients in medium bowl to blend. Mix in goat cheese, then leeks and pancetta.",
        "Spoon filling into shells. Bake until filling is set and crust edges are golden, about 30 minutes. Cool in pans 5 minutes. (Can be made 1 day ahead. Cool, cover, and chill in pans. Rewarm uncovered in 350°F oven 12 minutes.)",
        "Using small knife, cut around tartlets to loosen. Turn out tartlets and arrange on platter; top each with parsley leaf.",
        "*Pancetta (bacon cured in salt) is available at Italian markets and specialty foods stores"
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "3 ounces chilled cream cheese, cut into 1/2-inch cubes",
        "2 tablespoons (1/4 stick) butter",
        "2 cups chopped leeks (white and pale green parts only; about 3 large)",
        "1 teaspoon vegetable oil",
        "4 ounces thinly sliced pancetta,* chopped",
        "2/3 cup half and half",
        "2 large egg yolks",
        "1/4 teaspoon salt",
        "1/8 teaspoon freshly ground black pepper",
        "2 ounces soft fresh goat cheese, crumbled",
        "Fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Appetizer",
        "Bake",
        "Oscars",
        "Goat Cheese",
        "Bacon",
        "Leek"
    ],
    "title": "Pancetta, Leek, and Goat Cheese Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/pancetta-leek-and-goat-cheese-tartlets-108935"
}
