{
    "directions": [
        "Combine mayonnaise, lemon juice, lemon zest, and garlic in a bowl; refrigerate for 15 to 30 minutes to blend flavors.",
        "Move an oven rack into the middle of oven and place another rack into top third; preheat oven to 400 degrees F (200 degrees C).",
        "Lay asparagus spears in a row onto a baking sheet and spray with cooking spray; sprinkle with sea salt.",
        "Drizzle haddock fillets with olive oil and sprinkle with black pepper and rosemary. Wrap each fillet loosely with 3 slices pancetta bacon, wrapping bacon so that ends meet over skinned side of fillets. Place fillets into a 9x13-inch baking dish with bacon ends on the bottom. Pour white wine around the fillets.",
        "Place fish onto lower rack of preheated oven and bake for 7 minutes. Place asparagus onto upper rack of oven. Continue baking until pancetta is browned, fish is opaque and flakes easily, and asparagus are lightly browned on the tips, 7 to 8 more minutes.",
        "Stir warm water into lemon aioli sauce until sauce is pourable; pour about 2 tablespoons sauce onto each of 4 serving dishes. Arrange haddock fillets onto sauce and spread 1/4 of the roasted asparagus in a fan shape next to each fillet."
    ],
    "ingredients": [
        "Lemon Aioli Sauce:",
        "1/2 cup mayonnaise",
        "1 lemon, juiced",
        "1 tablespoon lemon zest",
        "2 cloves garlic, minced",
        "Roasted Asparagus:",
        "1 bunch asparagus, bottom 1 inch trimmed",
        "cooking spray",
        "sea salt to taste",
        "Pancetta-Wrapped Haddock:",
        "4 6-ounce haddock fillets",
        "1 tablespoon extra-virgin olive oil",
        "1/2 teaspoon cracked black pepper",
        "1/2 teaspoon crushed dried rosemary",
        "12 thin slices pancetta bacon, or as needed - divided",
        "2/3 cup white wine",
        "1 tablespoon warm water, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pancetta-Wrapped Haddock with Lemon Aioli and Roasted Asparagus",
    "url": "http://allrecipes.com/recipe/230740/pancetta-wrapped-haddock-with-lemon-a/"
}
