{
    "directions": [
        "Mix first 4 ingredients in small bowl. Pour 5 tablespoons oil into glass baking dish. Stir in half of herbs. Add chicken. Turn to coat. Cover and chill at least 6 hours or overnight, turning occasionally.",
        "Sauté chopped pancetta in heavy large Dutch oven over medium heat until crisp, about 8 minutes. Add cabbage and sauté until tender, about 6 minutes. Season with salt and pepper. Set aside.",
        "Preheat oven to 400°F. Slightly overlap 2 slices of pancetta on work surface. Set 1 chicken breast half atop pancetta. Sprinkle chicken with salt and pepper. Top chicken with 1/4 of remaining herb mixture. Place 2 more slices pancetta atop chicken, tucking edges around chicken to enclose. Repeat with remaining pancetta, chicken and herbs.",
        "Heat 3 tablespoons oil in heavy large skillet over medium-high heat. Add rosemary sprigs and garlic and sauté until rosemary is fragrant and garlic begins to brown, about 5 minutes. Using slotted spoon, remove rosemary and garlic and discard. Add chicken to skillet and cook until golden brown, about 2 minutes per side. Transfer chicken to heavy baking sheet, being careful to leave pancetta wrapped around chicken. Bake chicken until cooked through, about 12 minutes.",
        "Meanwhile, drain drippings from skillet. Add wine to same skillet and boil until reduced to 1/4 cup, about 8 minutes. Season with salt and pepper.",
        "Rewarm cabbage over medium heat, stirring often. Divide cabbage among 4 plates. Top each with chicken breast. Drizzle 1 tablespoon sauce over."
    ],
    "ingredients": [
        "2 tablespoons chopped fresh rosemary",
        "2 tablespoons chopped fresh sage",
        "2 tablespoons chopped fresh thyme",
        "2 tablespoons crumbled bay leaves",
        "8 tablespoons olive oil",
        "4 skinless boneless chicken breast halves",
        "6 ounces pancetta, chopped",
        "1 1 1/2-pound cabbage, cored, thinly sliced",
        "16 very thin slices pancetta",
        "3 fresh rosemary sprigs",
        "3 garlic cloves, peeled",
        "1 1/2 cups dry white wine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Bake",
        "Marinate",
        "Sauté",
        "Bacon",
        "Cabbage",
        "Washington, D.C."
    ],
    "title": "Pancetta-Wrapped Chicken with Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/pancetta-wrapped-chicken-with-cabbage-738"
}
