{
    "directions": [
        "Preheat oven to 400°F. Melt 1/4 cup butter in large skillet over medium heat. Add giblets (if using), onion, carrot, sage, and garlic. Sauté until carrot is tender, about 10 minutes. Add wine; simmer until evaporated, scraping up browned bits. Remove from heat. Mix in bread, walnuts, egg, Parmesan, 1/2 teaspoon salt, and 1/2 teaspoon pepper.",
        "Spoon stuffing into cavities of chickens; skewer cavities closed. Rub each chicken with 2 tablespoons butter; sprinkle with salt and pepper. Arrange in roasting pan. Lay 6 pancetta slices atop each to cover. Surround with fennel.",
        "Roast chickens and fennel 45 minutes. Turn fennel over. Roast until chickens are golden and thermometer inserted into thickest part of thigh registers 165°F, basting with pan juices, about 30 minutes. Transfer chickens and fennel to platter. Let rest 10 minutes.",
        "Tilt roasting pan; spoon fat from pan juices. Serve chickens with pan juices.",
        "Pancetta (Italian bacon) is sold in the deli case of many supermarkets and at Italian markets."
    ],
    "ingredients": [
        "8 tablespoons (1 stick) butter, divided",
        "Chopped hearts, livers, and gizzards reserved from chickens (optional)",
        "1 cup chopped onion",
        "3/4 cup small cubes peeled carrot",
        "2 large fresh sage leaves, minced",
        "1 large garlic clove, halved",
        "1/4 cup dry white wine",
        "1 cup small cubes crustless country bread",
        "1/2 cup coarsely chopped walnuts",
        "1 large egg, beaten to blend",
        "1 tablespoon grated Parmesan cheese",
        "1/2 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "2 4-pound chickens, rinsed, patted dry",
        "12 thin pancetta slices",
        "3 large fresh fennel bulbs, trimmed, each cut into 6 wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Roast",
        "High Fiber",
        "Dinner",
        "Bacon",
        "Fall",
        "Spring",
        "Summer",
        "Winter",
        "Family Reunion",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Pancetta Roast Chicken with Walnut Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/pancetta-roast-chicken-with-walnut-stuffing-242138"
}
