{
    "directions": [
        "With machine running, drop garlic down feed tube of processor and chop. Add pancetta. Pulse to chop finely. Add all remaining ingredients. Pulse blending to coarse paste. Transfer to small bowl. DO AHEAD: Can be made 2 days ahead. Cover and chill. Bring to room temperature before using.",
        "Set rack at lowest position in oven and preheat to 325°F. Sprinkle main turkey cavity with salt and pepper. Spread with 2 tablespoons pancetta-sage butter. Starting at neck end, slide hand between skin and meat of breast, thighs, and upper drumsticks to loosen skin. Spread remaining butter over thighs, drumsticks, and breast meat under skin. Fill main cavity with herb sprigs. Tie legs loosely to hold shape. Tuck wing tips under.",
        "Place turkey on rack set in large roasting pan. Rub turkey all over with oil; sprinkle with salt and pepper. Pour 2 cups stock into pan.",
        "Roast turkey until thermometer inserted into thickest part of thigh registers 165°F to 170°F, about 3 hours. Tilt turkey so juices run into pan. Transfer turkey to platter. Tent with foil; let rest at least 30 minutes (temperature will rise 5 to 10 degrees). Reserve pan.",
        "Scrape juices and browned bits from roasting pan into large glass measuring cup. Spoon off fat. Reserve 2 tablespoons. Heat 2 tablespoons reserved fat in large saucepan over medium-high heat. Add pancetta; sauté until beginning to crisp, about 5 minutes. Add shallots; sauté 1 minute. Reduce heat to medium. Add flour; whisk until golden, about 4 minutes. Whisk in 3 cups stock, wine, and degreased pan juices. Bring to boil, whisking. Cook to desired consistency, about 5 minutes. Whisk in rosemary and sage; season to taste with salt and pepper."
    ],
    "ingredients": [
        "4 garlic cloves, peeled",
        "4 ounces thinly sliced pancetta (Italian bacon), chopped",
        "1/4 cup finely grated Parmesan cheese",
        "1/4 cup (1/2 stick) unsalted butter, room temperature",
        "2 tablespoons olive oil",
        "2 tablespoons minced shallot",
        "1 tablespoon chopped fresh rosemary",
        "1 tablespoon chopped fresh sage",
        "2 teaspoons freshly ground black pepper",
        "1 14- to 16-pound turkey, rinsed, patted dry inside and out; neck, heart, and gizzard reserved for Shortcut Turkey Stock",
        "8 fresh sage sprigs",
        "4 fresh rosemary sprigs",
        "2 tablespoons olive oil",
        "2 cups Shortcut Turkey Stock or water",
        "1/2 cup diced thinly sliced pancetta (Italian bacon; about 3 ounces)",
        "1/4 cup chopped shallots",
        "1/4 cup all purpose flour",
        "3 cups Shortcut Turkey Stock",
        "1 cup dry white wine",
        "1 teaspoon chopped fresh rosemary",
        "1 teaspoon chopped fresh sage"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Herb",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Bacon",
        "Sage"
    ],
    "title": "Pancetta-Sage Turkey with Pancetta-Sage Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/pancetta-sage-turkey-with-pancetta-sage-gravy-240379"
}
