{
    "directions": [
        "Bring all ingredients to boil in heavy large saucepan over medium-high heat, stirring constantly until sugar dissolves. Boil mixture until thickened and reduced to 4 cups, stirring occasionally, about 45 minutes. Transfer jam to large bowl. Cool completely. (Can be made 1 week ahead. Cover and refrigerate. Bring to room temperature before serving.)",
        "Using on/off turns, puree olive oil, sage, thyme, rosemary, sea salt, and pepper in processor until almost smooth. Place pork in heavy large roasting pan. Rub herb mixture over both roasts. Cover with plastic wrap and refrigerate overnight.",
        "Preheat oven to 400°F. Sprinkle pork generously with salt and pepper. Place pancetta slices atop pork, overlapping if necessary. Roast until meat thermometer inserted into center of pork registers 145°F, about 1 1/2 hours. Transfer pork roasts to platter; remove string and let stand 15 to 30 minutes before carving (internal temperature will increase 5 degrees). Serve pork with fig jam.",
        "*Pancetta (Italian bacon cured in salt) is available at Italian markets and at some specialty foods stores"
    ],
    "ingredients": [
        "4 cups dry red wine (from two 750-ml bottles)",
        "3 cups water",
        "48 dried black Mission figs (about 12 ounces), stemmed, cut into 1/4-inch cubes",
        "2 cups sugar",
        "1/2 cup fresh lemon juice",
        "1/2 cup extra-virgin olive oil",
        "2 tablespoons chopped fresh sage",
        "2 tablespoons chopped fresh thyme",
        "2 tablespoons chopped fresh rosemary",
        "1 tablespoon fine-grained sea salt",
        "2 teaspoons ground black pepper",
        "2 3 1/2-pound boneless pork loin roasts, tied to hold shape (7 pounds total)",
        "3 ounces thinly sliced pancetta*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Pork",
        "Christmas",
        "Fig",
        "Bacon",
        "Winter",
        "Jam or Jelly"
    ],
    "title": "Pancetta- and Herb-Roasted Pork with Fig Jam",
    "url": "http://www.epicurious.com/recipes/food/views/pancetta-and-herb-roasted-pork-with-fig-jam-108952"
}
