{
    "directions": [
        "Heat oil in heavy large skillet over medium heat. Add pancetta, celery, and onion. Sauté until vegetables are soft but not brown, about 12 minutes. Transfer 1/2 cup sliced Treviso to small bowl and reserve for topping. Add remaining Treviso, 2 teaspoons thyme, and garlic to skillet. Toss until Treviso wilts, about 3 minutes. Season filling with salt and pepper.",
        "Cook lasagna noodles in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain noodles. Arrange noodles in single layer on large sheet of plastic wrap; cover with second sheet to avoid drying. DO AHEAD: Filling and pasta can be made 2 hours ahead. Let stand at room temperature.",
        "Melt butter in heavy medium saucepan over medium-low heat. Add flour and whisk until roux is pale gold color, about 2 minutes. Gradually whisk in milk; add nutmeg and white pepper. Increase heat to medium and cook until sauce thickens and boils, whisking often, 2 to 3 minutes. Reduce heat to low. Add Taleggio cheese in 4 batches, whisking to melt before adding more, about 4 minutes. Season sauce to taste with salt and pepper.",
        "Spoon 1/2 cup sauce into 13 x 9 x 2-inch glass baking dish; spread to cover bottom thinly. Arrange 3 noodles, crosswise and side by side, in dish; trim ends if necessary to fit. Transfer 3/4 cup filling to another small bowl and reserve for topping. Spoon half of remaining filling over noodles. Drizzle with 2/3 cup sauce; sprinkle with 1/4 cup Parmesan cheese. Repeat with noodles, filling, sauce, and Parmesan. Top with third layer of noodles; drizzle with 2/3 cup sauce. Spoon reserved 3/4 cup filling down center of lasagna lengthwise in 2-inch-wide strip. Drizzle strip with remaining sauce, then top with breadcrumbs. DO AHEAD: Can be made 1 day ahead. Cover and chill. Let stand at room temperature 1 hour before continuing.",
        "Preheat oven to 375°F. Bake lasagna uncovered until heated through and sauce is bubbling, about 35 minutes. Remove from oven; let cool 15 minutes.",
        "Toss reserved Treviso in small bowl with splash of olive oil and sprinkle of salt and pepper. Sprinkle over strip of filling. Sprinkle with remaining 1 teaspoon thyme."
    ],
    "ingredients": [
        "3 tablespoons extra-virgin olive oil",
        "8 ounces thinly sliced pancetta (Italian bacon), chopped",
        "2 cups thinly sliced celery hearts",
        "1 2/3 cups chopped onion",
        "1 pound Treviso radicchio or red endive (4 medium heads), quartered lengthwise, cored, then cut on diagonal into thin strips (about 6 cups), divided",
        "3 teaspoons chopped fresh thyme, divided",
        "1 garlic clove, finely chopped",
        "9 lasagna noodles (each 7 x 3 inches)",
        "1/4 cup (1/2 stick) unsalted butter",
        "2 1/2 tablespoons all purpose flour",
        "2 cups whole milk",
        "Pinch of ground nutmeg",
        "Pinch of ground white pepper",
        "12 ounces Taleggio cheese,* rind removed, cheese cut into 1/2-inch cubes",
        "1/2 cup finely grated Parmesan cheese, divided",
        "2 tablespoons coarse dry breadcrumbs (preferably from crustless Italian bread)",
        "Olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Leafy Green",
        "Pasta",
        "Bake",
        "Sauté",
        "High Fiber",
        "Dinner",
        "Parmesan",
        "Bacon",
        "Family Reunion",
        "Endive",
        "Breadcrumbs"
    ],
    "title": "Pancetta and Taleggio Lasagna with Treviso",
    "url": "http://www.epicurious.com/recipes/food/views/pancetta-and-taleggio-lasagna-with-treviso-356354"
}
