{
    "directions": [
        "Gently heat the oil in a saucepan and fry the paneer until it’s golden brown on all sides. Remove from the pan and set aside for later.",
        "Throw the curry leaves (if using) into the pan to crisp up. Take them out and reserve for sprinkling over at the end.",
        "Add a little more oil to the pan if you need to and toss in the mustard and cumin seeds. Once they start sizzling, stir in the turmeric and onion. Allow to soften for a few minutes before stirring in the garlic, ginger and chiles. After a further minute, stir in the tomato paste, garam masala and coriander.",
        "Add a splash of water to the pan and pour in the coconut milk. Bring to a simmer and toss in the broccoli and fried paneer. Stir through the tamarind and simmer for 5 minutes. Taste and adjust the seasoning with salt and sugar. Garnish with the crispy curry leaves and the fresh cilantro before serving with some steamed basmati to mop up the sauce."
    ],
    "ingredients": [
        "2 tbsp vegetable oil, plus extra if needed",
        "1 pack paneer, around 8 oz, cut into large bite-size pieces",
        "20 fresh curry leaves (optional)",
        "2 tsp black mustard seeds",
        "1 tsp cumin seeds",
        "1 tsp ground turmeric",
        "1 onion, finely diced",
        "2 garlic cloves, finely chopped",
        "1 tbsp peeled and finely chopped fresh ginger",
        "2 fresh red chiles, 1 finely sliced, 1 slit down the middle but left whole",
        "2 tbsp tomato paste",
        "1 tbsp garam masala",
        "2 tsp ground coriander",
        "1 3/4 cups coconut milk",
        "4 oz (about 1 3/4 cups) broccoli florets",
        "1 tbsp tamarind paste, or to taste",
        "Sea salt, to taste",
        "Sugar, to taste",
        "Small handful of cilantro, to garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Dinner",
        "Cheese",
        "Broccoli",
        "Cumin",
        "Mustard",
        "Ginger",
        "Chile Pepper",
        "Coconut",
        "Tamarind",
        "Cilantro",
        "Curry"
    ],
    "title": "Paneer and Broccoli Masala",
    "url": "http://www.epicurious.com/recipes/food/views/paneer-and-broccoli-masala"
}
