{
    "directions": [
        "To make the sauce: Bring the cream, milk, and sugar to a boil in a heavy small saucepan over medium heat, stirring frequently. In a small bowl, mix the amaretto and cornstarch to blend and then whisk into the cream mixture. Simmer over medium-low heat until the sauce thickens, stirring constantly, about 2 minutes. Set aside and keep warm. (The amaretto sauce can be made 3 days ahead. Cover and refrigerate. Rewarm before serving.)",
        "To make the bread pudding: Lightly butter a 13 by 9 by 2-inch baking dish. Arrange the bread cubes in the prepared dish. In a large bowl, whisk the eggs, cream, milk, and sugar to blend. Pour the custard over the bread cubes, and press the bread cubes gently to submerge. Let stand for 30 minutes, occasionally pressing the bread cubes into the custard mixture. (Recipe can be prepared up to this point 2 hours ahead. Cover and refrigerate.)",
        "Preheat the oven to 350 degrees F.",
        "Bake until the pudding puffs and is set in the center, about 45 minutes. Cool slightly. Spoon the bread pudding into bowls, drizzle with the warm amaretto sauce, and serve."
    ],
    "ingredients": [
        "1/2 cup whipping cream",
        "1/2 cup whole milk",
        "3 tablespoons sugar",
        "1/4 cup amaretto liqueur",
        "2 teaspoons cornstarch",
        "1 (1-pound) loaf panettone bread, crusts trimmed, bread cut into 1-inch cubes",
        "8 large eggs",
        "1 1/2 cups whipping cream",
        "2 1/2 cups whole milk",
        "1 1/4 cups sugar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Dessert Recipes",
        "Dessert",
        "Easy Recipes",
        "Easy Baking",
        "Italian Dessert Recipes",
        "Italian",
        "Baking",
        "Comfort Food",
        "Make Ahead",
        "Bread Pudding",
        "Sauce Recipes",
        "Dairy Recipes",
        "Egg Recipes",
        "Holiday",
        "Winter"
    ],
    "title": "Panettone Bread Pudding with Amaretto Sauce",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/panettone-bread-pudding-with-amaretto-sauce-recipe"
}
