{
    "directions": [
        "Arrange the panettone bread cubes to fit compactly into a buttered 2 quart casserole dish. Do not compress too tightly; set aside any leftover bread cubes.",
        "Whisk together 3 eggs and 1/2 cup sugar until the sugar is dissolved and the mixture becomes light yellow in color. Pour in the cream, vanilla, and 1 tablespoon orange liqueur; whisk to combine. Stir in 1 pinch salt, 1/8 teaspoon nutmeg, lemon zest, and orange zest. Pour this mixture over the panettone cubes in the casserole dish. Cover and refrigerate for 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Remove  the bread from the refrigerator, uncover, and dot the top of the bread pudding with 2 1/2 tablespoons butter, and sprinkle with 2 tablespoons of white sugar.",
        "Set casserole dish into a shallow pan that is 2 to 3 inches larger in diameter than the casserole dish. Set these pans onto the center rack of the preheated oven. Pour hot water into the outside pan, until it reaches a depth of 1 inch around the casserole dish, creating a water bath.",
        "Bake the pudding in the water bath until it is fully set and a knife inserted into the center of the pudding comes out clean, 1 to 1 1/4 hours. The water bath will help the pudding to cook evenly and maintain a light texture. Carefully remove the pudding from the water bath and cool for at least 15 minutes before serving.",
        "Just before serving, make the sauce by melting 1/2 cup butter  in a saucepan over low heat. Stir in 1 cup sugar, 1/4 cup orange liqueur, 3 tablespoons water, 1/8 teaspoon nutmeg, and 1/8 teaspoon salt. Stir and heat over medium heat until the sugar is fully dissolved and the liquid is heated through. Remove from heat.",
        "In a small mixing bowl, whisk 1 egg until well beaten. While whisking the egg, slowly pour 2 tablespoons of the hot  mixture into the bowl with the egg. Then, while whisking mixture vigorously, slowly pour the warmed egg mixture back into the sauce.",
        "Place the saucepan back over low heat, gently stirring the sauce and raising the temperature slowly to medium. Continue to stir until the sauce almost reaches a simmer, reducing the heat as necessary if the mixture threatens to boil. Continue stirring until the sauce thickens, 1 to 2 minutes. Spoon over the bread pudding and serve immediately."
    ],
    "ingredients": [
        "Bread Pudding:",
        "1 (12 ounce) panettone, cubed",
        "3 eggs, lightly beaten",
        "1/2 cup white sugar",
        "2 1/4 cups heavy cream",
        "2 teaspoons vanilla extract",
        "1 tablespoon Grand Marnier or other orange-flavored liqueur",
        "1 pinch salt",
        "1/8 teaspoon freshly grated nutmeg",
        "1 1/2 teaspoons finely grated lemon zest",
        "2 teaspoons finely grated orange zest",
        "2 1/2 tablespoons unsalted butter, cut into bits",
        "2 tablespoons white sugar",
        "Sauce:",
        "1/2 cup butter",
        "1 cup white sugar",
        "1/4 cup Grand Marnier or other orange-flavored liqueur",
        "3 tablespoons water",
        "1/8 teaspoon freshly grated nutmeg",
        "1/8 teaspoon salt",
        "1 egg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Panettone Bread Pudding with Spiced Orange Sauce",
    "url": "http://allrecipes.com/recipe/132692/panettone-bread-pudding-with-spiced-o/"
}
