{
    "directions": [
        "In a small saucepan, macerate prunes in grappa 30 minutes. Simmer mixture until most liquid is evaporated and spread prunes in a 2-quart gratin dish (about 14 inches long) or other shallow baking dish.",
        "Preheat broiler.",
        "Lightly butter one side of panettone slices and trim crusts if desired. Cut into 3- to 4-inch squares and halve squares diagonally to form triangles. Arrange triangles, buttered sides up,in one layer on a large baking sheet and broil about 4 inches from heat until golden, about 30 seconds to 1 minute. Cool triangles and arrange, toasted sides up and overlapping slightly, over prunes in baking dish. Pudding may be prepared up to this point 6 hours ahead and kept covered.",
        "Preheat oven to 400°F.",
        "In a heavy saucepan, bring milk to a bare simmer over moderate heat with vanilla bean and granulated sugar and remove pan from heat. Scrape seeds from vanilla bean with a knife into milk, reserving pod for another use, and whisk to break up seeds. In a large heatproof bowl, whisk together whole eggs and yolks and add hot milk in a slow stream, whisking.",
        "Ladle custard evenly over toasts and set dish in a larger baking pan. Add enough hot water to pan to reach halfway up side of dish and bake pudding in middle of oven 25 to 30 minutes, or until puffed and set.",
        "Remove dish from water batch and cool pudding to warm or room temperature. Just before serving, dust pudding with confectioners' sugar."
    ],
    "ingredients": [
        "2/3 cup pitted prunes, chopped",
        "4 tablespoons grappa",
        "1/2 pound panettone, brioche, or challah, cut lengthwise into 1/3-inch-thick slices",
        "about 3 tablespoons unsalted butter, softened",
        "3 cups milk",
        "1 vanilla bean, split lengthwise",
        "3/4 cup granulated sugar",
        "3 whole large eggs",
        "3 large egg yolks",
        "confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Prune",
        "Winter",
        "Grappa",
        "Gourmet"
    ],
    "title": "Panettone Bread and Butter Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/panettone-bread-and-butter-pudding-10078"
}
