{
    "directions": [
        "Put oven rack in middle position and preheat oven to 200°F.",
        "Pat steak dry. Mix together salt and pepper in a small bowl, then rub three fourths of salt mixture on both sides of steak.",
        "Heat 1 tablespoon oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté meat, turning over once, 6 to 8 minutes total for rare (depending on thickness of steak). Transfer to a baking pan and keep warm in oven while making ragout.",
        "Heat remaining 2 tablespoons oil in uncleaned skillet over moderately high heat until hot but not smoking, then sauté garlic, rosemary, and red-pepper flakes, stirring, until fragrant, about 30 seconds. Add mushrooms and remaining salt mixture and sauté, stirring frequently and scraping up any brown bits, until mushrooms are tender but still juicy, 6 to 7 minutes. Add tomatoes with their juice and sugar, then simmer, stirring occasionally, until liquid is reduced by about two thirds, 5 to 8 minutes.",
        "Transfer steak to a cutting board and pour any meat juices from baking pan into mushroom ragout. Holding knife at a 45-degree angle, cut steak across the grain into thin slices. Serve topped with ragout."
    ],
    "ingredients": [
        "1 1/2 lb flank steak",
        "1 1/4 teaspoons salt",
        "1/2 teaspoon black pepper",
        "3 tablespoons olive oil",
        "1 large garlic clove, minced",
        "1/2 teaspoon chopped fresh rosemary",
        "3/4 teaspoon dried hot red-pepper flakes",
        "12 oz sliced mixed fresh mushrooms (6 cups)",
        "1 (14-oz) can diced tomatoes in juice",
        "Pinch of sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Herb",
        "Mushroom",
        "Tomato",
        "Sauté",
        "Quick & Easy",
        "Gourmet"
    ],
    "title": "Panfried Flank Steak with Mushroom Ragoût",
    "url": "http://www.epicurious.com/recipes/food/views/panfried-flank-steak-with-mushroom-ragout-237203"
}
