{
    "directions": [
        "Cut the tofu crosswise into 4 slices and let the slices drain between a double thickness of paper towels for 20 minutes.",
        "While the tofu is draining, in a small bowl dissolve the cornstarch in 1/4 cup of the water and stir in the remaining 3/4 cup water, the soy sauce to taste, the vinegar, the Scotch, the sugar, and the salt. In a heavy saucepan heat 1 1/2 tablespoons of the vegetable oil over moderately high heat until it is hot but not smoking and in it stir-fry the garlic until it is pale golden, being careful not to let it burn. Add the gingerroot and stir-fry the mixture for 30 seconds. Stir the soy sauce mixture, add it to the garlic mixture, stirring, and bring the sauce to a boil, stirring. Simmer the sauce for 2 minutes, stir in the sesame oil, and keep the sauce warm.",
        "In a non-stick skillet heat the remaining 1 tablespoon vegetable oil over high heat until it is hot but not smoking and in it brown the tofu on all sides, turning it with tongs and transferring it as it is browned to paper towels to drain. Divide the tofu between 2 plates and spoon the sauce over it. Sprinkle the scallion over each serving and serve the tofu with the rice."
    ],
    "ingredients": [
        "a 1-pound block of extra-firm or firm tofu, rinsed",
        "4 teaspoons cornstarch",
        "1 cup water",
        "2 to 3 tablespoons soy sauce",
        "1 tablespoon cider vinegar",
        "1 tablespoon Scotch",
        "2 teaspoons sugar",
        "1/8 teaspoon salt",
        "2 1/2 tablespoons vegetable oil",
        "3 large garlic cloves, minced",
        "a 1-inch cube of peeled fresh gingerroot, minced",
        "1 teaspoon Oriental sesame oil",
        "1 scallion, minced",
        "cooked rice as an accompaniment if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Ginger",
        "Vegetarian",
        "Quick & Easy",
        "Tofu",
        "Pan-Fry",
        "Vegan",
        "Gourmet"
    ],
    "title": "Panfried Tofu with Oriental Garlic Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/panfried-tofu-with-oriental-garlic-sauce-13331"
}
