{
    "directions": [
        "Preheat oven to 200°F.",
        "Melt 2 tablespoons butter in a 12-inch heavy skillet (preferably oval) over low heat and remove from heat.",
        "Rinse trout and pat dry. Brush with melted butter inside and out and season with 3/4 teaspoon salt (total for both fish). Mound flour on a sheet of wax paper, then dredge each fish in flour to coat completely, shaking off excess.",
        "Add oil and 2 tablespoons butter to skillet and heat over moderately high heat until foam subsides, then sauté both trout, gently turning over once using 2 spatulas, until golden brown and almost cooked through, about 8 minutes total (fish will continue to cook as it stands). Transfer each trout to a plate and keep warm in oven.",
        "Pour off fat from skillet and wipe skillet clean. Melt remaining 1/2 stick butter over moderately low heat, then cook pecans, stirring, until fragrant and a shade darker, 1 to 2 minutes. Add parsley, pepper, and remaining 1/4 teaspoon salt, swirling skillet to combine, and remove from heat. Add lemon juice, swirling skillet to incorporate, and spoon over trout. Serve immediately."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter",
        "2 (1/2- to 3/4-lb) whole brook, rainbow, or brown trout, cleaned, keeping head and tail intact",
        "1 teaspoon salt",
        "3/4 cup all-purpose flour",
        "3 tablespoons vegetable oil",
        "1/4 cup pecans, coarsely chopped",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "1/4 teaspoon black pepper",
        "1 tablespoon fresh lemon juice",
        "Garnish: lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fish",
        "Nut",
        "Sauté",
        "Dinner",
        "Pecan",
        "Trout",
        "Fall",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Panfried Trout with Pecan Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/panfried-trout-with-pecan-butter-sauce-108495"
}
