{
    "directions": [
        "Rinse the tofu, then cut crosswise into 6 slices. Put slices between several layers of paper towels and let drain while making the sauce. (You’ll likely have to replace the paper towels at least once.)",
        "Prep the seasonings for the sauce: Peel the garlic cloves and the ginger, then quarter the ginger. Turn on your food processor and drop the garlic and ginger through the feed tube; they’ll be minced in no time. Stop the machine and the black beans in a small sieve until the water runs clear. Add them to the food processor and pulse until coarsely chopped.",
        "For the liquid portion of the sauce, stir together the water, soy sauce, Sherry, maple syrup, vinegar, and the cornstarch until the cornstarch is evenly suspended. Now you’re ready to cook the sauce!",
        "Generously film the bottom of a heavy 2-quart saucepan with the vegetable oil and heat over moderately high heat until hot but not smoking. Stir-fry the seasonings until fragrant, less than a minute. Stir the cornstarch mixture and add it to the pan. Whisk the sauce occasionally while bringing it to a boil and simmer 1 minute. Then set the sauce aside while you fry the tofu.",
        "Generously film the bottom of a 12-inch nonstick skillet with vegetable oil and heat over high heat until hot but not smoking. Blot up any excess moisture on the tofu with a paper towel before laying in the skillet. Fry the slices on all sides (forgo the short ends), turning them only when the undersides are golden and crisp, 5 to 8 minutes total. (You may need to lower the heat as the frying progresses.) Give the tofu one last flip on a paper towel to sop up any stray oil and reheat the sauce.",
        "Serve with rice and broccoli, pouring sauce over all."
    ],
    "ingredients": [
        "1-pound block of extra-firm tofu",
        "4 garlic cloves",
        "1-inch chunk of fresh ginger",
        "2 tablespoons Chinese fermented black beans",
        "11/2 cups water",
        "4 tablespoons soy sauce",
        "3 tablespoons Sherry (dry or sweet)",
        "1 tablespoon maple syrup",
        "2 teaspoons cider vinegar",
        "1 1/2 tablespoons cornstarch",
        "vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Garlic",
        "Ginger",
        "Vegetarian",
        "Tofu",
        "Pan-Fry",
        "Gourmet"
    ],
    "title": "Panfried Tofu with Chinese Black Bean Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/panfried-tofu-with-chinese-black-bean-sauce-103384"
}
