{
    "directions": [
        "Purée all marinade ingredients in a blender.",
        "Transfer marinade to a large bowl and toss with chicken to coat. Marinate chicken, covered and chilled, turning once, 8 to 12 hours.",
        "Pulse pumpkin seeds and almonds separately in a food processor until pumpkin seeds are coarsely ground and almonds are finely ground (do not overprocess) and transfer to a large shallow bowl. Whisk in bread crumbs, flour, sesame seeds, 1 tablespoon salt, and cayenne. In another shallow bowl whisk together eggs and remaining teaspoon salt.",
        "Preheat oven to 350°F.",
        "Remove chicken from marinade and pat dry with paper towels. Dip 1 piece chicken in egg, letting excess drip off, then dredge in crumb coating, knocking off excess. Transfer to a platter and repeat with remaining chicken.",
        "Heat oil in a deep large skillet (preferably well-seasoned cast iron) over moderate heat until hot but not smoking, then carefully add butter pieces. When butter is melted, cook chicken in batches (adjust heat if necessary to prevent coating from getting too brown), turning, until golden brown, about 10 minutes total. Transfer chicken as browned to a rack set in a shallow baking pan. When all chicken is browned, bake in middle of oven until cooked through, about 30 minutes."
    ],
    "ingredients": [
        "8 garlic cloves, coarsely chopped",
        "1/2 cup raspberry or tarragon vinegar",
        "1 cup fresh lime juice (preferably Key or Mexican lime)",
        "4 canned chipotle chiles in adobo",
        "1 teaspoon dry mustard",
        "1/2 cup tamari",
        "1 tablespoon kosher salt",
        "2 teaspoons ground black pepper",
        "1 cup packed light brown sugar",
        "4 1/2-lb chicken, cut into 8 pieces",
        "1 cup hulled (green) pumpkin seeds (5 oz), toasted",
        "1 cup slivered almonds (4 oz), toasted",
        "1 cup fresh fine bread crumbs",
        "1 cup unbleached all-purpose flour",
        "1/3 cup sesame seeds",
        "1 tablespoon plus 1 teaspoon coarse salt",
        "3/4 teaspoon cayenne",
        "4 large eggs",
        "1 cup vegetable oil",
        "1/2 stick unsalted butter, cut into pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Nut",
        "Poultry",
        "Marinate",
        "Lime",
        "Almond",
        "Hot Pepper",
        "Winter",
        "Pan-Fry",
        "Sesame",
        "Seed",
        "Gourmet"
    ],
    "title": "Panfried Almond-and Sesame-Dusted Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/panfried-almond-and-sesame-dusted-chicken-103050"
}
