{
    "directions": [
        "Preheat oven to 200°F. Put an ovenproof platter in oven to warm.",
        "Heat dry comal over moderate heat until hot but not smoking, then cook tomatoes, onion, bell pepper, and garlic, turning with tongs, until all are blackened in spots, 10 to 15 minutes. 3Remove from heat, then transfer tomatoes and 2 onion slices to a blender. Peel garlic and add to blender along with lime juice, chile, and 1/2 teaspoon salt. Blend until coarsely puréed, then transfer salsa to a bowl.",
        "Cut bell pepper into 1/2-inch-wide strips, then halve remaining 2 onion slices and separate layers. Toss bell pepper and onion with oregano, pepper, and remaining 1/4 teaspoon salt in a bowl.",
        "Spread one fourth of refried beans on a tortilla, leaving a 1-inch border all around, then sprinkle with one fourth of cheese. Arrange one fourth of onion and pepper mixture in a horizontal strip across center, then fold side nearest you over them and roll up tortilla. Make 3 more burritos in same manner.",
        "Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then fry 2 burritos, seam side down, until lightly browned on undersides, 1 to 2 minutes. Turn over with tongs and fry until golden, 1 to 2 minutes more. Transfer to paper towels to drain briefly, then keep warm on platter in oven. Fry remaining 2 burritos in same manner. Serve with salsa."
    ],
    "ingredients": [
        "2 medium tomatoes (10 ounces total)",
        "1 large white onion, cut crosswise into 4 thick slices",
        "1 red bell pepper, trimmed, then quartered lengthwise",
        "2 garlic cloves, left unpeeled",
        "1 tablespoon fresh lime juice",
        "1 teaspoon minced fresh serrano chile including seeds",
        "3/4 teaspoon salt",
        "1/2 teaspoon dried oregano, crumbled",
        "1/8 teaspoon black pepper",
        "1 (16-ounce) can refried beans",
        "4 (10-inch) flour tortillas",
        "5 oz Monterey Jack cheese, coarsely grated (1 1/4 cups)",
        "1/2 cup vegetable oil",
        "Special equipment: a well-seasoned 10- to 11-inch cast-iron comal or skillet",
        "Accompaniment: sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Bean",
        "Vegetable",
        "Vegetarian",
        "Cinco de Mayo",
        "Pan-Fry",
        "Tortillas",
        "Monterey Jack",
        "Gourmet"
    ],
    "title": "Panfried Bean Burritos",
    "url": "http://www.epicurious.com/recipes/food/views/panfried-bean-burritos-230970"
}
