{
    "directions": [
        "First marinate the fish. Mix together the harissa paste, the ground cumin, and 1/2 teaspoon salt in a small bowl. Rub the paste all over the fish fillets and leave them to marinate for 2 hours in the fridge.",
        "Dust the fillets with a little flour and shake off the excess. Heat the olive oil in a wide frying pan over medium-high-heat and fry the fillets for 2 minutes on each side. You may need to do this in two batches. Set the fish aside, leave the oil in the pan, and add the onions. Stir as you cook for about 8 minutes, until the onions are golden.",
        "Add the remaining harissa, the vinegar, the cinnamon, 1/2 teaspoon salt, and plenty of black pepper. Pour in the water, lower the heat, and let the sauce simmer gently for 10 to 15 minutes, until quite thick.",
        "Add the honey and rose water to the pan along with the currants, if using, and simmer gently for a couple more minutes. Taste and adjust the seasoning and then return the fish fillets to the pan; you can slightly overlap them if they don't quite fit. Spoon the sauce over the fish and leave them to warm up in the simmering sauce for 3 minutes; you may need to add a few tablespoons of water if the sauce is very thick. Serve warm for at room temperature, sprinkled with the cilantro, if using, and the rose petals."
    ],
    "ingredients": [
        "3 tbsp harissa paste (store-bought or see recipe )",
        "1 tsp ground cumin",
        "4 sea bass fillets, about 1 pound / 450 g in total, skinned and with pin bones removed",
        "all-purpose flour, for dusting",
        "2 tbsp olive oil",
        "2 medium onions, finely chopped",
        "6 1/2 tbsp / 100 ml red wine vinegar",
        "1 tsp ground cinnamon",
        "scant 1 cup / 200 ml water",
        "1 1/2 tbsp honey",
        "1 tbsp rose water",
        "scant 1/2 cup / 60 g currants (optional)",
        "2 tbsp coarsely chopped cilantro (optional)",
        "2 tsp small dried edible rose petals",
        "salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Marinate",
        "Rosh Hashanah/Yom Kippur",
        "Dinner",
        "Seafood",
        "Bass",
        "Spice",
        "Pan-Fry",
        "Advance Prep Required",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Panfried Sea Bass with Harissa & Rose",
    "url": "http://www.epicurious.com/recipes/food/views/panfried-sea-bass-with-harissa-rose-51185020"
}
