{
    "directions": [
        "Halve tofu crosswise, then cut lengthwise into fourths to form 8 slices. Put tofu slices between several layers of paper towels to drain, replacing towels as needed, until ready to use.",
        "Finely chop enough shallots to measure 1/2 cup and reserve. Cut remaining shallots crosswise into 1/8-inch-thick slices and separate into rings. Heat oil in a 10-inch heavy skillet (preferably cast-iron) over moderately high heat until hot but not smoking, then fry sliced shallots in 2 batches, stirring occasionally, until golden brown, 1 1/2 to 3 minutes per batch (watch closely, as shallots can burn easily). Quickly transfer shallots as fried with a slotted spoon to paper towels to drain. Pour off all but 1 tablespoon oil from skillet and reserve skillet.",
        "Cook sugar in a dry 1- to 1 1/2-quart heavy saucepan over moderate heat, undisturbed, until it melts around edges and begins to turn golden, then continue to cook, stirring, until all of sugar is melted and turns a golden caramel.",
        "Add reserved chopped shallots (use caution; caramel will bubble up and steam vigorously) and cook, stirring, until shallots shrink and are very fragrant, about 45 seconds. Add garlic and ginger and cook, stirring, 30 seconds. Stir in soy sauce, vinegar, and 1 1/3 cups water and simmer, stirring, until any hardened caramel is dissolved, about 1 minute.",
        "Stir together cornstarch and remaining 2 tablespoons water until smooth, then stir into sauce and simmer, stirring occasionally, 2 minutes. Remove from heat and keep warm, covered.",
        "Heat oil remaining in skillet over high heat until hot but not smoking. Meanwhile, blot any excess moisture remaining on tofu with paper towels, then add to hot oil in skillet in 1 layer. Fry tofu, turning over once, until golden and crisp, 7 to 10 minutes total. Transfer to clean paper towels to drain briefly.",
        "Reheat sauce, then serve tofu topped with sauce, basil, mint, and fried shallots."
    ],
    "ingredients": [
        "1 (14-ounce) block extra-firm tofu, rinsed",
        "1/2 pound shallots (4 to 5 large)",
        "1 cup vegetable oil",
        "1/3 cup sugar",
        "1 garlic clove, finely chopped",
        "1/2 tablespoon finely chopped peeled fresh ginger",
        "3 tablespoons soy sauce",
        "3 tablespoons rice vinegar (not seasoned)",
        "1 1/3 cups plus 2 tablespoons water",
        "2 tablespoons cornstarch",
        "1/3 cup loosely packed fresh basil leaves",
        "1/3 cup loosely packed fresh mint leaves",
        "cooked jasmine rice; steamed baby bok choy (optional); lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Ginger",
        "Herb",
        "Soy",
        "Fry",
        "Vegetarian",
        "Dinner",
        "Vegan",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Panfried Tofu with Asian Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/panfried-tofu-with-asian-caramel-sauce-238093"
}
