{
    "directions": [
        "Season halibut fillets all over with 1 teaspoon cracked black pepper and 1 teaspoon sea salt.",
        "Whisk flour, remaining black pepper, and 1/2 teaspoon sea salt together in a shallow bowl. Whisk eggs in another shallow bowl. Pour panko bread crumbs into another shallow bowl.",
        "Gently roll 1 halibut fillet in flour mixture to coat and shake off any excess. Dip 1 side of fillet into egg, then press egg-coated side into bread crumbs to coat evenly. Place fillet, panko-side up, onto a plate and repeat with remaining fillets. Cover the plate loosely with plastic wrap and refrigerate until cold, about 15 minutes.",
        "Melt butter in a small saucepan over medium-high heat. Saute shallot and serrano pepper in hot butter until fragrant, about 1 minute. Stir half-and-half and cilantro leaves into shallot mixture, bring to a simmer, and cook, stirring frequently, until reduced by half, 6 to 8 minutes. Remove from heat; stir in lime juice and remaining 1/2 teaspoon sea salt. Puree sauce using an immersion blender until smooth.",
        "Preheat oven to 300 degrees F (150 degrees C). Line a baking sheet with aluminum foil and place an ovenproof wire rack on the baking sheet.",
        "Heat canola oil in a nonstick skillet over medium-high heat. Place fillets, panko-side down, in hot oil and cook until golden, about 2 minutes. Flip fillets and transfer, panko-side up, to the wire rack on the prepared baking sheet.",
        "Bake fillets in the preheated oven until fish flakes easily with a fork, 6 to 7 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Transfer fillets to plates and top with cilantro sauce."
    ],
    "ingredients": [
        "4 (6 ounce) halibut fillets, skin removed",
        "1 1/2 teaspoons freshly cracked black pepper, divided",
        "1 1/2 teaspoons sea salt, divided",
        "1/2 cup all-purpose flour",
        "2 eggs, lightly beaten",
        "1 cup panko bread crumbs",
        "Sauce:",
        "2 tablespoons unsalted butter",
        "1/4 cup minced shallot",
        "1 teaspoon minced serrano pepper",
        "1 cup half-and-half",
        "1 cup roughly chopped cilantro leaves",
        "1 tablespoon fresh lime juice",
        "1/2 teaspoon sea salt",
        "1/4 cup canola oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Panko Crusted Halibut with White Serrano and Cilantro Sauce",
    "url": "http://allrecipes.com/recipe/241116/panko-crusted-halibut-with-white-serr/"
}
