{
    "directions": [
        "Purée chutney ingredients in a blender, stirring occasionally to assist blending, and transfer to a bowl. Season chutney with salt and pepper and chill, covered, until ready to use.",
        "Remove muscle from side of scallops if still attached. Pat scallops dry and season with salt and pepper. Whisk together eggs and milk in a shallow bowl. Put panko in another shallow bowl. Dip scallops, 1 at a time, in egg mixture and then in panko, turning to coat, and transfer to a tray.",
        "Preheat oven to 400°F.",
        "Heat 3 tablespoons oil in a 12-inch nonstick skillet over moderate heat until hot but not smoking, then cook scallops, 12 at a time, until just cooked through and golden brown (adjust heat if necessary), about 1 1/2 minutes on each side. Put scallops as cooked in 1 layer on a rack set in a shallow baking pan. Between batches, carefully wipe skillet clean with paper towels and add more oil. Bake scallops in middle of oven until just heated through, about 3 minutes.",
        "Serve scallops topped with chutney."
    ],
    "ingredients": [
        "2 cups packed fresh cilantro, chopped",
        "1/2 cup chopped scallion",
        "1/4 cup sweetened flaked coconut",
        "2 to 3 serrano or jalapeño chiles, chopped with seeds",
        "3 tablespoons vegetable oil",
        "1 1/2 tablespoons finely grated peeled fresh ginger",
        "2 1/2 tablespoons fresh lime juice, or to taste",
        "2 tablespoons water",
        "60 small sea scallops (about 3 1/2 pounds)",
        "2 large eggs",
        "1/4 cup milk",
        "3 cups panko (Japanese bread crumbs) or coarse dry bread crumbs",
        "1 cup vegetable oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Blender",
        "Dairy",
        "Egg",
        "Pepper",
        "Shellfish",
        "Appetizer",
        "Bake",
        "Sauté",
        "Coconut",
        "Scallop",
        "Winter",
        "Jalapeño",
        "Gourmet"
    ],
    "title": "Panko Scallops with Green Chile Chutney",
    "url": "http://www.epicurious.com/recipes/food/views/panko-scallops-with-green-chile-chutney-102729"
}
