{
    "directions": [
        "In a cup sprinkle gelatin over milk and let soften. In a large saucepan whisk together confectioners' sugar, vanilla beans, salt, and 2 cups heavy cream and bring just to a boil over moderately low heat, stirring occasionally. Remove pan from heat and scrape seeds from vanilla beans into liquid (discard pods). Add gelatin mixture, stirring until dissolved. Pour mixture into a large metal bowl and chill, stirring occasionally, until cooled to room temperature, about 1 hour.",
        "Make praline cream while mixture is cooling.",
        "In a small saucepan cook granulated sugar, corn syrup, and water over moderate heat until a light caramel. Stir in hazelnuts and baking soda (mixture will foam up) and immediately spoon onto a sheet of foil. Cool praline and break into chunks. Praline may be made 1 week ahead and frozen, wrapped in foil.",
        "In a dry heavy saucepan, cook granulated sugar over moderate heat, without stirring, until it begins to melt. Continue cooking sugar, stirring with a fork until melted, and then swirling pan, until a deep golden caramel and remove pan from heat. Add water (mixture will bubble up) and simmer, stirring, until caramel is dissolved. Cool sauce and chill until cold. Sauce may be made 1 week ahead and chilled, covered. Before serving, thin sauce with water if necessary.",
        "In a small bowl, whisk sour cream until smooth. In a chilled bowl with chilled beaters of an electric mixer, beat remaining cup heavy cream until it just holds stiff peaks. Gently fold sour cream into whipped cream. Gently fold sour cream mixture into cooled gelatin mixture until smooth and pour into a 6 1/2-cup mold or bowl. Chill panna cotta, covered, at least 4 hours (until firm) and up to 2 days.",
        "To unmold panna cotta, loosen edge and dip mold or bowl into a slightly larger bowl filled halfway with hot water. Invert mold or bowl onto a platter with a raised edge. Stir praline into caramel sauce and pour over panna cotta.",
        "Cut panna cotta into wedges and spoon sauce over each serving.",
        "Preheat oven to 350°F.",
        "In a baking pan, toast hazelnuts in one layer in oven 10 to 15 minutes, or until colored lightly and skins blister. Wrap nuts in a kitchen towel and let steam 1 minute. Rub nuts in towel to remove as much of skins as possible and cool."
    ],
    "ingredients": [
        "1 envelope plus 1 teaspoon unflavored gelatin (about 1 tablespoon plus 1/4 teaspoon)",
        "1/4 cup milk",
        "1 cup confectioners sugar",
        "2 vanilla beans, split lengthwise",
        "1/2 teaspoon salt",
        "3 cups heavy cream",
        "1/4 cup granulated sugar",
        "1 tablespoon light corn syrup",
        "1 tablespoon water",
        "1/4 cup hazelnuts, toasted and skinned and chopped",
        "1/2 teaspoon baking soda",
        "1 cup granulated sugar",
        "3/4 cup water",
        "1 1/2 cups sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Dessert",
        "Freeze/Chill",
        "Vanilla",
        "Chill",
        "Hazelnut",
        "Sour Cream",
        "Gourmet",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Panna Cotta with Praline Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/panna-cotta-with-praline-caramel-sauce-10200"
}
