{
    "directions": [
        "For the panna cotta: Heat the cream, vanilla extract and vanilla bean in a heavy-bottomed saucepan over medium heat until milk bubbles form at the sides of the pan, stirring occasionally, about 6 minutes.",
        "Meanwhile, in a small bowl dissolve the gelatin in 3 tablespoons hot tap water. Stir until the gelatin completely dissolves, about 1 minute.",
        "Stir the sugar into the hot cream. Add the salt and the gelatin mixture to the cream as well. Whisk until the sugar dissolves, then whisk in the milk and stir again. Pour into the ramekins.",
        "Refrigerate the panna cotta until set, at least 4 hours. Stored in the refrigerator, the panna cotta keeps for several days.",
        "For the berry sauce: In a medium saucepot set over medium heat, add the berries, sugar, lemon juice and zest. Bring to a boil and cook until the berries burst and the liquid starts to thicken, about 5 minutes. Strain the mixture through a fine-mesh sieve, forcing the berries through by pushing and scraping with a rubber spatula. The more you force through, the thicker the sauce will be (the pulp closest to the seeds contains the most pectin, which is a natural thickener). Let cool completely and store in the refrigerator until ready to serve.",
        "Spoon the sauce over the panna cotta and serve."
    ],
    "ingredients": [
        "3 cups cream",
        "1 teaspoon vanilla extract",
        "1/2 vanilla bean, scraped",
        "1 1/4-ounce packet (1 tablespoon) gelatin powder",
        "2/3 cup sugar",
        "Pinch salt",
        "1/2 cup milk",
        "3 cups mixed raspberries and blueberries",
        "2 to 3 tablespoons sugar",
        "1 tablespoon freshly squeezed lemon juice",
        "Zest of 1 lemon"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Panna Cotta",
        "Gelatin Recipes",
        "Fruit",
        "Raspberry Recipes",
        "Dairy Recipes",
        "Blueberry",
        "Dessert"
    ],
    "title": "Panna Cotta with Berry Sauce",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/panna-cotta-with-berry-sauce"
}
