{
    "directions": [
        "Heat 2 Tbsp. oil in a large skillet over medium-high. Cook sausage, breaking up with a wooden spoon, until cooked through, browned, and crisp in places, 5–8 minutes. Transfer to a small bowl with a slotted spoon. Reduce heat to medium; add onion and olives to skillet. Cook, stirring often, until onion is translucent, about 5 minutes. Add tomatoes, increase heat to medium-high, and cook, mashing tomatoes lightly and stirring often, until juices are slightly thickened, about 3 minutes.",
        "Meanwhile, cook pasta in a large pot of lightly salted boiling water, stirring occasionally, until very al dente, about 6 minutes. Drain, reserving 1 cup pasta cooking liquid.",
        "Add pasta and 3/4 cup pasta cooking liquid to sauce and cook, tossing, until pasta is al dente and sauce coats noodles. Mix in peperoncini, cooked sausage, and another 1/4 cup pasta cooking liquid. Then, tossing constantly, gradually add all but 1/2 cup cheese, followed by butter. Once incorporated, remove from heat and mix in basil. Divide pasta among bowls. Drizzle with oil; top with remaining cheese."
    ],
    "ingredients": [
        "2 tablespoons olive oil, plus more for drizzling",
        "8 ounces sweet Italian sausage, casings removed",
        "1/2 medium red onion, finely chopped",
        "1/4 cup torn pitted olives, preferably Castelvetrano",
        "1 (14-ounce) can cherry tomatoes",
        "12 ounces spaghetti",
        "Kosher salt",
        "1/4 cup peperoncini, thinly sliced",
        "2 ounces Pecorino or Parmesan, finely grated, divided",
        "2 tablespoons unsalted butter",
        "1/2 cup torn basil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Sausage",
        "Olive",
        "Hot Pepper",
        "Basil",
        "Dinner",
        "Quick & Easy"
    ],
    "title": "Pantry Pasta",
    "url": "http://www.epicurious.com/recipes/food/views/pantry-pasta"
}
