{
    "directions": [
        "Place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Mash in a bowl with 1/2 teaspoon salt until no lumps remain. Set aside to cool to room temperature.",
        "Meanwhile, heat the vegetable oil in a large skillet over medium heat. Cook and stir the onion, green pepper, and garlic in the hot skillet until the onion has softened and turned translucent, about 10 minutes. Increase heat to medium-high, and stir in the ground beef. Cook and stir until the beef is crumbly and no longer pink. Stir in 1 teaspoon salt, cumin, pepper, tomato paste, and vinegar until the tomato paste has dissolved. Scrape into a mixing bowl, and allow to cool to room temperature.",
        "Line a baking sheet with plastic wrap or waxed paper, and set aside. Beat the eggs in a mixing bowl, and set aside. Pour the bread crumbs and flour into separate, shallow dishes, and set aside.",
        "Once the potatoes and beef have cooled, form the potato balls: grab a handful of mashed potatoes, and split into two equal portions. Form each piece into a small bowl shape, and fill with the ground beef mixture. Place the two halves together, seal the edges, and smooth to make a round ball. Gently roll the ball in the flour to coat and shake off the excess flour. Dip into the beaten egg, then gently roll in bread crumbs. Gently toss between your hands so any bread crumbs that haven't stuck can fall away. Place the breaded potato balls onto the prepared baking sheet while breading the rest. Refrigerate 2 to 4 hours, or freeze for later use.",
        "To cook, heat the oil for frying in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).",
        "Cook the potato balls in the hot oil in batches, using tongs to roll the balls around as they cook to ensure even browning, until crispy and golden brown, about 3 minutes per batch. Drain on a paper towel-lined plate before serving."
    ],
    "ingredients": [
        "4 large potatoes, peeled and cubed",
        "1/2 teaspoon salt",
        "1 tablespoon vegetable oil",
        "1/2 cup chopped onion",
        "1 green bell pepper, chopped",
        "3 cloves garlic, minced",
        "1 pound ground beef",
        "1 teaspoon salt",
        "2 teaspoons ground cumin",
        "1 teaspoon ground black pepper",
        "4 teaspoons tomato paste",
        "1 tablespoon distilled white vinegar",
        "4 eggs",
        "2 cups dry bread crumbs",
        "1 cup all-purpose flour",
        "1 quart vegetable oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Papas Rellenas (Fried Stuffed Potatoes)",
    "url": "http://allrecipes.com/recipe/217840/papas-rellenas-fried-stuffed-potatoe/"
}
