{
    "directions": [
        "In a large sauté pan over medium-high heat, warm 1 Tbs. of the olive oil. Add the ground beef and pork, and season with salt and pepper. Cook, stirring occasionally, until browned, about 12 minutes. Transfer to a paper towel-lined plate. Add the pancetta to the pan and cook, stirring occasionally, until crisp, about 7 minutes. Transfer to a paper towel-lined plate.",
        "Reduce the heat to medium and warm the remaining 1 Tbs. olive oil. Add the onion, carrots and celery and cook, stirring occasionally, until soft and translucent, about 8 minutes. Add the garlic and cook, stirring constantly, for 1 minute. Stir in the tomato paste and cook for 2 minutes. Add the wine and simmer until almost evaporated, about 5 minutes. Add the ground meats, pancetta, milk, tomatoes, bay leaves and cheese rind. Season with salt and pepper and bring to a simmer.",
        "Cover partially, reduce the heat to medium-low and cook, stirring occasionally, until the sauce thickens, 1 1/2 to 2 hours. Remove and discard the bay leaves and cheese rind.",
        "Toss the pasta with about 3 cups (24 fl. oz./750 ml) of the sauce (reserve the remaining sauce for another use). Sprinkle cheese on top. Serve immediately and pass additional cheese alongside. Serves 4 to 6.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "2 Tbs. olive oil",
        "1 1/4 lb. (625 g) ground beef",
        "1 1/4 lb. (625 g) ground pork",
        "Kosher salt and freshly ground pepper, to taste",
        "4 oz. (125 g) pancetta, cut into 1/2-inch (12-mm) dice",
        "1 yellow onion, finely diced",
        "2 carrots, peeled and finely diced",
        "1 celery stalk, finely diced",
        "5 garlic cloves, minced",
        "1/3 cup (3 oz./90 g) tomato paste",
        "1 cup (8 fl. oz./250 ml) dry red wine",
        "1 cup (8 fl. oz./250 ml) milk",
        "2 cans (each 28 oz./875 g) whole tomatoes, passed through a\n  food mill",
        "2 bay leaves",
        "1 Parmigiano-Reggiano cheese rind",
        "1 lb. (500 g) pappardelle, cooked until al dente and drained",
        "Grated Parmigiano-Reggiano cheese for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pappardelle with Bolognese Sauce",
    "url": "http://www.williams-sonoma.com/recipe/pappardelle-with-bolognese-sauce.html"
}
