{
    "directions": [
        "Cook the vegetables",
        "In a large fry pan over medium heat, cook the pancetta, stirring occasionally, until browned, about 5 minutes. Using a slotted spoon, transfer the pancetta to a small plate.",
        "Add the leeks and fennel to the drippings in the pan and sauté until softened, about 5 minutes. Add the garlic and sauté until softened, about 1 minute.",
        "Make the ragù",
        "Add the brisket, sauce, tomatoes and their juices to the pan. Increase the heat to high and bring to a gentle boil. Reduce the heat to medium and simmer, stirring occasionally, until the flavors are blended and the sauce is slightly reduced, about 10 minutes. Stir in the basil and cook for 1 minute more. Stir in the reserved pancetta.",
        "Cook the pasta",
        "Meanwhile, bring a large pot of water to a boil over high heat. Add the salt and pasta and cook, stirring occasionally to prevent sticking, until the pasta is al dente, according to the package directions. Drain the pasta, add it to the sauce and toss to coat. Divide among shallow bowls and serve immediately. Pass the cheese at the table. Serves 4.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Weeknight",
        ", by Melanie Barnard (Oxmoor House, 2006)."
    ],
    "ingredients": [
        "2 oz. pancetta or bacon, diced",
        "2 large leeks, white and light green portions,   halved, rinsed well and thinly sliced",
        "1 small fennel bulb, trimmed and chopped",
        "2 garlic cloves, minced",
        "2 cups braised brisket, shredded",
        "1 cup sauce from brisket",
        "1 can (14 1/2 oz.) diced tomatoes, with juices",
        "1/4 cup minced fresh basil",
        "2 Tbs. salt",
        "3/4 lb. pappardelle or other wide egg noodles",
        "1/2 cup grated Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pappardelle with Beef Ragù",
    "url": "http://www.williams-sonoma.com/recipe/pappardelle-with-beef-ragu.html"
}
