{
    "directions": [
        "Trim asparagus and diagonally cut into 1/4-inch-thick slices. Finely chop shallots. Finely grate enough lemon zest to measure 1 1/2 teaspoons and squeeze enough juice to measure 3 tablespoons. Cut salmon into 2 x 1/2-inch strips.",
        "Fill a 6-quart pasta pot three fourths full with salted water and bring to a boil for asparagus and pasta. Have ready a bowl of ice and cold water.",
        "Cook asparagus in boiling water until crisp-tender, about 3 minutes, and with a slotted spoon transfer to ice water to stop cooking. Reserve water in pot over low heat, covered. Drain asparagus and set aside some asparagus tips for garnish.",
        "In a deep 12-inch heavy skillet cook shallots in butter with salt and pepper to taste over moderately low heat, stirring, until softened, about 5 minutes. Stir in cream and zest and simmer, stirring occasionally, until slightly thickened, about 10 minutes. Stir in 2 tablespoons lemon juice and remove skillet from heat. Return water in pot to a boil. Cook pasta in boiling water, stirring occasionally, until al dente and ladle out and reserve 1 cup pasta water. Drain pasta in a colander and add to sauce with asparagus, 1/2 cup pasta water, three fourths salmon, remaining tablespoon lemon juice, and salt and pepper to taste. Heat mixture over low heat, gently tossing (and adding more remaining pasta water as needed if mixture becomes dry), until just heated through.",
        "Serve pasta garnished with reserved asparagus tips and remaining salmon."
    ],
    "ingredients": [
        "1 pound asparagus",
        "2 large shallots",
        "2 lemons",
        "1/4 pound sliced smoked salmon (optional)",
        "1 pound dried pappardelle or fettuccine",
        "3 tablespoons unsalted butter",
        "3/4 cup heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Quick & Easy",
        "Lemon",
        "Salmon",
        "Asparagus",
        "Summer",
        "Gourmet"
    ],
    "title": "Pappardelle in Lemon Cream Sauce with Asparagus and Smoked Salmon",
    "url": "http://www.epicurious.com/recipes/food/views/pappardelle-in-lemon-cream-sauce-with-asparagus-and-smoked-salmon-101769"
}
