{
    "directions": [
        "Heat 1 teaspoon oil in heavy medium skillet over medium heat. Add pine nuts and sauté until golden brown, about 7 minutes. Transfer to bowl.",
        "Bring large pot of water to boil. Add spinach and cook until just wilted, about 20 seconds. Using tongs, transfer to bowl of ice water. Return water in pot to boil. Add garlic and boil 1 minutes. Drain and cool. Peel garlic and slice thinly. Drain spinach. Squeeze out any excess moisture from spinach. (Can be prepared 1 day ahead. Store pine nuts in airtight container at room temperature. Cover and refrigerate spinach and garlic separately.)",
        "Preheat broiler. Bring large pot of salted water to boil. Add pasta; boil until tender but firm to bite, stirring occasionally.",
        "Meanwhile, place mushrooms on baking sheet. Brush with 4 tablespoons oil. Sprinkle with salt and pepper. Broil mushrooms until lightly charred and tender, about 5 minutes per side. Transfer to cutting board. Cut each mushroom into 4 wedges. Set aside.",
        "Drain pasta, reserving 1/2 cup cooking liquid. Heat 2 tablespoons oil in heavy large skillet over high heat. Add blanched garlic and sauté until golden, about 2 minutes. Add spinach and mushrooms; sauté until heated through, about 2 minutes. Add pasta and 1/2 cup cheese to spinach mixture; toss will. Add enough reserved pasta cooking liquid to moisten pasta, if necessary. Season with salt and pepper. Sprinkle with pine nuts. Serve, passing additional cheese separately."
    ],
    "ingredients": [
        "1 teaspoon plus 6 tablespoons extra-virgin olive oil",
        "1/2 cup pine nuts",
        "2 10-ounce packages ready-to-use spinach leaves",
        "6 large garlic cloves (unpeeled)",
        "12 ounces pappardelle or fettuccine",
        "6 medium portobello mushrooms, stems trimmed",
        "12 cup freshly grated Parmesan cheese (about 1 1/2 ounces)",
        "Additional freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Pasta",
        "Sauté",
        "Pine Nut",
        "Spinach",
        "Summer"
    ],
    "title": "Pappardelle with Portobello Mushrooms, Spinach and Pine Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/pappardelle-with-portobello-mushrooms-spinach-and-pine-nuts-4490"
}
