{
    "directions": [
        "Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Add garlic and cook until golden brown, stirring frequently, about 3 minutes. Discard garlic. Add onion, pancetta, and fennel seeds to skillet; sauté until onion is tender and pancetta begins to brown, about 8 minutes. Add dried crushed red pepper, then broccoli rabe stems and cook 4 minutes to soften slightly, stirring occasionally. Stir in broccoli rabe tops, sprinkle with salt, and add 1 cup water. Cover and cook until stems and tops are tender, about 5 minutes. Season to taste with salt and pepper.",
        "Meanwhile, cook pasta in large pot of boiling salted water until just tender but still firm to bite. Drain pasta, reserving 1 cup cooking liquid.",
        "Add pasta to skillet with broccoli rabe and stir over low heat to combine, adding reserved cooking liquid by tablespoonfuls to moisten if necessary. Stir in remaining 2 tablespoons oil and 1 cup cheese. Season to taste with salt and generous amount of pepper. Transfer to shallow bowl. Sprinkle with pine nuts and serve, passing additional cheese separately."
    ],
    "ingredients": [
        "4 tablespoons extra-virgin olive oil, divided",
        "3 garlic cloves, peeled, flattened",
        "1 medium onion, chopped",
        "3 ounces thinly sliced pancetta, chopped",
        "1 teaspoon fennel seeds, crushed",
        "1/4 teaspoon dried crushed red pepper",
        "1 large bunch broccoli rabe (also called rapini; generous 1 pound), stems sliced 1/2 inch thick, tops cut into 2-inch pieces",
        "1 cup water",
        "1 8.8-ounce package dried pappardelle pasta",
        "1 cup freshly grated Pecorino Romano cheese, plus additional for serving",
        "1/2 cup pine nuts, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Nut",
        "Pasta",
        "Pork",
        "Sauté",
        "Quick & Easy",
        "High Fiber",
        "Bacon",
        "Spring",
        "Broccoli Rabe"
    ],
    "title": "Pappardelle with Pancetta, Broccoli Rabe, and Pine Nuts",
    "url": "http://www.epicurious.com/recipes/food/views/pappardelle-with-pancetta-broccoli-rabe-and-pine-nuts-234397"
}
