{
    "directions": [
        "In a large fry pan over medium heat, warm the olive oil. Add the onion and sauté until it is tender and beginning to brown, about 5 minutes. Increase the heat to medium-high and add the ground beef and pancetta. Season with salt and pepper and sauté, breaking up the meat with a wooden spoon, just until the beef is no longer pink. Add the wine and boil until it has almost evaporated, about 3 minutes. Add the tomatoes with their juice, the broth, cream and nutmeg. Reduce the heat to medium-low and simmer, breaking up the tomatoes and stirring occasionally, until the sauce is slightly thickened and the flavors are blended, about 30 minutes. Adjust the seasonings with salt and pepper.",
        "Meanwhile, bring a large pot three-fourths full of salted water to a boil over high heat. Add the pasta, stir well and cook until just tender, about 8 minutes. Drain the pasta and return it to the same pot. Add the sauce and toss to coat.",
        "Divide the pasta and sauce among 4 warmed shallow bowls. Sprinkle with the thyme and cheese. Serve immediately and pass more cheese alongside. Serves 4.",
        "Quick tips:",
        "A touch of heavy cream replaces the milk usually used in Bolognese sauce; it lends a silky texture in a shorter cooking time. The sauce keeps well and is even richer in flavor when reheated, so make it a day or two ahead, or prepare extra to freeze. Spaghetti is another good pasta choice.",
        "Adapted from Williams-Sonoma",
        "Weeknight Fresh & Fast,",
        "by Kristine Kidd (Williams-Sonoma, 2011)."
    ],
    "ingredients": [
        "1 Tbs. olive oil",
        "1 large yellow onion, finely chopped",
        "1 lb. ground beef",
        "2 oz. pancetta, finely chopped",
        "Coarse kosher salt and freshly ground pepper, to taste",
        "1/2 cup dry white wine",
        "1 can (14.5 oz.) whole tomatoes in juice, preferably\n  San Marzano",
        "3/4 cup low-sodium chicken broth",
        "1 to 2 Tbs. heavy cream",
        "1/8 tsp. freshly grated nutmeg",
        "12 oz. dried egg pappardelle or fettuccine",
        "1 Tbs. minced fresh thyme",
        "Grated Parmigiano-Reggiano cheese for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pappardelle with Quick Bolognese Sauce",
    "url": "http://www.williams-sonoma.com/recipe/pappardelle-bolognese-sauce.html"
}
