{
    "directions": [
        "Preheat oven to 475°F. Heat a 17- by 11 1/2- by 2-inch flameproof roasting pan in upper third of oven 10 minutes.",
        "Stir together oil, paprika, cayenne, and salt in a large bowl. Rinse hens and pat dry. Remove any excess fat from opening of cavities and season cavities with salt and pepper. Tie drumsticks together if desired. Brush some of spice oil over hens. Toss vegetables and caraway seeds in remaining spice oil to coat and transfer to hot roasting pan. Roast vegetables, uncovered, 25 minutes. Stir vegetables and arrange hens, breast sides up, on top. Roast 40 minutes, then baste hens with pan juices and roast 20 minutes more, or until a thermometer inserted in fleshy part of thigh registers 170°F. Pour any juices from inside hens into pan.",
        "Transfer hens to a cutting board and halve each lengthwise along backbone. Transfer vegetables with a slotted spoon to a platter. Sprinkle parsley over vegetables and top with hen pieces. Skim fat from pan juices and pour over hens. Stir together sour cream and water and serve on the side."
    ],
    "ingredients": [
        "1/4 cup vegetable oil",
        "1 1/2 tablespoons sweet paprika (preferably Hungarian)",
        "1/2 teaspoon cayenne, or to taste",
        "2 1/2 teaspoons salt",
        "3 (1 1/2-pounds) Cornish hens",
        "3 red bell peppers, cut into 1-inch-wide strips",
        "3 large carrots, cut diagonally into 3/4-inch pieces",
        "6 shallots, halved",
        "1 medium celery root (sometimes called celeriac), peeled and cut into 1-inch pieces",
        "1 large boiling potato, peeled and cut into 1-inch pieces",
        "1 tablespoon caraway seeds",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "1 cup sour cream",
        "3 tablespoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Poultry",
        "Vegetable",
        "Roast",
        "Christmas",
        "Root Vegetable",
        "Winter",
        "Gourmet"
    ],
    "title": "Paprika-Roasted Cornish Hens and Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/paprika-roasted-cornish-hens-and-vegetables-102935"
}
