{
    "directions": [
        "Straddle roasting pan across 2 burners, then cook onions and peppers in 1/4 cup oil with bay leaves and 1 teaspoon salt over medium heat, stirring occasionally, until onions are softened, about 5 minutes. Add tomatoes with juice, breaking them up with a spoon, and cook, stirring, until liquid has evaporated, about 3 minutes. Sprinkle paprika over tomato mixture and stir just to combine, then immediately stir in broth. Remove from heat.",
        "Preheat oven to 350°F with rack in middle.",
        "Pat shanks dry and season all over with 2 teaspoon salt. Heat 1/4 cup oil in a 12-inch heavy skillet over high heat until it shimmers, then add 4 shanks and brown, turning once, about 8 minutes total. Add shanks to tomato mixture in roasting pan. Pour off fat from skillet and wipe clean. Heat remaining 1/4 cup oil and brown remaining 4 shanks in same manner, transferring to roasting pan. Pour off fat from skillet, then add wine to skillet and boil, stirring and scraping up any brown bits, 15 to 20 seconds. Pour into roasting pan. Bring to a boil, then cover tightly with heavy-duty foil and braise in oven until very tender, 2 to 2 1/2 hours (depending on size).",
        "Transfer shanks with a slotted spoon to a platter and keep warm, loosely covered with foil. Skim off any fat from braising liquid.",
        "Whisk together sour cream and flour in a medium bowl. Whisk about 1 cup hot braising liquid into sour-cream mixture, then add mixture to remaining braising liquid in roasting pan and simmer (straddled across 2 burners) over low heat, whisking occasionally, until sauce is thickened, about 5 minutes.",
        "Return shanks to sauce along with any meat juices from platter, and simmer until heated through, about 10 minutes. Discard bay leaves."
    ],
    "ingredients": [
        "2 large onions, chopped (3 cups)",
        "1 pound Cubanelle peppers (Italian green frying peppers; 4 large), coarsely chopped",
        "3/4 cup vegetable oil, divided",
        "2 Turkish bay leaves or 1 California",
        "1 (14- to 15-ounce) can plum tomatoes in juice",
        "2 tablespoons sweet Hungarian or regular paprika (not hot)",
        "3 1/2 cups reduced-sodium chicken broth (28 fl ounces)",
        "8 meaty cross-cut veal shanks (ossobuco; 7 to 7 1/2 pounds total), tied",
        "2 cups dry white wine",
        "1 (16-ounces) container sour cream",
        "1 1/2 tablespoons all-purpose flour",
        "Equipment: a 15-by 13-by 3-inch flameproof heavy roasting pan",
        "Accompaniment: tiny dumplings with dill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Tomato",
        "Dinner",
        "Veal",
        "Bell Pepper",
        "Sour Cream",
        "Paprika",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Paprika Veal Shanks",
    "url": "http://www.epicurious.com/recipes/food/views/paprika-veal-shanks-351301"
}
