{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place morel mushrooms in a dry skillet over medium heat and sprinkle with salt and black pepper. Cook, stirring often, until the mushrooms release their juice and the juice evaporates, about 5 minutes.",
        "Sprinkle halibut fillets with salt and black pepper on both sides.",
        "Heat butter in a large skillet over medium-low heat and cook the halibut fillets until golden brown on the outside, about 2 minutes per side. Remove fish from skillet and set aside.",
        "Cook and stir garlic scapes in the same skillet used to cook fish until fragrant, about 1 minute. Remove pan from heat and stir morel mushrooms and thyme with the garlic scapes until combined.",
        "Fold a piece of parchment paper in half crosswise. Use scissors to cut a very large valentine-like heart shape out of the folded paper, as large as possible. Repeat with remaining parchment to make 4 large heart shapes.",
        "Open the heart shapes; brush right sides of the hearts with canola oil.",
        "Place 1/4 morel mushroom mixture in the left (unoiled) half of each heart. Place a halibut fillet on the mushroom mixture. Sprinkle fish with salt and black pepper.",
        "Fold the oiled right half of the heart over the fish. Fold about 1/4 inch of parchment paper over, starting at the rounded end, and work your way down to the point, folding as you go. Fold the edge over a second time to enclose fish and mushrooms in a bundle with a double-folded, sealed edge.",
        "Leave about 1/4 inch of the bottom point unfolded.",
        "Use a straw inserted into the open bottom to blow air into the bundle, making it puff up like a small balloon. Twist the bottom closed to enclose the air.",
        "Place parchment bundles on 2 baking sheets; don't let the bundles touch each other.",
        "Bake in the preheated oven until fish is no longer translucent in the center, about 15 minutes.",
        "To serve, plate each portion and carefully cut open the parchment to reveal the fish, mushrooms, and juices. Bundle will release hot steam when opened."
    ],
    "ingredients": [
        "1 pound fresh morel mushrooms",
        "salt and ground black pepper to taste",
        "4 (6 ounce) Pacific halibut fillets",
        "1 1/2 teaspoons butter",
        "1/2 cup chopped garlic scapes",
        "5 sprigs fresh thyme, leaves stripped and chopped",
        "1 tablespoon canola oil, or as needed",
        "4 12x20-inch pieces of parchment paper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Parchment-Cooked Fish with Morels, Spring Garlic, and Thyme",
    "url": "http://allrecipes.com/recipe/220829/parchment-cooked-fish-with-morels-sp/"
}
