{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C). Place a small pan containing about 2-3 cups of hot water onto the bottom of your oven ( directly onto the bottom of the oven) to generate steam.  Lightly grease a large baking sheet with shortening and then dust lightly with flour. Use a 10 inch pan as a template and draw a 10 inch circle onto the flour dusted sheet using a toothpick. Set aside.",
        "Place the 4 eggs into a small measuring cup and mix with a fork to combine, set aside.",
        "Combine the milk, water, salt and butter in a saucepan over medium heat. When it comes to a full boil, add the flour all at once and stir to make a paste. Continue to stir over the heat for about 40 seconds until the paste dries a little. Remove from heat and place paste into a mixing bowl. Let cool about 4 minutes.",
        "With a mixer on low, mix the paste and slowly add the beaten eggs. Mix slowly but thoroughly until all of the eggs have been added. Place the paste into a pastry bag fitted with a 1/2 inch round decorating tip. Pipe the paste out onto the sheet pan following the 10 inch ring you outlined. Pipe a second ring around the inside next to this ring. Finally, pipe another ring on top of these two rings. Lightly paint the set of rings with the remaining 1 beaten egg and press the sliced almonds into the paste.",
        "Place in the oven on the lowest shelf and bake at 425 degrees F (220 degrees C) for 20 minutes. Reduce the temperature to 375 degrees F (190 degrees C) and bake about 12 minutes more or until brown. Remove form the oven and using a long serrated knife slice off the top half of the puffed ring. Remove any bits of raw dough on the inside of the ring. Replace the top and place back in the oven to crisp the dough, about 5 more minutes. Cool on a rack.",
        "To Make The Filling: Whip the pastry cream until smooth. Place the heavy cream into a bowl along with the vanilla and beat on high until soft peaks are formed. Add in the confectioners' sugar and beat a little more. Fold the pastry cream in with the whipped cream and transfer to a piping bag fitted with a star tip. Pipe the cream mixture into the ring and then replace the top. If you wish, sprinkle with additional powdered sugar."
    ],
    "ingredients": [
        "1 cup all-purpose flour",
        "5 eggs",
        "1/4 cup milk",
        "3/4 cup water",
        "1/4 teaspoon salt",
        "6 tablespoons unsalted butter, softened",
        "1/4 cup sliced almonds",
        "2 1/2 cups pastry cream",
        "1 cup heavy cream, chilled",
        "1 teaspoon vanilla extract",
        "2 tablespoons confectioners' sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Paris-Brest",
    "url": "http://allrecipes.com/recipe/7552/paris-brest/"
}
