{
    "directions": [
        "Stage 1: Combine the milk, sugar and 2 sticks butter in a large pot. Bring to a simmer and when the mixture is hot (but not boiling), turn off the heat and allow to cool to warmer than lukewarm, 30 to 45 minutes.",
        "Stage 2: Sprinkle in the yeast and add 8 cups of flour. Stir to combine, then cover and allow to rise for 1 hour.",
        "Stage 3: After 1 hour, add the salt, baking powder, baking soda and remaining 1 cup flour and stir to combine. Turn out onto a floured surface and knead the dough for 8 to 10 minutes, then form into a ball, cover with a towel and allow to rise in a warm place for 30 to 45 minutes.",
        "Stage 4: Melt 2 sticks butter in a saucepan.",
        "Roll out the dough to 1/2 inch thick. Cut circles with a 2 1/2-inch cutter. Dunk each circle in the melted butter, then immediately fold in half and place on a baking sheet. Press lightly to encourage sealing. Cover with a towel and allow the rolls to rise 30 to 45 minutes.",
        "Preheat the oven to 400 degrees F.",
        "Stage 5: To parbake the rolls before freezing, bake until the rolls are risen and set but not brown, 7 to 8 minutes. Transfer to a wire rack to cool. Freeze the rolls separately, then store them in batches in freezer bags. (If you're not freezing the rolls and want to serve them right away, bake at 400 degrees F until risen, set and golden brown, about 15 minutes total.)",
        "When ready to cook and serve the frozen rolls, preheat the oven to 350 degrees F. Melt the remaining stick of butter in a saucepan.",
        "Place the frozen rolls on baking sheets and brush them with the melted butter. Bake until golden brown, 14 to 16 minutes. Brush them with additional melted butter if you like and let them sit for 1 minute. Serve while still warm."
    ],
    "ingredients": [
        "4 cups whole milk",
        "1 cup sugar",
        "5 sticks salted butter",
        "4 1/2 teaspoons active dry yeast (2 envelopes)",
        "9 cups all-purpose flour, plus more for flouring the surface",
        "1 heaping tablespoon kosher salt",
        "1 heaping teaspoon baking powder",
        "1 scant teaspoon baking soda"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [],
    "title": "Parker House Rolls",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/parker-house-rolls"
}
