{
    "directions": [
        "Dissolve yeast and 1 teaspoon sugar in 1/2 cup warm water in a bowl; let stand until mixture is foaming, about 10 minutes.",
        "Stir warm milk, 6 tablespoons sugar, salt, and remaining 1/2 cup warm water into yeast mixture. Gradually whisk 2 cups flour into yeast mixture until smooth. Add remaining 3 1/2 cup flour, egg, 2 tablespoons and 2 teaspoons vegetable oil to flour-yeast mixture; stir until dough is soft.",
        "Turn dough onto a floured work surface; knead until smooth and elastic, 6 to 8 minutes. Place dough in a greased bowl, turning once so top of dough is greased. Cover bowl with a damp towel and let rise in a warm room until doubled in size, about 1 hour.",
        "Punch dough and divide in half. Roll each half on a floured surface until 1/3 to 1/2-inch thick. Cut dough using a floured 2 1/2-inch round cutter. Brush each dough circle with melted butter.",
        "Make an off-center crease in each dough circle using the dull edge of a table knife. Fold along crease so larger half is on top; press along folded edge.",
        "Grease a baking sheet.",
        "Arrange folded dough circles, 2 to 3 inches apart, on the prepared baking sheet. Cover with a damp towel or plastic wrap and let rise until doubled in size, about 30 minutes.",
        "Preheat oven to 375 degrees F (190 degrees C). Remove towel or plastic wrap from dough.",
        "Bake in the preheated oven until rolls are golden brown, 15 to 20 minutes. Transfer rolls to a wire rack to cool."
    ],
    "ingredients": [
        "1 (.25 ounce) package active dry yeast",
        "1 teaspoon white sugar",
        "1 cup warm water (110 to 115 degrees F/43 to 46 degrees C), divided",
        "1 cup warm milk (110 to 115 degrees F/43 to 46 degrees C)",
        "6 tablespoons white sugar",
        "1 tablespoon salt",
        "5 1/2 cups all-purpose flour, divided, or more as needed",
        "1 egg",
        "2 tablespoons vegetable oil",
        "2 teaspoons vegetable oil",
        "3 tablespoons butter, melted"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Parker House Rolls",
    "url": "http://allrecipes.com/recipe/235292/parker-house-rolls/"
}
