{
    "directions": [
        "Using an electric mixer, beat butter in a medium bowl on low speed until smooth, 1-2 minutes. Add powdered sugar, pepper, and kosher salt. Reduce speed to medium and beat, occasionally scraping down sides of bowl, until light and fluffy, 4-5 minutes. Add flour and cheese. Reduce mixer speed to low and beat mixture just until dough comes together.",
        "Wrap dough in plastic and flatten into a rectangle. Chill until firm, at least 2 hours. DO AHEAD: Dough can be made 5 days ahead. Keep chilled. Let stand at room temperature for 30 minutes before continuing.",
        "Place fennel seeds in a resealable plastic freezer bag. Coarsely crush with a rolling pin or the bottom of a skillet. Alternatively, pulse in a spice mill until coarsely crushed. Transfer to a small bowl; stir in sea salt. Set fennel salt aside.",
        "Arrange a rack in center of oven and preheat to 350°F. Line a baking sheet with parchment paper. Remove plastic wrap from dough. Roll out dough on a lightly floured surface to a 10x8\" rectangle about 1/4\" thick. Cut in thirds crosswise, then cut each third crosswise into 6 rectangles. Arrange cookies on prepared baking sheet, spacing 1\" apart. Brush cookies generously with oil, then sprinkle with fennel salt.",
        "Bake, rotating sheet halfway through, until cookies are golden brown (flecks of cheese will be slightly darker), 20-24 minutes. Let cool on sheets for at least 10 minutes. Serve warm or at room temperature. DO AHEAD: Can be made 2 days ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1/2 cup powdered sugar",
        "1 teaspoon freshly ground black pepper",
        "3/4 teaspoon kosher salt",
        "2 cups all-purpose flour plus more",
        "1 cup finely grated Parmesan (about 2 ounces)",
        "1 tablespoon fennel seeds",
        "1 teaspoon Maldon sea salt or other coarse salt",
        "2 tablespoons extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Cheese",
        "Brunch",
        "Dessert",
        "Bake",
        "Parmesan",
        "Seed",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Parmesan Shortbread with Fennel and Sea Salt",
    "url": "http://www.epicurious.com/recipes/food/views/parmesan-shortbread-with-fennel-and-sea-salt-394673"
}
