{
    "directions": [
        "Preheat oven to 350 degrees F. Place a nonstick cookie sheet in oven with a tin foil liner.",
        "Heat 1/2-inch oil in a large nonstick skillet or frying pan over medium to medium high heat.",
        "Season chicken tenders with salt and pepper. Wash hands. Place flour in a shallow dish. Beat eggs with water in a second dish along side the flour. In a third dish, combine the breading ingredients. Coat chicken in flour, then egg, then bread and cheese mixture. To keep your hands clean, ask for plastic gloves at the butcher counter. To ease your clean up, try using disposable tin pie tins for the flour, egg and bread crumbs.",
        "Cook chicken until deeply golden on each side, 3 to 4 minutes. Transfer to cookie sheet in preheated oven and finish off for another 5 minutes cooking time. Cook chicken 5 or 6 tenders at a time in a single layer, adding additional oil if necessary. If the chicken begins to brown too quickly lower heat slightly. Serve chicken hot or cold with green salad or, complete as a Parmigiano.",
        "Set water on to boil for pasta and prepare according to package directions for al dente. Before coating chicken, add oil, onions and garlic to a saucepan to cook medium low heat. Stir occasionally for 10 minutes while you are working on the chicken. Add both cans of tomatoes and a cup of chicken broth and bring sauce to a bubble. Reduce heat to a simmer until ready to serve. Stir in torn basil and season sauce with salt, to your taste.",
        "Place a little of the sauce on the chicken tenders, top with the shredded provolone and Parmigiano. Place in oven or broiler to melt the cheese and then serve. Coat the hot, cooked pasta lightly with sauce then serve.",
        "Enjoy!"
    ],
    "ingredients": [
        "Olive oil, for frying",
        "1 1/2 pounds chicken breast tenders",
        "Salt and pepper",
        "1 cup all-purpose flour",
        "2 large eggs, beaten with 1/4 cup water",
        "2 cups Italian style bread crumbs",
        "1 cup shredded Parmesan",
        "6 sprigs or stems fresh thyme leaves, stripped and chopped, 2 to 3 tablespoons",
        "6 sprigs fresh rosemary leaves, finely chopped, 3 tablespoons",
        "2 handfuls chopped flat-leaf parsley leaves",
        "4 cloves garlic, finely chopped",
        "1 teaspoon crushed red pepper flakes",
        "Chicken Parmigiano, recipe follows",
        "2 tablespoons extra virgin olive oil",
        "1 small white onion, finely chopped",
        "3 cloves garlic, minced",
        "1 (14 ounce) can chunky style crushed tomatoes",
        "1 (28 ounce) can crushed tomatoes",
        "1 cup chicken broth or stock",
        "A handful fresh basil leaves, torn into small pieces",
        "Coarse salt",
        "1 1/2 cups shredded provolone",
        "1/2 cup grated Parmigiano-Reggiano",
        "1 pound spaghetti, cooked to al dente"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pasta Recipes",
        "Tomato",
        "Vegetable",
        "Poultry Recipes",
        "Cheese",
        "Meat",
        "Chicken Breast",
        "Parmesan Cheese Recipes",
        "Chicken",
        "Provolone Recipes",
        "Main Dish Recipes",
        "Lunch"
    ],
    "title": "Parmigiano and Herb Chicken Breast Tenders",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/parmigiano-and-herb-chicken-breast-tenders-recipe"
}
