{
    "directions": [
        "Preheat oven to 375°F.",
        "Trim root ends flush with onions (so they will stand upright). Cut off tops of onions 1 inch from pointed blossom end and reserve. In a small flameproof baking pan stand onions upright and replace reserved tops. Brush onions with oil a roast in middle of oven 1 hour and 15 minutes, or until centers are just knife-tender.",
        "While onions are roasting, in a saucepan boil potatoes in water to cover 15 minutes, or until tender, and drain in a colander. Cool potatoes until they can just be handled and peel. Return potatoes to pan.",
        "Transfer onions to a work surface to cool and add wine, water, and cream to baking pan. On top of stove cook cream mixture over moderate heat, stirring, until brown bits scraped from bottom of baking pan are just dissolved and add to potatoes.",
        "Leaving outermost layer of each onion inside skin, carefully scoop remaining layers out of onion shells with a small spoon and chop. In a small skillet sauté chopped onion in butter over moderately high heat until golden and add to potato mixture.",
        "Increase oven temperature to 425°F.",
        "Mash potato mixture with a potato masher until potatoes ate coarsely mashed and liquid is incorporated and force through a food mill fitted with fine disk into a bowl. Stir in Parmesan and season with salt and pepper. Spoon potato mixture into onion shells and replace tops. Onions may be prepared up to this point 1 day ahead and chilled, covered.",
        "In a small baking pan roast onions in middle of oven until heated through, 15 to 25 minutes."
    ],
    "ingredients": [
        "2 yellow onions (each about 3 inches in diameter), unpeeled",
        "olive oil for brushing onions",
        "8 ounces red potatoes (about 2 medium)",
        "1 tablespoon dry white wine",
        "1 tablespoon water",
        "2 tablespoons heavy cream",
        "1 tablespoon unsalted butter",
        "2 tablespoons freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Potato",
        "Side",
        "Roast",
        "Sauté",
        "Vegetarian",
        "Parmesan",
        "Winter",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Parmesan Potato-Stuffed Roasted Onions",
    "url": "http://www.epicurious.com/recipes/food/views/parmesan-potato-stuffed-roasted-onions-14270"
}
