{
    "directions": [
        "Combine flour, sage, and salt in a food processor, then add butter and shortening and pulse until mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Drizzle with 2 tablespoons ice water and pulse until just incorporated.",
        "Squeeze a small handful of dough: If it doesn't hold together, add more ice water, 1 tablespoon at a time, pulsing until just incorporated, then test again. (Do not overwork, or pastry will be tough.)",
        "Turn out dough onto a lightly floured surface and divide into 4 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather dough into a ball with scraper, then flatten into a 5-inch square. Chill dough, wrapped in plastic wrap, until firm, at least 1 hour.",
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Roll out dough on a lightly floured surface with a floured rolling pin into a 17- by 8-inch rectangle and fit into tart pan. Trim excess dough, leaving a 1/2-inch overhang, then fold overhang inward and press against side of pan to reinforce edge. Lightly prick bottom and sides of shell all over with a fork. Chill until firm, about 30 minutes.",
        "Line pastry shell with foil and fill with pie weights. Bake until sides are set and edges are pale golden, 18 to 20 minutes. Carefully remove foil and weights and bake shell until bottom is pale golden, 10 to 15 minutes more. Lightly brush bottom and sides of shell with egg white and continue to bake until dry and shiny, about 5 minutes. Cool completely in pan on a rack, about 15 minutes.",
        "Reduce oven temperature to 325°F.",
        "Bring cheese and cream just to a boil in a small heavy saucepan over moderate heat, stirring occasionally. Remove from heat and steep, covered, 30 minutes. Pour steeped cream through a fine-mesh sieve into a bowl, pressing hard on cheese solids and then discarding them.",
        "While cream steeps, heat oil in a 10-inch heavy nonstick skillet over moderately high heat until hot but not smoking, then sauté squash with 1/8 teaspoon salt and 1/8 teaspoon pepper, turning, until lightly browned on all sides, 8 to 10 minutes. Transfer with a slotted spoon to paper towels to drain and cool slightly.",
        "Whisk together whole egg, yolk, and remaining 1/4 teaspoon salt and 1/8 teaspoon pepper in a bowl until combined. Add steeped cream, whisking until smooth.",
        "Scatter squash evenly in tart shell and pour custard over. Bake until custard is just set and golden in patches, 30 to 35 minutes. Cool tart in pan on rack at least 20 minutes.",
        "Halve tart crosswise, then cut in half lengthwise and cut each quarter into 8 pieces. Serve warm or at room temperature.",
        "*Available at some cookware shops and Fante's Kitchen Wares Shop (fantes.com)."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "2 1/2 teaspoons finely chopped fresh sage",
        "Rounded 1/4 teaspoon salt",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into cubes",
        "2 tablespoons cold vegetable shortening, cut into pieces",
        "2 to 4 tablespoons ice water",
        "1 large egg white (yolk reserved for filling), lightly beaten",
        "2 ounces finely grated Parmigiano-Reggiano (1 cup)",
        "1 cup heavy cream",
        "1 1/2 tablespoons olive oil",
        "3/4 pound piece butternut squash, peeled, seeded, and cut into 1/2-inch pieces (2 cups)",
        "3/8 teaspoon salt",
        "1/4 teaspoon coarsely ground black pepper",
        "1 whole large egg",
        "1 large egg yolk",
        "Special equipment: a pastry or bench scraper; a 13 1/2- by 4-inch rectangular* or 8 1/2-inch round fluted tart pan with a removable bottom; pie weights or raw rice",
        "Garnish: fried sage leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Egg",
        "Bake",
        "Christmas",
        "Cocktail Party",
        "Vegetarian",
        "Parmesan",
        "Butternut Squash",
        "Winter",
        "Sage",
        "Gourmet"
    ],
    "title": "Parmesan Custard Tart with Butternut Squash",
    "url": "http://www.epicurious.com/recipes/food/views/parmesan-custard-tart-with-butternut-squash-108878"
}
