{
    "directions": [
        "Preheat the oven to 400°F.",
        "In a food processor blend well all pesto ingredients. Pesto may be made 3 days ahead and chilled, surface covered with plastic wrap.",
        "Lightly brush a large baking sheet with some butter and put 1 sheet phyllo on butter. Lightly brush phyllo with some remaining butter and sprinkle with 1 tablespoon Parmesan. Put another sheet phyllo over cheese, pressing firmly so that it adheres to bottom layer. Butter, sprinkle with cheese, and layer remaining phyllo in same manner, ending with a sheet of phyllo. Lightly brush top sheet with remaining butter. Fold in all sides 1/4 inch, pressing to top sheet, and fold up a 1/4-inch border, crimping corners.",
        "Spread pesto and phyllo crust and sprinkle with feta.",
        "Bake pizza in middle of oven until crust is golden, about 15 minutes."
    ],
    "ingredients": [
        "3 cups packed fresh parsley leaves, preferably flat-leafed (about 3 bunches), rinsed and spun dry",
        "2 large garlic cloves, chopped",
        "1/3 cup freshly grated Parmesan cheese",
        "1/3 cup pine nuts, toasted until golden and cooled",
        "1/3 cup olive oil",
        "3/4 stick (6 tablespoons) unsalted butter, melted and kept warm",
        "10 sheets phyllo, stacked between 2 sheets of wax paper and covered with a kitchen towel",
        "9 tablespoons freshly grated Parmesan cheese (about 2 ounces)",
        "3/4 cup crumbled feta cheese (about 1/4 pound)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Garlic",
        "Herb",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Feta",
        "Parmesan",
        "Pine Nut",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Parsley Pesto and Feta Phyllo Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/parsley-pesto-and-feta-phyllo-pizza-11093"
}
