{
    "directions": [
        "Cover potatoes with cold water by 1 inch in a medium saucepan, then stir in 1 tablespoon salt and simmer until not quite tender, about 8 minutes. Drain potatoes and cool slightly. Peel potatoes, then quarter and slice about 1/2 inch thick.",
        "Heat oil in a 12-inch skillet over medium heat until it shimmers, then cook mustard and cumin seeds until a shade darker and mustard seeds begin to pop, about 45 seconds. Add curry leaves and chiles and cook, stirring, 30 seconds. Add onion and cook, stirring occasionally, until soft and translucent, about 10 minutes. Stir in turmeric and 1 1/2 teaspoons salt, then add potatoes and cook over low heat, stirring occasionally, until potatoes are tender, 10 to 14 minutes. Discard chiles, then stir in cilantro and salt to taste.",
        "Transfer to a 10-inch heavy skillet with a high-domed lid (or use a metal bowl or inverted skillet as a lid) and keep warm, covered, over very low heat.",
        "Beat egg whites with a pinch of salt until they just hold stiff peaks. Lightly beat yolks with a fork, then stir in a spoonful of beaten whites to lighten them. Fold in remaining whites gently but thoroughly. Drizzle water around edge of skillet and spread eggs evenly over surface of potatoes. Increase heat and bring liquid just to a simmer (to create steam). Cover skillet, then reduce heat to low and cook until surface is dry and slightly springy to the touch, 12 to 14 minutes."
    ],
    "ingredients": [
        "2 pounds small to medium yellow-fleshed potatoes such as Yukon Gold",
        "2 tablespoons vegetable oil",
        "1 teaspoon brown mustard seeds",
        "1 teaspoon cumin seeds",
        "20 to 30 fresh curry leaves",
        "3 to 4 fresh green serrano chiles, slit to the stem",
        "1 large onion, thinly sliced",
        "1/2 teaspoon turmeric",
        "1 cup coarsely chopped cilantro",
        "3 large eggs, separated",
        "1/4 cup water",
        "Garnish: lime wedges; fried or roasted cashews; chopped cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Pepper",
        "Potato",
        "Vegetable",
        "Vegetarian",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Curry",
        "Hot Pepper",
        "Root Vegetable",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Parsi Potatoes with Egg",
    "url": "http://www.epicurious.com/recipes/food/views/parsi-potatoes-with-egg-240280"
}
