{
    "directions": [
        "Melt 3 tablespoons butter with oil in large pot over medium heat. Add onion; sauté until soft, about 5 minutes. Add parsnips, potatoes, and turnips; stir 4 minutes. Add garlic; stir 1 minute. Add broth; bring to boil. Cover; reduce heat to medium-low. Simmer until vegetables are tender, about 15 minutes.",
        "Using slotted spoon, transfer vegetables to large bowl. Pour cooking broth into small bowl; reserve. Add cream cheese to vegetables. Using electric mixer, beat vegetables to smooth puree. Add 2 tablespoons butter-oil mixture from top of broth to vegetables. Stir in 2 tablespoons dill. Season with salt and pepper.",
        "Butter 11 x 7 x 2-inch glass baking dish. Transfer puree to prepared dish. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Melt 3 tablespoons butter in small skillet over medium heat. Add panko and stir until golden brown, about 2 minutes. DO AHEAD: Can be made 1 day ahead. Cool and store airtight at room temperature.",
        "Position rack in top third of oven; preheat to 350°F. Sprinkle panko mixture over vegetable puree. Bake until top is brown, about 15 minutes (25 minutes if chilled). Sprinkle with 2 tablespoons dill."
    ],
    "ingredients": [
        "6 tablespoons butter, divided",
        "3 tablespoons olive oil",
        "1 1/4 cups finely chopped onion",
        "1 1/2 pounds parsnips, peeled, cut into 1/2- to 3/4-inch cubes",
        "1 1/2 pounds russet potatoes, peeled, cut into 1/2- to 3/4-inch cubes",
        "1 pound turnips, peeled, cut into 1/2- to 3/4-inch cubes",
        "2 garlic cloves, chopped",
        "2 cups vegetable broth",
        "2 tablespoons (1 ounce) cream cheese",
        "4 tablespoons chopped fresh dill, divided",
        "1/2 cup panko (Japanese breadcrumbs)",
        "Ingredient info: Panko can be found in the Asian foods section of many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Side",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Root Vegetable",
        "Parsnip",
        "Turnip",
        "Fall",
        "Christmas Eve",
        "Potluck",
        "Butter",
        "Pescatarian",
        "Kosher"
    ],
    "title": "Parsnip, Potato, and Turnip Puree",
    "url": "http://www.epicurious.com/recipes/food/views/parsnip-potato-and-turnip-puree-361833"
}
