{
    "directions": [
        "After peeling one of the carrots, use the vegetable peeler to peel away long strips from the whole length of the carrot, allowing the strips to drop into a large bowl. Turn the carrot in your hand about one-quarter turn after every 4 or 5 strips, so you'll generally have strips of similar width and length overall. Do the same with the remaining carrots and the parsnips, both of which have a tough core that should be discarded once you get there (the color tends to change slightly).",
        "Pour about 2 inches of oil into a large heavy saucepan (the oil should not come more than halfway up the sides of the pan). Bring to 375°F over medium heat.",
        "While the oil is heating, combine the salt and thyme in a small dish and rub them together between your fingers for a bit to release the aromatics of the thyme.",
        "Carefully add a handful of the vegetable strips to the oil and fry until lightly browned and crisp, 1 to 2 minutes. Use the back of a slotted spoon to gently press the strips down into the oil and spread them out a bit to help ensure even cooking. When crisped, lift out the strips and scatter them on paper towels to drain. Repeat with the remaining vegetable strips, allowing the oil to reheat between batches as needed.",
        "Transfer the chips to a serving bowl, sprinkle the thyme-salt mixture over them, and serve. They will be best served shortly after frying."
    ],
    "ingredients": [
        "3 large carrots (about 1 pound)",
        "2 large parsnips (about 1 pound)",
        "Vegetable oil, for frying",
        "1 teaspoon kosher salt or flaky or coarse sea salt",
        "1/2 teaspoon minced fresh thyme"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Fry",
        "Super Bowl",
        "Kid-Friendly",
        "Root Vegetable",
        "Carrot",
        "Parsnip",
        "Poker/Game Night",
        "Pan-Fry",
        "Party"
    ],
    "title": "Parsnip and Carrot Chips",
    "url": "http://www.epicurious.com/recipes/food/views/parsnip-and-carrot-chips-51145000"
}
