{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Lightly grease and flour two 8 inch cake pans.",
        "Sift together; the cake flour, baking powder, 3/4 teaspoon salt, and 1/3 cup sugar. Add the shortening and 3/4 cup of the milk, beat with an electric mixer on medium speed for 2 minutes, scraping bowl while beating. Add 4 of the egg whites and beat the batter for 2 more minutes , scraping bowl while beating.",
        "Fill each cake layer pan 1/3 full of batter, sprinkle half the cherries over batter, then add remaining batter, sprinkle remaining cherries on top.",
        "Bake at 350 degrees F (175 degrees C) for about 35 minutes. Remove cakes from pans and let cool.  Frost with whipped cream or fluffy boiled icing and sprinkle with flaked coconut and garnish with maraschino cherry halves.",
        "To Make Fluffy Boiled Icing: Combine in a saucepan: 1 cup of the sugar, water, light corn syrup, and 1/8 teaspoon of the salt. Stir until well blended. Boil slowly without stirring until mixture will spin a long thread when a little is dropped from a spoon about 238 degrees F to 242 degrees F (116 degrees C to 118 degrees C).",
        "In a large mixing bowl beat 2 of the egg whites until stiff. Pour hot syrup over beaten egg whites while continually beating. Continue beating until mixture is very fluffy and will hold its shape. Then add vanilla and beat until blended. Spread on cake. If icing does not seem stiff enough beat in 2 or 3 tablespoons confectioners' sugar one tablespoon at a time until stiff enough to hold shape."
    ],
    "ingredients": [
        "2 1/4 cups cake flour",
        "3 teaspoons baking powder",
        "3/4 teaspoon salt",
        "1 1/3 cups white sugar",
        "1/2 cup shortening",
        "3/4 cup milk",
        "4 egg whites",
        "1/3 cup maraschino cherries, diced",
        "1/3 cup water",
        "1 tablespoon light corn syrup",
        "1/8 teaspoon salt",
        "1 teaspoon vanilla extract",
        "6 maraschino cherries, halved",
        "1/2 cup flaked coconut",
        "1 cup white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Party Cake",
    "url": "http://allrecipes.com/recipe/7396/party-cake/"
}
