{
    "directions": [
        "Heat brandy with raisins in a small saucepan over low heat until warm, then remove from heat and let steep until raisins are softened, about 15 minutes.",
        "Force cheese and yolks through a potato ricer or a medium-mesh sieve into a bowl.",
        "Beat together butter and sugar in a large bowl with an electric mixer at medium speed until pale and fluffy, about 2 minutes. Add cheese mixture, sour cream, vanilla, and salt and beat until just combined. Beat cream in a bowl with cleaned beaters until it holds soft peaks. Fold whipped cream and raisins with any remaining brandy into cheese mixture gently but thoroughly.",
        "Line mold (or flowerpot) with a single layer of cheesecloth, leaving a 2- to 3-inch overhang on all sides. Spoon cheese mixture into mold, then fold ends of cheesecloth over top. Put lid on cheesecloth, then put weights on lid (or on foil and small plate if using flowerpot). Chill mold on a large plate (to catch drips) at least 24 hours.",
        "Remove lid from mold and open cheesecloth. Invert a serving plate over top of mold and invert mold onto plate. Unlock hinges and open mold, removing cheesecloth. Loosely cover cheese with plastic wrap and let stand at room temperature 30 minutes.",
        "*Available at some supermarkets, many cheese shops, and Murray's cheese shop (888-692-4339).",
        "**We got our mold from Toroney's Custom Woodwork and Church Supply (610-942-3506)."
    ],
    "ingredients": [
        "1/3 cup brandy",
        "1 cup loosely packed golden raisins (5 ounces)",
        "2 pounds farmer cheese*",
        "2 hard-boiled large egg yolks (reserve whites for another use if desired)",
        "1 stick (1/2 cup) unsalted butter, softened",
        "3/4 cup sugar",
        "1 cup sour cream",
        "2 teaspoons vanilla",
        "1/4 teaspoon salt",
        "1 cup chilled heavy cream",
        "Special equipment: a wooden paskha cheese mold** or a clean 2-quart terra-cotta flowerpot with a drainage hole and a plate slightly smaller than top of pot; cheesecloth; 2 lb of weights such as large soup or vegetable cans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Cheese",
        "Easter",
        "Vegetarian",
        "Raisin",
        "Brandy",
        "Spring",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Paskha Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/paskha-cheese-109329"
}
