{
    "directions": [
        "Whisk together eggs, sugar, cornstarch, and salt in a bowl until smooth.",
        "Heat passion-fruit purée in a 1 1/2- to 2-quart heavy saucepan over moderate heat until heated through, then add hot purée to egg mixture in a slow stream, whisking until combined. Return to saucepan. Whisk in butter, 1 cube at a time, over moderate heat and cook, whisking frequently, until mixture is thickened and just comes to a boil, about 6 minutes. Cook, whisking constantly, 2 minutes more. Force curd through a fine-mesh sieve into a bowl and chill, its surface covered with wax paper, at least 8 hours.",
        "Whisk together flour, sugar, and salt in a large bowl (or pulse in a food processor). Blend in butter with your fingertips or a pastry blender (or pulse) until mixture resembles coarse meal with some roughly pea-size butter lumps. Beat together yolk and water with a fork and stir into flour mixture (or pulse) until combined well.",
        "Squeeze a small handful: If it doesn't hold together, add more water, 1/2 tablespoon at a time, to dough, stirring (or pulsing) until just combined. (Do not overwork, or pastry will be tough.)",
        "Turn out dough onto a lightly floured surface and divide into 8 portions. With heel of your hand, smear each portion once in a forward motion to help distribute fat. Gather all of dough together with scraper and press into a ball, then flatten into a 5-inch disk. Chill, wrapped tightly in plastic wrap, until firm, at least 1 hour.",
        "Bring dough to cool room temperature before rolling out, about 30 minutes.",
        "Lightly dust dough with flour and roll out between 2 sheets of wax paper into a 12-inch round. Fit dough into tart pan (discard paper), pressing with floured fingers onto bottom and up side of pan. Trim overhang to 1/2 inch and fold inside, pressing against rim of pan, then chill shell 30 minutes.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Line shell with foil and fill with pie weights. Bake until edge is pale golden, about 20 minutes. Remove foil and weights and bake shell until bottom and side are golden, 20 to 25 minutes more. Cool completely in pan on a rack. Remove side of pan.",
        "Combine whites and salt in a bowl.",
        "Bring sugar and water to a boil in a 1- to 1 1/2-quart heavy saucepan over moderate heat, stirring until sugar is dissolved. Put thermometer facedown into sugar syrup, resting other end against rim of saucepan, and continue to boil (but do not stir), brushing any sugar crystals down side of pan with pastry brush dipped in water.",
        "When syrup reaches about 235°F, beat egg whites with salt at medium-high speed until they just hold soft peaks.",
        "When syrup reaches 238 to 242°F, immediately remove syrup from heat and pour in a slow, thin stream down side of bowl into whites (avoid beaters), beating at high speed until meringue is cool to the touch, about 10 minutes in a stand mixer or 15 with a handheld.",
        "Transfer shell to a cake plate. Spoon curd into shell and spread evenly. Dollop meringue on top of curd, then spread to edge of crust. Draw meringue up into peaks with a rubber spatula.",
        "Move blowtorch flame evenly back and forth over meringue peaks, holding flame 1 to 2 inches from meringue to avoid burning, until lightly browned in spots.",
        "*Available at Latino markets and some supermarkets."
    ],
    "ingredients": [
        "6 large eggs",
        "1 cup sugar",
        "1 tablespoon cornstarch",
        "1/8 teaspoon salt",
        "2/3 cup thawed unsweetened passion-fruit (maracuyá) purée* such as Goya brand",
        "1 stick (1/2 cup) unsalted butter, cut into 1/2-inch cubes",
        "1 1/3 cups all-purpose flour plus additional for dusting",
        "2 tablespoons sugar",
        "1/4 teaspoon salt",
        "1 stick (1/2 cup) cold unsalted butter, cut into 1/2-inch cubes",
        "1 large egg yolk",
        "1 1/2 tablespoons ice water plus additional if necessary",
        "4 large egg whites at room temperature 30 minutes",
        "1/8 teaspoon salt",
        "3/4 cup sugar",
        "1/4 cup water",
        "Special equipment: a pastry or bench scraper; a 9- to 9 1/2-inch fluted round tart pan with removable bottom; pie weights or raw rice; a candy thermometer; a pastry brush; a small blowtorch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Backyard BBQ",
        "Summer",
        "Shower",
        "Passion Fruit",
        "Party",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Passion-Fruit Meringue Tart",
    "url": "http://www.epicurious.com/recipes/food/views/passion-fruit-meringue-tart-232181"
}
