{
    "directions": [
        "In a blender purée the frozen raspberries with the syrup, strain the purée through a fine sieve into a saucepan, and stir in the cornstarch mixture. Bring the mixture to a boil over moderate heat, stirring, boil it, stirring, for 1 minute, and chill it, covered partially, until it is cold.",
        "Halve the passion fruits over a sieve set over a bowl to catch any juices and scoop the seeds and pulp into the sieve. Scrape the seeds with a spatula until the juice and most of the pulp has been extracted and reserve 1/2 cup of the juice. In a small saucepan sprinkle the gelatin over moderate heat, stirring, until the gelatin is dissolved completely. Add 1/3 cup water and the sugar, heat the mixture, stirring, until the sugar is dissolved, and in a metal bowl combine well the gelatin mixture, the reserved passion fruit juice, and the food coloring.",
        "In a bowl beat the cream until it holds soft peaks and reserve it. Chill the passion fruit mixture set in a larger bowl of ice and cold water, stirring until it is the consistency of raw egg white and fold in the reserved whipped cream. Spoon the passion fruit mousse and the raspberry swirl mixture decoratively into four 1 1/2-cup goblets, chill overnight, and garnish them with the raspberries."
    ],
    "ingredients": [
        "a 10-ounce package frozen raspberries in light syrup, thawed",
        "2 teaspoons cornstarch dissolved in 1 tablespoon cold water",
        "8 passion fruit (available seasonally at specialty produce markets)",
        "2 1/2 teaspoons unflavored gelatin",
        "1/2 cup sugar",
        "3 or 4 drops of yellow food coloring if desired",
        "3/4 cup well-chilled heavy cream",
        "12 raspberries for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Low Sodium",
        "Raspberry",
        "Chill",
        "Passion Fruit",
        "Gourmet",
        "Kidney Friendly"
    ],
    "title": "Passion Fruit Mousses with Raspberry Swirl",
    "url": "http://www.epicurious.com/recipes/food/views/passion-fruit-mousses-with-raspberry-swirl-10287"
}
