{
    "directions": [
        "Put the passion fruit mix together the day before you wish to bake the tart (resting it in the refrigerator helps avoid splitting). Break the eggs into a bowl and whisk. Add the sugar and continue to whisk until well incorporated. While stirring gently, pour in the cream. Add the passion fruit juice and continue to stir until well blended. Cover and refrigerate overnight.",
        "Spray a 26 cm (10-inch) tart tin with Pure and Simple (vegetable cooking spray).",
        "On a lightly floured surface, roll out the pastry to an 11-inch round. Roll the pastry over your rolling pin and gently ease into the tart case, pushing the sides in gently so that it takes the fluting. Rest in the refrigerator for 30 minutes.",
        "Preheat the oven to 180°C (350°F). Line the tart case with foil, place rice in the foil and bake blind for 20 minutes. Remove the rice and foil, brush the tart shell with egg wash and cook for a further 10 minutes. Remove from the oven and lower the temperature to 140°C (290°F). Return the tart case to the oven.",
        "With the case sitting in the oven, carefully pour in the passion fruit custard. Fill the tart right to the top. Bake for 40 minutes.",
        "Check — the tart should be halfway set but still be quite wobbly in the middle. If you take it out too soon it will not set and will run when you cut it; if you leave it in too long it will set too firmly and lose its elegance. Through experience you'll find the optimum set for the tart in your oven.",
        "Remove the tart from the oven, balance on a cup and remove the sides. Put on a cake rack and, with a palette knife, slide the base off the tart tin. This will allow the tart to cool and the pastry to crisp up rather than sweat. Invert the pastry ring back onto the tart to help hold the sides in as it cools and sets. Allow to cool for 1 hour. Carefully cut with a serrated knife and place in the middle of large white plates. Dust with confectioner's sugar and serve."
    ],
    "ingredients": [
        "nine 55 g (large) eggs",
        "350 g (1 1/2 cups) superfine sugar",
        "300 ml (1 1/4 cups) double cream (45% butterfat)",
        "350 ml (1 1/2 cups) passion fruit juice, strained",
        "all-purpose flour, for rolling",
        "Sweet Shortcrust Pastry",
        "a little egg wash for glazing",
        "confectioner's sugar for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Passion Fruit"
    ],
    "title": "Passion Fruit Tart",
    "url": "http://www.epicurious.com/recipes/food/views/passion-fruit-tart-109294"
}
