{
    "directions": [
        "Combine 1/3 cup water, 1/4 cup sugar, and 1 tablespoon lime juice in small bowl; stir until sugar dissolves. Using spoon, scoop flesh from passion fruits into sugar mixture. Strain mixture through fine-mesh strainer into small bowl; press on seeds with rubber spatula to extract as much liquid as possible (you will need 1 cup strained liquid); discard seeds in strainer.",
        "Divide passion fruit mixture among eight 3-ounce paper cups (about 2 tablespoons for each). Stretch plastic wrap tightly over top of each cup, covering completely and securing each with rubber band. Insert ice pop stick or lollipop stick through plastic wrap and into mixture in each cup (taut plastic will hold stick in place). Place cups in muffin pan, tilting cups at angle. Freeze until passion fruit mixture is set, about 3 hours.",
        "Meanwhile, stir guava nectar, remaining 3 tablespoons sugar, and 1 tablespoon lime juice in 2-cup measuring cup until sugar dissolves. Chill mixture until cold.",
        "Remove cups with frozen passion fruit mixture from freezer; stand cups upright in muffin pan. Peel back some of plastic wrap on each. Pour guava mixture atop frozen passion fruit mixture in cups, dividing equally. Cover with plastic wrap, secure with rubber band, and freeze until firm, at least 4 hours. DO AHEAD: Can be made 3 days ahead. Keep frozen.",
        "Using scissors, cut off paper cups from pops and serve immediately."
    ],
    "ingredients": [
        "1/3 cup water",
        "1/4 cup plus 3 tablespoons sugar",
        "2 tablespoons fresh lime juice, divided",
        "7 to 8 ripe passion fruits (about 11 ounces), halved",
        "1 11.5-ounce can guava nectar (about 1 1/2 cups)",
        "Special equipment: 8 3-ounce disposable paper cups; 8 ice pop sticks or lollipop sticks",
        "Ingredient info: Choose passion fruit that is wrinkled on the outside, which indicates that the fruit is ripe."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Low Fat",
        "Kid-Friendly",
        "Low Cal",
        "Backyard BBQ",
        "Frozen Dessert",
        "Summer",
        "Healthy",
        "Low Cholesterol",
        "Guava",
        "Passion Fruit",
        "Party"
    ],
    "title": "Passion Fruit and Guava Pops",
    "url": "http://www.epicurious.com/recipes/food/views/passion-fruit-and-guava-pops-359812"
}
