{
    "directions": [
        "Sprinkle gelatin over 1/4 cup water and let stand 2 minutes to soften.",
        "Heat sugar and remaining cup water in a 1-quart heavy saucepan over moderately high heat, stirring, until sugar is dissolved. Add gelatin mixture and stir until dissolved. Transfer mixture to a 1-quart glass measure or bowl, then set in a large bowl of ice and cold water and stir frequently until cold but not set, about 15minutes. Stir in passion-fruit purée, then chill in refrigerator until ready to use.",
        "Sprinkle gelatin over 1/4 cup water and let stand 2 minutes to soften.",
        "Heat sugar and remaining 3/4 cup water in 1-quart saucepan over moderately high heat, stirring, until sugar is dissolved. Add gelatin mixture and stir until dissolved. Transfer mixture to another 1-quart glass measure or bowl, then set in a large bowl of ice and cold water and stir frequently until cold but not set, about 15minutes.",
        "While gelatin mixture chills, purée blackberries in a food processor, then force through a fine-mesh sieve into a bowl, discarding seeds.",
        "Stir lemon juice and 1 cup purée into chilled gelatin mixture, then chill in refrigerator until ready to use.",
        "Pour a scant 1/4 cup passion-fruit mixture into each glass, then stand all 6 glasses in a wide pot. Fill pot with enough ice and cold water to reach level of jelly and chill in refrigerator until jelly is just set, about 2 hours. (Keep unused portion of jellies in refrigerator, stirring once or twice to slow setting.)",
        "Pour a scant 1/4 cup blackberry mixture on top of set passion-fruit jelly (pouring mixture gently over back of a spoon held just over set jelly helps to keep new layer from damaging layer beneath). Add enough ice to pot to reach level of jelly and chill in refrigerator until jelly is set, about 2 hours.",
        "Make another layer of passion-fruit jelly and another layer of blackberry jelly in same manner, adding ice to pot and chilling in refrigerator until jellies are set (last two layers will take only about 1 1/2 hours each to chill).",
        "When all layers are set, remove glasses from ice bath and chill, loosely covered with plastic wrap, 8 hours (or overnight).",
        "Combine lemon verbena with sugar in a small bowl, then gently bruise verbena with a pestle or wooden spoon (to release flavor). Stir in cream and chill, stirring occasionally, 1 hour.",
        "Pour through cleaned fine-mesh sieve into a larger bowl, pressing gently on solids and then discarding them, then chill cream, covered, until ready to serve.",
        "Just before serving, beat cream with an electric mixer until it just holds soft peaks and spoon dollops over jellies."
    ],
    "ingredients": [
        "1 1/2 teaspoons unflavored gelatin (from a 1/4-oz envelope)",
        "1 1/4 cups water",
        "1/2 cup sugar",
        "1 cup thawed passion-fruit purée (from a 14-oz frozen package)",
        "1 1/2 teaspoons unflavored gelatin (from a 1/4-oz envelope)",
        "1 cup water",
        "1 cup sugar",
        "11 to 12 oz blackberries (2 1/2 cups)",
        "2 tablespoons fresh lemon juice",
        "3 tablespoons chopped fresh lemon verbena or lemon balm",
        "1/2 tablespoon sugar",
        "1/2 cup heavy cream",
        "Special equipment: 6 (6- to 8-oz) juice glasses",
        "Garnish: fresh lemon verbena sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Kid-Friendly",
        "Blackberry",
        "Lemon",
        "Summer",
        "Chill",
        "Passion Fruit",
        "Gourmet",
        "Kidney Friendly",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Passion-Fruit and Blackberry Jellies with Lemon Verbena Cream",
    "url": "http://www.epicurious.com/recipes/food/views/passion-fruit-and-blackberry-jellies-with-lemon-verbena-cream-109660"
}
