{
    "directions": [
        "Preheat oven to 350°F. Line bottom of 9-inch-diameter springform pan with 2 3/4-inch-high sides with parchment paper. Stir chocolate and margarine in heavy medium saucepan over low heat until melted and smooth. Remove from heat. Cool until lukewarm.",
        "Using electric mixer, beat yolks and 3/4 cup sugar in large bowl until pale and very thick, about 4 minutes. Add chocolate mixture in 2 additions and beat until well blended. Using clean dry beaters, beat egg whites in another large bowl until foamy. Gradually add 1/4 cup sugar and beat until whites are stiff but not dry. Fold 1/3 of whites into chocolate mixture. Fold in remaining whites in 2 additions. Transfer batter to prepared pan.",
        "Bake torte until crust forms on top and tester inserted into center comes out with some moist batter and some moist crumbs still attached, about 55 minutes (top may crack). Run small sharp knife around torte to loosen. Cool in pan on rack (torte will fall and crack). Remove pan sides. Invert torte onto platter. (Can be prepared 1 day ahead. Cover with cake dome and store at room temperature.)",
        "Grind 1/3 cup sugar in blender until fine powder forms. Place doily atop torte. Sift ground sugar over doily; gently remove doily. Garnish torte with raspberries, if desired. Serve with Raspberry Sauce."
    ],
    "ingredients": [
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 cup (2 sticks) unsalted kosher-for-Passover pareve (non-dairy) margarine",
        "8 large egg yolks",
        "1 cup plus 1/3 cup sugar",
        "5 large egg whites",
        "Paper doily",
        "Fresh raspberries (optional)",
        "Raspberry Sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Berry",
        "Chocolate",
        "Dessert",
        "Bake",
        "Passover",
        "Raspberry",
        "Spring",
        "Kosher"
    ],
    "title": "Passover Chocolate Torte with Raspberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/passover-chocolate-torte-with-raspberry-sauce-101369"
}
