{
    "directions": [
        "Sprinkle gelatin over water in a small saucepan and let stand 1 minute to soften. Cook over low heat, stirring, until gelatin is dissolved, 1 to 2 minutes. Remove from heat and whisk in 1 tablespoon passion-fruit nectar at a time until gelatin mixture is cool, then whisk in remaining nectar.",
        "Transfer to a metal bowl and set bowl into a larger bowl half-filled with ice and cold water. Let stand, stirring occasionally, until gelée is consistency of raw egg white, 15 to 25 minutes.",
        "Put egg carton in a shallow baking pan and arrange glasses in carton, then tilt glasses to a 45-degree angle. Divide gelée among glasses. Carefully transfer pan with glasses to refrigerator and chill until gelée is set, at least 1 hour.",
        "Pulse basil, sugar, and a pinch of salt in a food processor until finely chopped, then transfer to a bowl and add cream, stirring just until sugar is dissolved.",
        "Sprinkle gelatin over water in a small saucepan and let stand 1 minute to soften. Cook over low heat, stirring, until gelatin is dissolved, 1 to 2 minutes. Remove from heat and whisk in 1 tablespoon basil cream at a time until gelatin mixture is cool, then whisk in remaining cream. Pour through a fine-mesh sieve into a metal bowl, pressing hard on solids and then discarding them.",
        "Set bowl in a larger bowl half-filled with ice and cold water and let stand, stirring occasionally, until cream is consistency of raw egg white, 15 to 25 minutes.",
        "Holding 1 glass of gelée at a 45-degree angle, slowly fill glass with basil cream, gradually righting glass as filled. Fill remaining glasses in same manner. Chill, covered, until set, at least 1 hour."
    ],
    "ingredients": [
        "1 3/4 teaspoons unflavored gelatin (from a 1/4-oz envelope)",
        "1/4 cup water",
        "2 cups passion-fruit nectar (preferably Looza brand)",
        "1/2 cup loosely packed fresh basil leaves",
        "1/2 cup sugar",
        "1 1/2 cups well-chilled heavy cream",
        "1 teaspoon unflavored gelatin (from another 1/4-oz envelope)",
        "2 tablespoons water",
        "Special equipment: 1 empty egg carton; 4 (6- to 8-oz) slender clear glasses (not stemmed)",
        "Garnish: 4 fresh basil leaves (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Dairy",
        "Herb",
        "Dessert",
        "Freeze/Chill",
        "Vegetarian",
        "Basil",
        "Summer",
        "Shower",
        "Passion Fruit",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Passion-Fruit Gelée with Basil Cream",
    "url": "http://www.epicurious.com/recipes/food/views/passion-fruit-gelee-with-basil-cream-235038"
}
