{
    "directions": [
        "Preheat oven to 200°F. and oil a baking sheet. On a sheet of parchment paper, using a 3- or 4-inch heart-shaped cutter as a guide, draw 6 hearts. Turn parchment over and put on baking sheet.",
        "In a large bowl with an electric mixer beat whites with cream of tartar and a pinch salt until they just hold soft peaks. Gradually beat in sugar and beat until meringue just holds stiff, glossy peaks.",
        "Transfer meringue to a pastry bag fitted with a 1/2-inch plain tip and pipe evenly onto parchment hearts, filling them in. (Alternatively, divide meringue among parchment hearts, spreading with a small spatula to fill in.)",
        "Bake meringue layers in middle of oven 45 minutes, or until crisp and firm. (If weather is humid, cooking time may be longer.) Cool meringue layers completely on baking sheet in turned-off oven and carefully peel off parchment. Meringue layers may be kept, layered between sheets of parchment paper, in an airtight container in a cool, dry place 1 week.",
        "Halve 3 passion fruits and scoop out pulp (including seeds and juice) into a sieve set over a bowl. Force pulp through sieve, pressing hard on seeds, and discard seeds. In a bowl beat cream until it holds soft peaks and fold in passion-fruit juice and sugar until just combined.",
        "Halve remaining passion fruit and scoop out seeds, reserving them. Halve pomegranate. Bending back rinds, dislodge some seeds from membranes, reserving them, and reserve some juice.",
        "Arrange a meringue heart on each of 2 plates. Top hearts with whipped cream and garnish with some reserved passion-fruit and pomegranate seeds. Top each dessert with 1 more meringue heart. Desserts may be made 2 hours ahead and chilled, loosely covered. Bring desserts to room temperature before serving.",
        "Garnish desserts with more passion-fruit and pomegranate seeds and some reserved juice."
    ],
    "ingredients": [
        "2 large egg whites",
        "1/8 teaspoon cream of tartar",
        "1/2 cup sugar",
        "4 passion fruits",
        "1/3 cup well-chilled heavy cream",
        "1 1/2 teaspoons sugar",
        "1 small pomegranate (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Cocktail Party",
        "Picnic",
        "Valentine's Day",
        "Kid-Friendly",
        "Mother's Day",
        "Wedding",
        "Winter",
        "Passion Fruit",
        "Engagement Party",
        "Potluck",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Passion-Fruit Meringues",
    "url": "http://www.epicurious.com/recipes/food/views/passion-fruit-meringues-100944"
}
