{
    "directions": [
        "Soak morels in warm water in a small bowl 30 minutes. Lift mushrooms out of water, squeezing excess liquid back into bowl. Pour soaking liquid through a sieve lined with a dampened paper towel into a small bowl and reserve. Rinse morels thoroughly to remove grit, then squeeze dry. Discard any tough stems. Halve small morels lengthwise and quarter larger ones.",
        "Cook asparagus and beans in a 6- to 8-quart pot of boiling salted water , uncovered, 3 minutes. Add peas and cook until beans and asparagus are just tender, about 1 to 2 minutes more. Immediately transfer vegetables with a large slotted spoon to a bowl of ice and cold water to stop cooking, reserving hot water in pot for cooking pasta. Drain cooled vegetables in a colander.",
        "Cook 1 teaspoon garlic and a rounded 1/4 teaspoon red pepper flakes in 2 tablespoons oil in a 10- to 12-inch heavy skillet over moderately low heat, stirring, just until garlic is fragrant, about 1 minute. Add drained vegetables and salt and pepper to taste and cook, stirring, 2 minutes, then transfer to a bowl. Reserve skillet.",
        "Cut half of tomatoes into quarters and halve remainder lengthwise, keeping quarters and halves separate. Cook remaining teaspoon garlic and remaining rounded 1/4 teaspoon red pepper flakes in remaining 2 tablespoons oil in skillet over moderately low heat, stirring, just until garlic is fragrant, about 1 minute. Add quartered tomatoes with salt and pepper to taste and simmer, stirring occasionally, until tomatoes are softened, about 3 minutes. Add halved tomatoes, vinegar, and water and simmer, stirring occasionally, until sauce is thickened and halved tomatoes are softened, 3 to 4 minutes. Keep tomatoes warm.",
        "While tomatoes are cooking, return water in pot to a boil and cook spaghettini until al dente.",
        "Drain in a colander. Immediately add butter, cream, zest, and morels to empty pasta pot and simmer gently, uncovered, 2 minutes. Stir in cheese and add pasta, tossing to coat and adding as much of reserved morel soaking liquid as necessary (1/2 to 2/3 cup) to keep pasta well coated. Add green vegetables, parsley, basil, pine nuts, and salt and pepper to taste and toss gently to combine.",
        "Serve pasta topped with tomatoes and Parmigiano-Reggiano shavings."
    ],
    "ingredients": [
        "1 oz dried morel mushrooms",
        "1 1/2 cups warm water",
        "1/2 lb asparagus, trimmed and cut into 1-inch pieces",
        "1/4 lb green beans (preferably haricots verts), trimmed and cut into 1-inch pieces",
        "3/4 cup frozen baby peas, thawed",
        "2 teaspoons minced garlic",
        "Rounded 1/2 teaspoon dried hot red pepper flakes",
        "4 tablespoons extra-virgin olive oil",
        "1 1/2 pints grape tomatoes",
        "1 tablespoon balsamic vinegar",
        "3 tablespoons water",
        "1 lb spaghettini (thin spaghetti)",
        "1/2 stick (1/4 cup) unsalted butter",
        "2/3 cup heavy cream",
        "1 teaspoon finely grated fresh lemon zest",
        "2 oz finely grated Parmigiano-Reggiano (1 cup)",
        "1/4 cup finely chopped fresh flat-leaf parsley",
        "1/4 cup finely chopped fresh basil",
        "1/3 cup pine nuts (1 1/2 oz), lightly toasted",
        "Garnish: Parmigiano-Reggiano shavings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "Tomato",
        "Sauté",
        "Vegetarian",
        "Basil",
        "Pine Nut",
        "Asparagus",
        "Green Bean",
        "Pea",
        "Spring",
        "Parsley",
        "Gourmet"
    ],
    "title": "Pasta Primavera",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-primavera-107981"
}
