{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Bring a large pot of lightly salted water to a boil. Add macaroni and cook for 8 to 10 minutes or until al dente; drain.  Combine pasta, 1 beaten egg, 1/4 cup Parmesan and set aside.",
        "To make the meat sauce: Drop the plum tomatoes in boiling water for about 45 seconds.  Peel the skin off then seed and chop.  Cook ground beef, onion and garlic together in a skillet until meat is brown and onion is tender. Drain off fat. Stir in fresh tomatoes, tomato sauce, chicken stock, vinegar, chili powder, allspice, cinnamon, and salt. Bring to boil; reduce heat and simmer uncovered for 15 to 20 minutes until thick. You don't want the sauce to be watery.",
        "To make the white sauce: Melt margarine in a saucepan and stir in flour and pepper. Add the milk all at once. Cook and stir until smooth, thick and bubbly. In a bowl, combine about half of the mixture with 1 beaten egg. Return the egg mixture into the saucepan with the remaining white sauce. Stir in 1/4 cup parmesan.",
        "In a square glass baking dish, add 1/2 the pasta mixture. Next, add all of the meat sauce. Then, the remainder of the pasta and top with all of the white sauce. Sprinkle lightly with cinnamon, if desired.",
        "Bake in preheated oven for 30 to 35 minutes. Let stand about 5 minutes before serving. The white sauce will firm when cooked."
    ],
    "ingredients": [
        "1 (8 ounce) package elbow macaroni",
        "1 egg, beaten",
        "1/4 cup grated Parmesan cheese",
        "1 pound roma (plum) tomatoes",
        "1 pound lean ground beef",
        "1/4 cup chopped onions",
        "1 clove garlic, minced",
        "1 (8 ounce) can tomato sauce",
        "1/4 cup chicken stock",
        "1 tablespoon red wine vinegar",
        "1 tablespoon chili powder",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon ground cinnamon",
        "3 tablespoons margarine",
        "3 tablespoons all-purpose flour",
        "1/4 teaspoon ground black pepper",
        "1 1/2 cups milk",
        "1 egg, beaten",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pastitsio III",
    "url": "http://allrecipes.com/recipe/23343/pastitsio-iii/"
}
