{
    "directions": [
        "In a food processor, puree onion, carrots, celery, and garlic into a coarse paste. In a large pan over medium heat, coat pan with oil. Add the pureed veggies and season generously with salt. Bring the pan to a medium-high heat and cook until all the water has evaporated and they become nice and brown, stirring frequently, about 15 to 20 minutes. Be patient, this is where the big flavors develop.",
        "Add the ground beef and season again generously with salt. BROWN THE BEEF! Brown food tastes good. Don't rush this step. Cook another 15 to 20 minutes.",
        "Add the tomato paste and cook until brown about 4 to 5 minutes. Add the red wine. Cook until the wine has reduced by half, another 4 to 5 minutes.",
        "Add water to the pan until the water is about 1 inch above the meat. Toss in the bay leaves and the bundle of thyme and stir to combine everything. Bring to a boil and reduce to a simmer, stirring occasionally. As the water evaporates you will gradually need to add more, about 2 to 3 cups at a time. Don't be shy about adding water during the cooking process, you can always cook it out. This is a game of reduce and add more water. This is where big rich flavors develop. If you try to add all the water in the beginning you will have boiled meat sauce rather than a rich, thick meaty sauce. Stir and TASTE frequently. Season with salt, if needed (you probably will). Simmer for 3 1/2 to 4 hours.",
        "During the last 30 minutes of cooking, bring a large pot of water to a boil over high heat to cook the spaghetti. Pasta water should ALWAYS be well salted. Salty as the ocean! TASTE IT! If your pasta water is under seasoned it doesn't matter how good your sauce is, your complete dish will always taste under seasoned. When the water is at a rolling boil add the spaghetti and cook for 1 minute less than it calls for on the package. Reserve 1/2 cup of the pasta cooking water.",
        "While the pasta is cooking remove 1/2 of the ragu from the pot and reserve.",
        "Drain the pasta and add to the pot with the remaining ragu. Stir or toss the pasta to coat with the sauce. Add some of the reserved sauce, if needed, to make it about an even ratio between pasta and sauce. Add the reserved pasta cooking water and cook the pasta and sauce together over a medium heat until the water has reduced. Turn off the heat and give a big sprinkle of Parmigiano and a generous drizzle of the high quality finishing olive oil. Toss or stir vigorously. Divide the pasta and sauce into serving bowls or 1 big pasta bowl. Top with remaining grated Parmigiano. Serve immediately."
    ],
    "ingredients": [
        "1 large onion or 2 small, cut into 1-inch dice",
        "2 large carrots, cut into 1/2-inch dice",
        "3 ribs celery, cut into 1-inch dice",
        "4 cloves garlic",
        "Extra-virgin olive oil, for the pan",
        "Kosher salt",
        "3 pounds ground chuck, brisket or round or combination",
        "2 cups tomato paste",
        "3 cups hearty red wine",
        "Water",
        "3 bay leaves",
        "1 bunch thyme, tied in a bundle",
        "1 pound spaghetti",
        "1/2 cup grated Parmigiano-Reggiano",
        "High quality extra-virgin olive oil, for finishing"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Pasta Recipes",
        "Bolognese",
        "Tomato",
        "Vegetable",
        "Meat",
        "Spaghetti",
        "Main Dish Recipes",
        "Pureeing Recipes",
        "Sauteing Recipes"
    ],
    "title": "Pasta Bolognese",
    "url": "http://www.foodnetwork.com/recipes/anne-burrell/pasta-bolognese-recipe"
}
