{
    "directions": [
        "In a kettle combine the beans with enough cold water to cover them by 2-inches and simmer them, covered, for 1 to 1 1/2 hours, or until they are tender. Drain the beans in a colander set over a bowl and reserve the cooking liquid. In a large deep skillet cook the onion, the garlic, the sage, the rosemary, the thyme, the red pepper flakes, and salt and pepper to taste in the oil over moderately low heat, stirring, until the onion is softened, add the escarole in 2 batches, and cook each batch, stirring, for 2 minutes, or until the escarole is wilted. Add the wine and simmer the mixture for 3 minutes. In a blender or food processor purée 1 1/2 cups of the cooked beans with 2 cups of the reserved cooking liquid and add to the skillet with the remaining beans, the tomatoes with the reserved juice, and salt and pepper to taste. Simmer the sauce, uncovered, stirring occasionally, for 10 minutes, or until it is thickened slightly, and stir in the parsley. In a kettle of boiling salted water cook the fusilli until it is al dente, drain it well, and in a large bowl toss it with the sauce and the Parmesan.",
        "In a colander rinse the beans under cold water and discard any discolored ones. In a kettle combine the beans with enough cold water to cover them by 2 inches, bring the water to a boil, and boil the beans for 2 minutes. Remove the kettle from the heat and let the beans soak, covered, for 1 hour."
    ],
    "ingredients": [
        "1 pound dried white beans such as Great Northern, soaked in enough cold water to cover them by 2 inches overnight or quick-soaked (procedure follows) and drained",
        "2 cups finely chopped onion",
        "1 1/2 tablespoons minced garlic",
        "1 teaspoon dried sage, crumbled",
        "3/4 teaspoon dried rosemary, crumbled",
        "1/2 teaspoon dried thyme, crumbled",
        "1/4 teaspoon dried hot red pepper flakes, or to taste",
        "1/4 cup olive oil",
        "12 cups packed coarsely shredded escarole",
        "1/2 cup dry white wine",
        "a 28-ounce can Italian tomatoes, drained, reserving the juice, and chopped",
        "1/2 cup minced fresh parsley leaves (preferably flat-leafed)",
        "1 pound fusilli (corkscrew-shaped pasta)",
        "freshly grated Parmesan to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Onion",
        "Pasta",
        "Tomato",
        "Side",
        "Vegetarian",
        "Escarole",
        "Gourmet"
    ],
    "title": "Pasta with White Beans, Tomatoes, and Escarole",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-white-beans-tomatoes-and-escarole-11492"
}
