{
    "directions": [
        "Put oven rack in middle position and preheat oven to 425°F. Butter a 13- by 9-inch or other 3-quart glass or ceramic baking dish.",
        "Soak porcini in boiling-hot water in a bowl until softened, about 20 minutes.",
        "Spread out crumbs in a shallow baking pan and bake, stirring occasionally, until golden, about 6 minutes. Cool completely in pan on a rack, then toss with garlic, parsley, olive oil, pepper, and 1/2 cup cheese.",
        "Drain porcini in a paper-towel-lined sieve set over a bowl and reserve soaking liquid, then rinse porcini to remove any grit. Pat dry and finely chop.",
        "Heat butter and extra-virgin olive oil in a 12-inch heavy skillet over moderately high heat until foam subsides, then sauté onion and garlic, stirring, until onion is golden, about 8 minutes. Add cremini mushrooms, oregano, salt, and pepper and sauté, stirring occasionally, until liquid mushrooms give off is evaporated and mushrooms are browned, about 10 minutes.",
        "Stir in chopped porcini, reserved soaking liquid, and broth and simmer 1 minute.",
        "Meanwhile, cook pasta in a 6- to 8-quart pot of boiling salted water, uncovered, until al dente. Drain in a colander, then transfer to baking dish and stir in mushroom mixture and remaining 1/2 cup cheese.",
        "Sprinkle bread topping evenly over pasta and bake, uncovered, until crumbs are golden, 15 to 20 minutes."
    ],
    "ingredients": [
        "1/4 ounce dried porcini mushrooms (about 1/2 cup)",
        "1/2 cup boiling-hot water",
        "2 3/4 cups coarse fresh bread crumbs (from an Italian or French loaf)",
        "2 garlic cloves, finely chopped",
        "1/3 cup finely chopped fresh flat-leaf parsley",
        "3 tablespoons olive oil",
        "1/4 teaspoon black pepper",
        "2 ounces finely grated Parmigiano-Reggiano (1 cup)",
        "2 tablespoons unsalted butter",
        "2 tablespoons extra-virgin olive oil",
        "1 medium onion, finely chopped",
        "2 garlic cloves, finely chopped",
        "1 1/4 pounds fresh cremini mushrooms, trimmed and quartered",
        "1 teaspoon dried oregano, crumbled",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 cup reduced-sodium chicken or vegetable broth",
        "1/2 pound campanelle or gemelli pasta"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Mushroom",
        "Pasta",
        "Bake",
        "Sauté",
        "Vegetarian",
        "Parmesan",
        "Fall",
        "Winter",
        "Gourmet"
    ],
    "title": "Pasta and Mushrooms with Parmesan Crumb Topping",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-and-mushrooms-with-parmesan-crumb-topping-236981"
}
