{
    "directions": [
        "Bring a large pot of salted water to a boil. Hull the tomatoes and cut a shallow \"x\" through the skin on the bottom of each. Prepare an ice bath.",
        "Put the tomatoes in the boiling water and boil for 30 seconds. Remove with a slotted spoon and submerge in the ice bath. Reserve the pot of boiling water. When the tomatoes are cool, use the back of a paring knife to peel the tomatoes. Cut the tomatoes in half lengthwise and squeeze out and discard the seeds, then chop the tomatoes into approximately 1/2-inch pieces.",
        "Put the bacon in a large cold skillet and cook over medium heat, stirring occasionally, until crisp, about 10 minutes. Using a slotted spoon, transfer the bacon to a paper towel-lined plate. Discard all but about 2 tablespoons of the bacon fat from the skillet.",
        "Add the onion to the drippings in the skillet and cook over medium heat, stirring occasionally, until soft and pale golden, about 10 minutes. Add the wine and boil until reduced by half, about 3 minutes. Add the chopped tomatoes, red pepper flakes, 1/2 teaspoon salt and pepper to taste, and cook, stirring occasionally, until the tomatoes start to break down, about 5 minutes.",
        "Cook the spaghetti according to the package directions in the reserved pot of tomato water until al dente, about 10 minutes. Reserve 1 cup of the cooking water, then drain the pasta. Add the pasta to the skillet with the sauce, along with 1/2 cup of the cooking water and toss to coat. Add more water if necessary for desired consistency. Stir in half the bacon and half the herbs and season with salt and pepper. Divide the pasta and sauce among bowls and top with the remaining bacon and herbs. Serve with Parmesan for topping."
    ],
    "ingredients": [
        "Kosher salt and freshly ground black pepper",
        "2 pounds plum tomatoes (about 10)",
        "6 strips thick-cut bacon, chopped",
        "1 medium onion, halved and thinly sliced",
        "1/2 cup dry white wine",
        "Pinch of crushed red pepper flakes",
        "12 ounces spaghetti",
        "1/4 cup fresh flat-leaf parsley or basil, chopped",
        "Grated Parmesan, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pasta Recipes",
        "Tomato",
        "Vegetable",
        "Bacon Recipes",
        "Meat",
        "Spaghetti",
        "Main Dish Recipes"
    ],
    "title": "Pasta with Bacon and Tomatoes",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/pasta-with-bacon-and-tomatoes"
}
