{
    "directions": [
        "Cut zucchini and tomatoes into 1/2-inch pieces and keep vegetables separate. Chop onion and mince garlic.",
        "In a heavy kettle heat oil over moderately high heat until hot but not smoking and sauté uncooked pasta, turning occasionally, until golden, about 2 minutes. With a slotted spoon transfer pasta to a bowl. In oil remaining in kettle sauté zucchini with salt to taste, stirring occasionally, until browned, about 3 minutes, and transfer to another bowl. Squeeze sausage from casings into kettle and add onion and garlic. Sauté mixture, stirring and breaking up sausage, until browned, about 5 minutes. Add tomatoes, water, and wine and bring to a boil. Add pasta and clams and boil, uncovered, stirring occasionally, 8 minutes, or until clams are opened and pasta is al dente. (Discard any unopened clams.) Stir in zucchini and parsley and cook until heated through."
    ],
    "ingredients": [
        "1 medium zucchini",
        "4 plum tomatoes",
        "1 medium onion",
        "2 garlic cloves",
        "2 tablespoons olive oil",
        "6 ounces fideos (Spanish dried coiled vermicelli noodles), or 6 ounces thin spaghetti broken into 2-inch pieces",
        "1/4 pound hot Italian sausage links",
        "1 1/4 cups water",
        "3/4 cup dry white wine",
        "12 small hard-shelled clams such as littlenecks (less than 2 inches in diameter)",
        "1 tablespoon chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Pork",
        "Shellfish",
        "Tomato",
        "Vegetable",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Sausage",
        "Seafood",
        "Clam",
        "Zucchini",
        "Fall",
        "Summer",
        "Boil",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pasta Paella with Clams and Spicy Sausage",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-paella-with-clams-and-spicy-sausage-100751"
}
