{
    "directions": [
        "Bring 1 cup water and mushrooms to boil in small saucepan. Remove from heat. Let stand 15 minutes. Strain soaking liquid through paper-towel-lined sieve into bowl. Coarsely chop mushrooms. Set liquid and mushrooms aside.",
        "Heat oil in heavy large skillet over medium-high heat. Add onion, carrot, 1/4 cup parsley and garlic. Sauté until vegetables are tender but not brown, about 5 minutes. Push vegetables to side of skillet. Add sausage and cook until brown, breaking up with back of fork, about 4 minutes. Add veal and sauté until brown, about 5 minutes. Add wine. Increase heat to high and boil until wine is almost evaporated, about 5 minutes. Add 1 cup chicken broth; boil 10 minutes, stirring occasionally. Add reserved mushroom liquid. Simmer until liquid is almost absorbed, about 5 minutes. Transfer mixture to processor. Using about 4 on/off turns, process just until coarsely chopped. Return mixture to skillet. Mix in tomatoes with juices, bay leaves, sage, fennel seeds and porcini mushrooms. Reduce heat to low. Simmer uncovered until sauce thickens, breaking up tomatoes with fork, adding remaining chicken broth 1/2 cup at a time and stirring occasionally, about 1 hour. Season with salt and pepper. (Ragù can be made 2 days ahead. Cool slightly. Chill uncovered until cold, then cover and keep chilled.)",
        "Cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain. Add sauce to pasta pot and rewarm over medium heat. Add pasta and toss to combine. Transfer to bowl. Sprinkle with cheese and remaining 2 tablespoons parsley.",
        "*Dried porcini mushrooms are available at Italian markets, specialty foods stores and many supermarkets."
    ],
    "ingredients": [
        "1 cup water",
        "1 ounce dried porcini mushrooms*",
        "1/4 cup extra-virgin olive oil",
        "1 small onion, finely chopped",
        "1 small carrot, peeled, finely chopped",
        "1/4 cup plus 2 tablespoons finely chopped fresh Italian parsley",
        "2 garlic cloves, finely chopped",
        "8 ounces sweet Italian sausages, casings removed",
        "8 ounces veal stew meat, coarsely chopped",
        "1/2 cup dry red wine",
        "2 14-ounce cans low-salt chicken broth",
        "1 28-ounce can whole tomatoes in juice",
        "2 bay leaves",
        "2 teaspoons chopped fresh sage",
        "1 teaspoon fennel seeds, lightly crushed",
        "1 pound fresh pappardelle or purchased fettuccine",
        "Freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Pasta",
        "Pork",
        "Tomato",
        "Sauté",
        "Dinner",
        "Red Wine",
        "Parsley"
    ],
    "title": "Pasta with Veal, Sausage and Porcini Ragù",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-veal-sausage-and-porcini-ragu-103450"
}
