{
    "directions": [
        "Melt butter in a large skillet over medium. Cook, swirling pan occasionally, until butter turns caramel-brown and smells nutty, 2–3 minutes. Add sage leaves and fry until crispy, 10–15 seconds. Remove from heat. Using a slotted spoon, transfer sage to paper towels to drain. Pour all but 2 Tbsp. brown butter into a small bowl.",
        "Cook panko and 4 sage leaves in same skillet, stirring to break up sage, until mixture is toasty, about 2 minutes. Transfer to a plate.",
        "Cook squash and 3 Tbsp. brown butter in same skillet over medium heat, stirring frequently, until squash begins to brown, about 5 minutes. Add 1/2 tsp. salt, 1/8 tsp. pepper, and 3/4 cup water; cover pan and cook until squash begins to soften, about 5 minutes. Remove lid and continue cooking, stirring occasionally, until liquid has evaporated and squash is tender and caramelized, about 5 minutes more.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente, 8–10 minutes. Drain, reserving 3/4 cup pasta cooking liquid.",
        "Add remaining 3 Tbsp. brown butter to skillet and stir until squash is evenly coated. Add 1/2 cup pasta cooking liquid and simmer until a thin sauce forms, about 1 minute; season with 1 tsp. pepper. Add pasta, tossing to coat and adding pasta cooking water as needed to coat pasta. Remove from heat, top with half of the reserved sage, and stir to combine.",
        "Transfer pasta to a large serving bowl or individual pasta bowls. Top with panko mixture, remaining sage, and a generous shaving of Parmesan."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter",
        "14 large sage leaves",
        "1/2 cup panko (Japanese breadcrumbs) or plain coarse breadcrumbs",
        "2 medium delicata squash (about 1 3/4 pounds total), halved lengthwise, seeded, sliced crosswise into 1/4\"-thick half-moons.",
        "Kosher salt",
        "Freshly ground black pepper",
        "12 ounces thick spaghetti or bucatini",
        "Thinly shaved Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Squash",
        "Butter",
        "Sage",
        "Kid-Friendly",
        "Dinner",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Kosher"
    ],
    "title": "Pasta With Delicata Squash and Sage-Brown Butter",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-delicata-squash-and-sage-brown-butter"
}
