{
    "directions": [
        "In a medium saucepan, scald the milk over medium-high heat (bubbles start to form around the edge of the pan, but the milk is not boiling). While the milk is heating, in a small bowl, stir together the sugar, flour, and salt. (Mixing the flour with the sugar will prevent the flour from clumping when you add it to the egg yolks.) In a medium bowl, whisk the egg yolks until blended, then slowly whisk in the flour mixture. The mixture will be thick and pasty.",
        "Remove the milk from the heat and slowly add it to the egg-flour mixture, a little at a time, whisking constantly. When all of the milk has been incorporated, return the contents of the bowl to the saucepan and place over medium heat. Whisk continuously and vigorously for about 3 minutes, or until the mixture thickens and comes to a boil. At first, the mixture will be very frothy and liquid; as it cooks longer, it will slowly start to thicken until the frothy bubbles disappear and it becomes more viscous. Once it thickens, stop whisking every few seconds to see if the mixture has come to a boil. If it has not, keep whisking vigorously. As soon as you see it bubbling, immediately go back to whisking for just 10 seconds, and then remove the pan from the heat. Boiling the mixture will thicken it and cook out the flour taste, but if you let it boil for longer than 10 seconds, the mixture can become grainy.",
        "Pour the mixture through a fine-mesh sieve into a small heatproof bowl. Stir in the vanilla, then cover with plastic wrap, placing it directly on the surface of the cream. This will prevent a skin from forming. Refrigerate for at least 4 hours, or until cold, or up to 3 days."
    ],
    "ingredients": [
        "1 1/4 cups (300 grams) milk",
        "1/2 cup (100 grams) sugar",
        "1/4 cup (30 grams) cake flour",
        "1/2 teaspoon kosher salt",
        "4 egg yolks",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy"
    ],
    "title": "Pastry Cream",
    "url": "http://www.epicurious.com/recipes/food/views/pastry-cream-364369"
}
