{
    "directions": [
        "Cook pasta until tender but still firm to bite. Drain. Rinse under cold water; drain well. Drizzle with oil; toss. Set aside.",
        "Melt 8 tablespoons butter in large pot over medium heat. Whisk in flour. Stir constantly for 3 minutes (do not brown). Gradually whisk in milk. Bring to boil, whisking. Reduce heat to medium-low. Simmer until sauce is thick and smooth, whisking often, about 5 minutes. Add nutmeg. Season with salt and pepper. Cool 30 minutes, whisking occasionally. Whisk in truffle powder. Add pasta; toss to coat. Divide among eight 1-cup ramekins or custard cups. Do ahead Can be made 1 day ahead. Cover; chill.",
        "Preheat oven to 350°F. Melt 2 tablespoons butter in medium skillet over medium heat. Add panko; toss until golden, about 5 minutes. Transfer ramekins to rimmed baking sheet. Sprinkle with panko. Bake until bubbling at edges and golden brown on top, about 15 minutes. (If chilled, bake 15 minutes covered with foil. Uncover, sprinkle with panko, and bake uncovered 15 minutes.)"
    ],
    "ingredients": [
        "1 pound fresh linguine",
        "2 tablespoons olive oil",
        "10 tablespoons (1 1/4 sticks) butter, divided",
        "1/2 cup all purpose flour",
        "4 cups warm milk",
        "Dash of ground nutmeg",
        "1 teaspoon white truffle powder* or truffle flour,* or truffle oil to taste",
        "*Available at specialty foods stores and Italian markets, and online from buonitalia.com.",
        "**Available in the Asian foods section of some supermarkets and at Asian markets.",
        "1/2 cup panko (Japanese breadcrumbs)**",
        "*Available at specialty foods stores and Italian markets, and online from buonitalia.com.",
        "**Available in the Asian foods section of some supermarkets and at Asian markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Pasta",
        "Side",
        "Bake",
        "Vegetarian",
        "Casserole/Gratin",
        "Noodle"
    ],
    "title": "Pasta and White Truffle Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-and-white-truffle-gratin-236787"
}
