{
    "directions": [
        "Light a grill and preheat for at least 10 minutes or preheat a grill pan. Arrange the grill so half cooks over high heat and the other half can cook over moderately low heat. Meanwhile, soak 1 small bamboo skewer for 10 minutes.",
        "Prick the sausage links in a few places with a fork. Brush the peppers and eggplant slices all over with olive oil and season with salt and pepper.",
        "Oil the grill grates, then grill the sausage over moderate heat, turning frequently, until browned and cooked through, about 15 minutes. Transfer to a cutting board and let cool slightly.",
        "Meanwhile, grill the peppers over high heat, turning occasionally, until blackened all over, 10 to 15 minutes. Transfer to a bowl, cover with plastic wrap and let cool slightly.",
        "Grill the eggplant over high heat until dark brown grill marks form, about 4 minutes. Flip and grilled until charred and the eggplant is tender, 3 to 4 minutes longer. Transfer to the cutting board.",
        "Slice the sausages about 1/3 inch thick and transfer to a large serving bowl. Dice the eggplant and add it to the sausage. Peel the peppers, then discard the stems and seeds; slice into bite-sized strips and add it to the sausage and peppers.",
        "Meanwhile, in a large pot of boiling salted water, cook the pasta until al dente. Reserve 1/2 cup of the cooking water and drain. Add the pasta and the 2 tablespoons olive oil to the bowl and toss. Add the 1 ounce of cheese and toss again, adding pasta water, little by little, if you need to loosen the pasta sauce. Season with salt and pepper, add the basil and transfer to bowls. Serve the pasta, passing more cheese at the table."
    ],
    "ingredients": [
        "1 pound sweet or hot Italian sausage links",
        "1/2 pound sweet red peppers, such as frying peppers, cubanelles or bell peppers",
        "1 medium Italian eggplant (about 8 ounces), sliced lengthwise 1/2- inch thick",
        "2 tablespoons extra-virgin olive oil, plus more, for brushing",
        "Kosher salt",
        "Freshly ground black pepper",
        "8 ounces farfalle, cassarecce or other short pasta",
        "1 ounce freshly grated Parmigiano-Reggiano cheese (about 1/3 cup), plus more for serving",
        "1/4 cup basil leaves, torn"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Sausage",
        "Eggplant",
        "Bell Pepper",
        "Summer",
        "Grill",
        "Grill/Barbecue"
    ],
    "title": "Pasta with Grilled Sausage, Peppers and Eggplant",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-grilled-sausage-peppers-and-eggplant-51241410"
}
