{
    "directions": [
        "Cook the fusilli and bow ties separately in a large pot of boiling salted water for 10 to 12 minutes until each pasta is al dente. Drain and toss into a bowl with the olive oil. Cool to room temperature.",
        "In the bowl of a food processor fitted with a steel blade, puree the pesto, spinach, and lemon juice. Add the mayonnaise and puree. Add the pesto mixture to the cooled pasta and then add the Parmesan, peas, pignoli, salt, and pepper. Mix well, season to taste, and serve at room temperature.",
        "Place the walnuts, pignoli, and garlic in the bowl of a food processor fitted with a steel blade. Process for 15 seconds. Add the basil leaves, salt, and pepper. With the processor running, slowly pour the olive oil into the bowl through the feed tube and process until the pesto is thoroughly pureed. Add the Parmesan and puree for a minute. Use right away or store the pesto in the refrigerator or freezer with a thin film of olive oil on top.",
        "Notes: Air is the enemy of pesto. For freezing, pack it in containers with a film of oil or plastic wrap directly on top with the air pressed out.",
        "To clean basil, remove the leaves, swirl them in a bowl of water, and then spin them very dry in a salad spinner. Store them in a closed plastic bag with a slightly damp paper towel. As long as the leaves are dry they will stay green for several days."
    ],
    "ingredients": [
        "3/4 pound fusilli pasta",
        "3/4 pound bow tie pasta",
        "1/4 cup good olive oil",
        "1 1/2 cups pesto (packaged or see recipe below)",
        "1 (10-ounce) package frozen chopped spinach, defrosted and squeezed dry",
        "3 tablespoons freshly squeezed lemon juice",
        "1 1/4 cups good mayonnaise",
        "1/2 cup freshly grated Parmesan",
        "1 1/2 cups frozen peas, defrosted",
        "1/3 cup pignoli (pine nuts)",
        "3/4 teaspoon kosher salt",
        "3/4 teaspoon freshly ground black pepper",
        "1/4 cup walnuts",
        "1/4 cup pignoli (pine nuts)",
        "3 tablespoons chopped garlic (9 cloves)",
        "5 cups fresh basil leaves, packed",
        "1 teaspoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 1/2 cups good olive oil",
        "1 cup freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Food Processor",
        "Italian",
        "European Recipes",
        "Pasta Recipes",
        "Beans and Legumes",
        "Pea Recipes",
        "Vegetable",
        "Spinach",
        "Main Dish Recipes"
    ],
    "title": "Pasta, Pesto, and Peas",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/pasta-pesto-and-peas-recipe2"
}
