{
    "directions": [
        "Cut backbones, wing tips, and second joints of wings from chickens, then cut each chicken into quarters. Put backbones, wing tips, second joints, and giblets (except livers) in a 6- to 8-quart pot with water, celery, carrot, onion, garlic, thyme, salt, and peppercorns and bring to a boil. Add chicken quarters and return liquid to a boil, skimming off any foam, then reduce heat and simmer, uncovered, 10 minutes. Remove from heat and let stand, covered, 40 minutes.",
        "Transfer chicken quarters with tongs to a shallow baking pan. When chicken is cool enough to handle, remove meat from skin and bones, transferring meat to a cutting board and returning skin and bones to pot. Cut chicken into 1-inch pieces and reserve in a large bowl. Boil stock 40 minutes, then pour through a fine-mesh sieve into a large bowl, discarding solids. Let stand 5 minutes, then skim off fat and set aside 4 cups stock for making sauce. (Reserve remaining stock for another use.)",
        "Put oven rack in middle position and preheat oven to 425°F. Butter gratin dishes.",
        "Heat butter (1 stick) in a 4-quart heavy pot over moderate heat until foam subsides, then add garlic and cook, whisking, 1 minute. Add flour and cook, whisking, 1 minute. Add milk and reserved stock (4 cups) in a slow stream, whisking, then bring to a boil, whisking. Reduce heat and simmer, whisking occasionally, until sauce is slightly thickened, about 10 minutes. Remove from heat and stir in crème fraîche, salt, pepper, cayenne, 2 cups Gruyère, and 1/2 cup Parmigiano-Reggiano.",
        "While sauce simmers, cook pasta in a 6- to 8-quart pot of boiling salted water , uncovered, until not quite al dente, 8 to 10 minutes (pasta should still be firm), then drain in a colander. Return pasta to pot, then add chicken and sauce, tossing to coat. Divide pasta mixture between gratin dishes.",
        "Toss bread crumbs with remaining 4 cups Gruyère and 3/4 cup Parmigiano-Reggiano, then sprinkle evenly over pasta mixture. Bake gratins until crumbs are golden brown and sauce is bubbling, 20 to 30 minutes. Let stand 10 minutes before serving."
    ],
    "ingredients": [
        "2 (3 1/2- to 4-lb) chickens",
        "10 cups cold water",
        "1 celery rib, quartered",
        "1 carrot, quartered",
        "1 medium onion, quartered",
        "1 large garlic clove, smashed",
        "2 fresh thyme sprigs",
        "1 teaspoon salt",
        "1/4 teaspoon whole black peppercorns",
        "1 stick (1/2 cup) unsalted butter plus additional for greasing gratin dishes",
        "1 garlic clove, minced",
        "1/2 cup all-purpose flour",
        "3 cups whole milk",
        "1 cup crème fraîche (8 oz)",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/4 teaspoon cayenne",
        "1 lb Gruyère, coarsely grated (6 cups)",
        "1 oz Parmigiano-Reggiano, finely grated with a rasp (1 1/4 cups)",
        "1 lb penne rigate or other short tubular pasta",
        "6 cups fine fresh bread crumbs (from 14 slices firm white sandwich bread)",
        "Special equipment: 2 (2 1/2- to 3-qt) shallow gratin dishes (13 by 9 inches)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Chicken",
        "Pasta",
        "Bake",
        "Poach",
        "Parmesan",
        "Gourmet"
    ],
    "title": "Pasta and Chicken Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-and-chicken-gratin-233254"
}
