{
    "directions": [
        "In a large skillet over medium heat, cook ground beef and onion, until meat is brown.  Stir in 3/4 teaspoon salt, a pinch of pepper, tomato sauce and cinnamon and cook 1 to 2 minutes more.  Set aside.",
        "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.  Set aside.",
        "In a medium saucepan, melt 1/4 cup butter over medium heat.  Dump in flour, all at once, and stir until a smooth roux is formed.  Pour in 2 1/2 cups milk, a little at a time, stirring until smooth.  Stir in 1/4 teaspoon salt, pepper and 1/4 cup Parmesan; bring to a boil, and stir until thickened.  Remove from heat.",
        "In a small bowl, beat together eggs and 1 cup milk.  Set aside.",
        "Preheat oven to 375  degrees F (190 degrees C).  Grease a 9x13 inch baking dish.  Place half the cooked macaroni in the baking dish and top with all of the beef mixture.  Sprinkle the remaining 1/2 cup grated Parmesan over the meat.  Place the remaining macaroni over the cheese.  Pour the egg mixture over the macaroni.  Cover all with the white sauce.",
        "In a medium bowl, stir together bread cubes and melted butter, until bread is well coated.  Place bread cubes evenly over macaroni.",
        "Bake 50 to 60 minutes, or until topping is golden brown."
    ],
    "ingredients": [
        "1 pound lean ground beef",
        "1 onion, chopped",
        "3/4 teaspoon salt",
        "1 pinch ground black pepper",
        "4 ounces tomato sauce",
        "1/4 teaspoon ground cinnamon",
        "3 1/2 cups macaroni",
        "1/4 cup butter",
        "5 tablespoons all-purpose flour",
        "3 1/2 cups milk",
        "3/4 cup grated Parmesan cheese",
        "1/4 teaspoon salt",
        "3 eggs",
        "6 thick slices white bread, toasted and cut into cubes",
        "1/4 cup melted butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pastitsio I",
    "url": "http://allrecipes.com/recipe/19755/pastitsio-i/"
}
