{
    "directions": [
        "Chop tomatoes. Bring large pot of water to boil. Add lobsters; boil 2 minutes. Using tongs, transfer lobsters to cutting board. Cut off claws and crack open. Remove meat from claws and cut meat into bite-size pieces. Cut off lobster tails. Cut tails crosswise into 4 pieces each. Cut each lobster body lengthwise in half. Remove coral (bright orange part) and tomalley (greenish part); finely chop.",
        "Heat oil in Dutch oven over medium heat. Add lobster body pieces (not tails or claw meat), onion and garlic; Sauté until onion is soft, about 10 minutes. Add lobster tail pieces, claw meat, coral, tomalley, tomatoes and reserved juices, vinegar, herbs and cayenne; bring to boil. Reduce heat; simmer until lobster is cooked through, about 8 minutes.",
        "Using slotted spoon, remove lobster tail pieces and claw meat and reserve. Add cream to sauce. Simmer 20 minutes. Using tongs, remove lobster body pieces and discard. Season sauce with salt and pepper.",
        "Meanwhile, cook pasta in pot of boiling salted water until just tender but still firm to bite.",
        "Drain pasta and return to pot. Add lobster and sauce and toss to coat. Divide among plates."
    ],
    "ingredients": [
        "1 28-ounce can Italian-style tomatoes, drained, juices reserved",
        "2 live lobsters (about 1 1/4 pounds each)",
        "3 tablespoons extra-virgin olive oil",
        "1 medium onion, minced",
        "2 garlic cloves, minced",
        "1 tablespoon red wine vinegar",
        "2 tablespoons minced fresh basil",
        "1 1/2 teaspoons minced fresh mint",
        "3/4 teaspoon minced fresh oregano",
        "3/4 teaspoon minced fresh thyme",
        "3/4 teaspoon minced fresh rosemary",
        "1/4 teaspoon cayenne pepper",
        "1/3 cup whipping cream",
        "1 pound pasta (such as penne or fettuccine)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Pasta",
        "Shellfish",
        "Tomato",
        "Lobster"
    ],
    "title": "Pasta with Lobster, Tomatoes and \"Herbes de Maquis\"",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-lobster-tomatoes-and-herbes-de-maquis-341"
}
