{
    "directions": [
        "Simmer lentils in water (2 cups) with 1/4 teaspoon salt in a 1- to 1 1/2-quart saucepan, uncovered, adding more water if necessary to keep lentils barely covered, until tender but not falling apart, 20 to 25 minutes. Remove from heat and season with salt.",
        "While lentils simmer, heat 1/4 cup oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté onion with pepper and remaining 1/2 teaspoon salt, stirring, 1 minute. Reduce heat to low and cook, covered, stirring occasionally, until onions are soft and golden (stir more frequently toward end of cooking), about 20 minutes. Remove lid and increase heat to moderate, then cook, stirring frequently, until onion is golden brown, 5 to 10 minutes more.",
        "While onion cooks, cut out and discard stems and center ribs from kale. Cook kale in a 6- to 8-quart pot of boiling salted water , uncovered, stirring occasionally, until just tender, 5 to 8 minutes. Transfer kale with tongs to a colander to drain, pressing lightly. Keep pot of water at a boil, covered.",
        "Coarsely chop kale and add to onion along with lentils (including lentil-cooking liquid), then simmer, stirring, 1 minute. Season with salt and pepper.",
        "Add pasta to kale-cooking liquid and boil, uncovered, until al dente. Reserve about 1 cup pasta-cooking liquid, then drain pasta in a colander. Add pasta to lentil mixture along with about 1/3 cup of pasta-cooking liquid (or enough to keep pasta moist) and cook over high heat, tossing, 1 minute. Season with salt and pepper and drizzle with remaining 2 tablespoons oil."
    ],
    "ingredients": [
        "1/2 cup French (small) green lentils",
        "2 cups water",
        "3/4 teaspoon salt",
        "6 tablespoons extra-virgin olive oil",
        "1 large onion, finely chopped (2 cups)",
        "1/4 teaspoon black pepper",
        "3/4 pound kale (preferably Tuscan; sometimes labeled \"lacinato\")",
        "3/4 pound dried short pasta",
        "Accompaniments: toasted bread-crumb topping and/or grated Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Onion",
        "Pasta",
        "Sauté",
        "Vegetarian",
        "Healthy",
        "Gourmet"
    ],
    "title": "Pasta with Lentils and Kale",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-lentils-and-kale-238092"
}
