{
    "directions": [
        "Bring beans, Parmesan rind, carrots, celery, head of garlic, parsley, rosemary, bay leaves, chiles, and 2 quarts water to a boil in a medium pot. Reduce heat, cover, and simmer, adding more water as needed, until beans are tender, about 1 1/2 hours. Season with salt and pepper, remove from heat, and let sit 30 minutes. Discard vegetables, rind, and herbs.",
        "Meanwhile, heat 3 Tbsp. oil in a large pot over medium. Cook onion and chopped garlic, stirring occasionally, until softened, 8–10 minutes. Add tomatoes, crushing with your hands, and cook, stirring often, until liquid is almost completely reduced, 12–15 minutes. Add wine, bring to a boil, and cook until almost completely evaporated, about 5 minutes.",
        "Add beans and their liquid; cook until flavors meld, 12–15 minutes. Add pasta; cook, stirring and adding more water as needed, until al dente, 15–20 minutes. Add escarole and cook until wilted, about 1 minute; season with salt and pepper. Serve soup drizzled with oil and topped with Parmesan and more chile."
    ],
    "ingredients": [
        "1 1/2 cups dried cannellini (white kidney) beans, soaked overnight",
        "1 Parmesan rind (about 2 ounces), plus shaved Parmesan for serving",
        "2 medium carrots, scrubbed, halved crosswise",
        "2 stalks celery, halved crosswise",
        "1 head garlic, halved crosswise; plus 2 cloves, chopped",
        "6 sprigs parsley",
        "1 sprig rosemary",
        "2 bay leaves",
        "2 dried chiles de árbol or 1/2 teaspoon crushed red pepper flakes, plus more crushed for serving",
        "Kosher salt, freshly ground pepper",
        "3 tablespoons olive oil, plus more",
        "1 large onion, chopped",
        "1 (14.5-ounce) can whole peeled tomatoes",
        "3/4 cup dry white wine",
        "3 ounces dried lasagna or other flat pasta, broken into 1–1 1/2-inch pieces",
        "1/2 small head escarole, leaves torn into 2-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Soup/Stew",
        "Vegetarian",
        "Pasta",
        "Bean",
        "Escarole",
        "Parmesan",
        "Tomato",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pasta e Fagioli With Escarole",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-e-fagioli-with-escarole"
}
