{
    "directions": [
        "Heat 2 tablespoons oil in heavy large pot over medium heat. Add sausages; sauté until light brown, 5 minutes. Using slotted spoon, transfer sausages to paper towels. Pour drippings from pot; discard.",
        "Add remaining 2 tablespoons oil to pot and heat over medium heat. Stir in onion and next 9 ingredients. Cover and cook until vegetables are almost tender, stirring often, about 8 minutes. Stir in crushed tomatoes and diced tomatoes with juices and bring to boil. Reduce heat, cover and simmer 15 minutes to blend flavors. Stir in sausages, Worcestershire sauce and hot pepper sauce; simmer uncovered until sauce thickens slightly, about 5 minutes longer. Season to taste with salt and pepper. Discard bay leaves. Meanwhile, cook pasta in large pot of boiling salted water until just tender but still firm to bite. Remove from heat. Add shrimp to pot; cover and let stand just until shrimp are pink on outside and opaque in center, about 2 minutes. Drain pasta and shrimp; return to pot. Add sauce and toss to blend. Transfer to bowl. Serve, passing Parmesan cheese separately."
    ],
    "ingredients": [
        "4 tablespoons olive oil",
        "1 pound andouille sausages or other fully cooked smoked spicy sausages (such as Louisiana hot links), halved lengthwise, then thinly sliced crosswise",
        "1 medium onion, chopped",
        "1 large green bell pepper, chopped",
        "5 green onions, thinly sliced",
        "1 celery stalk, chopped",
        "5 garlic cloves, chopped",
        "2 bay leaves",
        "2 teaspoons dried oregano",
        "3/4 teaspoon ground cumin",
        "1/4 teaspoon cayenne pepper",
        "1/4 teaspoon ground allspice",
        "1 28-ounce can crushed tomatoes with added puree",
        "1 141/2-ounce can diced tomatoes in juice",
        "1 teaspoon Worcestershire sauce",
        "1/2 teaspoon hot pepper sauce",
        "1 pound farfalle (bow-tie) pasta",
        "1 1/2 pounds uncooked large shrimp, peeled, deveined",
        "Freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Pasta",
        "Tomato",
        "Sausage",
        "Shrimp",
        "Winter"
    ],
    "title": "Pasta Jambalaya",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-jambalaya-104329"
}
