{
    "directions": [
        "If using whole tomatoes, in blender or food processor, purée tomatoes with juice. Set aside.",
        "In large, heavy pot over moderate heat, heat oil until hot but not smoking. Add pancetta and sauté until golden brown, 5 to 6 minutes. Add beef, pork, and veal and sauté, breaking up meat with back of spoon, until browned, 7 to 8 minutes. Add onion and carrot and sauté until vegetables are tender, 5 to 6 minutes.",
        "Stir in red wine and simmer, scraping up browned bits stuck to bottom of pan, until liquid is reduced by half, about 5 minutes. Stir in tomatoes, cream, salt, and pepper. Reduce heat to moderately low and simmer, uncovered, stirring occasionally, until sauce is thickened and brick-red in color, approximately 30 minutes.",
        "In large pot of boiling salted water, cook pasta until almost tender. Drain well and toss with sauce. Serve with grated cheese."
    ],
    "ingredients": [
        "2 (28-ounce) cans whole tomatoes with juice or crushed tomatoes",
        "3 tablespoons olive oil",
        "6 ounces pancetta or 6 slices bacon, finely chopped",
        "1/4 pound ground pork (not lean)",
        "1/4 pound ground beef chuck (not lean)",
        "1/4 pound ground veal",
        "1 small onion, finely chopped (about 1 cup)",
        "1 carrot, finely chopped (about 1 cup)",
        "1 cup dry red wine",
        "1 cup heavy cream",
        "1 teaspoon kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 pound small pasta such as orecchiette or rotini",
        "Garnish: Freshly grated Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Pasta",
        "Pork",
        "Tomato",
        "Dinner",
        "Ground Beef",
        "Veal",
        "Bacon",
        "Red Wine",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pasta Bolognese",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-bolognese-352493"
}
