{
    "directions": [
        "Toss eggplant with 1 tablespoon salt in large colander. Place over bowl and let stand 30 minutes.",
        "Heat 3 tablespoons oil in heavy large skillet over medium-high heat. Working in batches, add eggplant; saut\u2029 until golden, about 5 minutes. Transfer to bowl. (Can be made 8 hours ahead. Cover; chill.)",
        "Heat 2 tablespoons oil in heavy large skillet over medium-high heat. Working in batches, cook meatballs until brown, about 5 minutes. Transfer meatballs to paper-towel-lined plate. Wipe out skillet.",
        "Heat 2 tablespoons oil in same skillet over medium-high heat. Add tomatoes, garlic and chilies; sauté until fragrant, about 2 minutes. Add meatballs, broth and cream. Simmer until meatballs are cooked through, about 5 minutes. Add eggplant and simmer 1 minute.",
        "Meanwhile, cook pasta in large pot of boiling salted water until tender but still firm to bite. Drain. Transfer to large bowl.",
        "Toss pasta with sauce and 1 cup Parmesan cheese. Mix in basil and pine nuts. Season to taste with salt and pepper. Serve pasta, passing additional Parmesan cheese separately."
    ],
    "ingredients": [
        "1 large eggplant, cut into 1-inch pieces",
        "1 tablespoon salt",
        "7 tablespoons olive oil",
        "1 3/4 pounds spicy Italian sausages, casings removed, meat shaped into 1 1/4-inch meatballs (about 46)",
        "1 pound cherry tomatoes, halved",
        "6 garlic cloves, finely chopped",
        "1 1/2 serrano chilies, seeded, finely chopped (about 1 tablespoon)",
        "1 1/4 cups canned low-salt chicken broth",
        "2/3 cup whipping cream",
        "1 pound cavatapi or penne pasta",
        "1 cup freshly grated Parmesan cheese",
        "1 cup (lightly packed) fresh basil leaves, torn into 1/2-inch pieces",
        "2/3 cup pine nuts, toasted",
        "Additional grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Herb",
        "Pasta",
        "Pork",
        "Sauté",
        "Basil",
        "Sausage",
        "Eggplant",
        "Spring",
        "Family Reunion",
        "Potluck"
    ],
    "title": "Pasta with Sausage, Eggplant and Basil",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-sausage-eggplant-and-basil-103130"
}
