{
    "directions": [
        "1. In a large pot over medium heat, warm the olive oil. Add the onion, carrot, celery, and garlic and cook slowly until the vegetables soften and turn golden, about 20 minutes.",
        "2. Increase heat to medium-high and add the tomato paste. Cook until the mixture dries out a bit, about 3 minutes. Pour in the reserved juice from the tomatoes and cook, scraping the browned bits from the bottom of the pan, until the liquid has reduced by half, 1 to 2 minutes.",
        "3. Stir in the lentils, tomatoes, and 1 cup water. Bring to a boil, then reduce heat. Season with the salt and pepper and simmer until the lentils are tender, 30 minutes to 1 hour, depending on the lentils. (If the sauce begins to dry out, add additional water as needed.) Reduce heat to low and keep warm.",
        "4. Cook the pasta according to the package directions; drain. Serve with the lentil sauce, sprinkle with the pecorino, and garnish with the basil, if desired."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "1/2 small onion, chopped",
        "1 small carrot, chopped",
        "1 stalk celery, chopped",
        "4 garlic cloves, minced",
        "1 1/2 teaspoons tomato paste",
        "2 (16-ounce) cans whole peeled plum tomatoes, drained and roughly chopped (juice reserved)",
        "1 1/4 cups dried French green lentils",
        "Coarse sea or kosher salt and freshly ground black pepper to taste",
        "1 pound shaped pasta, such as cavatappi, rigatoni, or ziti",
        "Pecorino cheese, grated or shaved",
        "Fresh basil, chopped (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Cheese",
        "Pasta",
        "Tomato",
        "Vegetable",
        "Vegetarian",
        "Kid-Friendly",
        "Lentil",
        "Cookie"
    ],
    "title": "Pasta with Lentil Bolognese",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-lentil-bolognese-239172"
}
