{
    "directions": [
        "In a heavy skillet heat the oil over moderately high heat until it is hot but not smoking, in it sauté the shrimp, the garlic, and the pepper flakes, stirring, for 1 to 2 minutes, or until the shrimp are pink and almost cooked through, and transfer the shrimp with a slotted spoon to a bowl. To the skillet add the onion, the tomatoes, and salt and pepper to taste and cook the mixture over moderate heat, stirring, until the vegetables are softened. Add the wine and boil the mixture until the wine is reduced by half. Add the broth, boil the mixture until the liquid is reduced by half, and stir in the cream. Simmer the sauce until it is thickened slightly, stir in the arugula and the shrimp, and simmer the sauce for 1 minutes, or until the shrimp are cooked through. Stir in the parsley and salt and pepper to taste and keep the sauce warm, covered. In a kettle of boiling salted water cook the pasta until it is al dente, drain it well, and in a bowl toss it with the sauce."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1/2 pound shrimp (about 12), shelled and deveined",
        "2 large garlic cloves, minced",
        "1/4 teaspoon dried hot pepper flakes, or to taste",
        "1 onion, chopped fine (about 3/4 cup)",
        "4 plum tomatoes, chopped (about 1 cup)",
        "1/2 cup dry white wine",
        "1/2 cup chicken broth",
        "1/4 cup heavy cream",
        "1 bunch of arugula, the stems discarded and the leaves washed well, spun dry, and chopped",
        "3 tablespoons minced fresh parsley leaves (preferably flat-leafed)",
        "1/2 pound fettuccine or spaghetti"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Pasta",
        "Tomato",
        "Appetizer",
        "Quick & Easy",
        "Shrimp",
        "Arugula",
        "White Wine",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pasta with Shrimp, Tomato, and Arugula",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-shrimp-tomato-and-arugula-10990"
}
