{
    "directions": [
        "Preheat oven to 425°F. Cook almonds, 1/4 cup oil, and 1 Tbsp. capers in a small saucepan over medium-low heat, swirling pan occasionally, until capers burst and almonds are golden brown and smell toasty, about 5 minutes. Transfer almonds and capers with a slotted spoon to a small bowl; season with salt. Let cool. Toss romanesco with oil from saucepan on a rimmed baking sheet; season with salt. Roast, tossing halfway through, until golden brown and tender, 20–25 minutes.",
        "Meanwhile, heat 3 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Add garlic, 1/2 tsp. red pepper flakes, and remaining 1 Tbsp. capers and cook, stirring often, until garlic is golden, about 3 minutes. Add wine and cook until liquid is almost completely evaporated, about 2 minutes.",
        "Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 3 minutes less than package directions.",
        "Using a spider or a slotted spoon, transfer pasta to pot with garlic; add 1 cup pasta cooking liquid. Reduce heat to medium and cook, tossing often, until pasta is al dente and liquid is slightly thickened, about 3 minutes. Add 1/4 cup pasta cooking liquid, then gradually add cheese, tossing until melted and dissolved into a luxurious, glossy sauce. Remove from heat; add butter and toss to combine. Toss in romanesco.",
        "Divide pasta among bowls. Top with fried almonds and capers and more red pepper flakes and drizzle with oil."
    ],
    "ingredients": [
        "1/4 cup chopped almonds",
        "1/4 cup plus 3 tablespoons olive oil; plus more for drizzling",
        "2 tablespoons drained capers, patted dry, divided",
        "Kosher salt",
        "1/2 medium romanesco or cauliflower, cored, cut into small florets",
        "8 garlic cloves, very thinly sliced",
        "1/2 teaspoon crushed red pepper flakes, plus more for serving",
        "1/2 cup dry white wine",
        "12 ounces lumaconi (snail shells) or other medium shell pasta",
        "2 ounces aged Asiago cheese or Pecorino, finely grated",
        "2 tablespoons unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Dinner",
        "Vegetarian",
        "Capers",
        "Cauliflower",
        "Garlic",
        "White Wine",
        "Cheese",
        "Almond"
    ],
    "title": "Pasta With Roasted Romanesco and Capers",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-roasted-romanesco-and-capers"
}
