{
    "directions": [
        "Heat oil in a 12-inch heavy skillet over moderate heat until hot but not smoking, then sear duck legs, starting skin sides down and turning over once, until skin is golden and some of fat is rendered, 6 to 8 minutes total. Transfer to a cutting board, reserving skillet. When duck legs are cool enough to handle, remove skin and scrape off and reserve any visible fat, then cut skin into roughly 1/4-inch pieces. Return skin and fat to skillet and cook over moderate heat, stirring occasionally and pressing down on larger pieces, until fat is rendered and cracklings are golden and crisp, about 5 minutes. Transfer cracklings with a slotted spoon to paper towels to drain.",
        "While cracklings cook, pull duck meat from legs into roughly 1/4-inch-thick strips, discarding bones and any gristle.",
        "Reserve 2 tablespoons fat in skillet, discarding remainder, then cook onions with 1/2 teaspoon salt over moderate heat, stirring occasionally, until golden brown, 15 to 20 minutes. Add cabbage and 1/2 teaspoon salt and cook, stirring and turning occasionally with tongs, until cabbage is slightly wilted, about 5 minutes. Add wine and cook, stirring, until evaporated, about 2 minutes. Add chicken broth and simmer, covered, stirring occasionally, until cabbage is very tender, 25 to 30 minutes.",
        "While cabbage simmers, cook pasta in a 6- to 8-quart pot of boiling salted water until al dente. Reserve 1 cup pasta-cooking water, then drain pasta in a colander.",
        "Transfer cabbage mixture to pasta pot along with butter and shredded duck and cook over moderate heat, stirring, until butter is melted and duck is heated through. Stir in pasta, parsley, and pepper until combined. (If pasta looks dry, stir in some of cooking water.) Season with salt and serve cracklings on the side (for sprinkling over pasta)."
    ],
    "ingredients": [
        "1/2 teaspoon vegetable oil",
        "3 (6- to 8-oz) confit duck legs",
        "2 large onions, halved lengthwise, then sliced (1/4 inch thick; 4 cups)",
        "1 teaspoon salt",
        "1 (1 1/2-lb) piece Savoy cabbage, cored and cut into 2-inch pieces (8 cups)",
        "1/4 cup dry white wine",
        "1 1/2 cups reduced-sodium chicken broth (12 fl oz)",
        "1 lb dried campanelle (bell-shaped pasta) or garganelli",
        "1 tablespoon unsalted butter",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "1/2 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Leafy Green",
        "Herb",
        "Pasta",
        "Dinner",
        "Fall",
        "Winter",
        "Cabbage",
        "Noodle",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pasta with Confit Duck and Savoy Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-confit-duck-and-savoy-cabbage-235749"
}
