{
    "directions": [
        "Toss eggplant with salt in a colander set in a large bowl, then let drain, tossing occasionally, 1 hour.",
        "While eggplant drains, rinse capers in a sieve and transfer to a small bowl. Cover capers with water by 2 inches and soak 30 minutes. Drain, then repeat soaking. Drain and rinse capers, then squeeze dry and coarsely chop.",
        "Roast bell pepper on rack of a gas burner over moderately high heat, turning with tongs, until skin is blackened, about 5 minutes. (Or broil pepper on a broiler pan about 5 inches from heat, turning occasionally, about 15 minutes.) Transfer to a bowl, then cover bowl tightly with plastic wrap and let pepper steam 10 minutes.",
        "When cool enough to handle, peel pepper and discard seeds, stem, and ribs. Pat pepper dry and purée in a blender until smooth.",
        "Rinse eggplant and pat dry thoroughly. Heat vegetable oil in a 4-quart pot over high heat until it registers 375°F on thermometer. Fry one third of eggplant, stirring gently, until just golden brown, about 5 minutes. Transfer with a slotted spoon to paper towels to drain. Fry remaining eggplant in 2 batches, returning oil to 375°F between batches.",
        "Pulse together olives, basil, mint, parsley, marjoram, and 2 garlic cloves in a food processor until finely chopped.",
        "Finely chop remaining garlic clove and cook in olive oil along with anchovy in a 5-quart heavy pot over moderately low heat, stirring, until anchovy dissolves and garlic is fragrant, about 1 minute. Increase heat to moderate and stir in pepper purée, then cook, stirring, 1 minute. Stir in olive mixture, capers, and wine and cook, stirring, until wine is evaporated, about 1 minute. Stir in eggplant (sauce will be very thick) and remove from heat. Keep warm, covered.",
        "Cook pasta in a 6- to 8-quart pot of boiling salted water until al dente, then drain and stir into sauce. Season with salt.",
        "*Available at specialty foods shops and chefshop.com."
    ],
    "ingredients": [
        "1 eggplant (1 1/4 lb), peeled and cut into 1/4-inch dice",
        "1 1/2 teaspoons kosher salt",
        "2 tablespoons salt-packed capers *",
        "1 red bell pepper",
        "4 cups vegetable oil",
        "10 green Bella di Cerignola olives, pitted*",
        "1/2 cup loosely packed fresh basil leaves",
        "1/4 cup loosely packed fresh mint leaves",
        "1/4 cup loosely packed fresh parsley leaves",
        "1/2 teaspoon finely chopped fresh marjoram",
        "3 garlic cloves",
        "2 tablespoons extra-virgin olive oil",
        "1 anchovy fillet, rinsed and chopped",
        "2 tablespoons dry white wine",
        "1 lb penne rigate or fusilli",
        "Special equipment: a deep-fat thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Pasta",
        "Eggplant",
        "Summer",
        "Capers",
        "Gourmet"
    ],
    "title": "Pasta with Eggplant, Capers, and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-eggplant-capers-and-olives-109013"
}
