{
    "directions": [
        "Roll the pasta dough into thin wide sheets, and briefly cook them.",
        "In separate saucepans, warm the besciamella and the Bolognese slightly, so they are loose and spreadable but not hot.",
        "If you are going to bake the pasticciata right away, arrange a rack in the middle of the oven and preheat it to 375°.",
        "Coat the bottom and sides of the dish thinly with 1/3 cup besciamella.",
        "Spread 1/3 cup Bolognese on the bottom, over the besciamella.",
        "Following the illustrations, drape pasta sheets the length of the pan so that they cover the bottom of the dish completely and extend over the short sides of the pan by 6 inches or so.",
        "Spread 1/3 cup besciamella over the pasta.",
        "Spread 1/3 cup Bolognese over the besciamella.",
        "Drape pasta sheets perpendicular to the first, across the width of the pan, with the ends of the sheets extending over the sides of the pan by 6 inches or so. Pasta sheets should now completely hide the sides of the pan.",
        "Spread 2/3 cup besciamella over the pasta. Sprinkle 1/4 cup grated cheese all over. Spread 1 cup Bolognese in a thick layer. Cover with a third of the Muenster or mozzarella, shredded or in slices.",
        "Fit another layer of pasta on top, covering only the inside of the pan now, cutting sheets if necessary to fit. Create another thick filling layer with 2/3 cup besciamella, 1/4 cup grated cheese, 1 cup Bolognese, and another third of shredded cheese.",
        "Make another layer of pasta sheets, cut to fit, and top with a final filling layer (2/3 cup besciamella, 1/4 cup grated cheese, 1 cup Bolognese, and the last third of the shredded cheese).",
        "Arrange another layer of pasta over the filling, cut to fit.",
        "Spread 1/3 cup besciamella over the pasta, and sprinkle 2 tablespoons grated cheese all over.",
        "Repeat with a final layer of pasta, then besciamella, and then grated cheese.",
        "Fold all the overhanging flaps of pasta onto the top of the pasticciata.",
        "If they don't meet and cover the top, cut a piece of pasta to fit, or use all the remaining pasta here.",
        "Spread the rest of the besciamella and Bolognese on, and sprinkle 2 tablespoons grated cheese all over.",
        "If you want, you can bake the pasticciata later, or the next day, covering it with plastic wrap and refrigerating it in the meantime.",
        "Before putting it in the oven, tear a long sheet of foil to form a tent over the pan. This will give the insides time to cook before the top browns. Arch the foil so it doesn't touch the pasticciata anywhere, and crimp it against the rim and outsides of the pan so it stays in place and has formed a good seal. With the tip of a sharp knife, poke five or six small holes in the foil to vent steam.",
        "Set the pan on a baking sheet, put it in the oven, and bake for about 45 minutes, or until bubbling juices indicate that it's cooking all the way through—peek under the foil to check. Take the pan (on the baking sheet) out of the oven to remove the foil tent.",
        "Loosen foil at the sides and lift it up carefully, so it doesn't touch the sticky top of the pasticciata. Return the pan to the oven, and bake for another 20 minutes or so, until the top is deeply colored and crisp.",
        "Let the pasticciata sit uncovered for 20 minutes to settle before cutting it in squares and serving."
    ],
    "ingredients": [
        "1 recipe fresh Spinach Pasta Dough (page 178)",
        "2 recipes (4 cups) besciamella (recipe follows)",
        "4 cups Ragù alla Bolognese, either variety (page 143)*",
        "2 to 3 tablespoons butter, for the baking pan",
        "8 ounces freshly grated Parmigiano-Reggiano or Grana Padano (1 1/2 cups)",
        "12 ounces Muenster cheese or low-moisture mozzarella, shredded or very thinly sliced (3 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Bake",
        "Steam",
        "Dinner",
        "Mozzarella",
        "Parmesan",
        "Spinach",
        "Noodle",
        "Butter"
    ],
    "title": "Pasticciata Bolognese—Lasagna with Spinach Noodles and Bolognese Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pasticciata-bolognese-lasagna-with-spinach-noodles-and-bolognese-sauce-355929"
}
