{
    "directions": [
        "Sauté sausage in heavy large pot over medium-high heat until brown, about 12 minutes. Using slotted spoon, transfer sausage to large bowl. Add oil to drippings in pot. Add mushrooms and onions; sauté until tender and brown, about 15 minutes. Stir in 1 cup chopped basil, oregano, and garlic; sauté 1 minute. Add wine; cook until almost absorbed, about 4 minutes. Add sausage and crushed tomatoes; cover and simmer over medium heat until thickened, about 25 minutes. Add diced tomatoes and butter; simmer until tomatoes are soft, stirring frequently, about 15 minutes. Season with salt and pepper. (Can be made 1 day ahead. Cool slightly. Chill uncovered until cold, then cover and refrigerate. Bring to simmer before continuing.)",
        "Cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain well; return to pot. Pour sauce over pasta; toss to coat. Add 1/2 cup cheese and 1/2 cup basil; toss to combine. Season with salt and pepper. Transfer pasta to serving dish. Serve, passing remaining cheese separately."
    ],
    "ingredients": [
        "2 1/2 pounds Italian sweet sausages, casings removed, crumbled",
        "3 tablespoons olive oil",
        "1 1/2 pounds mushrooms, thickly sliced",
        "3 cups chopped onions",
        "1 1/2 cups chopped fresh basil",
        "1/4 cup chopped fresh oregano",
        "6 large garlic cloves, chopped",
        "1 cup dry white wine",
        "5 cups canned crushed tomatoes with added puree",
        "2 cups diced tomatoes (about 4 medium-large tomatoes)",
        "2 tablespoons (1/4 stick) butter",
        "1 1/4 pounds pappardelle or mafaldine pasta (or any wide, flat noodles)",
        "1 1/2 cups grated pecorino Romano cheese (about 4 1/2 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "Tomato",
        "Sauté",
        "Parmesan",
        "Basil",
        "Sausage",
        "White Wine"
    ],
    "title": "Pasta with Sausage, Tomatoes, and Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-sausage-tomatoes-and-mushrooms-106961"
}
