{
    "directions": [
        "Melt butter with 2 tablespoons oil in heavy large skillet over medium heat. Add onions and shallot. Sprinkle with coarse salt and pepper. Sauté until tender (do not brown), about 8 minutes. Add wine; increase heat to medium-high and simmer until liquid is reduced to glaze, about 3 minutes. Add broth and bring to simmer; set aside.",
        "Cook asparagus in large pot of boiling salted water until just tender, 2 to 4 minutes, depending on thickness of asparagus. Using skimmer or slotted spoon, transfer to large bowl of ice water. Return water to boil. Add peas and cook until just tender, about 2 minutes. Using skimmer, transfer to bowl with asparagus. Drain vegetables.",
        "Return water in pot to boil. Cook pasta until tender but still firm to bite, stirring occasionally. Drain, reserving 1 cup pasta cooking liquid.",
        "Meanwhile, reheat onion mixture. Add lettuce and stir just until wilted, about 1 minute. Add drained asparagus and peas; stir until heated through.",
        "Add pasta, 1 cup Parmesan cheese, and parsley to skillet with vegetables; toss, adding reserved pasta cooking liquid by 1/4 cupfuls if dry. Season with salt and pepper.",
        "Transfer pasta to large shallow bowl. Sprinkle prosciutto over; drizzle with olive oil. Serve, passing more cheese alongside."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter",
        "2 tablespoons extra-virgin olive oil plus additional for drizzling",
        "1/2 pound spring onions or green onions (dark green parts discarded); white parts cut into 1/4-inch-thick slices, pale green parts cut into 1/2-inch-thick slices",
        "2 tablespoons minced shallot",
        "Coarse kosher salt",
        "1/2 cup dry white wine",
        "1/2 cup low-salt chicken broth",
        "1 1/2 pounds asparagus, cut crosswise into 3/4-inch pieces",
        "2 cups shelled fresh peas (from about 2 pounds peas in pods)",
        "1 pound campanelle (trumpet-shaped pasta) or medium (about 1-inch) shell-shaped pasta",
        "1 head of butter lettuce or Boston lettuce (about 6 ounces), cored, leaves cut into 3/4-inch-wide slices",
        "1 cup finely grated Parmesan cheese plus additional for sprinkling",
        "1/2 cup chopped fresh Italian parsley",
        "4 ounces thinly sliced prosciutto, cut crosswise into 1/2-inch-wide strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "High Fiber",
        "Mother's Day",
        "Dinner",
        "Asparagus",
        "Pea",
        "Spring",
        "Prosciutto",
        "Lettuce",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pasta with Peas, Asparagus, Butter Lettuce, and Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-peas-asparagus-butter-lettuce-and-prosciutto-352093"
}
