{
    "directions": [
        "Heat oil in a large skillet over medium-high heat. Add shallots and cook, stirring often, until beginning to brown, about 3 minutes. Add chorizo and cook, breaking up with a spoon, until browned and cooked through, 5-7 minutes.",
        "Add tomato paste and red pepper flakes to skillet and cook, stirring, until paste darkens, about 1 minute. Add broth; bring to a boil, reduce heat, and simmer, stirring occasionally, until sauce is thick-ened, 15-20 minutes. Add chickpeas and cook until heated through, about 2 minutes.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, reserving 1 cup pasta cooking liquid.",
        "Add pasta and 1/2 cup pasta cooking liquid to sauce. Cook, stirring and adding more cooking liquid as needed, until sauce thickens and coats pasta, about 3 minutes.",
        "Serve pasta topped with parsley, if using, Parmesan, and lemon zest."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "2 small shallots, chopped",
        "3/4 pound fresh Mexican chorizo or hot Italian sausage, casings removed",
        "2 tablespoons tomato paste",
        "1/2 teaspoon crushed red pepper flakes",
        "2 cups low-sodium chicken broth",
        "1 15-ounce can chickpeas, rinsed",
        "12 ounces small dried pasta (such as malloreddus or orecchiette)",
        "Kosher salt",
        "2 tablespoons chopped fresh flat-leaf parsley (optional)",
        "Finely grated Parmesan and lemon zest (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Quick & Easy",
        "High Fiber",
        "Dinner",
        "Sausage",
        "Chickpea",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pasta with Chorizo and Chickpeas",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-chorizo-and-chickpeas-51187050"
}
