{
    "directions": [
        "Cut shallow slashes diagonally across the fat-side of each duck breast to create cross-hatch marks.",
        "Whisk 1 tablespoon olive oil, 1 tablespoon black pepper, coriander, 1 teaspoon kosher salt, paprika, dry mustard, and cayenne pepper together in a large bowl until a wet-rub consistency. Rub spice mixture onto all sides of duck breasts. Set duck into bowl, cover the bowl with plastic wrap, and refrigerate, 8 hours to overnight.",
        "Pat excess rub off of duck with paper towels. Season on all sides with kosher salt.",
        "Whisk 1/2 cup olive oil, sherry vinegar, Dijon mustard, salt, and black pepper together in a bowl until creamy and smooth. Toss cabbage and Russian dressing together in a separate bowl.",
        "Heat vegetable oil in a skillet over medium-high heat. Cook duck, skin-side down, in hot skillet until skin is crispy and caramelized, 5 to 6 minutes. Reduce heat to medium, flip ducks breasts, and cook until pink in the middle and meat springs back when touched, about 5 minutes more. Remove to a plate to rest. Pour rendered duck fat from the skillet through a strainer into a bowl.",
        "Heat 1 tablespoon reserved duck fat in a nonstick skillet over medium heat. Place bread in skillet and cook until lightly toasted, about 1 minute. Flip bread slices and cook until toasted on the other side, about 1 minute more. Sprinkle cheese on each piece of bread, flip slices, and cook until cheese is melted and crisped, about 30 seconds.",
        "Slice each duck breasts into 5 pieces. Place each piece of toast on a plate and top with sliced duck breasts. Drizzle Dijon mustard mixture over the top and serve with cabbage."
    ],
    "ingredients": [
        "2 skin-on, boneless duck breast halves",
        "Rub:",
        "1 tablespoon olive oil",
        "1 tablespoon ground black pepper",
        "2 teaspoons ground coriander",
        "2 teaspoons kosher salt, or more to taste",
        "1 teaspoon smoked paprika",
        "1/2 teaspoon dry mustard",
        "1 pinch cayenne pepper",
        "Mustard Dressing:",
        "1/2 cup olive oil",
        "1/4 cup sherry vinegar",
        "2 tablespoons Dijon mustard",
        "salt and ground black pepper to taste",
        "Reuben:",
        "2 cups chopped green cabbage",
        "2 tablespoons Russian salad dressing, or more to taste",
        "1 teaspoon vegetable oil, or as needed",
        "2 slices rye bread",
        "1/4 cup shredded Swiss cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pastrami-Spiced Duck Breast Reuben",
    "url": "http://allrecipes.com/recipe/240239/pastrami-spiced-duck-breast-reuben/"
}
