{
    "directions": [
        "Heat butter and 2 Tbsp. oil in a large skillet over medium-high. Add potatoes and winter squash and season with salt and pepper. Cook, stirring occasionally, until vegetables are tender, 25–30 minutes.",
        "Add leeks and garlic to hash and season with salt and pepper. Using the back of a spoon or a spatula, lightly smash vegetables. Add pastrami and cook, stirring occasionally, until meat is warmed through and flavors have melded, 10–12 minutes.",
        "Heat remaining 2 Tbsp. oil in a medium skillet over medium-high. Carefully crack eggs into skillet one at a time and season with salt and pepper. Cook until whites are set and slightly puffed but yolks are still runny, about 2 minutes.",
        "Divide hash among shallow bowls and top each with an egg; scatter chives over top. Serve with sour cream alongside, if desired."
    ],
    "ingredients": [
        "4 tablespoons unsalted butter",
        "4 tablespoons olive oil, divided",
        "1 1/2 pounds Yukon Gold potatoes (about 4 large), scrubbed, cut into 1\" pieces",
        "1/2 pound winter squash (such as acorn, butternut, or kabocha), peeled, cut into 1\" pieces",
        "Kosher salt, freshly ground pepper",
        "2 leeks, white and pale-green parts only, chopped",
        "1 garlic clove, chopped",
        "1 pound pastrami or any leftover braised meat, cut or shredded into bite-size pieces",
        "4 large eggs",
        "1/4 cup sliced chives",
        "3/4 cup sour cream (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breakfast",
        "Potato",
        "Meat",
        "Egg",
        "Kid-Friendly",
        "Squash",
        "Beef",
        "Leek",
        "Sour Cream",
        "Chive",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pastrami and Potato Hash with Fried Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/pastrami-and-potato-hash-with-fried-eggs"
}
