{
    "directions": [
        "Bring broth, water, and 1 teaspoon salt to a boil in a medium saucepan, then reduce heat and keep at a bare simmer.",
        "Trim tough stem ends from broccoli rabe, then cut remaining stems crosswise into 1-inch pieces and reserve. Coarsely chop florets and leaves.",
        "Heat oil in a 5- to 6-quart heavy pot over medium-high heat until it shimmers, then sauté onion with 1/2 teaspoon salt until softened, 3 to 5 minutes. Stir in garlic and sauté 1 minute, then add pasta, broccoli rabe stems, and 3/4 cup hot broth and simmer briskly, stirring constantly, until broth is absorbed. Continue simmering and adding hot broth, about 3/4 cup at a time, stirring frequently and letting each addition be absorbed before adding the next, until pasta is almost al dente and creamy-looking, 12 to 13 minutes. Stir in remaining broccoli rabe and 1/4 teaspoon pepper and cook, stirring, until pasta is al dente and broccoli rabe is just tender, 2 to 3 minutes. (If needed, add more hot broth to moisten; there will be some broth left over.) Stir in cheese and salt and pepper to taste. Serve with more cheese on the side."
    ],
    "ingredients": [
        "1 quart reduced-sodium chicken broth",
        "1 quart water",
        "1 bunch broccoli rabe",
        "1/4 cup olive oil",
        "1 medium onion, chopped",
        "2 garlic cloves, chopped",
        "1 lb medium pasta shells",
        "1/2 cup grated Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Onion",
        "Pasta",
        "Sauté",
        "Christmas",
        "Quick & Easy",
        "Lunch",
        "Parmesan",
        "Fall",
        "Winter",
        "Healthy",
        "Broccoli Rabe",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pasta-Shell Risotto with Broccoli Rabe",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-shell-risotto-with-broccoli-rabe-240590"
}
