{
    "directions": [
        "Melt butter in a small saucepan over medium-low heat, then add bonito flakes; swirl butter to combine. Remove from heat and let sit 10 minutes to infuse.",
        "Strain butter through a fine-mesh sieve into a small bowl, pressing on solids; discard bonito flakes. Cover and chill butter until ready to use.",
        "Finely grind dried shrimp in spice mill or with mortar and pestle; set aside for serving.",
        "Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 3 minutes if using fresh pasta, longer if dried. Drain pasta, reserving 1 1/2 cups pasta cooking liquid.",
        "Meanwhile, heat oil in a large skillet over medium. Add chile and lemon zest and cook, stirring, 20 seconds. Add rock shrimp and cook, tossing, 1 minute. Add tarragon, lemon juice, pasta, 3/4 cup pasta cooking liquid, and 3 Tbsp. bonito butter and toss to coat. Cook, tossing and adding more pasta cooking liquid as needed, until sauce is glossy and coats pasta and shrimp are cooked through, about 3 minutes. Season with salt if needed.",
        "Divide pasta among bowls and top with scallions and reserved dried shrimp."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter",
        "1/4 cup bonito flakes",
        "2 teaspoons dried shrimp",
        "12 ounces fresh or dried capellini, tagliatelle, or fettuccine, preferably egg-enriched",
        "Kosher salt",
        "2 tablespoons olive oil",
        "1 red chile (such as Holland or Fresno), seeds removed, finely chopped",
        "2 wide strips lemon zest, thinly sliced",
        "1/2 pound rock shrimp or other small shrimp, peeled and deveined, cut into small pieces",
        "1 tablespoon finely chopped tarragon",
        "1 tablespoon fresh lemon juice",
        "2 scallions, green parts only, thinly sliced",
        "A spice mill or mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shrimp",
        "Pasta",
        "Dinner",
        "Seafood",
        "Lemon",
        "Tarragon",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pasta With Rock Shrimp, Chile, and Lemon",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-rock-shrimp-chile-and-lemon"
}
