{
    "directions": [
        "In medium bowl, combine beans and cold water to cover by 2 inches. Cover tightly and refrigerate at least 8 hours or overnight.",
        "Drain beans. In medium saucepan over moderately high heat, combine beans, cold water to cover by 1 inch, 1 tablespoon salt, and 2 tablespoons olive oil. Bring to boil, then reduce heat to low and simmer, partially covered, until tender, about 90 minutes. Drain and set aside.",
        "In large pot over moderately high heat, bring 6 cups salted water to boil.",
        "Meanwhile, in medium saucepan over moderate heat, heat remaining 2 tablespoons olive oil until hot but not smoking. Add sausage and sauté, breaking up with wooden spoon, until brown, about 6 minutes. Add onions and sauté until translucent, about 5 minutes. Add garlic, rosemary, beans, stock, pepper, and remaining 1 teaspoon salt and bring to simmer. Reduce heat to moderately low and simmer, uncovered, until heated through, 3 to 5 minutes.",
        "Cook pasta in boiling water until just tender, about 8 minutes. Drain well, stir into soup, and serve."
    ],
    "ingredients": [
        "1 cup (8 ounces) dried cannellini (white kidney) beans, picked over and rinsed",
        "1 tablespoon plus 1 teaspoon kosher salt, plus additional for boiling pasta",
        "4 tablespoons olive oil",
        "8 ounces sweet Italian sausages, casings removed",
        "1 small onion, finely chopped (about 1 1/3 cups)",
        "10 cloves garlic, minced (about 1/4 cup)",
        "1 sprig fresh rosemary",
        "4 cups chicken stock or low-sodium chicken broth",
        "3/4 teaspoon freshly ground black pepper",
        "8 ounces tubetti, ditalini, or other small tubular pasta"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Pasta",
        "Father's Day",
        "Lunch",
        "Sausage",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pasta e Fagioli con Salsicce (Pasta and Beans with Sausage)",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-e-fagioli-con-salsicce-pasta-and-beans-with-sausage-351989"
}
