{
    "directions": [
        "Heat a large skillet over medium heat and add oil, garlic, anchovies, and crushed pepper. Saute mixture until anchovies melt into oil and completely dissolve and garlic is tender, about 3 minutes: your kitchen never smelled so good! Add olives, capers, tomatoes, black pepper, and parsley. Bring sauce to a bubble, reduce heat, and simmer 8 to 10 minutes.",
        "Toss sauce with cooked pasta. Pass bread and cheese at the table and serve with Bitter Greens Salad.",
        "Combine greens in a salad bowl. Squeeze the juice of 1 lemon over the bowl. Drizzle salad liberally with extra virgin olive oil. Toss salad and season salad with salt and pepper. Arrange salad on plates. Garnish plates with black olives, if using."
    ],
    "ingredients": [
        "2 tablespoons (2 turns around the pan) extra-virgin olive oil",
        "4 to 6 cloves garlic, chopped",
        "1 tin flat anchovy fillets, drained",
        "1/2 teaspoon crushed red pepper flakes",
        "20 oil-cured black olives, cracked away from pit and coarsely chopped",
        "3 tablespoons capers",
        "One 32-ounce can chunky style crushed tomatoes",
        "One 14.5-ounce can diced tomatoes, drained",
        "A few grinds black pepper",
        "1/4 cup (a couple of handfuls) flat leaf parsley, chopped",
        "1 pound spaghetti, cooked to al dente (with a bite)",
        "Crusty bread, for mopping",
        "Grated Parmigiano Reggiano or Romano, for passing, optional",
        "Serving suggestions: Bitter Greens Salad, recipe follows",
        "4 cups (about 2 bundles) arugula leaves, coarsely chopped",
        "1 1/2 cups (about 1 bundle) watercress leaves, coarsely chopped",
        "1 head Radicchio lettuce, coarsely chopped",
        "1 large lemon",
        "Extra-virgin olive oil, to coat, 2 to 3 tablespoons",
        "Coarse salt and black pepper",
        "Oil cured black olives, for garnish, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "European Recipes",
        "Italian",
        "Pasta Recipes",
        "Tomato",
        "Vegetable",
        "Fish",
        "Anchovy",
        "Main Dish Recipes"
    ],
    "title": "Pasta Puttanesca",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/pasta-puttanesca-recipe"
}
