{
    "directions": [
        "Whisk flour, salt, and yeast in medium bowl to blend well. Add lard and rub in with fingertips until mixture resembles coarse meal. Make well in center of mixture and pour wine into well. Stir with fork until shaggy dough forms. Gather dough together and turn out onto lightly floured work surface. Knead dough until smooth and elastic, adding warm water by teaspoonfuls if dough is dry, about 10 minutes.",
        "Line large baking sheet with parchment paper. Roll out dough on lightly floured surface to 1/8-inch thickness. Using fluted pastry wheel, cut dough into 1 1/4-inch-wide by 4-inch-long strips. Gently twist each strip in center, forming bow. Place pastry twists on prepared baking sheet. Reroll dough scraps to 1/8-inch thickness and cut out additional strips. Twist strips and place on prepared baking sheet.",
        "Pour enough olive oil into large saucepan to reach depth of 1 1/2 inches. Attach deep-fry thermometer to side of pan with bulb submerged in oil; heat oil to 360°F. Working in batches, fry dough twists in oil until golden on all sides, turning occasionally, 2 to 3 minutes. Using slotted spoon, transfer fried pastries to paper towels to drain. Cool completely. DO AHEAD: Can be made 1 day ahead. Store airtight at room temperature.",
        "Line another large baking sheet with parchment paper. Bring honey to simmer in medium saucepan. Remove from heat. Cool until just warm. Whisk powdered sugar, cinnamon, and nutmeg in medium bowl to blend.",
        "Working with 1 fried pastry at a time, dip pastry into warm honey. Lift pastry and shake gently, allowing excess honey to drip back into pan. Roll pastry in powdered sugar mixture to coat. Place on prepared baking sheet. Arrange pastries on platter.",
        "For the best results, dip the pastry twists in a mild-flavored honey, such as orange blossom. An assertively flavored honey will overwhelm the pastry and the spiced powdered sugar.",
        "Finish the meal with a glass of Moscato, a sweet white wine. Donatella recommends the 2007 Rivera \"Piani di Tufara\" Moscato di Trani, Dolce (Italy, $15). The wine's spicy raisin notes are complemented by bitter almond flavors and an apricot finish. If that bottle is unavailable, try the 2008 Michele Chiarlo Nivole Moscato D'Asti (Italy, $16), a sparkling Moscato with stone-fruit flavors."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "1/4 teaspoon (generous) salt",
        "1/8 teaspoon (generous) active dry yeast",
        "1/4 cup lard, cut into 1/2-inch cubes, room temperature",
        "1/2 cup dry white wine, room temperature",
        "Extra-virgin olive oil (for frying)",
        "1 cup honey",
        "1 cup powdered sugar",
        "1 tablespoon ground cinnamon",
        "1/2 teaspoon ground nutmeg",
        "Special equipment: Fluted pastry wheel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "White Wine",
        "Family Reunion",
        "Deep-Fry",
        "Cinnamon",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pastry Twists with Spiced Sugar-Honey Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/pastry-twists-with-spiced-sugar-honey-glaze-358569"
}
