{
    "directions": [
        "Preheat oven to 400°F. Toss eggplant with 2 teaspoons salt in large bowl. Turn eggplant out onto paper towels and let drain 30 minutes. Pat eggplant dry.",
        "Heat oil in heavy medium saucepan over medium-high heat to 350°F. Working in batches, add eggplant to oil; cook until golden, turning occasionally, about 6 minutes per batch. Using slotted spoon, transfer to clean paper towels. Reserve 5 tablespoons eggplant frying oil. Toss shallots and whole bell pepper with 3 tablespoons reserved oil on large baking sheet. Roast until shallots are tender, turning occasionally, about 25 minutes. Place shallots and eggplant in large bowl. Continue roasting bell pepper until skin blackens, about 10 minutes. Wrap in plastic bag; let stand 10 minutes. Peel, core and seed pepper. Cut into thin strips lengthwise, then cut strips crosswise in half. Add bell pepper strips, olives and garlic to eggplant and shallots.",
        "Cook artichokes in large pot of boiling salted water until tender, turning occasionally, about 40 minutes. Using tongs, transfer to bowl; cool. Remove leaves from artichokes and reserve for another use. Scoop out chokes. Cut artichoke hearts into 1/3-inch pieces; combine with other vegetables. (Can be made 2 hours ahead. Cover and let stand at room temperature.)",
        "Cook pasta in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain. Return pasta to pot. Add all vegetables and remaining 2 tablespoons reserved eggplant frying oil and toss over medium heat until heated through. Season with salt and pepper. Divide pasta among plates and serve."
    ],
    "ingredients": [
        "1 1 1/4-pound eggplant, unpeeled, cut into 1 1/2-inch pieces",
        "2 teaspoons salt",
        "2 cups olive oil",
        "4 large shallots, peeled, quartered",
        "1 large red bell pepper",
        "1/2 cup chopped pitted brine-cured black olives (such as Kalamata)",
        "2 large garlic cloves, finely chopped",
        "2 large artichokes, stems trimmed",
        "8 ounces rigatoni or other tubular pasta"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Vegetable",
        "Appetizer",
        "Vegetarian",
        "Spring",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Pasta with Eggplant, Artichokes and Bell Pepper (Pasta con Melanzane, Carciofi e Peperoni)",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-eggplant-artichokes-and-bell-pepper-pasta-con-melanzane-carciofi-e-peperoni-4022"
}
