{
    "directions": [
        "If squid are large, halve ring of tentacles, then cut longer tentacles, if attached, crosswise into 2-inch pieces. Pull off flaps from squid bodies and cut into 1/4-inch-thick slices. Cut bodies crosswise into 1/4-inch-thick rings. Pat squid dry.",
        "Heat 3 tablespoons oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then sauté garlic and chile, stirring, until fragrant, about 30 seconds. Add squid and sauté, stirring, 1 minute. Add tomatoes and wine and simmer, stirring, 2 minutes. Add raisins and capers and simmer, stirring, 30 seconds. Remove from heat.",
        "Cook pasta in a 6-quart pot of boiling salted water until al dente. Reserve 1/2 cup pasta cooking water, then drain pasta in a colander.",
        "Add pasta to tomato mixture with 1/4 cup reserved cooking water and cook over moderately high heat, stirring constantly, 1 minute. Remove from heat and stir in basil, pine nuts, zest, and salt and pepper to taste. If pasta looks dry, moisten with more cooking water.",
        "Divide pasta among 4 plates, then drizzle each serving with some of remaining 3 tablespoons oil."
    ],
    "ingredients": [
        "1 lb cleaned squid, bodies and tentacles separated but kept intact",
        "6 tablespoons extra-virgin olive oil",
        "4 large garlic cloves, finely chopped",
        "1 (1 1/2-inch) fresh red or green Thai or serrano chile, halved crosswise",
        "1/2 lb grape or cherry tomatoes, halved",
        "1/3 cup dry white wine",
        "1/2 cup raisins",
        "1/4 cup drained bottled capers, rinsed, patted dry, and coarsely chopped",
        "1/2 lb campanelle (small bell-shaped pasta) or fusilli pasta",
        "1/2 cup loosely packed torn fresh basil leaves",
        "1/4 cup pine nuts, lightly toasted",
        "1 (1- by 1/2-inch) strip fresh lemon zest , finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Sauté",
        "Raisin",
        "Basil",
        "Pine Nut",
        "Squid",
        "Hot Pepper",
        "Healthy",
        "Gourmet"
    ],
    "title": "Pasta with Squid, Tomatoes, and Capers",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-squid-tomatoes-and-capers-107796"
}
