{
    "directions": [
        "First of all, get your nice firm eggplants and cut them into quarters lengthwise. If they've got seedy, fluffy centers, remove them and chuck them away. Then cut the eggplants across the length, into finger-sized pieces. Get a large nonstick pan nice and hot and add a little oil. Fry the eggplants in two batches, adding a little extra oil if you need to. Give the eggplants a toss so the oil coats every single piece and then sprinkle with some of the dried oregano—this will make them taste fantastic. Using a pair of tongs, turn the pieces of eggplant until golden on all sides. Remove to a plate and do the same with the second batch.",
        "When the eggplants are all cooked, add the first batch back to the pan—at this point I sometimes add a sneaky dried red chili. Turn the heat down to medium and add a little oil, the garlic, and the basil stems. Stir so everything gets evenly cooked, then add a swig of herb vinegar and the cans of tomatoes, which you can chop or whiz up. Simmer for 10 to 15 minutes, then taste and correct the seasoning. Tear up half the basil leaves, add to the sauce, and toss around.",
        "Get your spaghetti into a pan of salted boiling water and cook according to the package instructions. When it's al dente, drain it in a colander, reserving a little of the cooking water, and put it back into the pan. Add the Norma sauce and a little of the reserved cooking water and toss together back on the heat. Taste, and adjust the seasoning, then divide between your plates by twizzling the pasta into a ladle for each portion. Any sauce left in the pan can be spooned over the top. Sprinkle with the remaining basil, grated cheese, and oil."
    ],
    "ingredients": [
        "2 large, firm eggplants",
        "extra-virgin olive oil",
        "1 tablespoon dried oregano",
        "optional: 1 dried red chili, crumbled",
        "4 cloves of garlic, peeled and finely sliced",
        "a large bunch of fresh basil, stems finely chopped, leaves reserved",
        "1 teaspoon good herb or white wine vinegar",
        "2 14-ounce cans of good-quality chopped plum tomatoes, or 2 cups passata",
        "sea salt and freshly ground black pepper",
        "1 pound dried spaghetti",
        "6 ounces salted ricotta, pecorino, or Parmesan cheese, grated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Pasta",
        "Tomato",
        "Vegetable",
        "Fry",
        "Vegetarian",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Eggplant",
        "Fall",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Pasta alla Norma",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-alla-norma-240254"
}
