{
    "directions": [
        "For the vegetables: Heat 2 tablespoons of the oil in a large skillet over medium-high heat. Add the carrots and cook, about 1 minute. Then add the broccoli and cook, about 1 additional minute. Add the red peppers and cook, about 1 minute. Remove the vegetables from the skillet and set aside.",
        "To the skillet, add the butter and the remaining 1 tablespoon oil and allow it to heat up. Add the mushrooms, zucchini and squash and cook until the vegetables are starting to soften, 2 to 3 minutes. Remove the vegetables from the skillet, add to the other vegetables and set aside.",
        "For the sauce: Add the garlic and onions to the skillet and cook until starting to turn translucent, about 2 minutes.",
        "Next, pour in the chicken broth and wine and stir, scraping the bottom of the pan to loosen all the flavorful bits. Cook the liquid for 3 to 4 minutes, allowing it to reduce by about half. Stir in the cream and Parmesan and allow the cheese to melt. Add salt and black pepper to taste.",
        "Add all the vegetables to the sauce along with the peas and basil. Stir to combine. If the sauce needs a little more liquid, splash a small amount of broth as needed. Place the cooked pasta in a large serving bowl and pour all the contents of the skillet over the pasta. Toss to combine. Sprinkle with extra basil and serve with extra Parmesan."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "2 large carrots, peeled and sliced diagonally",
        "1 cup bite-size broccoli pieces",
        "1 whole red bell pepper, seeded and sliced into strips",
        "2 tablespoons butter",
        "4 ounces white mushrooms, washed and sliced",
        "2 medium zucchini, sliced diagonally",
        "1 medium summer squash, sliced diagonally",
        "4 cloves garlic, minced",
        "1/2 large onion, diced",
        "1/2 cup chicken broth",
        "1/4 cup white wine",
        "1/2 cup heavy cream or half-and-half",
        "1/2 cup grated Parmesan, plus more for serving",
        "Salt and freshly ground black pepper",
        "1/2 cup frozen peas",
        "12 whole fresh basil leaves, chopped, plus more for serving",
        "1 pound pasta (fettuccini), cooked according to package directions and drained"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Sauce Recipes",
        "Vegetable",
        "Dairy Recipes",
        "Main Dish Recipes",
        "Spring",
        "Sauteing Recipes"
    ],
    "title": "Pasta Primavera",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/pasta-primavera-recipe"
}
