{
    "directions": [
        "Heat 2 tablespoons oil in a large skillet over medium. Cook anchovies, garlic, and red pepper flakes, stirring occasionally, until anchovies disintegrate, about 3 minutes. Add half of tomatoes; season with salt and pepper. Cook, stirring occasionally, until sauce thickens, 12–15 minutes. Add remaining tomatoes; remove from heat.",
        "Meanwhile, heat remaining 1 tablespoon oil in a large skillet over medium-high. Season fish with salt and pepper and cook until golden brown and just cooked through, about 4 minutes per side. Let cool slightly. Coarsely flake flesh; discard skin.",
        "Toast nuts in a dry small skillet over medium-low heat, tossing often, until golden brown, about 4 minutes. Let cool.",
        "Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid.",
        "Add pasta and 1/2 cup pasta cooking liquid to tomato sauce and cook over low heat, tossing often, and adding more cooking liquid as needed, until sauce is thickened and coats pasta. Add fish to pasta along with half of parsley and toss once to combine.",
        "Serve pasta topped with raisins, pine nuts, and remaining parsley."
    ],
    "ingredients": [
        "3 tablespoons olive oil, divided",
        "4 oil-packed anchovy fillets",
        "4 garlic cloves, sliced",
        "1/2 teaspoon crushed red pepper flakes",
        "2 pints cherry tomatoes, halved",
        "Kosher salt",
        "freshly ground pepper",
        "1 pound (1\"-thick) swordfish steaks",
        "2 tablespoons pine nuts",
        "12 ounces casarecce or other short pasta",
        "1/2 cup chopped fresh parsley, divided",
        "2 tablespoons golden raisins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Low Fat",
        "Kid-Friendly",
        "Quick & Easy",
        "Healthy",
        "Swordfish"
    ],
    "title": "Pasta With Swordfish and Cherry Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-swordfish-and-cherry-tomato-sauce-56389845"
}
