{
    "directions": [
        "In a kettle cook the garlic and the red pepper flakes in the oil over moderately low heat, stirring occasionally, until the garlic is softened, add the tomatoes, and boil the mixture, stirring occasionally, for 5 minutes, or until it is thickened and the liquid is reduced to a thick purée. Stir in the chopped basil and salt and pepper to taste.",
        "In a saucepan combine the butter, the cream, and the broth, bring the mixture to a boil, and simmer it, stirring occasionally, until it is reduced to 1/2 cup. Whisk in the Parmesan, whisking until the mixture is smooth, whisk the mixture into the tomato mixture, whisking until the sauce is combined well, and keep the sauce warm.",
        "In a kettle of boiling salted water cook the asparagus for 2 minutes, add the broccoli and the zucchini, and cook the vegetables, for 2 minutes. Add the peas, cook the vegetables for 1 minute, and add the snow peas. Cook the vegetables for 30 seconds, or until they are all just tender, transfer them with a slotted spoon or sieve to the sauce, and toss them gently to coat them with the sauce.",
        "Return the cooking liquid in the kettle to a boil, in it cook the pasta until it is al dente, and drain it well. In the kettle combine the pasta with the vegetable mixture, the prosciutto, and salt and pepper to taste. Divide the pasta mixture among 6 heated plates and garnish it with the basil leaves."
    ],
    "ingredients": [
        "3 garlic cloves, minced",
        "1/2 teaspoon dried hot red pepper flakes, or to taste",
        "3 tablespoons olive oil",
        "a 35-ounce can plum tomatoes, drained and chopped coarse (about 3  cups)",
        "1/4 cup chopped fresh basil leaves or 1 teaspoon dried basil, crumbled, plus, if desired, fresh whole basil leaves for garnish",
        "2 tablespoons unsalted butter",
        "1/2 cup heavy cream",
        "1/2 cup chicken broth",
        "1 cup freshly grated Parmesan",
        "8 asparagus stalks, trimmed and cut into 1-inch pieces  (about 2 cups)",
        "1 bunch of broccoli, the flowerets cut into 1-inch pieces (about 2  cups) and the stems reserved for another use",
        "2 small zucchini, scrubbed, trimmed, quartered, and cut into 1-inch  pieces (about 2 cups)",
        "1 cup shelled fresh or frozen petits pois (tiny peas)",
        "1 cup snow peas, trimmed and cut diagonally into 1-inch pieces",
        "dried pasta such as trenette (fettuccine with one ruffled edge)  or spaghetti",
        "1/4 pound prosciutto, cut into thin strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Vegetable",
        "Asparagus",
        "Broccoli",
        "Zucchini",
        "Spring",
        "Prosciutto",
        "Simmer",
        "Gourmet"
    ],
    "title": "Pasta with Spring Vegetables and Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/pasta-with-spring-vegetables-and-prosciutto-11769"
}
