{
    "directions": [
        "Coarsely grind coriander seeds, black peppercorns, fennel seeds, and Sichuan peppercorns in spice mill or with mortar and pestle. Place turkey on a large rimmed baking sheet and rub all over with oil and sprinkle cavity and all over outside with salt, then do the same with spice mixture. Let sit at room temperature at least 1 hour, or cover and chill up to 12 hours.",
        "If chilled, let sit at room temperature 1 hour before grilling.",
        "If using a charcoal grill, fill a chimney with charcoal and light. Once coals are covered with ash, spread half on each side of grill, leaving center empty. Set top grate on grill. If using smoking chips, scatter a handful evenly over coals. Place turkey on center of grate (do not allow any part of turkey to extend over coals). Cover grill. Insert an instant-read thermometer into hole in hood. Cook turkey, scattering a handful of chips evenly over coals every 20 minutes and rotating turkey every 30 minutes for even browning (lift grate with turkey on it and rotate 180°F each time), until an instant-read thermometer inserted into the thickest part of breast without touching bone registers 150°F, 75–90 minutes. Maintain grill temperature as close as possible to 350°F throughout process, opening vents to increase temperature and closing vents to reduce it and adding more charcoal as needed. Transfer turkey to a cutting board and let rest at least 30 minutes before carving.",
        "If using oven, preheat to 425°F. Place turkey on a large rimmed baking sheet. Roast, rotating baking sheet once, until skin is golden brown and most of fat in skin has rendered, 35–45 minutes. Reduce oven temperature to 250°F and continue to roast turkey until an instant-read thermometer inserted into the thickest part of breast without touching bone registers 150°F, about 45–60 minutes longer. Transfer turkey to a cutting board and let rest at least 30 minutes before carving."
    ],
    "ingredients": [
        "3 tablespoons coriander seeds",
        "2 tablespoons black peppercorns",
        "1 tablespoon fennel seeds",
        "1 tablespoon Sichuan peppercorns",
        "1 (6–8-pound) skin-on, bone-in turkey breast, patted dry",
        "1 tablespoon vegetable oil",
        "2 tablespoons kosher salt",
        "A spice mill or a mortar and pestle; a chimney starter and smoking chips (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Spice",
        "Coriander",
        "Fennel",
        "Pepper",
        "Dinner",
        "Fall",
        "Grill"
    ],
    "title": "Pastrami-Style Grilled Turkey Breast",
    "url": "http://www.epicurious.com/recipes/food/views/pastrami-style-grilled-turkey-breast"
}
