{
    "directions": [
        "In a bowl stir together gremolata ingredients.",
        "Preheat oven to 400°F.",
        "In a large shallow baking pan rub potatoes with 2 tablespoons oil and season with pepper and salt. Add garlic, rosemary, and thyme and roast potatoes in middle of oven, shaking pan occasionally, until they are tender but still retain their shape, about 30 minutes (depending on size of potatoes).",
        "Reduce temperature to 350°F.",
        "Peel roasted garlic. Drain trimmed artichokes and pat dry. Quarter artichoke halves lengthwise. In a large deep non-stick skillet warm remaining 4 tablespoons oil over moderately low heat and cook artichokes with garlic, stirring frequently, 5 minutes. Add pepper and salt to taste and 1 cup broth or water and cook, stirring occasionally, until artichokes are tender and most of liquid is evaporated, about 15 minutes. (If artichokes are not yet tender, add additional water or broth and continue cooking in same manner.)",
        "Add artichokes and garlic to potatoes and halve any larger potatoes. Heat vegetables in middle of oven until just heated through, about 10 minutes. While vegetables are heating, chop remaining herbs. Add chopped herbs, three fourths gremolata, and pepper and salt to taste and toss to combine well.",
        "Serve vegetables sprinkled with remaining gremolata."
    ],
    "ingredients": [
        "1 tablespoon finely grated fresh lemon zest",
        "3 tablespoons finely chopped fresh flat-leafed parsley or basil leaves",
        "2 teaspoons minced garlic",
        "2 pounds red potatoes (about 1 1/2 inches in diameter)",
        "6 tablespoons extra-virgin olive oil",
        "freshly ground black pepper",
        "3 unpeeled garlic cloves",
        "2 fresh rosemary sprigs",
        "2 fresh thyme sprigs",
        "6 large artichokes (about 4 pounds), trimmed Italian style",
        "1 to 1 1/2 cups vegetable broth or water",
        "1/2 cup packed fresh flat-leafed parsley leaves",
        "1/2 cup packed fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Potato",
        "Side",
        "Roast",
        "Passover",
        "Vegetarian",
        "Artichoke",
        "Spring",
        "Kosher",
        "Gourmet",
        "Vegan",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Patatine e Carciofi Arrosto roasted Potatoes and Artichokes",
    "url": "http://www.epicurious.com/recipes/food/views/patatine-e-carciofi-arrosto-br-roasted-potatoes-and-artichokes-101059"
}
