{
    "directions": [
        "Position oven rack in lowest 1/3 of oven. Preheat oven to 400 degrees F (200 degrees C).",
        "To Make Crust: In the bowl of a food processor combine 2 1/2 cups flour, 2 tablespoons white sugar, and salt. Blend briefly to combine ingredients. Cut in chilled butter and shortening using the \"pulse\" button of food processor, until mixture resembles coarse meal. Gradually blend in enough water to form moist clumps.",
        "Gather dough into a ball and divide in half. Flatten each half into disks, wrap in plastic, and rest in refrigerator. (Dough can be kept in refrigerator up to 3 days, or frozen.)",
        "To Make Filling: Chop 2 of the apples into large chunks. Cut the other 4 apples into 1/8 inch slices.",
        "Place the 2 chunked apples in food processor with 1/4 cup sugar and 1/4 teaspoon cinnamon. Blend until apples resemble applesauce.",
        "Place the 4 sliced apples in a large bowl. In a small bowl, mix brown sugar, 1/4 cup flour, nutmeg, allspice, and white sugar. Sprinkle over sliced apples, then add lemon juice, vanilla extract, and rum. Toss until apples are thoroughly coated. Set aside for 1/2 hour.",
        "Meanwhile, roll out 1 dough disk to 12 inches in diameter. Fit into a 9-inch deep-dish pie plate, allowing 1/2 inch overhang on edges. Place a circle of parchment paper or a flattened coffee filter in center of pie shell and cover with pie weights or dried beans.",
        "Bake pie shell in preheated oven for 10 to 15 minutes, until edges begin to brown. Remove pie weights or beans, and cool pie shell.",
        "Drain juices from apple slice mixture into a saucepan. Simmer just until liquid begins to thicken. Stir thickened juices into pureed apple mixture, and spread this mixture into bottom of pre-baked pie shell.",
        "Arrange apple slices over pureed apple layer, placing slices perpendicular to outside rim of pie plate, to form a \"rose\" style configuration, starting along outer edges and moving towards center.",
        "Roll out other half of pastry and cut out decorative leaf shapes. Brush each leaf with milk and arrange on top of pie and around edges of crust, placing milk side down. When finished, brush the top of all of pastry with milk, and sprinkle lightly with sugar. Cover outer rim of pastry with aluminum foil to prevent overbrowning.",
        "Place pie in preheated oven and bake 1 hour to 1 hour and 15 minutes, until juices bubble and crust browns. Remove aluminum foil 45 minutes into baking time to allow crust edges to brown."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "2 tablespoons white sugar",
        "1 teaspoon salt",
        "1/2 cup butter, chilled and diced",
        "1/2 cup shortening, chilled and diced",
        "5 tablespoons ice water",
        "6 Golden Delicious apples - peeled, cored and cut into 1/4 inch slices",
        "1/4 teaspoon ground cinnamon",
        "1/4 cup white sugar",
        "1/2 cup light brown sugar",
        "1/4 cup all-purpose flour",
        "1/2 teaspoon ground nutmeg",
        "1/4 teaspoon ground allspice",
        "1/2 cup white sugar",
        "1 tablespoon lemon juice",
        "1 teaspoon vanilla extract",
        "2 tablespoons dark rum",
        "2 tablespoons milk",
        "1 tablespoon white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pat's Rose Apple Pie",
    "url": "http://allrecipes.com/recipe/15884/pats-rose-apple-pie/"
}
