{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Heat olive oil in a large pot over medium-high heat. Saute onion and garlic in hot oil until soft and translucent, 5 to 7 minutes. Add ground beef to onion mixture; cook and stir until beef is browned and crumbly, 5 to 7 minutes. Stir salt, basil, oregano, rosemary, and ground black pepper into beef mixture.",
        "Whisk water and tomato paste together in a large bowl. Pour tomato paste mixture into beef mixture, bring to a simmer, and cook until sauce is slightly reduced and flavors blend, about 1 hour.",
        "Bring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Rinse in cold water and drain.",
        "Measure out 1 cup mozzarella cheese and set aside.",
        "Spread about 1/3 the sauce in the bottom of a 9 1/2x15-inch baking dish. Arrange lasagna noodles in a single layer over the sauce, top with 1/2 the ricotta cheese, and 1/2 the remaining mozzarella cheese. Spread 1/3 the sauce over the cheese, top with remaining lasagna noodles, 1/2 the ricotta cheese, and 1/2 mozzarella cheese. Spread last 1/3 the sauce over the top.",
        "Bake lasagna in the preheated oven for 25 minutes. Sprinkle reserved 1 cup mozzarella cheese over the top. Bake until cheese is melted and lasagna is heated through and bubbling, about 15 minutes more. Cool for 10 minutes."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "2 pounds lean ground beef",
        "2 teaspoons salt",
        "1 teaspoon dried basil",
        "1 teaspoon dried oregano",
        "1/2 teaspoon dried rosemary",
        "1/4 teaspoon ground black pepper",
        "5 cups hot water",
        "24 ounces tomato paste",
        "1 pound lasagna noodles",
        "1 pound shredded mozzarella cheese, divided",
        "8 ounces ricotta cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Paula's Lasagna",
    "url": "http://allrecipes.com/recipe/236714/paulas-lasagna/"
}
