{
    "directions": [
        "Bring chicken broth and butter to a boil in a large saucepan; reduce heat to low and slowly whisk in grits. Simmer grits until tender and chicken broth is absorbed, about 15 minutes. Remove from heat, stir Cheddar and Parmesan cheeses into grits until smooth, and cover. Keep grits warm.",
        "Cook and stir diced salt pork in a large dry skillet over medium-low heat until pork has rendered most of its fat, about 10 minutes; raise heat to medium-high and cook until the pork pieces are browned, stirring often, about 5 more minutes. Remove pork pieces with a slotted spoon and retain drippings in skillet.",
        "Spread pine nuts into skillet with salt pork drippings over medium heat and stir until fragrant and lightly browned, 3 to 5 minutes. Scoop pine nuts out of skillet with slotted spoon, retaining drippings in skillet, and stir nuts into grits.",
        "Place shrimp and garlic into the hot skillet; cook until shrimp are just opaque and bright pink, 1 to 2 minutes. Remove shrimp from skillet and leave most of the garlic in the pan. Stir tomatoes, red curry paste, dry mustard, dry horseradish, oregano, thyme, basil, and kosher salt into skillet, bring to a boil, and cook over medium-high heat until liquid is reduced by half, about 10 minutes. Stir shrimp back into skillet and toss with sauce.",
        "Serve grits topped with shrimp and sauce. If desired, top with browned salt pork pieces."
    ],
    "ingredients": [
        "3 cups chicken broth",
        "2 tablespoons butter",
        "1 cup coarsely ground grits",
        "1/4 cup shredded Cheddar cheese",
        "1/4 cup grated Parmesan cheese",
        "1/2 pound salt pork (skin removed), cut into 1/2-inch dice",
        "1/2 cup pine nuts",
        "1/2 pound fresh shrimp, peeled and deveined (31-40 count)",
        "4 cloves garlic, minced",
        "1 (28 ounce) can petite diced tomatoes, undrained",
        "1 teaspoon Thai red curry paste",
        "1/2 teaspoon dry mustard powder",
        "1/2 teaspoon dry powdered horseradish",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon dried thyme",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon Kosher salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Paul's Shrimp and Grits",
    "url": "http://allrecipes.com/recipe/220908/pauls-shrimp-and-grits/"
}
