{
    "directions": [
        "Preheat oven to 250°F. and line a baking sheet with parchment or foil.",
        "In a bowl with an electric mixer beat egg whites with salt and cream of tartar to soft peaks. Add sugar gradually, beating, and beat meringue to stiff peaks. Beat in vinegar, cornstarch, and vanilla.",
        "Onto prepared baking sheet spread meringue with the back of a spoon into 3 1/2- to 4-inch rounds, making them slightly higher around the edges to form shells. Bake meringues in lower third of oven 1 hour, or until crisp on outside but soft in middle.",
        "Peel parchment carefully form meringues and cool meringues on a rack. Meringues keep in an airtight container 1 day.",
        "Serve meringues topped with sorbet, whipped cream, and kiwis.",
        "In a small heavy saucepan combine sugar and water and bring to a boil, stirring until sugar is dissolved. Remove pan from heat.",
        "in a blender or food processor purée raspberries with Champagne, crème de cassis, and sugar syrup until smooth. Force purée through a fine sieve set over a bowl, pressing hard on solids, and stir in lemon juice.",
        "Chill mixture until cold and freeze in an ice-cream maker. Makes about 1 quart."
    ],
    "ingredients": [
        "4 large egg white",
        "1/4 teaspoon salt",
        "1/8 teaspoon cream of tartar",
        "1 cup sugar",
        "1 tablespoon distilled white vinegar",
        "1 tablespoon cornstarch",
        "1 teaspoon vanilla",
        "whipped cream, sweetened lightly if desired, as an accompaniment",
        "1 cup baby kiwis*, halved, or 3 regular kiwis, peeled and chopped",
        "*available at specialty foods shops and some supermarkets",
        "Kir Royale sorbet",
        "2/3 cup sugar",
        "2/3 cup water",
        "2 1/2 cups raspberries",
        "1 cup Champagne",
        "1/4 cup crème de cassis",
        "1 1/2 tablespoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Frozen Dessert",
        "Raspberry",
        "Kiwi",
        "Sparkling Wine",
        "Gourmet"
    ],
    "title": "Pavlovas with Kir Royale Sorbet and Kiwis",
    "url": "http://www.epicurious.com/recipes/food/views/pavlovas-with-kir-royale-sorbet-and-kiwis-11535"
}
