{
    "directions": [
        "Preheat oven to 350°F. Scatter sugar in a shallow baking dish and bake 10 minutes. After 8 minutes, using an electric mixer on medium-high speed, beat egg whites and cream of tartar in a large bowl until foamy.",
        "Remove sugar from oven and decrease temperature to 200°F. With the mixer running, gradually stream sugar into egg whites. Add salt and beat until stiff peaks form and bowl is barely warm to the touch. (Heads up: This can take as much as 10 minutes with a stand mixer and up to 20 minutes with a handheld mixer.) Scrape in vanilla seeds, reserve pod for another use, and beat just to combine.",
        "Scoop large spoonfuls of meringue onto 2 parchment-lined baking sheets to make 12 mounds. Make a slight indentation in the center of each mound with the back of the spoon, pushing out to create 3\"-diameter rounds. Top the border of meringues with nuts and/or poppy seeds, as desired.",
        "Bake meringues until dry and firm, about 2 hours and 15 minutes. Turn off oven and use a wooden spoon to prop door ajar. Let meringues cool completely in oven.",
        "Meringues can be made 1 day ahead. Store tightly wrapped at room temperature.",
        "Combine sugar and 2 cups berries in a medium bowl and mash together with a fork until sugar is dissolved and mixture is bright in color and pourable.",
        "Whisk cream in a medium bowl to medium peaks. Spoon whipped cream into centers of meringues, top with remaining berries, then drizzle with sauce.",
        "Berry sauce can be made 4 hours ahead. Store tightly covered at room temperature."
    ],
    "ingredients": [
        "1 1/4 cups sugar",
        "6 large egg whites",
        "Pinch of cream of tartar",
        "1/2 teaspoon kosher salt",
        "1 vanilla bean, split lengthwise, or 2 teaspoons vanilla extract",
        "3/4 cup chopped almonds, walnuts, or pistachios, and/or 3 tablespoons poppy seeds",
        "1/4 cup sugar",
        "36 ounces raspberries and/or blackberries (about 6 cups), divided",
        "1 1/4 cups heavy cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Wheat/Gluten-Free",
        "Blackberry",
        "Raspberry",
        "Almond",
        "Spring",
        "Summer",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pavlovas with Fresh Berries",
    "url": "http://www.epicurious.com/recipes/food/views/pavlovas-with-fresh-berries-56389721"
}
