{
    "directions": [
        "Whisk olive oil, Pecorino, and 1 tablespoon lemon juice in a medium bowl to blend. Season with salt, pepper, and more lemon juice, if desired. Set dressing aside.",
        "If using fresh fava beans, cook in a large saucepan of boiling salted water until tender, about 4 minutes. Using a slotted spoon, transfer to a colander set in a bowl of ice water (do not cook frozen beans). Drain and peel; place in a large bowl.",
        "Return water in saucepan to a boil; add asparagus and cook until just tender, about 4 minutes. Using tongs, transfer to colander in ice water.",
        "If using fresh peas, return water in saucepan to a boil; add peas and cook until tender, about 3 minutes (do not cook frozen peas). Drain; transfer to colander in ice water. Drain vegetables. Add to bowl with fava beans.",
        "Combine vegetable oil and shallot in a small saucepan over medium heat and cook, stirring occasionally, until shallot is golden brown and crisp, 10-12 minutes. Transfer shallot to a paper towel-lined plate.",
        "Add dressing to bowl with vegetables, season with salt and pepper, and toss to coat. Transfer salad to a serving platter and top with shallot and bacon.",
        "DO AHEAD: Dressing and vegetables can be prepared 1 day ahead. Cover separately and chill."
    ],
    "ingredients": [
        "3 tablespoons extra-virgin olive oil",
        "1 tablespoon finely grated Pecorino or Parmesan",
        "1 tablespoon (or more) fresh lemon juice",
        "Kosher salt, freshly ground pepper",
        "2 cups fresh fava beans (from about 2 pounds pods) or frozen fava beans, thawed",
        "2 bunches asparagus, trimmed, stalks peeled if thick",
        "1 cup shelled fresh peas (from about 1 pound pods) or frozen peas, thawed",
        "1/2 cup vegetable oil",
        "1 shallot, thinly sliced",
        "4 slices bacon, cooked and crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Cheese",
        "Side",
        "Easter",
        "Bacon",
        "Asparagus",
        "Pea",
        "Spring",
        "Shallot",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pea, Asparagus, and Fava Bean Salad",
    "url": "http://www.epicurious.com/recipes/food/views/pea-asparagus-and-fava-bean-salad-51155260"
}
