{
    "directions": [
        "Place flour, crystallized ginger, sugar, baking powder, grated egg yolk, and salt in processor; blend to combine. Add butter and process until mixture resembles coarse meal. Add 2/3 cup cream and process just until moist clumps begin to form. Turn dough out onto floured work surface and knead briefly just until dough comes together, about 4 turns. Divide dough into 8 equal portions. Shape each into 2-inch ball; flatten each to 3/4-inch thickness. DO AHEAD: Biscuits can be made 2 hours ahead. Cover and chill.",
        "Combine peaches and blackberries with sugar, crystallized ginger, and cornstarch in large bowl; toss to coat. Let stand until juices begin to form, tossing occasionally, about 30 minutes.",
        "Position rack in center of oven; preheat to 350°F. Butter 2-quart baking dish or 11x7x2-inch glass baking dish. Transfer fruit mixture to prepared dish. Place biscuits atop fruit mixture, spacing slightly apart. Brush biscuits with remaining 1 tablespoon cream; sprinkle with raw sugar.",
        "Bake cobbler until fruit mixture is bubbling thickly and biscuits are light golden, about 50 minutes. Cool cobbler 20 minutes. Serve warm with vanilla ice cream or whipped cream.",
        "* Also called turbinado or demerara sugar; available at most supermarkets and at natural foods stores."
    ],
    "ingredients": [
        "1 2/3 cups all purpose flour",
        "1/4 cup chopped crystallized ginger",
        "3 tablespoons sugar",
        "1 1/2 tablespoons baking powder",
        "1 hard-boiled egg yolk, finely grated on Microplane or small holes of box grater",
        "1/4 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "2/3 cup plus 1 tablespoon heavy whipping cream",
        "2 pounds peaches, halved, pitted, cut into 3/4-inch-thick slices (about 5 cups)",
        "1 1/2-pint container fresh blackberries",
        "1/4 cup sugar",
        "1/4 cup chopped crystallized ginger",
        "1 tablespoon cornstarch",
        "2 tablespoons raw sugar*",
        "Vanilla ice cream or lightlysweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Dessert",
        "Bake",
        "Fourth of July",
        "High Fiber",
        "Blackberry",
        "Peach",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach and Blackberry Cobbler with Crystallized Ginger",
    "url": "http://www.epicurious.com/recipes/food/views/peach-and-blackberry-cobbler-with-crystallized-ginger-242722"
}
