{
    "directions": [
        "In a saucepan, bring brandy or water just to a simmer and remove pan from heat. Add raisins and let stand, covered, 30 minutes. Drain raisins, discarding liquid.",
        "In a bowl of an electric mixer beat together butter and sugar until light and fluffy. Add a pinch of salt and eggs, 1 at a time, beating well after each addition, and beat in almonds, cracker crumbs, rum and vanilla until filling is just combined. Chill filling, covered, 1 hour, or until cold.",
        "Preheat oven to 350°F..",
        "Put phyllo sheet on wax paper and brush with some butter. Layer 2 more phyllo sheets over first in same manner and arrange peach half, cut side up, in center of phyllo. Put about 1 tablespoon raisins in cavity of peach half and, using a small spoon, top with some filling. Arrange another peach half on top of filling, cut side down, and sprinkle with 1 tablespoon sugar. Gather edges of phyllo together carefully, bunching up around peach, and press together to seal. (Do not stretch phyllo as it will split easily.) Brush bonbon all over with some remaining butter and arrange on a rack set on a baking sheet. Make 5 more peach bonbons in same manner with remaining phyllo sheets, butter, peaches, raisins, filling and sugar.",
        "Bake bonbons in middle of oven 20 minutes. Reduce temperature to 300F and bake bonbons 10 to 15 minutes more, or until a skewer pierces peach easily.",
        "Serve peach bonbons with whipped cream."
    ],
    "ingredients": [
        "1/2 cup brandy or water",
        "1/2 cup raisins",
        "1 stick plus 2 tablespoons (10 tablespoons) unsalted butter, softened",
        "6 tablespoons sugar",
        "2 large eggs",
        "2/3 cup coarsely chopped blanched almonds, toasted lightly",
        "1/2 cup fine graham cracker crumbs",
        "2 teaspoons rum",
        "1 teaspoon vanilla extract",
        "nine 17-by-12 inch phyllo sheets cut in half crosswise, stacked between 2 sheets of wax paper, and covered with a dampened kitchen towel",
        "1 stick (1/2 cup) unsalted butter, melted",
        "6 firm ripe peaches, halved and pitted",
        "6 tablespoons sugar",
        "Accompaniment: whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Dessert",
        "Bake",
        "Raisin",
        "Peach",
        "Almond",
        "Brandy",
        "Summer",
        "Chill",
        "Simmer",
        "Gourmet"
    ],
    "title": "Peach Bonbons",
    "url": "http://www.epicurious.com/recipes/food/views/peach-bonbons-14321"
}
