{
    "directions": [
        "Simmer chile in 2 cups water in a 1- to 2-quart saucepan, uncovered, turning over once or twice, until softened, 15 to 20 minutes. Transfer chile to a cutting board and discard cooking liquid.",
        "When cool enough to handle, stem and seed chile, then carefully peel off skin in large pieces and reserve.",
        "Transfer chile pulp to cleaned saucepan and add sugar, 1/2 cup raspberries, a pinch of salt, and remaining cup water. Bring to a boil over moderate heat, stirring until sugar is dissolved.",
        "Remove syrup from heat and cover pan with lid, then let steep, covered, 20 minutes.",
        "While syrup is steeping, pat chile skin dry and cut skin into very fine threads with a sharp knife.",
        "Pour syrup through a fine-mesh sieve into a bowl, pressing gently on solids (do not push solids through), then discard solids. Stir lemon juice into syrup.",
        "Halve peaches lengthwise, pit, and cut lengthwise into 1/4-inch-thick slices. Divide, along with remaining cup raspberries, among 4 shallow bowls and spoon syrup over fruit. Sprinkle with some chile threads."
    ],
    "ingredients": [
        "1 pliable dried ancho chile* (less than 1/2 oz)",
        "3 cups water",
        "1/2 cup sugar",
        "1 1/2 cups fresh raspberries (6 oz)",
        "1/2 teaspoon fresh lemon juice",
        "2 firm-ripe large peaches (preferably freestone)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pepper",
        "Dessert",
        "Quick & Easy",
        "Raspberry",
        "Peach",
        "Summer",
        "Vegan",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peaches and Raspberries in Ancho Syrup with Chile Threads",
    "url": "http://www.epicurious.com/recipes/food/views/peaches-and-raspberries-in-ancho-syrup-with-chile-threads-232512"
}
