{
    "directions": [
        "Combine cream, milk, and orange peel in heavy small saucepan. Bring to simmer. Remove from heat. Cover and let steep 15 minutes.",
        "Whisk yolks and sugar in medium bowl to blend. Gradually whisk warm milk mixture into yolk mixture; return to saucepan. Cook over medium-low heat until mixture coats back of spoon and leaves path when finger is drawn across, stirring constantly, about 7 minutes (do not boil). Pour into bowl. Chill until cold, whisking occasionally, about 3 hours. (Sauce can be made 1 day ahead. Keep chilled.)",
        "Line baking sheet with parchment paper and spray with nonstick spray. Roll out 1 pastry sheet to 14-inch square. Using 5-inch-diameter bowl as guide, cut out 4 circles. Transfer circles to prepared sheet; cover with plastic. Repeat with second pastry sheet. Transfer pastry circles to same baking sheet, placing atop plastic wrap. Freeze 10 minutes.",
        "Toss peaches, raspberries, 2 1/2 tablespoons sugar, flour, and lemon juice in medium bowl.",
        "Roll out pastry circles on lightly floured surface to 7-inch-diameter rounds. Place 1/4 cup fruit mixture in center of each round. Gather dough atop fruit and twist and pinch firmly to enclose completely. Place on large baking sheet. Freeze bundles at least 15 minutes. (Can be made 1 day ahead. Keep frozen.)",
        "Preheat oven to 400°F. Brush bundles all over with egg white, and sprinkle each with 1 teaspoon sugar. Bake until golden, about 22 minutes. Cool on baking sheet on rack at least 10 minutes.",
        "Place 2 tablespoons sauce in center of each of 8 plates. Place 1 bundle in center of each plate and serve warm."
    ],
    "ingredients": [
        "1/2 cup whipping cream",
        "1/2 cup whole milk",
        "1/2 teaspoon grated orange peel",
        "3 large egg yolks",
        "1/4 cup sugar",
        "Nonstick vegetable oil spray",
        "1 17.3-ounce package frozen puff pastry (2 sheets), thawed",
        "1 pound peaches, peeled, chopped",
        "1/2 cup fresh raspberries",
        "2 1/2 tablespoons plus 8 teaspoons sugar",
        "2 tablespoons all purpose flour",
        "1/2 teaspoon fresh lemon juice",
        "1 large egg white, whisked until frothy"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Raspberry",
        "Orange",
        "Peach",
        "Summer",
        "Phyllo/Puff Pastry Dough",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach-Raspberry Bundles with Orange Custard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/peach-raspberry-bundles-with-orange-custard-sauce-106979"
}
