{
    "directions": [
        "Place peach slices in large bowl; add lemon juice and toss gently. Set aside. Combine peach peels, pits, cream, milk and vanilla bean in heavy large saucepan and bring to simmer. Reduce heat to very low and barely simmer 20 minutes.",
        "Strain cream mixture into heavy medium saucepan. Whisk yolks and sugar in medium bowl to blend. Gradually whisk in hot cream. Return mixture to same saucepan; stir over medium-low heat until custard thickens and leaves path on back of spoon when finger is drawn across, about 7 minutes (do not boil). Strain into bowl. Mix in corn syrup. Chill custard until cold.",
        "Puree peach slices in processor. Add 1 cup custard; blend until smooth. Whisk into remaining custard. Transfer to ice cream maker; process according to manufacturer's instructions. Transfer to covered container and freeze. (Can be made 2 days ahead.)",
        "Scrape seeds from vanilla bean into heavy small saucepan; add bean. Add wine and sugar and stir over low heat until sugar dissolves. Increase heat and bring to boil Pour syrup into medium bowl. Refrigerate until cold. Add peaches to syrup and toss to coat.",
        "Serve ice cream with peaches."
    ],
    "ingredients": [
        "1 1/2 pounds peaches, peeled, pitted, sliced; peels and pits reserved",
        "2 tablespoons fresh lemon juice",
        "2 cups whipping cream",
        "1 cup milk (do not use low-fat or nonfat)",
        "1 1-inch piece vanilla bean, split lengthwise",
        "4 large egg yolks",
        "3/4 cup sugar",
        "1/2 cup light corn syrup",
        "1 2-inch piece vanilla bean, split lengthwise",
        "1/4 cup dry white wine",
        "3 tablespoons sugar",
        "4 peaches, peeled, pitted, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Fruit",
        "Dessert",
        "Frozen Dessert",
        "Peach",
        "Vanilla",
        "Summer"
    ],
    "title": "Peach Ice Cream with Vanilla-Scented Peaches",
    "url": "http://www.epicurious.com/recipes/food/views/peach-ice-cream-with-vanilla-scented-peaches-632"
}
