{
    "directions": [
        "1. Prepare the pie dough as directed through Step 4, rolling out the bottom crust to fit a 9-inch pie plate. Roll out the top crust and place it on a plate. Wrap both crusts and chill until ready to use.",
        "2. Combine the peaches, blackberries, lemon juice and salt; set aside. Combine the ginger, flour and brown sugar; toss with the fruits. Let rest for 1 hour. Preheat the oven to 350°F.",
        "3. Combine the egg white and water in a small bowl. Remove the pie crusts from the refrigerator. Brush some of the egg-white mixture over the bottom and sides of the bottom pie crust to prevent sogginess. Add the fruit filling, mounding the peaches in the center.",
        "4. Cover the filling with the top crust. Trim the overhang to 1 inch. With water, moisten the edges of the crusts where they meet, then press together lightly and turn under. Crimp the edges decoratively. Cut 6 decorative steam slits in the top crust. Brush the top crust lightly all over with the remaining egg-white mixture. Sprinkle lightly with the granulated sugar.",
        "5. Place the pie on the center rack of the oven and bake until it is golden and the juices are bubbling, about 60 to 70 minutes. Let the pie cool on a rack before serving just slightly warm or at room temperature."
    ],
    "ingredients": [
        "Easy Pie Crust for a 9-inch double-crust pie",
        "5 cups peeled and sliced ripe peaches",
        "1/4 cup fresh blackberries",
        "3 tablespoons fresh lemon juice",
        "Pinch of salt",
        "2 tablespoons ground crystallized ginger (a food processor or spice grinder may be used to grind the ginger)",
        "5 tablespoons all-purpose flour",
        "1/4 cup packed light-brown sugar",
        "1 egg white",
        "2 teaspoons water",
        "2 tablespoons granulated sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Dessert",
        "Bake",
        "Blackberry",
        "Peach",
        "Summer",
        "Parade"
    ],
    "title": "Peach Blackberry Pie",
    "url": "http://www.epicurious.com/recipes/food/views/peach-blackberry-pie-106870"
}
