{
    "directions": [
        "Preheat oven to 425°F.",
        "Stack phyllo between 2 sheets of wax paper and cover with a kitchen towel. In a very small saucepan melt butter. On a work surface brush 1 phyllo sheet with half of melted butter. Top buttered phyllo with a second phyllo sheet and brush with remaining butter. Sprinkle amaretti crumbs evenly over second phyllo sheet and top with remaining phyllo sheet. Cut phyllo stack into quarters and fit 1 quarter into each of four 3-inch tart pans with removable fluted rims. Fold in pastry overhang to form a shallow crumpled edge.",
        "Bake shells on a baking sheet in middle of oven until golden, about 15 minutes, and cool in pans on a rack. Shells may be made 1 day ahead and kept in tart pans, loosely covered, in a cool, dry place.",
        "Line a sieve with a double thickness of cheesecloth or a paper towel and set over a bowl. Drain yogurt in sieve, covered and chilled, at least 1 hour. Discard liquid and transfer yogurt to a bowl. Stir in sugar.",
        "Halve and pit peaches and cut into 1/2-inch-thick wedges. Transfer wedges to a small bowl. Halve passion fruit and scoop flesh and seeds into bowl. Stir in honey until combined well. Fruit mixture may be made 2 hours ahead and kept chilled, covered.",
        "Just before serving, remove shells from pans and divide yogurt among shells, smoothing tops. Top yogurt with fruit mixture."
    ],
    "ingredients": [
        "three 17- by 12-inch phyllo sheets, thawed if frozen",
        "1 tablespoon unsalted butter",
        "2 tablespoons crushed amaretti* (Italian almond macaroons)",
        "1 1/2 cups nonfat vanilla yogurt",
        "2 tablespoons sugar",
        "3 firm-ripe peaches",
        "1 passion fruit*",
        "1 teaspoon honey",
        "*available at specialty foods shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Cocktail Party",
        "Fourth of July",
        "Vegetarian",
        "Yogurt",
        "Peach",
        "Summer",
        "Shower",
        "Passion Fruit",
        "Party",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach and Passion-Fruit Phyllo Tarts",
    "url": "http://www.epicurious.com/recipes/food/views/peach-and-passion-fruit-phyllo-tarts-100748"
}
