{
    "directions": [
        "Pour the sugar into a medium high-sided saucepan, tilting the pan to distribute the sugar evenly across the bottom of the pan. Set the pan over medium-high heat. Use a rubber spatula to occasionally push the sugar from the outer edge of the pan toward the center. The sugar will clump up slightly, but just keep pushing it around a bit; it will eventually smooth out. When the sugar is dissolved and darkened to the color of a copper penny (about 5 to 7 minutes), add the butter and whisk until incorporated. Be careful: the mixture will bubble up when you add the butter and might even seem like it’s about to overflow the pan; just keep whisking and it will quickly settle back down.",
        "Take the pan off the heat and carefully add the cream in two stages, whisking until smooth and incorporated. Add the salt, vanilla, and bourbon, whisking to combine.",
        "Pour the caramel through a fine-mesh strainer into a bowl and cool completely to room temperature, about 2 hours, before using or transferring to an airtight container to store in the refrigerator. Return to room temperature before using.",
        "Roll out one disc of Magpie Dough for Flaky Piecrust into a 13-inch circle with an even thickness of 1/4 inch. Transfer dough to a 9-inch pie pan and trim overhang to 1 inch all the way around. Cover the bottom crust with plastic wrap and put the pan in the refrigerator while you roll the dough to the top shell.",
        "Roll out the second disk of pie dough to a 13-inch circle with an even thickness of 1/4 inch. Transfer dough to a parchment-lined baking sheet and using a pizza wheel, pastry cutter, or large knife, along with a ruler, cut dough into ten 1-inch-wide strips. Cover with plastic wrap and refrigerate while you work on the filling for the pie.",
        "Preheat the oven to 400°F (200°C) with a rack in the center. Line a rimmed baking sheet with parchment paper.",
        "In a large bowl, toss the peaches with the brown sugar, vanilla extract, and lemon juice. Let sit 5 minutes.",
        "In a small bowl, whisk together the granulated sugar, ground tapioca, cinnamon, and salt. Sprinkle the sugar mixture over the peaches and toss to combine. The mixture may look dry at first; let it sit at room temperature for 10 to 15 minutes to allow the sugar and lemon juice to draw more of the juices out of the fruit, then give it another good tossing to mix well and moisten all of the sugar and tapioca granules.",
        "Retrieve the prepared crust from the refrigerator and set the pan on the parchment-lined baking sheet. Pour the filling into the bottom shell. Use your index finger to scrape some of the syrupy fruit juices off the sides of the mixing bowl and generously moisten the top edge of the shell.",
        "Lay remaining dough strips on top of the pie in a lattice pattern, then roll and crimp the edges.",
        "Whisk the egg yolk with 1 tablespoon water. Lightly brush the lattice with the egg wash and sprinkle with sanding sugar. Transfer the baking sheet to the oven and bake the pie 25 minutes, then rotate the baking sheet, lower the oven temperature to 350°F (175°C), and bake 30 minutes more, or until the juices bubble up through the lattice. Tent the top with foil if the crust starts to over-brown.",
        "Set the baking sheet on a wire rack and let the pie cool and set uncovered, at room temperature, overnight (or up to 3 days) before slicing and serving. Serve with bourbon caramel sauce."
    ],
    "ingredients": [
        "2 cups (400 g) granulated sugar",
        "3/4 cup (170 g) unsalted butter",
        "1 1/4 cups (295 g) heavy cream, at room temperature",
        "1 teaspoon kosher salt",
        "3 teaspoons vanilla extract",
        "2 tablespoons bourbon",
        "1 recipe Magpie Dough for Flaky Piecrust, chilled overnight",
        "2 pounds (907 g) ripe peaches, each peeled, halved, pitted, and cut into 8 wedges",
        "1/2 cup (96 g) packed light brown sugar",
        "1 tablespoon vanilla extract",
        "1 tablespoon freshly squeezed lemon juice",
        "1/2 cup (96 g) granulated sugar",
        "3 tablespoons finely ground instant tapioca (ground using a spice grinder)",
        "1/2 teaspoon ground cinnamon",
        "1/8 teaspoon fine salt",
        "1 large egg yolk",
        "2 tablespoons sanding sugar or coarse raw sugar, for sprinkling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Pie",
        "Bake",
        "Peach",
        "Bourbon",
        "Whiskey",
        "Tapioca",
        "Butterscotch/Caramel",
        "Labor Day"
    ],
    "title": "Peach Lattice Pie With Bourbon Caramel",
    "url": "http://www.epicurious.com/recipes/food/views/peach-lattice-pie-with-bourbon-caramel"
}
