{
    "directions": [
        "Cook sugar, corn syrup, and 1/4 cup water in a small deep saucepan over medium heat, stirring occasionally, until sugar is dissolved. Increase heat and boil without stirring (stirring causes sugar crystals to form, making the caramel grainy), occasionally swirling pan and brushing down sides with a wet pastry brush to dissolve sugar crystals, until syrup turns a deep amber color, 7-8 minutes. Remove from heat; immediately and carefully add cream (mixture will bubble vigorously). Add butter and salt and whisk until smooth. Let cool slightly. DO AHEAD: Caramel can be made 1 week ahead. Let cool completely. Transfer to a small bowl, cover, and chill. Rewarm slightly before serving.",
        "Combine Riesling, sugar, and 2 cups water in a large saucepan; scrape in seeds from vanilla bean; add bean. Bring to a boil. Add peaches; bring to a simmer. Cook over medium heat, turning once or twice, until tender when pierced with a sharp knife but still holding their shape, 5-7 minutes.",
        "Transfer mixture to a large bowl. Let peaches cool completely in liquid. Cover; chill until cold, about 2 hours. DO AHEAD: Can be made 1 day ahead. Keep chilled.",
        "Remove peaches from liquid. Working with 1 peach at a time, use a paring knife to make a small nick in the skin. Hold the skin between the knife and your thumb and pull off skin in strips; discard skin. Place 1-2 peach halves in each serving glass or bowl; top with ice cream and raspberries. Drizzle caramel sauce over."
    ],
    "ingredients": [
        "1 cup sugar",
        "1 tablespoon light corn syrup",
        "1/2 cup heavy cream",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1/2 teaspoon kosher salt or coarse sea salt",
        "2 cups sweet Riesling or other sweet wine (not dessert wine)",
        "1/4 cup sugar",
        "1/2 vanilla bean, split lengthwise",
        "4 large peaches, halved, pitted",
        "1 pint vanilla ice cream",
        "2 6-ounce containers fresh raspberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Fruit",
        "Dessert",
        "Raspberry",
        "Peach",
        "Vanilla",
        "Summer",
        "Anniversary",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach Melba with Burnt Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/peach-melba-with-burnt-caramel-sauce-51108610"
}
