{
    "directions": [
        "Beat whipping cream with 5 tablespoons sugar and vanilla until stiff peaks form. Cover and refrigerate.",
        "Mix lemon juice with 1 tablespoon sugar in medium bowl. Peel and pit peaches. Slice thinly into bowl. Toss to coat with lemon mixture.",
        "Preheat oven to 375°F. Combine flour, baking powder, salt and remaining 4 tablespoons sugar in large bowl. Using fingertips or fork, work in shortening and butter until mixture resembles coarse meal. Add 1/2 cup milk and stir just until dry ingredients gather together, adding more milk 1 tablespoon at a time if mixture is dry.",
        "Transfer dough to floured surface and knead 3 times. Divide into 4 equal pieces. Pat first piece of dough into 1-inch-thick round. Place on ungreased cookie sheet. Mark an X on top of round using sharp knife. Repeat with remaining dough. Bake until patty-cakes are light brown, about 22 minutes. Cool on sheet 5 minutes.",
        "Split warm patty-cakes crosswise. Place bottom halves into deep bowls. Spoon peaches and juices from bowl over each, dividing evenly. Top each with some whipped cream. Cover with tops. Spoon more cream over and serve."
    ],
    "ingredients": [
        "1 cup chilled whipping cream",
        "10 tablespoons sugar",
        "1/4 teaspoon vanilla extract",
        "1 tablespoon fresh lemon juice",
        "4 firm ripe peaches",
        "1 1/2 cups all purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/4 cup chilled solid vegetable shortening, cut into small pieces",
        "3 tablespoons chilled unsalted butter, cut into small pieces",
        "1/2 cup (or more) cold milk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Cake",
        "Milk/Cream",
        "Fruit",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Bake",
        "Peach",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach Patty-Cakes with Cream",
    "url": "http://www.epicurious.com/recipes/food/views/peach-patty-cakes-with-cream-2379"
}
