{
    "directions": [
        "In a small saucepan cook the butter over moderate heat until it is golden brown, being careful not to let it burn, let it cool, and chill it just until it is no longer liquid. (The butter may be browned 1 day in advance and kept covered and chilled. Let the butter soften at room temperature before using.) In a bowl cream together the browned butter, the granulated sugar, and the brown sugar and beat in the egg, the vanilla, and the almond extract. Into the bowl sift the flour, the baking powder, and the salt and beast the dough until it is just combined. Chill the dough for 30 minutes and press it onto the bottom and side of a 9-inch tart pan with a removable fluted rim.",
        "In a saucepan of boiling water blanch the peaches for 1 minute, drain them, and refresh them under cold water. Peel the peaches, halve them, and cut 3 of the halves into 1/8-inch-thick slices, reserving the remaining half for another use. Arrange the slices decoratively, overlapping them slightly, in the shell, sprinkle them with the sugar, and bake the kuchen in the lower third of a preheated 375°F. for 20 minutes. Arrange the raspberries decoratively over the peaches and bake the kuchen for 10 minutes more. Transfer the kuchen to a rack, brush the fruit with the jelly, and let the kuchen cool for 15 minutes. Remove the rim of the pan and serve the kuchen warm or at room temperature."
    ],
    "ingredients": [
        "1 stick (1/2 cup) unsalted butter",
        "1/3 cup granulated sugar",
        "2 tablespoons light brown sugar",
        "1 large egg",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon almond extract",
        "1 1/2 cups all-purpose flour",
        "1 teaspoon double-acting baking powder",
        "3/4 teaspoon salt",
        "2 firm-ripe peaches",
        "2 tablespoons sugar",
        "1/2 pint raspberries",
        "1/4 cup currant jelly, melted and cooled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Currant",
        "Raspberry",
        "Peach",
        "Chill",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach Raspberry Küchen",
    "url": "http://www.epicurious.com/recipes/food/views/peach-raspberry-kuchen-10542"
}
