{
    "directions": [
        "Preheat oven to 425°F with rack in upper third. Butter a large baking sheet.",
        "Bring butter, water, and salt to a boil in a small heavy saucepan over high heat, stirring until butter is melted. Reduce heat to medium. Add flour all at once and cook, beating with a wooden spoon, until mixture pulls away from side of pan and forms a ball, about 30 seconds. Transfer mixture to a large bowl and cool slightly, about 5 minutes. Add eggs 1 at a time, beating well with an electric mixer at high speed after each addition.",
        "Transfer mixture to pastry bag and pipe 8 (5-inch-long) strips (about 1 inch wide) onto baking sheet, spacing them at least 1 inch apart.",
        "Bake éclairs 15 minutes, then reduce temperature to 400°F and continue to bake until golden, puffed, and crisp, about 15 minutes more (leave oven on). Immediately pierce side of each éclair with tip of a paring knife and return to oven to dry, propping door slightly ajar, 5 minutes. Halve an éclair horizontally: If still moist inside, return éclairs to oven and dry 5 minutes more. Cool éclairs completely on a rack, about 25 minutes.",
        "Heat sugar in a 10-inch heavy skillet over medium heat, stirring with a fork to heat sugar evenly, until it starts to melt, then stop stirring and cook, swirling skillet occasionally so sugar melts evenly, until it is a dark amber. Remove from heat and immediately spoon about 1 teaspoon of caramel along top of each éclair, spreading it with back of spoon. Add water and salt to remaining caramel in skillet and simmer, stirring occasionally, until all of caramel is dissolved. Add butter and bourbon, swirling skillet to incorporate. Remove from heat and keep sauce warm, covered.",
        "Cut peaches into thin wedges and toss with 1 tablespoon sugar. Let stand until sugar is dissolved, about 5 minutes.",
        "Meanwhile, beat cream with bourbon and remaining tablespoon sugar using cleaned beaters until it just holds stiff peaks.",
        "Halve éclairs horizontally. Put bottom halves of éclairs on plates and top with whipped cream and peaches, then cover with top halves of éclairs. Drizzle plates with caramel sauce."
    ],
    "ingredients": [
        "6 tablespoons unsalted butter",
        "3/4 cup water",
        "1/4 teaspoon salt",
        "3/4 cup all-purpose flour",
        "3 large eggs",
        "1 cup sugar",
        "1/2 cup water",
        "1/8 teaspoon salt",
        "1/2 stick unsalted butter, cut into 4 pieces",
        "2 tablespoons bourbon or dark rum",
        "1 pound firm-ripe peaches or nectarines",
        "2 tablespoons sugar, divided",
        "1 1/4 cups chilled heavy cream",
        "1 teaspoon bourbon or dark rum",
        "Equipment: a large pastry bag fitted with a 3/4-inch plain tip"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Peach",
        "Summer",
        "Pastry",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peaches 'n' Cream Eclairs with Bourbon Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/peaches-n-cream-eclairs-with-bourbon-caramel-sauce-238976"
}
