{
    "directions": [
        "Make the crust: Combine the flour, granulated sugar and salt in a food processor and pulse a few times. Scatter the butter and shortening over the flour mixture and pulse until it resembles coarse meal. Gradually add 4 to 7 tablespoons ice water, pulsing until the dough just comes together. Remove the dough from the machine and lightly knead on a flat surface to form a disk. Wrap the dough in plastic wrap and refrigerate at least 1 hour. Position a rack in the bottom of the oven and preheat to 375 degrees F.",
        "Make the filling: Combine the peaches, brown and granulated sugars, cinnamon, ginger, nutmeg, peach eau de vie and cornstarch or tapioca in a large bowl and mix until well combined. Toss the blackberries with the cassis in a separate bowl. Let sit 10 minutes, then use a slotted spoon to spoon the berries into the peach mixture and toss. Divide the chilled dough in half and roll out each half into a 13-to-14-inch round on a lightly floured surface. Transfer one of the rounds to a 9-inch deep-dish pie plate. Spoon the fruit into the crust using a slotted spoon; add some of the juices that have accumulated in the bowl (about 1/4 cup). Scatter the butter over the top. Roll up the remaining dough round on the rolling pin, then unroll it on top of the filling. Trim the edges of both crusts to a 3/4-inch overhang. Fold the edges over; press to seal and crimp the edges. Cut 6 slits in the top crust to allow steam to escape. Brush the top of the pie with the cream and sprinkle with the turbinado sugar. Place the pie on a baking sheet and bake on the bottom oven rack until the crust is golden and the juices bubble thickly through the slits, 1 hour, 20 minutes to 1 hour, 30 minutes. (Cover the crust's edge with foil if it browns too quickly.) Let the pie cool about 3 hours before serving. Photograph by Steve Giralt"
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour, plus more for dusting",
        "2 tablespoons granulated sugar",
        "1/2 teaspoon salt",
        "10 tablespoons (1 1/4 sticks) cold unsalted butter, cut into 1/2-inch cubes",
        "1/2 cup cold shortening, cut into pieces",
        "3 pounds mixed yellow and white peaches, peeled, pitted and sliced 1/2 inch thick",
        "1/3 to 1/2 cup packed light brown sugar",
        "1/3 to 1/2 cup granulated sugar",
        "1 1/2 teaspoons ground cinnamon",
        "1 1/4 teaspoons ground ginger",
        "1/2 teaspoon ground nutmeg",
        "2 tablespoons peach eau de vie (brandy)",
        "1/4 cup cornstarch or instant tapioca",
        "1 cup blackberries",
        "2 tablespoons cassis liqueur",
        "2 tablespoons cold unsalted butter, cut into small pieces",
        "2 to 3 tablespoons heavy cream",
        "2 to 3 tablespoons turbinado sugar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pie Recipes",
        "Fruit",
        "Peach Recipes",
        "Blackberry",
        "Summer"
    ],
    "title": "Peach-Blackberry Pie",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/peach-blackberry-pie-recipe2"
}
