{
    "directions": [
        "Blend first 5 ingredients in processor. Using on/off turns, cut in butter until coarse meal forms. Add 3 tablespoons ice water and vinegar; using on/off turns, blend until moist clumps form, adding more water if dough is dry. Gather dough into ball. Flatten into disk. Wrap in plastic; chill at least 1 hour and up to 1 day.",
        "Roll out dough on lightly floured surface to 11-inch round. Transfer to rimless baking sheet. Cover and refrigerate while preparing filling.",
        "Preheat oven to 425°F. Stir sugar and 3 tablespoons water in heavy ovenproof (preferably cast-iron) 9-inch-diameter skillet with 2-inch-high sides over medium heat until sugar dissolves. Increase heat to high and boil without stirring until syrup turns light amber color, occasionally swirling pan and brushing down sides of pan with wet pastry brush, about 6 minutes. Turn off heat. Add butter; stir until melted and smooth. Cool 2 minutes. Place 1 peach half, rounded side down, in center of pan. Arrange peach quarters close together, rounded side down, in concentric circles around peach half. Press remaining peach half and quarters, rounded side down, atop first layer. Cook over medium heat until caramel is bubbling thickly, about 20 minutes.",
        "Place chilled pastry atop hot fruit. Let stand 3 minutes to soften. Tuck dough edges around fruit. Bake tart until crust is golden and filling thickens and darkens, about 30 minutes. Cool in pan on rack 10 minutes. Place platter atop skillet. Using oven mitts, invert tart onto platter. Serve warm with whipped cream."
    ],
    "ingredients": [
        "1 2/3 cups all purpose flour",
        "2 tablespoons sugar",
        "1 teaspoon grated orange peel",
        "1/8 teaspoon baking powder",
        "1/8 teaspoon salt",
        "9 tablespoons chilled unsalted butter, cut into small pieces",
        "3 tablespoons (or more) ice water",
        "1 1/2 teaspoons apple cider vinegar",
        "3/4 cup sugar",
        "3 tablespoons water",
        "1/4 cup (1/2 stick) unsalted butter, cut into small pieces, room temperature",
        "3 pounds peaches, peeled; 1 peach halved, remainder quartered",
        "Whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Peach",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach Tarte Tatin",
    "url": "http://www.epicurious.com/recipes/food/views/peach-tarte-tatin-106989"
}
