{
    "directions": [
        "Blend flour and salt in processor 5 seconds. Add butter and shortening. Using on/off turns, blend until butter is reduced to pea-size pieces. Add 2 tablespoons ice water; blend until moist clumps form, adding more water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic; chill at least 2 hours and up to 1 day.",
        "Combine all ingredients in medium bowl. Stir until small clumps form. Chill up to 1 day.",
        "Combine sugar and cream in heavy large nonstick skillet. Bring medium saucepan of water to boil. Drop 3 peaches into water and blanch 1 minute. Transfer peaches to bowl of ice water. Peel peaches and slice thinly, letting slices drop into sugar-cream mixture in skillet. Repeat with remaining peaches. Cook peach filling in skillet over medium-high heat until peaches are tender and sugar-cream mixture is reduced almost to glaze, stirring often, about 10 minutes. Set aside.",
        "Preheat oven to 375°F. Roll out dough to 14-inch round. Transfer dough to 9-inch-diameter glass pie dish. Trim overhang to 3/4 inch; fold under and crimp. Pierce crust with fork; freeze 10 minutes. Line crust with foil and beans or pie weights; bake 10 minutes. Remove foil and beans and bake crust until pale golden, pressing with back of fork if crust bubbles, about 10 minutes longer.",
        "Spoon peach filling into warm crust. Sprinkle with topping. Bake pie until filling bubbles and topping is golden brown, placing baking sheet under pie to catch any drippings, about 50 minutes. Cool pie on rack at least 30 minutes."
    ],
    "ingredients": [
        "1 1/4 cups all purpose flour",
        "1/4 teaspoon salt",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1/4 cup solid vegetable shortening, frozen, cut into 1/2-inch cubes",
        "2 tablespoons (or more) ice water",
        "1/2 cup sugar",
        "1/2 cup chopped pecans",
        "1/3 cup all purpose flour",
        "1/4 cup old-fashioned oats",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "1/2 cup sugar",
        "3 tablespoons whipping cream",
        "3 pounds medium peaches"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fruit",
        "Dessert",
        "Bake",
        "Peach",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peaches-and-Cream Streusel Pie",
    "url": "http://www.epicurious.com/recipes/food/views/peaches-and-cream-streusel-pie-105190"
}
