{
    "directions": [
        "Mix together the flour, 2 tablespoons of sugar, and a pinch of salt in a large bowl. Cut the shortening into the flour mixture until the mixture resembles coarse crumbs. Beat the egg in a small bowl, and pour it into a 1-cup measuring cup. Pour in enough cold water to total 1 cup, and mix the water and egg into the dough. Mix the dough a few times with your fingers, until it holds together. Divide the dough in half.",
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Whisk together 3/4 cup of water with the cornstarch in a bowl until smooth, and set aside. Mix 1/2 cup of water with 3/4 cup of sugar in a large saucepan until the sugar has dissolved, and bring to a boil. Whisk the cornstarch mixture into the boiling sugar mixture until thickened and translucent, whisking constantly, about 1 minute; whisk in 1/4 teaspoon of salt and lemon juice, if desired. Combine with the sliced peaches.",
        "Roll half the crust out on a floured surface in a rectangle shape about 12 by 20 inches, and fit the pastry into a 10x15-inch jelly roll pan. Roll the second half of the crust out to the same size as the first crust. Pour the peach filling into the bottom crust, and place the top crust on the pie. Crimp and fold the edges to seal, and cut several slits into the top crust.",
        "Bake in the preheated oven until the crust is browned and the filling is bubbling, 45 minutes to 1 hour. Allow to cool completely to let the filling set up before slicing into squares to serve."
    ],
    "ingredients": [
        "4 cups all-purpose flour",
        "2 tablespoons white sugar",
        "1 pinch salt",
        "1 1/2 cups vegetable shortening",
        "1 egg",
        "cold water, or as needed",
        "1 1/4 cups water, divided",
        "1/4 cup cornstarch",
        "3/4 cup white sugar",
        "1/4 teaspoon salt (optional)",
        "1 tablespoon lemon juice (optional)",
        "4 cups fresh peaches - peeled, pitted, and sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Peach Finger Pie",
    "url": "http://allrecipes.com/recipe/218944/peach-finger-pie/"
}
