{
    "directions": [
        "Cut butter into bits and freeze. In a food processor pulse together flour, sugar, and salt. Add frozen butter and pulse mixture just until it resembles coarse meal. Add 4 tablespoons ice water and pulse until barely combined. Transfer dough to a bowl and stir in just enough ice water to form a ball. Flatten dough into a 6-inch disk. Chill dough, wrapped in plastic wrap, at least 2 hours and up to 1 day.",
        "In food processor blend filling ingredients until very smooth. Filling may be made 1 day ahead and chilled, covered. Bring filling to room temperature before using.",
        "Halve dough. On a lightly floured surface roll out 1 piece of dough (keeping other piece chilled) into a 12-inch square (about 1/8 inch thick). Using a 5-inch saucer or plate as a guide, cut out 4 rounds and transfer to a baking sheet. Roll and cut out 4 more rounds from remaining dough in same manner, transferring to another baking sheet. Prick rounds all over with a fork and chill 30 minutes.",
        "Preheat oven to 375°F.",
        "Halve and pit peaches and slice thin. Spread each round evenly with about 1 1/2 tablespoons filling, leaving about a 1/4-inch border, and arrange peach slices, overlapping slightly, over filling. Cut butter into bits. Sprinkle each tart with about 1/2 tablespoon sugar and dot with butter. Bake tarts in upper and lower thirds of oven, switching position of sheets halfway through baking, 25 to 35 minutes, or until crusts are golden and peaches are tender.",
        "Serve tarts warm with accompaniments."
    ],
    "ingredients": [
        "1 stick (1/2 cup) plus 2 tablespoons unsalted butter",
        "8 ounces (2 cups) unbleached pastry flour* (not whole-wheat)",
        "1 tablespoon sugar",
        "1/4 teaspoon salt",
        "4 to 6 tablespoons ice water",
        "3/4 cup sliced blanched almonds (about 2 1/2 ounces)",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1/4 cup sugar",
        "1 large egg yolk",
        "1/4 teaspoon almond extract",
        "4 firm-ripe peaches",
        "3 tablespoons unsalted butter",
        "1/4 cup sugar",
        "vanilla or honey ice cream",
        "raspberry sauce",
        "raspberries",
        "*Available at specialty foods shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Peach",
        "Almond",
        "Summer",
        "Chill",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach Tart",
    "url": "http://www.epicurious.com/recipes/food/views/peach-tart-14190"
}
