{
    "directions": [
        "Position rack in center of oven and preheat to 375°F. Place foil-lined baking sheet in bottom of oven to catch any spills. Roll out 1 pie crust disk on lightly floured surface to 13 1/2-inch round. Transfer to 9-inch-diameter glass pie dish. Trim overhang to 1 inch. Fold edges under and crimp decoratively, forming high rim (about 1/2 inch above sides of dish). Chill crust 30 minutes. Line crust with foil; fill with dried beans. Bake crust until sides are set and pale golden, about 35 minutes. Transfer to rack; remove foil and beans. Brush warm crust with egg white. Cool completely.",
        "Meanwhile, line another baking sheet with parchment paper. Roll out second pie crust disk on floured surface to 13 1/2-inch round. Cut into 3/4-inch-wide strips. Place strips on prepared baking sheet. Chill while preparing filling.",
        "Combine 1/2 cup sugar, cinnamon, and salt in large bowl. Add peaches and lemon juice and toss gently to coat. Let stand 30 minutes.",
        "Meanwhile, stir remaining 1/2 cup sugar and 1/4 cup water in medium saucepan over medium heat until sugar dissolves. Increase heat; boil without stirring until syrup is deep amber, occasionally swirling pan and brushing down sides with wet pastry brush, about 11 minutes. Remove from heat. Add butter and cream (mixture will bubble vigorously); stir caramel until smooth. Strain juices from peaches into caramel; cool to lukewarm. Preheat oven to 375°F. Add caramel and flour to peaches in bowl; toss gently. Transfer filling to crust, mounding in center.",
        "Arrange 6 dough strips in 1 direction across top of pie, spacing apart. Working with 1 strip at a time, arrange 6 more strips in opposite direction atop first, lifting strips and weaving over and under, forming lattice. Gently press ends of strips to edge of baked bottom crust to adhere. Trim overhang. Brush lattice strips (but not crust edge) with egg yolk glaze. Sprinkle strips with cinnamon sugar.",
        "Bake pie 35 minutes. Tent pie loosely with foil to prevent overbrowning. Continue to bake pie until filling bubbles thickly and lattice is golden brown, about 25 minutes longer. Cool pie on rack."
    ],
    "ingredients": [
        "2 Tender Pie Crust dough disks",
        "1 egg white, beaten to blend",
        "1 cup sugar, divided",
        "1/2 teaspoon (scant) ground cinnamon",
        "Pinch of salt",
        "3 1/2 pounds firm but ripe peaches, peeled, halved, pitted, each half cut into 3 wedges",
        "1 tablespoon fresh lemon juice",
        "1/4 cup water",
        "2 tablespoons (1/4 stick) unsalted butter",
        "2 tablespoons whipping cream",
        "3 tablespoons all purpose flour",
        "1 egg yolk, beaten to blend with 2 teaspoons water (glaze)",
        "1 tablespoon sugar mixed with 1/4 teaspoon ground cinnamon (cinnamon sugar)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fruit",
        "Dessert",
        "Bake",
        "Fourth of July",
        "Back to School",
        "Lemon",
        "Peach",
        "Fall",
        "Summer",
        "Cinnamon",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach Lattice Pie",
    "url": "http://www.epicurious.com/recipes/food/views/peach-lattice-pie-232395"
}
