{
    "directions": [
        "Finely grind cookies in a food processor (you should have about 1 1/3 cups). Transfer crumbs to a medium bowl. Add butter and cream; stir to coat. Press firmly onto bottom and up sides of a 9\" pie dish. Chill until firm, at least 30 minutes.",
        "Toss 1 3/4 cups blueberries, sugar, and lemon juice in a medium bowl; let macerate at room temperature for at least 1 hour.",
        "Transfer blueberry mixture to a large heavy saucepan and cook over medium heat until berries soften and juices are released, 10-15 minutes. Strain berries through a fine-mesh sieve into a medium bowl. Cover and chill juices and berries separately until cold.",
        "Mix softened ice cream with chilled cooked blueberries. Scrape ice cream mixture into crust; smooth top. Freeze until firm, at least 6 hours. DO AHEAD: Pie can be made 2 days ahead. Cover and keep frozen.",
        "Soften pie in refrigerator for 10 minutes before serving. Top with whipped cream; scatter remaining 1/4 cup fresh blueberries over. Garnish with ginger. Drizzle each slice with reserved blueberry juices."
    ],
    "ingredients": [
        "6 ounces gingersnap cookies",
        "2 tablespoons unsalted butter, melted",
        "1 tablespoon heavy cream",
        "2 cups fresh blueberries, divided",
        "1/3 cup sugar",
        "1/4 cup fresh lemon juice",
        "1 pint peach ice cream, softened in refrigerator for 20 minutes",
        "2 cups whipped cream (made from 1 cup heavy cream)",
        "1/4 cup chopped crystallized ginger"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Ginger",
        "Dessert",
        "Freeze/Chill",
        "Fourth of July",
        "Kid-Friendly",
        "Frozen Dessert",
        "Blueberry",
        "Summer",
        "Birthday",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach-Blueberry Ice Cream Pie",
    "url": "http://www.epicurious.com/recipes/food/views/peach-blueberry-ice-cream-pie-395920"
}
