{
    "directions": [
        "Preheat oven to 400°F. Line large baking sheet with parchment paper. Mix 1/4 cup sugar and orange peel in small bowl, mashing peel with back of spoon until mixture is pale orange.",
        "Whisk flour, cornmeal, brown sugar, baking powder, and salt in large bowl. Add butter; rub in with fingertips until mixture forms coarse meal. Add 2/3 cup milk; stir with fork until dough is evenly moistened, adding more milk by tablespoonfuls if dry. Drop dough by 1/3 cupfuls onto prepared sheet, forming 8 mounds and spacing 1 1/2 inches apart. Using fingertips, flatten each biscuit to 2-inch round. Sprinkle with orange sugar.",
        "Bake biscuits until golden brown and tester inserted into centers comes out clean, about 18 minutes; transfer to rack. (Can be made 8 hours ahead. Cool completely. Store airtight at room temperature.)",
        "Toss peaches, 1/3 cup sugar, and vanilla in large bowl; let stand 15 minutes, tossing occasionally.",
        "Using electric mixer, beat cream and sugar in medium bowl until peaks form.",
        "Using serrated knife, cut each biscuit horizontally in half. Place bottom halves on plates. Spoon peaches and their juices onto each biscuit. Top with whipped cream and biscuit tops."
    ],
    "ingredients": [
        "1/4 cup sugar",
        "1 1/2 teaspoons grated orange peel",
        "1 1/2 cups all-purpose flour",
        "1/2 cup yellow cornmeal",
        "3 tablespoons (packed) golden brown sugar",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/4-inch pieces",
        "2/3 cup (or more) whole milk",
        "2 pounds peaches, peeled, pitted, cut into 1/2-inch-thick slices",
        "1/3 cup sugar",
        "1/2 teaspoon vanilla extract",
        "1 cup chilled whipping cream",
        "3 tablespoons powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Fruit",
        "Breakfast",
        "Dessert",
        "Bake",
        "Orange",
        "Peach",
        "Cornmeal",
        "Summer"
    ],
    "title": "Peaches and Cream Shortcakes with Cornmeal-Orange Biscuits",
    "url": "http://www.epicurious.com/recipes/food/views/peaches-and-cream-shortcakes-with-cornmeal-orange-biscuits-108317"
}
