{
    "directions": [
        "Preheat oven to 350°F with rack in middle. Invert bottom of springform pan (to make it easier to slide semifreddo off bottom), then lock on side and oil pan.",
        "Stir together ground amaretti and melted butter in a bowl until combined well, then press evenly over bottom and up side of springform pan. Bake until crust is firm and a shade darker, about 10 minutes. Cool completely in pan on a rack, 20 to 30 minutes. Leave oven on.",
        "Spread nuts in a shallow baking pan and toast in oven, stirring once or twice, until fragrant and golden, about 10 minutes. Transfer nuts to a bowl. Lightly oil same baking pan.",
        "Cook sugar in a heavy medium skillet over medium heat, stirring with a fork to heat sugar evenly, until it starts to melt, then stop stirring and cook, swirling skillet occasionally so sugar melts evenly, until it is a dark amber.",
        "Immediately stir in nuts, then pour mixture into oiled baking pan and let stand to harden and cool completely, about 15 minutes.",
        "Break praline into pieces, then pulse in cleaned food processor until finely chopped.",
        "Pit and coarsely chop peaches, with skins if desired, then purée in cleaned food processor with crushed vitaminutes C, 1/2 cup sugar, and 1/8 teaspoon salt. Force thourough a medium-mesh sieve set over a large metal bowl, pressing on and then discarding solids.",
        "Stir in egg yolks, then place bowl over a saucepan of barely simmering water and beat with mixer until mixture is thick and pale and registers 140°F on an instant-read thermometer, then beat 3 minutes more (do not let boil).",
        "Remove bowl from saucepan and set in a larger bowl of ice and cold water. Add almond extract and beat until cold, about 6 minutes.",
        "Beat cream with remaining 2 tablespoons sugar in another bowl using cleaned beaters until it just holds soft peaks.",
        "Fold one third of cream into peach mixture, then fold in praline and remaining cream gently but thoroughly. Pour mixture into cooled crust and freeze, covered with plastic wrap, until firm, at least 3 hours. Let stand in refrigerator 30 minutes to 1 hour before serving.",
        "Cut an X in bottom of each peach, then blanch in a medium saucepan of boiling water 10 seconds. Transfer with a slotted spoon to a bowl of ice and cold water to stop cooking. Peel peaches and cut into 1/2-inch wedges.",
        "Toss peaches with crushed vitaminutes C and sugar and let stand, stirring occasionally, until sugar is dissolved, about 10 minutes.",
        "Spoon peaches over semifreddo with a slotted spoon just before serving."
    ],
    "ingredients": [
        "1 (7-ounce) box amaretti (Italian almond macaroons; 16 paper-wrapped packets), finely ground in a food processor (1 1/4 cups)",
        "1/2 stick unsalted butter, melted",
        "1/4 cup coarsely chopped almonds with skin",
        "1/4 cup sugar",
        "1 1/4 pound firm-ripe peaches",
        "1 (500-mg) vitamin C tablet (ascorbic acid), crushed to a powder with back of a spoon",
        "1/2 cup plus 2 tablespoons sugar, divided",
        "6 large egg yolks",
        "3/8 teaspoon pure almond extract",
        "1 cup heavy cream",
        "1 pound firm-ripe peaches",
        "1 (500-mg) vitaminutes C tablet, crushed to a powder",
        "1/4 cup sugar, or to taste",
        "Equipment: a 9- to 9 1/2-inch (24-cm) round springform pan (2 inches deep); a handheld electric mixer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Peach",
        "Almond",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach Praline Semifreddo with Amaretti",
    "url": "http://www.epicurious.com/recipes/food/views/peach-praline-semifreddo-with-amaretti-238972"
}
