{
    "directions": [
        "Position rack in center of oven and preheat to 400°F. Line rimmed baking sheet with parchment paper. Whisk flour, 7 tablespoons sugar, baking powder, salt, and nutmeg in large bowl to blend. Add butter and rub in with fingertips until mixture resembles coarse meal. Gradually add buttermilk, tossing with fork until moist clumps form. Gather dough together; flatten dough on floured work surface to 3/4- to 1-inch-thick round. Using floured 3-inch round biscuit cutter or cookie cutter, cut out rounds. Gather dough scraps and flatten on work surface to 3/4- to 1-inch thickness; cut out additional rounds for a total of 6. Transfer shortcakes to prepared baking sheet. Whisk cream and remaining 1 tablespoon sugar in small bowl to blend. Brush cream mixture over tops of shortcakes.",
        "Bake shortcakes until tops begin to brown and tester inserted into center comes out clean, about 25 minutes. Transfer shortcakes to rack. do ahead Can be made 6 hours ahead. Let stand at room temperature. Rewarm in 350°F oven 5 minutes before assembling.",
        "Toss sliced peaches, blackberries, sugar, and salt in medium bowl; let stand while preparing blackberry cream.",
        "Rinse blackberries; moisture will enhance puree. Place in processor. Add sugar; puree until smooth. Strain mixture through fine strainer set over bowl, pressing on solids to extract as much liquid as possible. Discard solids.",
        "Using electric mixer, beat cream and vanilla in large bowl until peaks form. Fold 3/4 cup blackberry puree into whipped cream until incorporated. Reserve remaining blackberry puree for sauce.",
        "Cut shortcakes horizontally in half. Place 1 bottom half of each shortcake on each of 6 plates. Spoon filling over each, then generous amount of blackberry cream. Drizzle each with reserved blackberry puree. Cover with top halves of shortcakes and serve."
    ],
    "ingredients": [
        "2 1/3 cups all purpose flour",
        "8 tablespoons sugar, divided",
        "2 1/2 teaspoons baking powder",
        "1/2 teaspoon fine sea salt",
        "1/4 teaspoon ground nutmeg",
        "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "3/4 cup plus 2 tablespoons buttermilk",
        "1 tablespoon whipping cream",
        "2 pounds ripe peaches, peeled, pitted, sliced",
        "2 6-ounce containers blackberries",
        "1/3 cup sugar",
        "Pinch of fine sea salt",
        "2 6-ounce containers blackberries",
        "3/4 cup sugar",
        "1 3/4 cups chilled whipping cream",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Dairy",
        "Dessert",
        "Bake",
        "Peach",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach and Blackberry Shortcakes with Blackberry Cream",
    "url": "http://www.epicurious.com/recipes/food/views/peach-and-blackberry-shortcakes-with-blackberry-cream-235262"
}
