{
    "directions": [
        "Stir yeast and sugar into water until dissolved and let stand 5 minutes, or until foamy. Whisk together flour and salt in a bowl and add yeast mixture, stirring until a dough forms. Knead dough on a floured surface 5 minutes. Put in an oiled large bowl and turn to coat.",
        "Let rise, covered with plastic wrap, in a warm place until doubled in bulk, about 1 1/2 hours.",
        "While dough is rising, put pizza stone in lowest position of oven (on oven floor if gas, lowest rack position if electric; remove other racks in either case) and preheat oven to highest setting (500–550°F; allow about 1 hour to preheat with stone).",
        "Quarter dough on floured surface and dust with flour. Shape and stretch 2 pieces of dough into 7- by 5-inch ovals (keep remaining dough covered).",
        "Sprinkle baker's peel generously with flour and carefully transfer ovals to it. Jerk peel; if dough sticks, lift it and sprinkle flour underneath.",
        "Working quickly, brush ovals with some oil and top each with one fourth of peaches, prosciutto, cheese, and rosemary. Season with salt and pepper.",
        "Line up far edge of peel with far edge of stone and tilt peel, jerking it gently. When edge of first pizza touches stone, quickly pull back peel to completely transfer pizzas to stone (do not move pizzas).",
        "Bake until crisp and golden, 6 to 8 minutes. Slide peel under pizzas to remove from oven.",
        "Shape, top, and bake 2 more pizzas in same manner. Drizzle remaining oil over pizzas."
    ],
    "ingredients": [
        "1 (1/4-oz) package active dry yeast",
        "1 teaspoon sugar",
        "1 cup warm water (110–115°F)",
        "2 1/2 cups all-purpose flour",
        "1 teaspoon salt",
        "3 tablespoons extra-virgin olive oil",
        "1 1/2 firm-ripe peaches, cut into thin wedges and halved crosswise",
        "8 very thin prosciutto slices, torn into pieces",
        "3 oz soft mild goat cheese, crumbled",
        "2 teaspoons chopped fresh rosemary",
        "Special equipment: a pizza stone and baker's peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Cheese",
        "Bake",
        "Kid-Friendly",
        "Quick & Easy",
        "Goat Cheese",
        "Peach",
        "Rosemary",
        "Summer",
        "Prosciutto",
        "Gourmet"
    ],
    "title": "Peach, Prosciutto, and Goat-Cheese Pizzas",
    "url": "http://www.epicurious.com/recipes/food/views/peach-prosciutto-and-goat-cheese-pizzas-103716"
}
