{
    "directions": [
        "Line baking sheet with foil; spray with nonstick spray. Combine sugar, 1/2 cup water, and corn syrup in heavy medium saucepan; stir over medium heat until sugar dissolves. Increase heat; boil until syrup is deep amber, occasionally swirling pan and brushing down sides with wet pastry brush, about 10 minutes. Remove from heat. Add nuts; stir until coated. Immediately pour mixture out onto prepared sheet of foil and spread so that nuts are in single layer. Cool completely.",
        "Break off 1/4 of nut praline and coarsely chop, then transfer pieces to processor. Process until praline resembles fine powder; transfer to airtight container. Chop remaining praline into 1/4-inch pieces; transfer to another airtight container. DO AHEAD: Can be made 1 week ahead. Store both airtight containers at room temperature.",
        "Lightly spray 8 1/2 x 4 1/2 x 2 1/2- inch loaf pan with nonstick spray. Line pan with double layer of plastic wrap, leaving 4-inch overhang on all sides. Whisk yolks, 5 tablespoons sugar, and peach liqueur in medium metal bowl to blend. Set bowl over large saucepan of simmering water (do not allow bottom of bowl to touch water). Whisk until yolk mixture is thick and resembles softly whipped cream and instant-read thermometer inserted into mixture registers 160°F, about 4 minutes. Remove bowl from over water and continue to whisk mixture until cool to touch, about 3 minutes.",
        "Puree quartered peaches in processor until smooth. Measure 1 cup peach puree; stir into yolk mixture (reserve any remaining puree for another use). Beat cream and 1/4 cup sugar in medium bowl until soft peaks form. Fold cream mixture into yolk-peach mixture in 2 additions. Fold in ground praline just until incorporated. Transfer to prepared loaf pan; smooth top. Fold plastic overhang over semifreddo, then cover pan with foil; freeze overnight.",
        "Remove foil and unfold plastic wrap from top of semifreddo. Invert semifreddo onto baking sheet; lift off pan and remove plastic wrap. Press chopped praline onto sides of semifreddo, leaving top plain; cover loosely with plastic wrap or foil and freeze at least 4 hours and up to 1 day. Using 2 metal spatulas, transfer semifreddo to serving platter. Arrange sliced peaches in row down center atop semifreddo. Cut into 1-inch-thick slices."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 cup sugar",
        "1/2 cup water",
        "1 tablespoon light corn syrup",
        "1 cup shelled raw unsalted natural pistachios (41/2 to 5 ounces) or hazelnuts, lightly toasted",
        "Nonstick vegetable oil spray",
        "5 large egg yolks",
        "5 tablespoons plus 1/4 cup sugar, divided",
        "5 tablespoons peach liqueur (such as Mathilde Pêches)",
        "14 ounces ripe peaches (about 2 large), peeled, pitted, quartered, plus 2 ripe peaches, peeled, halved, pitted, sliced (for garnish)",
        "1 cup chilled heavy whipping cream",
        "Special Equipment: 8 1/2 x 4 1/2 x 2 1/2-inch loaf pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Frozen Dessert",
        "Peach",
        "Tree Nut",
        "Pistachio",
        "Summer",
        "Party"
    ],
    "title": "Peach and Pistachio Praline Semifreddo",
    "url": "http://www.epicurious.com/recipes/food/views/peach-and-pistachio-praline-semifreddo-354341"
}
