{
    "directions": [
        "Whisk flour, granulated sugar, baking powder, baking soda, and salt in a medium bowl; transfer to a large resealable plastic bag.",
        "Cake mix can be made 1 week ahead. Store at room temperature.",
        "Build a fire in a pit and let it burn down until coals are covered with ash. Rake a layer of coals away to one side of fire. Toss peaches, bourbon, salt, 2 tablespoons demerara sugar, and 2 tablespoons water on a 20x12\" sheet of heavy-duty foil, then fold edges up and over to create a packet; pinch edges closed. Cook on a grate over coals, adding a splash or two of water halfway through if needed, until soft, 20–30 minutes. Let peaches cool slightly; coarsely chop.",
        "Line a Dutch oven with 2 layers of heavy-duty foil; lightly oil foil. Combine egg, buttermilk, and vanilla in a measuring glass or small bowl. Place cake mix in a large bowl and vigorously stir in butter and 1/4 cup buttermilk mixture, adding a bit more buttermilk mixture if needed, until a very thick paste forms. Stir in remaining buttermilk mixture, then add blackberries and peaches along with any juices and gently fold in just until mixture looks marbled. Scrape batter into Dutch oven; top with almonds and sprinkle with 2 tablespoons demerara sugar. Cover.",
        "Place Dutch oven directly in coals and set 18 hot briquettes (or scoop about a 1\" layer of fine coals) on top of lid. Bake, rotating lid every 10 minutes (for even baking) and replenishing coals as needed, until cake is firm to the touch when gently pressed, 25–30 minutes.",
        "Just before serving, place yogurt in a small bowl and sprinkle remaining 2 tablespoons demerara sugar over top. Let sit until sugar dissolves, about 5 minutes.",
        "Serve warm cake upside down and dolloped with yogurt."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "3/4 cup granulated sugar",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "3/4 teaspoon kosher salt",
        "4 peaches, halved, pitted",
        "2 tablespoons bourbon",
        "Pinch of kosher salt",
        "6 tablespoons demerara or dark brown sugar, divided",
        "Vegetable oil (for foil)",
        "1 large egg",
        "3/4 cup buttermilk",
        "1 teaspoon vanilla extract",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "6 ounces blackberries (about 1 cup)",
        "1/3 cup coarsely chopped unsalted, roasted almonds",
        "1 cup plain Greek yogurt",
        "7-quart. Dutch oven or other large cast-iron Dutch oven with a flanged lid"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Kid-Friendly",
        "Blackberry",
        "Peach",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peach-Blackberry Camp Cake",
    "url": "http://www.epicurious.com/recipes/food/views/peach-blackberry-camp-cake-56389764"
}
