{
    "directions": [
        "1. In a plastic (preferably) container large enough to hold both the brine and the meat, mix together the water, maple syrup, salt, cure, and spices.",
        "2. Scoop out a scant 1 cup (200 ml) brine, and use it to load the brine injector. Then, inject the loin every 3/4 to 1 inch (2 to 2.5 cm), inserting the needle about 3/4 inch (2 cm) deep. Try to distribute the brine evenly over the loin. Place the loin in the container with the remaining brine, and keep the meat submerged with the help of a plate or an object of a similar build. Cover and refrigerate for 4 full days.",
        "3. Remove the loin from the brine and pat it dry. Then roll it in the meal of your choosing. Give it a day's rest, uncovered, in the fridge, so the meal and meat form as one.",
        "4. You have two options on cooking it: you can slice it and griddle it for a minute on each side (for thin slices that is), or you can bake it at 375°F (190°C) for about an hour, or until it has a core temperature of 142°F (61°C), then slice it. I like it the first way, especially when it gets a bit burnt on the edges and I have added a dash of maple syrup that caramelizes a bit toward the end."
    ],
    "ingredients": [
        "3 quarts (3 liters) cold water",
        "1 cup (300 g) maple syrup",
        "2/3 cup (150 g) kosher salt",
        "2 tablespoons Prague powder #1 cure (optional)",
        "10 peppercorns",
        "1 tablespoon mustard seeds",
        "1 bay leaf",
        "4 1/2 pounds (2 kg) boneless lean\npork loin",
        "1 1/2 cups (215 g) coarse cornmeal or 1 1/2 cups (340 g) dried yellow peas, roughly milled in a food processor"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Brunch",
        "Pork Tenderloin",
        "Cornmeal",
        "Maple Syrup",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peameal Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/peameal-bacon-368929"
}
