{
    "directions": [
        "Heat the butter in a skillet over medium heat. Add the bananas, and sprinkle the bananas with the sugar. Cook over medium heat, stirring frequently, for 3 to 5 minutes, or until the bananas are soft.",
        "Combine the bananas, milk, and peanut butter in a food processor fitted with the steel blade or in a blender, and purée until smooth.",
        "Transfer the mixture to a saucepan and stir in 3/4 cup of the cream. Cook over medium heat, stirring frequently, until the mixture begins to steam; watch it carefully and make sure it does not come to a boil.",
        "While the mixture heats, combine the remaining cream, milk powder, cornstarch, salt, and vanilla in a small bowl, and stir until smooth and both of the powders have dissolved.",
        "Add the cornstarch mixture to the pan, and bring to a boil over low heat, stirring constantly. Whisk the mixture until smooth, and simmer the mixture over very low heat, stirring constantly, for 2 minutes, or until thickened. If the mixture is lumpy, strain it through a sieve.",
        "Transfer the hot liquid to a storage container and press a sheet of plastic wrap directly onto the surface of the mixture to prevent a skin from forming. Refrigerate the mixture uncovered until it is completely chilled (below 40°F).",
        "Freeze the mixture in an ice cream maker according to the manufacturer's instructions. Serve immediately for a soft ice cream, or transfer the mixture to an airtight storage container and freeze until hard. Allow the ice cream to sit at room temperature for 15 minutes before serving if frozen solid."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "2 ripe bananas, cut into 1/2-inch slices",
        "1/4 cup granulated sugar",
        "3/4 cup whole milk",
        "1/2 cup commercial peanut butter (not homemade or natural)",
        "1 1/4 cups heavy whipping cream, divided",
        "2 tablespoons nonfat dry milk powder",
        "2 tablespoons cornstarch",
        "1/4 teaspoon kosher salt",
        "1/2 teaspoon pure vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ice Cream Machine",
        "Dessert",
        "Kid-Friendly",
        "Backyard BBQ",
        "Frozen Dessert",
        "Banana",
        "Summer",
        "Birthday",
        "Party",
        "Peanut Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peanut Butter Banana Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/peanut-butter-banana-ice-cream-366132"
}
