{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Line baking sheets with baking parchment.",
        "Beat shortening, peanut butter, brown sugar, and 1/2 cup white sugar together with an electric mixer in a large bowl until smooth. Beat egg into the creamy mixture until fully incorporated. Stir milk and vanilla extract into the mixture until smooth.",
        "Mix flour, baking soda, and salt together in a small bowl; add to the wet mixture in the large bowl and stir until completely incorporated into a dough. Divide and shape dough into 48 balls.",
        "Spread 1/4 cup white sugar into a wide, shallow bowl. Roll dough balls in sugar to coat and arrange about 2 inches apart onto prepared baking sheets.",
        "Bake in preheated oven until golden brown, 10 to 12 minutes. Remove cookies from oven and quickly press a dimple into the middle of each cookie using the blunt end of a wooden spoon. Cool cookies on sheets for 10 minutes before transferring to a wire cooling rack to cool completely.",
        "Cut each chocolate sphere into two hemispheres. Put one piece atop each cookie with the rounded side facing upwards.",
        "Spoon frosting into a pastry bag with a small round tip or a plastic freezer bag with one end snipped off. Dab a small amount of frosting onto the back of each candy eyeball and stick two onto each chocolate candy to resemble eyes. Then pipe frosting in four thin lines, starting at the base of the candy, on each side atop the cookie to resemble spider legs.",
        "Let frosting harden at room temperature, about 30 minutes. Store cookies in an airtight container."
    ],
    "ingredients": [
        "1/2 cup shortening",
        "1/2 cup peanut butter",
        "1/2 cup packed brown sugar",
        "1/2 cup white sugar",
        "1 egg, beaten",
        "2 tablespoons milk",
        "1 teaspoon vanilla extract",
        "1 3/4 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/4 cup white sugar for rolling",
        "24 chocolate candy spheres with smooth chocolate filling (such as Lindt Lindor Truffles), refrigerated until cold",
        "48 decorative candy eyeballs",
        "1/2 cup prepared chocolate frosting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Peanut Butter Spider Cookies",
    "url": "http://allrecipes.com/recipe/240007/peanut-butter-spider-cookies/"
}
