{
    "directions": [
        "Preheat the oven to 325 degrees F. Line one 12-cup and one 6-cup muffin pan with paper or foil cupcake liners.",
        "Make the cupcakes: Sift the cake flour, cocoa powder, baking soda, baking powder and salt together three times. Beat the butter and sugar with an electric mixer at high speed for 15 seconds until combined. Add the eggs, one at a time, beating until each is incorporated. Continue beating until light and fluffy, about 6 more minutes. With the mixer at its lowest speed, beat in one-third of the flour mixture. Beat in the buttermilk and vanilla, then another one-third of the flour mixture. Beat in the coffee and then the remaining flour mixture. Fill the muffin cups halfway and bake for 25 minutes, or until the centers spring back when lightly pressed. Set the pans on a rack to cool.",
        "Make the peanut butter filling: Beat the butter and peanut butter with an electric mixer at medium speed until blended. Reduce the speed to low and gradually beat in the confectioners' sugar. Increase the speed to high and beat for 3 to 5 minutes, until smooth and fluffy. Spoon the filling into a pastry bag fitted with a medium plain tip. Insert the tip into the top of each cooled cupcake and squeeze approximately 1 1/2 tablespoons filling into each cupcake.",
        "Make the ganache frosting: Place the chocolate in a medium bowl. Heat the cream in a small saucepan until scalding. Pour the cream over the chocolate and let sit 1 minute, then whisk until smooth. Let sit 10 minutes, until thick but still pourable. Dunk the tops of the cupcakes into the frosting to coat, then place on a rack and sprinkle with the chopped peanuts. Transfer to the refrigerator for 20 minutes to set.",
        "Photograph by Gentl & Hyers"
    ],
    "ingredients": [
        "1 1/4 cups cake flour",
        "1/2 cup unsweetened Dutch- process cocoa powder",
        "1 teaspoon baking soda",
        "1/4 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) plus 2 tablespoons unsalted butter, at room temperature",
        "1 1/2 cups granulated sugar",
        "3 large eggs",
        "1/2 cup buttermilk",
        "1 cup creamy peanut butter",
        "1 1/4 cups sifted confectioners' sugar",
        "4 ounces semisweet chocolate, roughly chopped",
        "1 teaspoon vanilla extract",
        "1/2 cup hot strong coffee",
        "1/2 cup (1 stick) unsalted butter, at room temperature",
        "1/2 cup heavy cream",
        "1 cup roasted peanuts, chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Baking",
        "Easy Recipes",
        "Chocolate Cupcake",
        "Chocolate",
        "Cupcake",
        "Peanut Butter Fudge"
    ],
    "title": "Peanut Butter Cream-Filled Devil's Food Cupcakes",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/peanut-butter-cream-filled-devils-food-cupcakes-recipe"
}
