{
    "directions": [
        "Whisk first 3 ingredients in large saucepan to blend. Gradually whisk in milk, then cream. Whisk over medium heat until mixture comes to boil. Then boil until thick, whisking constantly, about 30 seconds. Whisk in peanut butter; boil until thick again, whisking often, about 1 minute longer. Remove from heat; whisk in vanilla. Divide pudding among six 1-cup glasses or dishes (generous 1/3 cup each). Chill uncovered while preparing chocolate pudding.",
        "Whisk first 4 ingredients in heavy large saucepan. Gradually whisk in milk, then cream. Whisk over medium heat until mixture comes to boil. Boil until thick, whisking constantly, about 30 seconds. Add chopped chocolate. Boil until chocolate melts and pudding is thick again, whisking often, 1 to 2 minutes longer. Remove from heat; whisk in vanilla. Cool pudding 5 minutes. Spoon atop peanut butter pudding, dividing equally (about 1/3 cup each). Chill puddings uncovered until cold, at least 2 hours. DO AHEAD: Can be made 1 day ahead. Cover and keep chilled.",
        "Whisk cream and powdered sugar in medium bowl to soft peaks. Spoon topping onto puddings and serve."
    ],
    "ingredients": [
        "1/2 cup sugar",
        "5 teaspoons cornstarch",
        "1/8 teaspoon salt",
        "1 3/4 cups whole milk",
        "1/2 cup heavy whipping cream",
        "1/2 cup creamy (smooth) natural peanut butter (made with only peanuts and salt)",
        "1 teaspoon vanilla extract",
        "6 tablespoons sugar",
        "2 tablespoons cornstarch",
        "2 tablespoons natural unsweetened cocoa powder",
        "Pinch of salt",
        "1 1/2 cups whole milk",
        "1/2 cup heavy whipping cream",
        "4 ounces imported milk chocolate, chopped",
        "1 teaspoon vanilla extract",
        "1 cup chilled heavy whipping cream",
        "1 tablespoon powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Kid-Friendly",
        "Back to School",
        "Dinner",
        "Lunch",
        "Peanut",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peanut Butter Milk Chocolate Puddings",
    "url": "http://www.epicurious.com/recipes/food/views/peanut-butter-milk-chocolate-puddings-350968"
}
