{
    "directions": [
        "Bring cream, sugar, and corn syrup to simmer in heavy medium saucepan. Add chocolate and stir until melted and smooth. Transfer mixture to medium bowl. Add peanut butter and whisk until mixture is smooth. Cover and chill until ganache is firm, about 2 hours.",
        "Using 1 level tablespoon ganache for each, form 1 1/4-inch balls. Place on baking sheet. Freeze ganache balls overnight.",
        "Whisk flour, cocoa powder, sugar, and salt in large bowl to blend. Add club soda, then eggs and melted butter. Using electric mixer, beat until mixture is well blended and smooth.",
        "Pour enough oil into heavy large skillet to reach depth of 1 1/2 inches; heat to 350°F. Remove peanut butter ganache balls from freezer. Working with a few ganache balls at a time, dip into beignet batter, coating balls completely. Lift balls out with fork and slowly slide into hot oil; fry until batter is set and slightly crisp, about 1 1/2 minutes. Using slotted spoon, transfer beignets to paper towels to drain. Keep warm.",
        "Melt butter in large nonstick skillet over medium-high heat. Add brown sugar and stir until sugar begins to melt, bubble, and form thick mass, about 4 minutes. Add rum and lemon juice; simmer until mixture thickens slightly, about 3 minutes. Add bananas and cook until glazed with caramel, about 1 minute.",
        "Place 3 beignets on each plate. Dust with powdered sugar. Place caramelized bananas and scoop of Bitter Caramel Ice Cream alongside beignets. Sprinkle ice cream with peanut brittle and serve."
    ],
    "ingredients": [
        "3/4 cup whipping cream",
        "2 tablespoons sugar",
        "1 tablespoon light corn syrup",
        "12 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3/4 cup creamy peanut butter",
        "1 3/4 cups plus 2 tablespoons all purpose flour",
        "1 cup unsweetened cocoa powder (preferably Valrhona or Dutch-process)",
        "1/2 cup sugar",
        "3/4 teaspoon salt",
        "1 1/4 cups club soda",
        "2 large eggs",
        "9 tablespoons unsalted butter, melted, cooled",
        "Canola oil (for frying)",
        "1/4 cup (1/2 stick) unsalted butter",
        "1/2 cup (packed) dark brown sugar",
        "1/4 cup dark rum",
        "1 teaspoon fresh lemon juice",
        "3 bananas, cut on diagonal into 1/3-inch-thick slices",
        "Powdered sugar",
        "Bitter Caramel Ice Cream",
        "Purchased peanut brittle, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Chocolate",
        "Dairy",
        "Nut",
        "Dessert",
        "Fry",
        "Banana",
        "Peanut",
        "Simmer",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peanut Butter Beignets with Caramelized Bananas and Bitter Caramel Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/peanut-butter-beignets-with-caramelized-bananas-and-bitter-caramel-ice-cream-230657"
}
