{
    "directions": [
        "Preheat oven to 350°F. Combine all ingredients in processor; blend until mixture resembles moist crumbs, about 1 minute. Transfer to 9-inch-diameter glass pie dish and press mixture onto bottom and up sides (not rim) of dish. Bake crust until golden brown, about 12 minutes. Remove from oven; press crust with back of spoon if puffed. Cool crust completely.",
        "Whisk sugar, cornstarch, and salt in heavy medium saucepan until no lumps remain. Gradually whisk in cream, then milk. Add yolks and scrape in seeds from vanilla bean; whisk to blend. Cook over medium heat, whisking constantly, until pudding thickens and boils, about 5 minutes. Add butter and stir until melted. Spread warm pudding in cooled crust. Chill until filling is cool, about 1 hour.",
        "Thinly slice 3 bananas on diagonal. Combine banana slices and 2 tablespoons orange juice in medium bowl; toss to coat. Transfer banana slices to paper towels and pat dry. Arrange enough banana slices in single layer over vanilla custard filling to cover completely.",
        "Using electric mixer, beat cream cheese and powdered sugar in medium bowl until smooth. Beat in vanilla, then peanut butter. Beat cream in another medium bowl until firm peaks form. Fold large spoonful of whipped cream into peanut mixture to loosen, then fold in remaining cream in 2 additions. Spread peanut butter layer evenly over bananas. Chill at least 3 hours. DO AHEAD: Can be made 8 hours ahead. Keep chilled.",
        "Thinly slice remaining banana on diagonal. Toss with remaining 1 tablespoon orange juice, then pat dry with paper towels. Arrange banana slices around top edge of pie. Sprinkle peanut brittle over bananas, if desired, and serve."
    ],
    "ingredients": [
        "6 ounces vanilla wafer cookies",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "2 tablespoons sugar",
        "1/3 cup sugar",
        "1 1/2 tablespoons cornstarch",
        "1/8 teaspoon salt",
        "1 cup heavy whipping cream",
        "1/2 cup whole milk",
        "2 large egg yolks",
        "1 vanilla bean, split lengthwise",
        "1 tablespoon unsalted butter",
        "4 firm but ripe bananas, peeled, divided",
        "3 tablespoons orange juice, divided",
        "3 ounces cream cheese, room temperature",
        "1/2 cup powdered sugar",
        "1 teaspoon vanilla extract",
        "1/3 cup creamy peanut butter (do not use old-fashioned or freshly ground)",
        "2/3 cup chilled heavy whipping cream",
        "Purchased peanut brittle, coarsely chopped (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Kid-Friendly",
        "Backyard BBQ",
        "Cream Cheese",
        "Banana",
        "Chill",
        "Potluck",
        "Peanut Butter",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peanut Butter Banana Cream Pie",
    "url": "http://www.epicurious.com/recipes/food/views/peanut-butter-banana-cream-pie-352677"
}
