{
    "directions": [
        "Place the milk, sugar, and vanilla beans into a heavy pot and bring to a boil. Turn off immediately and let the milk steep with the vanilla beans for 30 minutes. Whisk the yolks until smooth and slowly temper your hot-milk mixture into them, whisking continuously. Immediately pour the cream into the mix and put into an ice bath until cool.",
        "With a standing mixer or by hand, mix the peanut butter and honey together until homogenous. Reserve 1/2 cup of this mix to be heated and served as a sauce with the pudding.",
        "Place sliced bread in a 8x10 Pyrex or metal pan that has been lined with a piece of parchment paper to cover bottom of pan. Spread on top 1/2 of the peanut butter mix and then 1 cup of strawberry jam. Place another layer of the bread on top of the jam and then repeat the layers. Finish with a final layer of bread and press down firmly on the top of the bread to make sure that the pudding is totally \"together.\" Pour 8 cups of the custard over the top of the pudding as follows: To ensure that the entire pudding gets saturated, poke holes with a knife or a wooden skewer through the top of the pudding. Pour 2 cups of the custard on top and let that soak in for 10 minutes. Then pour 2 more cups, allow it to soak in, and repeat process until all the custard has been used. Allow it to sit in the refrigerator for a few hours or overnight. This will help to produce a uniform pudding, i.e., all the pieces equally saturated.",
        "When ready to bake, preheat the oven to 350°F and cover the pudding with a piece of foil that has been lightly buttered. Place the pudding into a water bath so that the water reaches halfway up the side of the pan. Bake for 1 hour and then check to make sure the pudding is fully set — a finger pressed into the middle of the pudding should come away dry without any custard on it. If it isn't set, bake for another 10 minutes and check again. Remove the foil and continue baking for another 20 minutes so that the top has a lovely brown, crunchy crust.",
        "Remove from the oven and the water bath and refrigerate until cool. Run a sharp knife around the edges of the pudding, place a pan over the top of it, and quickly invert it. Cut it into 8 slices and invert them so that the crust is on top.",
        "Before serving, preheat the oven to 400°F and place the pieces of pudding in the oven to warm for 5 minutes. Place warmed pudding directly onto a plate that has been drizzled with the warm peanut butter mixture and warmed strawberry jam. Serve immediately. Can be served with a dollop of whipped cream or just a dash of confectioner's sugar."
    ],
    "ingredients": [
        "2 Pullman loaves or other sweet (not sour) bread, cut into 1-inch-wide slices (remove crust if desired)",
        "4 1/2 cups whole milk",
        "4 1/2 cups heavy cream",
        "2 cups granulated white sugar",
        "2 vanilla beans, split and scraped",
        "15 egg yolks",
        "4 cups creamy peanut butter",
        "2 cups honey",
        "3 cups high-quality strawberry jam"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Peanut",
        "Fall",
        "Honey",
        "Jam or Jelly",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peanut Butter Bread Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/peanut-butter-bread-pudding-102098"
}
