{
    "directions": [
        "Position rack in center of oven and preheat to 350°F. Combine broken graham crackers, diced butter, and sugar in processor. Blend until crumbs stick together. Press crumb mixture onto bottom and 2 1/2 inches up sides of 9-inch-diameter springform pan. Bake crust until golden, about 12 minutes. Cool crust on rack. Maintain oven temperature.",
        "Beat cream cheese and peanut butter in large bowl until blended and creamy, about 3 minutes. Add both sugars and beat until fluffy, about 3 minutes. Beat in vanilla, then eggs 1 at a time, then sour cream. Scrape cheesecake batter into crust.",
        "Stack 3 large pieces of foil on work surface and place springform pan in center. Fold foil snugly up sides of pan. Place springform pan in roasting pan. Add enough water to roasting pan to come 1 inch up sides of springform pan.",
        "Bake cheesecake in water bath until sides are puffed and center is set and edges are beginning to brown, about 1 hour 25 minutes. Place hot cheesecake directly in refrigerator; chill uncovered until cold, at least 6 hours and up to 1 day.",
        "Whisk diced butter and sugar in heavy large skillet over mediumlow heat until butter melts, sugar dissolves, and smooth caramel sauce bubbles thickly, about 4 minutes. Slice bananas into 1/2-inch-thick, 2-inch-long diagonal slices, discarding ends. Working in batches if necessary, add banana slices to skillet in single layer and cook over medium heat until heated through and coated, turning once, 1 to 2 minutes per batch. Using forks, carefully transfer banana slices to top of cheesecake, arranging in concentric overlapping circles. Let cheesecake stand at room temperature up to 1 hour before slicing and serving."
    ],
    "ingredients": [
        "18 whole graham crackers, coarsely broken",
        "10 tablespoons (1 1/4 sticks) unsalted butter, diced",
        "6 tablespoons (packed) golden brown sugar",
        "3 8-ounce packages cream cheese, room temperature",
        "1 cup creamy (smooth) natural peanut butter (made with only peanuts and salt)",
        "3/4 cup sugar",
        "1/3 cup (packed) golden brown sugar",
        "1 1/2 teaspoons vanilla extract",
        "4 large eggs",
        "1/3 cup sour cream topping",
        "1/2 cup (1 stick) unsalted butter, room temperature, diced",
        "1/2 cup (packed) golden brown sugar",
        "7 firm but ripe bananas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Cream Cheese",
        "Banana",
        "Peanut",
        "Potluck",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peanut Butter Cheesecake with Caramelized Banana Topping",
    "url": "http://www.epicurious.com/recipes/food/views/peanut-butter-cheesecake-with-caramelized-banana-topping-351040"
}
