{
    "directions": [
        "For crepes:  In a large bowl, combine 4 eggs, 1 1/3 cups milk, melted butter, 1 cup flour, 2 tablespoons sugar and 1/2 teaspoon salt.  Stir until smooth.  In a medium skillet or crepe pan over medium-high heat, spoon a few tablespoon of batter and tilt pan to cover completely.  Cook, turning once, until golden, 2 minutes.  Repeat to make 6 crepes.",
        "For filling:  In a medium saucepan over medium-high heat, combine 1 cup sugar, 3 tablespoons flour and 1/4 teaspoon salt.  Gradually stir in  2 1/4 cups milk and chocolate, until chocolate melts and mixture thickens.  Remove from heat and stir in 3 eggs.  Return to heat and cook 2 minutes more, stirring constantly, until mixture coats the back of a metal spoon.  Remove from heat and stir in vanilla and 2 tablespoons butter.  Fold in cookie pieces.",
        "Line a 12x15 inch loaf pan with two or three overlapping crepes.  Pour filling into lined pan.  Cover with two or three crepes.  Wrap tightly in plastic wrap and refrigerate 8 hours or overnight.",
        "To serve, place pan in hot water for 1 minute.  Remove plastic wrap and place serving plate over pan.  Grip pan and plate and invert.  Remove pan.  Frost if desired."
    ],
    "ingredients": [
        "CREPES",
        "4 eggs, beaten",
        "1 1/3 cups milk",
        "2 tablespoons butter, melted",
        "1 cup all-purpose flour",
        "2 tablespoons white sugar",
        "1/2 teaspoon salt",
        "FILLING",
        "1 cup white sugar",
        "3 tablespoons all-purpose flour",
        "1/4 teaspoon salt",
        "2 1/4 cups milk",
        "2 ounces unsweetened chocolate, chopped",
        "3 eggs, beaten",
        "2 teaspoons vanilla extract",
        "2 tablespoons butter",
        "12 peanut butter cookies, crumbled"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Peanut Butter Chocolate Bombshell",
    "url": "http://allrecipes.com/recipe/20142/peanut-butter-chocolate-bombshell/"
}
