{
    "directions": [
        "Using fork, mix powdered sugar, peanut butter and 1 teaspoon vanilla extract in medium bowl until mixture resembles coarse dry crumbs. Place cereal in small bowl. Mix 1/2 cup peanut butter mixture into cereal; set aside.",
        "Whisk 1/4 cup milk, yolks, sugar, flour and cornstarch in bowl to blend. Pour remaining 2 1/4 cups milk into heavy medium saucepan; bring to simmer. Gradually whisk hot milk into yolk mixture. Return mixture to saucepan. Whisk constantly over medium heat until custard boils and thickens, about 2 minutes. Remove from heat. Add white chocolate and remaining 1 1/2 teaspoons vanilla; whisk until chocolate melts. Cool completely.",
        "Sprinkle 1/2 cup plain (no cereal) peanut butter mixture over bottom of pie shell. Spoon half of custard filling over. Top with bananas, then remaining plain peanut butter mixture. Spoon remaining custard filling over, mounding in center. Refrigerate pie until cold, about 3 hours. (Can be made 6 hours ahead. Keep chilled.) Top with whipped cream and sprinkle with peanut butter-cereal mixture. Cut into wedges and serve."
    ],
    "ingredients": [
        "1 cup sifted powdered sugar",
        "3/4 cup smooth old-fashioned peanut butter",
        "2 1/2 teaspoons vanilla extract",
        "2 tablespoons Grape-Nuts cereal",
        "2 1/2 cups whole milk",
        "4 large egg yolks",
        "3/4 cup sugar",
        "1/4 cup all purpose flour",
        "1/4 cup cornstarch",
        "6 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
        "1 9-inch-diameter frozen pie shell, baked according to package directions, cooled completely",
        "2 ripe bananas, peeled, sliced",
        "1 1/2 cups chilled whipping cream, beaten to firm peaks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Kid-Friendly",
        "Banana",
        "Chill",
        "Potluck",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Peanut Butter and White Chocolate Cream Pie",
    "url": "http://www.epicurious.com/recipes/food/views/peanut-butter-and-white-chocolate-cream-pie-101012"
}
