{
    "directions": [
        "Preheat oven to 350°F. Line 8 x 8 x 2-inch metal baking pan with heavy-duty foil, leaving 2-inch overhang around edges and pressing firmly into corners and up sides of pan. Coat foil with nonstick spray. Whisk flour, baking powder, and 1/4 teaspoon salt in small bowl. Using electric mixer, beat peanut butter, sugar, and butter in large bowl until smooth. Add egg and vanilla; beat on low speed until smooth. Add flour mixture; beat on low speed just to blend. Transfer half of dough to prepared pan (about scant 1 1/2 cups). Place remaining dough in freezer for 10 minutes. Using fingertips, press dough evenly onto bottom of pan. Spread jelly over in even layer. Remove dough from freezer; using fingertips, break into grape-size pieces and scatter over jelly layer. Sprinkle chopped nuts over.",
        "Bake bars until top is golden brown, about 30 minutes. Cool bars completely in pan on rack.",
        "Using foil overhang as aid, lift bars from pan. Gently peel foil from edges. Cut into 16 squares. DO AHEAD: can be made 3 days ahead. Store airtight at room temperature."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 1/2 cups unbleached all purpose flour",
        "1/2 teaspoon baking powder",
        "3/4 cup smooth peanut butter",
        "3/4 cup (packed) golden brown sugar",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1 large egg",
        "1 teaspoon vanilla extract",
        "3/4 cup grape jelly or other jelly or jam",
        "2/3 cup coarsely chopped salted dry-roasted peanuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Picnic",
        "Kid-Friendly",
        "Quick & Easy",
        "Back to School",
        "Peanut",
        "Party",
        "Jam or Jelly",
        "Peanut Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peanut Butter and Jelly Bars",
    "url": "http://www.epicurious.com/recipes/food/views/peanut-butter-and-jelly-bars-364073"
}
