{
    "directions": [
        "Preheat oven to 325°F. Butter 9-inch-diameter tart pan with removable bottom. Mix cookie crumbs and butter in medium bowl until moist clumps form. Press mixture onto bottom and up sides of prepared tart pan. Bake until set, about 10 minutes. Cool completely.",
        "Using electric mixer, beat cream cheese and peanut butter in large bowl until smooth. Using clean dry beaters, beat cream, powdered sugar, and vanilla to soft peaks in another large bowl. Whisk half of whipped cream mixture into peanut butter mixture. Fold in remaining whipped cream mixture. Transfer 3 tablespoons filling to small bowl and reserve. Spread remaining filling in crust.",
        "Melt chocolate in top of double boiler set over simmering water. Whisk in reserved 3 tablespoons filling. Immediately transfer chocolate mixture to pastry bag fitted with 1/8-inch plain tip. Pipe chocolate mixture in spiral atop filling. Using small sharp knife, begin at center and draw tip of knife toward edge of tart. Move knife over 2 inches; begin at edge and draw tip of knife toward center. Repeat to form web pattern. Chill until cold. (Can be made 2 days ahead. Keep chilled.) Cut tart into wedges and serve cold."
    ],
    "ingredients": [
        "1 1/2 cups finely ground chocolate wafer cookies (about 24)",
        "5 tablespoons unsalted butter, melted",
        "6 ounces cream cheese, room temperature",
        "3/4 cup creamy peanut butter, room temperature",
        "1 cup chilled whipping cream",
        "1/2 cup plus 2 tablespoons powdered sugar",
        "1 teaspoon vanilla extract",
        "1 ounce semisweet chocolate, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Peanut",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peanut Butter Cream Tart",
    "url": "http://www.epicurious.com/recipes/food/views/peanut-butter-cream-tart-107534"
}
