{
    "directions": [
        "Mix flour, sugar and salt in processor. Add butter. Using on/off turns, process until mixture resembles coarse meal. Transfer to large bowl. Mix egg yolk and 1 1/2 tablespoons ice water in small bowl. Using fork, blend enough yolk mixture, 1/2 tablespoon at a time, into flour mixture to form moist clumps. Gather dough into ball; flatten into disk. Wrap in plastic. Chill until firm, about 1 hour. (Can be prepared 1 day ahead. Keep refrigerated. Let soften slightly before rolling out.)",
        "Position rack in center of oven and preheat to °F. Roll out dough on floured parchment paper to 10-inch round. Transfer dough on parchment paper to large baking sheet.",
        "Toss pears, sugar, flour, lemon juice and allspice in large bowl. Overlap pear slices atop dough, leaving 2-inch border. Fold dough border over fruit, pleating loosely and pinching to seal any cracks. Brush dough with egg white. Drizzle cream over filling.",
        "Mix flour and sugar in small bowl. Rub in butter with fingertips until mixture forms small clumps. Sprinkle topping over filling.",
        "Bake tart until crust is golden and filling bubbles, about 40 minutes. Transfer baking sheet to rack; cool slightly, about 15 minutes. Slide metal spatula under crust to free from parchment. Using large tart pan bottom as aid, transfer tart to platter. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1 1/2 tablespoons sugar",
        "1/8 teaspoon salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "1 large egg yolk",
        "1 1/2 tablespoons ice water",
        "2 firm but ripe Bosc pears, peeled, quartered, cored, cut into 1/2-inch wedges",
        "3 tablespoons sugar",
        "1 tablespoon all purpose flour",
        "1 tablespoon fresh lemon juice",
        "1/4 teaspoon ground allspice",
        "1 large egg white, beaten to blend",
        "1 tablespoon whipping cream",
        "2 tablespoons all purpose flour",
        "1 tablespoon sugar",
        "1 tablespoon chilled unsalted butter, cut into 1/2-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Pear",
        "Spring"
    ],
    "title": "Pear Croustade",
    "url": "http://www.epicurious.com/recipes/food/views/pear-croustade-5131"
}
