{
    "directions": [
        "Put oven rack in middle position and preheat oven to 375°F.",
        "Peel, quarter, and core pears, apples, and quince, then cut into 1-inch chunks. Toss fruit with sugar, lemon juice, ginger, cinnamon stick, cloves, and 1 tablespoon apple cider in a bowl. Transfer to a large shallow baking pan (17 by 12 inches) and roast, stirring once or twice, until fruit is very soft and caramelized, 1 to 1 1/4 hours.",
        "Remove from oven and add remaining tablespoon apple cider, scraping up caramelized juices from bottom of baking pan. Discard cinnamon stick and cloves. Cool in pan on a rack, about 45 minutes.",
        "Whisk together flour, salt, and 2 tablespoons sugar in a large bowl. Blend in butter with your fingertips or a pastry blender (or pulse in a food processor) until mixture resembles coarse meal with some roughly pea-size butter lumps. Drizzle evenly with 6 tablespoons ice water and gently stir with a fork (or pulse) until incorporated.",
        "Squeeze a small handful: If dough doesn't hold together, add more ice water to dough, 1 tablespoon at a time, stirring (or pulsing) until just combined. (Do not overwork mixture, or pastry will be tough.)",
        "Turn out dough onto a lightly floured surface and divide into 6 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather all of dough together with scraper and press into a ball, then flatten into a disk. Chill dough, wrapped tightly in plastic wrap, until firm, at least 1 hour.",
        "Roll out dough on a lightly floured surface with a lightly floured rolling pin into a 14-inch round, then fit into tart pan (do not trim).",
        "Put a large baking sheet in middle of oven and preheat oven to 375°F.",
        "Beat together butter and sugars in a large bowl using an electric mixer at high speed until pale and fluffy, about 2 minutes. Add eggs 1 at a time, beating well after each addition, then beat in vanilla. Reduce speed to low, then add flour and a pinch of salt and mix until just combined. Spread evenly in pastry shell.",
        "Scatter roasted fruit with juices over filling. Fold edge of pastry over filling to partially cover (center won't be covered). Pleat dough as necessary. Brush folded pastry edge lightly with egg and sprinkle with remaining tablespoon sugar.",
        "Bake on preheated baking sheet until filling is puffed and set and pastry is golden brown, 50 to 60 minutes. Cool to warm, about 1 1/2 hours. Remove side of tart pan and slide crostata onto a plate."
    ],
    "ingredients": [
        "2 firm-ripe pears (1 lb total)",
        "2 apples (preferably Fuji or Gala; 1 lb total)",
        "1 quince (1/2 lb)",
        "1/2 cup sugar",
        "3 tablespoons fresh lemon juice",
        "1 tablespoon finely chopped peeled fresh ginger",
        "1 (3-inch) cinnamon stick",
        "4 whole cloves",
        "2 tablespoons apple cider",
        "2 cups all-purpose flour",
        "1 teaspoon kosher salt",
        "3 tablespoons sugar",
        "2 sticks (1 cup) cold unsalted butter, cut into 1/2-inch cubes",
        "6 to 8 tablespoons ice water",
        "1 large egg, lightly beaten",
        "1 stick (1/2 cup) unsalted butter, softened",
        "1/2 cup packed light brown sugar",
        "1/2 cup confectioners sugar",
        "2 large eggs",
        "1 teaspoon vanilla",
        "1/4 cup all-purpose flour",
        "Special equipment: a pastry or bench scraper; an 11-inch round fluted tart pan (1 1/4 inches deep) with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Apple",
        "Pear",
        "Quince",
        "Fall",
        "Cinnamon",
        "Clove",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear, Apple, and Quince Crostata",
    "url": "http://www.epicurious.com/recipes/food/views/pear-apple-and-quince-crostata-232818"
}
