{
    "directions": [
        "Combine pears, sugar and brandy in large bowl. Toss to coat.",
        "Draw one 4 x 4-inch pear shape and one 4 1/2 x 4 1/2-inch pear shape on parchment paper. Using scissors, cut out shapes.",
        "Line baking sheet with parchment paper. Roll out 1 pastry sheet on lightly floured surface to 12-inch square. Using 4 x 4-inch parchment template, cut out 6 pear shapes from pastry. Transfer pear-shaped pastries to baking sheet, spacing evenly.",
        "Sprinkle half of crushed cookies over pastries, leaving 1/2-inch border. Arrange pear slices over crushed cookies. Sprinkle remaining cookies over pears. Roll out second pastry sheet on lightly floured surface to 14 1/2-inch square. Using 4 1/2 x 4 1/2-inch parchment template, cut out 6 pear shapes from pastry. Brush edges of pastries on baking sheet with water. Arrange larger pear-shaped pastries atop pears, pressing pastry edges together to adhere. Press edges with fork to seal. Using skewer, poke small hole in top of each turnover to allow steam to escape. Press 1 almond sliver in tip of each turnover to represent stem. Cover and refrigerate 20 minutes.",
        "Preheat oven to 375°F. Brush turnovers with egg. Bake until golden brown, about 30 minutes. Transfer to rack and cool. (Can be prepared 8 hours ahead. Store in airtight container at room temperature.)"
    ],
    "ingredients": [
        "2 very ripe Bartlett pears (about 7 ounces each), peeled, halved lengthwise, cored, cut into 1/8- to 1/4-inch-thick slices",
        "2 tablespoons sugar",
        "2 tablespoons brandy",
        "1 17 1/4-ounce package frozen puff pastry (2 sheets), thawed",
        "6 tablespoons crushed amaretti cookies",
        "6 blanched almond slivers",
        "1 large egg, beaten to blend"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Pear",
        "Almond",
        "Brandy",
        "Fall",
        "Kidney Friendly"
    ],
    "title": "Pear and Amaretti Turnovers",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-amaretti-turnovers-15571"
}
