{
    "directions": [
        "Preheat oven to 400°F.",
        "Scrape vanilla seeds from pod into a small bowl and add sugar. Rub sugar and seeds together to unclump seeds.",
        "Into a bowl sift together flour, baking powder, baking soda, salt and 1 tablespoon vanilla sugar. In a well-seasoned 10-inch cast-iron skillet melt butter over moderately low heat and remove from heat. In a bowl whisk together buttermilk, eggs, and 1 tablespoon melted butter, leaving remaining butter in skillet, and whisk into flour mixture until just combined. Let batter stand 15 minutes.",
        "Peel and core pears and cut lengthwise into 1/4-inch-thick wedges. Add pears to remaining vanilla sugar with lemon juice, tossing to coat. Arrange peats decoratively in butter remaining in skillet. Sprinkle any remaining sugar mixture over peats and cook over moderate heat until barely tender and sugar begins to caramelize, about 8 minutes.",
        "Pour batter evenly over peats and bake in middle of oven 15 minutes. Reduce temperature to 350°F. and bake 15 minutes more, or until top is golden and center is firm to the touch.",
        "Immediately run a thin knife around edge of skillet. Invert o plate over skillet and invert cake onto plate (keeping plate and skillet firmly pressed together). Carefully lift skillet off cake and replace any fruit that is stuck to bottom of skillet.",
        "Serve pancake with syrup."
    ],
    "ingredients": [
        "1 vanilla bean, split lengthwise",
        "1/4 cup sugar",
        "2/3 cup all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/2 cup well-shaken buttermilk",
        "2 large eggs",
        "1 1/2 firm-ripe Bosc or Barlett pears (about 3/4 pound)",
        "1 tablespoon fresh lemon juice",
        "Accompaniment: pure maple syrup, heated"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Breakfast",
        "Brunch",
        "Bake",
        "Pear",
        "Vanilla",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear and Vanilla Upside-Down Pancake",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-vanilla-upside-down-pancake-14405"
}
