{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Wrap the bottom of a springform pan in aluminum foil and grease entire pan with coconut oil.",
        "Stir walnuts, 3 tablespoons honey, and cinnamon together in a bowl.",
        "Pour 2 tablespoons coconut flour in a bowl; cut 1/4 cup cold unsalted butter into flour until mixture resembles coarse crumbs. Stir walnut mixture into butter mixture.",
        "Stir pears, apples, and lemon juice together in a bowl.",
        "Beat 1/2 cup softened unsalted butter, 1/4 cup honey, and eggs together in a bowl. Whisk coconut flour, coconut milk, arrowroot powder, vanilla extract, baking powder, baking soda, and sea salt into egg mixture until a smooth batter.",
        "Pour 1/2 the batter into the springform pan. Spread pears and apples in a layer over the batter. Pour remaining 1/2 the batter over apples and pears; top with walnut mixture.",
        "Bake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 50 to 55 minutes. Cool for 10 minutes before running a butter knife around the edge of the cake and loosening the springform. Cool for 1 hour."
    ],
    "ingredients": [
        "1 teaspoon coconut oil, melted",
        "Topping:",
        "3/4 cup chopped walnuts",
        "3 tablespoons raw honey",
        "1 teaspoon ground cinnamon",
        "2 tablespoons coconut flour",
        "1/4 cup cold unsalted butter, cut into cubes",
        "Filling:",
        "2 pears, peeled and thinly sliced",
        "1 apple, peeled and thinly sliced",
        "2 teaspoons lemon juice",
        "1/2 cup unsalted butter, softened",
        "1/4 cup raw honey",
        "5 eggs",
        "3/4 cup coconut flour",
        "3/4 cup coconut milk",
        "1/4 cup arrowroot powder",
        "1 teaspoon vanilla extract",
        "3/4 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon sea salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pear and Apple Coffee Cake with Walnut Topping",
    "url": "http://allrecipes.com/recipe/234738/pear-and-apple-coffee-cake-with-walnu/"
}
