{
    "directions": [
        "Preheat oven to 400°F with rack in middle.",
        "Melt butter in a 12-inch nonstick skillet. Brush a 9-inch cake pan (2 inches deep) with 1 tablespoon melted butter and reserve 6 tablespoons in a small bowl. Sprinkle sugar evenly over butter remaining in skillet. Arrange pears, cut sides up, in skillet and sprinkle with 1/8 teaspoon nutmeg. Cook over medium heat 5 minutes, then turn pears over and sprinkle with 1/8 teaspoon nutmeg. Cook until liquid pears give off has evaporated and cut sides are lightly browned, 8 to 10 minutes more.",
        "Transfer pears, cut sides down, to cake pan.",
        "Whisk together flour, cornmeal, baking powder, baking soda, salt, and remaining 1/4 teaspoon nutmeg in a bowl. Whisk in milk, syrup, eggs, and reserved butter just until smooth. Pour over pears and bake until golden and a wooden pick inserted in center of cake comes out clean, 25 to 30 minutes. Cool in pan on a rack 15 minutes, then run a knife around edge of cake to loosen and invert onto a platter."
    ],
    "ingredients": [
        "1 stick unsalted butter",
        "2 tablespoons sugar",
        "4 firm-ripe Anjou pears, peeled, halved lengthwise, and cored",
        "1/2 teaspoon grated nutmeg, divided",
        "1 cup all-purpose flour",
        "3/4 cup stone-ground cornmeal (preferably white)",
        "2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "3/4 cup whole milk",
        "1/4 cup pure maple syrup (preferably dark amber or Grade B)",
        "2 large eggs, lightly beaten",
        "Accompaniments: pure maple syrup (for drizzling); sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Pear",
        "Cornmeal",
        "Winter",
        "Maple Syrup",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear Maple Johnnycake",
    "url": "http://www.epicurious.com/recipes/food/views/pear-maple-johnnycake-241521"
}
