{
    "directions": [
        "Preheat oven to 450°F. Generously butter large baking sheet. Place figs and pear pieces in single layer on prepared sheet. Sprinkle with sugar. Roast until tender and beginning to brown around edges, about 20 minutes. Transfer fruit and any juices from sheet to medium bowl. Cool. Stir in cranberry-raspberry concentrate and lemon. Chill until cold.",
        "Butter another large baking sheet. Mix breadcrumbs, 3 tablespoons sugar, and 1 teaspoon cinnamon in small bowl. Place kitchen towel on work surface. Place 1 phyllo sheet atop towel with short end toward edge of work surface (cover remaining phyllo with plastic wrap, then damp kitchen towel). Brush phyllo sheet with some melted butter; sprinkle with 1/8 of breadcrumb mixture. Top with second phyllo sheet. Brush with some melted butter; sprinkle with 1/8 of breadcrumb mixture. Repeat with 2 more phyllo sheets, brushing each with melted butter and sprinkling each with 1/8 of breadcrumb mixture. Top with fifth phyllo sheet; brush with some melted butter (do not sprinkle with breadcrumb mixture).",
        "Using slotted spoon, place half of fig mixture along 1 short side of phyllo stack; spread in 3-inch-wide strip, leaving 1-inch plain border on long sides. Sprinkle 1/2 tablespoon sugar and 1/4 teaspoon cinnamon over fig mixture. Fold long sides of phyllo in over filling; brush folded sides with melted butter. Starting at filled short side, roll up phyllo, enclosing filling completely. Brush all over with melted butter. Place strudel, seam side down, on baking sheet. Repeat assembly process to make second strudel. (Can be made 1 day ahead. Cover with plastic wrap; chill.)",
        "Position rack in center of oven and preheat to 375°F. Brush strudels lightly with melted butter. Bake until golden brown, about 20 minutes. Cool 10 minutes. (Can be prepared 6 hours ahead. Let stand at room temperature.) Using serrated knife, cut each strudel on diagonal into 4 pieces; discard ends. Place 1 piece on each of 8 plates. Dollop Ginger Cream alongside. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 pounds fresh figs, stemmed, each cut into 6 wedges (about 5 cups)",
        "1 1/2 pounds firm but ripe pears",
        "1/2 cup sugar",
        "1/2 cup frozen cranberry-raspberry concentrate, thawed",
        "1 1/2 teaspoons grated lemon peel",
        "6 tablespoons dry breadcrumbs",
        "4 tablespoons sugar",
        "1 1/2 teaspoons ground cinnamon",
        "10 frozen phyllo sheets, thawed",
        "3/4 cup (1 1/2 sticks) unsalted butter, melted",
        "Ginger Cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Dessert",
        "Bake",
        "Fig",
        "Pear",
        "Fall",
        "Phyllo/Puff Pastry Dough",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear and Fig Strudels with Ginger Cream",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-fig-strudels-with-ginger-cream-105695"
}
