{
    "directions": [
        "Whisk flour, cornmeal, 1/4 cup sugar, baking powder, and 1/2 teaspoon coarse salt in large bowl. Add chilled butter; rub in with fingertips until mixture resembles coarse meal. Add cream; stir just until moistened. Gather dough together; form into 8-inch-long log. Cut log crosswise into eight 1-inch-thick rounds. Spread 3 tablespoons sugar on plate. Dip 1 cut side of each biscuit into melted butter, then dip buttered side in sugar. Place biscuits, sugared side up, on platter; sprinkle any remaining sugar over top. Cover and chill.",
        "Preheat oven to 375°F. Butter 13x9x2-inch glass baking dish. Place pears in large bowl. Add next 5 ingredients; toss. Let stand 10 minutes, tossing occasionally.",
        "Transfer pear filling to prepared dish. Dot with diced butter. Cover dish with foil. Bake until pears are almost tender, about 50 minutes. Remove dish from oven; stir dried blueberries into pear filling. Place biscuits atop filling. Continue to bake uncovered until filling is bubbling thickly, biscuits are pale golden, and tester inserted into biscuits comes out clean, about 35 minutes longer (biscuits may look cracked). Cool 30 minutes. Serve warm with ice cream."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "2/3 cup stone-ground cornmeal (medium grind)",
        "1/4 cup plus 3 tablespoons sugar, divided",
        "2 teaspoons baking powder",
        "1/2 teaspoon coarse kosher salt",
        "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch cubes, plus 3 tablespoons unsalted butter, melted",
        "2/3 cup chilled heavy whipping cream",
        "6 pounds firm but ripe Seckel pears, Taylor Gold pears, or Bosc pears, peeled, cored, cut into 1/2- to 3/4-inch pieces (about 12 cups)",
        "1 cup apple juice",
        "1/4 cup fresh lemon juice",
        "3 tablespoons cornstarch",
        "1 teaspoon (scant) coarse kosher salt",
        "1/2 teaspoon freshly grated nutmeg",
        "2 tablespoons (1/4 stick) chilled unsalted butter, diced",
        "1 1/2 cups dried wild blueberries (9 ounces)",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Thanksgiving",
        "Kid-Friendly",
        "High Fiber",
        "Frozen Dessert",
        "Blueberry",
        "Dried Fruit",
        "Pear",
        "Cornmeal",
        "Fall",
        "Family Reunion",
        "Potluck",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear Cobbler with Dried Blueberries and Stone-Ground Corn Biscuits",
    "url": "http://www.epicurious.com/recipes/food/views/pear-cobbler-with-dried-blueberries-and-stone-ground-corn-biscuits-350430"
}
