{
    "directions": [
        "Whisk together flour, sugar, and salt in a large bowl. Blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Beat together yolk and water with a fork and stir into flour mixture until combined well.",
        "Knead mixture gently in bowl with floured hands just until a dough forms. Turn dough out onto a lightly floured surface and knead gently 4 or 5 times more. Form dough into a ball, then flatten into a 5-inch disk.",
        "Chill, wrapped tightly in plastic wrap, at least 1 hour.",
        "Preheat oven to 350°F with rack in middle.",
        "Roll out dough on a lightly floured surface with a floured rolling pin into a 13-inch round.",
        "Slide bottom of tart pan (separate from rim) under dough and set into rim of tart pan. Cut off excess dough, leaving 1/2-inch overhang, and fold overhang inward. Press dough against side of pan, pushing dough 1/4 inch above rim. Lightly prick bottom of shell all over with a fork and chill until firm, 10 to 15 minutes.",
        "Line shell with foil and fill with pie weights. Bake until side is set and edge is pale golden, 20 to 30 minutes.",
        "Carefully remove weights and foil and bake shell until golden, 15 to 25 minutes more. Leave oven on.",
        "Put a heavy baking sheet in oven. Peel and core pears, then cut lengthwise into 1/4-inch slices. Toss pears with 1 tablespoon pear brandy in a bowl, then arrange, overlapping, in tart shell. Put a pie shield on tart pan or cover rim with foil and transfer to baking sheet in oven. Bake just until pears are barely tender, 10 to 12 minutes. Leave oven on.",
        "Whisk together eggs, yolk, sugar, vanilla, crème fraîche, a pinch of salt, and remaining 1 tablespoons pear brandy until smooth. Pour over pears.",
        "Bake until custard is just set 2 inches from edge, about 18 minutes. Remove from oven and remove pie shield.",
        "Stir together all topping ingredients, then gently sprinkle over custard and bake until top is pale golden, about 15 minutes more. Cool tart to warm or room temperature in pan on a rack."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1 1/2 tablespoons sugar",
        "1/4 teaspoon salt",
        "7 tablespoons cold unsalted butter, cut into 1/2-inch cubes",
        "1 large egg yolk",
        "2 1/2 tablespoons cold water",
        "2 firm-ripe Anjou or Bartlett pears (1 pound total)",
        "2 1/2 tablespoons poire William (French pear brandy) or Cognac, divided",
        "2 large eggs plus 1 large yolk",
        "3 tablespoons sugar",
        "1/4 teaspoon pure vanilla extract",
        "2/3 cup crème fraîche or heavy cream",
        "1 cup sliced almonds with skins (3 1/2 ounce)",
        "1/4 cup sugar",
        "1 large egg white",
        "Equipment: A 9- to 9 1/2-inch fluted round tart pan with removable bottom; pie weights or raw rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Pear",
        "Almond",
        "Eau de Vie",
        "Winter",
        "Chill",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear and Almond Tart",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-almond-tart-241727"
}
