{
    "directions": [
        "Combine water and sugar in medium skillet. Scrape in seeds from vanilla bean; add bean. Stir over medium heat until sugar dissolves. Add pear halves, cover and simmer 6 minutes. Turn pears over; simmer until just tender, about 6 minutes longer. Using slotted spoon, transfer pears to plate. If necessary, boil syrup until reduced to 3 tablespoons; reserve.",
        "Preheat oven to 400°F. Line large baking sheet with foil. Roll out pastry on floured surface to 17 x 11-inch rectangle (scant 1/8 inch thick). Cut into six 4 1/2 x 5 1/2-inch rectangles (reserve remainder for another use). Cut off 1/2-inch-wide strip from each long side of rectangles, then cut off 1/2-inch-wide strip from each short side. Brush strips with egg glaze. Place 2 long strips, glazed side down, atop long edges of each rectangle. Place short strips, glazed side down, atop short edges; trim to fit.",
        "Transfer pastries to prepared baking sheet. Top each pastry with 2 slices almond paste. Thinly slice each pear half crosswise; fan slightly. Place 1 pear half in center of each pastry, arranging to fit.",
        "Bake tartlets until crusts are golden, about 25 minutes. Transfer to plates. Rewarm reserved syrup; brush over pears. Serve warm or at room temperature."
    ],
    "ingredients": [
        "3/4 cup water",
        "1/4 cup sugar",
        "1/2 vanilla bean, split lengthwise",
        "3 firm but ripe small Bosc pears, peeled, halved, cored",
        "1 sheet frozen puff pastry (half of 17 1/4-ounce package), thawed",
        "1 egg, beaten to blend (for glaze)",
        "12 1/8-inch-thick slices almond paste (about 3 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Cocktail Party",
        "Thanksgiving",
        "Pear",
        "Almond",
        "Fall",
        "Winter"
    ],
    "title": "Pear-Almond Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/pear-almond-tartlets-4619"
}
