{
    "directions": [
        "Combine the flour, sugar and salt in a food processor. Add the cold butter and pulse ten times until the butter is the size of large peas. Add 3 tablespoons of cold water and pulse until it comes together. Turn onto a lightly floured work surface and bring the dough together, forming a disk. Wrap in Reynolds® Parchment Paper and refrigerate for at least 45 minutes.",
        "On a lightly floured work surface, roll the dough to 1/8-inch thickness. Fill a 9-inch tart mold or rectangle tart mold with the dough. Cut off excess from the top and refrigerate for another 15 minutes.",
        "Preheat oven to 400 degrees F. Cover the top of the dough with Reynolds Wrap(R) Aluminum Foil and weigh down with pie weights or dry beans. Bake for 15 minutes. Remove the foil and pie weights and let cool.",
        "Combine the hazelnuts and sugar in the food processor. Pulse to a fine powder. Add the butter, egg, flour, vanilla, rum and salt. Process until it comes together as a paste.",
        "Spread the mixture over the partially baked tart. On the top, arrange the pear slices in a pattern. Bake the tart for 30 to 35 minutes until golden brown. Let it cool for 10 minutes before slicing."
    ],
    "ingredients": [
        "Dough:",
        "1 1/4 cups all-purpose flour (or gluten-free flour mix)",
        "1 teaspoon sugar",
        "1/4 teaspoon salt",
        "8 tablespoons cold unsalted butter, cut into 1/2-inch cubes",
        "3 tablespoons cold water, or more as needed",
        "Reynolds® Parchment Paper",
        "Reynolds Wrap® Aluminum Foil",
        "Filling:",
        "3 ounces hazelnuts",
        "1/2 cup sugar",
        "8 tablespoons unsalted butter, at room temperature",
        "1 egg",
        "1/2 cup all-purpose flour (or gluten-free flour mix)",
        "1 tablespoon vanilla extract",
        "1 tablespoon dark rum (optional)",
        "1/2 teaspoon kosher salt",
        "3 pears - peeled, cored and sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pear and Hazelnut Frangipane Tart",
    "url": "http://allrecipes.com/recipe/245237/pear-and-hazelnut-frangipane-tart/"
}
