{
    "directions": [
        "Whisk all ingredients in heavy small saucepan over low heat until butter melts. Cool until slightly thickened, whisking occasionally. (Can be made 3 days ahead; chill.)",
        "Blend milk and eggs in blender until smooth. Add flour, butter, sugar and salt; blend until smooth batter forms. Chill 1 hour and up to 2 hours. Reblend for 10 seconds before using.",
        "Heat nonstick skillet with 8-inch bottom over medium-high heat; brush with oil. Pour scant 3 tablespoons batter into skillet. Rotate and shake skillet to spread batter over bottom. Cook until crêpe is brown at edges and appears dry on top, about 20 seconds. Turn crêpe over. Cook until brown spots form on bottom of crêpe, about 12 seconds. Turn crêpe out onto paper towel; cover with paper towel. Repeat, making about 26 crêpes and brushing skillet occasionally with oil. (Can be made 1 day ahead. Wrap; chill.)",
        "Mix currants and rum in small bowl; let stand 15 minutes. Melt butter in large skillet over medium-high heat. Mix in pears and 1/4 cup sugar. Cook until pears are tender and brown, stirring often, about 10 minutes; cool.",
        "Beat cream cheese, eggs, peel, vanilla and 1/4 cup sugar in bowl. Beat in ricotta cheese; stir in pear and currant mixtures. Chill at least 1 hour and up to 1 day.",
        "Preheat oven to 375°F. Butter 15x10x2-inch glass baking dish. Place 1 crêpe, spotted side up, on work surface. Shape 1/4 cup filling into 3-inch-long log in center of crêpe. Fold bottom of crêpe over filling. Fold in sides; roll up. Place seam side down in prepared dish. Repeat with remaining filling and crêpes.",
        "Cover dish with foil. Bake blintzes until thermometer inserted into center of filling registers 160°F to 170°F, about 45 minutes. Place 2 blintzes on each plate. Whisk sauce over low heat until just warm and smooth. Serve blintzes with sauce."
    ],
    "ingredients": [
        "1 cup pure maple syrup",
        "1 cup (2 sticks) unsalted butter",
        "3/4 teaspoon ground cinnamon",
        "1/2 teaspoon ground allspice",
        "2 cups whole milk",
        "6 large eggs",
        "1 1/3 cups all purpose flour",
        "3 tablespoons unsalted butter, melted",
        "2 tablespoons sugar",
        "1/2 teaspoon salt",
        "Vegetable oil",
        "1/4 cup dried currants",
        "1 1/2 tablespoons dark rum",
        "1 tablespoon unsalted butter",
        "4 firm Bosc pears, peeled, cored, cut into 1/4-inch cubes",
        "1/2 cup sugar",
        "1 8-ounce package cream cheese, room temperature",
        "2 large eggs",
        "2 teaspoons grated lemon peel",
        "1/2 teaspoon vanilla extract",
        "1 15-ounce container ricotta cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Cheese",
        "Dairy",
        "Fruit",
        "Breakfast",
        "Brunch",
        "Dessert",
        "Rosh Hashanah/Yom Kippur",
        "Cream Cheese",
        "Ricotta",
        "Currant",
        "Dried Fruit",
        "Pear",
        "Spice",
        "Fall",
        "Winter",
        "Maple Syrup",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear and Ricotta Blintzes with Spiced Maple-Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-ricotta-blintzes-with-spiced-maple-butter-sauce-104046"
}
