{
    "directions": [
        "Place pears into a large stock pot, add water to cover, and boil until tender, about 20 minutes. Drain and cool. When pears are cool, peel, core, and coarsely chop.",
        "Place pears, onions, green bell peppers, and jalapeno peppers into a food processor, working in batches if necessary, and chop the pears and vegetables finely. Transfer pears and vegetables, including any juice, to a large pot.",
        "Stir vinegar, sugar, prepared mustard, and salt into the pear mixture and bring to a boil; reduce heat to medium-low and simmer until flavors have blended and relish is thickened, about 1 hour.",
        "Sterilize jars and lids in boiling water for at least 5 minutes. Pack pear relish into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for about 20 minutes or the amount of time recommended for your area.",
        "Remove the jars from the stockpot and cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "12 large pears",
        "3 large onions, coarsely chopped",
        "3 large green bell peppers, seeded and coarsely chopped",
        "4 jalapeno peppers, coarsely chopped",
        "2 cups apple cider vinegar",
        "2 cups white sugar",
        "9 ounces prepared mustard",
        "1 tablespoon salt",
        "10 (1 pint) canning jars with lids and rings, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pear Relish",
    "url": "http://allrecipes.com/recipe/222276/pear-relish/"
}
