{
    "directions": [
        "Cook unsalted butter in large nonstick skillet over mediumhigh heat until beginning to brown. Add pear halves, cut side down, to skillet. Drizzle honey over pears and swirl pan slightly to blend butter and honey. Reduce heat to medium, cover, and cook until pears are tender when pierced with paring knife, swirling skillet occasionally and adding a few tablespoons water to skillet if caramel sauce turns deep amber before pears are tender, about 12 minutes.",
        "Transfer pears, cut side up, to serving platter. Top pears with cheese. Return skillet with caramel sauce to medium-high heat; add pine nuts to skillet and sprinkle lightly with sea salt. Cook until sauce in skillet is brown and bubbling, about 2 minutes. Spoon sauce over pears and serve.",
        "Finish this meal on a sweet note with a late-harvest dessert wine. The honeyed pear and quince flavors of the 2006 \"Le Vol des Anges\" ($30) from California's Bonny Doon Vineyard are perfect with this dessert. Plus, the Roussanne grapes the wine is made from are produced using biodynamic practices."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter",
        "3 firm but ripe Bosc pears or other pears, peeled, halved lengthwise, cored",
        "3 1/2 tablespoons mild honey (such as orange blossom or clover)",
        "4 ounces artisanal cheese (such as Point Reyes Original Blue, Humboldt Fog, dry Monterey Jack, sheep's-milk ricotta, tangy soft fresh goat cheese, or other local cheese), sliced or crumbled, room temperature",
        "3 tablespoons pine nuts",
        "Pinch of fine sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dessert",
        "Quick & Easy",
        "High Fiber",
        "Pear",
        "Pine Nut",
        "Winter",
        "Honey",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pears in Honey and Pine Nut Caramel with Artisanal Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/pears-in-honey-and-pine-nut-caramel-with-artisanal-cheese-241350"
}
