{
    "directions": [
        "Arrange 1 sheet of phyllo on a work surface (keep remaining sheets covered), then brush with some butter and sprinkle with 1 tablespoon sugar. Cut sheet in half crosswise to form 2 rectangles and crumple each into a peaked free-form round, about 4 inches in diameter. Transfer to a baking sheet with a metal spatula and form 4 more crisps in same manner with remaining phyllo, butter, and sugar. Let dry, uncovered, at room temperature at least 8 hours.",
        "Put oven rack in middle position and preheat oven to 500°F.",
        "Bake crisps until golden, 2 to 4 minutes (watch closely, since they burn easily). Transfer with spatula to a rack to cool.",
        "Whisk together yolks and 2 tablespoons sugar in a metal bowl. Sift flour and cornstarch into bowl and whisk until combined well.",
        "Scrape seeds from vanilla beans with a sharp knife into a small heavy saucepan, reserving pods for another use. Add milk and remaining 2 tablespoons sugar and bring to a boil.",
        "Add hot milk to egg mixture in a stream, whisking, and transfer to saucepan. Simmer, whisking, 3 minutes, then remove pan from heat and whisk in butter.",
        "Force pastry cream through a fine-mesh sieve into a bowl and chill, its surface covered with wax paper, 1 hour.",
        "Beat together butter, sugar, flours, and salt in a bowl with an electric mixer at medium speed until pale and fluffy, 1 to 2 minutes. Add egg and beat well.",
        "Put oven rack in middle position and preheat oven to 300°F.",
        "Peel pears, then quarter lengthwise and core. Melt butter in a 12-inch ovenproof heavy skillet over moderately high heat until foam subsides, then sauté pears, turning occasionally, 2 minutes. Sprinkle sugar over pears and cook, turning occasionally, until sugar is melted and pears begin to turn pale golden, about 5 minutes.",
        "Transfer skillet to oven and roast pears until very tender, 5 to 7 minutes, then cool to room temperature.",
        "Increase oven temperature to 350°F. Butter ramekins generously and coat with sugar, knocking out excess.",
        "Whisk pastry cream into almond cream until combined well. Spread 1/4 cup cream evenly in bottom of 1 ramekin and top with 2 pieces of pear. Spread another 1/4 cup cream over pears and top with 2 more pieces of pear. Repeat in remaining 5 ramekins. Arrange ramekins on a baking sheet and bake clafoutis until puffed and golden, 30 to 35 minutes. Cool in ramekins on a rack 1 hour.",
        "Put 1 clafoutis (in ramekin) on each of 6 large plates and top each with a phyllo crisp. Serve cider sauce and quince sorbet on the side."
    ],
    "ingredients": [
        "3 (17- by 12-inch) phyllo sheets, stacked and covered with 2 sheets of plastic wrap and a dampened kitchen towel",
        "2 tablespoons unsalted butter, melted",
        "3 tablespoons sugar",
        "6 large egg yolks",
        "1/4 cup sugar",
        "2 tablespoons all-purpose flour",
        "2 tablespoons cornstarch",
        "2 vanilla beans, halved lengthwise",
        "2 cups whole milk",
        "1 tablespoon unsalted butter",
        "5 tablespoons unsalted butter, softened",
        "1/3 cup sugar",
        "1/4 cup plus 2 tablespoons almond flour",
        "2 tablespoons all-purpose flour",
        "1/4 teaspoon salt",
        "1 large egg",
        "6 firm-ripe small Bosc pears (2 pounds total)",
        "3 tablespoons unsalted butter plus additional for ramekins",
        "3 tablespoons sugar plus additional for coating ramekins",
        "Special equipment: 6 (8-ounce) ramekins (3 3/4 inches in diameter and 1 3/4 inches deep)",
        "Accompaniments: cider sauce and quince sorbet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Pear",
        "Almond",
        "Vanilla",
        "Fall",
        "Chill",
        "Phyllo/Puff Pastry Dough",
        "Ramekin",
        "Gourmet"
    ],
    "title": "Pear Clafoutis with Phyllo Crisps, Cider Sauce, and Quince Sorbet",
    "url": "http://www.epicurious.com/recipes/food/views/pear-clafoutis-with-phyllo-crisps-cider-sauce-and-quince-sorbet-108702"
}
