{
    "directions": [
        "Finely grind nuts, sugar and salt in processor. Blend in flour. Add butter and cut in using on/off turns until butter is in rice-size pieces. Blend in 4 tablespoons ice water, adding more water by tablespoonfuls until dough comes together in moist clumps. Gather dough into ball. Divide in half; flatten into disks. Wrap each in plastic; refrigerate until cold, about 45 minutes. (Can be made 1 day ahead. Let soften slightly at room temperature before rolling out.)",
        "Preheat oven to 400°F. Combine first 5 ingredients in large bowl. Add pears and toss to blend.",
        "Roll out 1 dough disk on lightly floured surface to 12-inch round. Transfer to 9-inch-diameter glass pie dish; fill with pear mixture. Roll out second dough disk on lightly floured surface to 12-inch round; place atop filling. Trim overhang of top and bottom crusts to 1/4 inch; press together and fold under. Crimp edge decoratively. Cut several slits in top crust to allow steam to escape.",
        "Bake pie 20 minutes. Reduce oven temperature to 350°F. Bake pie until juices bubble thickly through vents and crust is golden, about 50 minutes longer. Cool pie on rack 45 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1/2 cup hazelnuts (about 2 ounces), toasted, husked, cooled",
        "4 1/2 teaspoons sugar",
        "1/2 teaspoon salt",
        "2 1/2 cups unbleached all purpose flour",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/4-inch pieces",
        "6 tablespoons (about) ice water",
        "1 cup dried figs (about 7 ounces), stemmed, quartered",
        "1/2 cup sugar",
        "2 tablespoons unbleached all purpose flour",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon grated lemon peel",
        "2 1/4 pounds pears, peeled, quartered, cored, thinly sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fruit",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Fig",
        "Pear",
        "Winter",
        "Hazelnut",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear and Fig Pie with Hazelnut Crust",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-fig-pie-with-hazelnut-crust-5870"
}
