{
    "directions": [
        "Mix both flours, sugar and salt in processor. Add butter and shortening. Using on/off turns, process until butter and shortening form pea-size pieces. Mix in enough ice water to form moist clumps. Gather dough into ball; flatten into disk. Wrap in plastic and refrigerate until firm, about 1 hour. (Can be prepared 3 days ahead. Keep refrigerated.)",
        "Position rack in center of oven and preheat oven to 400°F. Combine first 6 ingredients in large bowl. Toss to blend. Let stand until juices form, about 15 minutes.",
        "Roll out dough on lightly floured work surface to 1 1/2-inch round. Transfer dough to unrimmed baking sheet. Mound filling atop dough, leaving 2-inch border. Fold dough border over filling to form 7-inch round, pleating loosely and pinching to seal any cracks in dough. Brush crust and fruit with egg, then sprinkle with 1 tablespoon sugar.",
        "Bake crostata until crust is golden and juices bubble thickly, about 40 minutes. Transfer baking sheet to rack; cool 10 minutes. Slide metal spatula under crust to free from baking sheet. Cool crostata to lukewarm. Using large tart pan bottom as aid, transfer crostata to platter.",
        "Whip cream, honey and five-spice powder in medium bowl until stiff. Serve crostata lukewarm or at room temperature with whipped cream.",
        "*A blend of ground anise, cinnamon, star anise, cloves and ginger, available in the spice section of most supermarkets."
    ],
    "ingredients": [
        "1 cup unbleached all purpose flour",
        "2 tablespoons whole wheat flour",
        "2 tablespoons sugar",
        "1/4 teaspoon salt",
        "1/4 cup (1/2 stick) unsalted butter, chilled, cut into 1/2-inch pieces",
        "1/4 cup solid vegetable shortening, chilled, cut into 1/2-inch pieces",
        "2 tablespoons (or more) ice water",
        "2 Granny Smith apples (about 12 ounces), peeled, quartered, cored, thinly sliced crosswise",
        "1 firm but ripe Anjou pear (about 6 ounces), peeled, quartered, cored, thinly sliced crosswise",
        "3 tablespoons (packed) golden brown sugar",
        "2 1/2 tablespoons minced crystallized ginger",
        "1 tablespoon unbleached all purpose flour",
        "2 teaspoons fresh lemon juice",
        "1 large egg (beaten to blend)",
        "1 tablespoon sugar",
        "1/2 cup chilled whipping cream",
        "1 tablespoon honey",
        "1/2 teaspoon Chinese five-spice powder*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Apple",
        "Pear",
        "Spice",
        "Spring",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear and Apple Crostata with Five-Spice Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-apple-crostata-with-five-spice-whipped-cream-103168"
}
