{
    "directions": [
        "Bring cream, milk, and ginger to simmer in heavy medium saucepan over medium-high heat. Remove pan from heat; steep 15 minutes. Whisk yolks and sugar in medium bowl to blend. Gradually whisk in warm cream mixture; return mixture to saucepan. Stir over medium heat until custard thickens and leaves path on back of spoon when finger is drawn across, about 8 minutes; do not boil. Strain sauce into medium bowl; mix in vanilla. Cover; chill until cold, at least 3 hours and up to 1 day.",
        "Whisk 1 cup sugar, cornstarch, and mace to blend in small bowl. Whisk cookie crumbs and remaining 1/4 cup sugar in another small bowl to blend. Set both mixtures aside.",
        "Melt 1/4 cup butter in heavy large skillet over medium heat. Add dried pears and pear brandy. Cover and simmer until brandy is absorbed, about 5 minutes. Mix in fresh pears and lemon peel. Sauté until pears are just tender, about 10 minutes. Add cornstarch mixture. Bring to boil and cook until filling thickens, stirring constantly, about 3 minutes; cool completely.",
        "Line large baking sheet with parchment paper. Place 1 phyllo sheet on work surface (keep remaining phyllo covered with damp towel). Brush phyllo with melted butter. Top with second phyllo sheet; brush with butter and sprinkle with 1 tablespoon gingersnap crumb mixture. Repeat with 5 more phyllo sheets, butter and crumb mixture. Top with phyllo (8 sheets total); brush with butter. Starting 2 inches in from 1 long side and 21/2 inches in from 1 short side, spoon half of filling in 3-inch-wide by 12-inch-long log parallel to long side. Fold short sides over ends of filling; butter folded edges. Fold nearest long side of phyllo over filling and roll up strudel, enclosing filling. Transfer strudel to prepared sheet, seam side down. Brush with butter. Repeat with remaining ingredients to make second strudel. Place on same sheet, spacing 3 inches from first strudel. (Can be made 1 day ahead. Cover with plastic and refrigerate.)",
        "Preheat oven to 375°F. Bake strudels until golden brown, about 30 minutes. Cut each on diagonal into 6 slices and serve warm or at room temperature with cold ginger sauce."
    ],
    "ingredients": [
        "1 cup whipping cream",
        "1 cup whole milk",
        "2 tablespoons minced peeled fresh ginger",
        "6 large egg yolks",
        "1/2 cup sugar",
        "1 teaspoon vanilla extract",
        "1 1/4 cups sugar",
        "3 tablespoons cornstarch",
        "1/4 teaspoon ground mace or nutmeg",
        "3/4 cup gingersnap cookie crumbs",
        "1/4 cup (1/2 stick) unsalted butter",
        "1/2 cup diced dried pears (about 3 ounces)",
        "1/4 cup Poire Williams (clear pear brandy) or brandy",
        "6 ripe Bartlett or Anjou pears (about 3 3/4 pounds), peeled, cored, cut into 1/2-inch cubes",
        "1 teaspoon grated lemon peel",
        "16 sheets fresh phyllo pastry or frozen, thawed",
        "1 cup (2 sticks) unsalted butter, melted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Pear",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear-Ginger Strudel with Ginger-Custard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pear-ginger-strudel-with-ginger-custard-sauce-105841"
}
