{
    "directions": [
        "Heat 1 tablespoon olive oil in a skillet over medium heat. Cook and stir couscous in the hot oil until toasted and fragrant, 3 to 4 minutes. Add 2 1/2 cups water to couscous and bring to a boil; cover skillet and cook until couscous is tender, about 10 minutes. Rinse couscous in a colander with cold water and transfer to a bowl. Mix 1/4 cup olive oil into couscous and stir to coat.",
        "Place lentils in a small pan and cover with water; bring to a boil. Reduce heat to medium-low and simmer until lentils are tender, 15 to 20 minutes. Drain and rinse lentils under cold water in a colander; add to couscous.",
        "Mix tomatoes, cucumber, red bell pepper, cranberries, raisins, red onion, chives, parsley, green onion, and sumac into couscous-lentil mixture.",
        "Beat 1/4 cup olive oil, lemon juice, honey, salt, and pepper together in a bowl; pour over couscous-lentil mixture and stir until coated. Refrigerate salad for flavors to blend, 8 hours to overnight."
    ],
    "ingredients": [
        "5 tablespoons olive oil, divided",
        "2 cups pearl (Israeli) couscous",
        "2 1/2 cups water",
        "1/2 cup French lentils",
        "water to cover",
        "2 Roma (plum) tomatoes, diced",
        "1 small cucumber, seeded and diced",
        "1 red bell pepper, diced",
        "1/2 cup dried cranberries",
        "1/2 cup golden raisins",
        "1/3 cup diced red onion",
        "1/4 cup 1/2-inch slices of fresh chives (optional)",
        "2 tablespoons chopped flat-leaf parsley, or more to taste",
        "1 green onion, thinly sliced",
        "1 teaspoon ground sumac (optional)",
        "Dressing:",
        "1/4 cup olive oil",
        "2 lemons, juiced",
        "2 tablespoons honey, or more to taste",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pearl Couscous Salad",
    "url": "http://allrecipes.com/recipe/239813/pearl-couscous-salad/"
}
