{
    "directions": [
        "Combine first 5 ingredients in heavy large saucepan. Scrape in seeds from vanilla bean; add bean. Bring to boil, stirring to dissolve sugar. Add pears, reduce heat, cover and simmer until pears are tender when pierced with knife, about 20 minutes. Stir in 1/4 cup anisette. Cool pears completely in syrup. Cover; chill in syrup overnight.",
        "Transfer pears to medium bowl. Cover and refrigerate pears. Boil poaching liquid in heavy large saucepan until reduced to 1 cup, about 35 minutes. Mix in remaining 1 tablespoon anisette. Cover and refrigerate liquid until cold, about 4 hours.",
        "Mix flour, 3 tablespoons sugar, aniseed and lemon peel in large bowl. Add milk, butter and vanilla and stir until dough forms. Cover dough with plastic wrap and let stand 30 minutes at room temperature. Roll dough out on lightly floured surface to thickness of 1/16 inch. Cut dough into 3 1/2 x 3/4-inch strips. Trim ends diagonally. Twist strips at center to create bow ties. (Can be prepared 1 day ahead. Place bow ties on cookie sheet. Cover tightly and refrigerate.)",
        "Line cookie sheet with paper towels. Heat 2 inches oil in heavy medium saucepan to 375°F. Add 4 bow-tie-pastries and cook until deep golden brown, turning occasionally, about 1 minute. Transfer to paper towels using slotted spoon. Repeat with remaining pastries in batches. Place sugar in large bowl. Add warm pastries and toss to coat.",
        "Arrange pears on plates. Place scoop of ice cream on one side of each plate. Drizzle poaching liquid over pears. Garnish with cookies and serve."
    ],
    "ingredients": [
        "1 750-ml bottle dry red wine",
        "1 cup water",
        "1 cup sugar",
        "4 whole cloves",
        "4 2x1-inch lemon peel strips",
        "1 vanilla bean, split lengthwise",
        "6 firm ripe pears, peeled",
        "1/4 cup plus 1 tablespoon anisette",
        "1 cup all purpose flour",
        "3 tablespoons powdered sugar",
        "1 tablespoon aniseed, chopped",
        "1 tablespoon (generous) minced lemon peel (yellow part only)",
        "1/4 cup milk",
        "3 tablespoons unsalted butter, melted",
        "1/2 teaspoon vanilla extract",
        "Vegetable oil (for deep frying)",
        "Powdered sugar",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Freeze/Chill",
        "Poach",
        "Pear",
        "Red Wine",
        "Spring",
        "Chill"
    ],
    "title": "Pears Poached in Spiced Red Wine with Bow-Tie Pastries",
    "url": "http://www.epicurious.com/recipes/food/views/pears-poached-in-spiced-red-wine-with-bow-tie-pastries-1901"
}
