{
    "directions": [
        "Preheat oven to 350 degrees F. Spread the nuts on a sheet pan in a single layer. Bake, shaking the pan occasionally, until the nuts are toasted and fragrant, about 7 to 10 minutes. Let the nuts cool, and then coarsely chop.",
        "Trim the stems of the watercress and arugula. Wash and dry the leaves.",
        "Meanwhile, whisk the vinegar and mustard together in a large salad bowl. Season with the 1/4 teaspoon salt and some pepper. Gradually whisk in the olive oil, starting with a few drops and then adding the rest in a steady stream, to make a smooth, slightly thick dressing.",
        "Halve the endive lengthwise, cut out core, then thinly slice crosswise and add all the lettuces to the bowl. Quarter and core the unpeeled pears and thinly slice; add to the salad. Scatter the cheese and nuts over the salad, and season with salt and pepper, to taste. Toss the salad gently to evenly dress all the greens. Divide among 4 plates and serve immediately."
    ],
    "ingredients": [
        "2/3 cup nuts (walnuts, pecans, almonds, or cashews)",
        "1 bunch watercress",
        "1 bunch arugula",
        "1 tablespoon cider vinegar",
        "2 teaspoons whole-grain mustard",
        "1/4 teaspoon kosher salt, plus more to taste",
        "Freshly ground black pepper",
        "3 tablespoons extra-virgin olive oil",
        "1 Belgian endive",
        "2 ripe pears, such as Anjou, Bartlett, or Comice",
        "2 ounces mild blue cheese (about 1/2 cup loosely packed crumbles)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Appetizer",
        "Appetizer",
        "Easy Recipes",
        "Easy Side Dish Recipes",
        "Easy Dinner Recipes",
        "Healthy Dinner",
        "Healthy",
        "American",
        "Salad Recipes",
        "Arugula",
        "Vegetable",
        "Fruit",
        "Pear Recipes",
        "Blue Cheese",
        "Cheese",
        "Low-Cholesterol",
        "Low Sodium",
        "Gluten Free",
        "Diabetes-Friendly",
        "High Fiber",
        "Low Calorie",
        "Low-Carb",
        "Fall"
    ],
    "title": "Pear and Blue Cheese Salad",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/pear-and-blue-cheese-salad-recipe"
}
