{
    "directions": [
        "Combine pear halves and 1 cup dessert wine in heavy medium saucepan. Scrape in seeds from vanilla bean; add bean. Bring wine to boil. Reduce heat, cover and simmer until pears are just tender, turning occasionally, about 10 minutes. Using slotted spoon, transfer pear halves to paper towels and drain well. Boil pear poaching liquid in saucepan until reduced to 2 tablespoons, about 7 minutes. Set glaze aside.",
        "Finely grind 2/3 cup unsalted pistachios and sugar in processor. Add unsalted butter and egg; blend just until filling is combined. (Can be prepared 1 day ahead. Cover pears and nut filling separately and refrigerate. Cover glaze and let stand at room temperature.)",
        "Unfold pastry sheets on work surface; press out folds. Using 4 1/4-inch scalloped round cookie cutter, cut out four rounds from each sheet. Using 3 1/2-inch round from cookie cutter, cut out one 3 1/2-inch round from each of four rounds (reserve 3 1/2-inch rounds for another use); set pastry rings aside. Brush egg glaze over outer edges of four 4 1/4-inch solid rounds. Pierce rounds all over with fork. Top each with one pastry ring. Transfer pastries to baking sheet. Freeze 15 minutes. (Can be prepared 1 day ahead; cover and keep frozen).",
        "Preheat oven to 375°F. Bake pastries 10 minutes, piercing centers with fork if centers rise. Remove from oven. Reduce oven temperature to 350°F.",
        "Spoon 1/4 of nut filling into center of each pastry. Slice pear halves and arrange atop filling, covering completely. Bake until pastries are golden brown, about 20 minutes. Cool pastries at least 30 minutes and up to 1 hour. Brush pears with glaze. Sprinkle chopped pistachios around pears. Garnish with fresh mint leaves and serve."
    ],
    "ingredients": [
        "3 small pears, peeled, halved, cored",
        "1 cup Essencia or other sweet dessert wine",
        "1/2 vanilla bean",
        "2/3 cup shelled unsalted pistachios (about 3 ounces)",
        "1/2 cup sugar",
        "3 tablespoons unsalted butter, room temperature",
        "1 large egg",
        "2 frozen puff pastry sheets (one 17 1/4-ounce package), thawed",
        "1 egg, beaten to blend (glaze)",
        "Finely chopped pistachios",
        "Fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Pear",
        "Pistachio",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear and Pistachio Puff Pastry Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-pistachio-puff-pastry-tartlets-2634"
}
