{
    "directions": [
        "Pulse granulated sugar, salt, and 3 cups flour in a food processor to combine. Add butter and shortening and pulse until mixture resembles coarse meal with a few pea-size pieces of butter remaining. Transfer to a large bowl.",
        "Whisk egg yolks, vinegar, and 1/2 cup ice water in a small bowl. Drizzle half of egg mixture over flour mixture and, using a fork, mix gently just until combined. Add remaining egg mixture and mix until dough just comes together (you will have some unincorporated pieces).",
        "Turn out dough onto a lightly floured surface, flatten slightly, and cut into quarters. Stack pieces on top of one another, placing unincorporated dry pieces of dough between layers, and press down to combine. Repeat process twice more (all pieces of dough should be incorporated at this point). Form dough into two 1\"-thick disks. Wrap in plastic; chill at least 1 hour.",
        "DO AHEAD: Dough can be made 2 days ahead. Keep chilled, or freeze up to 3 months.",
        "Bring granulated sugar, rosemary, and 1 1/2 cups wine to a boil; cook, stirring occasionally, until reduced to about 2/3 cup, 5–8 minutes. Strain through a fine-mesh sieve into a small bowl. Whisking constantly, gradually add butter and whisk until syrup is smooth.",
        "Whisk cornstarch, cinnamon, 5 teaspoons flour, and remaining 1/4 cup wine in a small saucepan set over medium heat; cook, whisking constantly, until thickened, about 1 minute. Slowly add syrup, whisking until smooth, then stir in vanilla and salt. Chill until cool, about 30 minutes.",
        "Place a rack in lower third of oven and preheat to 375°F. Toss pears and red wine syrup in a large bowl. Roll out 1 disk of dough on a lightly floured surface into a 14\" round. Transfer to a 9\" pie dish. Lift up edges and allow dough to slump down into dish. Trim, leaving about 1\" overhang. Pour filling into crust and chill.",
        "Meanwhile, roll out remaining disk of dough into a 14\" round. Using a pizza cutter or a sharp knife, cut into twelve 1\"-wide strips. Arrange 6 strips crosswise across top of pie, spacing about 1\" apart.",
        "Arrange remaining 6 strips lengthwise across top of pie, lifting crosswise strips and weaving lengthwise strips over and under to form a lattice. Brush edge of dough with beaten egg and press ends of strips and bottom crust together to seal. Trim strips to same length as bottom crust, then fold bottom crust over lattice strips; crimp edge. Brush crust with beaten egg and sprinkle with granulated sugar. Chill in freezer 15 minutes.",
        "Place pie dish on a rimmed baking sheet and bake 30 minutes. Reduce oven temperature to 350°F, rotate pie, and continue baking, tenting with foil if crust is browning too quickly, until juices are bubbling and crust is golden brown, 60–75 minutes longer. Transfer to a wire rack and let cool at least 4 hours before slicing.",
        "DO AHEAD: Pie can be baked 1 day ahead. Store wrapped tightly at room temperature."
    ],
    "ingredients": [
        "3 tablespoons granulated sugar",
        "1 1/2 teaspoon kosher salt",
        "3 cups all-purpose flour, plus more for dusting",
        "12 tablespoons (1 1/2 sticks) chilled unsalted butter, cut into pieces",
        "1/4 cup chilled vegetable shortening, cut into pieces",
        "2 large egg yolks",
        "1 teaspoon apple cider vinegar",
        "3/4 cup granulated sugar",
        "2 tablespoons chopped fresh rosemary",
        "1 3/4 cups dry red wine, divided",
        "2 tablespoons unsalted butter, cut into pieces",
        "5 teaspoons cornstarch",
        "1/2 teaspoon ground cinnamon",
        "5 teaspoons all-purpose flour plus more for dusting",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon kosher salt",
        "3 pounds firm but ripe pears (such as Comice, Anjou, or Bartlett), peeled, cored, thinly sliced",
        "1 large egg, beaten to blend",
        "3 tablespoons granulated sugar or raw sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Pear",
        "Rosemary",
        "Red Wine",
        "Christmas Eve",
        "Potluck",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear Pie with Red Wine and Rosemary",
    "url": "http://www.epicurious.com/recipes/food/views/pear-pie-with-red-wine-and-rosemary-51198540"
}
