{
    "directions": [
        "Preheat oven to 425°F with rack in lower third. Butter baking dish.",
        "Stir together pears, cranberries, sugar, orange zest, brandy and allspice in a large bowl. Transfer filling to baking dish and dot with butter.",
        "Cover dish tightly with foil and bake 20 minutes.",
        "Remove foil and continue to bake until cranberries burst and pears are just tender, 15 to 20 minutes more.",
        "Stir together flour, baking powder, and salt in a bowl, then add 3/4 cup plus 3 tablespoons cream and stir just until a dough forms. Gather dough into a ball and transfer to a lightly floured surface (dough will feel dense and heavy; don't worry.)",
        "Gently knead dough 6 times, then pat out into an 8-inch round (about 1/3-inch thick).",
        "Cut out as many rounds as possible with lightly floured cutter, transferring to a sheet of wax paper. Gather scraps and pat out once more, then cut out more rounds. (You will have about 16).",
        "Carefully but quickly, top hot fruit with biscuits, arranging in 1 layer. Brush biscuits with remaining tablespoon cream and sprinkle with sugar.",
        "Continue to bake cobbler until biscuits are puffed and golden, 15 to 20 minutes. Cool 15 minutes before serving and top with Citrus-Infused Custard Sauce."
    ],
    "ingredients": [
        "2 pounds firm Bartlett pears, peeled and cut into 1/2-inch wedges",
        "1 2/3 cups fresh cranberries (6 ounces)",
        "1 cup sugar",
        "2 (1- by 3-inch) strips orange zest, finely chopped",
        "1/4 cup brandy",
        "1/4 teaspoon ground allspice",
        "2 tablespoons unsalted butter, cut into bits",
        "1 1/2 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "rounded 1/4 teaspoon salt",
        "1 cup heavy cream, divided",
        "1 teaspoon sugar",
        "Citrus-Infused Custard Sauce",
        "<special>Special equipment: 2- to 2 1/2-quart shallow baking dish (1 1/2 - to 2-inches deep); 2-inch round cookie cutter</special>"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Cranberry",
        "Pear",
        "Fall",
        "Winter",
        "Christmas Eve",
        "Gourmet"
    ],
    "title": "Pear and Cranberry Cobbler with Citrus-Infused Custard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-cranberry-cobbler-with-citrus-infused-custard-sauce-369370"
}
