{
    "directions": [
        "In a 3-quart saucepan combine all poached pear ingredients except pears and boil, stirring, until sugar is dissolved. Peel pears and simmer in wine mixture, covered, turning occasionally, until firm-tender, about 20 minutes. Remove pan from heat and let stand, covered, turning pears occasionally for even color, about 30 minutes. Discard poaching mixture and halve pears lengthwise. Remove stems and with a melon-baller cutter or small knife remove core. Cut pears lengthwise into 3/4-inch-thick slices.",
        "Roll out dough 1/8 inch thick on a lightly floured surface. Fit dough into a 9-inch (1-quart capacity) pie plate and trim edge, leaving a 1/2-inch overhang. Cut edge of dough with scissors every 1/2 inch to form curved points and brush edge lightly with egg wash. Chill shell 30 minutes.",
        "Preheat oven to 375°F.",
        "In a large bowl whisk together filling ingredients until combined well.",
        "Pour filling into shell and bake in middle of oven 35 minutes. Remove pie from oven and arrange pears decoratively on top of filling. Bake pie 15 to 20 minutes more, or until custard is set and pears are tender. Cool pie on a rack and brush pears with jam. Chill pie, covered loosely, at least 4 hours and up to 2 days. Serve pie at room temperature with crème anglaise."
    ],
    "ingredients": [
        "1 tablespoon whole allspice berries",
        "1/2 vanilla bean, split lengthwise",
        "1 tablespoon freshly grated lemon zest (from about 2 lemons)",
        "4 cups dry red wine",
        "2 cups water",
        "1 cup sugar",
        "3 firm-ripe pears such as Bosc",
        "pastry dough for a single crust 9-inch pie",
        "an egg wash made by beating 1 large egg yolk with 1 teaspoon water",
        "3 large eggs",
        "3/4 cup heavy cream",
        "1 1/2 cups canned solid-pack pumpkin",
        "1/2 cup firmly packed light brown sugar",
        "2 teaspoons cinnamon",
        "1 teaspoon ground ginger",
        "3/4 teaspoon salt",
        "1 teaspoon ground allspice",
        "1/8 teaspoon freshly grated nutmeg",
        "1/4 cup apricot jam, heated and strained",
        "Accompaniment:ginger crème anglaise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Poach",
        "Thanksgiving",
        "Pear",
        "Apricot",
        "Pumpkin",
        "Chill",
        "Gourmet"
    ],
    "title": "Pear and Pumpkin Pie",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-pumpkin-pie-13291"
}
