{
    "directions": [
        "Blend first 4 ingredients in processor. Add butter; using on/off turns, process until mixture resembles coarse meal. Remove lid; spoon 3 tablespoons ice water over mixture. Return lid to processor; using on/off turns, blend mixture until dough forms ball, adding more ice water by teaspoonfuls if dry. Flatten dough into disk; wrap in plastic and chill at least 20 minutes. DO AHEAD: Can be made 2 days ahead. Keep chilled. Let dough soften slightly at room temperature before rolling out.",
        "Position rack in center of oven; preheat to 400°F. Whisk first 6 ingredients in large bowl. Add pears and figs; toss gently. Roll dough out on lightly floured parchment to 14-inch square or round. Transfer parchment with rolled-out crust to rimless baking sheet. Mound pear mixture with juices in center of crust, leaving 2- to 3-inch plain dough border. Using parchment as aid, fold dough up over edges of pear mixture, pleating edges and pinching to seal any cracks in dough, forming square or round. Brush crust edges with cream; sprinkle generously with raw sugar.",
        "Bake crostata until crust is golden, pears are tender, and juices are bubbling thickly, covering crust edges with foil if browning too quickly, 50 to 60 minutes. Remove crostata from oven; drizzle 2 tablespoons honey over hot filling. Run long thin knife or spatula around edges of warm crostata to loosen. Cool crostata on parchment on baking sheet until slightly warm, at least 1 hour. Transfer to platter. Serve slightly warm or at room temperature."
    ],
    "ingredients": [
        "1 2/3 cups unbleached all purpose flour",
        "1/3 cup cornmeal",
        "2 tablespoons sugar",
        "1 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "3 tablespoons (or more) ice water",
        "1/4 cup (packed) golden brown sugar",
        "1/4 cup sugar",
        "2 tablespoons cornstarch",
        "1 teaspoon (scant) ground cardamom",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon coarse kosher salt",
        "2 1/4 pounds firm but ripe unpeeled Anjou pears (about 4), cored, each cut into 8 wedges",
        "10 dried but moist Calimyrna figs (about 4 ounces), stemmed, quartered",
        "Heavy whipping cream (for brushing)",
        "Raw sugar",
        "2 tablespoons honey",
        "Special equipment: Rimless baking sheet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "High Fiber",
        "Fig",
        "Pear",
        "Honey",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear Crostata with Figs and Honey",
    "url": "http://www.epicurious.com/recipes/food/views/pear-crostata-with-figs-and-honey-361795"
}
