{
    "directions": [
        "Preheat oven to 350°F. Butter four 1 1/4-cup custard cups or soufflé dishes; place on rimmed baking sheet. Combine first 5 ingredients in large bowl; toss to coat. Divide filling among prepared custard cups. Dot with 2 tablespoons butter. Bake until filling is hot and bubbling around edges, about 20 minutes. Maintain oven temperature.",
        "Combine sugar and ginger in processor; blend until ginger is finely chopped. Transfer 1 tablespoon sugar-ginger mixture to small bowl; reserve. Add flour, baking soda, and salt to remaining sugar-ginger mixture in processor; blend 20 seconds. Add butter; using on/off turns, process until mixture resembles coarse meal. Transfer to medium bowl. Mix in chocolate chips, then buttermilk (mixture will be very moist).",
        "Drop topping by heaping tablespoonfuls onto filling in custard cups (about 4 very generous tablespoons for each); sprinkle with reserved 1 tablespoon sugar-ginger mixture. Bake until topping is golden brown and filling is bubbling thickly, about 20 minutes. Cool 20 minutes. Serve cobblers with ice cream."
    ],
    "ingredients": [
        "2 1/4 pounds firm but ripe Anjou, Bosc, or Comice pears, peeled, cored, cut into 3/4-inch dice",
        "1/2 cup dried tart cherries",
        "1/3 cup sugar",
        "1 tablespoon finely chopped crystallized ginger",
        "1 tablespoon all purpose flour",
        "2 tablespoons (1/4 stick) unsalted butter, cut into 1/2-inch cubes",
        "1/3 cup sugar",
        "1 1/2 tablespoons chopped crystallized ginger",
        "1 cup all purpose flour",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon salt",
        "5 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "1/3 cup mini semisweet chocolate chips",
        "1/2 cup chilled buttermilk",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Chocolate",
        "Ginger",
        "Dessert",
        "Bake",
        "Dried Fruit",
        "Pear",
        "Cherry",
        "Fall",
        "Ramekin"
    ],
    "title": "Pear and Dried Cherry Cobblers with Ginger-Chocolate Chip Biscuit Topping",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-dried-cherry-cobblers-with-ginger-chocolate-chip-biscuit-topping-230949"
}
