{
    "directions": [
        "Preheat oven to 425°F. Coarsely chop walnuts and in a shallow baking pan toast in middle of oven until a shade darker, about 4 minutes. (Leave oven on.) Peel, quarter, and core pears.",
        "In a deep 12-inch heavy skillet melt butter and sugar, stirring occasionally, and boil 1 minute. Add pears and cook over moderate heat, turning pears occasionally (be careful not to break them) and gently stirring syrup, until pears are glazed and syrup begins to thicken, about 20 minutes. Stir in rum and lemon juice and simmer, turning pears and gently stirring frequently, until most of syrup is evaporated and pears are tender and golden brown, about 10 minutes.",
        "Arrange pears, cored sides up, in a 10-inch (1 1/2-quart) glass pie plate and sprinkle with walnuts.",
        "On a lightly floured surface with a floured rolling pin roll out dough into a 12-inch round (a scant 1/4 inch thick) and drape over pears. Tuck edge between pears and rim of dish and with a knife cut several steam vents in pastry. Bake tart in middle of oven 20 minutes, or until juices are bubbling and crust is golden brown.",
        "Have ready a rimmed serving plate slightly larger than pie plate. Let tart stand 5 minutes.",
        "Invert serving plate over pie plate and, wearing oven mitts and keeping plates firmly pressed together, invert tart onto serving plate. Serve pear and walnut tart warm or at room temperature."
    ],
    "ingredients": [
        "1/2 cup walnuts",
        "4 pounds firm-ripe pears (preferably Bosc; about 8)",
        "1 stick (1/2 cup) unsalted butter",
        "1 cup sugar",
        "2 tablespoons dark rum",
        "2 tablespoons fresh lemon juice",
        "pastry dough"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Pear",
        "Walnut",
        "Fall",
        "Winter",
        "Gourmet"
    ],
    "title": "Pear and Walnut Tarte Tatin",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-walnut-tarte-tatin-15719"
}
