{
    "directions": [
        "Position rack in center of oven and preheat to 375°F. Place large sheet of parchment paper on work surface. Place crust dough atop parchment; roll out dough to 14-inch round. Transfer parchment with dough to large unrimmed baking sheet. Whisk egg and cream in small bowl. Brush center 10 inches of dough with some of egg glaze, leaving 2-inch plain border. Arrange pear slices in concentric circles atop glaze on dough. Sprinkle hazelnuts and both chocolates, then 4 tablespoons raw sugar over pears. Fold dough border over filling to form 11-inch round, pleating loosely and pinching to seal any cracks in dough. Brush crust with egg glaze; sprinkle with remaining 2 tablespoons raw sugar, then with 1/4 teaspoon sea salt, if desired.",
        "Bake crostata until crust is deep golden and pears are tender, about 40 minutes. Transfer baking sheet to rack. Run long thin knife under crust to free from parchment. Cool to lukewarm on parchment on sheet. Using large tart pan bottom as aid, transfer crostata to platter. Serve lukewarm or at room temperature."
    ],
    "ingredients": [
        "Easy Tart Crust",
        "1 large egg",
        "2 tablespoons whipping cream",
        "4 large firm but ripe Bosc pears, peeled, quartered, cored, each quarter cut lengthwise into 3 slices",
        "3 tablespoons chopped husked toasted hazelnuts",
        "2 tablespoons coarsely chopped imported milk chocolate",
        "2 tablespoons coarsely chopped bittersweet (not unsweetened) or semisweet chocolate",
        "6 tablespoons raw sugar, divided",
        "1/4 teaspoon coarse sea salt (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Pear",
        "Hazelnut",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear, Chocolate, and Hazelnut Crostata",
    "url": "http://www.epicurious.com/recipes/food/views/pear-chocolate-and-hazelnut-crostata-109283"
}
