{
    "directions": [
        "Whisk flour, sugar, lemon peel, and salt in medium bowl. Add butter; using fingertips, rub in butter until coarse meal forms. Drizzle 1/4 cup cream over; toss with fork until moist clumps form, adding more cream by teaspoonfuls as needed if dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled. Let stand at room temperature 30 minutes before rolling out.",
        "Preheat oven to 400°F. Mix all pears, sugar, flour, lemon juice, lemon peel, and nutmeg in large bowl to coat. Roll out pastry on sheet of floured parchment paper to 14-inch round. Transfer crust on parchment paper to baking sheet. Mound pears in center of pastry, leaving 2-inch plain border. Fold pastry border over pears, crimping slightly. Brush pastry edges with cream; sprinkle with sliced almonds.",
        "Bake croustade until filling bubbles and almonds are lightly toasted, about 1 hour. Cool slightly. Serve croustade warm or at room temperature with vanilla ice cream, if desired."
    ],
    "ingredients": [
        "1 1/2 cups all purpose flour",
        "2 tablespoons sugar",
        "1 teaspoon finely grated lemon peel",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut crosswise into 1/4-inch slices",
        "1/4 cup (or more) whipping cream",
        "1 pound firm but ripe Bartlett pears, peeled, cored, thinly sliced",
        "1 pound firm but ripe Bosc pears, peeled, cored, thinly sliced",
        "5 tablespoons sugar",
        "1 tablespoon plus 2 teaspoons all purpose flour",
        "2 teaspoons fresh lemon juice",
        "1 teaspoon finely grated lemon peel",
        "1/4 teaspoon (generous) ground nutmeg",
        "Whipping cream (for brushing)",
        "2 tablespoons sliced almonds",
        "Vanilla ice cream (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Lemon",
        "Pear",
        "Almond",
        "Fall",
        "Kidney Friendly"
    ],
    "title": "Pear Croustade with Lemon Pastry and Almonds",
    "url": "http://www.epicurious.com/recipes/food/views/pear-croustade-with-lemon-pastry-and-almonds-240089"
}
