{
    "directions": [
        "Bring 1/2 cup water and sugar to boil in heavy small saucepan, stirring until sugar dissolves. Remove from heat. Mix in raisins and rum. Let soak 1 hour. Drain raisins.",
        "Meanwhile, heat honey in large nonstick skillet over medium heat. Add pears; sauté just until tender, about 2 minutes. Cool. Mix in raisins.",
        "Preheat oven to 350°F. Butter eight 1 1/4-cup custard cups, then sprinkle with sugar. Place cups on baking sheet. Place 8 bread slices on work surface. Cut out 1 round from each slice to fit cup bottoms. Line cup bottoms with bread rounds. Cut enough of remaining bread slices into strips wide enough to line cup sides; line cup sides completely with strips, cutting to fit. Cut enough of remaining bread into 1/2-inch cubes to measure 4 cups.",
        "Whisk cream, sugar, eggs, rum, and vanilla in large bowl to blend well. Add 4 cups bread cubes and fruit mixture; stir to blend. Divide among prepared cups.",
        "Bake charlottes until center is puffed and set, about 55 minutes. (Can be made 2 hours ahead. Let stand at room temperature. Warm in 350°F oven for 7 minutes.) Run knife around sides of charlottes. Invert onto plates. Spoon crème anglaise over warm charlottes."
    ],
    "ingredients": [
        "1/2 cup water",
        "1/4 cup sugar",
        "3/4 cup golden raisins",
        "1/4 cup dark rum",
        "3 tablespoons honey",
        "1 3/4 pounds firm but ripe Bartlett pears (about 4 medium), peeled, cored, cut into 1/2-inch cubes",
        "2 16-ounce brioche or egg bread loaves, crusts trimmed, bread cut into 1/3-inch-thick slices",
        "1 1/3 cups heavy whipping cream",
        "6 tablespoons sugar",
        "3 large eggs",
        "2 tablespoons dark rum",
        "2 teaspoons vanilla extract",
        "Chamomile Crème Anglaise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Rum",
        "Fruit",
        "Dessert",
        "Bake",
        "Raisin",
        "Pear",
        "Fall",
        "Honey"
    ],
    "title": "Pear Charlottes with Chamomile Crème Anglaise",
    "url": "http://www.epicurious.com/recipes/food/views/pear-charlottes-with-chamomile-creme-anglaise-108591"
}
