{
    "directions": [
        "Blend all ingredients in processor until clumps form, about 1 minute. Transfer to medium bowl. Cover and chill. (Do not clean processor bowl.)",
        "Combine both flours, hazelnuts, sugar and salt in same processor bowl. Blend until hazelnuts are finely chopped. Add butter and blend until coarse meal forms. Mix in 2 tablespoons ice water and process just until moist clumps form, adding more water by teaspoonfuls if dry. Gather dough into ball; flatten into disk. Wrap dough in plastic and chill 30 minutes. (Topping and dough can be made 1 day ahead. Keep chilled.)",
        "Position rack in bottom third of oven and preheat to 400°F. Roll out dough between 2 sheets of parchment paper to 13-inch round, lifting paper, smoothing wrinkles and turning over as needed. Transfer dough on parchment paper to large unrimmed baking sheet. Remove top sheet of parchment.",
        "Combine pears, sugar and flour in large bowl; toss to coat.",
        "Mound pear mixture atop dough, leaving 2-inch border. Using parchment paper as aid, fold dough border over pears, pleating loosely and pinching to seal any cracks in dough. Sprinkle topping thickly over pears.",
        "Bake croustade until crust is golden, about 40 minutes. Cover very loosely with foil to prevent crust from over-browning and continue to bake until juices bubble thickly, about 12 minutes longer. Transfer baking sheet to rack; cool slightly. Slide metal spatula under crust to free from parchment. Using large tart pan bottom as aid, transfer croustade to platter. Serve warm with ice cream."
    ],
    "ingredients": [
        "1/2 cup all purpose flour",
        "2/3 cup hazelnuts, toasted, husked",
        "5 tablespoons (packed) golden brown sugar",
        "3 tablespoons chilled unsalted butter, cut into 1/2-inch pieces",
        "Pinch of salt",
        "1 cup all purpose flour",
        "2/3 cup bread flour",
        "1/3 cup hazelnuts, toasted, husked",
        "3 tablespoons (packed) golden brown sugar",
        "1/2 teaspoon salt",
        "9 tablespoons chilled unsalted butter, cut into 1/2-inch pieces",
        "3 tablespoons (about) ice water",
        "1 1/2 to 1 3/4 pounds ripe Bartlett pears, peeled, quartered, cored, thinly sliced",
        "1/3 cup sugar",
        "1 tablespoon all purpose flour",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Pear",
        "Fall",
        "Hazelnut"
    ],
    "title": "Pear Croustade with Hazelnut-Brown Sugar Topping",
    "url": "http://www.epicurious.com/recipes/food/views/pear-croustade-with-hazelnut-brown-sugar-topping-102376"
}
