{
    "directions": [
        "Melt butter in heavy 10-inch skillet over medium-low heat. Add sugar and cook until sugar melts (mixture will be grainy for first 10 to 12 minutes) and turns deep amber, stirring occasionally and pressing on sugar lumps to break up, about 20 minutes. Add pears (caramel will bubble and harden). Increase heat to medium-high and boil until liquid thickens and pears are very tender, breaking up large pieces of caramel and stirring occasionally, about 14 minutes. Transfer mixture to blender.",
        "Beat yolks to blend in medium bowl. Bring cream to boil in heavy medium saucepan. Gradually whisk hot cream into yolks. Return cream mixture to same saucepan. Stir over low heat until custard thickens slightly and leaves path on back of spoon when finger is drawn across, about 2 minutes; do not boil. Immediately add to pear mixture in blender. Add brandy if desired. Blend until smooth. Cover custard and refrigerate until well chilled.",
        "Process custard in ice cream maker according to manufacturer's instructions. Freeze ice cream until firm. (Can be prepared 1 week ahead. Keep frozen.)",
        "Melt butter in heavy large skillet over medium-low heat. Add sugar and cook until sugar turns deep amber, stirring occasionally and breaking up sugar lumps, about 20 minutes. Add pears and sauté until tender but not mushy and caramel thickens slightly, about 9 minutes.",
        "Arrange 6 pear slices decoratively on each of 6 plates or in shallow bowls. Scoop ice cream atop pears. Drizzle with caramel syrup from skillet and serve."
    ],
    "ingredients": [
        "1 1/2 tablespoons unsalted butter",
        "2/3 cup sugar",
        "3 1/2 cups diced peeled cored ripe Bosc pears (about 1 1/2 pounds)",
        "4 egg yolks",
        "2 cups whipping cream",
        "2 tablespoons poire Williams (clear pear brandy), optional",
        "3 tablespoons unsalted butter",
        "1/4 cup plus 2 tablespoons sugar",
        "3 ripe Bosc pears, peeled, cored, each cut into 12 lengthwise slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Ice Cream Machine",
        "Dairy",
        "Fruit",
        "Dessert",
        "Frozen Dessert",
        "Pear",
        "Brandy",
        "Winter"
    ],
    "title": "Pear-Caramel Ice Cream Sundaes",
    "url": "http://www.epicurious.com/recipes/food/views/pear-caramel-ice-cream-sundaes-566"
}
