{
    "directions": [
        "Preheat the oven to 400 degrees F (200 degrees C).",
        "In a medium bowl, stir together the brown sugar, 1/4 cup white sugar, flour, cinnamon and salt. Mix in the butter and 1 tablespoon of vanilla just until the mixture resembles coarse crumbs. Set aside.",
        "In a separate bowl, whisk together the eggs, 1 cup white sugar, half-and-half, 1 teaspoon of vanilla, pear brandy and salt.",
        "Line the bottom of a 9x13 inch baking dish with a layer of bread. Top with a layer of pear. Pour about 1/4 of the custard over the layers followed by about 1/3 of the heavy cream. Sprinkle with some of the crumb topping. Repeat layers until you are out of ingredients, ending with the crumb topping on top. Press down on the layers as needed to help them absorb the liquid. Cover the pan with parchment paper then seal with aluminum foil. Place another baking pan on top or two dinner plates to keep it from puffing while it bakes.",
        "Place the pudding onto a larger pan or cookie sheet with sides. Pour boiling water into the bottom pan until it is half way full.",
        "Bake for 10 minutes in the preheated oven, then reduce the oven temperature to 350 degrees F (175 degrees C) and continue baking for 25 minutes. Pudding is done when a knife inserted into the center comes out clean."
    ],
    "ingredients": [
        "1/4 cup brown sugar",
        "1/4 cup white sugar",
        "1 1/4 cups all-purpose flour",
        "1 teaspoon ground cinnamon",
        "1 teaspoon salt",
        "1/2 cup butter, softened",
        "1 tablespoon vanilla extract",
        "8 eggs",
        "1 cup white sugar",
        "1 cup half-and-half cream",
        "1 teaspoon vanilla extract",
        "1/4 cup pear brandy",
        "1/2 teaspoon salt",
        "2 (1 pound) loaves sliced artisan bread, cut into 3/4 inch strips with crusts removed",
        "4 pears - peeled, cored and sliced",
        "2 cups heavy cream",
        "1 pinch ground cinnamon"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pear Bread Pudding",
    "url": "http://allrecipes.com/recipe/94966/pear-bread-pudding/"
}
