{
    "directions": [
        "Blend flour, salt and sugar in processor. Add butter; using on/off turns, process until butter is cut into 1/4-inch pieces. Add 6 tablespoons ice water. Using on/off turns, blend until dough comes together, adding more water by tablespoonfuls if dough is dry. Gather into ball; divide into 2 pieces. Flatten pieces into disks; wrap in plastic. Chill at least 30 minutes and up to 1 day.",
        "Mix first 7 ingredients in bowl. Mix in pears and cornstarch. Position rack in center of oven; preheat to 400°F. Roll out 1 dough disk on lightly floured surface to 13- to 14-inch round. Transfer to 9-inch-diameter glass pie dish; spoon in filling. Roll out second dough disk to 12-inch round; using ruler as aid, cut dough into 3/4-inch-wide strips. Lay strips over filling, spacing 3/4 inch apart. Lay additional strips at right angle to first strips, forming lattice. Trim overhang to 3/4 inch. Fold dough edge and strip ends under; crimp to seal. Brush dough strips (not edge) with yolk mixture.",
        "Bake pie until crust is golden and pears are tender, about 50 minutes; cool."
    ],
    "ingredients": [
        "2 1/2cups all purpose flour",
        "1 teaspoon salt",
        "1 teaspoon sugar",
        "1 cup (2 sticks) chilled unsalted butter, cut into 1-inch cubes",
        "8 tablespoons (about) ice water",
        "6 tablespoons orange marmalade",
        "1/4 cup (packed) raisins",
        "2 tablespoons sugar",
        "2 tablespoons brandy",
        "1/2 teaspoon vanilla extract",
        "1/2 teaspoon ground cinnamon",
        "1/8 teaspoon ground cloves",
        "2 1/4 pounds firm Anjou or Bosc pears, peeled, cored, cut into 3/4-inch cubes",
        "1 tablespoon cornstarch",
        "1 egg yolk beaten with 2 teaspoons milk (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Hanukkah",
        "Thanksgiving",
        "Rosh Hashanah/Yom Kippur",
        "Orange",
        "Dried Fruit",
        "Raisin",
        "Pear",
        "Spice",
        "Fall",
        "Winter",
        "Christmas Eve",
        "Jam or Jelly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear and Raisin Mince Pie with Lattice Crust",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-raisin-mince-pie-with-lattice-crust-104044"
}
