{
    "directions": [
        "Stir together all ingredients except pastry dough and chill in an airtight container, stirring at least once a day for at least 3 days.",
        "Put oven rack in middle position. Put a large baking sheet on rack and preheat oven to 425°F.",
        "Roll out larger piece of dough (keep remaining piece chilled) on a lightly floured surface with a lightly floured rolling pin into a 13-inch round, then fit into a 9-inch pie plate. Trim edge, leaving a 1/2-inch overhang. Chill shell while rolling out smaller piece of dough for top crust.",
        "Roll out smaller piece of dough on a lightly floured surface with lightly floured rolling pin into a roughly 16- by 11-inch rectangle. Cut crosswise into 12 (1-inch-wide) strips with a pastry wheel or a sharp knife. Stir mincemeat, then spoon into shell in an even layer. Weave a lattice pattern over pie with pastry strips.",
        "Trim edges of strips flush with edge of bottom crust. Fold bottom crust up over edges of lattice and decoratively crimp.",
        "Bake pie on hot baking sheet 20 minutes. Reduce oven temperature to 375°F and cover edge of pie with a pie shield or foil if it begins to brown too quickly. Continue to bake until crust is golden brown and filling begins to bubble around edge, about 1 hour more. Transfer pie to a rack and cool to warm or room temperature, about 2 hours. Serve pie warm or at room temperature."
    ],
    "ingredients": [
        "2 firm-ripe Anjou pears, peeled, cored, and finely chopped",
        "1/2 cup dried sour cherries",
        "1/2 cup dried currants",
        "1/2 cup dried cranberries",
        "1/2 cup packed light brown sugar",
        "1/4 cup brandy",
        "2 teaspoons finely grated fresh lemon zest",
        "2 teaspoons finely grated fresh orange zest",
        "2 tablespoons fresh lemon juice",
        "1/2 teaspoon cinnamon",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon freshly grated nutmeg",
        "1/8 teaspoon salt",
        "3/4 cup walnuts (2 3/4 oz), toasted and finely chopped",
        "Pastry dough for a double-crust pie"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Cranberry",
        "Pear",
        "Walnut",
        "Fall",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear-Cranberry Mincemeat Lattice Pie",
    "url": "http://www.epicurious.com/recipes/food/views/pear-cranberry-mincemeat-lattice-pie-236429"
}
