{
    "directions": [
        "Preheat oven to 375°. Line 2 large rimmed baking sheets with parchment. Combine pears, cranberries, 1/4 cup sugar, cornstarch, and lemon peel in large bowl; toss to coat.",
        "Stack phyllo sheets on work surface; cover with plastic wrap, then damp kitchen towel. Place 1 phyllo sheet on work surface. Brush with some of melted butter. Top with second sheet; brush with butter. Fold phyllo in half lengthwise, forming 17-inch- long strip. Place scant 1/2 cup pear mixture on phyllo strip, about 2 inches in from 1 short side and in center. Fold 1 corner of strip over pear mixture, then fold phyllo back and forth (like a flag), enclosing filling. Brush top with butter after each fold until entire strip is folded, forming triangle.",
        "Transfer turnover, seam side down, to 1 baking sheet. Brush top with butter. Repeat with remaining phyllo, butter, and pear mixture. Place 4 turnovers on each sheet.",
        "Bake turnovers until golden brown, about 35 minutes. Transfer to plates. Sift powdered sugar lightly over turnovers; serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 pounds ripe bosc pears (about 3), peeled, quartered, cored, diced",
        "1/2 cup dried cranberries",
        "1/4 cup sugar",
        "1 tablespoon cornstarch",
        "1 teaspoon finely grated lemon peel",
        "16 17 x 12-inch sheets fresh or frozen whole wheat phyllo pastry or regular phyllo pastry (thawed if frozen)",
        "1/2 cup (1 stick) unsalted butter, melted powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "High Fiber",
        "Cranberry",
        "Pear",
        "Fall",
        "Phyllo/Puff Pastry Dough",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pear-Cranberry Turnovers",
    "url": "http://www.epicurious.com/recipes/food/views/pear-cranberry-turnovers-362951"
}
