{
    "directions": [
        "Scrape seeds from vanilla bean into large saucepan; add bean. Add 6 cups water, sugar and lemon peel. Stir over medium heat until mixture comes to simmer. Add pears; simmer until tender, about 15 minutes. Cool pears in syrup.",
        "Stir 1 cup sugar and 1/4 cup water in heavy medium saucepan over low heat until sugar dissolves. Increase heat; boil without stirring until sugar turns deep amber, occasionally swirling pan and brushing down sides with wet pastry brush, about 10 minutes. Remove from heat. Add 1 cup warm cream (mixture will bubble up). Return to very low heat; stir until smooth. Chill sauce uncovered until cold, about 1 hour.",
        "Beat chilled cream, powdered sugar and vanilla in large bowl until firm peaks form. Fold 1/2 cup cold caramel sauce into cream; cover and chill remaining sauce.",
        "Drain pears and cut crosswise into 1/2-inch-thick slices. Press 1 piece of cake into each of six 12- to 14-ounce goblets. Top each with 5 pear slices, 2 teaspoons reserved caramel sauce and 1/4 cup caramel cream. Repeat layering with cake, pears, caramel sauce and caramel cream. (Can be made 1 day ahead. Cover and chill.)",
        "Drizzle remaining caramel sauce over trifles. Sprinkle with nuts and serve."
    ],
    "ingredients": [
        "1 vanilla bean, split lengthwise",
        "6 cups water",
        "1 1/2 cups sugar",
        "1 2-inch strip lemon peel",
        "4 firm but ripe pears (about 2 pounds), peeled, halved, cored",
        "1 cup sugar",
        "1/4 cup water",
        "1 cup warm whipping cream",
        "1 1/2 cups chilled whipping cream",
        "1 1/2 tablespoons powdered sugar",
        "1 1/2 teaspoons vanilla extract",
        "12 1/4-inch-thick slices from purchased 12-ounce pound cake",
        "Sliced almonds, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dairy",
        "Fruit",
        "Dessert",
        "Christmas",
        "Thanksgiving",
        "Pear",
        "Almond",
        "Fall",
        "Chill"
    ],
    "title": "Pear and Caramel Trifles",
    "url": "http://www.epicurious.com/recipes/food/views/pear-and-caramel-trifles-4661"
}
