{
    "directions": [
        "Heat the oven to 375°F. Lightly oil a small baking dish; a round Spanish earthenware dish about 6 inches across is perfect for this amount.",
        "If your ricotta is wet and milky, drain it first by putting it in a colander and pressing out the excess liquid. Pack the ricotta into the dish, drizzle a little olive oil over the surface, and bake 20 minutes or until the cheese has begun to set and brown on top. Cover the surface with the bread crumbs and continue to bake until the bread crumbs are browned and crisp, another 10 minutes. (The amount of time it takes for ricotta cheese to bake until set can vary tremendously, so it may well take longer than the times given here, especially if it wasn't drained.)",
        "When the cheese is finished baking, heat the butter in a small skillet over medium heat. When the butter foams, add the shallots and sage and cook until softened, about 3 minutes. Add the peas, 1/2 cup water, and the lemon zest. Simmer until the peas are bright green and tender; the time will vary, but it should be 3 to 5 minutes. Whatever you do, don't let them turn gray. Season with salt and a little freshly ground pepper, not too much.",
        "Divide the ricotta between 2 plates. Spoon the peas over the cheese. Grate some Parmesan over all and enjoy while warm."
    ],
    "ingredients": [
        "Olive oil",
        "1 cup high-quality ricotta cheese, such as hand-dipped full-fat ricotta",
        "2 to 3 tablespoons fresh bread crumbs",
        "4 teaspoons butter",
        "2 large shallots or 1/2 small onion, finely diced (about 1/3 cup)",
        "5 small sage leaves, minced (about 1 1/2 teaspoons)",
        "1 1/2 pounds pod peas, shucked (about 1 cup)",
        "Grated zest of 1 lemon",
        "Sea salt and freshly ground pepper",
        "Chunk of Parmesan cheese, for grating"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Vegetable",
        "Bake",
        "Vegetarian",
        "Dinner",
        "Ricotta",
        "Legume",
        "Pea",
        "Spring",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peas with Baked Ricotta and Bread Crumbs",
    "url": "http://www.epicurious.com/recipes/food/views/peas-with-baked-ricotta-and-bread-crumbs-51153200"
}
