{
    "directions": [
        "Roll out dough on a lightly floured surface with a lightly floured rolling pin into a 13-inch round (1/8 inch thick), then fit into a 9-inch glass or metal pie plate. Trim edge, leaving a 1/2-inch overhang, then fold overhang under and crimp edge decoratively. Prick bottom and side of shell all over with a fork, then chill shell 30 minutes.",
        "While shell chills, put oven rack in middle position and preheat oven to 375°F.",
        "Line shell with foil and fill with pie weights, then bake until pastry is set and pale golden on rim, about 20 minutes. Carefully remove foil and weights and bake shell until pale golden all over, 6 to 10 minutes more. Cool on a rack.",
        "Whisk together pumpkin, brown sugar, egg, sour cream, cinnamon, nutmeg, and a pinch of salt in a bowl until smooth.",
        "Stir together corn syrup, brown sugar, eggs, butter, vanilla, zest, lemon juice, and salt in a bowl, then stir in pecans.",
        "Spread pumpkin mixture evenly in shell, then carefully spoon pecan mixture over it. Bake pie until crust is golden and filling is puffed, about 35 minutes. (Center will still be slightly wobbly; filling will set as it cools.) Cool completely on rack. Serve at room temperature."
    ],
    "ingredients": [
        "Pastry dough",
        "3/4 cup canned solid-pack pumpkin",
        "2 tablespoons packed light brown sugar",
        "1 large egg, lightly beaten",
        "2 tablespoons sour cream",
        "1/8 teaspoon cinnamon",
        "1/8 teaspoon freshly grated nutmeg",
        "3/4 cup light corn syrup",
        "1/2 cup packed light brown sugar",
        "3 large eggs, lightly beaten",
        "3 tablespoons unsalted butter, melted and cooled",
        "2 teaspoons vanilla",
        "1/4 teaspoon finely grated fresh lemon zest",
        "1 1/2 teaspoons fresh lemon juice",
        "1/4 teaspoon salt",
        "1 1/3 cups pecans (5 1/2 ounces), chopped if desired",
        "Special equipment: pie weights or raw rice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Lemon",
        "Pecan",
        "Spice",
        "Pumpkin",
        "Fall",
        "Sour Cream",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pecan Pumpkin Pie",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-pumpkin-pie-108774"
}
