{
    "directions": [
        "Make the crust: Put the flour in a large bowl and cut in the cold butter with your fingers until the mixture forms coarse crumbs. Whisk 1/3 cup ice water and the egg yolk in a liquid measuring cup. Make a well in the center of the flour mixture and pour in the yolk mixture. Gradually stir the flour into the well until a rough dough forms. Divide the dough in half and shape each half into a ball. Wrap separately in plastic wrap and refrigerate overnight. (You will need only 1 ball of dough for this pie; freeze the other ball up to 1 month.)",
        "Flatten 1 ball of dough on a lightly floured surface, then roll out into a 12-inch round, about 1/8 inch thick. Ease into a 9-inch pie plate, fold the overhanging dough under itself and crimp the edge with your fingers; set aside.",
        "Preheat the oven to 375 degrees F. Make the filling: Beat the butter and brown sugar in a large bowl with a mixer on medium speed until creamy, about 5 minutes. Beat in the eggs, one at a time, until combined. Beat in the corn syrup and rum until combined. Stir the pecans into the filling with a rubber spatula, then pour into the prepared crust.",
        "Bake the pie until the crust is golden brown and the filling is bubbling, about 1 hour (cover with foil if the filling is getting too dark). Transfer to a rack and let cool completely.",
        "Photograph by Devon Jarvis"
    ],
    "ingredients": [
        "2 cups all-purpose flour, plus more for dusting",
        "10 tablespoons cold salted butter, cut into small pieces",
        "1 large egg yolk",
        "For the filling:",
        "1 stick salted butter",
        "1 cup packed dark brown sugar",
        "4 large eggs",
        "1 cup light corn syrup",
        "1 tablespoon spiced rum",
        "1 1/2 cups pecan halves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pecan Pie",
        "Nut Recipes",
        "Pie Recipes",
        "Dessert"
    ],
    "title": "Pecan Pie",
    "url": "http://www.foodnetwork.com/recipes/pecan-pie"
}
