{
    "directions": [
        "Combine 2 cups graham cracker crumbs, 1/2  cup white sugar, 1 teaspoon cinnamon, and melted butter or margarine.  Press firmly into the bottom of a 10 inch springform pan.",
        "In a large bowl, blend the cream cheese and 1 1/4 cup white sugar with an electric mixer at medium speed until well blended.  Add the eggs, one at a time, blending well.  Add vanilla extract.  Add 1/2 cup liqueur, and blend for 5 minutes.  Pour the filling on top of the crust",
        "Preheat the oven to 350 degrees F (175 degrees C).  Bake for approximately 1 hour.   The cake should be golden brown, and will have risen to the top of the pan.  Turn off the heat, and let cool in the oven for 2 1/2 hours.  When cool, remove the rim of the springform pan.",
        "In a small bowl, mix the sour cream, confectioners' sugar, and 1 teaspoon liqueur together.  Spoon onto the top of the cooled cheesecake.",
        "In a small bowl, combine the finely ground pecans, finely ground graham cracker crumbs, 1 1/2 tablespoons white sugar, and cinnamon.  Sprinkle the pecan topping on the cheesecake.  Carefully press the pecan topping into the sides of the cheesecake.  Garnish the top and sides with pecan halves."
    ],
    "ingredients": [
        "2 cups graham cracker crumbs",
        "1/2 cup white sugar",
        "1 teaspoon ground cinnamon",
        "1/2 cup butter, melted",
        "3 (8 ounce) packages cream cheese, softened",
        "1 1/4 cups white sugar",
        "3 eggs, room temperature",
        "1/2 teaspoon vanilla extract",
        "1/2 cup pecan liqueur",
        "1 cup sour cream",
        "1/4 cup confectioners' sugar",
        "1 teaspoon pecan liqueur",
        "1 cup ground pecans",
        "1/2 cup graham cracker crumbs",
        "1 1/2 tablespoons white sugar",
        "1/2 teaspoon ground cinnamon",
        "3/4 cup pecan halves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pecan Cheesecake",
    "url": "http://allrecipes.com/recipe/9301/pecan-cheesecake/"
}
