{
    "directions": [
        "Preheat oven to 350°F. Spray 10-inch-diameter Bundt pan with nonstick spray; dust with flour. Sift 3 1/4 cups flour, baking powder, and salt into medium bowl. Using electric mixer, beat sugar, butter, and 2 teaspoons vanilla in large bowl until fluffy. Beat in eggs 1 at a time. Beat in flour mixture in 3 additions, alternating with milk in 2 additions. Transfer half of batter to prepared pan.",
        "Stir pecans, corn syrup, molasses, and 2 teaspoons vanilla in another medium bowl to blend. Stir in baking soda. Stir pecan mixture into remaining cake batter in bowl. Spoon pecan batter over batter in pan (do not swirl). Bake until tester inserted near center of cake comes out with dry crumbs attached, about 50 minutes. Transfer cake in pan to rack.",
        "Stir 2 teaspoons water and baking soda in small bowl to dissolve baking soda. Bring sugar, buttermilk, butter, and corn syrup to boil in heavy 6-quart saucepan over high heat, stirring to dissolve sugar and melt butter. Reduce heat to medium-high. Stir in baking soda mixture (glaze will bubble). Boil until sauce is golden and slightly thickened, stirring often, about 8 minutes. Remove from heat. Stir in bourbon and vanilla.",
        "Invert warm cake onto platter. Immediately brush 1 1/2 cups hot glaze over cake, allowing glaze to soak into cake. Cool cake completely. (Can be made 1 day ahead. Cover and let stand at room temperature. Cover and refrigerate remaining glaze.)",
        "Rewarm remaining glaze, stirring. Serve cake with ice cream and warm glaze."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "3 1/4 cups cake flour",
        "2 teaspoons baking powder",
        "3/4 teaspoon salt",
        "2 cups sugar",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "4 teaspoons vanilla extract",
        "4 large eggs",
        "1 cup whole milk",
        "1 cup pecans, toasted, finely chopped",
        "1/4 cup dark corn syrup",
        "1/4 cup mild-flavored (light) molasses",
        "1/2 teaspoon baking soda",
        "2 teaspoons water",
        "1 teaspoon baking soda",
        "2 cups sugar",
        "1 cup buttermilk",
        "1 cup (2 sticks) unsalted butter",
        "2 teaspoons dark corn syrup",
        "1/2 cup bourbon",
        "2 teaspoons vanilla extract",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Bourbon",
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Pecan",
        "Winter",
        "Molasses"
    ],
    "title": "Pecan Molasses Bundt Cake with Bourbon Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-molasses-bundt-cake-with-bourbon-glaze-107886"
}
