{
    "directions": [
        "Preheat oven to 350°F.",
        "Pulse pecans, cake meal, and 3 tablespoons sugar in a food processor until nuts are very finely chopped.",
        "Beat yolks and 1/2 cup plus 2 tablespoons sugar in a large bowl with an electric mixer on high speed until pale and very thick. Stir in lemon zest and juice.",
        "Beat whites with salt in another bowl with cleaned beaters on high speed until soft peaks form. Gradually beat in 5 tablespoons sugar and beat until whites just hold stiff, glossy peaks.",
        "In 3 batches, alternately fold nut mixture and whites into yolk mixture. Spoon batter into ungreased pan and smooth top.",
        "Bake cake in middle of oven until golden and a tester comes out clean, about 1 hour. Cool in pan, upside-down, 2 hours. (If pan has \"legs,\" stand it on those. Otherwise, invert pan over neck of a bottle.)",
        "Turn pan right side up, then run a long thin knife around outer edge of cake with a smooth (not sawing) motion. Loosen center in same manner. Remove outer rim of pan and run knife under bottom of cake to release. Invert cake onto a cake plate.",
        "Beat cream with remaining tablespoon sugar until it just holds stiff peaks. Spread evenly over top and sides of cake and arrange strawberries on top. Serve chilled."
    ],
    "ingredients": [
        "1 1/4 cups pecans (6 1/4 oz)",
        "3 1/2 tablespoons matzo cake meal",
        "1 cup plus 3 tablespoons sugar",
        "7 large eggs, separated, at room temperature",
        "2 teaspoons finely grated fresh lemon zest",
        "1 tablespoon fresh lemon juice",
        "1/4 teaspoon salt",
        "1 1/2 cups chilled heavy cream (optional)",
        "3/4 pint strawberries, sliced lengthwise (2 cups)",
        "Special equipment: a 10- by 4-inch (12-cup) angel food cake pan with removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Passover",
        "Strawberry",
        "Pecan",
        "Spring",
        "Kosher",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Pecan Torte with Strawberries and Cream",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-torte-with-strawberries-and-cream-103342"
}
