{
    "directions": [
        "Combine all ingredients in heavy medium saucepan. Stir over medium-high heat until sugar dissolves and mixture boils. Reduce heat to medium, cover and cook until figs are very tender, about 35 minutes. Uncover and simmer until liquid is absorbed and filling is thick, stirring occasionally, about 5 minutes.",
        "Transfer filling to processor. Using about 5 on/off turns, process just until mixture holds together. Transfer to small bowl; cool filling. (Can be prepared 3 days ahead. Cover and refrigerate.)",
        "Preheat oven to 350°F. Place 13 3/4x4-inch rectangular tart pan with removable bottom onto waxed paper. Trace outline of pan bottom on paper; set paper aside. Line pan with heavy-duty foil. Grease foil; dust with matzo cake meal. Combine 2 cups pecans, sugar, ginger and salt in processor; finely grind nuts. Add egg and process until moist clumps form. Using moistened fingertips, press 1 cup dough over bottom and up sides of prepared pan (crust will be thin). Bake crust until puffed and dry looking, about 14 minutes. Transfer pan to rack; press bottom of crust lightly to flatten. Cool crust completely. Maintain over temperature.",
        "Stir 4 ounces chocolate in top double boiler set over simmering water until melted. Spread over bottom of crust. Spoon 1 3/4 cups filling over chocolate (reserve remaining filling for another use).",
        "Press remaining dough over traced rectangle on waxed paper, filling outline completely. Using paper as aid, turn dough rectangle over onto tart, aligning carefully; peel off paper. Pinch edge of crust and top dough together to seal.",
        "Bake tart until top is golden and dry looking, about 28 minutes. Cool tart completely in pan on rack. (Can be prepared ahead. Wrap in foil and store 1 day at room temperature or refrigerate up to 5 days.) Push up pan bottom to release tart. Peel off foil from bottom.",
        "If desired, dip spoon into melted chocolate and drizzle in zigzag pattern over tart; then dip pecan halves halfway into melted chocolate and arrange decoratively around edge. Chill until chocolate sets, about 30 minutes. Serve tart cold or at room temperature."
    ],
    "ingredients": [
        "12 ounces Calimyrna figs, stemmed, chopped",
        "1 cup water",
        "6 tablespoons sugar",
        "1 tablespoon chopped peeled fresh ginger",
        "1 tablespoon fresh lemon juice",
        "1 teaspoon (packed) grated lemon peel",
        "Matzo cake meal",
        "2 cups (generous) pecans (about 8 ounces), toasted, cooled",
        "3/4 cup sugar",
        "1/4 teaspoon ground ginger",
        "1/8 teaspoon salt",
        "1 large egg",
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, finely chopped",
        "Melted bittersweet chocolate (optional)",
        "Pecan halves (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dessert",
        "Bake",
        "Passover",
        "Fig",
        "Pecan",
        "Kosher"
    ],
    "title": "Pecan Macaroon and Fig Tart",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-macaroon-and-fig-tart-1706"
}
