{
    "directions": [
        "Combine pecans and 1 tablespoon flour in processor. Grind pecans finely; transfer to plate. Place remaining flour on another plate. Sprinkle fish with salt and pepper. Dip 1 fillet into flour to coat; shake off excess. Using pastry brush, brush flesh side with egg whites. Place fillet, egg white side down, onto pecans; press to coat with nuts. Transfer to waxed paper-lined baking sheet, pecan side down. Repeat with remaining 3 fillets; chill.",
        "Combine first 7 ingredients in medium saucepan. Boil 10 minutes; add rosemary. Boil until liquid is reduced to 1/2 cup, about 10 minutes. Strain sauce into another medium saucepan, pressing on solids in sieve. Add cream; bring to boil. Reduce heat to medium-low. Whisk in butter 1 piece at a time (do not boil). Season with salt and pepper. Let stand at room temperature up to 2 hours.",
        "Heat 2 tablespoons oil in heavy large Dutch oven over high heat. Add carrot and bell pepper; toss 2 minutes. Add cabbage; toss until cabbage wilts, about 4 minutes. Season with salt and pepper. Remove from heat.",
        "Melt 1 tablespoon butter with 1 tablespoon oil in heavy large skillet over medium-high heat. Place 2 fillets, pecan side down, into skillet. Cook until crust is golden and crisp, about 2 minutes. Using spatula, turn fillets over. Cook until just opaque in center, about 2 minutes. Transfer to plate. Repeat with remaining butter, oil and fish.",
        "Whisk sauce over low heat to rewarm (do not boil). Divide vegetables among plates. Top with fish. Spoon sauce around fish and vegetables. Sprinkle with chopped chives and serve."
    ],
    "ingredients": [
        "2 cups pecans (about 8 ounces)",
        "1 cup all purpose flour",
        "2 large (12- to 14-ounce) trout, filleted, skin left intact",
        "3 large egg whites, beaten to blend",
        "1 1/2 cups fresh orange juice",
        "1 cup dry wine",
        "2/3 cup chopped shallots",
        "1/4 cup white wine vinegar",
        "8 5-inch-long fresh parsley stems",
        "1 1/2 tablespoons fresh lemon juice",
        "1 large fresh thyme sprig",
        "2 fresh rosemary sprigs",
        "1/4 cup whipping cream",
        "3/4 cup (1 1/2 sticks) unsalted butter, cut into 12 pieces",
        "4 tablespoons olive oil",
        "1 carrot, peeled, cut into matchstick-size strips",
        "1 red bell pepper, thinly sliced",
        "6 cups thinly sliced savoy cabbage",
        "2 tablespoons (1/4 stick) unsalted butter",
        "Chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fish",
        "Brunch",
        "Sauté",
        "Orange",
        "Rosemary",
        "Pecan",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pecan-Crusted Trout with Orange-Rosemary Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-crusted-trout-with-orange-rosemary-butter-sauce-1663"
}
