{
    "directions": [
        "Make pastry dough as directed. Roll out dough into a 15-inch round on a lightly floured surface and fit into tart pan. Roll rolling pin over top of pan to trim dough flush with rim and lightly prick bottom all over with a fork. Chill 30 minutes.",
        "Preheat oven to 375°F.",
        "Line shell with foil and fill with pie weights. Bake in middle of oven 20 minutes. Remove weights and foil and bake shell until pale golden, 6 to 10 minutes more. Cool in pan on a rack.",
        "Cook sugar in a dry heavy saucepan over moderately low heat, stirring slowly with a fork, until melted and pale golden. Cook caramel without stirring, swirling pan, until deep golden. Add corn syrup and simmer, stirring occasionally, until caramel is dissolved (it will harden before dissolving). Remove pan from heat and cool mixture until it stops bubbling.",
        "Whisk eggs with a pinch of salt in a bowl. Whisk caramel mixture into eggs in a slow stream and whisk in butter, vanilla, and lemon juice until butter is melted. Spread pecans in bottom of tart shell and pour in filling, tapping down pecans to coat.",
        "Bake tart in middle of oven until crust is golden and filling is puffed, 20 to 25 minutes, and cool in pan on a rack."
    ],
    "ingredients": [
        "Pastry dough",
        "3/4 cup sugar",
        "1 cup light corn syrup",
        "3 large eggs",
        "2 tablespoons unsalted butter",
        "1 teaspoon vanilla",
        "1 teaspoon fresh lemon juice",
        "1 3/4 cups pecan halves",
        "10- by 1-inch tart pan with a removable fluted bottom",
        "pie weights or raw rice",
        "Accompaniment: lightly whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pecan",
        "Fall",
        "Gourmet"
    ],
    "title": "Pecan Tart",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-tart-102555"
}
