{
    "directions": [
        "Roll out Pâte Sucrée disk on a lightly floured work surface to a 1/8\"-thick round, dusting with flour as necessary to prevent sticking. Transfer crust to tart pan; press onto bottom and up sides of pan. Trim dough flush with edge of pan. Chill for 1 hour.",
        "Meanwhile, preheat oven to 350°F. Spread out chopped pecans in a single layer on a rimmed baking sheet and toast, stirring once or twice, until lightly browned and aromatic, 8-10 minutes.",
        "Place butter in a small skillet over medium heat. Scrape in seeds from vanilla bean; add bean. Cook, swirling pan a few times, until butter browns and smells nutty, about 5 minutes. Discard vanilla bean.",
        "Whisk sugar, both corn syrups, and salt in a large bowl. Whisk in warm brown butter, then eggs; whisk to blend. Spread chopped pecans in an even layer over prepared tart shell. Scatter chocolate over. Place pecan halves in concentric circles over chopped pecans and chocolate. Pour filling slowly and evenly over nuts.",
        "Bake tart until filling is just set in center, 45-50 minutes.",
        "Transfer tart to a wire rack; let cool for at least 30 minutes. DO AHEAD: Tart can be made 8 hours ahead. Let stand at room temperature.",
        "Beat cream, crème fraîche, and bourbon until soft peaks form. DO AHEAD: Bourbon whipped crème fraîche can be made 4 hours ahead. Cover; chill. Rewhisk before serving.",
        "Remove pan sides. Cut tart into wedges. Serve warm or at room temperature with bourbon whipped crème fraîche."
    ],
    "ingredients": [
        "1 Pâte Sucrée disk",
        "All-purpose flour (for dusting)",
        "1 1/2 cups chopped pecans plus",
        "1 1/2-2 cups pecan halves",
        "1/4 cup (1/2 stick) unsalted butter",
        "1/2 vanilla bean, split lengthwise",
        "1 cup sugar",
        "1/2 cup dark corn syrup",
        "1/2 cup light corn syrup",
        "1/4 teaspoon kosher salt",
        "3 large eggs",
        "4 ounces semisweet or bittersweet chocolate, chopped",
        "3/4 cup heavy cream",
        "1/4 cup crème fraîche",
        "2 teaspoons bourbon",
        "Special equipment: An 11\"-diameter fluted tart pan with a removable bottom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pecan",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pecan and Chocolate Tart with Bourbon Whipped Crème Fraîche",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-and-chocolate-tart-with-bourbon-whipped-creme-fraiche-51123160"
}
