{
    "directions": [
        "For the dough: Combine the flour, pecans, sugar and salt in the bowl of a food processor fitted with a metal blade. Pulse until combined, and then add the butter and pulse until the mixture resembles yellow cornmeal mixed with bean-size bits of butter, about 10 pulses. Add the egg and pulse 1 to 2 times; don't let the dough form into a ball in the machine. (If the dough is very dry add up to 1 tablespoon cold water.)",
        "Remove the bowl from the machine, remove the blade, and bring the dough together by hand. Form the dough into a disk, wrap with plastic wrap and refrigerate until thoroughly chilled, at least 1 hour.",
        "Roll the dough out with a rolling pin on a lightly-floured surface into a 12-inch circle about 1/8-inch thick. Transfer the dough to a 9-inch pie pan and trim the edges, leaving about 1 inch extra hanging over the edge. Tuck the overhanging dough underneath itself to form a thick edge that is even with the rim. Flute the edge as desired. Freeze the pie shell for about 30 minutes.",
        "Meanwhile for the filling: Preheat the oven to 350 degrees F. Mix together the pecans, syrup, dark brown sugar, light brown sugar, melted butter, vanilla and salt in a large bowl. Whisk the beaten eggs into the filling until smooth.",
        "Put the pie shell onto a baking sheet and pour in the filling. Bake on the lower oven rack until the edges are set but the center is still slightly loose, 40 to 45 minutes. (If the edges get very dark, cover them with aluminum foil halfway through baking.) Cool the pie on a rack, and then serve slightly warm or at room temperature."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour, plus more for dusting",
        "1/4 cup chopped pecans",
        "2 teaspoons sugar",
        "1/8 teaspoon salt",
        "1/2 cup cold butter (1 stick), diced",
        "1 large egg, lightly beaten",
        "2 cups chopped toasted pecans",
        "3/4 cup light corn syrup",
        "1/2 cup packed dark brown sugar",
        "1/2 cup packed light brown sugar",
        "5 tablespoons unsalted butter, melted",
        "2 teaspoons pure vanilla extract",
        "1/2 teaspoon fine salt",
        "3 eggs, lightly beaten"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pecan Pie",
        "Nut Recipes",
        "Pie Recipes",
        "Thanksgiving Desserts",
        "Dessert",
        "Holiday",
        "Thanksgiving",
        "Baking"
    ],
    "title": "Pecan Pie",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/pecan-pie-recipe6"
}
