{
    "directions": [
        "Stir figs, brandy, and water in heavy small saucepan over low heat until liquid is absorbed, about 5 minutes; cool. Mix brown sugar, corn syrup, and next 4 ingredients in medium bowl. Stir in pecans, then fig mixture.",
        "Preheat oven to 375°F. Roll out dough on lightly floured surface to 13-inch round. Transfer to 9-inch-diameter deep-dish glass pie dish. Fold edge of dough over, forming double edge, and crimp decoratively, pressing to top edge of dish. Pierce all over with fork. Freeze crust 15 minutes.",
        "Line crust with foil; fill with dried beans or pie weights. Bake until sides are set, about 12 minutes. Remove foil and beans. Bake until crust is pale golden, pressing with back of fork if crust bubbles, about 10 minutes. Reduce oven temperature to 325°F.",
        "Spoon filling into warm crust. Bake until filling is puffed at edges and set in center, about 40 minutes. Let stand until cool, at least 1 hour. (Can be prepared 1 day ahead. Cover and chill.)",
        "Beat cream, sugar, and brandy in medium bowl. Whisk until peaks form. (Can be made 4 hours ahead. Cover; chill.) Serve pie with cream."
    ],
    "ingredients": [
        "3/4 cup finely chopped stemmed dried Calimyrna figs (about 5 ounces)",
        "2 tablespoons brandy",
        "2 tablespoons water",
        "1 cup (packed) golden brown sugar",
        "1 cup light corn syrup",
        "3 large eggs",
        "1/4 cup (1/2 stick) unsalted butter, melted, cooled",
        "1 1/2 teaspoons vanilla extract",
        "1/4 teaspoon salt",
        "2 cups pecan halves, toasted",
        "Flaky Pie Crust Dough",
        "1 cup chilled whipping cream",
        "2 tablespoons sugar",
        "1 tablespoon brandy"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Fig",
        "Pecan",
        "Fall",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pecan-Fig Pie with Brandied Whipped Cream",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-fig-pie-with-brandied-whipped-cream-105849"
}
