{
    "directions": [
        "Roll out the dough 1/8 inch thick on a lightly floured surface, fit into a 10-inch tart pan with a removable fluted rim, and trim the edge, leaving a 1/2-inch overhang. Fold the overhang inward onto the side of the shell, pressing it firmly, and chill the shell for 30 minutes. Spread the chocolate, melted, on the bottom of the shell and chill the shell for 15 minutes.",
        "In a heavy saucepan combine the brown sugar and the syrup, bring the mixture to a boil, stirring, and simmer it for 5 minutes. Let the mixture cool until it is no longer bubbling, add the butter, and stir the mixture until the butter is melted. In a bowl whisk together the eggs, the vanilla, and a pinch of salt and add the syrup mixture in a slow stream, whisking. Add the pecans to the shell, pour in the egg mixture, and if necessary tap down the pecans to coat them with the egg mixture. Bake the tart in the middle of a preheated 350°F. oven for 40 to 45 minutes, or until the crust is pale golden, let it cool, and serve it warm with the banana rum ice cream.",
        "In a large bowl blend the flour, the butter, the vegetable shortening, and the salt until the mixture resembles meal. Add 2 tablespoons ice water, toss the mixture until the water is incorporated, adding more ice water if necessary to form a dough, and form the dough into a ball. Dust the dough with flour and chill it, wrapped in wax paper, for 1 hour."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits",
        "2 tablespoons cold vegetable shortening",
        "1/4 teaspoon salt",
        "3 1/2 ounces bittersweet chocolate, chopped",
        "3/4 cup firmly packed brown sugar",
        "3/4 cup light corn syrup",
        "2 tablespoons unsalted butter, cut into bits",
        "4 large eggs",
        "1 teaspoon vanilla",
        "1 2/3 cups pecan halves",
        "banana rum ice cream as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Dessert",
        "Bake",
        "Pecan",
        "Gourmet"
    ],
    "title": "Pecan Chocolate Tart",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-chocolate-tart-11780"
}
