{
    "directions": [
        "Blend both flours, sugar, and salt in processor. Add butter; pulse until mixture resembles coarse meal. Add lemon juice, then 6 tablespoons ice water; process just until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Divide dough in half. Gather each half into ball and flatten into disk. Wrap separately in plastic. Refrigerate at least 2 hours. DO AHEAD: Can be made ahead and refrigerated up to 2 days or frozen up to 1 month. If frozen, thaw in refrigerator before using.",
        "Roll out 1 dough disk on floured surface to 13 1/2- to 14-inch round, about 1/8 inch thick. Transfer dough to 9-inch-diameter glass pie dish. Trim excess dough, leaving 3/4-inch overhang. Turn overhang under and crimp edge decoratively. Repeat with second dough disk. Refrigerate while preparing filling.",
        "Position rack in center of oven and preheat to 350°F. Whisk eggs in large bowl. Whisk in both sugars, then next 5 ingredients. Stir in pecans. Divide filling between prepared crusts.",
        "Bake pies until filling is puffed and just set in center (filling may begin to crack), about 55 minutes. Cool pies completely on rack. DO AHEAD: Can be made 1 day ahead. Cover with foil; store at room temperature."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "1/2 cup cake flour",
        "1 tablespoon sugar",
        "1/2 teaspoon coarse kosher salt",
        "1 cup (2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "2 teaspoons fresh lemon juice",
        "6 tablespoons (or more) ice water",
        "6 large eggs",
        "1 cup (packed) dark brown sugar",
        "1 cup (packed) golden brown sugar",
        "1 1/3 cups light corn syrup",
        "1/2 cup (1 stick) unsalted butter, melted",
        "1/4 cup bourbon (such as Maker's Mark)",
        "1 teaspoon coarse kosher salt",
        "1 teaspoon finely grated lemon peel",
        "4 cups (about 16 ounces) pecan halves, toasted, very coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Food Processor",
        "Citrus",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Thanksgiving",
        "Pecan",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pecan-Bourbon Pie",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-bourbon-pie-236254"
}
