{
    "directions": [
        "Make the dough by hand: In a medium bowl, whisk together the flour, sugar, and salt. Using your fingers, work the butter into the dry ingredients until it resembles yellow cornmeal mixed with bean-sized bits of butter. (If the flour/butter mixture gets warm, refrigerate it for 10 minutes before proceeding.) Add the egg and stir the dough together with a fork or by hand in the bowl. If the dough is dry, sprinkle up to a tablespoon more of cold water over the mixture.",
        "Alternatively, make the dough in a food processor. With the machine fitted with the metal blade, pulse the flour, sugar, and salt until combined. Add the butter and pulse until it resembles yellow cornmeal mixed with bean-sized bits of butter, about 10 times. Add the egg and pulse 1 to 2 times; don't let the dough form into a ball in the machine. (If the dough is very dry add up to a tablespoon more of cold water.) Remove the bowl from the machine, remove the blade, and bring the dough together by hand.",
        "Form the dough into a disk, wrap with plastic wrap, and refrigerate until thoroughly chilled, at least 1 hour.",
        "On a lightly floured surface, roll the dough with a rolling pin into a 12-inch circle about 1/8-inch thick. Transfer the dough to a 9-inch pie pan and trim the edges, leaving about an extra inch hanging over the edge. Tuck the overhanging dough underneath itself to form a thick edge that is even with the rim. Flute the edge as desired. Freeze the pie shell for 30 minutes.",
        "Set separate racks in the center and lower third of oven and preheat to 400 degrees F. Put a piece of parchment paper or foil over the pie shell and fill with dried beans or pie weights. Bake on a baking sheet on the center rack until the dough is set, about 20 minutes. Remove from the oven and lift sides of the parchment paper to remove the beans. Continue baking until the pie shell is lightly golden brown, about 10 more minutes. Reduce the oven temperature to 350 degrees F.",
        "While the crust is baking make the filling: In medium saucepan, combine the butter, brown sugar, corn syrup, and salt. Bring to a boil over medium heat, and stirring constantly, continue to boil for 1 minute. Remove from the heat and stir in the nuts, bourbon, and the vanilla. Set the mixture aside to cool slightly, about 5 minutes. (If the crust has cooled, return it to the oven for 5 minutes to warm through.) Whisk the beaten eggs into the filling until smooth. Put the pie shell on a sheet pan and pour the filling into the hot crust.",
        "Bake on the lower oven rack until the edges are set but the center is still slightly loose, about 40 to 45 minutes. (If the edges get very dark, cover them with aluminum foil half way during baking.) Cool on a rack. Serve slightly warm or room temperature."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "2 teaspoons sugar",
        "1/8 teaspoon salt",
        "1/2 cup cold butter (1 stick), diced",
        "1 large egg, lightly beaten",
        "Flour, for rolling the dough",
        "5 tablespoons unsalted butter",
        "1 cup packed light brown sugar",
        "3/4 cup light corn syrup",
        "1/2 teaspoon fine salt",
        "2 cups chopped toasted pecans",
        "1 to 2 tablespoons bourbon",
        "2 teaspoons pure vanilla extract",
        "3 eggs, lightly beaten"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pecan Pie",
        "Nut Recipes",
        "Pie Recipes",
        "Baking",
        "Dessert",
        "American",
        "Pie Crust Recipes",
        "Bourbon",
        "Holiday"
    ],
    "title": "Pecan Pie",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/pecan-pie-recipe"
}
