{
    "directions": [
        "To Make Crust: In a medium bowl, combine flour and salt and mix well. With two knives or a pastry blender, cut in butter until mixture is in fine crumbs. Gradually add just enough ice water so that the pastry holds together. Form into a ball, then flatten into a disk. Handle as little as possible. Wrap tightly in plastic wrap and chill for at least 1 to 2 hours.",
        "Roll out crust on lightly floured surface with lightly floured rolling pin. Turn crust over frequently and lightly re-flour work surface and rolling pin as necessary. Crust should be rolled into a circle about 13 inches in diameter. Fit crust into an ungreased 9 inch pie plate of heatproof glass; form a high-standing rim, trimming excess from edges and pinching or fluting rim decoratively as desired.",
        "Preheat oven to 400 degrees F (205 C). Thoroughly prick crust all over with fork. Chill for at least 10 minutes while oven heats. Bake in preheated oven 5 minutes (crust will not brown). Remove to rack and cool completely before filling.",
        "Leave oven at 400 degrees F (205 C). Break up pecan pieces and sprinkle them evenly on the bottom of the cooled pie shell.",
        "To Make Filling: In a small bowl beat eggs to combine. Add espresso powder and beat to mix. Let stand at least 10 minutes, beating occasionally to dissolve espresso.",
        "In a medium bowl cream softened butter, sugar, and vanilla until light and fluffy. Beat in cocoa and salt. Add egg/espresso mixture 1/3 at a time, beating after each addition, until smooth. Stir in corn syrup. This mixture will be like custard and it will be thick.",
        "Pour mixture slowly over pecans in pie shell. If any pecans do not get completely covered by the filling, submerge them until they do. Let stand 2 to 3 minutes; with toothpick or tip of sharp knife, pierce any remaining air bubbles (during this standing period, pecans may rise to top of pie).",
        "Bake in preheated oven for 10 minutes. Reduce heat from 400 degrees F (205 C) to 350 degrees F (175 C) and bake 33 to 37 minutes longer (or until edges are cracked and risen but pie center still quivers slightly when pie is shaken gently). Do not over-bake! If pie begins to brown excessively, cover top lightly with foil. Remove from oven; cool on rack before serving."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1 pinch salt",
        "6 tablespoons unsalted butter, chilled",
        "5 tablespoons ice water",
        "1 1/3 cups pecan halves",
        "4 eggs",
        "1 tablespoon instant espresso powder",
        "1/3 cup unsalted butter, softened",
        "3/4 cup light brown sugar",
        "1 teaspoon vanilla extract",
        "1/4 cup unsweetened cocoa powder",
        "1 pinch salt",
        "1 cup light corn syrup"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pecan And  Chocolate Espresso Pie",
    "url": "http://allrecipes.com/recipe/12568/pecan-and-chocolate-espresso-pie/"
}
