{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Generously butter 3 (9 inch) pans. Divide 2 cups chopped pecans evenly between the pans. Shake to coat bottoms and sides of pans.",
        "In a large bowl, cream together 1/2 cup butter, shortening and 2 cups sugar until light and fluffy. Beat in the yolks one at a time, then stir in 1 teaspoon vanilla. Combine the flour and baking soda and beat into creamed mixture alternately with the buttermilk. Stir in 1 cup chopped pecans.",
        "In a large glass or metal mixing bowl, beat egg whites until stiff peaks form. Fold 1/3 of the whites into the batter, then quickly fold in remaining whites until no streaks remain. Divide batter equally into prepared pans.",
        "Bake in the preheated oven for 25 to 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Cool in pans on wire racks 10 minutes. Invert layers onto wire racks lined with wax paper. Brush tops and sides of cake layers with 2/3 cup corn syrup, and cool completely.",
        "Make the Filling:  In a large saucepan, combine 1/2 cup brown sugar and cornstarch. Stir in 4 egg yolks, half-and-half, 3/4 cup corn syrup and salt. Bring mixture to a boil over medium heat. Continue boiling, whisking constantly for 1 minute, or until thickened.  Remove from heat. Whisk in butter and vanilla. Chill.",
        "Assemble the cake:  Place first layer on serving plate, pecan side up. Spread with half of the filling. Place second layer, pecan side up, on filling. Spread with remaining filling. Top with remaining cake layer, pecan side up."
    ],
    "ingredients": [
        "2 cups chopped pecans",
        "1/2 cup butter, softened",
        "1/2 cup shortening",
        "2 cups white sugar",
        "5 egg yolks",
        "1 tablespoon vanilla extract",
        "1 cup buttermilk",
        "2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1 cup chopped pecans",
        "5 egg whites",
        "3/4 cup dark corn syrup",
        "1/2 cup packed brown sugar",
        "1/3 cup cornstarch",
        "4 egg yolks",
        "1 1/2 cups half-and-half cream",
        "3/4 cup dark corn syrup",
        "1/8 teaspoon salt",
        "3 tablespoons butter",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pecan Pie Cake III",
    "url": "http://allrecipes.com/recipe/26044/pecan-pie-cake-iii/"
}
