{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Butter and flour cake pans, knocking out excess flour.",
        "Sift together cake flour, baking powder, baking soda, salt, and spices into a large bowl.",
        "Beat together butter (1 1/2 sticks) and brown sugar in another bowl with an electric mixer (fitted with paddle attachment if using a stand mixer) at medium-high speed until pale and fluffy, 3 to 5 minutes. Beat in eggs 1 at a time, beating well after each addition, then beat in vanilla. Reduce speed to low, then add flour mixture and sour cream alternately in batches, beginning and ending with flour mixture and mixing until batter is just smooth. Mix in pecans until just combined.",
        "Spoon batter evenly into pans, smoothing tops, then rap pans once or twice to expel any air bubbles. Bake until pale golden and a wooden pick inserted in center of cakes comes out clean, 30 to 35 minutes. Cool 10 minutes in pans on racks. Run a thin knife around edge of pans, then invert racks over pans and reinvert cakes onto racks to cool completely.",
        "Beat together cream cheese, butter, and zest in a bowl with clean beaters at medium-high speed until fluffy, 1 to 2 minutes. Sift in confectioners sugar and stir with a wooden spoon until just combined, then add lemon juice and beat at medium-high speed until frosting is smooth.",
        "Halve each cake layer horizontally with a long serrated knife using a gentle sawing motion. Put 1 layer, cut side up, on a cake stand or large plate and spread with about 3/4 cup frosting. Stack remaining cake layers, spreading about 3/4 cup frosting on each layer and ending with top cake layer cut side down. Spread top and side of cake with remaining frosting (about 3 1/2 cups) and coat side of cake with pecans (1 1/3 cups), gently pressing to help them adhere."
    ],
    "ingredients": [
        "1 1/2 sticks (3/4 cup) unsalted butter, cut into 1-inch pieces and softened, plus additional for buttering pans",
        "2 3/4 cups cake flour (not self-rising)",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "3/4 teaspoon salt",
        "1 tablespoon ground cinnamon",
        "1 1/4 teaspoons freshly grated nutmeg",
        "1 teaspoon ground ginger",
        "1/2 teaspoon ground allspice",
        "1/4 teaspoon ground cloves",
        "1 1/2 cups packed light brown sugar",
        "3 large eggs at room temperature 30 minutes",
        "1 1/2 teaspoons pure vanilla extract",
        "1 1/2 cups sour cream",
        "3/4 cup pecans (3 ounces), toasted , cooled, and finely chopped",
        "3 (8-ounce) packages cream cheese, softened",
        "1 1/2 sticks (3/4 cup) unsalted butter, softened",
        "1 tablespoon finely grated fresh lemon zest",
        "3 3/4 cups confectioners sugar (from a 1-pound package)",
        "1 tablespoon fresh lemon juice",
        "1 1/3 cups pecans (5 ounces), toasted, cooled, and finely chopped",
        "Special equipment: 2 (9-inch) round cake pans (2 inches deep)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Citrus",
        "Dairy",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Easter",
        "Wedding",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pecan Spice Layer Cake with Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-spice-layer-cake-with-cream-cheese-frosting-238083"
}
