{
    "directions": [
        "To make the praline, line a baking sheet with waxed paper.",
        "Combine the water and the sugar in a saucepan over high heat. Gently swirl the pan around to melt the sugar evenly. Using a candy thermometer, cook the sugar until it reaches 370°F. Add the pecan halves to the caramel and quickly stir the nuts to coat them thoroughly with the caramel. Spoon the praline onto the waxed paper in an even layer to cool. Once the praline has cooled, chop it finely with a knife and reserve.",
        "To make the parfait, line a 9 by 5 by 3-inch loaf pan with plastic wrap, letting enough excess wrap hang over the sides to cover the top.",
        "Using a stand mixer fitted with the whisk attachment, whip the heavy whipping cream on medium-high speed until it reaches stiff peaks. Remove the bowl from the mixer and, with a rubber spatula, fold the sour cream into the whipped cream. Transfer the mixture to a large bowl and refrigerate until needed.",
        "Have the egg yolks and egg whites in separate bowls. Put the egg yolks in a stand mixer fitted with the whisk attachment and add 1/4 cup of the sugar. Whisk the mixture on high speed until you achieve a thick, pale yellow consistency. Transfer the mixture to another bowl and reserve.",
        "Using a stand mixer fitted with the whisk attachment, whisk the egg whites on medium speed until frothy. Decrease the speed to low and slowly sprinkle the remaining 1/4 cup sugar into the whites. Once the sugar is added, increase the speed to high and whisk until medium peaks form.",
        "Fold the cream mixture into the yolks, then fold in the egg whites in three additions. Fold in the chopped pecan praline.",
        "Fill your prepared loaf pan with the semifreddo mixture and smooth out the top. Pull the plastic wrap over the top and freeze for at least 4 hours, but preferably overnight.",
        "To make the caramel, using a candy thermometer, cook the water and the sugar in a medium saucepan over medium-high heat until it reaches 380°F. Remove the caramel from the heat and carefully add the heavy cream. Return it to the stove over low heat. Once the cream dissolves into the caramel, you need to swirl the pan periodically but try not to stir it, remove it from the heat and add the bourbon. Hold the caramel at room temperature until you are ready to serve it.",
        "To serve the semifreddo, pull the plastic wrap away from the top. Invert the loaf pan onto a platter. Wrap a hot, wet kitchen towel over the loaf pan and gently rub the sides to release the semifreddo. Once the semifreddo is released onto the platter, peel off the plastic wrap.",
        "Slice the semifreddo into ten equal slices with a sharp knife. Serve each with a drizzle of bourbon caramel."
    ],
    "ingredients": [
        "1/4 cup water",
        "1 cup sugar",
        "2 cups toasted pecan halves",
        "3 cups heavy whipping cream",
        "1 cup sour cream",
        "4 large eggs, separated, at room temperature",
        "1/2 cup sugar",
        "1/3 cup water",
        "1 cup sugar",
        "3/4 cup heavy cream",
        "1 tablespoon bourbon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Milk/Cream",
        "Dairy",
        "Nut",
        "Dessert",
        "Freeze/Chill",
        "Thanksgiving",
        "Frozen Dessert",
        "Tree Nut",
        "Pecan",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pecan Praline Semifreddo with Bourbon Caramel",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-praline-semifreddo-with-bourbon-caramel-51116410"
}
