{
    "directions": [
        "Simmer figs in water in a heavy medium saucepan, covered, until figs are tender and most of liquid is absorbed, 35 to 40 minutes. Purée in a food processor with bourbon and vanilla. Cool to warm.",
        "Preheat oven to 350°F with rack in middle. Butter and flour bundt pan, knocking out excess flour.",
        "While oven preheats, sift together flour, baking powder, baking soda, salt, cinnamon, and nutmeg.",
        "Lightly toast pecans in a shallow baking pan in oven, 8 to 10 minutes, then cool and coarsely chop. Leave oven on.",
        "Beat together brown sugar, oil, and eggs in a large bowl with an electric mixer until thick and creamy, about 3 minutes. Stir in fig mixture. At low speed, mix in flour mixture until just incorporated, then fold in pecans.",
        "Pour batter into bundt pan and bake until a wooden pick inserted in center comes out clean, 1 to 1 1/4 hours. Cool cake completely in pan on a rack, then invert onto a plate.",
        "Sift confectioners sugar into a bowl, then whisk in remaining icing ingredients until smooth. Drizzle over cake."
    ],
    "ingredients": [
        "1 pound dried Black Mission figs, hard tips discarded",
        "2 cups water",
        "1/2 cup bourbon",
        "1 teaspoon pure vanilla extract",
        "3 cups sifted cake flour (not self-rising; sift before measuring)",
        "2 teaspoons baking powder",
        "3/4 teaspoon baking soda",
        "3/4 teaspoon salt",
        "1/2 teaspoon cinnamon",
        "1/2 teaspoon grated nutmeg",
        "1 3/4 cups pecans (7 ounces)",
        "2 cups packed light brown sugar",
        "1 cup vegetable oil",
        "3 large eggs, at room temperature 30 minutes",
        "1 cup confectioners sugar",
        "4 1/2 tablespoons heavy cream",
        "2 teaspoons bourbon",
        "1/4 teaspoon pure vanilla extract",
        "Equipment: a 12-cup bundt pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Bourbon",
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Fruit",
        "Dessert",
        "Bake",
        "Fig",
        "Pecan",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pecan Fig Bourbon Cake",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-fig-bourbon-cake-241215"
}
