{
    "directions": [
        "In a food processor grind graham crackers and pecans fine and in a bowl stir together with butter. Press mixture into bottom of a 9- by 2 1/2-inch springform pan. Chill crust 30 minutes.",
        "Preheat oven to 325°F.",
        "In a bowl with an electric mixer beat cream cheese until light and fluffy. Add brown sugar gradually, beating until combined well. Beat in flour and add eggs, 1 at a time, beating well after each addition. Add sour cream, vanilla, and salt, beating until combined well.",
        "Pour filling into crust and bake in middle of oven 1 hour, or until edges are just set but middle trembles slightly. (Cheesecake will continue to set as it cools.) Turn off oven and cool cheesecake in oven with oven door propped open about 6 inches until cooled completely, about 2 hours.",
        "In a dry heavy saucepan cook 1/2 cup sugar over moderately low heat until melted. Cook sugar, swirling pan, until a deep caramel. Add remaining 1/2 cup sugar and cream and simmer, stirring occasionally, until caramel dissolves. Simmer mixture, without stirring, until it registers 225°F. on a candy thermometer and remove from heat. Stir in butter and vanilla and cool to room temperature.",
        "Pour topping over cheesecake, spreading evenly. Arrange pecans decoratively on top and chill cheesecake, covered, overnight. Remove side of pan."
    ],
    "ingredients": [
        "seven 5- by 2 1/2-inch graham crackers",
        "1/2 cup coarsely chopped pecans, toasted and cooled",
        "3/4 stick (6 tablespoons) unsalted butter, melted and cooled",
        "2 pounds cream cheese, softened",
        "1 1/2 cups firmly packed light brown sugar",
        "1/4 cup all-purpose flour",
        "4 large eggs",
        "1/2 cup sour cream",
        "2 teaspoons vanilla extract",
        "1/2 teaspoon salt",
        "1 cup granulated sugar",
        "1 cup heavy cream",
        "1 tablespoon unsalted butter",
        "1 teaspoon vanilla extract",
        "1 cup pecan halves, toasted lightly and cooled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Pecan",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Pecan Caramel Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-caramel-cheesecake-10153"
}
