{
    "directions": [
        "Lay out a 15-inch-long piece of plastic wrap on a cutting board and drizzle it with a little olive oil. Lay a butterflied chicken breast, cut side up, on the plastic wrap. Fold the plastic wrap over to cover. Using a meat pounder, pound out the thicker parts of the breast so that it's uniformly thick. Fold the plastic wrap open and brush the chicken breast with the molasses; season with generous pinches of fennel, salt and pepper. (This will be the inside part of the breast that gets stuffed.) Fold the plastic wrap back over and flip the breast over. Fold plastic wrap open and season the other side of the breast with salt and pepper. (This is the outside that will later get seared in the pan.) Re-cover with the plastic wrap and place on a plate. Repeat this process with the remaining chicken breasts. Refrigerate for 1 hour or up to overnight.",
        "Heat the 2 tablespoons olive oil in a large skillet over medium heat. Add the onions, season with salt and pepper, and saute until soft and translucent, about 5 minutes. Add the garlic and pecans, and cook another 2 minutes. Add the tarragon and cook another minute. Taste and adjust the seasoning if necessary. Remove from heat and let cool to room temperature.",
        "Remove a butterflied breast from the plastic wrap. Place it on a cutting board, molasses-side up. Place 1/4 cup of the filling on half of the chicken breast. Fold over the other half to enclose the filling. Using a bamboo skewer, close up the opening by threading the skewer through one end of the opening to the other to secure. Repeat with the remaining chicken breasts and filling.",
        "Heat the canola oil in a large skillet over medium-high heat. Add the stuffed chicken breasts and cook for about 3 minutes per side, until nicely browned. Add the wine, chicken broth and crushed tomatoes. Turn down the heat to low, cover, and poach until the chicken is cooked through, another 8 minutes.",
        "Transfer the chicken to a plate, remove the skewers, cover the chicken with foil and let rest for 5 minutes. While chicken is resting, turn up the heat on the poaching liquid to medium, add the crushed red pepper, and let simmer until thickened and reduced by a third, about 5 minutes. Taste and adjust the seasoning if necessary. Strain the sauce into a small pot and keep warm over low heat until ready to serve.",
        "To serve: Slice the chicken, if desired, and arrange on a serving platter. Pour some sauce over the top. Serve immediately, with extra sauce on the side."
    ],
    "ingredients": [
        "2 tablespoons olive oil, plus for drizzling",
        "4 boneless skinless chicken breast halves (6 to 7 ounces each), butterflied",
        "1 tablespoon molasses, mixed with 2 teaspoons hot water",
        "1 teaspoon ground fennel",
        "Salt and fresh ground pepper",
        "1 medium onion, diced",
        "2 cloves garlic, chopped",
        "1 cup pecans, toasted, roughly chopped",
        "2 tablespoons chopped fresh tarragon",
        "3 tablespoons vegetable or canola oil",
        "1 cup white wine",
        "1 cup chicken broth",
        "Half 15-ounce can crushed tomatoes",
        "1/4 teaspoon crushed red pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Stuffed Chicken Breast",
        "Chicken Breast",
        "Chicken",
        "Poultry Recipes",
        "Nut Recipes",
        "Tomato",
        "Vegetable",
        "Main Dish Recipes",
        "Lunch",
        "Poaching Recipes"
    ],
    "title": "Pecan-Stuffed Chicken Breast",
    "url": "http://www.foodnetwork.com/recipes/daphne-brogdon/pecan-stuffed-chicken-breast"
}
