{
    "directions": [
        "In a bowl stir together the brown sugar, the oats, the flour, the baking powder, and the salt, add the butter, and combine the mixture well. Pat the mixture evenly onto the bottom and 1/2 inch up the side of a well-buttered 9-inch springform pan and bake the shell in the lower third of a preheated 325°F. oven for 15 to 20 minutes, or until it is pale golden. Let the shell cool in the pan on a rack.",
        "In a saucepan combine the honey, the brown sugar, and the butter, cook the mixture over moderate heat, stirring, until it is smooth and the butter is melted completely, and stir in the cream. In a bowl stir together the oats, the coconut, the pecans, the sunflower seeds, and a pinch of salt, add the butter mixture, and combine the filling well.",
        "Pour the filling into the shell and bake the tart in the middle of a preheated 350°F. oven for 25 to 30 minutes, or until the edges are golden and the center is just set. (The center will set completely as the tart cools.) Let the tart cool on a rack for 10 minutes, remove the side of the pan, and let the tart cool completely on the rack.",
        "In a small metal bowl set over a pan of simmering water melt the chocolate with the butter, stirring until the mixture is smooth, and let it cool slightly. Drizzle the chocolate mixture on top of the tart decoratively and let it set."
    ],
    "ingredients": [
        "1/2 cup firmly packed light brown sugar",
        "1 cup old-fashioned rolled oats",
        "1 cup all-purpose flour",
        "1/2 teaspoon double-acting baking powder",
        "1/2 teaspoon salt",
        "1/2 cup unsalted butter, melted and cooled",
        "1/3 cup honey",
        "3/4 cup firmly packed light brown sugar",
        "1/2 cup unsalted butter",
        "1/4 cup heavy cream",
        "1 cup old-fashioned rolled oats",
        "1/2 cup sweetened flaked coconut",
        "1 1/4 cup finely chopped pecans, toasted lightly",
        "1/2 cups hulled sunflower seeds, toasted lightly",
        "1 ounce bittersweet chocolate (not unsweetened)",
        "1 teaspoon unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Coconut",
        "Pecan",
        "Oat",
        "Party",
        "Potluck",
        "Gourmet"
    ],
    "title": "Pecan Coconut Tart",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-coconut-tart-12753"
}
