{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Butter an 8-inch by 10-inch baking dish.",
        "Mix pecans, 1/3 cup white sugar, brown sugar, cinnamon, salt, and melted butter thoroughly in a mixing bowl until all components are coated with butter, 3 to 4 minutes.",
        "In a separate bowl, whisk together flour, salt, baking powder, and baking soda.",
        "In another bowl, mix together butter and 1 cup sugar with a spatula until well blended. Add 1 egg and whisk until mixture is smooth, 2 to 3 minutes. Whisk in second egg until thoroughly incorporated. Add vanilla and sour cream; whisk together. Add flour mixture to wet ingredients; whisk until flour disappears (do not over mix).",
        "Spread one half of the batter evenly into the bottom of the prepared baking dish. Scatter one half of the crumb mixture evenly over the top of the batter. Top with the rest of the batter and spread carefully to evenly distribute, trying not to disturb the crumbs. Top with the rest of the crumb mixture. Very gently press crumbs into batter. Bake in preheated oven until a bamboo skewer comes out clean, 30 to 35 minutes. Let cool slightly before serving."
    ],
    "ingredients": [
        "Crumb:",
        "1 1/2 cups pecans, finely chopped",
        "1/3 cup white sugar",
        "1/3 cup packed light brown sugar",
        "1 teaspoon cinnamon",
        "1/8 teaspoon salt",
        "3 tablespoons melted butter",
        "Cake:",
        "1 7/8 cups all-purpose flour",
        "1/2 teaspoon fine sea salt",
        "1 teaspoon baking powder",
        "3/4 teaspoon baking soda",
        "1/2 cup butter",
        "1 cup white sugar",
        "2 large eggs",
        "1 1/2 teaspoons vanilla extract",
        "1 cup sour cream or creme fraiche"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pecan Sour Cream Coffee Cake",
    "url": "http://allrecipes.com/recipe/246868/pecan-sour-cream-coffee-cake/"
}
