{
    "directions": [
        "Bring brown sugar, corn syrup, butter, and salt to a boil in a medium saucepan over medium-high heat, whisking to dissolve sugar. Boil until mixture is syrupy and measures 1 1/3 cups, about 3 minutes. Remove from heat; add cream and bourbon, if desired, and stir until smooth. Let cool. DO AHEAD: Can be made 3 days ahead. Let cool completely, cover, and chill. Rewarm before serving.",
        "Toss bread, melted butter, and 2 tablespoons sugar in a large bowl and set aside. Using an electric mixer, beat eggs and remaining 1 1/2 cups sugar in another large bowl until pale yellow and fluffy, about 3 minutes. Add cream, poppy seeds, and salt; beat to blend. Place bourbon in a small bowl; scrape in seeds from vanilla bean (reserve bean for another use). Whisk to distribute seeds, then add to egg mixture, whisking to blend well. Pour egg mixture over bread mixture in bowl. Add pecans and toss to coat well. Transfer mixture to a 13x9x2\" glass or ceramic baking dish, spreading out in an even layer. Cover with plastic wrap and chill overnight.",
        "Preheat oven to 325°F. Remove plastic wrap and bake until top is browned in spots and a tester inserted into center comes out clean, 1 1/4-1 1/2 hours. Serve bread pudding with butterscotch sauce."
    ],
    "ingredients": [
        "1 cup (packed) light brown sugar",
        "1/2 cup light corn syrup",
        "3 tablespoons unsalted butter",
        "1 1/2 teaspoons kosher salt",
        "1/2 cup heavy cream",
        "1 tablespoon bourbon (optional)",
        "1 pound day-old rustic white bread, crusts removed, cut into 1/2\" cubes (12 cups)",
        "1/2 cup (1 stick) unsalted butter, melted",
        "2 tablespoons plus 1 1/2 cups sugar",
        "5 large eggs",
        "4 cups heavy cream",
        "1 1/2 tablespoons poppy seeds",
        "Pinch of kosher salt",
        "3 tablespoons bourbon",
        "1/2 vanilla bean, split lengthwise",
        "2 cups pecan pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Kentucky Derby",
        "Pecan",
        "Fall",
        "Winter",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pecan, Bourbon, and Butterscotch Bread Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/pecan-bourbon-and-butterscotch-bread-pudding-368300"
}
