{
    "directions": [
        "Cut a shallow X in bottom of each peach with a sharp paring knife and immerse fruit in a 4-quart heavy pot (preferably wide) of boiling water 30 seconds, then transfer with a slotted spoon to a bowl of ice and cold water to stop cooking. Transfer peaches to a cutting board and peel, starting with cut end, then cut in half, discarding pits.",
        "Combine sugar and water in cleaned pot. Halve vanilla bean lengthwise with a paring knife and scrape seeds into pot, then add pod and bring mixture to a boil, stirring until sugar is dissolved. Add peaches, pitted sides down, to sugar syrup, then reduce heat and poach, covered, at a bare simmer 6 minutes. Turn peaches over and continue to poach, covered, until tender, 5 to 6 minutes more.",
        "Cool peaches in poaching liquid in pot, uncovered, 1 to 1 1/2 hours.",
        "Force raspberries through a fine-mesh sieve into a bowl, pressing hard on solids.",
        "Combine sugar and water in a small heavy saucepan. Cover pan (so condensation will wash any sugar crystals down side of pan) and bring to a boil, then remove lid and boil 2 minutes.",
        "Immediately stir sugar syrup into raspberry purée and cool to room temperature, about 1 hour. Stir in lemon juice. 3Serve peaches over ice cream and drizzled with sauce."
    ],
    "ingredients": [
        "6 medium firm-ripe peaches (2 1/4 lb)",
        "1 1/3 cups sugar",
        "2 cups water",
        "1 (1-inch) piece vanilla bean",
        "1 (12-oz) package frozen raspberries (not in syrup), thawed",
        "1/2 cup sugar",
        "1/3 cup water",
        "2 teaspoons fresh lemon juice",
        "Accompaniment: 2 pt superpremium vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Poach",
        "Quick & Easy",
        "Raspberry",
        "Peach",
        "Vanilla",
        "Gourmet"
    ],
    "title": "Peches Melba",
    "url": "http://www.epicurious.com/recipes/food/views/peches-melba-232640"
}
