{
    "directions": [
        "Preheat the oven to 400°F. Season the inside of the turkey with salt and pepper and tie the legs together. In the bottom of a large pot fitted with a small round rack or crumpled foil, bring 8 cups water to a boil over high heat. Reduce heat to medium low and lower the turkey into the pot. Cover and steam for 30 minutes.",
        "Meanwhile, make the glaze: In a medium saucepan, melt the butter. Whisk in 1/2 cup orange juice, soy sauce, molasses, vinegar, and 5-spice powder. Bring to a boil, reduce the heat to medium, and cook until the glaze is slightly thickened, 6 to 8 minutes.",
        "In a large roasting pan, toss the scallions, celery, and reserved orange peels with the oil and season with salt and pepper. Fit a roasting rack over the vegetables and place the turkey on top. Brush all over with the glaze, lower oven to 350°F, and roast the turkey, basting every 20 minutes, until a thermometer inserted in the thigh registers 165°F, about 2 hours. If the turkey is browning too quickly, tent with a piece of foil. Let the turkey rest about 20 minutes before carving.",
        "While the turkey is cooking, in a large saucepan over medium-high heat, heat the oil. Add the turkey neck, gizzard, and liver and cook until browned on all sides, 8 to 10 minutes, flipping occasionally; season with salt and pepper. Lower the heat to medium and add the shallot, garlic, ginger, cloves, star anise, and allspice, and cook until the vegetables are softened, 2 to 3 minutes. Add the broth and bring to a boil, scraping the browned bits from the bottom of the pan. Lower the heat to medium-low and simmer, uncovered, until the stock is flavorful and slightly reduced, about 1 hour. Strain the broth into a large clean saucepan and set aside on the stovetop to keep warm.",
        "In a large pot, melt butter over medium heat. Sprinkle the flour over the butter and whisk to combine. Cook, stirring frequently with a wooden spoon, until butter mixture is browned, 2 to 3 minutes. Whisk in the broth and bring to a boil. Reduce to a simmer and cook until gravy is thickened, 15 to 20 minutes.",
        "Once the turkey has been removed from the roasting pan, strain the drippings into the pot with the gravy, discarding the solids. Place the roasting pan over two burners over medium-high heat. Pour in the wine and orange juice and bring to a boil. Scrape up brown bits on the bottom of the pan, and cook until reduced, about 1 minute. Pour pan juices into the gravy. Season with salt and pepper and serve with the turkey."
    ],
    "ingredients": [
        "One 12- to 14-pound turkey (neck, gizzard, and liver reserved), left at room temperature for 1 hour",
        "Kosher salt and freshly ground black pepper",
        "4 tablespoons unsalted butter, melted",
        "3/4 cup orange juice (from 2 oranges), divided (reserve peels for roasting pan and 1/4 cup juice for gravy)",
        "1/4 cup soy sauce",
        "2 tablespoons molasses",
        "2 tablespoons rice-wine vinegar",
        "2 tablespoons 5-spice powder",
        "1 bunch scallions, cut into large pieces",
        "1 celery stalk, cut into large pieces",
        "2 tablespoons vegetable oil, such as grapeseed",
        "1 tablespoon vegetable oil, such as grapeseed",
        "Reserved turkey neck, gizzard, and liver",
        "Kosher salt and freshly ground black pepper",
        "1 shallot, chopped",
        "2 garlic cloves, smashed",
        "One 2-inch piece ginger, sliced",
        "2 cloves",
        "1 whole star anise",
        "1 allspice berry",
        "4 cups low-sodium chicken or turkey broth",
        "4 tablespoons unsalted butter",
        "1/4 cup all-purpose flour",
        "3/4 cup dry white wine",
        "1/4 cup fresh orange juice (reserved from above)",
        "a large stock pot or lobster pot (16-quart or larger), a roasting pan with rack, kitchen twine"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "Peking-Style Roast Turkey with Molasses-Soy Glaze and Orange-Ginger Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/peking-style-roast-turkey-with-molasses-soy-glaze-and-orange-ginger-gravy-51252590"
}
