{
    "directions": [
        "Soak noodles in cold water to cover 30 minutes, then drain. Cook noodles in a large (5- to 6-quart) pot of boiling salted water 4 minutes. Drain noodles in a colander, then rinse thoroughly and drain well.",
        "Stir together soy sauce and water, then reserve.",
        "Heat 1 1/2 teaspoons oil in wok or skillet over medium-high heat until shimmering, then add eggs and stir-fry until just cooked through, about 30 seconds. Transfer to a plate and wipe out pan, if necessary.",
        "Heat remaining 1 tablespoon oil in pan until shimmering and stir-fry shrimp and chile paste 30 seconds (shrimp will not be cooked through).",
        "Add chorizo and garlic and stir-fry until shrimp are just cooked through, 30 seconds to 1 minute.",
        "Add soy mixture, cooked noodles, jicama, and scallions, and stir-fry until noodles are heated through and scallion greens are wilted, about 1 minute.",
        "Remove pan from heat and stir in eggs. Serve immediately."
    ],
    "ingredients": [
        "1/2 pound (1/8- to 1/4-inch wide) dried rice stick noodles",
        "2 1/2 tablespoons soy sauce",
        "1 tablespoon water",
        "1 1/2 tablespoons vegetable oil, divided",
        "2 large eggs, lightly beaten with a pinch of salt",
        "1/2 pound peeled and deveined large shrimp",
        "1 tablespoon chile paste (sambal oelek) or Chinese garlic chile paste",
        "3 ounces Spanish chorizo, halved lengthwise, casing removed if desired (see Cooks' Notes), sausage thinly sliced crosswise",
        "2 large garlic cloves, finely chopped",
        "1/2 pound jicama, peeled and cut into 1/4-inch-thick matchsticks",
        "1 bunch scallions (greens only), cut crosswise into 1 1/2-inch lengths",
        "Lime wedges for serving",
        "Special equipment: A 14-inch wok, preferably flat-bottomed, or a 12-inch heavy skillet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Stir-Fry",
        "Dinner",
        "Lunch",
        "Sausage",
        "Shrimp",
        "Noodle",
        "Green Onion/Scallion",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Penang Fried Rice Noodles",
    "url": "http://www.epicurious.com/recipes/food/views/penang-fried-rice-noodles-368909"
}
