{
    "directions": [
        "1. Place one cutlet at a time inside a large plastic bag. With a meat mallet, pound the turkey or chicken slice as thin as possible and season well with salt and pepper.",
        "2. Spread the flour on a flat plate. Break the eggs into a pie plate and beat well. Put the bread crumbs on a third plate.",
        "3. Pour the oil into a heavy skillet to a depth of 1 inch and heat over a medium flame until almost smoking.",
        "4. Dip each turkey or chicken breast in flour, then in egg, and then in bread crumbs.",
        "5. Fry the schnitzels for 2 to 3 minutes on each side, until golden brown.",
        "6. Drain the schnitzels on a plate lined with paper towel. Serve immediately with lemon wedges.",
        "NOTE: You can also bake the breaded schnitzels in a 350-degree oven for a few minutes ahead of time. Then, just before serving, deep-fry quickly to crisp the outside.",
        "• This dish, a variation on veal schnitzel from Central Europe, is a classic example of the transformations common in Israeli cooking. Before Israel's swamps were drained in the 1950s to irrigate the desert, there was not enough grassland to pasture cows. Thus the first Central European Jewish settlers adapted one of their native dishes to use turkey meat, more easily raised in desert conditions. Subsequent immigrants have added twists from their own backgrounds, such as Yemeni Jews adding the Middle Eastern spice blend hawayij."
    ],
    "ingredients": [
        "6 boneless, skinless turkey or chicken breasts, sliced thin (about 1 1/2 pounds)",
        "Salt and freshly ground pepper to taste",
        "1 cup all-purpose flour",
        "3 large eggs",
        "2 cups fresh bread crumbs",
        "Vegetable or soybean oil for deep frying",
        "2 lemons, sliced in wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "turkey",
        "Fry",
        "Purim",
        "Dinner",
        "Kosher",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Penguin Buffet's Classic Israeli Schnitzel",
    "url": "http://www.epicurious.com/recipes/food/views/penguin-buffets-classic-israeli-schnitzel-231757"
}
