{
    "directions": [
        "Bring a large pot of salted water to a boil over high heat. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, about 8 to 10 minutes. Drain the pasta and set aside.",
        "In a large skillet, heat the oil over medium-high heat. Add the shrimp, garlic, 1/2 teaspoon of salt, and 1/2 teaspoon of pepper. Cook, stirring frequently until the shrimp turn pink and are cooked through, about 3 minutes. Using a slotted spoon, remove the shrimp from the pan and set aside.",
        "Add the tomatoes, 1/4 cup basil, 1/4 cup parsley, and the red pepper flakes. Cook for 2 minutes, stirring constantly. Add the wine, clam juice, and heavy cream. Bring the mixture to a boil. Reduce the heat to medium-low and simmer for 7 to 8 minutes until the sauce thickens. Add 1/4 cup of the Parmesan, the cooked shrimp, the cooked pasta, and the remaining herbs. Toss together until all ingredients are coated. Season, to taste, with salt and pepper.",
        "Transfer the pasta to a large serving bowl. Sprinkle with the remaining cheese and serve immediately."
    ],
    "ingredients": [
        "1 pound penne pasta",
        "1/4 cup olive oil",
        "1 pound medium shrimp, peeled, and deveined",
        "4 cloves garlic, minced",
        "1/2 teaspoon kosher salt, plus extra for seasoning",
        "1/2 teaspoon freshly ground black pepper, plus extra for seasoning",
        "1 (15 ounce) can whole tomatoes, drained, roughly chopped",
        "1/2 cup chopped fresh basil leaves",
        "1/2 cup chopped fresh flat-leaf parsley",
        "1/4 teaspoon crushed red pepper flakes",
        "1 cup white wine",
        "1/3 cup clam juice",
        "3/4 cup whipping cream",
        "1/2 cup grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Italian",
        "Pasta Recipes",
        "Christmas",
        "Holiday",
        "Shellfish Recipes",
        "Shrimp",
        "Cheese",
        "Main Dish Recipes"
    ],
    "title": "Penne with Shrimp and Herbed Cream Sauce",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/penne-with-shrimp-and-herbed-cream-sauce-recipe2"
}
