{
    "directions": [
        "Heat 2 tablespoons oil in heavy large pot over medium-high heat. Add onion and sauté until golden brown, about 10 minutes. Transfer to medium bowl. Add 2 tablespoons oil to pot. Add garlic and rosemary; sauté 30 seconds. Add mushrooms. Reduce heat to medium, cover, and cook until mushrooms are soft and brown, stirring often, about 15 minutes. Transfer to bowl with onion.",
        "Toss chicken in large bowl with enough flour to coat; shake off excess. Sprinkle with salt and pepper. Heat remaining 3 tablespoons oil in same pot over medium-high heat. Add chicken; sauté until no longer pink, about 5 minutes. Add 2 1/2 cups broth, wine, and capers. Bring to boil, scraping up any browned bits. Add mushroom-onion mixture and simmer until chicken is cooked through, about 5 minutes. Season to taste with salt and pepper.",
        "Meanwhile, cook pasta in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain. Add pasta to chicken mixture and toss over medium heat until heated through, adding more broth if necessary to moisten. Transfer pasta to large bowl. Sprinkle with parsley. Serve, passing cheese separately."
    ],
    "ingredients": [
        "7 tablespoons olive oil",
        "1 large red onion, thinly sliced",
        "4 large garlic cloves, finely chopped",
        "1 1/2 teaspoons minced fresh rosemary",
        "1 1/2 pounds fresh shiitake mushrooms, stems trimmed, caps thickly sliced",
        "1 1/2 pounds skinless boneless chicken breast halves, cut into 3/4-inch cubes",
        "All purpose flour",
        "2 1/2 cups (or more) low-salt chicken broth",
        "1/2 cup dry white wine",
        "2 tablespoons drained capers",
        "1 pound penne pasta",
        "1/4 cup chopped fresh parsley",
        "Freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Pasta",
        "Sauté",
        "Rosemary",
        "White Wine",
        "Fall",
        "Capers"
    ],
    "title": "Penne with Chicken, Shiitake Mushrooms, and Capers",
    "url": "http://www.epicurious.com/recipes/food/views/penne-with-chicken-shiitake-mushrooms-and-capers-107091"
}
