{
    "directions": [
        "Mix beef, panko, 1/4 cup parsley, egg white, salt, and black pepper in a large bowl until combined. Form mixture into 12 meatballs.",
        "Heat vegetable oil in a large skillet; pan-fry meatballs in hot oil until browned on all sides, about 7 to 10 minutes. Remove meatballs from heat.",
        "Heat olive oil in a 6-quart Dutch oven or a large skillet over medium heat. Cook and stir mushrooms in hot oil until tender, about 5 minutes. Reduce heat to medium-low and add garlic and red pepper flakes. Cook and stir until garlic is golden, about 5 minutes more. Stir canned and fresh tomatoes into mushrooms and season with salt.",
        "Drop meatballs into tomato sauce and stir in sugar; bring to a boil over medium heat. Reduce heat to medium-low and simmer uncovered until sauce is reduced and meatballs are no longer pink in the center, about 45 minutes.",
        "Meanwhile, fill a large pot with lightly salted water and bring to a boil. Stir in penne and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through but still firm to the bite, about 11 minutes. Reserve 1 cup cooking water, then drain pasta.",
        "Stir penne pasta into meatball sauce; toss to coat. Stir pasta water into mixture if sauce becomes too dry. Sprinkle  with remaining 1/4 cup parsley to serve."
    ],
    "ingredients": [
        "1 pound ground beef chuck",
        "1/2 cup panko bread crumbs",
        "1/4 cup chopped flat-leaf parsley",
        "1 egg white",
        "salt and ground black pepper to taste",
        "1 tablespoon vegetable oil",
        "3 1/2 fluid ounces extra-virgin olive oil",
        "3/4 cup sliced white button mushrooms",
        "5 cloves garlic, minced",
        "1 1/2 teaspoons red pepper flakes",
        "1 (15 ounce) can diced tomatoes",
        "2 fresh tomatoes, diced",
        "salt to taste",
        "2 teaspoons white sugar",
        "1 (16 ounce) box penne pasta",
        "1/4 cup chopped flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Penne and Meatballs All'Arrabbiata",
    "url": "http://allrecipes.com/recipe/216657/penne-and-meatballs-allarrabbiata/"
}
