{
    "directions": [
        "In a small bowl, combine warm milk and water. Stir in  yeast and 1 tablespoon sugar . Let stand until creamy, about 10 minutes.",
        "In a large bowl, combine flour, 2 tablespoons sugar, salt and cinnamon. Cut in the butter until mixture resembles coarse breadcrumbs. Stir in the yeast mixture and egg until the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 10 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.",
        "Deflate the dough and turn it out onto a lightly floured surface. Knead in the fruit. Divide the dough into twelve equal pieces and form into rounds. Place the rounds on two lightly greased baking sheets. Cover the rolls with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 425 degrees F (220 degrees C).",
        "Brush rolls with milk and bake in preheated oven. While rolls bake, dissolve sugar in hot water. After rolls have baked for 20 minutes remove from oven and brush with water/sugar glaze. Return rolls to oven for 1 to 2 minutes to harden. Move to a wire rack to cool."
    ],
    "ingredients": [
        "2 tablespoons active dry yeast",
        "1 tablespoon white sugar",
        "1/4 cup water",
        "1 cup warm milk (110 degrees F/45 degrees C)",
        "4 cups bread flour",
        "2 tablespoons white sugar",
        "1/2 teaspoon salt",
        "2 1/2 teaspoons ground cinnamon",
        "1/4 cup butter, cut into pieces",
        "1 egg, beaten",
        "4 ounces mixed candied fruit, diced",
        "2 tablespoons milk",
        "1 1/4 tablespoons white sugar",
        "1 1/4 tablespoons hot water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Penny Buns",
    "url": "http://allrecipes.com/recipe/18522/penny-buns/"
}
