{
    "directions": [
        "Bring broth and wine to a boil in a medium heavy saucepan over medium-high heat and cook until reduced to 1 cup, 15-18 minutes. DO AHEAD: Can be made 3 days ahead. Cover and chill.",
        "Heat 2 tablespoons oil in a large deep skillet over medium-high heat. Add mushrooms; season with salt and pepper. Sauté until tender, about 5 minutes. Transfer mushrooms to a plate. Add remaining 1 tablespoon oil and pancetta to same skillet. Sauté until pancetta begins to brown, about 10 minutes. Add wine reduction, butter, and herbs; simmer until liquid thickens slightly, about 3 minutes. Stir in mushrooms. Season sauce to taste with salt and pepper.",
        "Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until almost tender but still firm to the bite. Drain pasta, reserving 1/2 cup cooking liquid.",
        "Stir pasta and 1/2 cup cheese into mushroom mixture. Stir over medium-high heat, adding water by tablespoonfuls if dry, until pasta is al dente and sauce thickens and clings to pasta, about 5 minutes. Season with salt and pepper. Transfer to a large bowl. Sprinkle 1/2 cup cheese over."
    ],
    "ingredients": [
        "1 1/2 cups low-salt beef broth",
        "1 cup dry red wine",
        "3 tablespoons olive oil, divided",
        "12 ounces assorted fresh mushrooms (such as oyster, crimini, and stemmed shiitake), cut into large pieces",
        "Kosher salt and freshly ground black pepper",
        "8 ounces thinly sliced pancetta (Italian bacon), coarsely chopped",
        "6 tablespoons (3/4 stick) unsalted butter, cut into 1/2\" cubes",
        "3 tablespoons chopped fresh sage",
        "1 tablespoon chopped fresh rosemary",
        "1 pound penne rigate",
        "1 cup finely grated Parmesan (2 ounces), divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pasta",
        "Pork",
        "Father's Day",
        "Dinner",
        "Ham",
        "Fall",
        "Family Reunion",
        "Sage",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Penne with Pancetta, Sage, and Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/penne-with-pancetta-sage-and-mushrooms-395064"
}
