{
    "directions": [
        "In a bowl whisk together the cornstarch, the soy sauce, the broth, the Scotch, the sugar, and the sesame oil. In a large heavy skillet or a wok heat 1 tablespoon of the vegetable oil over high heat until it just begins to smoke and in it stir-fry the beef, patted dry, in 2 batches, for 30 seconds, or until it is browned but still pink within, transferring it with a slotted spoon as it browns to a bowl. In the skillet heat 1 tablespoon of the remaining vegetable oil over moderately high heat until it is hot but not smoking, in it stir-fry the bell peppers for 2 minutes, or until they are crisp-tender, and transfer them to the bowl with the beef. In the remaining 1 tablespoon vegetable oil stir-fry the garlic and the gingerroot over moderately high heat for 30 seconds, stir the cornstarch mixture, and add it to the skillet. Cook the sauce, stirring, until it is thickened and stir in the beef mixture, the scallions, the red pepper flakes, and salt to taste. In a kettle of boiling salted water boil the penne until it is al dente, drain it well, and in a large bowl toss it with the beef mixture."
    ],
    "ingredients": [
        "2 tablespoons cornstarch",
        "1/4 cup soy sauce",
        "1 1/2 cups beef broth",
        "2 tablespoons Scotch",
        "1 tablespoon sugar",
        "1 teaspoon Asian (toasted) sesame oil",
        "3 tablespoons vegetable oil",
        "1 pound boneless sirloin, cut into 1/4-inch strips",
        "2 red bell peppers, cut into julienne strips",
        "2 large garlic cloves, minced",
        "2 tablespoons minced peeled fresh gingerroot",
        "6 scallions, sliced thin diagonally",
        "1 teaspoon dried hot red pepper flakes",
        "1 pound penne (quill-shaped pasta)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Ginger",
        "Pasta",
        "Appetizer",
        "Stir-Fry",
        "Quick & Easy",
        "Bell Pepper",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Penne with Stir-Fried Beef and Red Bell Pepper",
    "url": "http://www.epicurious.com/recipes/food/views/penne-with-stir-fried-beef-and-red-bell-pepper-11470"
}
