{
    "directions": [
        "Place the potato cubes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 25 minutes. Drain and allow to steam dry for a minute or two.",
        "Melt 1/2 cup of butter in a large skillet over medium heat, and cook and stir the onions and celery until they are reduced and browned, about 30 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease 2 glass baking dishes, each 9x13 inches.",
        "Place another 1/2 cup of butter into the work bowl of a stand mixer, and add the cooked potatoes. Start the mixer on Low setting. While mixer is running, pour in 1 cup of milk, and add 1 tablespoon of seasoned salt and 4 slices of torn bread. Mix those ingredients briefly into the mixture, and pour in 1/2 cup of milk and 4 more bread slices. Mix that addition, and then mix in 2 more bread slices.",
        "After the last 2 bread slices have been roughly incorporated, place another 1/2 cup of butter, 1 tablespoon of seasoned salt, all the onions, celery, and butter from the skillet, and 4 more slices of bread into the mixer bowl. Mix to incorporate, and finally mix in 2 to 4 additional torn bread slices. Allow the mixer to run until the dressing is the desired consistency.",
        "Place half the dressing into each prepared baking dish, and top the dressing with the remaining 1/2 cup of butter, cut into thin slices and scattered over the top. Sprinkle remaining 1 tablespoon of seasoned salt evenly over the top of the dishes. Cover the dishes with aluminum foil.",
        "Bake in the preheated oven until the dressing is browned, about 1 hour."
    ],
    "ingredients": [
        "10 pounds potatoes, peeled and cut into 1-inch cubes",
        "2 cups butter, divided",
        "3 onions, diced",
        "1 bunch celery, diced",
        "1 1/2 cups milk, divided",
        "3 tablespoons seasoned salt, divided",
        "1 (1 1/4 pound) loaf of white bread, torn into pieces, or as desired - divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pennsylvania Dutch Potato Filling",
    "url": "http://allrecipes.com/recipe/218984/pennsylvania-dutch-potato-filling/"
}
