{
    "directions": [
        "Preheat oven to 275°F.",
        "In a heavy casserole just large enough to hold short ribs in one layer spread tomato slices evenly.",
        "In a small bowl stir together garlic paste, oil, chili powder, and cumin and spread evenly on short ribs. Arrange short ribs on tomatoes and roast in middle of oven, covered tightly, 3 1/2 hours, basting once or twice after 1 hour. (Meat will give off juices as it cooks.) Transfer short ribs to a cutting board. Discard bones and gristle and chop meat. Chill meat, covered.",
        "Force tomato mixture through a food mill fitted with fine disk into a bowl. Chill tomato sauce, covered, at least 1 hour or up to 24 hours, and skim fat.",
        "In a 6-quart kettle bring 5 quarts salted water to a boil for pasta.",
        "Transfer tomato sauce to a saucepan and stir in meat, olives, Worcestershire sauce, and salt and pepper to taste. Bring sauce to a simmer and keep warm.",
        "While sauce is heating, add pasta to boiling water and boil until al dente. Drain pasta in a colander and transfer to a large bowl. Pour sauce over pasta and stir together. Add parsley and Parmesan and toss to combine."
    ],
    "ingredients": [
        "3 pounds beef short ribs (sometimes called Flanken )",
        "1 1/2 pounds plum tomatoes, cut into 1/4-inch slices",
        "1 1/2 tablespoons minced garlic, mashed to a paste with 1/2 teaspoon salt",
        "1 tablespoon vegetable oil",
        "1 1/2 teaspoons chili powder",
        "3/4 teaspoon ground cumin",
        "1 pound penne or other tubular pasta",
        "10 Kalamata or green Spanish olives, pitted if necessary and chopped fine",
        "2 tablespoons Worcestershire sauce",
        "1/4 cup fresh parsley leaves, washed well, spun dry, and minced",
        "2 tablespoons freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Olive",
        "Pasta",
        "Tomato",
        "Roast",
        "Winter",
        "Gourmet"
    ],
    "title": "Penne with Ragoût of Chili-Rubbed Short Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/penne-with-ragout-of-chili-rubbed-short-ribs-11386"
}
