{
    "directions": [
        "Make the sauce",
        "In a large, deep fry pan or Dutch oven over medium-low heat, warm the olive oil. Add the onion, garlic, carrot, celery and rosemary and sauté until the vegetables are softened, about 8 minutes. Add 1 to 2 Tbs. water if needed to keep the pan from drying out and the vegetables from browning.",
        "Add the ground beef and cook, breaking it up with a wooden spoon, until it is browned, about 10 minutes. Add the wine and tomato paste. Cook, stirring occasionally, until most of the alcohol has evaporated, about 4 minutes.",
        "Reduce the heat to low and add the tomatoes, the 1 tsp. salt and the 1/2 tsp. pepper. Cover partially and cook, stirring occasionally, until the sauce is thick and aromatic, about 1 hour.",
        "Cook the pasta",
        "Meanwhile, bring a large pot of water to a boil over high heat. Add the 2 Tbs. salt and the pasta. Cook, stirring occasionally to prevent sticking, until al dente, according to the package instructions. Drain the pasta and add to the sauce, stirring to combine. Warm briefly over low heat to blend the flavors. Season with salt and pepper and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Pasta",
        ", by Julia della Croce (Oxmoor House, 2006)."
    ],
    "ingredients": [
        "6 Tbs. olive oil",
        "1 small yellow onion, finely chopped",
        "3 large garlic cloves, minced",
        "1 carrot, finely chopped",
        "1 celery stalk, finely chopped",
        "1 tsp. minced fresh rosemary",
        "3/4 lb. ground beef",
        "1/2 cup dry red wine",
        "3 Tbs. tomato paste",
        "2 1/2 cups canned whole plum tomatoes,  chopped, with juices",
        "2 Tbs. plus 1 tsp. salt, plus more, to taste",
        "1/2 tsp. freshly ground pepper, plus more,  to taste",
        "1 lb. penne or rigatoni"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Penne with Beef Ragù",
    "url": "http://www.williams-sonoma.com/recipe/penne-with-beef-ragu.html"
}
