{
    "directions": [
        "Heat extra-virgin olive oil in large nonstick skillet over medium heat. Add assorted root vegetables; sprinkle with salt and pepper. Sauté 9 minutes. Using garlic press, squeeze in garlic. Add sliced celery stalks. Sauté vegetables 1 minute longer. Add 1 cup water. Cover and simmer until vegetables are tender, stirring occasionally, 12 to 15 minutes.",
        "Meanwhile, cook pasta in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain, reserving 1 cup cooking liquid.",
        "Add pasta to vegetables in skillet. Add 3/4 cup reserved cooking liquid, finely grated Parmesan cheese, finely grated lemon peel, ground nutmeg, and 4 tablespoons chopped celery leaves. Toss until heated through and sauce coats pasta, adding more cooking liquid if pasta is dry, about 2 minutes. Season pasta to taste with salt and pepper. Transfer pasta to bowls; sprinkle with remaining 2 tablespoons chopped celery leaves."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil",
        "5 cups 2 x 1/2 x 1/2-inch sticks peeled assorted root vegetables (such as parsnips, carrots, celery root, and golden beets)",
        "2 large garlic cloves, peeled",
        "2 celery stalks, cut crosswise into 1/2-inch-wide pieces, plus 6 tablespoons chopped celery leaves, divided",
        "8 ounces penne rigate or whole grain penne",
        "3/4 cup finely grated Parmesan cheese",
        "1 tablespoon finely grated lemon peel",
        "1/4 teaspoon (scant) ground nutmeg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Sauté",
        "Low Fat",
        "Vegetarian",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Parmesan",
        "Lemon",
        "Root Vegetable",
        "Beet",
        "Carrot",
        "Parsnip",
        "Fall",
        "Healthy",
        "Simmer",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Penne with Lemon and Root Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/penne-with-lemon-and-root-vegetables-356350"
}
