{
    "directions": [
        "Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then add sausage meat and cook, stirring to break up large chunks, until meat is browned and just cooked through, 5 to 7 minutes. Transfer meat to a bowl using a slotted spoon and add bell pepper and garlic to fat in skillet. Reduce heat to moderate and cook, stirring occasionally, until pepper is just tender and garlic is golden, 5 to 6 minutes.",
        "Add wine and sausage and simmer, scraping up brown bits on bottom of skillet with a wooden spoon, until liquid is reduced by half, about 2 minutes.",
        "Add tomatoes with their juice and black pepper and simmer, breaking up tomatoes with spoon, until sauce is slightly thickened, 6 to 8 minutes.",
        "While sauce is cooking, cook pasta in a 6- to 8-quart pot of boiling salted water until al dente. Reserve 1/2 cup pasta-cooking water, then drain pasta in a colander and return to pot. Add sauce and cheese to pasta and toss to coat. Add cooking water if necessary to moisten. Season pasta with salt and pepper and serve with additional cheese."
    ],
    "ingredients": [
        "2 tablespoons extra-virgin olive oil",
        "1 lb sweet Italian sausage, casings removed, then discarded",
        "1 red bell pepper, cut into 1/2-inch pieces",
        "3 garlic cloves, thinly sliced lengthwise",
        "1/2 cup dry white wine",
        "1 (28- to 32-oz) can whole tomatoes in juice",
        "1/4 teaspoon black pepper",
        "1 lb penne",
        "1 oz finely grated Parmigiano-Reggiano (1/2 cup) plus additional for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Garlic",
        "Pasta",
        "Pepper",
        "Pork",
        "Tomato",
        "Quick & Easy",
        "Gourmet"
    ],
    "title": "Penne with Sausage and Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/penne-with-sausage-and-tomato-sauce-236013"
}
