{
    "directions": [
        "Simmer the tomato sauce and vodka in a heavy large skillet over low heat until the mixture reduces by 1/4, stirring often, about 20 minutes. Stir the cream into the tomato and vodka sauce. Simmer over low heat until the sauce is heated through. Stir in the Parmesan cheese until melted and well blended.",
        "Meanwhile, cook the pasta in a large pot of boiling salted water until al dente, tender but still firm to the bite, stirring occasionally, about 8 minutes. Drain the pasta and transfer it to the pan with the sauce, and toss to coat.",
        "Simple Tomato Sauce:",
        "1/2 cup extra-virgin olive oil",
        "1 small onion, chopped",
        "2 cloves garlic, chopped",
        "1 stalk celery, chopped",
        "1 carrot, chopped",
        "2 (32-ounce) cans crushed tomatoes",
        "4 to 6 basil leaves",
        "2 dried bay leaves",
        "Sea salt and freshly ground black pepper",
        "4 tablespoons unsalted butter, optional",
        "In a large casserole pot, heat oil over medium-high heat. Add onion and garlic and saute until soft and translucent, about 2 minutes. Add celery and carrot and season with salt and pepper. Saute until all the vegetables are soft, about 5 minutes. Add tomatoes, basil, and bay leaves and reduce the heat to low. Cover the pot and simmer for 1 hour or until thick. Remove bay leaves and taste for seasoning. If sauce tastes too acidic, add unsalted butter, 1 tablespoon at a time, to round out the flavor.",
        "Pour half the tomato sauce into the bowl of a food processor. Process until smooth. Continue with remaining tomato sauce.",
        "If not using all the sauce, allow it to cool completely and then pour 1 to 2 cup portions into plastic freezer bags. Freeze for up to 6 months.",
        "Yield: 6 cups",
        "Prep Time: 15 minutes",
        "Cook Time: 1 hour, 10 minutes"
    ],
    "ingredients": [
        "1 quart Simple Tomato Sauce, recipe follows, or store-bought marinara sauce, blended until smooth",
        "1 cup vodka",
        "1/2 cup heavy cream, at room temperature",
        "1/2 cup grated Parmesan",
        "1 pound penne"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pasta Recipes",
        "Tomato",
        "Vegetable",
        "Celery",
        "Meat",
        "Cheese",
        "Parmesan Cheese Recipes",
        "Dairy Recipes",
        "Carrot Recipes",
        "Main Dish Recipes"
    ],
    "title": "Penne with Vodka Sauce",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/penne-with-vodka-sauce-recipe2"
}
