{
    "directions": [
        "Combine water, pork loin, onion, salt, and garlic in a large pot. Bring to a boil; reduce heat and simmer until an instant-read thermometer inserted into the pork reads at least 145 degrees F (63 degrees C), about 30 minutes.",
        "Transfer pork to a bowl. Strain broth into another bowl and reserve. Discard onion and garlic; keep the strainer handy.",
        "Toast pasilla chile peppers in a hot skillet until fragrant, about 1 minute. Tear into small pieces and place in a bowl; cover with 1 cup pork broth and let soak, about 30 minutes.",
        "Combine tomatoes and onion in the same skillet; cook and stir until lightly charred, about 5 minutes. Transfer to a bowl. Toast sesame seeds, squash seeds, and cinnamon stick in the skillet until browned, 1 to 2 minutes. Add to the bowl. Tear bread roll into pieces and toast it with the baguette in the skillet until browned, about 2 minutes. Add to the bowl.",
        "Working in small batches, blend the soaked chile peppers, the tomato and onion mixture, the squash seeds, sesame seeds, cinnamon stick, allspice, peppercorns, and the toasted breads with about half of the pork broth until smooth.",
        "Strain each batch of sauce through the sieve into a bowl; repeat until all sauce ingredients are pureed.",
        "Heat olive oil in a large pot over medium heat. Pour in sauce; cook and stir until heated through, about 3 minutes. Season with brown sugar and salt. Stir in pork, remaining broth, almonds, and prunes. Cook until flavors combine, about 10 minutes."
    ],
    "ingredients": [
        "3 cups water",
        "1 pound boneless pork loin, cut into 1-inch cubes",
        "1 onion, quartered",
        "1 teaspoon salt",
        "1 clove garlic",
        "Pepian Sauce:",
        "2 dried pasilla chile peppers, stemmed and seeded",
        "6 tomatoes",
        "1 onion",
        "1 tablespoon sesame seeds",
        "1 tablespoon squash seeds",
        "1/2 cinnamon stick",
        "1 sweet Latin-style bread roll",
        "1 (3-inch) slice French baguette",
        "3 whole black peppercorns",
        "2 whole allspice berries",
        "3 tablespoons olive oil",
        "3 tablespoons brown sugar",
        "1/2 teaspoon salt",
        "1 tablespoon chopped almonds",
        "2 pitted prunes, chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pepian Dulce (Pork in Sweet Guatemalan Sauce)",
    "url": "http://allrecipes.com/recipe/255833/pepian-dulce-pork-in-sweet-guatemala/"
}
