{
    "directions": [
        "In a saucepan bring salted water to a boil for leeks.",
        "Trim and coarsely chop leeks. Wash leeks and drain in a colander. In saucepan of salted boiling water cook leeks until tender, about 4 minutes, and transfer with a slotted spoon to a blender, reserving cooking liquid.",
        "Trim beet stems to 1 inch if necessary and scrub beets. In a saucepan cover beets with salted water by 1 inch and simmer, covered, 35 to 45 minutes, or until tender. Reserve 1 1/2 cups cooking liquid. Drain beets in colander and cool just until they can be handled. Slip off beet skins and cut each beet into quarters.",
        "Add beets and reserved beet cooking liquid to leeks and purée with salt and pepper to taste. In cleaned pan heat purée, lemon juice, and vinegar over low heat, stirring and adding water if necessary to reach desired consistency, until hot. Keep sauce warm, covered.",
        "Preheat oven to 450° F. and lightly coat a non-stick skillet and a shallow baking pan with cooking spray.",
        "Pat pork dry and sprinkle 1 side with pepper and salt to taste. In skillet brown pork, seasoned side down first, over moderately high heat. Transfer pork, seasoned side up, to baking pan and roast in middle of oven 20 minutes, or until a meat thermometer registers 155° F.",
        "While pork is roasting, boil potatoes in reserved leek cooking liquid until tender, about 7 minutes, and drain.",
        "Let pork stand, covered with foil, 10 minutes and cut into 1/4-inch-thick slices.",
        "Quarter potatoes and serve with pork. Drizzle some sauce around pork and serve remainder on side."
    ],
    "ingredients": [
        "4 medium leeks (white and pale green parts only)",
        "4 medium beets (about 1 pound total), trimmed",
        "1 tablespoon fresh lemon juice",
        "2 teaspoons balsamic vinegar, or to taste",
        "vegetable-oil cooking spray",
        "a 1 1/2-pound pork loin",
        "2 teaspoons coarsely ground black pepper",
        "1 pound small boiling potatoes, scrubbed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pork",
        "Potato",
        "Roast",
        "Low Fat",
        "Leek",
        "Beet",
        "Fall",
        "Gourmet"
    ],
    "title": "Peppered Pork Loin with Beet and Leek Purée",
    "url": "http://www.epicurious.com/recipes/food/views/peppered-pork-loin-with-beet-and-leek-puree-14093"
}
