{
    "directions": [
        "1. Prepare a medium-hot fire in a charcoal grill with a cover, or preheat a gas grill to medium-high.",
        "Taste and add the remaining pepper sauce to taste. Continue cooking until the mixture reaches a jam-like consistency, and then remove from the heat and set aside to cool. Stir the basil into the cooled mixture and season to taste with salt. Set aside.",
        "2. To make the jam, combine the tomatoes, sugar, ginger, vinegar, and 1/2 teaspoon of the pepper sauce in a flame-proof nonreactive saucepan. Place the pan on the grill rack and bring the mixture to a slow simmer. Continue simmering, stirring occasionally and moving on and off the heat as necessary, until the mixture is reduced by half, about 30 minutes.",
        "Move the pan to the coolest part of the rack and continue to cook for another 15 minutes.",
        "3. To make the patties, combine the lamb, peppercorn blend, garlic, sesame oil, and Merlot in a large bowl and season with salt. Handling the meat as little as possible to avoid compacting it, mix well. Divide the mixture into 4 equal portions and form the portions into patties to fit the buns.",
        "4. Brush the grill rack with olive oil. Place the patties on the rack, cover, and cook, turning once, until done to preference, about 4 minutes on each side for medium-rare. During the last few minutes of cooking, place the buns, cut side down, on the outer edges of the rack to toast lightly.",
        "5. To assemble the burgers, spread the cut sides of the buns with the tomato jam. On each bun bottom, place a lettuce leaf and a patty. Add the bun tops and serve."
    ],
    "ingredients": [
        "4 cups ripe tomatoes, peeled, cored, and roughly chopped (for best results, use a variety of tomatoes)",
        "1/3 cup sugar",
        "3 tablespoons finely minced fresh ginger",
        "2 tablespoons unseasoned rice vinegar",
        "1 teaspoon hot pepper sauce",
        "3 tablespoons fresh basil, cut into chiffonade",
        "Salt",
        "1 1/3 pounds freshly ground lamb",
        "2 tablespoons five-peppercorn blend, cracked or very coarsely ground",
        "1 garlic clove, finely minced",
        "2 tablespoons sesame oil",
        "1/4 cup Merlot",
        "Salt",
        "Olive oil, for brushing on the grill rack",
        "4 hamburger buns, split",
        "4 red leaf lettuce leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Wine",
        "Lamb",
        "Tomato",
        "Fourth of July",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Basil",
        "Meat",
        "Red Wine",
        "Family Reunion",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Sesame Oil",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peppered Lamb Burgers with \"Hot Tomato\" Jam",
    "url": "http://www.epicurious.com/recipes/food/views/peppered-lamb-burgers-with-hot-tomato-jam-355971"
}
