{
    "directions": [
        "Prepare grill.",
        "Seed and chop tomatoes and cut zucchini into 1/2-inch pieces. Finely chop coriander. In a heavy skillet cook onion in oil over moderately low heat, stirring, until softened. Add tomatoes, zucchini, garlic, corn, and salt and pepper to taste and simmer, covered, stirring occasionally, until zucchini is tender, 25 to 30 minutes.",
        "While corn mixture is simmering, prepare chicken. In a small saucepan melt jelly over moderate heat, stirring, and remove pan from heat. Stir in lemon juice and chili powder and divide jelly mixture between 2 small bowls (to prevent the potential contamination caused by uncooked meat juices). Pat chicken dry and brush with jelly mixture from 1 bowl. Season chicken with salt and grill on an oiled rack set 5 to 6 inches over glowing coals until just cooked through, about 4 minutes on each side. With a clean brush, coat chicken with jelly mixture from other bowl.",
        "Stir cream cheese into corn mixture until melted and stir in coriander and salt and pepper to taste.",
        "Serve corn mixture topped with chicken."
    ],
    "ingredients": [
        "6 plum tomatoes (about 1 pound)",
        "1 pound zucchini",
        "1 cup packed fresh coriander sprigs",
        "1 cup chopped onion",
        "2 teaspoons vegetable oil",
        "2 teaspoons minced garlic",
        "1 1/2 cups fresh corn (from about 3 ears)",
        "2 tablespoons jalapeño pepper jelly",
        "4 teaspoons fresh lemon juice",
        "1/2 teaspoon chili powder",
        "1 1/2 pounds chicken cutlets",
        "2 tablespoons cream cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Tomato",
        "Low Fat",
        "Backyard BBQ",
        "Corn",
        "Zucchini",
        "Grill",
        "Grill/Barbecue",
        "Jalapeño",
        "Cilantro",
        "Jam or Jelly",
        "Simmer",
        "Gourmet"
    ],
    "title": "Pepper Jelly Glazed Chicken with Corn and Zucchini",
    "url": "http://www.epicurious.com/recipes/food/views/pepper-jelly-glazed-chicken-with-corn-and-zucchini-14226"
}
