{
    "directions": [
        "Dissolve 1/2 teaspoon sugar in 1 cup of warm water in a small bowl. Sprinkle yeast over the water and let stand for 5 minutes.",
        "Mix flour, 3/4 cup sugar, and salt in a large bowl. Stir in the yeast mixture, beaten eggs, and melted butter. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.",
        "Lightly oil a large bowl, then place the dough in the bowl and turn to coat with oil. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 1 1/2 hours.",
        "Preheat an oven to 350 degrees F (175 degrees C). Grease a cookie sheet.",
        "Punch down the dough, and divide it into 20 equal pieces about the size of a golf ball. Using your hands, flatten each piece into a small rectangle about 4 inches square. Place 3 slices of pepperoni down the center of each dough square, overlapping the slices. Place another row of 3 slices next to the first. Roll the dough around the pepperoni slices, pinch the edges closed, and place the rolls on the prepared cookie sheet.",
        "Bake the rolls in the preheated oven for 14 to 16 minutes, until the bottoms are lightly browned and the tops are barely golden."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2560&h=1340&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F594122.jpg",
    "ingredients": [
        "1 cup warm water (100 degrees F/40 degrees C)",
        "½ teaspoon white sugar",
        "1 (.25 ounce) package active dry yeast",
        "5 cups all-purpose flour",
        "¾ cup white sugar",
        "2 teaspoons salt",
        "2  eggs, beaten",
        "½ cup butter, melted",
        "1 (8 ounce) package sliced pepperoni"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pepperoni Rolls",
    "url": "http://allrecipes.com/recipe/187812/pepperoni-rolls/"
}