{
    "directions": [
        "Stir crushed chocolate wafer crumbs, 1/4 cup white sugar, and softened butter together in a bowl. Press into an 8-inch pie plate. Refrigerate until set, at least 15 minutes.",
        "Pour water into a bowl and sprinkle gelatin over the top; let sit until gelatin softens, 5 to 10 minutes.",
        "Heat milk in a saucepan over medium heat until bubbling. Beat egg yolks and 1/2 cup white sugar together in a bowl. Pour hot milk into egg yolk mixture in a steady stream, whisking constantly. Return egg mixture to saucepan over medium heat and cook, stirring constantly, until mixture thickens slightly, about 4 minutes. Remove from heat.",
        "Stir gelatin mixture into egg-yolk mixture until gelatin melts and custard is well-combined; cool to room temperature. Stir in peppermint extract and vanilla extract.",
        "Beat egg whites in a glass or metal bowl until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks.",
        "Beat heavy cream in a chilled glass or metal bowl until medium-soft peaks form. Fold egg whites and whipped cream into custard. Pour custard into prepared crust. Sprinkle with crushed peppermint candy and grated chocolate. Chill pie in the refrigerator until set, 8 hours to overnight."
    ],
    "ingredients": [
        "Crust:",
        "1 1/2 cups crushed chocolate wafer cookies",
        "1/4 cup white sugar",
        "1/4 cup butter, softened",
        "Filling:",
        "1/4 cup cold water",
        "1 tablespoon unflavored gelatin",
        "1 cup milk",
        "3 egg yolks, lightly beaten",
        "1/2 cup white sugar",
        "1 teaspoon peppermint extract",
        "1 teaspoon vanilla extract",
        "3 egg whites",
        "1 cup heavy whipping cream",
        "2/3 cup crushed peppermint candy",
        "1/2 (1 ounce) square bittersweet chocolate, grated"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Peppermint Bavarian Cream Pie",
    "url": "http://allrecipes.com/recipe/236777/peppermint-bavarian-cream-pie/"
}
