{
    "directions": [
        "To prepare the glaze: Stir together the cracked peppercorns, thyme leaves, olive oil, and garlic in a small bowl and season with salt.",
        "To prepare the goose: Preheat the oven to 375°F. Season the outside and inner cavity of the goose with salt and pepper. Brush the glaze all over the outside of the goose, reserving any extra to use while roasting. Place the onions, carrots, and celery in a roasting pan and place the goose on top of the vegetables. Roast for 2 to 2 1/2 hours, basting occasionally with the remaining peppercorn mixture and any drippings, until golden brown and crispy and the juice from the cavity runs clear. Remove the goose from the oven and let rest for 15 minutes before carving.",
        "To prepare the sauce: Strain the pan drippings through a fine-mesh sieve. Skim off the grease, leaving the meat juices, and place in a small saucepan. Whisk the butter into the meat juices, add the chopped thyme, and season with salt and pepper.",
        "Carve the goose and serve with the pan sauce."
    ],
    "ingredients": [
        "3 tablespoons mixed cracked black, white, and green peppercorns",
        "2 tablespoons fresh thyme leaves",
        "1/2 cup extra-virgin olive oil",
        "1 tablespoon chopped garlic",
        "Salt and freshly ground black pepper",
        "1 whole goose (7 to 10 pounds), cleaned",
        "1 large yellow onion, quartered",
        "2 carrots, peeled and chopped",
        "2 stalks celery, chopped",
        "1/4 cup unsalted butter",
        "1 tablespoon chopped fresh thyme"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Goose",
        "Fall",
        "Thyme",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Peppercorn- and Thyme-Roasted Goose",
    "url": "http://www.epicurious.com/recipes/food/views/peppercorn-and-thyme-roasted-goose-104115"
}
