{
    "directions": [
        "Preheat an oven to 425ºF.",
        "Using kitchen string, tie the beef at 1-inch intervals along the length of the roast and season generously with salt. Arrange the peppercorns on a large plate in a thin layer and roll the beef in the peppercorns to coat evenly.",
        "In a large ovenproof fry pan over high heat, warm 2 Tbs. of the olive oil until nearly smoking. Carefully place the beef in the pan and brown 3 to 4 minutes per side. Transfer the pan to the oven and roast, turning the beef occasionally, until an instant-read thermometer inserted into the center of the meat registers 125ºF for very rare to rare, about 20 minutes; 130ºF for medium-rare, about 25 minutes; or until done to your liking.",
        "Transfer the beef to a platter and let cool to room temperature. Wrap the beef tightly with plastic wrap and refrigerate until chilled, at least 4 hours or up to 2 days.",
        "Meanwhile, reduce the oven temperature to 325ºF.",
        "Arrange the baguette slices on a baking sheet, brush lightly with olive oil, and season with salt and pepper. Bake until golden and crisp, 15 to 20 minutes. Let the crostini cool to room temperature, then store in an airtight container until ready to serve. (They will stay fresh for 5 to 7 days.)",
        "In a sauté pan over medium-high heat, warm the remaining 2 Tbs. olive oil. Add the red and yellow onions and sauté, stirring occasionally, until tender and golden, 7 to 10 minutes. Add the garlic and sauté, stirring occasionally, until fragrant, 1 to 2 minutes more. Add the vinegar and cook, stirring often, until the liquid is nearly evaporated, 3 to 5 minutes more. Season with salt, remove from the heat and let cool to room temperature. Cover and refrigerate until ready to serve.",
        "To serve, slice the beef crosswise into very thin slices (about 1/8 inch thick). Arrange the crostini on a serving tray, and top each with a slice of beef and 1 to 2 tsp. of the caramelized onions. Garnish each with a pinch of tarragon. Makes 50 to 60 pieces;"
    ],
    "ingredients": [
        "1 center-cut piece of beef tenderloin, about  &nbsp 3 lb., well trimmed",
        "Salt, to taste",
        "2 Tbs. coarsely cracked peppercorns",
        "4 Tbs. olive oil, plus more for brushing",
        "1 baguette, cut into 1/4-inch-thick slices",
        "Freshly ground pepper, to taste",
        "1 red onion, diced",
        "1 yellow onion, diced",
        "1 garlic clove, minced",
        "1/4 cup balsamic vinegar",
        "Chopped fresh tarragon for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Peppered Beef Tenderloin Crostini with Caramelized Onions",
    "url": "http://www.williams-sonoma.com/recipe/peppered-beef-tenderloin-crostini-with-caramelized-onions.html"
}
