{
    "directions": [
        "Combine the garlic, hot red pepper flakes, peppercorns, rosemary, and olive oil in a Zip-loc bag. Add the beef, coating it with the marinade. Squeeze all the air out of the bag so the beef is enveloped by the marinade, and refrigerate for at least 6 hours, or overnight.",
        "Preheat the grill or broiler for 15 to 20 minutes. Sprinkle the steak with the salt and grill or broil to rare or medium rare, depending on your preference.",
        "The cooking time will depend on the thickness and temperature of the beef, so push at the steak with your finger, and if it still feels totally raw in the middle, give it a little longer.",
        "This is one of the things that cooks just need to intuit and learn to read the silent signs. Better under than overcooked, so check often, and if your finger defeats you, cut the steak with a knife and have a look. Let the steak rest for at least an hour, to get the juices back into the meat, then cut into short, very thin slices. (The best knife for slicing is a bread knife with wavy rather than pointed teeth, which cuts through beef amazingly well.) Serve on Grilled Garlic Crostini.",
        "Arrange a few shaved slices of beef on each piece of bread, top with a pungent dot of Horseradish Cream, scatter with minced Italian parsley, and dust on a little kosher salt."
    ],
    "ingredients": [
        "3 cloves garlic, crushed",
        "1/2 teaspoon hot red pepper flakes",
        "1 tablespoon whole black peppercorns, cracked (I fold them in a paper towel and bash them with a hammer)",
        "1 tablespoon minced fresh rosemary leaves",
        "1/3 cup olive oil",
        "2 pounds London broil (top sirloin), cut 1 1/2 inches thick",
        "2 teaspoons kosher salt",
        "Grilled Garlic Crostini",
        "Horseradish Cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Broil",
        "Marinate",
        "Cocktail Party",
        "Quick & Easy",
        "Fall",
        "Spring",
        "Grill/Barbecue"
    ],
    "title": "Pepper-Crusted Steak with Horseradish Cream on Grilled Garlic Crostini",
    "url": "http://www.epicurious.com/recipes/food/views/pepper-crusted-steak-with-horseradish-cream-on-grilled-garlic-crostini-231150"
}
