{
    "directions": [
        "In a large bowl, whisk together the flour, ginger, cinnamon, cloves, baking soda, and salt.",
        "In a small saucepan over moderate heat, warm the corn syrup and orange zest. Add the butter and sugar and continue warming, stirring occasionally, until melted. Remove from the heat and let cool to room temperature. Add the egg and whisk to combine. Pour over the flour mixture and stir to combine. Form the dough into a ball, wrap in a double layer of plastic wrap, and chill overnight.",
        "Arrange racks in the upper and lower thirds of oven and preheat to 375°F. Line 2 large baking sheets with nonstick baking mats, such as Silpats, or parchment paper.",
        "Using a lightly floured rolling pin, roll out a portion of the dough on a lightly floured surface to a 1/4 inch thickness. Using cookie cutters, cut the dough into desired shapes, such as circles, stars, hearts, bells, gingerbread men, and Christmas trees. Transfer to the prepared baking sheets and sprinkle with the pearl sugar. Bake, switching the cookies between the upper and lower racks and rotating the baking sheets about halfway through baking, until the edges are just beginning to brown, 7 to 8 minutes. Watch the cookies carefully to make sure they don't get too brown.",
        "Let the cookies cool on baking sheets for 5 minutes before transferring to a wire rack to let cool completely. Continue rolling and cutting out the rest of the cookie dough and baking the cookies on cooled baking sheets. DO AHEAD: Pepparkakor can be baked ahead and kept, stored between sheets of wax paper in an airtight container, for up to 2 weeks, or frozen up to 1 month."
    ],
    "ingredients": [
        "3 1/2 cups all-purpose flour",
        "2 teaspoons ground ginger",
        "2 teaspoons ground cinnamon",
        "2 teaspoons ground cloves",
        "1 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 cup dark corn syrup",
        "1 teaspoon freshly grated orange zest",
        "1 cup (2 sticks) unsalted butter, cut into pieces",
        "1 cup sugar",
        "1 large egg, lightly beaten",
        "Pearl sugar (for dusting)",
        "2 large baking sheets; 2 nonstick baking mats, such as Silpats, or parchment paper; rolling pin; cookie cutters; wax paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "Winter",
        "Christmas Eve",
        "Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pepparkakor (Swedish Ginger Cookies)",
    "url": "http://www.epicurious.com/recipes/food/views/pepparkakor-swedish-ginger-cookies-51212230"
}
