{
    "directions": [
        "Position rack in center of oven and preheat to 425°F. Using 8-inch round cake pan bottom as guide, draw 8-inch circle on piece of parchment paper; turn paper over and place on baking sheet. Bring first 5 ingredients to boil in heavy medium saucepan over medium-high heat. Add flour all at once; mix in with wooden spoon. Reduce heat to medium-low.",
        "Stir constantly and vigorously until dough comes together in smooth mass. Continue cooking until dough pulls away from sides of pan, stirring constantly, about 2 minutes. Transfer hot dough to heavy-duty electric mixer fitted with paddle attachment. Add 3 eggs, 1 at a time, and beat until each egg is fully incorporated before adding next. Whisk remaining egg in small bowl to blend; very gradually add enough egg to form thick, shiny, and silky dough.",
        "Spoon warm dough into pastry bag fitted with 3/4-inch-wide plain piping tip. Pipe 1-inch-thick ring of dough along outline of circle on parchment. Pipe second ring of dough inside first ring, just touching first. Pipe third ring of dough on top of circle where first and second rings of dough meet.",
        "Bake dough ring 15 minutes. Reduce oven temperature to 375°F and bake until ring is puffed, brown, and firm, about 20 minutes. Turn off oven; leave ring in oven 5 minutes. Using serrated knife, cut off top of pastry ring in 1 piece. Cool both top and base pieces completely. Using fingers, gently remove any soft dough from inside of base and discard. (Can be made 6 hours ahead; let stand at room temperature.)",
        "Bring 1 1/3 cups heavy cream and 40 mint leaves to boil in medium saucepan. Remove from heat. Cover and let steep 1 hour, then refrigerate until cold, about 3 hours. Strain cream into measuring cup; add enough additional chilled whipping cream to measure 1 1/3 cups.",
        "Using electric mixer, beat crème fraîche and 2 tablespoons sugar in medium bowl until thick. Using electric mixer, beat mint cream and remaining 4 tablespoons sugar in large bowl to firm peaks. Fold crème fraîche mixture into mint mixture. Mix in peppermint extract if stronger mint flavor is desired.",
        "Carefully place base of pastry ring on platter. Spoon mint cream into large pastry bag fitted with large star tip. Pipe large rosettes into hollowed-out base. Pipe second row of rosettes atop first row. Gently place pastry top on mint cream. Refrigerate while making glaze.",
        "Stir chocolate, cream, and corn syrup in small bowl set over simmering water until melted and smooth. Using small icing spatula, spread glaze over top of pastry. Sprinkle nuts over glaze. (Can be made 6 hours ahead. Keep refrigerated.) Garnish with additional mint leaves."
    ],
    "ingredients": [
        "1/2 cup water",
        "1/2 cup whole milk",
        "1/2 cup (1 stick) unsalted butter, cut into 8 pieces",
        "1 tablespoon sugar",
        "1/4 teaspoon salt",
        "1 cup all purpose flour",
        "4 large eggs",
        "1 1/3 cups (or more) heavy whipping cream",
        "40 fresh mint leaves",
        "1/2 cup chilled crème fraîche or sour cream",
        "6 tablespoons sugar, divided",
        "1/4 teaspoon peppermint extract (optional)",
        "2 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1 tablespoon whipping cream",
        "2 teaspoons light corn syrup",
        "3 tablespoons sliced almonds, toasted",
        "Additional fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Dessert",
        "Bake",
        "Christmas",
        "Mint",
        "Almond",
        "Sour Cream",
        "Pastry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Peppermint Cream-Puff Ring with Chocolate Glaze",
    "url": "http://www.epicurious.com/recipes/food/views/peppermint-cream-puff-ring-with-chocolate-glaze-233427"
}
