{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Line 24 muffin cups with paper liners.",
        "Beat white sugar and 1 cup butter together in a bowl using an electric mixer until smooth and creamy; add eggs, 1 at a time, beating well after each addition. Mix peppermint extract, almond extract, and food coloring into creamed butter mixture.",
        "Whisk flour, baking powder, and salt together in a separate bowl. Mix flour mixture, alternating with 3/4 cup milk, into creamed butter mixture, ending with flour mixture, until batter is just combined. Spoon batter into the prepared muffin cups.",
        "Bake in the preheated oven until a toothpick inserted in the middle comes out clean, 15 to 20 minutes.",
        "Melt white chocolate chips in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 3 minutes. Allow melted white chocolate to cool to room temperature.",
        "Mix marshmallow fluff and 1/2 cup butter together in a bowl until smooth. Stir melted white chocolate into marshmallow mixture. Add confectioners sugar, 1 to 2 tablespoons at a time, to marshmallow mixture until fully incorporated; add enough milk to reach desired consistency. Transfer frosting to a piping bag or resealable plastic bag with a corner snipped and pipe frosting onto each cupcake."
    ],
    "ingredients": [
        "Cupcakes:",
        "2 cups white sugar",
        "1 cup butter, softened",
        "2 eggs",
        "1 teaspoon peppermint extract",
        "1/8 teaspoon almond extract",
        "red food coloring (optional)",
        "2 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "3/4 cup milk",
        "Frosting:",
        "1 (6 ounce) package white chocolate chips",
        "1 (7 ounce) jar marshmallow fluff",
        "1/2 cup butter, softened",
        "2 cups confectioners' sugar",
        "1 teaspoon milk, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Peppermint Cupcakes with Marshmallow Fluff White Chocolate Frosting",
    "url": "http://allrecipes.com/recipe/245174/peppermint-cupcakes-with-marshmallow/"
}
