{
    "directions": [
        "Preheat an oven to 400 degrees F (200 degrees C). Mix goat cheese, 1 teaspoon olive oil, toasted black pepper, and 1/2 teaspoon salt in a bowl until smooth. Set aside.",
        "Roll pasta sheets to 1/16-inch thickness. Cut pasta into 2 1/2-inch circles, or desired shape. Place 1 heaping teaspoon of the goat cheese filling in the center of each pasta circle. Dab the edge of the pasta with a little water, then fold and seal the pasta to create a half moon. Arrange ravioli on a baking sheet and drizzle with 1/2 cup olive oil.",
        "Bake ravioli in the preheated oven until golden brown and lightly crisp, 7 to 12 minutes. Remove from oven and set aside.",
        "Heat 1/4 cup olive oil in a skillet over medium heat. Stir in the onion, 1 teaspoon of salt and 1 teaspoon of pepper; cook and stir until the onion has softened and turned translucent, about 5 minutes. Increase heat to medium-high, and stir in the yellow and red tomatoes, pineapple, and herbes de Provence. Cook and stir for 5 minutes, and stir in the tomato sauce. Crush garlic with 1 pinch of salt, and add to the sauce. Simmer for 30 minutes, stirring occasionally. Remove from heat and stir in basil and arugula. Toss the ravioli lightly in the sauce to coat, and serve immediately."
    ],
    "ingredients": [
        "1 (10 ounce) package goat cheese",
        "1 teaspoon extra-virgin olive oil",
        "1/3 cup fresh, coarsely ground black pepper, or to taste, lightly toasted",
        "1/2 teaspoon salt",
        "1 pound fresh pasta sheets",
        "1/2 cup extra virgin olive oil",
        "1/4 cup extra-virgin olive oil",
        "1/2 large onion, finely diced",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1 large yellow heirloom tomato, peeled and chopped",
        "1 large red heirloom tomato, peeled and chopped",
        "3/4 cup fresh pineapple, chopped",
        "4 1/2 teaspoons herbes de Provence",
        "1 1/2 cups tomato sauce",
        "1 clove garlic",
        "1 pinch salt",
        "5 leaves basil, chopped",
        "1 cup coarsely chopped baby arugula"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Peppery Goat Cheese Ravioli with Pineapple Tomato Sauce",
    "url": "http://allrecipes.com/recipe/213547/peppery-goat-cheese-ravioli-with-pine/"
}
