{
    "directions": [
        "Place garlic and 1 pinch kosher salt into a mortar and pestle; grind garlic until it forms a paste. Mix olive oil into garlic.",
        "Place roast into a baking dish. Brush garlic paste on one side of the roast. Season generously with 1 teaspoon kosher salt.",
        "Combine peppercorns in a small bowl. Press ground peppercorn mixture generously onto roast. Flip meat and repeat, brushing with garlic paste and seasoning with 1 teaspoon kosher salt and peppercorn mixture.",
        "If desired, place roast on a rack over baking dish and refrigerate uncovered overnight to dry out. The next day, remove and let meat stand 1 hour to reach room temperature.",
        "Melt butter in a large ovenproof skillet; turn off heat. Place roast into hot butter and flip to coat both sides. Season with more salt if desired.",
        "Preheat oven to 450 degrees F (230 degrees C).",
        "Roast meat in skillet in the preheated oven for 15 minutes. Remove meat from oven and flip in skillet.",
        "Turn oven down to 200 degrees F (95 degrees C).  Roast meat until pepper crust is lightly browned and an instant-read meat thermometer, inserted into the center of the roast, reads 130 degrees F (54 degrees C), about 15 more minutes.",
        "Transfer roast to a platter and tent loosely with aluminum foil. Let roast stand at least 15 minutes.",
        "Place skillet with pan drippings over medium heat; whisk in flour until smooth. Cook, whisking constantly, for 2 minutes to remove raw taste from flour. Whisk in veal stock.",
        "Turn heat to medium-high, bring sauce to a boil, and reduce heat to medium-low. Simmer pan sauce, stirring constantly, until reduced by half and sauce has slightly thickened, about 10 minutes. Season with salt and 1 pinch of cayenne pepper. Stir balsamic vinegar and any accumulated juices from meat platter into pan sauce.",
        "Carve beef across the grain, starting at the smallest corner of the roast. Serve slices on warmed plates drizzled with pan sauce."
    ],
    "ingredients": [
        "3 cloves garlic, coarsely chopped",
        "kosher salt to taste",
        "1 tablespoon olive oil",
        "1 (3 pound) beef tri-tip roast at room temperature, trimmed",
        "2 teaspoons kosher salt, or to taste, divided",
        "1 tablespoon whole black peppercorns, coarsely ground",
        "1 tablespoon whole white peppercorns, coarsely ground",
        "1 tablespoon whole green peppercorns, coarsely ground",
        "1 tablespoon whole pink peppercorns, coarsely ground",
        "1 tablespoon butter",
        "Pan sauce:",
        "1 1/3 tablespoons all-purpose flour",
        "3 cups rich veal stock",
        "1 pinch salt, or to taste",
        "1 pinch cayenne pepper, or to taste",
        "1 tablespoon balsamic vinegar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Peppercorn Roast Beef",
    "url": "http://allrecipes.com/recipe/235901/peppercorn-roast-beef/"
}
