{
    "directions": [
        "Line 8-inch square pan with plastic. Whip 3/4 cup cream to soft peaks in medium bowl. Mix ice cream, hazelnuts, liqueur, chocolate and orange peel in large bowl just until blended. Gently fold in whipped cream. Transfer mixture to prepared pan; smooth top. Cover and freeze until firm, at least 4 hours. (Can be prepared 4 days ahead. Keep frozen.)",
        "Bring cream, liqueur and salt to boil in heavy small saucepan. Remove from heat and add chocolate. Let stand 3 minutes. Whisk until chocolate is melted and sauce is smooth. Whisk in corn syrup. (Can be prepared 3 days ahead. Cover and refrigerate.)",
        "Stir first 4 ingredients in heavy medium saucepan over medium heat until sugar dissolves. Bring to boil. Reduce heat, add pears and simmer until pears are just tender, about 20 minutes. Remove pears from poaching liquid. Cool pears and syrup separately. Return pears to syrup and refrigerate until cold. (Can be prepared 8 hours ahead.)",
        "Stir chocolate sauce over low heat until warm. Cut semifreddo into 4 squares. Place 1 semifreddo piece in each of 4 bowls. Remove pears from syrup with slotted spoon. Place pears atop semifreddo. Spoon chocolate sauce over pears to coat, letting extra sauce drizzle onto semifreddo and plate. Sprinkle with nuts. Garnish with orange slices and serve."
    ],
    "ingredients": [
        "3/4 cup chilled whipping cream",
        "1 pint vanilla ice cream, slightly softened",
        "1/2 cup chopped husked toasted hazelnuts",
        "3 tablespoons Frangelico or other nut liqueur",
        "1 ounce bittersweet (not unsweetened) or semisweet chocolate, finely grated",
        "1/2 teaspoon grated orange peel",
        "1/4 cup whipping cream",
        "1/4 cup Frangelico liqueur",
        "Pinch of salt",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/4 cup light corn syrup",
        "6 cups water",
        "1 1/2 cups sugar",
        "8 1x3-inch orange peel strips",
        "2 teaspoons vanilla extract",
        "4 small firm ripe Anjou, Bartlett or Comice pears, peeled",
        "1/4 cup chopped husked toasted hazelnuts",
        "4 orange slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Nut",
        "Dessert",
        "Freeze/Chill",
        "Pear",
        "Frangelico",
        "Winter"
    ],
    "title": "Pera Bella Helena",
    "url": "http://www.epicurious.com/recipes/food/views/pera-bella-helena-567"
}
