{
    "directions": [
        "Preheat oven to 375°F. Line large rimmed baking sheet with parchment paper. Place tomato halves, 2 tablespoons oil, and 1 1/2 tablespoons oregano in large bowl. Sprinkle with salt; toss. Arrange tomato halves, cut side down, on baking sheet (drizzle any remaining mixture from bowl over tomatoes). Place unpeeled garlic cloves on prepared baking sheet with tomatoes. Bake until garlic is tender, about 30 minutes. Transfer garlic to work surface. Turn tomatoes over, cut side up. Roast until tomatoes begin to brown in spots but are still soft, about 30 minutes longer. Cool tomatoes on baking sheet.",
        "Meanwhile, spread almonds on small baking sheet and toast in oven alongside tomatoes until golden brown, about 10 minutes. Cool.",
        "Peel garlic. Place in processor along with 2/3 of roasted tomatoes, 4 tablespoons toasted almonds, and crushed red pepper. Pulse to coarse puree. With machine running, gradually add 5 tablespoons oil. Transfer pesto to bowl; season with salt and pepper. DO AHEAD: Pesto can be made 1 day ahead. Cover and chill. Place remaining roasted tomatoes in small bowl; cover and chill. Store remaining 1 tablespoon almonds airtight at room temperature.",
        "Chop remaining 1/3 of roasted tomatoes. Coarsely chop remaining 1 tablespoon almonds. Cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain, reserving 1 1/2 cups pasta cooking liquid. Place pesto in large bowl. Stir in 1/2 cup pasta cooking liquid. Add pasta and chopped tomatoes; toss to coat, adding more pasta cooking liquid by 1/4 cupfuls as needed to moisten. Season to taste with salt and pepper. Sprinkle chopped nuts and remaining 1 tablespoon oregano over. Serve, passing cheese alongside."
    ],
    "ingredients": [
        "2 3/4 pounds plum tomatoes, cored, halved, seeded",
        "7 tablespoons extra-virgin olive oil, divided",
        "2 1/2 tablespoons chopped fresh oregano, divided",
        "2 unpeeled large garlic cloves",
        "5 tablespoons whole raw almonds, divided",
        "1/2 teaspoon dried crushed red pepper",
        "1 pound perciatelli, spaghetti, or linguine",
        "Finely grated Parmesan cheese",
        "Ingredient info: Perciatelli are long hollow strands of pasta. Spaghetti and linguine make fine substitutes."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Roast",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Almond",
        "Summer",
        "Family Reunion",
        "Low Cholesterol",
        "Potluck",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Perciatelli with Roasted Tomato and Almond Pesto",
    "url": "http://www.epicurious.com/recipes/food/views/perciatelli-with-roasted-tomato-and-almond-pesto-360609"
}
