{
    "directions": [
        "Place mushrooms in small bowl. Pour 2 cups hot water over; soak 30 minutes to soften. Remove mushrooms from water; squeeze liquid from mushrooms back into bowl. Chop mushrooms; reserve liquid.",
        "Heat olive oil in heavy large Dutch oven over medium-high heat. Add onions and garlic; sauté until tender, about 8 minutes. Add rosemary and crushed red pepper; stir 30 seconds. Add tomatoes and 1 cup chopped porcini. Pour in mushroom liquid, leaving sediment in bowl. Bring to boil. Reduce heat; simmer 20 minutes.",
        "Place bread in medium bowl. Pour milk over. Let stand until bread is very soft, about 15 minutes. Squeeze milk from bread; place bread in large bowl. Add veal, sausage, 3/4 cup cheese, egg, rosemary, salt, pepper and remaining porcini mushrooms. Using hands, blend veal mixture thoroughly.",
        "Pour oil into heavy large skillet to depth of 1/4 inch; heat over medium-high heat. Working in batches, form veal mixture into 1 1/2-inch balls; add to skillet. Cook until brown, about 4 minutes. Using slotted spoon, transfer meatballs to paper towels; drain.",
        "Add meatballs to tomato sauce. Simmer until sauce thickens and meatballs are just cooked through, about 10 minutes. Season to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate. Before using, bring to simmer, stirring frequently.)",
        "Cook pasta in pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain. Transfer to platter. Spoon sauce and meatballs over. Serve, passing additional cheese separately."
    ],
    "ingredients": [
        "2 ounces dried porcini mushrooms",
        "2 cups hot water",
        "3 tablespoons olive oil",
        "1 1/2 large onions, chopped",
        "3 garlic cloves, chopped",
        "1 tablespoon chopped fresh rosemary",
        "1/4 teaspoon dried crushed red pepper",
        "1 1/2 28-ounce cans crushed tomatoes with added puree (about 4 1/2 cups)",
        "4 slices English muffin toasting bread or white sandwich bread with crust, torn into pieces",
        "2 cups milk",
        "3/4 pound ground veal",
        "3/4 pound sweet Italian sausages, casings removed",
        "3/4 cup freshly grated Pecorino Romano cheese",
        "3 eggs",
        "1 tablespoon chopped fresh rosemary or 1 teaspoon dried",
        "1 teaspoon salt",
        "1 teaspoon freshly ground pepper",
        "Olive oil (for frying)",
        "1 1/4 pounds perciatelli or spaghetti",
        "Additional freshly grated Pecorino Romano cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Tomato",
        "Veal",
        "Sausage"
    ],
    "title": "Perciatelli with Meatballs and Tomato-Porcini Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/perciatelli-with-meatballs-and-tomato-porcini-sauce-1523"
}
