{
    "directions": [
        "Remove any pin bones from fish fillets (using tweezers makes this easy). Cut each fillet in half lengthwise. Cut each half on a diagonal into 1\" strips. (Work with the natural shape of the fish as you cut; this will help the pieces stay together instead of falling apart when frying.)",
        "Whisk all-purpose flour, rice flour, and salt in a medium bowl. Gradually whisk in club soda until no lumps remain; adjust with more club soda or rice flour as needed to make it the consistency of thin pancake batter—it should be pourable, but thick enough to coat the fish.",
        "Fit a large pot with a deep-fry thermometer and pour in oil to measure 2\". Heat over medium-high heat until thermometer registers 350°.",
        "Working in batches of 5–7 pieces at a time, coat fish in batter, letting excess drip off, then carefully place in oil (to avoid splattering, lower fish into oil pointing away from you). Don’t overcrowd the pot: The oil temperature will drop dramatically and fish may stick together.",
        "Fry fish, turning occasionally with a fish spatula or slotted spoon and maintaining oil temperature at 350°, until crust is puffed, crisp, and golden brown, about 5 minutes.",
        "Transfer to a wire rack set inside a rimmed baking sheet; season immediately with salt.",
        "While fish is frying, use tongs to heat tortillas one at a time directly over a gas burner, moving them often, until lightly charred and puffed in spots, about 1 minute per side.",
        "Transfer to a plate; cover with a clean kitchen towel to keep warm. (If you don’t have a gas stove, wrap up a stack of tortillas in a sheet of foil and heat in a 350° oven until warmed through.)",
        "Top tortillas (we like two per taco) with fish, slaw, hot sauce, avocado, cilantro, and pickled jalapeños. Serve with lime wedges."
    ],
    "ingredients": [
        "2 pounds skinless red snapper or other mild white fish fillets",
        "1 cup all-purpose flour",
        "1 cup white rice flour",
        "2 teaspoons kosher salt",
        "2 cups club soda",
        "Vegetable oil (for frying; about 8 cups)",
        "16–32 small corn tortillas",
        "Cabbage and Jicama Slaw",
        "Fresno Chile Hot Sauce , for serving;",
        "Sliced avocado, cilantro leaves with tender stems, Sliced pickled jalapeños, and lime wedges for serving",
        "A deep-fry thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Fry",
        "Lime",
        "Summer",
        "Cabbage",
        "Cilantro",
        "Tortillas"
    ],
    "title": "Perfect Fish Tacos",
    "url": "http://www.epicurious.com/recipes/food/views/perfect-fish-tacos-51241860"
}
