{
    "directions": [
        "Adjust oven rack to middle position and heat oven to 375 degrees.",
        "Heat butter and sugar in a saucepan until butter melts. Meanwhile, line the bottom of a 9-by-13-inch baking pan with a 12-by-20-inch sheet of foil so it hangs over the long sides of the pan (you'll use this as a 'handle' to pull the cooked dessert from the pan). Arrange graham crackers over foil-lined pan bottom, cutting the final few with a knife so they'll fit snugly. Pour butter mixture over crackers; spread with knife to cover. Bake until butter-sugar mixture starts to harden, about 7 minutes. Remove from oven. Reduce temperature to 300 degrees.",
        "As crust bakes, heat pumpkin, 1 1/4 cups brown sugar and spices in a medium pan over medium-high heat until mixture is sputtery hot. Process eggs on high speed in a blender. Transfer pumpkin to a pourable container. With blender running, slowly add pumpkin mixture; puree until smooth. Add cream cheese, one block at a time; puree until smooth. Pour mixture over crust; bake until set, about 35 minutes.",
        "Meanwhile, mix sour cream, remaining 1/2 cup brown sugar and vanilla. Remove cheesecake from oven. Pour sour cream mixture evenly over top; carefully spread so top is completely covered. Return to oven. Bake to set topping, about 5 minutes longer. Cool to room temperature, then refrigerate (can be made up to 2 days ahead).",
        "To serve, run a knife around the pan perimeter to loosen cake. Use foil handles to pull cake from pan. Cut into squares (up to 15) and garnish with optional pecans."
    ],
    "ingredients": [
        "6 tablespoons butter",
        "1/4 cup sugar",
        "8 whole graham crackers",
        "1 (15 ounce) can 100% pure pumpkin puree",
        "1 3/4 cups dark brown sugar",
        "1 teaspoon ground ginger",
        "1/2 teaspoon cinnamon",
        "1/8 teaspoon ground nutmeg",
        "1/8 teaspoon ground allspice",
        "4 large eggs",
        "1 1/2 pounds cream cheese, at room temperature",
        "1 (16 ounce) container sour cream",
        "1 teaspoon vanilla extract",
        "Optional garnish: Toasted or candied pecans (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Perfectly Simple Pumpkin Cheesecake",
    "url": "http://allrecipes.com/recipe/76951/perfectly-simple-pumpkin-cheesecake/"
}
