{
    "directions": [
        "Preheat the oven to 425 degrees F.",
        "Remove the chicken giblets. Rinse the chicken inside and out. Remove any excess fat and leftover pinfeathers and pat the outside dry. Place the chicken in a large roasting pan. Liberally salt and pepper the inside of the chicken. Stuff the cavity with the bunch of thyme, both halves of the lemon, and all the garlic. Brush the outside of the chicken with the butter and sprinkle again with salt and pepper. Tie the legs together with kitchen string and tuck the wing tips under the body of the chicken. Scatter the onion slices around the chicken.",
        "Roast the chicken for 1 1/2 hours, or until the juices run clear when you cut between a leg and thigh. Remove to a platter and cover with aluminum foil while you prepare the gravy.",
        "Remove all the fat from the bottom of the pan, reserving 2 tablespoons in a small cup. Add the chicken stock to the pan and cook on high heat for about 5 minutes, until reduced, scraping the bottom of the pan. Combine the 2 tablespoons of chicken fat with the flour and add to the pan. Boil for a few minutes to cook the flour. Strain the gravy into a small saucepan and season it to taste. Keep it warm over a very low flame while you carve the chicken.",
        "Slice the chicken onto a platter and serve immediately with the warm gravy."
    ],
    "ingredients": [
        "1 5- to 6-pound roasting chicken",
        "Kosher salt",
        "Freshly ground black pepper",
        "1 large bunch fresh thyme",
        "1 lemon, halved",
        "1 head garlic, cut in half crosswise",
        "2 tablespoons butter, melted",
        "1 Spanish onion, thickly sliced",
        "1 cup chicken stock",
        "2 tablespoons all-purpose flour"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Roast Recipes",
        "Chicken",
        "Poultry Recipes",
        "Main Dish Recipes",
        "Roasting"
    ],
    "title": "Perfect Roast Chicken",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/perfect-roast-chicken"
}
