{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C). Lightly grease several baking sheets. Whisk the flour, baking soda, baking powder, salt, 2 teaspoons cinnamon, allspice, cloves, nutmeg, and ginger in a bowl; set aside.",
        "Beat together 1 cup white sugar, brown sugar, molasses, butter, canola oil, applesauce, water, egg substitute, and vanilla extract in a large bowl until evenly combined. Stir in the flour mixture to make a soft, thick, not-very-sticky dough. Cover and refrigerate at least 30 minutes. Stir 1 1/2 teaspoons cinnamon together with 1 1/2 teaspoons white sugar in a small bowl; set aside.",
        "Roll the dough on a heavily floured surface to a thickness of 1/4-inch. Cut into shapes using a cookie cutter. Place the cookies onto the prepared baking sheets, and sprinkle with the cinnamon sugar mixture.",
        "Bake in the preheated oven until the edges are golden, and the bottoms are slightly darker than the tops, 9 to 11 minutes. Remove the cookies from the baking sheets immediately, and place on a wire rack to cool. After 10 minutes of cooling, they should be hard, like typical gingerbread cookies, but still slightly bendable, and soft on the inside."
    ],
    "ingredients": [
        "6 cups all-purpose flour, or as needed",
        "1 1/2 teaspoons baking soda",
        "1/2 teaspoon baking powder",
        "1 teaspoon salt",
        "2 teaspoons ground cinnamon",
        "1/2 teaspoon ground allspice",
        "1/2 teaspoon ground cloves",
        "2 pinches ground nutmeg",
        "1 1/2 teaspoons ground ginger",
        "1 cup white sugar",
        "1 cup brown sugar",
        "1 cup molasses",
        "2 tablespoons softened butter",
        "2 tablespoons canola oil",
        "3/4 cup applesauce",
        "1/2 cup water",
        "1/4 cup liquid egg substitute (such as Egg Beaters®)",
        "1 teaspoon vanilla extract",
        "1 1/2 teaspoons ground cinnamon",
        "1 1/2 teaspoons white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Perfect Gingerbread Cookies",
    "url": "http://allrecipes.com/recipe/155915/perfect-gingerbread-cookies/"
}
