{
    "directions": [
        "Preheat oven to 350 degrees F (180 degrees C). Grease and flour two 8-inch round cake pans.",
        "Put the cake mix and the instant pudding in a mixing bowl and stir until completely combined. Crack in the 3 eggs, then add the coconut milk, coconut extract, and butter.",
        "Blend for approximately 3 minutes in a stand mixer, or 5 minutes with hand-held mixer. This will give the pudding time to develop.",
        "Spread the batter evenly in the two prepared cake pans. Bake for about 30 minutes in the preheated oven, or until the cakes are set and just beginning to pull away from the sides of the pans.",
        "Remove from the oven and let the cakes cool completely. Because they are moist the cakes will be heavy. Don't worry.",
        "Whip the frosting ingredients together until completely fluffy. (Add a tablespoon of milk at a time if you need it to whip up fluffier.)",
        "Frost the cooled cake, placing the first cake layer round side down on a plate, then spread frosting across the middle. Put the flat side of the other layer down on frosted center. Frost sides and top of cake.",
        "Toast some coconut until golden brown (not dark brown) in the oven. If you are using the pecans, toast them as well. Toss nuts and coconut together, then sprinkle on top of the cake.",
        "Refrigerate cake if not serving within one or two hours. Bring to room temperature for at least one hour before serving."
    ],
    "ingredients": [
        "Cake",
        "1 (18.25 ounce) package yellow cake mix without pudding",
        "1 (3.5 ounce) package instant coconut cream pudding mix",
        "3 large eggs",
        "1 cup coconut milk (not coconut cream)",
        "1 teaspoon coconut extract",
        "1/2 cup butter, softened",
        "Frosting",
        "1 cup butter, softened",
        "7 cups powdered sugar",
        "1/4 cup milk or cream (use coconut milk if you have some leftover)",
        "1 teaspoon coconut extract",
        "3/4 cup shredded coconut",
        "3 tablespoons chopped pecans (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Perfumed Coconut Cake",
    "url": "http://allrecipes.com/recipe/142016/perfumed-coconut-cake/"
}
