{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Take the giblets out of the turkey and wash the turkey inside and out. Remove any excess fat and leftover pinfeathers and pat the outside dry. Place the turkey in a large roasting pan. Liberally salt and pepper the inside of the turkey cavity. Stuff the cavity with the thyme, lemon, 1 onion, quartered, and the garlic. Brush the outside of the turkey with the butter and sprinkle again with salt and pepper. Tie the legs together with string and tuck the wing tips under the body of the turkey. Peel and slice the remaining onions, toss them with olive oil, and scatter them around the turkey.",
        "Roast the turkey for 1 hour. Toss the carrots, potatoes, and fennel with the olive oil and add to the roasting pan. Return the pan to the oven and continue to roast for about 1 1/2 hours more, or until the juices run clear when you cut between the leg and the thigh. Remove the turkey to a cutting board and cover with foil for 20 minutes. Stir the vegetables and return the pan to the oven. Continue to cook the vegetables while the turkey rests. Slice the turkey and serve on a platter with the roasted vegetables."
    ],
    "ingredients": [
        "1 (12 pound) fresh turkey",
        "Kosher salt",
        "Freshly ground black pepper",
        "1 large bunch fresh thyme",
        "1 lemon, halved",
        "3 Spanish onions",
        "1 head garlic, halved crosswise",
        "4 tablespoons melted butter",
        "1/4 to 1/2 cup good olive oil",
        "8 carrots, peeled and cut in 2-inch chunks",
        "10 red new potatoes, quartered",
        "3 heads fennel, fronds removed, and cut in wedges through the core"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Thanksgiving Turkey",
        "Holiday",
        "Poultry Recipes",
        "Thanksgiving",
        "Turkey Recipes",
        "Roasted Turkey",
        "Roasting",
        "Roasted Vegetable",
        "Vegetable",
        "American",
        "Roast Recipes",
        "Carrot Recipes",
        "Meat",
        "Potato",
        "Main Dish Recipes"
    ],
    "title": "Perfect Roast Turkey",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/perfect-roast-turkey-recipe2"
}
