{
    "directions": [
        "Heat the vegetable oil in a saucepan over medium heat. Add the onion and turkey neck and giblets; cook, stirring, until browned, about 15 minutes. Add the broth, herb sprigs and bay leaf; cover and simmer about 2 hours (do this while the turkey roasts).",
        "Once your turkey is done, transfer it to a cutting board to rest and pour the pan drippings into a large degreasing cup. Strain the broth; save the giblets for chunky gravy, if desired.",
        "Put the roasting pan on the stovetop over low heat. Add a splash of the broth to the pan and scrape up any browned bits with a wooden spoon. Transfer the liquid and bits to the degreasing cup.",
        "The fat will rise to the top of the degreasing cup. Spoon off 1/2 cup fat and transfer to a saucepan. Scatter in the flour; cook over medium heat, stirring in a figure-eight motion with a wooden spoon, until the flour mixture browns slightly, about 4 minutes.",
        "Gradually ladle the hot broth into the flour mixture, whisking constantly (this is key, or your gravy will be lumpy). Bring to a boil, then adjust the heat so the gravy simmers gently.",
        "Add the remaining turkey drippings to the gravy, leaving any extra fat behind in the degreasing cup. Simmer, whisking occasionally, until the gravy thickens, about 10 minutes. Add the Worcestershire sauce and season with salt and pepper.",
        "Photograph by Levi Brown"
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "1 medium onion or leek, thinly sliced",
        "Neck and giblets from your turkey (discard the liver)",
        "8 cups low-sodium turkey or chicken broth",
        "Several sprigs thyme, parsley, rosemary and/or sage",
        "1 bay leaf",
        "Turkey drippings (from the roasting pan)",
        "1/2 cup all-purpose flour",
        "Dash of Worcestershire sauce",
        "Kosher salt and freshly ground pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Thanksgiving Turkey",
        "Holiday",
        "Poultry Recipes",
        "Thanksgiving",
        "Turkey Recipes",
        "Gravy"
    ],
    "title": "Perfect Gravy",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/perfect-gravy-recipe"
}
