{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9 inch round cake pans. Stir together the cocoa and boiling water from the first set of ingredients. Set aside to cool. Sift together the flour, baking soda, salt and baking powder, set aside.",
        "In a large bowl, cream together the butter and sugar. Beat in the eggs, one at a time, then stir in the vanilla. Add the dry ingredients alternately with the cocoa mixture. Mix only until combined. Divide evenly between the three prepared pans, and spread the batter out flat.",
        "Bake for 18 to 22 minutes in the preheated oven, until a toothpick inserted comes out clean, and the cake pulls away from the sides of the pan. Cool cakes on a wire rack.",
        "In a medium bowl, whip the heavy cream and vanilla. When the cream becomes thick, add the confectioners' sugar and continue to whip until stiff but not too grainy. Divide into three parts and spread onto two of the cooled layers. Stack the layers onto a nice plate, putting the two creamed ones on the bottom. Place the plain layer on the top. If there is a hump on the top of the cake, trim it off with a long serrated knife. Frost the sides with the chocolate buttercream frosting.",
        "To make the frosting, beat the remaining ingredients, butter, confectioners' sugar, vanilla and cocoa until light and fluffy, about 7 to 10 minutes. Frost sides of the cake, leaving a ridge that sticks up over the top edge. Spread the remaining cream filling over the top of the cake. Garnish with sprinkles, chocolate curls or seasonal fresh fruit."
    ],
    "ingredients": [
        "1 cup unsweetened cocoa powder",
        "2 cups boiling water",
        "2 3/4 cups all-purpose flour",
        "2 teaspoons baking soda",
        "1/2 teaspoon salt",
        "1/2 teaspoon baking powder",
        "1 cup butter, softened",
        "2 1/2 cups white sugar",
        "4 eggs",
        "1 1/2 teaspoons vanilla extract",
        "1 pint heavy whipping cream",
        "1 teaspoon vanilla extract",
        "1 cup confectioners' sugar",
        "1/3 cup butter",
        "2 cups confectioners' sugar",
        "1 teaspoon vanilla extract",
        "2 tablespoons unsweetened cocoa powder"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Perfect Chocolate Cake",
    "url": "http://allrecipes.com/recipe/15768/perfect-chocolate-cake/"
}
