{
    "directions": [
        "To make crust: Mix flour, sugar and salt in a medium bowl. Rub cream cheese into flour mixture with fingertips to blend thoroughly. Using a box grater, grate frozen butter and shortening into flour mixture. Working quickly, rub fat into flour until it has the texture of coarse sand and small pebbles. Stir in ice-cold water with a fork until dough clumps form; press to form a cohesive ball. Wrap dough in plastic wrap, pressing it into a thick disk. Refrigerate until cold and firm, at least 1 hour. (Can be refrigerated up to 2 days or frozen for a month.)",
        "Roll dough on a lightly floured surface into a 14-inch circle, turning frequently and dusting with flour to keep it from sticking. Fold dough in half; quickly lift it into 9-inch Pyrex (not deep-dish) pie plate and unfold. Fit dough into plate so it is not stretched in any way. Trim with scissors to 1/2-inch beyond pan lip. Roll overhanging dough under with fingertips so it is flush with pan lip, then flute. Refrigerate at least 30 minutes or up to 4 hours. (Do not prick shell with a fork.)",
        "Adjust oven rack to lowest position and heat oven to 400 degrees. Line pie shell with a sheet of heavy-duty foil. Crumple 3 large pieces of foil into balls and place in shell to act as light weights. Bake (lightly pressing on foil if dough starts to balloon) until fluting turns golden brown, 18 to 20 minutes. Remove all foil; bake until bottom starts to turn golden brown, about 5 minutes longer. Remove shell from oven.",
        "To make filling: Adjust oven rack to middle position and reduce temperature to 300 degrees. In a separate pie plate, toast pecans in oven until fragrant, about 10 minutes.",
        "Reduce temperature to 250. Meanwhile, heat brown sugar and corn syrup in a medium heat-proof bowl over a pan of barely simmering water until sugar is almost dissolved. In another medium bowl, whisk eggs, yolks, vanilla and salt. Slowly whisk warm sugar mixture into eggs. Return bowl to pan of simmering water. Whisk in butter. In a small pan over low heat, stir together cornstarch and water until pasty thick; whisk into sugar-egg mixture. Heat in bowl over simmering water, stirring frequently. Set pie shell on middle oven rack. Sprinkle in pecans, then pour filling into shell. Bake until pie puffs slightly and just sets, 35 to 45 minutes. Cool to room temperature and serve."
    ],
    "ingredients": [
        "1 1/8 cups pecans",
        "1 cup dark brown sugar",
        "3/4 cup light corn syrup",
        "3 large eggs",
        "2 egg yolks",
        "2 teaspoons vanilla extract",
        "1/4 teaspoon salt",
        "4 tablespoons melted butter",
        "1 tablespoon cornstarch",
        "1/3 cup water",
        "Easy Pie Dough",
        "1 1/8 cups bleached all-purpose flour",
        "1 tablespoon sugar",
        "1/2 teaspoon salt",
        "4 tablespoons cold cream cheese, cut into 1/2-inch chunks",
        "4 tablespoons frozen butter",
        "2 tablespoons frozen vegetable shortening",
        "3 tablespoons ice cold water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Perfect Pecan Pie",
    "url": "http://allrecipes.com/recipe/77910/perfect-pecan-pie/"
}
