{
    "directions": [
        "Adjust oven rack to lower-middle position and preheat to 425 degrees. Mix flour, salt, baking powder and 3 Tbs. sugar in a medium bowl. Grate 2 Tbs. of the butter on the coarse holes of a box grater into dry ingredients; toss to coat. Repeat grating and tossing with remaining butter. Combine egg and half-and-half; pour into flour mixture. Toss with a fork to form large clumps. Lightly press clumps into a ball; add a teaspoon more half-and-half to the bowl if dough won't come together.",
        "Turn dough onto work surface; press into an 8-by-4- to 5-inch rectangle. Cut into 6 squares, placing them 1 inch apart on a small baking sheet. (Can be refrigerated up to 2 hours before baking.) Before baking, brush tops with optional egg white for a particularly attractive sheen. Sprinkle with remaining 2 Tbs. sugar. Bake until golden brown, about 12 to 14 minutes. Let cool until warm, 5 to 10 minutes.",
        "Mix thawed and fresh berries with sugar in a bowl; let stand until sugar dissolves. With a hand mixer, beat cream to soft peaks, gradually adding 1 Tb. sugar, then vanilla.",
        "Split each cake crosswise; spoon a portion of berries over each cake bottom, then a dollop of whipped cream over berries. Cap with cake top and serve immediately."
    ],
    "ingredients": [
        "For shortcakes:",
        "2 cups all-purpose bleached flour",
        "1/2 teaspoon salt",
        "1 tablespoon baking powder",
        "5 tablespoons sugar, divided",
        "1/2 cup butter, frozen",
        "1 egg, beaten",
        "1 egg white (optional)",
        "1/2 cup cold half-and-half",
        "To assemble:",
        "1 (16 ounce) package unsweetened frozen raspberries, blackberries, blueberries or strawberries, thawed and crushed",
        "12 ounces fresh raspberries, blackberries or blueberries (rinsed and patted dry), or strawberries (hulled and sliced)",
        "7 tablespoons sugar, divided",
        "1 cup chilled heavy cream",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Perfect Berry Shortcakes",
    "url": "http://allrecipes.com/recipe/76969/perfect-berry-shortcakes/"
}
