{
    "directions": [
        "Add the bacon pieces to a soup pot over medium heat and cook until crisp and the fat is rendered. Remove the bacon from the pot and set it aside. Pour off most of the grease, but do not clean the pot.",
        "Return the pot to medium-high heat and add the carrots, celery and onions. Stir and cook for 2 minutes or so, then add the diced potatoes. Cook for 5 minutes, seasoning with the Cajun spice, 1/2 teaspoon salt and some pepper. Pour in the broth and bring it to a gentle boil. Cook until the potatoes are starting to get tender, about 10 minutes. Whisk together the milk and flour, then pour the mixture into the soup and allow the soup to cook for another 5 minutes.",
        "Remove about half of the soup and blend in a blender or food processor until completely smooth. Pour it back into the soup pot and stir to combine. Let it heat back up as you taste for seasoning, adding more of what it needs. Stir in the cream, then the parsley,",
        "Serve in bowls garnished with the grated cheese and crisp bacon pieces. The soup can also be frozen."
    ],
    "ingredients": [
        "6 slices thin bacon, cut into 1-inch pieces",
        "3 carrots, scrubbed clean and diced",
        "3 stalks celery, diced",
        "1 medium onion, diced",
        "6 small russet potatoes, peeled and diced",
        "1/2 teaspoon Cajun spice mix, plus more if needed",
        "Salt and freshly ground black pepper",
        "8 cups low-sodium chicken or vegetable broth",
        "1 cup milk",
        "3 tablespoons all-purpose flour",
        "1/2 cup heavy cream",
        "1 teaspoon minced fresh parsley",
        "1 cup grated Cheddar"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Potato Soup",
        "Vegetable Soup",
        "Potato",
        "Soup",
        "Vegetable",
        "Make Ahead",
        "Cheddar",
        "Cheese"
    ],
    "title": "Perfect Potato Soup",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/perfect-potato-soup"
}
