{
    "directions": [
        "Take the turkey out of the refrigerator and leave it to come to room temperature, about 30 minutes prior to preparing and cooking. Preheat the oven to 450 degrees F.",
        "In a mixing bowl, add the 1/2 cup softened butter, lemon zest and chopped chives. Halve the lemons and squeeze the juice of 1 lemon half into the butter. Stir to combine. Season with salt and pepper.",
        "Prepare the turkey: Remove the inner packet of giblets from the cavity and set aside.",
        "Run your fingers underneath the skin of the breast to make a little pocket between the skin and the flesh. Using your fingers, scoop up some of the lemon-chive butter and push the butter under the skin, filling up the pockets. Do the same thing on the legs. Once each pocket has been filled, take the rest of the butter and rub it all over the outside of the bird. Sprinkle about a tablespoon and a half of coarse salt on top.",
        "Insert the halved lemons, orange and grapefruit into the cavity of the turkey. Insert as much of the citrus as you can. Give each piece a little squeeze as you insert them to get the juices distributed. (You may have to leave some out depending on the size of the cavity. Use any extra citrus for garnish later.)",
        "Remove the giblets from the packet, rinse and pat dry. Place the giblets on the bottom of a large roasting pan. Place the turkey on top of the giblets. Tuck the wings under the turkey.",
        "Place the turkey in a preheated oven and cook for 30 minutes. Then, turn down the heat to 350 degrees F and roast for about another 2 hours, until a meat thermometer inserted into the thickest part of the thigh registers 175 to 180 degrees F. (The general rule is to cook a turkey about 15 minutes per pound.)",
        "Remove the bird from the pan onto a carving board or platter and cover with foil to keep warm. Allow it to rest for 15 minutes before carving.",
        "Place the roasting pan over low heat on the stovetop. Add white wine and deglaze the pan, scraping up the browned bits from the bottom of the pan. Pour in the chicken stock. Whisk the cornstarch into it. Add the remaining tablespoon of butter and the Dijon mustard. Whisk well to combine. Strain the gravy into a small saucepan and simmer over low heat until thick and smooth, about 8 minutes.",
        "Bring your turkey to room temperature to ensure that the bird will cook evenly.",
        "Stuffing a turkey with fruit keep the bird moist and acts as a secondary cooking agent. As the juice of the fruit steams inside the cavity, it helps cook the bird from the inside. The juices also help to flavor the pan juices used for making the gravy.",
        "Stuffing butter between the skin and the flesh, keep the meat moist and flavorful. The butter and salt on the outside help create a tasty, crispy skin.",
        "I like to use the giblets as a platform for the bird. It stops the bottom of the bird from burning and adds flavor to the pan juices.",
        "A good rule for roasting times is to plan on roasting a turkey for about 15 minutes per pound.",
        "A meat thermometer is the best tool for figuring out if your turkey is fully cooked."
    ],
    "ingredients": [
        "1 (12-pound) turkey, with giblets (see cooking notes at bottom of recipe)",
        "1/2 cup unsalted butter (1 stick), softened, plus 1 tablespoon",
        "2 lemons, zested",
        "1/2 cup chopped chives",
        "2 tablespoons coarse salt",
        "Freshly ground black pepper",
        "1 small orange, halved",
        "1 small grapefruit, halved",
        "1 cup white wine",
        "2 cups chicken stock",
        "1 tablespoon Dijon mustard",
        "2 tablespoons cornstarch"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Thanksgiving Turkey",
        "Holiday",
        "Poultry Recipes",
        "Thanksgiving",
        "Turkey Recipes",
        "Gravy",
        "Roast Recipes",
        "Fruit",
        "Meat",
        "Grapefruit Recipes",
        "Lemon Recipes",
        "Roasting"
    ],
    "title": "Perfect Citrus Turkey and Gravy",
    "url": "http://www.foodnetwork.com/recipes/danny-boome/perfect-citrus-turkey-and-gravy-recipe"
}
