{
    "directions": [
        "Mince 1 garlic clove and in a large skillet cook in 2 tablespoons oil over moderate heat, stirring, until golden. Add water and half of mussels and steam mussels, covered, stirring once or twice, 2 to 5 minutes, transferring them as they open with a slotted spoon to a large bowl. (Discard any mussels that are unopened after 5 minutes.) In liquid remaining in skillet steam remaining mussels in same manner and transfer to bowl.",
        "Pour liquid remaining in skillet through a fine sieve into a small bowl and stir in liqueur to make marinade. When mussels are cool enough to handle, remove from shells. Clean and reserve 1 half shell from each mussel. Add mussels to marinade, tossing to coat, and season with salt. Marinate mussels, covered with plastic wrap and chilled, at least 3 hours and up to 1 day. Chill reserved shells in a sealable plastic bag. Thinly slice remaining garlic clove and in a small saucepan cook in remaining 1/2 cup oil over moderate heat, stirring, until golden. Discard garlic with slotted spoon and in a blender blend oil, chervil, parsley, and salt until herbs are finely chopped. Chervil oil may be made 1 week ahead and chilled in an airtight container. Bring oil to room temperature before using.",
        "Arrange reserved mussel shells on plates and spoon about ‚ teaspoon chervil oil into each shell. Add mussels and garnish with chervil."
    ],
    "ingredients": [
        "2 garlic cloves",
        "1/2 cup plus 2 tablespoons olive oil",
        "1/4 cup water",
        "6 pounds mussels (preferably New Zealand green)",
        "3 tablespoons Pernod or other anise-flavored liqueur",
        "1/2 cup packed fresh chervil sprigs",
        "1/4 cup packed fresh flat-leafed parsley leaves",
        "1/4 teaspoon salt",
        "Garnish: about 60 small fresh chervil sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Shellfish",
        "Appetizer",
        "Steam",
        "Cocktail Party",
        "Mussel",
        "Pernod",
        "Fall",
        "Parsley",
        "Gourmet"
    ],
    "title": "Pernod-Marinated New Zealand Mussels with Chervil Oil",
    "url": "http://www.epicurious.com/recipes/food/views/pernod-marinated-new-zealand-mussels-with-chervil-oil-100692"
}
