{
    "directions": [
        "Dice 1 of the onions. Heat a large pot over medium-high heat and add 4 tablespoons of the olive oil. Add the onion and sauté until lightly browned, about 5 minutes. Drain and rinse the chickpeas, kidney beans, and fava beans, and add them to the onion along with 4 of the minced cloves of garlic, the turmeric, and lentils. Sauté for 1 minute, then add the stock and bring to a boil. Boil the beans, covered, for 1 hour. Tilt the lid so the pot is partially covered and simmer, stirring occasionally, for 1 1/2 hours. Season with salt. Slice the remaining 2 onions into thin half moons. Heat a sauté pan over high heat and add the remaining 3 tablespoons olive oil. Add the onions and fry, stirring frequently, until the onions are brown and caramelized. Add the remaining garlic and the mint and sauté for 1 minute. Season with salt and set aside.",
        "Add the noodles to the soup and cook until tender, 6 to 8 minutes. When the noodles are almost done, add the leafy greens and the fresh herbs and cook for 2 minutes. Serve with a large dollop of yogurt and a few tablespoons of the sautéed onion mixture."
    ],
    "ingredients": [
        "1/2 cup chickpeas, soaked overnight in water to cover",
        "1/4 cup kidney beans, soaked overnight in water to cover",
        "1/2 cup dried fava beans, soaked overnight in water to cover, or 1 1/2 cups frozen lima beans",
        "3 yellow onions",
        "7 tablespoons olive oil",
        "5 cloves garlic, minced",
        "1 teaspoon ground turmeric",
        "1/4 cup dried lentils",
        "14 cups vegetable or chicken stock",
        "Salt",
        "1 large handful fresh mint leaves, torn into pieces",
        "6 ounces thin egg noodles or linguine, broken into thirds",
        "1 bunch leafy greens, stemmed, and coarsely chopped",
        "1/4 cup fresh dill leaves, minced",
        "1/2 cup fresh cilantro, minced",
        "1/2 cup fresh flat-leaf parsley, minced",
        "2 cups plain yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Garlic",
        "Leafy Green",
        "Herb",
        "Pasta",
        "Yogurt",
        "High Fiber",
        "Dinner",
        "Lunch",
        "Mint",
        "Legume",
        "Chickpea",
        "Lentil",
        "Healthy",
        "Persian New Year",
        "Dill",
        "Cilantro",
        "Parsley",
        "Simmer",
        "Advance Prep Required",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Persian New Year's Soup with Beans, Noodles, and Herbs _(Ash-e-reshteh)_",
    "url": "http://www.epicurious.com/recipes/food/views/persian-new-years-soup-with-beans-noodles-and-herbs-em-ash-e-reshteh-em-363446"
}
