{
    "directions": [
        "Preheat the oven to 350°F (175°C). Coat a 10-cup (2.5-liter) Bundt cake or tube pan with butter or nonstick cooking spray.",
        "To make the cake, in a small saucepan over medium heat, bring the currants and brandy or whiskey to a boil. Remove from the heat, cover, and let cool.",
        "Into a large bowl, sift together the flour, baking soda, cinnamon, salt, and nutmeg. Stir in the granulated sugar. In a medium bowl, mix together the 3/4 cup (6 ounces/170 g) melted butter, persimmon purée, eggs, and 2 teaspoons vanilla.",
        "Make a well in the center of the flour mixture, add the persimmon mixture, and gently stir. Fold in the currants, along with any unabsorbed liquid, and the nuts. Mix just until everything is moistened; don't overmix.",
        "Scrape the batter into the prepared pan and bake until a toothpick inserted into the cake comes out clean, about 1 hour. Remove from the oven and let cool completely. Once cool, invert the cake onto a serving plate.",
        "To make the icing, in a stand mixer fitted with the paddle attachment, beat together the cream cheese and 1 tablespoon butter on high speed until smooth. Beat in the 1/2 teaspoon vanilla and the lemon juice, then gradually add the powdered sugar, beating on high speed until smooth. Add the 4 teaspoons water; the icing should be pourable. If necessary, add 1 more teaspoon water.",
        "Spoon the icing around the top of the cake, then tap the plate on a folded kitchen towel on the countertop to encourage the icing to run down the sides of the cake.",
        "This cake will keep for 4 days at room temperature.",
        "If you don't have persimmons, or if they're not in season, you can substitute unsweetened applesauce or banana purée for the persimmon purée."
    ],
    "ingredients": [
        "3/4 cup (120 g) dried currants",
        "1/4 cup (60 ml) brandy or whiskey",
        "2 cups (280 g) all-purpose flour",
        "2 teaspoons baking soda",
        "1 1/2 teaspoons ground cinnamon",
        "3/4 teaspoon salt",
        "1/2 teaspoon freshly grated nutmeg",
        "1 2/3 cups (355 g) granulated sugar",
        "3/4 cup (6 ounces/170 g) unsalted butter, melted",
        "1 1/2 cups (375 ml) persimmon purée",
        "3 large eggs, at room temperature",
        "2 teaspoons vanilla extract",
        "1 1/2 cups (150 g) walnuts or pecans, toasted and finely chopped",
        "4 ounces (115 g) cream cheese",
        "1 tablespoon salted butter, at room temperature",
        "1/2 teaspoon vanilla extract",
        "1 tablespoon freshly squeezed lemon juice",
        "2/3 cup (90 g) powdered sugar, sifted",
        "4 or 5 teaspoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Cheese",
        "Dairy",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Cream Cheese",
        "Tree Nut",
        "Almond",
        "Walnut",
        "Fall",
        "Persimmon",
        "Advance Prep Required",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Persimmon Cake with Cream Cheese Icing",
    "url": "http://www.epicurious.com/recipes/food/views/persimmon-cake-with-cream-cheese-icing-358789"
}
