{
    "directions": [
        "Whisk egg whites in small bowl until foamy. Using pastry brush, brush rose petals on both sides with egg whites; sprinkle on both sides with sugar. Dry on nonstick rack at least 6 hours or overnight.",
        "Preheat oven to 325°F. Butter two 8-inch-diameter cake pans with 1 1/2-inch-high sides. Line pan bottoms with parchment paper; butter parchment. Sift flour, 7 tablespoons baker's sugar, baking powder, and salt into large bowl. Whisk yolks and next 4 ingredients in small bowl until smooth. Add yolk mixture to dry ingredients; whisk until smooth. Beat egg whites in medium bowl until soft peaks form. Gradually add 7 tablespoons baker's sugar; beat until whites resemble thick marshmallow fluff. Fold whites into batter in 3 additions. Divide batter between prepared pans. Bake until cakes are golden and tester inserted into center comes out clean, about 25 minutes. Cool in pans on racks 15 minutes. Turn out onto racks, peel off parchment, and cool completely. (Can be prepared 1 day ahead. Wrap and store at room temperature.)",
        "Combine 1/2 cup cream and saffron in small saucepan. Bring to simmer. Remove from heat; let steep 20 minutes. Chill until cold.",
        "Beat remaining 2 cups cream, powdered sugar, and rose water in large bowl until soft peaks form; strain in saffron cream. Beat until peaks form.",
        "Place 1 cake layer, flat side up, on platter. Spread 1 cup frosting over. Top with second cake layer, flat side down. Spread remaining frosting over top and sides of cake. Chill at least 1 hour and up to 6 hours. Garnish cake with rose petals and pistachios."
    ],
    "ingredients": [
        "2 large egg whites",
        "1/2 cup sugar",
        "Petals from 2 organic roses",
        "1 cup cake flour",
        "14 tablespoons baker's sugar or superfine sugar, divided",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon coarse kosher salt",
        "3 large eggs, separated",
        "6 tablespoons water",
        "1/4 cup canola oil",
        "1 teaspoon grated lemon peel",
        "1/4 teaspoon whole cardamom seeds (removed from about 5 green cardamom pods)",
        "2 1/2 cups chilled heavy whipping cream, divided",
        "Pinch of saffron threads",
        "2/3 cup powdered sugar",
        "1 teaspoon rose water",
        "2 tablespoons natural unsalted pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Wedding",
        "Anniversary",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Persian Love Cake",
    "url": "http://www.epicurious.com/recipes/food/views/persian-love-cake-232273"
}
