{
    "directions": [
        "In a medium-sized saucepan, combine the black-eyed peas and 4 cups water and bring to a boil over high heat. Lower the heat and simmer until tender, about 25 minutes. Off the heat, add the salt and set aside while the peas absorb some salt for 10 minutes. Drain.",
        "Meanwhile, put the saffron and water in a small bowl. Mix and set aside for at least 15 minutes and as long as overnight.",
        "Place a large sauté pan over medium-low heat and add the olive oil, onion, carrots, and red bell pepper, stirring until the peppers start to soften and the onion is translucent, about 10 minutes. Add the saffron (and its blooming water), Persian Spice Mix, garlic, and black-eyed peas. Season the carrots and peas with salt and pepper to taste and stew until the carrots and peppers are tender and the black-eyed peas are glazed.",
        "Remove from the heat and set aside to cool. Stir in the lemon juice, honey, and parsley. Serve cold or at room temperature."
    ],
    "ingredients": [
        "1 cup dried black-eyed peas",
        "1/2 teaspoon kosher salt, plus more to taste",
        "Pinch of saffron",
        "2 tablespoons warm tap water",
        "2 tablespoons extra-virgin olive oil",
        "1 small onion, finely chopped",
        "4 cups thin carrot rounds",
        "1 red bell pepper, stemmed, seeded, and finely chopped",
        "1 1/2 teaspoons Persian Spice Mix",
        "1 teaspoon finely chopped garlic",
        "Freshly ground black pepper",
        "1 teaspoon freshly squeezed lemon juice",
        "2 teaspoons honey",
        "2 tablespoons chopped fresh flat-leaf parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Carrot",
        "Pea",
        "New Year's Eve",
        "Side",
        "Spice",
        "Saffron"
    ],
    "title": "Persian-Style Carrots and Black-Eyed Peas",
    "url": "http://www.epicurious.com/recipes/food/views/persian-style-carrots-and-black-eyed-peas"
}
