{
    "directions": [
        "1. Preheat oven to 400°F. Line two cookie sheets with parchment paper.",
        "2. In a small nonstick saucepan, bring water, margarine, and salt to a boil. When margarine melts, add flour all at once, stirring rapidly. Reduce heat to medium and continue to cook until a ball of dough that detaches easily from the pot forms. Set aside and let cool for 10 minutes.",
        "3. In the meantime, make the cream filling by beating the parve whipping cream until it forms peaks. Add the powdered sugar and mixing well. Store in a cool place until ready to use.",
        "4. Transfer cooled dough to the bowl of stand mixer fitted with a flat paddle attachment. Add eggs, one by one, making sure each egg has completely incorporated into the dough before adding the next.",
        "5. Transfer dough to a pastry bag fitted with a large star pastry tip (Wilton 4B is perfect) or simply use an ice cream scoop to form puffs. Form meringue-like mounds, 3\" in diameter and 2\" in height, directly on the prepared pans.",
        "6. Bake for 20 minutes until golden brown; transfer puffs to a cooling rack.",
        "7. When the puffs are completely cooled, cut in half, using a serrated knife, and fill the cavity with whipped cream.",
        "8. Optional: To make the syrup, mix all ingredients in a bowl and microwave for 1 minute. Drizzle cooled syrup on cream puffs right before serving. Can also be served with a drizzle of melted chocolate or sprinkled with powered sugar."
    ],
    "ingredients": [
        "1 cup water",
        "1 stick unsalted parve margarine (4 oz.)",
        "1/2 teaspoon salt",
        "1 cup flour",
        "5 eggs",
        "1 pint (8 oz.) parve whipping cream, whipped",
        "1 cup powdered sugar",
        "1 cup honey",
        "1/4 cup rose water",
        "1/2 teaspoon saffron",
        "1/2 teaspoon cardamom"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Rosh Hashanah/Yom Kippur",
        "Family Reunion",
        "Shower",
        "Kosher",
        "Persian New Year",
        "Engagement Party",
        "Potluck",
        "Pastry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Persian Cream Puffs _(Noon'e Chamei)_",
    "url": "http://www.epicurious.com/recipes/food/views/persian-cream-puffs-em-noone-chamei-em-51110000"
}
