{
    "directions": [
        "Set a fine-mesh sieve over a small bowl. Purée first 4 ingredients and 4 large ice cubes in a blender until smooth. Add onion; pulse 3-4 times. Strain liquid into a medium bowl. Stir in clam juice, if desired; season with salt. Cover and chill.",
        "Pour water into a large pot fitted with a steamer basket to a depth of 1\"; bring to a boil. Add sweet potato, cover, and cook until just fork-tender, about 30 minutes. Transfer to a plate; let cool.",
        "Meanwhile, add more water to same pot, if needed, to measure 1\"; bring to a boil. Add ear of corn to pot and steam until crisp-tender, 2-3 minutes. Transfer to a plate; let cool completely.",
        "Halve potato lengthwise. Using a small melon baller, scoop out potato balls and place them in a small bowl; set aside. Cut kernels from cob. Reserve 1/3 cup kernels (save extra kernels for another use).",
        "Rub a large bowl with cut sides of chile; discard. Place fluke, 2/3 of onion, leche de tigre, and 4 large ice cubes in bowl; stir well. Let marinate for 2 minutes; remove ice. Fold in potato and corn; season with salt.",
        "Using a slotted spoon, divide ceviche into small bowls or onto plates. Drizzle ceviche with leche de tigre from bowl; garnish with remaining onion and cilantro."
    ],
    "ingredients": [
        "2/3 cup fresh lime juice",
        "2 garlic cloves, smashed",
        "1 tablespoon (packed) chopped fresh cilantro leaves",
        "1/2 ají limo or habanero chile, seeded",
        "1/2 small red onion, chopped",
        "1/2 cup bottled clam juice (optional)",
        "Kosher salt",
        "1 small sweet potato (about 8 ounces)",
        "1 ear of corn, husked",
        "1 ají limo or habanero chile, seeded, halved lengthwise",
        "1 pound fluke, flounder, or sole, cut into 1/2\" cubes",
        "1 small red onion, quartered and thinly sliced, divided",
        "Kosher salt",
        "Cilantro leaves",
        "Ingredient info: Ají limo chiles are sold at Latin markets; look for habanero chiles at some supermarkets and at Latin markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Onion",
        "Appetizer",
        "Low Cal",
        "Seafood",
        "Corn",
        "Sweet Potato/Yam",
        "Summer",
        "Healthy",
        "Lime Juice",
        "Chile Pepper",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Peruvian Ceviche",
    "url": "http://www.epicurious.com/recipes/food/views/peruvian-ceviche-395483"
}
