{
    "directions": [
        "Heat oil in a 5-quart pot over medium heat. Cook about half the beef in hot oil until completely browned, about 5 minutes. Remove beef with a slotted spoon to a bowl. Repeat with remaining beef.",
        "Cook and stir onion and garlic in the oil remaining in the pot until the onion is soft, about 4 minutes. Return beef to the pot; add tomato paste and stir to coat beef in paste. Stir oregano and bay leaves into the beef mixture; season with kosher salt and pepper. Cook and stir the mixture just until the oregano is fragrant, about 1 minute.",
        "Pour beef broth into the pot, cover the pot, and bring the broth to a boil. Reduce heat to medium-low and simmer liquid until the beef is very tender, about 90 minutes.",
        "Bring a large pot of lightly salted water to a boil. Cook fideo in the boiling water, stirring occasionally until cooked through but firm to the bite, 4 to 5 minutes. Drain.",
        "Stir carrot and zucchini into the liquid; cook until the carrots are tender, about 15 minutes. Remove and discard bay leaves. Season again with kosher salt and pepper. Stir fideo into the broth; cook until the noodles are hot, about 1 minute."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "2 pounds beef stew meat, cut into 1/2-inch cubes",
        "2 cups diced Spanish onion",
        "4 cloves garlic, minced",
        "2 tablespoons tomato paste",
        "1 teaspoon dried oregano",
        "2 bay leaves",
        "1 pinch kosher salt to taste",
        "1 pinch ground black pepper to taste",
        "8 cups beef broth",
        "1 (8 ounce) package fideo pasta",
        "2 1/2 cups 1/4-inch pieces carrot",
        "1/2 pound zucchini, halved lengthwise and cut in 1/4-inch slices"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Peruvian Beef Noodle Soup (Sopa Criolla)",
    "url": "http://allrecipes.com/recipe/236494/peruvian-beef-noodle-soup-sopa-criol/"
}
