{
    "directions": [
        "Place two large skillets over medium heat, pour 2 tablespoons of vegetable oil into each, and heat the oil until it ripples. Season the chicken with salt and pepper, divide between the two skillets, and fry until golden brown and crisp, about 15 minutes. Use screens over the skillets, if needed, to control spattering. Remove the chicken from the skillets, and drain on paper towels.",
        "Place the cilantro leaves, garlic, aji pepper, Worcestershire sauce, and orange juice into a blender, and blend until smooth. Pour the mixture into one of the skillets, bring to a simmer, and cook and stir over medium-low heat until the mixture turns from bright to dark green, about 5 minutes.",
        "Place the chopped onions into the other skillet, and cook and stir over medium-low heat until the onions turn translucent, 5 to 7 minutes. Stir in the rice, and cook and stir until the rice starts to turn opaque, about 5 minutes.",
        "Pour the white wine into the blender and pulse a few times to rinse off any extra cilantro mixture from the blender, and pour the wine into the skillet containing the cilantro mixture. Bring the mixture back to a simmer over medium heat, scrape the rice and onions into the cilantro mixture, stir in the chicken broth and black pepper, and bring to a boil. Place the browned chicken pieces and carrots into the skillet, stir to combine, and cover. Reduce heat, and cook until the rice is separate and the chicken is no longer pink in the center, about 30 minutes.",
        "Remove the lid,  place the pepper rings on the rice, and sprinkle with frozen peas. Cover and cook without stirring  until the peppers and peas are tender, about 15 minutes. Uncover the skillet and allow the dish to rest for 5 minutes before serving."
    ],
    "ingredients": [
        "1/4 cup vegetable oil, divided",
        "6 chicken thighs, skinned and patted dry",
        "6 chicken drumsticks with skin, patted dry",
        "salt and black pepper to taste",
        "1 1/2 bunches fresh cilantro, leaves picked from stems",
        "6 cloves garlic, peeled and coarsely chopped",
        "1 aji (Peruvian) pepper, seeded and deveined",
        "1 tablespoon Worcestershire sauce",
        "1/2 cup orange juice",
        "2 cups uncooked white rice",
        "2 onions, chopped",
        "1/2 cup white wine",
        "3 1/2 cups chicken broth",
        "1 teaspoon freshly ground black pepper",
        "1 large carrot, peeled and diced",
        "1 bell pepper, any color, sliced into rings",
        "3/4 cup frozen peas"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Peruvian Arroz con Pollo",
    "url": "http://allrecipes.com/recipe/204963/peruvian-arroz-con-pollo/"
}
