{
    "directions": [
        "To make the pesto, in a food processor, combine the pine nuts and garlic and process until coarsely chopped. Add about half of the basil and process until coarsely chopped. Add the remaining basil and the olive oil and process until a thick sauce forms. Add the Parmigiano-Reggiano cheese and season with salt and pepper. Process briefly. Use the pesto immediately, or pour into a glass jar or other container and top with a thin layer of olive oil to prevent the surface from discoloring. Cover tightly and refrigerate for up to 2 weeks. This recipe makes about 1 cup pesto; you will need 1/2 cup pesto for the pizza.",
        "Place a pizza stone in an oven and preheat the oven to 450ºF.",
        "Line a baking sheet pan with paper towels. Place the tomato slices in a single layer on the towels and pat dry with more paper towels. Let stand to allow the tomatoes to dry.",
        "On a floured surface, roll out the pizza dough into a 12-inch round. Transfer to a floured pizza peel. Spread 1/4 cup pesto evenly over the dough, leaving a 1-inch border. Top with the mozzarella cheese and arrange the tomato slices on top. Season the cheese and tomatoes with salt and pepper.",
        "Carefully slide the pizza onto the preheated pizza stone. Bake until the cheese is bubbly and the crust is crisp, 12 to 15 minutes. Using the pizza peel, transfer the pizza to a cutting board and drizzle with 1/4 cup pesto. Cut into slices and serve immediately. Makes one 12-inch pizza.",
        "Williams-Sonoma Kitchen."
    ],
    "ingredients": [
        "1/4 cup pine nuts, toasted",
        "2 garlic cloves, peeled",
        "3 cups firmly packed fresh basil leaves",
        "3/4 cup extra-virgin olive oil",
        "3/4 cup grated Parmigiano-Reggiano cheese",
        "Kosher salt and freshly ground pepper, to taste",
        "4 oz. plum tomatoes, cut into 1/4-inch-thick slices",
        "All-purpose flour for dusting",
        "1/2 batch Food Processor Pizza Dough",
        "8 oz. buffalo mozzarella cheese, cut into 1/4-inch-thick slices",
        "Kosher salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pesto Margherita Pizza",
    "url": "http://www.williams-sonoma.com/recipe/pesto-and-tomato-pizza.html"
}
