{
    "directions": [
        "Drain pesto in a small fine-mesh sieve set over a bowl 15 minutes, then discard excess oil.",
        "Lightly oil loaf pan and line with a sheet of plastic wrap large enough to allow a generous overhang on all 4 sides.",
        "Blot peppers well between paper towels to remove excess liquid.",
        "Spread about one fourth (1/2 cup) of cheese evenly over bottom of loaf pan and top with all of pesto, spreading evenly. Drop 1/2 cup cheese by tablespoons over pesto and spread gently to cover pesto.",
        "Top with chopped peppers, spreading evenly. Drop another 1/2 cup cheese by tablespoons over peppers and spread gently to cover peppers.",
        "Spread olive paste evenly on top, then drop remaining cheese by tablespoons over olive paste, spreading gently to cover olive paste. Cover pan with another sheet of plastic wrap and chill at least 8 hours.",
        "Remove plastic wrap from top of pan and invert torta onto a serving plate, then peel off remaining plastic wrap. Let torta stand at room temperature 20 minutes before serving."
    ],
    "ingredients": [
        "1/4 cup prepared basil pesto",
        "Vegetable oil for brushing pan",
        "1/4 cup finely chopped rinsed drained bottled roasted red peppers",
        "20 oz soft mild goat cheese, softened at room temperature (2 cups)",
        "3 tablespoons bottled black olive paste or tapenade",
        "Special equipment: a 2 1/4-cup loaf pan (5 3/4 by 3 1/2 by 2 1/4 inches)",
        "Accompaniment: crackers or toasts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Olive",
        "Pepper",
        "Appetizer",
        "Cocktail Party",
        "Quick & Easy",
        "Goat Cheese",
        "Summer",
        "Gourmet",
        "Oscars",
        "Sugar Conscious",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Pesto, Olive, and Roasted-Pepper Goat Cheese Torta",
    "url": "http://www.epicurious.com/recipes/food/views/pesto-olive-and-roasted-pepper-goat-cheese-torta-108330"
}
