{
    "directions": [
        "In a small bowl whisk together all vinaigrette ingredients except oil with salt and pepper to taste. Whisk in oil in a stream until emulsified.",
        "In a 3-quart saucepan cover potatoes with 2 inches water and simmer until just tender, 10 to 12 minutes. Drain potatoes in a colander and cool. Cut potatoes into 1/4-inch-thick slices and in a bowl toss gently with shallots, thyme, tarragon, parsley, 1/4 cup olives, and 2 tablespoons vinaigrette until combined well.",
        "Arrange pastry rings on a baking sheet. Divide potato salad among rings, layering potato slices to 1/2 inch below tops of rings, and top with goat cheese pieces, spreading cheese evenly to cover potato salad completely. Potato goat-cheese rounds may be prepared up to this point 1 day ahead and chilled, covered. Bring rounds to room temperature before proceeding.",
        "Preheat broiler.",
        "In a small saucepan simmer cream with basil leaf until reduced by about half. Whisk in yolk and salt and pepper to taste and remove pan from heat.",
        "Carefully remove rings from rounds and spread about 1 tablespoon cream mixture evenly over top of each round. Broil rounds on baking sheet 6 inches from heat until tops are golden.",
        "Toss mesclun with chervil and remaining vinaigrette and divide among 6 salad plates. Transfer warm rounds to plates with a spatula and garnish with thyme sprigs and remaining 1/4 cup olives."
    ],
    "ingredients": [
        "1 shallot, chopped fine",
        "2 large fresh basil leaves",
        "2 tablespoons balsamic vinegar",
        "1 tablespoon Sherry vinegar*",
        "5 tablespoons extra-virgin olive oil",
        "1 pound small Yukon Gold or red potatoes",
        "4 shallots, chopped fine (about 1/4 cup)",
        "1/4 teaspoon finely chopped fresh thyme leaves",
        "1 teaspoon finely chopped fresh tarragon leaves",
        "1 tablespoon finely chopped fresh parsley leaves",
        "1/2 cup Niçoise or other brine-cured black olives, pitted",
        "six 3-inch metal pastry rings",
        "a 10-ounce log soft mild goat cheese such as Coach Farm brand, cut into 6 equal pieces",
        "1 cup heavy cream",
        "1 fresh basil leaf",
        "1 large egg yolk",
        "6 cups mesclun (mixed baby greens, about 1/2 pound), washed and spun dry",
        "3 tablespoons chopped fresh chervil",
        "Garnish: fresh thyme sprigs",
        "*available at specialty foods shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Milk/Cream",
        "Leafy Green",
        "Olive",
        "Potato",
        "Goat Cheese",
        "Basil",
        "Tarragon",
        "Thyme",
        "Gourmet"
    ],
    "title": "Petatou de Chère Fraise au Thyme et Olives Nicoises",
    "url": "http://www.epicurious.com/recipes/food/views/petatou-de-chere-fraise-au-thyme-et-olives-nicoises-11447"
}
