{
    "directions": [
        "Preheat the oven to 375 degrees F. Brush 3 (12 1/2 by 9-inch) rimmed baking sheets (otherwise known as quarter sheet pans) with melted butter. Line the pans with parchment paper, leaving a few inches of overhang on opposite sides. Butter the top of the parchment paper as well, then set aside.",
        "In the bowl of an electric mixer fitted with the paddle attachment, beat the almond paste and sugar on medium speed until well combined, about 5 minutes. Add the almond extract. Roughly cut the room temperature butter into pats and gradually add to the almond paste-sugar mixture. Beat until light and fluffy, about 2 minutes, scraping down the sides of the bowl if needed. Add the eggs, 1 at a time, beating to combine after each addition. Add the flour and salt and beat until just combined.",
        "Divide the batter evenly among the prepared baking sheets, about 2 1/4 cups each sheet, smoothing the batter out with an offset spatula. Gently tap the baking sheet on the table to remove any air pockets in the batter. Air pockets will cause holes in the baked cake and give a ragged look to the finished product. Bake until just set, but not browned, 15 to 20 minutes. Give the baking sheets a turn halfway through baking, after about 8 minutes, for even baking, if needed, but don't worry too much because we're covering the cakes. Test with a toothpick or skewer and if clean, remove from the oven and transfer to wire racks to cool.",
        "To make the jam easier to spread and to prevent tearing the cake, puree the raspberry jam in a food processor. Line a baking sheet with parchment paper. Turn 1 cake layer out onto the lined baking sheet. Spread half of the raspberry jam in an even layer over the cake. Carefully flip the cake out of the baking sheet and top with a second cake layer. Spread with the remaining jam. Carefully flip the final layer out of the baking sheet and top the cake. Place a piece of parchment paper over the final layer and top with a second baking sheet. Weigh down with 2 large (28-ounce) cans. Chill in the refrigerator for at least 1 hour and up to overnight.",
        "Remove the cake from the refrigerator and cut into 1-inch squares. Place onto a wire racks over at least 2 baking sheets, leaving at least 1-inch between each cake piece.",
        "Place each of the tinted royals icings in a heatproof bowl set over a pan of simmering water, with the bottom of the bowl not touching the water, until pourable. You should have about 8 cups total. You'll be using about 1 heaping tablespoon icing on each. Carefully place a cut cake on a chocolate fork/dipper (or a small fork). Place the cake over the icing and spoon the icing onto the cake. If the cake drops into the icing, carefully pick it up with your spoon and place back onto your fork/dipper. Place back onto the wire rack using another dipper or fork to slide onto the wire rack. Top with decorative dragees, as desired. Repeat with the remaining icing and cakes. Alternately, for each tinted frosting, set 3 cooling racks over baking sheets and divide the cut cake pieces evenly among the racks. Pour the tinted frosting slowly over the cake pieces. If you need extra frosting, just remove the cooling rack, scrape the excess frosting from the baking sheet, melt or microwave until pourable and touch up any area that the frosting didn't coat the first time. Let stand until set, about 30 minutes at room temperature or cover and place in the refrigerator for up to 1 week until ready to serve.",
        "Put your raspberries and 1/4 cup water in a saucepan over medium heat. Once it's at a simmer, partially cover and cook 8 to 10 minutes. Pass the berry mixture through a food mill and measure the liquid that remains. You need 3 1/2 cups. Add more water if there isn't enough.",
        "Put the berry liquid into a new saucepan over medium heat and bring to a simmer again. Once it simmers, start adding your sugar in 1/2 cup increments. Give it a stir to incorporate and bring it back to a simmer before adding of the next 1/2 cup sugar. Once the last 1/2 cup is added, bring the liquid to 216 to 218 degrees F on a candy thermometer. Stir constantly.",
        "Let this cool to room temperature prior to using. If not using right away, refrigerate for up to 1 week. Yield: 2 cups.",
        "In a large heatproof bowl, combine 1 1/4 cups plus 1 tablespoon water, corn syrup and almond extract. Once incorporated, slowly whisk in the sugar until fully combined. Alternately, slowly mix together in a stand mixer and transfer to a heatproof bowl prior to icing cakes.",
        "Divide the icing into 3 heatproof bowls. To make a pale green color, add a little less than 1 drop green food coloring to the first bowl. To the second bowl, add 1 drop purple coloring for a lavender color. And leave the final bowl white, or add another color, as desired."
    ],
    "ingredients": [
        "2 sticks unsalted butter, at room temperature, plus melted butter for pans",
        "1 pound almond paste",
        "1 cup sugar",
        "1 teaspoon pure almond extract",
        "6 large eggs",
        "1 cup all-purpose flour",
        "Pinch fine sea salt",
        "1 1/3 cups Raspberry Preserves, recipe follows, or strawberry jam with seeds",
        "8 cups tinted Royal Icing, recipe follows, or store bought",
        "Decorative dragees, silver, gold, etc., for garnish",
        "1 quart raspberries",
        "1 tablespoon lemon juice",
        "1 3/4 cup sugar",
        "6 tablespoons corn syrup",
        "2 tablespoons plus 1 teaspoon almond extract",
        "17 1/2 cups confectioners' sugar (about 5 boxes)",
        "Green and violet food coloring (or your favorite colors)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Cake",
        "Nut Recipes"
    ],
    "title": "Petit Fours",
    "url": "http://www.foodnetwork.com/recipes/anne-thornton/petit-fours-recipe"
}
