{
    "directions": [
        "Preheat oven to 425°F. Place a wire rack inside a rimmed baking sheet and place bones on top. Roast bones (undisturbed) until deep golden brown, 40–50 minutes. Transfer to a large pot and add 5 quarts of water. Bring to a simmer, then use a fine-mesh sieve to skim off any foam or gray bits from the surface. Remove from heat.",
        "Meanwhile, in another large pot, heat oil over medium-high. Add onions, celery, and carrots and cook, stirring occasionally, until vegetables start to caramelize, 10–15 minutes. Add tomato paste and cook, stirring often, until slightly darkened in color, 6–8 minutes.",
        "Add bones along with liquid, garlic, thyme, and bay leaf to vegetables. Bring just to a boil; reduce heat to low, and cook at a bare simmer, adding water as needed during cooking to maintain level of liquid until stock is flavorful, about 2 hours. Strain stock through a fine-mesh sieve into a large bowl, then strain again into another large bowl or airtight containers.",
        "Stock can be made 5 days ahead. Let cool; cover and chill, or freeze up to 1 month ahead.",
        "Heat oil and butter in a large pot over medium heat. Place garlic, cut side down, in pot and cook undisturbed until golden brown, about 4 minutes. Transfer garlic to a plate.",
        "Add onions to same pot, season with salt and pepper, and cook, stirring occasionally at first and then more often as onions darken to keep them from getting too brown in any one spot, until golden but not mushy, 60–70 minutes (and no, this process can't be rushed at a higher temperature).",
        "Add Sherry and stir, scraping up any browned bits from bottom of pot. Stir in 8 cups veal stock. Bundle up garlic, thyme, and bay leaf in cheesecloth and tie closed with kitchen twine. Add to pot; bring mixture to a boil. Reduce heat and cook, stirring occasionally, until liquid is reduced by one-quarter, flavors have melded, and onions are completely tender, 45–50 minutes.",
        "Heat broiler. Divide soup among bowls and top each with a toast and a slice each of Gruyere and Emmenthal cheese. Place on a rimmed baking sheet and broil until cheese is melted and brown in spots, about 5 minutes. Let cool for a minute or so before serving."
    ],
    "ingredients": [
        "6 pound veal neck or beef bones",
        "1 tablespoon grapeseed or vegetable oil",
        "2 large onions, chopped",
        "6 celery stalks, chopped",
        "1 pound carrots, peeled, chopped",
        "1/4 cup tomato paste",
        "1 head of garlic, halved crosswise",
        "4 sprigs thyme",
        "1 bay leaf",
        "3 tablespoons grapeseed or vegetable oil",
        "1 tablespoon unsalted butter",
        "1 head of garlic, halved crosswise",
        "4 pounds onions, thinly sliced",
        "Kosher salt, freshly ground pepper",
        "3 tablespoons dry Sherry",
        "6 sprigs thyme",
        "1 bay leaf",
        "4 1/2\"-thick slices baguette, toasted",
        "4 1/8\"-thick slices Gruyere",
        "4 1/8\"-thick slices Emmenthal cheese",
        "Cheesecloth",
        "French onion soup bowls or 8-ounce ramekins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Cheese",
        "Garlic",
        "Onion",
        "Kid-Friendly",
        "Veal",
        "Carrot",
        "Healthy",
        "Simmer"
    ],
    "title": "Petit Trois's French Onion Soup",
    "url": "http://www.epicurious.com/recipes/food/views/petit-troiss-french-onion-soup-56389985"
}
