{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "Sprinkle both sides of the beef with salt and pepper. Heat the olive oil in an oven-safe medium skillet over high heat. When the oil is hot, carefully place the filet in the pan. Cook until browned on both sides, about 3 to 4 minutes a side. Transfer the steak to the oven and bake until a meat thermometer reads 130 degrees F. for medium-rare, about 5 to 6 minutes. Remove the beef from the oven and let rest for 5 minutes.",
        "Heat the olive oil in a medium skillet over medium heat. Add the mushrooms and the shallots and cook until golden brown and tender, about 5 minutes. Add the thyme, white wine, salt, and pepper and continue to cook until all of the liquid has evaporated, about 5 more minutes.",
        "Meanwhile, put the Gorgonzola, mayonnaise, and mustard in a food processor and combine until smooth. Transfer the Gorgonzola mixture to the skillet with mushrooms and shallots. Gently stir the cheese mixture into the mushroom mixture.",
        "Slice the beef and serve topped with a dollop of the cheese sauce. Reserve leftover sauce for another use."
    ],
    "ingredients": [
        "1 (4 to 6-ounce) petite filet of beef",
        "Pinch salt",
        "Pinch freshly ground black pepper",
        "3 tablespoons olive oil",
        "3 tablespoons olive oil",
        "1/4-pound (about 1 cup) dried porcini mushrooms, soaked and strained",
        "1 shallot, sliced (about 2 tablespoons)",
        "1 teaspoon chopped fresh thyme leaves",
        "1/4 cup dry white wine",
        "1/4 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "3 ounces (about 3 tablespoons) Gorgonzola",
        "1/2 cup mayonnaise",
        "1 teaspoon Dijon mustard"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "American",
        "Beef",
        "Meat",
        "Blue Cheese",
        "Cheese",
        "Shallot Recipes",
        "Vegetable",
        "Mushroom",
        "Main Dish Recipes",
        "Sauteing Recipes"
    ],
    "title": "Petite Filet with Gorgonzola and Porcini Mushroom Sauce",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/petite-filet-with-gorgonzola-and-porcini-mushroom-sauce-recipe"
}
