{
    "directions": [
        "Follow recipe for basic butter cookies, forming dough into 2 balls (instead of a log) and flattening each into a 6-inch disk. Chill disks, wrapped in plastic wrap, until firm, at least 1 hour.",
        "Simmer lemon juice, zest, sugar, butter, cornstarch, and salt in a 2-quart heavy saucepan over moderately high heat, whisking constantly, 1 minute. Lightly beat yolks in a small bowl, then add 1/4 cup lemon mixture, whisking. Add yolk mixture to remaining lemon mixture, then reduce heat to low and cook, whisking constantly, until curd is thick enough to hold marks of whisk, about 2 minutes. Transfer to a bowl, then cover surface with plastic wrap and chill while rolling out dough.",
        "While oven preheats, roll out 1 piece of dough (keep remaining dough chilled) into a 9-inch round (slightly less than 1/4 inch thick) on a well-floured surface with a well-floured rolling pin. (If dough becomes too soft to roll out, chill on a baking sheet until firm.) Cut out as many cookies as possible with cutter.",
        "Bake cookies, switching position of sheets halfway through baking, until edges are golden, 8 to 10 minutes. Dredge warm cookies in confectioners sugar until coated and transfer to a rack to cool completely. Make more cookies in same manner.",
        "Transfer lemon curd to pastry bag or plastic bag (snip an 1/8-inch opening in a corner of plastic bag). Put 1 cookie upside down on work surface and pipe about 1/2 teaspoon lemon curd onto cookie, then top with another cookie, right side up, to form a sandwich. Make more sandwiches in same manner.",
        "Just before serving, sift some remaining confectioners sugar over tops of sandwiched cookies."
    ],
    "ingredients": [
        "Ingredients for basic butter cookies",
        "1 1/2 cups confectioners sugar for dredging and dusting",
        "3/4 cup fresh lemon juice",
        "1 tablespoon finely grated fresh lemon zest",
        "3/4 cup granulated sugar",
        "1 stick (1/2 cup) unsalted butter, cut into bits",
        "2 tablespoons cornstarch",
        "1/2 teaspoon salt",
        "4 large egg yolks",
        "Special equipment: a 1 1/4-inch round cookie cutter; a pastry bag fitted with small plain tip or a heavy-duty sealable plastic bag (not pleated)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Egg",
        "Bake",
        "Easter",
        "Lemon",
        "Spring",
        "Gourmet"
    ],
    "title": "Petite Lemon Curd Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/petite-lemon-curd-cookies-108921"
}
