{
    "directions": [
        "Poke the whole clove into the onion, and place onion into a large soup pot. Stir in water, white wine, celery, garlic, thyme, parsley, salt, and black pepper; bring the mixture to a boil over medium heat. Place the chicken pieces and carrots into the liquid, cover, and simmer for 20 minutes. Remove the chicken pieces to a bowl; strain the stock and reserve about 2 cups. Discard vegetables and herbs.",
        "Sprinkle the chicken pieces with flour. Melt butter in a large skillet over medium heat, and pan-fry the chicken until golden brown, about 5 minutes per side. Remove chicken pieces; place mushrooms into the skillet, and cook, stirring occasionally, until the mushrooms have just started to brown, about 10 minutes.",
        "Return chicken to skillet; pour in enough stock to barely cover the chicken and mushrooms (about 2 cups); cover and simmer for 20 minutes. Remove chicken and mushrooms to a serving dish. Boil the remaining liquid until reduced by half, stirring constantly, about 10 minutes.",
        "In a bowl, whisk together the egg yolk, lemon juice, and cream; remove the skillet from the heat, and gradually whisk the egg yolk mixture into the reduced stock until the sauce thickens. Whisk in tarragon. Serve sauce over the chicken and mushrooms."
    ],
    "ingredients": [
        "1 whole onion",
        "1 whole clove",
        "6 cups water",
        "7 fluid ounces white wine",
        "1 stalk celery, cut into chunks",
        "1 clove garlic",
        "1 sprig fresh thyme",
        "1 sprig fresh parsley",
        "salt and ground black pepper to taste",
        "1 (3 pound) whole chicken, cut into 8 pieces",
        "2 carrots, cut into chunks",
        "2 tablespoons all-purpose flour",
        "2 1/2 ounces butter",
        "4 1/2 ounces fresh mushrooms, trimmed and halved",
        "1 egg yolk",
        "1 lemon, juiced",
        "3 tablespoons heavy cream",
        "1 sprig fresh tarragon leaves, finely chopped"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Petite Blanquette de Poulet a l'Estragon (Tarragon Chicken)",
    "url": "http://allrecipes.com/recipe/216653/petite-blanquette-de-poulet-a-lestra/"
}
