{
    "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 10x15 inch jellyroll pan.",
        "In a large bowl, beat the eggs and egg yolks using an electric mixer. Add sugar, and beat until thick and pale, about 10 minutes. If you have a stand mixer, use the whisk attachment. Sift the flour and baking powder into the egg mixture, and fold in by hand along with the milk. Stir just until the batter is mixed, then fold in the melted butter until smooth. Spread the batter evenly in the prepared pan.",
        "Bake for 12 to 15 minutes in the preheated oven, or until a toothpick inserted into the center comes out clean. When finished, invert the cake pan onto a sheet of waxed paper, and cool completely. This will give you nice even petits fours.",
        "Cut the cooled cake into small squares, rectangles or triangles, and arrange the pieces in rows on a wire rack or glazing screen with plenty of space between rows. (See Cook's Notes for flavoring suggestions). Set the rack over a shallow pan or waxed paper to catch the drips.",
        "Spoon or pour warmed petit four icing over the small cakes. The drippings may be scraped off of the pan or paper, and reheated for use again. Allow the petits fours to set until completely dry. Lift the cakes from the rack with a metal spatula, and trim the bottom edges with a sharp knife. Set into small muffin papers for easy handling. Decorate as desired."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=4272&h=2237&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3210788.jpg",
    "ingredients": [
        "2  eggs",
        "2  egg yolks",
        "1 cup sugar",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "½ cup milk",
        "5 tablespoons butter, melted",
        "2 cups Frosting for Petits Fours"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Petits Fours",
    "url": "http://allrecipes.com/recipe/73798/petits-fours/"
}