{
    "directions": [
        "Place the apples into a small saucepan with the water, thyme, sugar, and salt. Bring to a boil over high heat, then reduce the heat to medium and simmer until the apples have softened and cooked down to a chunky applesauce, about 15 minutes. Remove the applesauce from the heat and stir in the breadcrumbs.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Prepare the pheasant breasts to be stuffed by cutting a pocket horizontally into each breast. Spoon the apple and bread crumb stuffing into each breast. Wrap each breast with two strips of bacon and place them into a baking dish with the chopped onion. Pour the chicken stock over the pheasant breasts and season with salt and pepper.",
        "Roast the pheasant breasts in the preheated oven until well done and the juices from the meat run clear, 30 to 35 minutes.",
        "Remove the breasts from the baking dish and cover with aluminum foil. Pour the juices from the baking dish into a small saucepan with the cider vinegar and prunes; bring to a boil over high heat. Stir in the cream and continue to boil until thickened.",
        "Slice the breasts diagonally and fan out on the serving platter, spoon the prune sauce over the slices to serve."
    ],
    "ingredients": [
        "3 apples - peeled, cored and chopped",
        "1/4 cup water",
        "1 tablespoon chopped fresh thyme",
        "2 tablespoons white sugar",
        "salt and ground black pepper to taste",
        "1 cup bread crumbs",
        "3/4 cup chicken stock",
        "4 boneless, skinless pheasant breast halves",
        "8 bacon strips",
        "1 cup onion, finely chopped",
        "3/4 cup apple cider vinegar",
        "1 (16 ounce) can pitted prunes, chopped",
        "3/4 cup heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pheasant Breast Stuffed with Apples in a Cider Vinegar and Prune Sauce",
    "url": "http://allrecipes.com/recipe/101840/pheasant-breast-stuffed-with-apples-i/"
}
