{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Bring broth to a boil in a pot; add pheasant, carrots, and celery and boil until pheasant is cooked through, about 15 minutes. Add peas to broth and boil for 1 minute. Drain and reserve broth from pot.",
        "Melt butter in a separate pot over medium heat; cook and stir onion until translucent, about 5 minutes. Gradually stir flour into butter until smooth. Pour reserved broth and milk into flour mixture, stirring constantly. Add salt, rosemary, pepper, sage, and celery seed to broth mixture and simmer over medium-low heat until sauce is thickened, about 5 minutes.",
        "Lower oven temperature to 375 degrees F (190 degrees C).",
        "Press 1 pie crust into a pie plate and lightly brush with egg white.",
        "Bake crust in the oven until lightly browned, about 5 minutes.",
        "Spoon about 1/4 of the pheasant-vegetable mixture into the baked pie crust. Mix remaining pheasant-vegetable mixture into the sauce; pour into baked pie crust. Place second crust on top of the filling, pinching the edges together to form a seal. Cut your initials into the top crust for ventilation.",
        "Bake in the oven until top is golden brown, about 40 minutes."
    ],
    "ingredients": [
        "2 cups chicken broth",
        "1 pound pheasant, cut into bite-size pieces",
        "1 cup chopped carrots",
        "1/2 cup chopped celery",
        "1 (15 ounce) can peas, drained",
        "1/3 cup salted butter",
        "1/2 yellow onion, chopped",
        "1/3 cup all-purpose flour",
        "2/3 cup milk",
        "1 teaspoon salt",
        "1 teaspoon dried rosemary",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon dried sage",
        "1/2 teaspoon ground celery seed",
        "2 9-inch refrigerated pie crusts",
        "1 egg white, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pheasant Pot Pie",
    "url": "http://allrecipes.com/recipe/240764/pheasant-pot-pie/"
}
