{
    "directions": [
        "Whisk beer, extra-virgin olive oil, garlic, 2 dashes Worcestershire sauce, thyme, red pepper flakes, salt, and black pepper together in a bowl and pour into a resealable plastic bag. Add steak, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator, 8 hours to overnight.",
        "Remove steak from the marinade and shake off excess. Discard the remaining marinade.",
        "Preheat an outdoor grill for medium-high heat and lightly oil the grate. Preheat oven to 350 degrees F (175 degrees C).",
        "Cook steaks on the preheated grill until firm and reddish-pink and juicy in the center, 3 to 4 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Let steak rest; cut into 1x1/2-inch strips.",
        "Place squash, cut-side down, on a rimmed baking sheet. Pour enough water into baking sheet to reach 1/4-inch up the side of squash.",
        "Bake in the preheated oven until squash is tender, about 30 minutes. Remove from baking sheet and cool until easily handled. Scoop and discard seeds and shred the squash meat into a bowl using a fork.",
        "Mix egg into shredded squash. Whisk 1/4 cup flour, garlic powder, onion powder, salt, and black pepper in a separate bowl; mix into squash mixture.",
        "Heat olive oil in a large skillet over medium heat; cook and stir onion, red bell pepper, and yellow bell pepper until beginning to brown, 5 to 10 minutes. Add broth, 4 dashes Worcestershire sauce, and thyme; bring to a simmer. Slowly stir 1 tablespoon flour into mixture until thickened, adding more flour if needed. Stir steak into mixture and remove from heat.",
        "Spray a 9-inch square casserole dish with cooking spray. Add beef mixture to dish and carefully spread squash mixture over steak.",
        "Bake in the oven for 30 minutes. Sprinkle Swiss cheese over squash layer. Increase temperature to 425 degrees F (220 degrees C) and cook until cheese begins to brown, checking every 5 minutes, about 15 minutes."
    ],
    "ingredients": [
        "Marinade:",
        "1 cup light beer",
        "1/4 cup extra-virgin olive oil",
        "2 cloves garlic, minced",
        "2 dashes Worcestershire sauce",
        "2 sprigs fresh thyme",
        "1 pinch red pepper flakes",
        "salt and ground black pepper to taste",
        "1 1/2 pounds round steak",
        "1 small spaghetti squash, halved lengthwise",
        "1 egg, beaten",
        "1/4 cup all-purpose flour",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "1 tablespoon olive oil, or as needed",
        "1 large yellow onion, halved and cut into 1/4-inch-thick slices",
        "1/2 large red bell pepper, roughly chopped",
        "1/2 large yellow bell pepper, roughly chopped",
        "1 1/2 cups low-sodium beef broth",
        "4 dashes Worcestershire sauce",
        "1 sprig fresh thyme",
        "1 tablespoon all-purpose flour, or more as needed",
        "cooking spray",
        "3 ounces shredded Swiss cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Philly-Cheesesteak Shepherd's Pie with Spaghetti Squash Topping",
    "url": "http://allrecipes.com/recipe/244807/philly-cheesesteak-shepherds-pie-wit/"
}
