{
    "directions": [
        "Heat a medium saucepan over medium high heat. Add 1 tablespoon extra-virgin olive oil, 1 turn of the pan. Add onions and season with salt and pepper or steak seasoning blend. Cook onions, stirring occasionally, 10 minutes or until onions are soft and caramel in color.",
        "Heat a heavy griddle pan over medium high to high heat. Wipe griddle with a drizzle of oil using a paper towel. Sear and cook thin sliced steaks until brown but not crisp, about 2 minutes on each side. Cook steaks in single layers in 2 batches and tenderize by cutting into meat with the side of your spatula while they cook. When the steaks are browned, just before you remove them from heat, sprinkle them with garlic salt and pepper. When all of the steaks are cooked, line each of your split rolls with 2 slices of provolone cheese. Pile 1/4 of your meat and onions on to the griddle and mix together with your spatula. Pile the meat and onions into rolls on top of the cheese. The heat from the meat and onions will melt the cheese. Repeat for remaining servings and serve."
    ],
    "ingredients": [
        "1 tablespoon extra-virgin olive oil, 1 turn of the pan",
        "2 large yellow skinned onions, sliced very thin",
        "Coarse salt and pepper or steak seasoning blend",
        "2 teaspoons extra-virgin olive oil, 2 drizzles",
        "1 1/2 pounds lean beef tenderloin or sirloin, ask butcher to slice the meat very thin",
        "1 teaspoon garlic salt",
        "Freshly ground black pepper",
        "8 slices provolone cheese, from the deli counter",
        "4 soft Italian sandwich hogie rolls, split 6 to 8 inches long each, split lengthwise"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "American",
        "Sandwich",
        "Cheese",
        "Provolone Recipes",
        "Meat",
        "Beef"
    ],
    "title": "Philly Steak Sandwiches",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/philly-steak-sandwiches-recipe"
}
