{
    "directions": [
        "Form 2 teaspoons cheese into 1-inch-long log. Place 4 dried figs around cheese and press gently to adhere. Wrap 1 prosciutto strip around fig bundle. Repeat with remaining cheese, figs, and prosciutto.",
        "Place 1 phyllo sheet on work surface (keep remaining phyllo covered with plastic wrap and damp towel). Brush phyllo lightly with melted butter. Top with second phyllo sheet; brush with butter. Repeat with 2 more phyllo sheets. Cut stacked phyllo sheets into four 6-inch squares (discard phyllo trimmings). Place 1 fig bundle in center of 1 phyllo square stack. Bring all edges of phyllo square up toward center and squeeze firmly at top, forming pouch and enclosing fig bundle completely. Place on baking sheet. Repeat with remaining phyllo sheets, melted butter, and fig bundles, forming a total of 8 pouches. Brush outside of phyllo pouches with remaining melted butter. (Can be made 6 hours ahead. Cover and refrigerate.) Preheat oven to 375°F. Bake pouches until golden, about 17 minutes.",
        "Meanwhile, bring Port, balsamic vinegar, and sugar to boil in medium saucepan. Boil until mixture is reduced to 1/4 cup, about 15 minutes.",
        "While Port mixture is being reduced, boil cream and pine nuts in another medium saucepan until reduced to 1 cup, about 8 minutes. Remove cream sauce from heat; season sauce to taste with salt and pepper.",
        "Spoon 2 tablespoons cream sauce onto each of 8 plates. Place 1 phyllo pouch atop sauce. Drizzle each lightly with Port sauce and serve."
    ],
    "ingredients": [
        "16 teaspoons Stilton cheese (about 4 ounces)",
        "32 dried black Mission figs",
        "4 6x4-inch thin prosciutto slices, cut lengthwise in half",
        "8 sheets fresh phyllo pastry or frozen, thawed",
        "3/4 cup (1 1/2 sticks) unsalted butter, melted",
        "2 cups ruby Port",
        "1/4 cup balsamic vinegar",
        "2 tablespoons sugar",
        "1 1/2 cups whipping cream",
        "4 1/2 tablespoons pine nuts, toasted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Fruit",
        "Pork",
        "Appetizer",
        "Bake",
        "Cocktail Party",
        "Blue Cheese",
        "Fig",
        "Pine Nut",
        "Port",
        "Winter",
        "Prosciutto",
        "Phyllo/Puff Pastry Dough",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Phyllo-Wrapped Figs with Prosciutto and Stilton",
    "url": "http://www.epicurious.com/recipes/food/views/phyllo-wrapped-figs-with-prosciutto-and-stilton-107465"
}
