{
    "directions": [
        "Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Add bell peppers and leek and sauté until leek is tender, about 6 minutes. Add wine and crushed red pepper to skillet. Simmer until liquid evaporates, about 4 minutes. Remove skillet from heat. Cool vegetable mixture. Stir in basil and salt.",
        "Preheat oven to 400°F. Melt remaining 6 tablespoons butter in small saucepan. Place 1 pastry sheet on work surface (keep remaining phyllo sheets covered). Brush with some of melted butter. Top with second pastry sheet; brush with melted butter. Place 1 salmon fillet crosswise on pastry sheet, 5 inches in from 1 short end. Top salmon fillet with 1/4 cup of vegetable mixture. Fold 5-inch section of pastry over salmon. Fold in sides. Roll up, forming rectangular packet. Transfer to heavy large baking sheet, vegetable side up. Brush packet all over with melted butter. Repeat with remaining pastry sheets, melted butter, salmon fillets and vegetables. (Can be prepared 6 hours ahead. Cover with plastic wrap and refrigerate.)",
        "Bake salmon until pastry is pale golden and salmon is cooked through, about 35 minutes."
    ],
    "ingredients": [
        "8 tablespoons (1 stick) butter",
        "4 cups matchstick-size strips red bell peppers (about 2 large)",
        "2 cups matchstick-size strips leek (white and pale green parts only; about 1 large)",
        "1/2 cup dry white wine",
        "1 teaspoon dried crushed red pepper",
        "1/2 cup thinly sliced fresh basil",
        "1 teaspoon salt",
        "12 sheets fresh phyllo pastry or frozen, thawed",
        "6 5-ounce 6x2x1-inch skinless salmon fillets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fish",
        "Pepper",
        "Vegetable",
        "Bake",
        "Dinner",
        "Seafood",
        "Salmon",
        "Leek",
        "Bell Pepper",
        "Fall",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Phyllo-Wrapped Salmon with Leeks and Red Bell Pepper",
    "url": "http://www.epicurious.com/recipes/food/views/phyllo-wrapped-salmon-with-leeks-and-red-bell-pepper-4698"
}
