{
    "directions": [
        "Combine all ingredients except almonds in heavy large saucepan. Bring to boil over medium-high heat, stirring until sugar dissolves. Reduce heat to medium-low; simmer until most liquid has evaporated and chutney is thick, stirring occasionally, about 25 minutes. Mix in almonds. Transfer chutney to bowl.",
        "Chill until cold, about 3 hours. (Can be made 1 week ahead. Cover, keep chilled.)",
        "Brush heavy large baking sheet with butter; set aside. Unroll pastry. Cover with plastic wrap and damp kitchen towel. Transfer 2 stacked phyllo sheets to work surface, arranging 1 short side parallel to edge of work surface. Arrange 2 more stacked phyllo sheets on work surface, overlapping long side of first sheets by about 5 to 7 inches and forming rectangle about 18 by 17 inches. Brush pastry with butter; sprinkle 1 1/2 tablespoons rosemary over. Place 2 more stacked sheets atop first set of 2 sheets, then 2 more stacked sheets atop second set of 2 sheets. Brush with butter and sprinkle with 1 1/2 tablespoons rosemary. Repeat layering 1 more time with phyllo, butter and 1 1/2 tablespoons rosemary. (You will use a total of 12 sheets.)",
        "Using sharp knife or scissors, trim phyllo corners, forming approximately 17-inch oval. place Brie in center of phyllo. Spread 1 1/2 cups chutney evenly over cheese. Slide hand under 1 rounded corner of phyllo. Lift phyllo and fold onto top of cheese. Brush folded pastry with butter. Continue to lift phyllo in sections and to fold snugly over top of cheese, brushing with butter and pressing each section to adhere until cheese is wrapped (the top center 2 to 3 inches of cheese will not be covered). Use hand and metal spatula to transfer wrapped cheese to prepared baking sheet.",
        "Place 1 phyllo sheet on work surface. Brush with butter. Starting at 1 long side, fold 1 inch of pastry over. Continue folding pastry loosely over itself, forming 1-inch-wide strip of pastry over. Continue folding pastry loosely over itself, forming 1-inch-wide strip of pastry. Roll up strip into coil. Gather bottom edge of coil together, pinching to force top slightly open and forming rose. Place rose atop uncovered center of cheese. Brush with butter. Repeat with 2 more sheets of phyllo, forming 2 more roses. Place atop cheese, covering opening completely. Chill 3 hours. (Can be made 1 day ahead. Cover with plastic; keep chilled.)",
        "Position rack in center of oven and preheat to 400°F. Bake cheese until pastry is deep golden brown, covering roses loosely with foil if browning too quickly, about 25 minutes. (If cheese leaks from pastry during baking, press piece of foil over tear in pastry; continue baking.)",
        "Cool cheese on sheet 45 minutes.",
        "Using metal spatula, transfer warm cheese to large platter. Arrange herbs, dried fruit, baguette slices and apple slices around cheese. Cut cheese into wedges."
    ],
    "ingredients": [
        "12 ounces dried apricots, chopped",
        "1 large red onion, chopped",
        "1 cup water",
        "2/3 cup cider vinegar",
        "2/3 cup (packed) golden brown sugar",
        "3 ounces dried tart cherries (3/4 cup)",
        "1 1/2 tablespoons chopped fresh rosemary",
        "3 large garlic cloves, finely chopped",
        "2 teaspoons grated lemon peel",
        "1/2 teaspoon salt",
        "1/8 teaspoon cayenne pepper",
        "1/2 cup blanched slivered almonds, toasted",
        "1 cup (2 sticks) unsalted butter, melted",
        "1 pound fresh phyllo pastry sheets or frozen, thawed",
        "4 1/2 tablespoons chopped fresh rosemary",
        "1 32- to 36-ounce wheel of Brie",
        "Fresh herb sprigs (such as rosemary, sage,a and chives)",
        "Additional dried apricots and dried cherries",
        "Fresh baguettes, thinly sliced",
        "Thinly sliced apples"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Bake",
        "Cocktail Party",
        "Vegetarian",
        "Oscars",
        "New Year's Eve",
        "Buffet",
        "Brie",
        "Dried Fruit",
        "Apricot",
        "Cherry",
        "Rosemary",
        "Almond",
        "Winter"
    ],
    "title": "Phyllo-Wrapped Brie with Apricot and Rosemary Chutney",
    "url": "http://www.epicurious.com/recipes/food/views/phyllo-wrapped-brie-with-apricot-and-rosemary-chutney-1173"
}
