{
    "directions": [
        "Preheat oven to 400°F. Toss tomatoes, olive oil, salt, and oregano in medium bowl. Scatter tomatoes on large rimmed baking sheet; roast until soft and beginning to collapse, about 22 minutes. Remove from oven and let tomato mixture cool. Maintain oven temperature.",
        "Place stack of phyllo sheets on work surface and cover with plastic wrap, then damp kitchen towel to prevent drying.",
        "Brush another large rimmed baking sheet with some of melted butter. Place 1 phyllo sheet on baking sheet. Brush lightly with melted butter and top with second phyllo sheet. Brush with butter and top with third sheet; brush with butter. Sprinkle with 1 tablespoon Parmesan. Repeat 3 more times for total of 12 phyllo sheets and 4 tablespoons Parmesan. Sprinkle stacked phyllo sheets with grated mozzarella, leaving 1/2-inch plain border. Top with roasted tomatoes, pepper strips, and olives.",
        "Bake pizza until phyllo is crisp, 25 to 27 minutes. Sprinkle 2 teaspoons fresh oregano over, loosen pizza from sheet with large metal spatula, and slide onto cutting board.",
        "*Also called mozzarella affumicata; sold at some specialty foods stores and at cheese shops. If unavailable, use regular (not fresh) whole-milk mozzarella."
    ],
    "ingredients": [
        "12 to 13 ounces cherry tomatoes and/or pear tomatoes",
        "1 tablespoon extra-virgin olive oil",
        "3/4 teaspoon coarse kosher salt",
        "1/2 teaspoon dried oregano",
        "12 12x9-inch sheets fresh phyllo pastry or frozen, thawed",
        "6 tablespoons (3/4 stick) unsalted butter, melted",
        "4 tablespoons finely grated Parmesan cheese, divided",
        "3/4 cup (packed) coarsely grated smoked mozzarella cheese* (about 3 ounces)",
        "1/2 yellow bell pepper, cut into thin strips",
        "1/4 cup quartered pitted Kalamata olives",
        "2 teaspoons coarsely chopped fresh oregano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Tomato",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Backyard BBQ",
        "Dinner",
        "Mozzarella",
        "Summer",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Phyllo Pizza with Smoked Mozzarella and Cherry Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/phyllo-pizza-with-smoked-mozzarella-and-cherry-tomatoes-359570"
}
