{
    "directions": [
        "In a medium mixing bowl, blend the cheese, egg, and cilantro with a fork.",
        "On a clean, flat work surface, unroll the phyllo sheets. Cut into strips about 3 in/7.5 cm wide and at least 9 in/23 cm long. Arrange a couple of the strips facing away from you; cover the remaining strips with plastic wrap to keep them from drying out. Lightly brush the strips with olive oil.",
        "Place 1 Tbsp of the cheese filling on the end of each strip closest to you. Fold over to form a triangle, then fold again to form another triangle, and so on to the end. Brush the end of the triangle with egg yolk and fold the loose end over the brushed yolk. Place the triangles on a plate without letting them touch. Repeat with the remaining phyllo strips and cheese filling.",
        "Have ready 6 dessert plates. Place a generous dollop of honey in the middle of each.",
        "In a large skillet or sauté pan, heat at least 1/2 in/1.25 cm of oil until the surface shimmers. Reduce the heat to medium. Working in small batches, gently place the phyllo triangles in the oil and fry, turning once, until firm and golden brown, 30 seconds to 1 minute. Transfer with a slotted spoon to paper towels to drain.",
        "Place 2 or 3 rolls on each plate, drizzle with honey, and sprinkle with sesame seeds. Serve hot."
    ],
    "ingredients": [
        "1/2 lb/225 g ricotta, fresh semisoft farmer's cheese, or Mexican queso fresco",
        "1 large egg",
        "Heaped 1 Tbsp finely chopped fresh cilantro",
        "4 sheets phyllo dough or warqa, plus more in case of breakage",
        "Olive oil for brushing",
        "1 egg yolk, whisked",
        "Honey",
        "Light olive oil or vegetable oil for frying",
        "1 Tbsp toasted sesame seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Appetizer",
        "Fry",
        "Ramadan",
        "Ricotta",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Phyllo Triangles Stuffed with Fresh Cheese (_briouats bil jben_)",
    "url": "http://www.epicurious.com/recipes/food/views/phyllo-triangles-stuffed-with-fresh-cheese-em-briouats-bil-jben-em-51173810"
}
