{
    "directions": [
        "Without unrolling phyllo log, cut 2 (3/8-inch-thick) slices crosswise from one end of log and thaw slices 5 minutes. (Save remaining frozen phyllo for another use.)",
        "Preheat oven to 375°F.",
        "Lightly brush a baking sheet with some of melted butter.",
        "Carefully unfurl slices from phyllo rolls on a work surface, discarding any plastic or paper rolled within. Gently separate strands, keeping them parallel, then gather into 4 groups, about 14 strands each. Cover 3 groups with plastic wrap. Gently hold one end of remaining (uncovered) group of strands and brush with some of melted butter, then dust with 1/2 teaspoon confectioners sugar using a fine-mesh sieve. Flip over and brush other side with butter and dust with confectioners sugar in same manner. Loosely coil up coated strands to form a small nest and put on baking sheet. Repeat with remaining clusters to form 3 more nests.",
        "Bake nests in middle of oven until golden, 8 to 10 minutes. Cool nests on sheet on a rack, 8 to 10 minutes.",
        "Beat cream with granulated sugar in a bowl with an electric mixer until it just holds soft peaks. Drizzle each phyllo nest all over with 1/4 teaspoon honey and put 1 tablespoon whipped cream in center. Top with strawberries and remaining cream, then drizzle each dessert with 1/4 teaspoon more honey."
    ],
    "ingredients": [
        "1 (1-pound) package frozen phyllo (not thawed)",
        "2 tablespoons unsalted butter, melted",
        "4 teaspoons confectioners sugar",
        "1/2 cup chilled heavy cream",
        "1/2 tablespoon granulated sugar",
        "2 teaspoons honey",
        "8 strawberries, cut into 1/4-inch slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Berry",
        "Dessert",
        "Bake",
        "Quick & Easy",
        "Strawberry",
        "Summer",
        "Honey",
        "Phyllo/Puff Pastry Dough",
        "Pastry",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Phyllo Nests with Strawberries and Honey",
    "url": "http://www.epicurious.com/recipes/food/views/phyllo-nests-with-strawberries-and-honey-108131"
}
