{
    "directions": [
        "In the large bowl of an electric mixer proof the yeast with the sugar in 1/4 cup of the milk for 5 minutes, or until the mixture is foamy. Beat in the remaining 1/4 cup milk, the whole egg, the egg yolk, the sour cream, and the butter, add 2 cups of the flour, the cornmeal, and the salt, and beat the mixture until it forms a dough. With the dough hook knead the dough, adding as much of the remaining 1/2 cup flour as necessary to keep the dough from sticking, for 4 minutes, or until it is smooth and elastic. Form the dough into a ball, transfer it to an oiled bowl, and turn it to coat it with the oil. Let the dough rise, covered with plastic wrap, in a warm place for 1 1/2 hours and punch it down. (The dough may be made 1 day in advance and kept covered and chilled. Let the dough return to room temperature before proceeding with the recipe.)",
        "In a large heavy skillet cook the onion, the garlic, the jalapeños, the cumin, the chili powder, the oregano, the cinnamon, the cloves, and pepper to taste in the oil over moderately low heat, stirring, until the onion is softened, add the chuck, and cook the mixture over moderately high heat, stirring and breaking up any lumps, until the meat is no longer pink. Add the tomato paste, the tomatoes with the juice, the raisins, the olives, the red pepper flakes, and salt and pepper to taste, simmer the picadillo, stirring occasionally, for 10 to 15 minutes, or until it is thickened and most of the liquid is evaporated, and let it cool. (The picadillo may be made 1 day in advance and kept covered and chilled. Let the picadillo return to room temperature before proceeding with the recipe.)",
        "Divide the dough into 12 pieces. Working with 1 piece of dough at a time and keeping the remaining pieces covered with plastic wrap, on a lightly floured surface roll out the dough 1/8 inch thick and with a 6-inch round cutter cut each piece into a round. Put about 1/3 cup of the picadillo onto the bottom two thirds of each round and fold the rounds in half, enclosing the filling. Seal the edges of the dough and crimp them decoratively. Transfer the empanadas with a spatula to a lightly oiled baking sheet and bake them in the middle of a preheated 450°F. oven for 10 to 15 minutes, or until they are golden. Transfer the empanadas to a rack and let them cool."
    ],
    "ingredients": [
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "1 1/2 tablespoons sugar",
        "1/2 cup milk, heated to lukewarm",
        "1 large whole egg, beaten lightly",
        "1 large egg yolk, beaten lightly",
        "1/3 cup sour cream",
        "5 tablespoons unsalted butter, melted and cooled",
        "2 1/2 cups all-purpose flour",
        "1 1/4 cups yellow cornmeal",
        "3/4 teaspoons salt",
        "1 1/4 cups finely chopped onion",
        "2 teaspoons minced garlic",
        "2 drained bottled pickled large jalapeño chilies, seeded and minced (wear rubber gloves), about 1 1/2 tablespoons",
        "2 teaspoons ground cumin",
        "1 tablespoon chili powder",
        "1 teaspoon crumbled dried oregano",
        "1/2 teaspoon cinnamon",
        "a pinch of ground cloves",
        "2 tablespoons vegetable oil",
        "1 pound ground chuck",
        "1/4 cup tomato paste",
        "a 28-ounce can plum tomatoes including the juice, chopped",
        "1/3 cup raisins",
        "1/2 cup plus 2 tablespoons finely chopped pimiento-stuff green olives (about 4 1/2 ounces)",
        "dried hot red pepper flakes to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Bake",
        "Kid-Friendly",
        "Cinco de Mayo",
        "Back to School",
        "Ground Beef",
        "Cornmeal",
        "Chill",
        "Jalapeño",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Picadillo Empañadas with Cornmeal Crust",
    "url": "http://www.epicurious.com/recipes/food/views/picadillo-empanadas-with-cornmeal-crust-12750"
}
