{
    "directions": [
        "Preheat the oven to 400 degrees F.",
        "For the picadillo: Heat the oil in a large heavy skillet over medium-high heat. Add the ground beef and cook until browned, about 7 minutes. Add the olives, carrots, onions, raisins and 1 teaspoon salt and mix well to combine. Add the crushed tomatoes, bring to a simmer and simmer until the flavors are incorporated, about 10 minutes. Adjust the seasoning to taste with salt and pepper. Turn off the heat and set aside.",
        "For the bell peppers: In a small bowl, stir together the mozzarella, panko and cilantro. Season with salt and pepper.",
        "Put the bell pepper halves cut-side up on a baking sheet and season each with a pinch of salt. Use a large spoon to divide the picadillo evenly among the peppers. Bake until the filling is hot in the center and the peppers are tender, about 20 minutes.",
        "Remove the peppers from the oven and turn the broiler to high. Sprinkle the peppers with the panko and cheese mixture and broil until golden brown, 5 to 10 minutes."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "12 ounces ground beef",
        "1 cup green olives with pimientos, roughly chopped",
        "1/2 cup finely diced carrots",
        "1/2 cup finely diced onions",
        "1/2 cup raisins",
        "Salt and freshly ground black pepper",
        "One 14-ounce can crushed tomatoes",
        "1 1/2 cups shredded mozzarella cheese",
        "3/4 cup panko breadcrumbs",
        "1 tablespoon chopped fresh cilantro",
        "Salt and freshly ground black pepper",
        "1 green bell pepper, halved lengthwise and seeded",
        "1 orange bell pepper, halved lengthwise and seeded",
        "1 red bell pepper, halved lengthwise and seeded"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Bell Peppers",
        "Vegetable",
        "Meat",
        "Tomato",
        "Main Dish Recipes"
    ],
    "title": "Picadillo Stuffed Peppers",
    "url": "http://www.foodnetwork.com/recipes/marcela-valladolid/picadillo-stuffed-peppers"
}
