{
    "directions": [
        "Preheat oven to 350° F. Spray large rimmed baking sheet with nonstick cooking spray. Spread carrots on sheet, then very lightly spray carrots. Roast until tender, 30 to 40 minutes. Let cool.",
        "In dry skillet over moderate heat, toast pine nuts, stirring constantly, until fragrant and light golden brown, 2 to 3 minutes. Immediately transfer to plate and let cool.",
        "In small bowl, toss jicama with lemon or lime juice, chile powder, and cayenne, if using.",
        "To serve, divide mixed baby greens among 4 salad plates and top each with 4 carrots. Mound 1/3 cup jicama atop each portion. Sprinkle each salad with 2 tablespoons pine nuts and garnish each plate with 2 endive, radicchio, or red-leaf lettuce leaves; 2 orange slices; and 2 fig halves, if using. Drizzle 1 tablespoon basil dressing over each salad and serve immediately."
    ],
    "ingredients": [
        "nonstick cooking spray",
        "16 small carrots, trimmed, or 8 large carrots, peeled and cut into 3-inch pieces",
        "1/2 cup (2 1/2 ounces) pine nuts",
        "1 small jicama*, peeled and cut into 1/8-inch matchsticks (about 1 1/3 cups)",
        "2 tablespoons plus 2 teaspoons freshly squeezed lime or lemon juice (from about 1 medium lemon or 2 medium limes)",
        "2 teaspoons mild chile powder",
        "1/8 teaspoon ground cayenne pepper (optional)",
        "4 cups mixed baby greens",
        "8 leaves Belgian endive, radicchio, or red leaf lettuce (from 1 head)",
        "8 orange slices, peeled and seeded",
        "4 fresh figs, sliced in half (optional)",
        "1/4 cup creamy basil dressing",
        "*Use a paring knife, rather than a peeler, to peel the jicama, and be sure to remove the tough, fibrous flesh just below the skin."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Fruit",
        "Nut",
        "Vegetable",
        "Roast",
        "Vegetarian",
        "Basil",
        "Carrot",
        "Healthy"
    ],
    "title": "Picante Jícama and Roasted Carrot Salad with Creamy Basil Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/picante-jicama-and-roasted-carrot-salad-with-creamy-basil-dressing-236644"
}
