{
    "directions": [
        "In a large heavy skillet cook the onion and the garlic in the oil over moderately low heat, stirring, until the onion is softened, add the pork, and cook the mixture over moderate heat, stirring and breaking up any lumps, until the pork is no longer pink. Pour off any excess fat, add the raisins, the tomato sauce, the olives, the cinnamon, the cloves, and salt and pepper to taste, and simmer the mixture, stirring occasionally, for 10 to 15 minutes, or until it is thickened. The picadillo may be made 1 day in advance, kept covered and chilled, and reheated before proceeding.",
        "In a skillet heat 1/4 inch of the oil over moderately high heat until it is hot but not smoking, in it fry the tortillas, 1 at a time, for 30 seconds to 1 minute, or until they are crisp and golden, and transfer them with tongs as they are fried to paper towels to drain. Arrange the tostada shells in one layer on platters, divide the picadillo among them, and top it with the lettuce and the onion."
    ],
    "ingredients": [
        "1 large onion, chopped fine",
        "2 garlic cloves, minced",
        "2 tablespoon vegetable oil",
        "2 pounds ground pork",
        "1/3 cups raisins",
        "1 1/2 cups tomato sauce",
        "1/2 cup sliced pimiento-stuffed green olives",
        "3/4 teaspoon cinnamon",
        "1/4 teaspoon ground cloves",
        "vegetable oil for frying the tortillas",
        "twelve 7-inch corn tortillas",
        "3 cups shredded romaine or iceberg lettuce",
        "1 1/2 cups thinly sliced red onion or coarsely grated radishes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Pork",
        "Tomato",
        "Fry",
        "Quick & Easy",
        "Lunch",
        "Raisin",
        "Winter",
        "Cinnamon",
        "Tortillas",
        "Lettuce",
        "Simmer",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Picadillo Tostadas",
    "url": "http://www.epicurious.com/recipes/food/views/picadillo-tostadas-13574"
}
