{
    "directions": [
        "To prepare the pickle, combine the vinegar, 3 cups of water, sugar, coriander seeds, mustard seeds, shallot, garlic, and cilantro in a small saucepan. Bring the pickling liquid to a boil over medium-high heat, reduce to a simmer, and allow the contents to cook for 5 minutes. Remove the pot from the heat and let it cool completely.",
        "Place the feta in a large mixing bowl or divide it between two 1-quart jars, and pour the cool pickling solution over the cheese. Make sure all of the feta is completely submerged. (If you use quart jars, you will have a little bit of extra brine left over, which you can use for a salad dressing.) Cover the feta and refrigerate it for at least five days.",
        "To prepare the salad, remove the pickled feta from the liquid and drain it on paper towels. In a salad bowl, toss together the olives, strawberries, olive oil, chopped cilantro, and spinach. Stir in the feta, then season with salt and pepper, if desired."
    ],
    "ingredients": [
        "3 cups Champagne vinegar or white balsamic vinegar",
        "1/2 cup granulated sugar",
        "2 tablespoons coriander seeds",
        "2 tablespoons mustard seeds",
        "1 medium shallot, sliced",
        "4 whole garlic cloves",
        "4 sprigs cilantro",
        "2 pounds feta, diced or crumbled (roughly 6 1/2 cups)",
        "1 pound Cerignola olives (red, green, or black), pitted and cut in half",
        "1 pound fresh strawberries, hulled and cut in quarters",
        "1/4 cup extra-virgin olive oil",
        "1/4 cup cilantro, chopped",
        "12 ounces baby spinach",
        "Salt and white pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Picnic",
        "Feta",
        "Strawberry",
        "Spinach",
        "Summer",
        "Advance Prep Required"
    ],
    "title": "Pickled Feta and Cerignola Olives with Strawberries",
    "url": "http://www.epicurious.com/recipes/food/views/pickled-feta-and-cerignola-olives-with-strawberries-51186810"
}
