{
    "directions": [
        "Blanch vegetables: In a large pot of boiling, salted water, blanch carrots, fennel and zucchini until firm-tender, 1 minute. Use a slotted spoon to remove vegetables and plunge directly into an ice-water bath. Remove and dry on paper towels. In a medium bowl, toss blanched vegetables with 1 teaspoon salt. Chill in refrigerator until you are ready to assemble dish.",
        "Make pickled vegetables: In a sauté pan over medium-low heat, heat 1/2 olive oil and sweat the onion, pepper, garlic, spices and 1 teaspoon salt until soft, about 10 minutes. Stir in wine, vinegar and thyme. Remove from heat and let stand 15 minutes.",
        "Meanwhile, bring salted water to a boil in a large pot, then turn off heat. Stir in shrimp and let cook until firm but still slightly translucent in the center, 1-2 minutes depending on size of shrimp. Place cooked shrimp in a nonreactive dish and sprinkle with remaining 1 teaspoon salt. Then pour pickled vegetable mixture over shrimp.",
        "Cover with plastic wrap and refrigerate at least 4 hours or overnight. Before serving, stir in blanched vegetables and remaining 1/2 cup olive oil. Adjust seasoning, adding more salt and vinegar if needed. Garnish with parsley."
    ],
    "ingredients": [
        "1 medium carrot, cut into thin rounds",
        "1 medium bulb fennel, thinly sliced",
        "1 medium zucchini, cut into half moons",
        "3 teaspoons kosher salt, divided, plus more for blanching",
        "1 red onion, julienned",
        "1 red bell pepper, julienned",
        "5 cloves garlic, thinly sliced",
        "2 teaspoons whole coriander",
        "2 teaspoons cumin seeds",
        "1 teaspoon caraway seed",
        "1 teaspoon fennel seed",
        "1 cup olive oil, divided",
        "1 cup white wine",
        "1 cup white wine vinegar",
        "2 tablespoons thyme leaves",
        "2 pounds shrimp, peeled, deveined, tails removed",
        "2 tablespoons flat-leaf parsley, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Seafood",
        "Shrimp",
        "Fennel",
        "Carrot",
        "Zucchini",
        "Summer",
        "Coriander",
        "Cumin",
        "Sugar Conscious",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pickled Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/pickled-shrimp-51243030"
}
