{
    "directions": [
        "Wash jars, lids, and screw bands in hot soapy water, then rinse well. Dry screw bands. Put jars and lids on a rack in canner or pot and add enough water to cover by 2 inches. Heat water until an instant-read thermometer registers 180°F (do not let boil). Keep jars submerged in hot water, covered, until ready to use.",
        "Bring vinegar, water, sugar, and salt to a boil in a 3-quart nonreactive saucepan, stirring until sugar is dissolved. Reduce heat and simmer, uncovered, 5 minutes.",
        "Drain jars upside down on a clean kitchen towel 1 minute, then invert. Tightly pack jars with chiles and add 1 garlic clove and 1/2 teaspoon pickling spices to each jar. Fill jars with pickling liquid, leaving 1/4inch of space at top, then run a thin knife between chiles and jar to eliminate air bubbles.",
        "Wipe off rims of filled jars with a damp clean kitchen towel, then firmly screw on lids with screw bands.",
        "Put sealed jars on rack in canner or pot and add enough hot water to cover by 2 inches. Bring to a boil, covered. Boil pickles, covered, 10 minutes, then transfer jars with tongs to a kitchen towel to cool. Jars will seal as they cool. (If you hear a ping, that signals that vacuum formed at top of jar has made lid concave.)",
        "After jars have cooled 12 to 24 hours, press center of each lid to make sure that it's concave, then remove screw band and try to lift off lid with your fingertips. If you can't, lid has a good seal."
    ],
    "ingredients": [
        "4 cups distilled white vinegar",
        "1 1/3 cups water",
        "1/4 cup sugar",
        "1 1/2 teaspoons kosher or canning salt",
        "1 1/2 pounds small hot chiles (6 cups), stems trimmed to 1/4 inch",
        "7 or 8 garlic cloves",
        "3 1/2 to 4 teaspoons pickling spices",
        "Special equipment: 8 (1/2-pint) canning jars with lids and screw bands; a boiling-water canner or an 8- to 10-quart deep pot"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Side",
        "Vinegar",
        "Spice",
        "Hot Pepper",
        "Brine",
        "Edible Gift",
        "Gourmet"
    ],
    "title": "Pickled Hot Chiles",
    "url": "http://www.epicurious.com/recipes/food/views/pickled-hot-chiles-107029"
}
