{
    "directions": [
        "In a saucepan boil the onions in just enough salted water to cover for 1 minute, drain them, discarding the water, and return them to the pan with the vinegar, the garlic, the peppercorns, the coriander seeds, the cumin seeds, and the salt. Add just enough water to cover the onions and boil the mixture for 3 minutes. Transfer the onion mixture to a glass bowl and let it stand for at least 3 hours and up to 24 hours.",
        "In a dry 8-inch skillet arrange 1 of the tortillas, sprinkle it with 1/2 cup of the Monterey Jack, 1/4 cup of the pickled onions, 1 tablespoon of the minced coriander, one fourth of the scallions, and red pepper flakes to taste, and top the mixture with another tortilla. Cook the quesadilla over moderate heat for 4 minutes on each side, or until the cheese is melted and the tortilla is browned lightly. Cut the quesadilla into 8 wedges and garnish it with about 2 tablespoons of the pickled onions and a coriander sprig. Make 3 more quesadillas in the same manner with the remaining tortillas and ingredients."
    ],
    "ingredients": [
        "2 small red onions, sliced thin",
        "2/3 cup cider vinegar",
        "4 garlic cloves, halved",
        "1/2 teaspoon whole black peppercorns, crushed",
        "1/2 teaspoon coriander seeds, crushed",
        "1/2 teaspoon cumin seeds, crushed",
        "1/2 teaspoon salt",
        "eight 7-inch flour tortillas",
        "2 cups grated Monterey Jack",
        "1/4 cup minced fresh coriander plus sprigs for garnish",
        "2 scallions, minced",
        "dried hot red pepper flakes to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Appetizer",
        "Cocktail Party",
        "Super Bowl",
        "Winter",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pickled Onion and Monterey Jack Quesadillas",
    "url": "http://www.epicurious.com/recipes/food/views/pickled-onion-and-monterey-jack-quesadillas-10979"
}
