{
    "directions": [
        "In a glass bowl, stir together the water and salt until the salt has dissolved.  Add the watermelon rinds and any additional water needed to cover them.  Cover the bowl and refrigerate overnight.",
        "Drain the watermelon rinds from the salted water, and place into a large saucepan or Dutch oven.  Cover with fresh water, then place over high heat and bring to a boil.  Boil rinds for 30 minutes, then drain and set aside.",
        "Meanwhile, tie the cloves, mustard seed, and cinnamon sticks in a piece of cheesecloth.  Place into a large saucepan or Dutch oven along with the vinegar and sugar.  Bring to a boil over high heat, then remove from the heat and let stand for 15 minutes.  Stir in the drained watermelon rind, then return to the stove over high heat.  Bring to a boil, then reduce heat to medium and simmer until the rind is transparent and the syrup is slightly thickened, 45 to 50 minutes.  Remove and discard the spices after 40 minutes.  Stir in the food coloring if desired.",
        "Ladle into hot sterilized 1 pint jars, leaving 1/2 inch head space.  Seal jars with new lids and rings, making sure you have cleaned the jar's rims of any residue.   Process jars under 1 inch of water in a boiling water bath for 10 minutes. Let cool overnight, then press down on the lids to make sure they are sealed before storing. Store any unsealed jars in the refrigerator and enjoy those first."
    ],
    "ingredients": [
        "3 quarts water",
        "3/4 cup salt",
        "4 quarts watermelon rind, white part only, cut into 1-inch cubes",
        "2 tablespoons whole cloves",
        "1/2 teaspoon mustard seed",
        "10 (3 inch) cinnamon sticks, broken into pieces",
        "1 quart apple cider vinegar",
        "2 cups white sugar",
        "4 drops green food coloring (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pickled Watermelon Rinds",
    "url": "http://allrecipes.com/recipe/108974/pickled-watermelon-rinds/"
}
