{
    "directions": [
        "Finely grate 3 tablespoons lemon zest using small holes of a box grater, then squeeze 3/4 cup juice from lemons. Transfer zest and juice to a large bowl and add vinegar, oil, sugar, red-pepper flakes, 2 tablespoons kosher salt, 2 tablespoons pickling spices, 1 tablespoon fennel seeds, and two thirds of garlic, whisking until combined well.",
        "Bring a 6- to 8-quart pot of water to a boil with remaining 2 tablespoons kosher salt, 2 tablespoons pickling spices, 1 tablespoon fennel seeds, remaining one third of garlic, and bay leaves.",
        "Meanwhile, quarter fennel bulb lengthwise and cut crosswise into 1/4-inch-thick slices. Add sliced fennel to boiling water and cook, stirring occasionally, 3 minutes, then transfer with a slotted spoon to marinade. Return water to a boil, then add celery and cook, stirring occasionally, 1 minute. Transfer celery with a slotted spoon to marinade. Return water to a boil, then add onion and cook, stirring occasionally, 2 minutes. Transfer onion with a slotted spoon to marinade. Return water to a boil and cook shrimp, stirring occasionally, until just cooked through (no longer translucent inside), about 1 1/2 minutes, then transfer with a slotted spoon to marinade. Stir shrimp and vegetables until coated well.",
        "When shrimp and vegetables have cooled to room temperature, transfer to a large airtight container and marinate, chilled, stirring once or twice, until shrimp is pickled and flavors have developed, at least 8 hours. Season with salt and pepper and transfer shrimp and vegetables to a platter with a slotted spoon and drizzle shrimp with some of marinade. Stir in parsley just before serving."
    ],
    "ingredients": [
        "3 to 4 large lemons",
        "2 cups white-wine vinegar",
        "1/4 cup olive oil",
        "3 tablespoons sugar",
        "1/2 teaspoon dried hot red-pepper flakes",
        "4 tablespoons kosher salt",
        "4 tablespoons pickling spices (from a 2 1/2-oz jar)",
        "2 tablespoons fennel seeds",
        "3 large garlic cloves, minced",
        "2 large Turkish bay leaves or 1 California",
        "1 large fennel bulb (sometimes labeled \"anise\"; 1 lb), stalks discarded",
        "3 large celery ribs, sliced diagonally (1/4 inch thick)",
        "1 jumbo sweet onion such as Vidalia (1 lb), halved lengthwise and thinly sliced crosswise",
        "3 lb large shrimp in shell (21 to 25 per lb), peeled, tail and first shell segment left intact, and deveined",
        "1 cup chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Citrus",
        "Garlic",
        "Onion",
        "Shellfish",
        "Vegetable",
        "Side",
        "Marinate",
        "Summer",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pickled Shrimp and Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/pickled-shrimp-and-vegetables-1222212"
}
