{
    "directions": [
        "Combine all ingredients in large nonreactive* saucepan. Bring to boil over medium-high heat, stirring occasionally. Reduce heat to low and simmer 10 minutes. Strain into bowl; return brine to same pan and set aside.",
        "Pour water to depth of 1 inch in medium pot; place vegetable steamer rack in pot. Bring water to boil. Place onions on rack. Cover pot; steam onions until just tender, about 5 minutes. Using spoon, transfer onions to bowl. Cool and peel onions. Steam carrots until crisp-tender, about 3 minutes; transfer to separate bowl and cool. Steam cauliflower until crisp-tender, about 3 minutes; transfer to separate bowl and cool. Steam squash until crisp-tender, about 2 minutes; transfer to separate bowl and cool.",
        "Place half of grapes in bottom of 1 jar. Arrange half of bell pepper pieces atop grapes. Continue to layer half of each vegetable (including tomatoes) in jar, pressing layers firmly to compact and evenly distributing half of star anise, bay leaves, dill sprigs, garlic slices and chilies among vegetables. Repeat layering with remaining grapes, vegetables and seasonings in second jar.",
        "Bring reserved brine to boil. Ladle enough boiling brine into each jar to fill completely. Close jars tightly.",
        "Let pickles stand at room temperature until completely cool about 3 hours. Chill 2 days. (Can be made 1 week ahead; keep refrigerated. Brine may become cloudy.)",
        "Nonreactive cookware interiors that will not adversely affect foods include stainless steel, anodized aluminum, enamel linings, and nonstick surfaces."
    ],
    "ingredients": [
        "3 1/3 cups distilled white vinegar",
        "3 1/3 cups white grape juice",
        "12 large fresh dill sprigs",
        "8 small dried red chilies, halved",
        "8 whole star anise",
        "4 3x1/2-inch strips lemon peel",
        "4 large bay leaves",
        "2 1/2 tablespoons whole coriander seeds",
        "2 tablespoons honey",
        "1 tablespoon salt",
        "24 white and/or purple pearl onions (about 7 ounces)",
        "24 baby carrots (about 7 ounces)",
        "18 small cauliflower florets",
        "15 baby yellow pattypan squash (about 8 ounces, halved)",
        "16 1/3-inch-thick slices from 1 large unpeeled cucumber",
        "1 cup stemmed seedless green grapes",
        "2 1-quart or 1-liter wide-mouth jars",
        "1 large red bell pepper, stemmed, seeded, cut into 1-inch pieces",
        "24 small firm cherry tomatoes (about 8 ounces), stemmed",
        "6 whole star anise",
        "6 bay leaves",
        "6 large fresh dill sprigs",
        "2 large garlic cloves, thinly sliced",
        "2 red or green jalapeño or serrano chilies with stems, halved lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Appetizer",
        "Steam",
        "Cauliflower",
        "Cucumber",
        "Bell Pepper",
        "Carrot",
        "Squash",
        "Summer",
        "Jalapeño",
        "Grape",
        "Dill"
    ],
    "title": "Pickled Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/pickled-vegetables-105462"
}
