{
    "directions": [
        "Dissolve vitamin C powder in 6 cups water in a large bowl (to acidulate water).",
        "Cut a shallow X in bottom of each peach with a sharp paring knife and blanch in 4 batches in a 5- to 6-quart pot of boiling water 10 to 15 seconds. Transfer with a slotted spoon to a large bowl of ice and cold water and let stand until cool enough to handle. Peel peaches, then halve lengthwise and pit. Add peaches to acidulated water and let stand 10 minutes, then drain well in a colander.",
        "Toss peaches with sugar in a 6-quart wide heavy pot and chill, covered, at least 8 and up to 12 hours.",
        "Wash jars, lids, and screw bands in hot soapy water, then rinse well. Dry screw bands. Put jars on rack in canner and add enough water to cover jars by 2 inches. Bring to a boil, covered, then boil 10 minutes. Cover lids with water in a small saucepan and heat until thermometer registers 180°F (do not let boil). Keep jars and lids submerged in hot water, covered, until ready to use.",
        "Add vinegar, spice, salt, and remaining 1/2 cup water to peaches (sugar will have dissolved and will have drawn out peach juices) and bring to a boil over moderate heat, skimming off foam. Reduce heat and simmer until peaches are barely tender, about 3 minutes.",
        "Remove jars and lids from water, reserving water in canner, and transfer to a clean kitchen towel, then divide peaches among jars using a slotted spoon. Return peach-cooking liquid to a boil, then pour into jars, leaving 1/4 inch of space at top. Run a thin knife between peaches and sides of jars to eliminate air bubbles.",
        "Wipe off rims of filled jars with a dampened kitchen towel, then firmly screw on lids with screw bands. Put sealed jars on rack in canner and, if necessary, add enough hot water to cover jars by 2 inches. Bring to a boil, covered. Boil jars 20 minutes, then transfer with tongs to a towel-lined surface to cool. Jars will seal as they cool (if you hear a ping, that signals that the vacuum formed at the top of the jar has made the lid concave).",
        "After jars have cooled 12 to 24 hours, press center of each lid to check that it's concave, then remove screw band and try to lift off lid with your fingertips. If you can't, the lid has a good seal. Store in a cool dry place up to 6 months. Promptly put any jars that haven't sealed in the refrigerator and use them first."
    ],
    "ingredients": [
        "1 (1,000-mg) vitamin C tablet (to prevent discoloration), crushed to a powder",
        "6 1/2 cups cold water",
        "24 firm-ripe small peaches (6 to 7 lb)",
        "2 1/2 cups sugar",
        "1 1/4 cups distilled white vinegar",
        "4 teaspoons pickling spice",
        "1/4 teaspoon kosher salt",
        "Special equipment: 6 (1-pt) canning jars with lids and screw bands; a boiling-water canner, or a deep 10- to 12-qt pot plus a flat metal rack; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Vinegar",
        "Peach",
        "Summer",
        "Simmer",
        "Gourmet"
    ],
    "title": "Pickled Peaches",
    "url": "http://www.epicurious.com/recipes/food/views/pickled-peaches-232503"
}
