{
    "directions": [
        "Place butter and lard in freezer for 15 minutes. When ready to use, remove and cut both into small pieces.",
        "In the bowl of a food processor, combine flour and salt by pulsing 3 to 4 times. Add butter and pulse 5 to 6 times until texture looks mealy. Add lard and pulse another 3 to 4 times. Remove lid of food processor and spritz surface of mixture thoroughly with water. Replace lid and pulse 5 times. Add more water and pulse again until mixture holds together when squeezed. Place mixture in large zip-top bag, squeeze together until it forms a ball, and then press into a rounded disk and refrigerate for 30 minutes.",
        "Preheat oven to 425 degrees F.",
        "Place 2 metal pie pans in the refrigerator to chill.",
        "Remove dough from refrigerator. Cut along 2 sides of the plastic bag, open bag to expose dough, and sprinkle both sides with flour. Cover again with plastic and roll out with a rolling pin to a 10 to 11-inch circle. Open plastic again and sprinkle top of dough with flour. Remove pie pans from refrigerator and set first pan on top of dough. Turn everything upside down and peel plastic from bottom of dough. Place second pan upside down on top of dough and flip again. Remove first pan from atop dough. Trim edges if necessary, leaving an edge for meringue to adhere to. Poke holes in dough and place in refrigerator for 15 minutes.",
        "Place a large piece of parchment paper on top of dough and fill with dry beans. Press beans into edges of dough and bake in the oven for 10 minutes. Remove parchment and beans and continue baking until golden in color, approximately 10 to 15 minutes longer. Remove from oven and place on cooling rack. Let cool completely before filling."
    ],
    "ingredients": [
        "3 ounces (6 tablespoons) butter, chilled",
        "1 ounce (2 tablespoons) lard, chilled",
        "6 ounces (approximately 1 cup) all-purpose flour, plus extra for rolling dough",
        "1/2 teaspoon table salt",
        "1/4 cup ice water, in spritz bottle",
        "Approximately 32 ounces of dried beans, for blind baking"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Food Processor",
        "American",
        "Pie Crust Recipes"
    ],
    "title": "Pie Crust",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/pie-crust-recipe"
}
