{
    "directions": [
        "Place potatoes into a large pot and cover with salted water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two, then mash.",
        "Meanwhile, melt 2 tablespoons butter in a large pot over medium-high heat. Add the bacon, and cook until the fat begins to render, and the bacon begins to brown, about 5 minutes. Stir in the onion, and continue cooking until the onion softens and turns translucent, about 5 minutes. Stir in the ground beef and ground pork; continue cooking until crumbly and no longer pink, about 10 minutes. Finally, stir in the minced mushrooms, chicken bouillon, salt, pepper, and dill. Cover and cook until the mushrooms soften, about 5 minutes more. Stir in the mashed potatoes, then set the filling aside to cool.",
        "Whisk the all-purpose flour and self-rising flour together in a large bowl, and make a well in the center. Add the 2 beaten eggs, salt, and enough water to form a soft dough. Knead on a well floured work surface until smooth and pliable. Roll the dough to 1/8 inch thick, then cut into 5 inch circles.",
        "Spoon the filling onto one side of each of the dough rounds, then moisten the edges with the remaining beaten egg, and fold to create half circles. Press the edges together firmly to seal.",
        "Bring a large pot of lightly salted water to a boil. Drop the pierogi in a few at a time, and boil until they float to the surface, about 2 minutes. Once the pierogi have cooked, remove with a slotted spoon, and rinse until cold; set aside.",
        "Melt the remaining 1/4 cup of butter in a large skillet over medium-high heat. Add the boiled pierogi, and cook on both sides until hot and golden brown, about 5 minutes. Serve immediately."
    ],
    "ingredients": [
        "3 large potatoes - peeled and cubed",
        "2 tablespoons butter",
        "3 slices bacon, finely chopped",
        "3 onions, finely chopped",
        "1 1/2 pounds ground beef",
        "1/2 pound ground pork",
        "1 (8 ounce) package mushrooms, minced",
        "1 tablespoon chicken bouillon granules",
        "salt and pepper to taste",
        "1 tablespoon chopped fresh dill",
        "3 2/3 cups all-purpose flour",
        "1 cup self-rising flour",
        "2 eggs, lightly beaten",
        "1 pinch salt",
        "1 cup water, or as needed",
        "1 egg, beaten",
        "1/4 cup butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pierogi from Granny",
    "url": "http://allrecipes.com/recipe/160890/pierogi-from-granny/"
}
