{
    "directions": [
        "Preheat a heavy-bottomed skillet, preferably cast iron, over low heat. Add the oil and the onions and toss the onions to coat. Cover and cook for 20 minutes, leaving a little gap for steam to escape. Stir occasionally, every 5 minutes or so. Onions should turn amber, but not burn, although a couple of darker spots are fine.",
        "Remove the cover and turn the heat up just a bit, to a medium setting. Stir often for 10 more minutes. Onions should become a darker amber, and some of the moisture should evaporate.",
        "In a medium-size pot, cover potatoes in water. Place a lid on the pot and bring to a boil. Once boiling, cook for about 20 more minutes or until potatoes are easily pierced with a fork.",
        "Meanwhile, in a large pan, sauté the onions in oil over medium heat for about 7 minutes. Turn the heat off but continue to stir occasionally because they could still burn from the hot pan. When the potatoes are done boiling, drain them well and add them to the pan with the onions. Just mash them right in there with a potato masher; that way you are sure to get all the oil, plus you save a dish. Add the salt and pepper. Make sure potatoes are mashed well and fluffy. Set aside to cool a bit.",
        "You know I don't usually advise cooking with margarine, but I really love it with the mushrooms here, I think because growing up the mushrooms I ate were really buttery. Anyway, this filling is really simple. In a large skillet, melt the margarine over medium-high heat. Add the mushrooms and sauté for about 7 minutes, until the mushrooms are soft.",
        "Before adding the sauerkraut to the pan, give it a squeeze over the sink to get out as much water as you can. It's important to do this so that your pierogi don't get all wet. You'll need to add the sauerkraut to the pan a cup at a time. Add to the pan and cook for about 10 minutes, cooking out any excess water. Season with the pepper. The filling shouldn't look dry (a small amount of water is okay), but you shouldn't be able to slosh around in it in rain boots.",
        "This is really the brunt of the work in this recipe. If you're like me, you have limited counter space and so rolling out dough can be a hassle. I make the dough last because the mess becomes much more manageable when you don't have to prep on the counter afterwards. It also gives your filling some time to cool. So make sure you clean up after your filling making and get someone to do the dishes for you. I find that a serene counter makes all the difference in dough making.",
        "Pour the water and oil into a large bowl. Add 2 cups of the flour and the salt, keeping one cup aside. Use a fork to stir the flour in, and as it starts to come together, use your hands to knead until a loose dough forms (about 3 minutes).",
        "Sprinkle your counter with flour, then turn the dough out onto it and knead. Add the reserved cup of flour a little bit at a time, working it into the dough, until it is very smooth and elastic, about 10 minutes. If it's too sticky, you can add a little bit more fl our and knead it in, sometimes up to 1/4 cup extra. Conversely, if you get a good-feeling, smooth, elastic dough with less than the extra cup of fl our, then that's okay, too.",
        "Now we roll the dough out, and also bring a salted pot of water to boil—the largest pot you've got—for boiling the pierogi.",
        "Divide the dough in half and make sure your counter is clean and sprinkled with a dusting of flour to prevent sticking. Roll half the dough out to about 1/16 of an inch thick, which is to say, very thin but not see-through. I roll it into an 18 x 10-inch rectangle, but as long as you have the thinness going, the shape doesn't matter so much. Sprinkle the top with a light dusting of flour.",
        "Now we're going to make circles. I use the top of a glass that is 3 1/2 inches in diameter, but somewhere between 3 1/2 and 4 inches is perfect. Use a glass or a cookie cutter. Have ready a lightly floured plate to place the finished circles on, and go ahead and fi rmly press your glass or cookie cutter into the dough, as close together as you can. Pull together the excess dough and set aside. Place circles on the floured plate and transfer to the fridge while you repeat with the other half of the dough. Combine the excess dough and see if you can get a few more wrappers out of the deal."
    ],
    "ingredients": [
        "1/4 cup canola oil",
        "2 pounds sweet onions (Vidalia or Walla Walla), diced medium",
        "1 1/2 pounds Yukon Gold potatoes, peeled and sliced, cut into 3/4-inch chunks",
        "1/4 cup canola oil",
        "1 small onion, finely chopped",
        "1/2 teaspoon salt",
        "1/2 teaspoon pepper",
        "4 tablespoons nonhydrogenated margarine (or 1/4 cup canola oil and 1/4 teaspoon salt)",
        "10 ounces mushrooms, sliced (about 3 cups)",
        "2 cups sauerkraut",
        "1/4 teaspoon pepper",
        "1 cup warm water",
        "3 tablespoons canola oil",
        "3 cups all-purpose flour, divided, plus a little extra for sprinkling",
        "3/4 teaspoon salt",
        "Applesauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Potato",
        "Vegetable",
        "Appetizer",
        "Breakfast",
        "Brunch",
        "Fry",
        "Vegetarian",
        "Root Vegetable",
        "Vegan"
    ],
    "title": "Pierogi (Potato and Mushroom Sauerkraut)",
    "url": "http://www.epicurious.com/recipes/food/views/pierogi-potato-and-mushroom-sauerkraut-354032"
}
