{
    "directions": [
        "Simmer peas, ham, water, and broth in a 4-quart heavy pot, uncovered, 30 minutes. Make sofrito while peas simmer: Cook jalapeño, bell pepper, ají dulce chiles, onion, and garlic in oil in a skillet over moderate heat, stirring occasionally, until softened. Add cilantro, tomato, and thyme and cook, stirring occasionally, until thickened, about 4 minutes. Season sofrito with salt and pepper.",
        "Stir sofrito and squash into pea mixture and simmer, uncovered, stirring occasionally, until squash is tender and liquid is reduced by half, about 30 minutes. Mash garlic clove and cilantro to a paste with a mortar and pestle, then season with salt and pepper and add to stew. Grate plantain on large holes of a grater directly into stew and season stew with salt and pepper."
    ],
    "ingredients": [
        "2 (14-oz) packages frozen pigeon peas, thawed",
        "lb smoked ham, boned ham hock, or Spanish chorizo links (spicy dried pork sausage), diced",
        "3 cups water",
        "14- to 15-oz can chicken broth",
        "1 large fresh jalapeño chile, seeded and finely chopped",
        "1/2 red bell pepper, finely chopped",
        "6 ají dulce chiles, finely chopped, including seeds",
        "1 medium onion, finely chopped",
        "4 garlic cloves, minced",
        "2 tablespoons olive oil",
        "1/2 cup finely chopped fresh cilantro",
        "1 small tomato, seeded and chopped",
        "1/2 teaspoon fresh thyme or oregano leaves",
        "6 oz calabaza or butternut squash, peeled and cut into 1/4-inch dice (3/4 cup)",
        "1 garlic clove",
        "4 fresh cilantro sprigs",
        "1/2 green plantain, peeled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Pepper",
        "Pork",
        "Vegetable",
        "Lunch",
        "Sausage",
        "Hot Pepper",
        "Butternut Squash",
        "Spring",
        "Plantain",
        "Jalapeño",
        "Cilantro",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pigeon-Pea Soup",
    "url": "http://www.epicurious.com/recipes/food/views/pigeon-pea-soup-103191"
}
