{
    "directions": [
        "Peel and cut the zucchini into thirds. Remove seeds and cut into strips.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes. Divide onion, carrot, garlic, and dill among hot, sterilized jars. Pack zucchini slices vertically into jars. Divide peppercorns, allspice berries, mustard seed, and bay leaves among jars.",
        "Bring water, vinegar, salt, and sugar to a boil in a saucepan, stirring until sugar and salt is dissolved, 1 to 2 minutes. Remove from heat and ladle evenly into jars, filling to within 1/4 inch of the top.",
        "Run a clean knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 7 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "5 half-pint canning jars with lids and rings, sterilized",
        "1 extra large zucchini, sliced",
        "1 onion, sliced",
        "1 carrot, sliced",
        "5 cloves garlic, peeled and sliced",
        "1 bunch chopped fresh dill",
        "15 whole black peppercorns",
        "15 whole allspice berries",
        "1 tablespoon mustard seed",
        "5 bay leaves",
        "Brine:",
        "4 cups water",
        "1 cup white vinegar",
        "2 tablespoons salt",
        "1 1/4 cups superfine sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pikle z cukinii (Pickled Zucchini)",
    "url": "http://allrecipes.com/recipe/246576/pikle-z-cukinii-pickled-zucchini/"
}
