{
    "directions": [
        "Place a slice of bread on a work surface; top with 1 slice Cheddar cheese and 3 slices ham. Cover with a second slice of bread to create a sandwich. Repeat with remaining bread slices, Cheddar cheese, and ham.",
        "Pour salsa con queso into a 3-inch bowl representing the center field logo. Draw a logo atop the salsa con queso using chile-garlic sauce and 1 tablespoon sour cream. Place bowl in the center of a 9x13-inch baking dish.",
        "Spread tomatillo salsa into the bottom of the 9x13-inch baking dish and around the center field 'logo' for the 'field'. Fill a piping bag with 1/2 cup sour cream. Pipe 9 lines of sour cream onto the 'field' representing 10-yard lines.",
        "Cut two 3-inch pieces of Cheddar cheese representing the base of the goal post. Cut pepperoni sticks into two 3-inch pieces, two 2-inch pieces, and four 1-inch pieces. Secure each 3-inch piece of pepperoni stick to each Cheddar cheese piece using a toothpick. Secure the 2-inch pieces of pepperoni stick horizontally to the 3-inch pieces using a toothpick. Secure the 1-inch pieces of pepperoni sticks as the sides of the goal post using toothpicks.",
        "Place each goal post into the center of a 9x5-inch loaf pan. Spread hummus around goal post representing 1 end zone. Spread red pepper hummus into the other 9x5-inch loaf pan representing the other end zone.",
        "Cover a table with a clean disposable table cloth. Arrange the 'field' in the center of the table. Place 'end zones' on either end of 'field'. Secure 2 sets of 5 and 2 set of 2 magazine holders together using duct tape for the 'seating sections'; arrange around the 'field'.",
        "Fill the 'seating sections' with carrots, broccoli, cheese crackers, blue corn tortilla chips, potato chips, pita chips, and buttery round crackers.",
        "Arrange the sandwiches around the 'seating sections' using a brick-layer pattern.",
        "Make 12 'flags' by cutting 1-inch triangles from the Cheddar cheese. Secure each 'flag' to a skewer. Pierce the flag skewers through sandwich 'walls' around the 'stadium'. Make 4 'stadium lights' by cutting 2x1-inch rectangles out of Cheddar cheese. Secure each 'light' to 2 skewers. Pierce the light skewers around the 4 corners of the 'stadium'.",
        "Fill the corners of the 'stadium' with nacho-flavored tortilla chips, crunchy cheese puffs, and corn chips."
    ],
    "ingredients": [
        "400 slices bread",
        "200 slices Cheddar cheese",
        "400 slices thinly sliced ham",
        "23 ounces salsa con queso (such as Tostitos®), divided",
        "1 tablespoon chile-garlic sauce (such as Sriracha)",
        "1 tablespoon sour cream",
        "1 (16 ounce) jar tomatillo salsa, or as needed",
        "1/2 cup sour cream",
        "2 pounds Cheddar cheese, divided",
        "4 pepperoni beef sticks (such as Slim Jim®)",
        "8 toothpicks, or as needed",
        "4 (10 ounce) containers hummus, or as needed",
        "4 (10 ounce) containers red pepper hummus, or as needed",
        "14 cardboard magazine holders",
        "duct tape as needed",
        "8 pounds baby carrots",
        "5 pounds broccoli florets",
        "4 (16 ounce) packages cheese-flavored crackers (such as Cheez-It®)",
        "4 (12 ounce) packages blue corn tortilla chips",
        "2 (13 ounce) packages ridged potato chips (such as Ruffles®)",
        "2 (6 ounce) packages pita chips",
        "8 sleeves buttery round crackers (such as Ritz®)",
        "20 (10 inch) skewers",
        "2 (13.5 ounce) packages nacho cheese-flavored tortilla chips (such as Doritos®)",
        "2 (13 ounce) packages crunchy cheese puffs (such as Cheetos®)",
        "2 (10.5 ounce) bags corn chips (such as Fritos®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pile High Snack Stadium",
    "url": "http://allrecipes.com/recipe/235945/pile-high-snack-stadium/"
}
