{
    "directions": [
        "Combine flour, sugar and salt in large bowl. Add butter and shortening; using fingertips, rub in until mixture resembles coarse meal. Add vinegar. Using fork, mix in enough water to form moist clumps. Gather dough into ball; divide dough into 2 equal portions. Flatten each portion into disk. Wrap each in plastic; chill 45 minutes. (Can be made 2 days ahead. Keep refrigerated. Soften slightly at room temperature before rolling out.)",
        "Preheat oven to 400°F. Combine peaches, sugar, flour and spices in large bowl; toss to mix well.",
        "Roll out 1 dough disk on floured surface to 13-inch round. Transfer to 9-inch-diameter glass pie plate. Transfer peaches to crust, mounding in center. Roll out second dough disk to 13-inch round. Roll up dough on rolling pin and unroll atop peaches. Trim edges of both crusts to 3/4-inch overhang. Fold edges over; press to seal. Crimp edges. Cut 6 slits in top crust to allow steam to escape.",
        "Bake pie until crust is golden and juices bubble thickly through slits, covering edges of crust with foil if browning too quickly, about 1 hour 10 minutes. Cool pie 3 hours. Serve with ice cream."
    ],
    "ingredients": [
        "2 1/3 cups all purpose flour",
        "1 tablespoon sugar",
        "1 teaspoon salt",
        "3/4 cup (1 1/2 stick) chilled unsalted butter, cut into pieces",
        "1/4 cup chilled solid vegetable shortening, cut into pieces",
        "1 teaspoon distilled white vinegar",
        "6 tablespoons (about) ice water",
        "5 pounds medium peaches, peeled, pitted, sliced",
        "3/4 cup sugar",
        "1/4 cup all purpose flour",
        "1/4 teaspoon ground cinnamon",
        "1/8 teaspoon ground cardamom",
        "1/8 teaspoon ground nutmeg",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Peach",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Piled-High Peach Pie",
    "url": "http://www.epicurious.com/recipes/food/views/piled-high-peach-pie-635"
}
