{
    "directions": [
        "1. In a medium bowl, mix together the onion, both cheeses, mayonnaise, and pimientos. If you need additional mayonnaise to make it creamy, add a little bit at a time. Grind copious amounts of black pepper and stir that into the cheese mixture.",
        "2. Divide the ground beef into 6 equal portions and shape into patties about 3/4 inch thick. Remember to put a slight indentation into the center of each patty. Season both sides of the burgers liberally with salt and pepper.",
        "3. Oil the grill racks. Preheat your grill using all burners set on high and with the lid closed for 10 to 12 minutes.",
        "4. Place the burgers on the grill and lower the heat to medium. Grill for about 5 minutes. Turn the patties and continue grilling until they reach your desired doneness, about 4 additional minutes for medium, 6 minutes for medium-well. During the last 2 minutes of cooking time, add the buns, cut side down. At the last minute before taking the hamburgers off the grill, put a generous spoonful of pimiento cheese on each. Take the buns from the grill, place on a platter, set a burger on each bun bottom, add pickled jalapeños on top of the pimiento cheese, and serve."
    ],
    "ingredients": [
        "1 small white onion, grated",
        "8 ounces sharp Cheddar cheese, grated",
        "4 ounces mild Cheddar cheese, grated",
        "1/2 cup good-quality mayonnaise (I prefer Duke's or JFG®)",
        "One 2-ounce jar diced pimientos, drained",
        "Freshly ground black pepper",
        "2 pounds 80% lean ground chuck, or 1 1/2 pounds 80% lean ground chuck plus 8 ounces 90% lean ground sirloin",
        "Kosher salt",
        "6 hamburger buns, preferably onion flavored",
        "Pickled jalapeño chile slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Mayonnaise",
        "Cheddar",
        "Ground Beef",
        "Hot Pepper",
        "Tailgating",
        "Grill",
        "Grill/Barbecue",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pimiento Cheeseburgers",
    "url": "http://www.epicurious.com/recipes/food/views/pimiento-cheeseburgers-354410"
}
