{
    "directions": [
        "Preheat oven to 350°F. Line 10-inch glass pie dish with foil, overlapping sides. Finely chop first 3 ingredients in processor. Add butter and blend until moist crumbs form. Press mixture firmly onto bottom and up sides (but not rim) of prepared pie dish. Freeze 10 minutes. Bake crust until golden brown, about 15 minutes. Freeze 20 minutes.",
        "Spread sorbet in crust; smooth top. Place in freezer.",
        "Boil cream of coconut in heavy small saucepan over medium-high heat until reduced to 3/4 cup, stirring frequently, about 7 minutes. Pour into large bowl. Mix in rum and extract, then 3/4 cup coconut. Cool slightly. Add frozen yogurt to coconut mixture and fold in until blended. Freeze until semifirm, stirring occasionally, about 1 hour. Spoon filling over sorbet in pie dish, mounding slightly. Cover and freeze overnight. (Can be prepared 2 weeks ahead.)",
        "Turn out pie onto platter. peel off foil. Turn pie right side up. Arrange pineapple decoratively atop pie. Sprinkle with toasted coconut. Garnish with mint."
    ],
    "ingredients": [
        "1 7-ounce jar roasted macadamia nuts",
        "3/4 cup sweetened shredded coconut",
        "3 tablespoons brown sugar",
        "1 tablespoon unsalted butter, melted",
        "1 1/2 pints pineapple sorbet, softened",
        "1 cup canned sweetened cream of coconut (such as Coco Lopez)",
        "4 teaspoons dark rum",
        "1/2 teaspoon imitation coconut extract",
        "3/4 cup (packed) sweetened shredded coconut",
        "2 pints vanilla frozen yogurt, softened",
        "1/2 large pineapple, trimmed, cored, thinly sliced",
        "Toasted sweetened shredded coconut",
        "Fresh mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Coconut",
        "Pineapple",
        "Macadamia Nut",
        "Summer"
    ],
    "title": "Piña Colada Pie",
    "url": "http://www.epicurious.com/recipes/food/views/pina-colada-pie-2401"
}
