{
    "directions": [
        "In a small heavy saucepan stir together juice and sugar and simmer until reduced to about 3/4 cup. In a bowl lightly beat yolks and in a slow stream add half of hot juice mixture, whisking. Add egg mixture to remaining juice mixture and cook over moderately low heat, stirring constantly, until custard is thickened and a thermometer registers 160°F.",
        "Transfer custard to a clean bowl and with an electic mixer beat until cool and very thick. In another bowl with electric mixer beat cream until it just holds stiff peaks. Gently fold in coconut milk and fold cream mixture into custard gently but thoroughly. Spoon mousse into ten 1/3-cup cone-shaped paper cups or other very small paper cups. (If using cone-shaped paper cups, set in small winglass or juice glass to keep upright.) Freeze mousses, covered, at least 4 hours, or until firm, and up to 1 day.",
        "In a saucepan bring whole milk, coconut milk, and sugar to a boil, stirring until suagr is dissolved. In a bowl lightly beat yolks and in a slow stream add half of hot mixture, whisking. Add egg mixture to remaining milk mixture, stirring and cook over moderately low heat, stirring constantly, until sauce is thickened and a thermometer registers 160°F. Chill sauce, its surface covered with a buttered round of wax paper, at least 3 hours, or until cold, and up to 1 day. Stir rum into sauce.",
        "In a blender purée raspberries with syrup and pour through a fine sieve into a bowl.",
        "Gently tear paper cups from mousses and invert onto 10 plates. Cut each mousse horizontally into thirds. Carefully seperating sections with a spatula, slip a 3-inch tuile between bottom and middle sections and a 2 1/2-inch thick tuile between top and middle sections of each mousse.",
        "Spoon coconut sauce around mousse and dot sauce with rasberry coulis. Draw a knife decoratively through sauce and coulis and garnish desserts with pineapple leaves."
    ],
    "ingredients": [
        "1 cup unsweetened pineapple juice",
        "2/3 cup sugar",
        "5 large egg yolks",
        "1/2 cup chilled heavy cream",
        "1/4 cup well-stirred canned unsweetened coconut milk",
        "1 cup whole milk",
        "1/2 cup well-stirred canned coconut milk",
        "3 large egg yolks",
        "dark rum, or to taste",
        "a 10-ounce package frozen raspberries in syrup, thawed",
        "Ten 3-inchalmond tuiles",
        "Ten 2 1/2-inchalmond tuiles"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Raspberry",
        "Coconut",
        "Pineapple",
        "Almond",
        "Gourmet",
        "Kidney Friendly"
    ],
    "title": "Piña Colada Mousses with Almond Tuiles, Coconut Sauce, and Rapberry Coulis",
    "url": "http://www.epicurious.com/recipes/food/views/pina-colada-mousses-with-almond-tuiles-coconut-sauce-and-rapberry-coulis-101449"
}
