{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place sugar in a small saucepan over medium heat. Cook gently, without stirring, but shaking occasionally until the sugar has melted. Continue cooking until the sugar has completely melted and turned golden brown. Pour into a large round glass baking dish. Spread the caramel evenly over the bottom of the dish, then set aside to cool for 15 minutes before proceeding.",
        "In a bowl, whisk together eggs, cream of coconut, condensed milk, and pineapple juice until thoroughly combined and smooth. Pour the egg mixture over the caramel in the baking dish. Place a kitchen towel in a large roasting pan, and set the baking dish on the towel. Place the roasting pan into the preheated oven, and carefully fill the roasting pan with water about halfway up the side of the flan dish.",
        "Bake until a knife inserted in the center of the flan comes out clean, about 1 hour.",
        "Remove roasting pan from oven, and allow the flan to cool sitting in its water bath, about 30 minutes. Refrigerate the flan until thoroughly cold, at least 2 hours. To unmold, run a knife all around the edge of the flan to loosen the sides. Place a serving platter on the dish, and quickly flip the pan over to remove the flan onto the platter. Spoon any liquid caramel from the baking dish over the flan, and allow the caramel sauce to pool around the flan. Sprinkle with shaved coconut, and refrigerate until serving."
    ],
    "ingredients": [
        "1 cup white sugar",
        "8 beaten eggs",
        "2 (15 ounce) cans sweetened cream of coconut (such as Coco Lopez®)",
        "1 (14 ounce) can sweetened condensed milk",
        "5 tablespoons pineapple juice",
        "1 tablespoon shaved coconut (toasted if desired) (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pina Colada Flan",
    "url": "http://allrecipes.com/recipe/214804/pina-colada-flan/"
}
