{
    "directions": [
        "In a heavy kettle combine the sugar and 2 cups water, bring the mixture to a boil, stirring until the sugar is dissolved, and boil the syrup until it registers 220°F. on a candy thermometer. Stir in the pineapple and the gingerroot and simmer the mixture, uncovered, stirring to prevent scorching, for 1 hour, or until it registers 220°F. on a candy thermometer. Remove the kettle from the heat and ladle the preserves into 5 sterilized 1/2-pint Mason type jars (sterilizing procedure follows), filling the jars to within 1/4 inch of the tops. Wipe the rims with a dampened towel and seal the jars with the lids. Put the jars in a water bath canner or on a rack set in a deep kettle, add enough hot water to the canner or kettle to cover the jars by 2 inches, and bring to a boil. Process the jars, covered, for 10 minutes, transfer them with tongs to a rack, and let them cool completely. Store the jars in a cool dark place.",
        "Wash the jars in hot suds and rinse them in scalding water. Put the jars in a kettle and cover them with hot water. Bring the water to boil, covered, and boil the jars for 15 minutes from the time that steam emerges from the kettle. Turn off the heat and let the jars stand in hot water. Just before they are to be filled invert the jars onto a kitchen towel dry. (The jars should be filled while they are still hot.) Sterilize the jar lids for 5 minutes, or according to the manufacturer's instructions."
    ],
    "ingredients": [
        "3 1/2 cups sugar",
        "two 4-pound pineapples, peeled, cut into 1/4-inch-thick rings, cored, and chopped coarse (about 8 cups)",
        "1/4 cup finely chopped peeled fresh gingerroot"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Ginger",
        "Breakfast",
        "Low Sodium",
        "Pineapple",
        "Gourmet",
        "Fat Free",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pineapple Ginger Preserves",
    "url": "http://www.epicurious.com/recipes/food/views/pineapple-ginger-preserves-11982"
}
