{
    "directions": [
        "Preheat oven to 350°F. Oil bottom and sides of a 15 1/2 x 10 1/2 x 1-inch jelly-roll pan and line bottom and sides with parchment paper.",
        "In a food processor finely grind nuts with flour and salt. In a large bowl with an electric mixer beat together eggs and sugar until thick and pale and mixture forms a ribbon when beaters are lifted (about 10 minutes with a standing mixer or about 15 with a hand-held mixer). Fold flour mixture into egg mixture gently but thoroughly. Spread batter evenly in jelly-roll pan and bake in middle of oven until golden and springs back when lightly touched, 10 to 15 minutes. Cool cake layer in pan on a rack. Cake layer may be made 3 days ahead and kept wrapped well in plastic wrap at cool room temperature.",
        "In a food processor pulse undrained pineapple 3 seconds. Drain pineapple in a sieve set over a bowl (you will have about 2 cups) and reserve juice for another use.",
        "Invert cake layer onto a work surface and peel off parchment. With a long serrated knife trim layer to form a 14 x 7-inch rectangle, reserving trimmings. Halve rectangle crosswise to form two 7-inch squares and carefully halve squares horizontally (for a total of four 7-inch squares). Horizontally halve reserved trimmings.",
        "Put 1 square on a cake plate. With a spatula spread 1/2 cup pineapple evenly over square. Top pineapple with 1/2 cup sabayon, spreading evenly. Make more layers in same manner with remaining 3 squares, pineapple, and sabayon, ending with sabayon. Piece together enough reserved trimmings to form a fifth square over sabayon. Chill cake, covered, at least 1 hour and up to 2 days.",
        "In a bowl with an electric mixer beat cream with sugar until it just holds soft peaks and with a spatula spread whipped cream over top and sides of cake. Cake may be fully assembled 1 day ahead and chilled in a cake keeper or covered with an inverted bowl. Bring cake to room temperature before serving (about 30 minutes)."
    ],
    "ingredients": [
        "parchment paper",
        "1/4 cup (1 1/2 ounces) shelled natural pistachios or blanched almonds",
        "3/4 cup plus 1 tablespoon all-purpose flour",
        "1/2 teaspoon salt",
        "5 large eggs",
        "2/3 cup sugar",
        "two 20-ounce cans unsweetened crushed pineapple",
        "rum sabayon",
        "1 cup well-chilled heavy cream",
        "2 teaspoons sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Rum",
        "Food Processor",
        "Mixer",
        "Dessert",
        "Bake",
        "Easter",
        "Pineapple",
        "Pistachio",
        "Spring",
        "Chill",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pineapple Rum Trifle Cake",
    "url": "http://www.epicurious.com/recipes/food/views/pineapple-rum-trifle-cake-101054"
}
