{
    "directions": [
        "In the bottom of an 8 1/2-inch springform pan arrange the cake, cutting the pieces to fit in one layer, and freeze it while making the ice cream.",
        "In a heavy saucepan combine pineapple and 1/4 cup of the sugar and simmer the mixture, stirring until the sugar is dissolved, for 5 minutes. Drain the pineapple mixture in a fine sieve set over a bowl, reserving the syrup for another use. In a bowl whisk together the remaining 1/2 cup sugar, the cornstarch, a pinch of salt, the yolks, and the whole egg and add the milk, scalded, in a stream, whisking. In a heavy saucepan bring the custard to a boil over moderate heat, whisking, boil it, whisking, for 2 minutes, and strain it through a fine sieve into a metal bowl set in a larger bowl of ice and cold water. Stir in the pineapple mixture and vanilla, let the custard cool, stirring, and stir in the cream. Freeze the custard in an ice-cream freezer according to the manufacturer's instructions until it is frozen but still soft.",
        "Spoon the ice cream over the cake, spreading it evenly, and freeze the cake while making the topping.",
        "In a bowl beat the cream until it holds soft peaks and beat in the sugar and sour cream. Beat the mixture until it just holds stiff peaks and fold in the coconut gently but thoroughly.",
        "Spoon the topping over the ice cream, spreading it evenly, and freeze the cake, its surface covered with plastic wrap, overnight. Let the cake stand at room temperature for 10 minutes, remove the side of the pan, and transfer the cake to a serving plate. Sprinkle the coconut on top and serve the cake into wedges."
    ],
    "ingredients": [
        "about eight 3- by 2- by 1/2-inch pieces of pound cake",
        "1 1/2 cups chopped fresh pineapple",
        "3/4 cup sugar",
        "1 tablespoon cornstarch",
        "3 large egg yolks",
        "1 large whole egg",
        "1 1/2 cups milk",
        "1 teaspoon vanilla",
        "1 1/2 cups well-chilled heavy cream",
        "2/3 cup well-chilled heavy cream",
        "2 tablespoons sugar",
        "2 tablespoons sour cream",
        "1 cup sweetened flaked coconut, toasted lightly and cooled",
        "1/4 cup sweetened flaked coconut, toasted lightly and cooled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Ice Cream Machine",
        "Dessert",
        "Freeze/Chill",
        "Frozen Dessert",
        "Coconut",
        "Pineapple",
        "Summer",
        "Gourmet"
    ],
    "title": "Pineapple Ice-Cream Cake with Coconut Topping",
    "url": "http://www.epicurious.com/recipes/food/views/pineapple-ice-cream-cake-with-coconut-topping-11976"
}
