{
    "directions": [
        "Combine 3 cups water, Marsala, sugar, cinnamon stick, and lemon peel in heavy large saucepan. Bring to boil, stirring until sugar dissolves. Add prunes and apricots. Reduce heat to medium; simmer until fruit is just soft but not mushy, stirring frequently, about 25 minutes. Using slotted spoon, transfer fruit to medium bowl. Boil liquid until syrupy, about 5 minutes. Pour syrup over fruit. (Can be made 2 days ahead. Cover; chill. Bring to room temperature before serving.)",
        "Position rack in center of oven and preheat to 375°F. Butter and flour 10-inch-diameter springform pan. Whisk egg yolks, egg, lemon peel, vanilla, and salt in small bowl to blend. Using electric mixer, beat butter and 1 cup sugar in medium bowl until pale and creamy. Gradually add flour, beating until mixture resembles coarse meal. Using rubber spatula, gently stir egg mixture into butter mixture (batter will be thick). Spoon batter into prepared pan; smooth top (cake will be thin). Sprinkle pine nuts over top; press lightly to adhere.",
        "Bake cake until tester inserted into center comes out clean, about 30 minutes. Transfer cake to rack. Run small knife around cake edges to loosen. Remove pan sides. Cool cake completely. (Can be made 1 day ahead. Cover and store at room temperature.)",
        "Sprinkle cake with powdered sugar. Serve with poached fruit."
    ],
    "ingredients": [
        "3 cups water",
        "1 cup imported sweet Marsala",
        "1/4 cup sugar",
        "1 cinnamon stick",
        "1 4-inch-long strip lemon peel (yellow part only)",
        "2 cups pitted prunes",
        "2 cups dried apricots",
        "3 large egg yolks",
        "1 large egg",
        "1 1/2 teaspoons (packed) grated lemon peel",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon salt",
        "10 tablespoons (1 1/4 sticks) unsalted butter, room temperature",
        "1 cup sugar",
        "1 1/2 cups unbleached all purpose flour",
        "3/4 cup pine nuts (about 3 1/2 ounces)",
        "Powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Poach",
        "Dried Fruit",
        "Prune",
        "Apricot",
        "Pine Nut",
        "Marsala",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pine Nut Torta with Marsala-Poached Autumn Fruit",
    "url": "http://www.epicurious.com/recipes/food/views/pine-nut-torta-with-marsala-poached-autumn-fruit-108646"
}
