{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "To Make Topping: Combine 6 tablespoons of the unsalted butter or margarine, 1 cup of the packed brown sugar, and the honey in a medium sized saucepan. Cook over medium heat, stirring with a wooden spoon, until well blended and smooth. Pour into an ungreased 13x9 inch baking pan, tilting to evenly coat the bottom of the pan. Arrange pineapple slices in a decorative pattern in pan and sprinkle with dried currants and 1/4 cup of the sliced almonds",
        "In a small bowl combine rum, pineapple juice, and buttermilk. In another small bowl mix flour, baking powder, cinnamon, nutmeg, salt, and cloves together.",
        "In a large bowl cream 6 tablespoons of the butter and 1 cup of the packed brown sugar together until smooth. Add eggs one at a time, beating well after each addition. Beat in vanilla and almond extracts, scraping down the sides of the bowl. In three additions, beat in on low speed of an electric mixer the flour and the rum mixtures alternately, beating for about 45 seconds after each addition. Scrape down sides of bowl when needed. Spoon batter over the pineapple in the pan, spreading evenly.",
        "Bake at 350 degrees F (175 degrees C) for 35 to 40 minutes or until a wooden pick inserted into the center comes out clean. Remove pan from oven and let stand for about 10 minutes. Turn pan upside down onto a serving platter and let stand  in pan for 10 more minutes. Remove pan and garnish with sliced almonds, if desired."
    ],
    "ingredients": [
        "6 tablespoons unsalted butter",
        "1 cup packed brown sugar",
        "1 tablespoon honey",
        "12 slices canned pineapple",
        "1/4 cup unsweetened pineapple juice",
        "1/2 cup dried currants",
        "1/4 cup sliced almonds",
        "1/4 cup dark rum",
        "1/4 cup buttermilk",
        "1 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground cloves",
        "6 tablespoons unsalted butter",
        "1 cup packed brown sugar",
        "2 eggs",
        "1 tablespoon vanilla extract",
        "1/2 teaspoon almond extract",
        "1/4 cup sliced almonds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pineapple Upside-Down Cake I",
    "url": "http://allrecipes.com/recipe/7412/pineapple-upside-down-cake-i/"
}
