{
    "directions": [
        "Preheat oven to 350°F. Line bottoms of 2 buttered 9- by2-inch round cake pans with rounds of wax paper. Dust pans with flour, knocking out excess.",
        "Into a bowl sift together flour, baking powder, and salt. In a glass measuring cup stir together milk and vanilla. In a bowl with an electric mixer on medium speed cream butter 1 minute and add sugar in a steady stream, beating until light and fluffy, about 4 minutes, scraping bowl occasionally. Beat in eggs, a little at a time, beating well after each addition, until pale and fluffy. Stir in flour mixture in 4 batches alternately with milk, beginning and ending with flour mixture and stirring after each addition until batter is smooth.",
        "Divide batter between pans, smoothing tops, and bake in middle of oven until a tester inserted in center comes out clean, about 30 minutes. Cool cake layers in pans on racks 10 minutes. Run a thin knife around edge of each pan and invert cake layers onto racks. Remove wax paper carefully and cool cake layers completely. Cake layers may be made 5 days ahead and frozen, wrapped in plastic wrap and foil. Thaw cake layers in refrigerator 1 day before proceeding with recipe.",
        "In a heavy saucepan stir together filling ingredients until cornstarch is dissolved. Bring mixture to a boil, stirring constantly, and simmer, stirring, 3 minutes. Cool filling completely. Filling may be made 3 days ahead and chilled, covered.",
        "With a long serrated knife halve each cake layer horizontally. Stack cake layers on a cake plate, spreading filling between layers.",
        "In a double boiler or in a large metal bowl with a hand-held electric mixer beat together all frosting ingredients except vanilla until combined. Set mixture over a saucepan of boiling water and beat on high speed until it holds stiff, glossy peaks, about 7 minutes. (Depending on mixer and weather this may take longer than 7 minutes.) Remove double boiler or bowl from heat and beat in vanilla. Beat frosting until cooled and spreadable.",
        "Spread top and side of cake with frosting and coat cake with coconut."
    ],
    "ingredients": [
        "2 1/3 cups cake flour (not self-rising)",
        "2 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 cup milk",
        "1 1/2 teaspoons vanilla extract",
        "2 sticks (1 cup) unsalted butter, softened",
        "1 1/2 cups sugar",
        "5 large eggs, beaten lightly",
        "a 28-ounce can crushed pineapple in unsweetened juice",
        "1 tablespoon cornstarch",
        "a rounded 1/4 cup sugar",
        "2 large egg whites",
        "1 1/2 cups sugar",
        "1/2 cup water",
        "1 tablespoon light corn syrup",
        "1 teaspoon vanilla extract",
        "2 2/3 cups sweetened flaked coconut (a 7-ounce bag), toasted golden and cooled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Kid-Friendly",
        "Coconut",
        "Pineapple",
        "Chill",
        "Gourmet"
    ],
    "title": "Pineapple Coconut Layer Cake",
    "url": "http://www.epicurious.com/recipes/food/views/pineapple-coconut-layer-cake-10154"
}
