{
    "directions": [
        "Preheat the oven to 400 degrees F (200 degrees C). Grease 12 muffin cups. Stack the pineapple slices and cut them into 6 wedges. Set aside.",
        "Sprinkle 1 teaspoon of brown sugar into the bottom of each muffin cup. Sprinkle in 1/2 teaspoon of walnuts over the sugar, and then place two wedges of pineapple into each cup. Set aside.",
        "In a large bowl, stir together the oats, whole wheat flour, all-purpose flour, baking powder, baking soda, salt and cinnamon. In a separate bowl, whisk together the eggs, 1/2 cup of brown sugar, canola oil, pineapple juice and vanilla. Stir the wet ingredients into the dry just until moistened. Fold in the crushed pineapple, carrot, raisins and walnuts. Spoon evenly into the prepared muffin cups.",
        "Bake the muffins until the tops spring back when lightly pressed, about 20 minutes. While the muffins are still hot, loosen the edges from the pan using a small knife and invert onto a serving tray so that the pineapple is on top. Serve upside-down while still warm or at room temperature."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2304&h=1206&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F969268.jpg",
    "ingredients": [
        "1 (10 ounce) can pineapple slices in juice, drained",
        "2 tablespoons brown sugar",
        "2 tablespoons chopped walnuts (optional)",
        "½ cup regular rolled oats",
        "¾ cup whole wheat flour",
        "¾ cup all-purpose flour",
        "2 teaspoons baking powder",
        "½ teaspoon baking soda",
        "¼ teaspoon salt",
        "1 tablespoon ground cinnamon",
        "2  eggs",
        "½ cup packed light brown sugar",
        "¼ cup canola oil",
        "2 tablespoons pineapple juice",
        "1 teaspoon vanilla extract",
        "1 (8 ounce) can crushed pineapple",
        "1 cup grated carrot",
        "¾ cup raisins",
        "¼ cup chopped walnuts"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pineapple Upside-Down Muffins",
    "url": "http://allrecipes.com/recipe/150957/pineapple-upside-down-muffins/"
}