{
    "directions": [
        "Bring reserved apricot syrup and dried apricots to boil in heavy small saucepan. Remove from heat. Let stand until apricots soften, about 10 minutes. Drain apricots; discard syrup.",
        "Stir sugar, cornstarch, pineapple juice and lemon juice in heavy medium saucepan until blended and smooth. Mix in pineapple. Let stand until juices form, about 15 minutes. Cook over medium heat until mixture boils and is very thick, stirring often, about 8 minutes. Remove from heat. Mix in cranberries, butter and dried apricots. Cool completely. (Can be made 8 hours ahead; let stand at room temperature.) Gently mix in canned apricots.",
        "Position rack in lowest third of oven and preheat to 400°F. Roll out 1 dough disk on floured surface to 13-inch round. Transfer to 9-inch-diameter glass pie dish. Fold overhang under.",
        "Roll out second dough disk on floured surface to 13-inch round. Cut into 1/2-inch-wide strips. Brush inside and top edge of crust with glaze. Spoon filling into crust. Arrange 7 pastry strips across top of pie, spacing 1/2 inch apart; brush with glaze. Arrange 7 more strips atop pie in opposite direction. Tuck ends of pastry strips under crust at edge; press to seal. Crimp edge. Brush lattice and edge with glaze.",
        "Bake until lattice is golden and filling starts to bubble, about 45 minutes. Transfer to rack; cool completely. (Can be made 1 day ahead. Let stand at room temperature.)"
    ],
    "ingredients": [
        "1 16-ounce can unpeeled apricot halves in heavy syrup, well drained, syrup reserved",
        "1 cup diced dried apricots (about 5 ounces)",
        "3/4 cup sugar",
        "1/4 cup cornstarch",
        "2 tablespoons frozen pineapple juice concentrate, thawed",
        "1 tablespoon fresh lemon juice",
        "4 cups 1/2-inch pieces fresh peeled cored pineapple",
        "1/2 cup cranberries",
        "2 tablespoons (1/4 stick) unsalted butter",
        "2Easy Pastry Dough disks",
        "1 egg, beaten to blend (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Cranberry",
        "Apricot",
        "Pineapple"
    ],
    "title": "Pineapple, Apricot and Cranberry Lattice-Crust Pie",
    "url": "http://www.epicurious.com/recipes/food/views/pineapple-apricot-and-cranberry-lattice-crust-pie-4357"
}
