{
    "directions": [
        "Preheat the oven to 350°F.",
        "Spread the pine nuts out on a baking sheet and toast in the oven for 5 minutes, until fragrant. Transfer the sheet to a wire rack and let the nuts cool completely. Keep the oven on.",
        "On a lightly floured surface, roll out the dough to an 11-inch round. Fit the dough into a 9 1/2 -inch fluted tart pan with a removable bottom. Press the dough into the edges of the pan, and use a paring knife to trim off the excess dough along the top edge. Prick the bottom all over with a fork and freeze until the dough is firm, about 10 minutes.",
        "Line the chilled tart shell with a round of parchment paper or aluminum foil, leaving a 1-inch overhang. Fill it with pie weights or dried beans. Bake until the edges of the crust are just beginning to turn golden, 15 to 20 minutes. Remove the parchment and pie weights. Return the crust to the oven and continue baking until it is dry all over, about 5 minutes more. Transfer the tart shell to a wire rack and let it cool completely.",
        "In a small saucepan, melt the butter over high heat until it is golden brown with a nutty fragrance, about 4 minutes. Remove it from the heat and set it aside.",
        "In a large bowl, whisk together the brown sugar, corn syrup, salt, and vanilla. Add the eggs and whisk well to combine. Then add the browned butter. Fold in the pine nuts just to combine. Pour the filling into the tart shell and place the pan on a baking sheet. Bake, rotating the baking sheet once halfway through, until the filling is set around the edges but still slightly loose in the center, about 45 minutes. (If the crust is getting too dark, cover the tart loosely with foil for the last 10 minutes.) Transfer the tart to a wire rack to cool.",
        "Meanwhile, make the rosemary cream: In a small saucepan, bring 3/4 cup of the cream just to a boil. Remove the pan from the heat and stir in 2 of the rosemary sprigs. Cover and let steep for 10 minutes.",
        "While the cream is steeping, make the candied rosemary sprig for garnish, if you like: In a bowl, whisk together 2 tablespoons of the granulated sugar and 2 tablespoons of hot water. Put the remaining 2 tablespoons of sugar in a shallow bowl. Dip the remaining rosemary sprig in the sugar syrup to coat. Tap off any excess liquid on a paper towel, and then gently toss the wet sprig in the bowl of sugar. Set it on a paper towel to dry, about 5 minutes.",
        "Set up an ice bath. Strain the steeped cream into a metal bowl, set the bowl into the ice bath, and chill the cream until cold, about 5 minutes. Whisk in the remaining 3/4 cup cream and the confectioners' sugar. Continue to whisk until the cream forms soft peaks. Remove the outer ring and serve the tart with the cream, garnished with the fresh or candied rosemary sprig."
    ],
    "ingredients": [
        "1 3/4 cups pine nuts",
        "Unbleached all-purpose flour, for rolling",
        "1/2 recipe Almond Sable Dough",
        "4 tablespoons (1/2 stick) unsalted butter",
        "1 cup packed dark brown sugar",
        "1 cup light corn syrup",
        "1 teaspoon kosher salt",
        "1 teaspoon pure vanilla extract",
        "3 large eggs",
        "1 1/2 cups heavy cream",
        "3 sprigs rosemary",
        "4 tablespoons granulated sugar, for garnish (optional)",
        "2 teaspoons confectioners' sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Nut",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Rosemary",
        "Tree Nut",
        "Pine Nut",
        "Fall",
        "Winter",
        "Party",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pine Nut Tart with Rosemary Cream",
    "url": "http://www.epicurious.com/recipes/food/views/pine-nut-tart-with-rosemary-cream-356412"
}
