{
    "directions": [
        "Preheat oven to 400°F. Spread the pine nuts in a single layer on a baking sheet and place in oven until lightly toasted, about 5 to 10 minutes. Take care not to burn the nuts.",
        "Combine the hot nuts, honey, and sugar in a food processor and process for 2 minutes or until the mixture is smooth. Add the eggs and process until well blended, about 30 seconds.",
        "Bring the milk to a boil in a heavy sauce pan. With food processor running, slowly pour the hot milk into the nut mixture through the feed tube. Process 30 seconds or until the nut custard is smooth. Pour the entire mixture back into the pan and place over low heat. Stir constantly with a whisk or wooden spoon until the custard thickens slightly. Be careful not to let the mixture boil or the eggs will scramble. Remove from heat. Pour the hot nut custard through a strainer into a large, clean bowl. Allow the custard to cool slightly, then stir in the cream and vanilla. Cover and refrigerate until cold or overnight.",
        "Stir the chilled custard, then freeze in one or two batches in your icecream machine according to the manufacturer's instructions. When finished, the ice cream will be soft but ready to eat. For firmer icecream, transfer to a freezer-safe container and freeze at least 2 hours."
    ],
    "ingredients": [
        "1 cup pine nuts",
        "1/2 cup honey",
        "1/4 cup sugar",
        "2 large eggs",
        "1 cup milk",
        "1/4 teaspoon salt",
        "1 1/2 cups heavy cream",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Dessert",
        "Frozen Dessert",
        "Pine Nut",
        "Summer",
        "Honey",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pine Nut Honey Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/pine-nut-honey-ice-cream-105233"
}
