{
    "directions": [
        "Preheat oven to 300°F. Spray large nonstick baking sheet with vegetable oil spray. Mix coconut and flour in small bowl. Using electric mixer, beat sugar and butter in large bowl until blended. Gradually add egg whites and beat until mixture thickens slightly. Stir in coconut mixture.",
        "Form 2 tuiles by spooning 1 very generous tablespoonful batter for each tuile onto prepared baking sheet, spacing 4 inches apart. Using small metal spatula or back of spoon, spread batter to thin 3- to 3 1/2-inch rounds. Bake until tuiles are golden, about 22 minutes. Working quickly and using metal spatula, transfer tuiles to racks. Return baking sheet to oven briefly if tuiles harden and stick slightly to sheet. Working in batches, repeat with remaining batter, spraying baking sheet with vegetable oil spray before each batch. Cool completely.",
        "Boil first 7 ingredients in heavy large pot until liquid is reduced to 2 1/2 cups, about 4 minutes. Arrange pineapple rounds in layers in pot. Reduce heat to medium; cover and cook until pineapple is tender and translucent, turning rounds occasionally, about 20 minutes. Using slotted spoon, transfer pineapple rounds to large baking sheet. Cool. Strain pineapple cooking liquid; return to same pot. Boil until syrup is reduced to 1/2 cup, about 5 minutes. Transfer to bowl and cool. (Tuiles, pineapple and syrup can be prepared 1 day ahead. Store tuiles in airtight container. Cover and refrigerate pineapple and syrup separately. Bring to room temperature before assembling dessert.)",
        "Beat mascarpone, cream and sugar in large bowl until firm peaks form. Beat in rum.",
        "Place 1 tuile on each of 6 plates. Place 1 pineapple round atop each. Spread 3 tablespoons mascarpone cream atop pineapple. Top with another tuile, 3 tablespoons mascarpone cream, then 1 pineapple round. Spoon remaining mascarpone cream into pastry bag fitted with medium star tip. Pipe rosettes in center of pineapple rounds. Drizzle pineapple syrup around napoleon. Surround with strawberry slices and serve."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 cups unsweetened shredded coconut (about 5 ounces)",
        "1/4 cup all purpose flour",
        "1 1/4 cups sugar",
        "2 tablespoons plus 1 teaspoon unsalted butter, room temperature",
        "3/4 cup egg whites (about 6 large)",
        "3 cups canned unsweetened pineapple juice",
        "1/2 cup sugar",
        "7 cardamom pods, cut in half",
        "1 teaspoon black peppercorns",
        "2 whole cloves",
        "1 cinnamon stick",
        "1/2 jalapeño chili with seeds",
        "1 large pineapple, peeled, cored, cut into 12 rounds (each about 1/3 inch thick)",
        "12 ounces mascarpone cheese (about 1 cup plus 2 tablespoons)",
        "1 1/4 cups chilled whipping cream",
        "1/4 cup sugar",
        "1 tablespoon dark rum",
        "1 1-pint basket strawberries, hulled, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Strawberry",
        "Coconut",
        "Pineapple",
        "Boil",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pineapple-Coconut Napoleons with Mascarpone Cream and Pineapple Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/pineapple-coconut-napoleons-with-mascarpone-cream-and-pineapple-syrup-4244"
}
