{
    "directions": [
        "Stir together 1/3 cup reserved pineapple juice, rice wine vinegar, soy sauce, olive oil, vanilla vodka, ginger, brown sugar, and white sugar in a mixing bowl until blended. Adjust the sugar to taste.",
        "Place the steak strips in a large, resealable plastic bag. Pour in the pineapple juice mixture and seal the bag. Turn the bag gently to evenly coat steak with the marinade. Refrigerate 3 to 4 hours.",
        "Bring water to a boil in a saucepan over medium-high heat. Add the rice and stir. Reduce heat, cover and simmer 20 minutes.",
        "Heat 2 tablespoons olive oil in a skillet over medium heat. Remove steak strips from marinade and place in the skillet. Cook and stir the steak strips until browned and no longer pink, about 2 minutes per side. Remove from the heat, cover and keep warm.",
        "Place the pineapple chunks in a separate skillet. Cook over medium heat until slightly soft and heated through, about 4 minutes. To serve, divide the rice between two bowls, top with steak strips and pineapple chunks, and toss briefly."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2322&h=1216&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2843185.jpg",
    "ingredients": [
        "1 (8 ounce) can pineapple chunks - drained with juice reserved",
        "2 teaspoons rice wine vinegar",
        "2 tablespoons soy sauce",
        "1 teaspoon olive oil",
        "1 teaspoon vanilla-flavored vodka",
        "½ teaspoon ground ginger",
        "½ teaspoon brown sugar",
        "½ teaspoon white sugar",
        "1 (1 1/2-pound) beef sirloin steak, cut into 1/4-inch strips",
        "1 ½ cups water",
        "½ cup long grain white rice",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pineapple Steak Stir Fry",
    "url": "http://allrecipes.com/recipe/141992/pineapple-steak-stir-fry/"
}