{
    "directions": [
        "Place tomatoes with their juice in large bowl. Add next 7 ingredients and mix to blend. Season with salt and pepper.",
        "Rinse grape leaves under cold water. Drain. Cover bottom of heavy large Dutch oven with grape leaves (about 6). Place 1 grape leaf on work surface, vein side up; cut off stem. Place about 1 tablespoon rice mixture in center of leaf toward stem end. Fold sides over filling. Starting at stem end of leaf, roll up tightly as for egg roll. Place in Dutch oven, seam side down. Repeat with more leaves and rice mixture, layering dolmades when bottom of pot is filled.",
        "Pour lemon juice over dolmades. Cover with grape leaves (about 6). Add enough water to pot so that dolmades are almost covered. Place heatproof plate atop dolmades to weigh down. Cover pot and bring to boil. Reduce heat to low; simmer until rice is tender almost all liquid is absorbed, about 35 minutes.",
        "Remove from heat; uncover. Allow dolmades to cool in pot. Drain any liquid remaining in pot. (Can be prepared 2 days ahead, Cover and chill.) Arrange dolmades on platter. Serve with Yogurt-Feta dip.",
        "Place all ingredients in processor and puree until almost smooth. Season with pepper. Chill until cold, about 2 hours. (Can be made 2 days ahead. Keep chilled.)",
        "Makes about 1 1/2 cups."
    ],
    "ingredients": [
        "1 14 1/2 ounce can diced tomatoes",
        "1 cup long-grain white rice",
        "1 cup thinly sliced green onions",
        "1/2 cup (packed) finely chopped fresh mint (about 3 bunches)",
        "1/2 cup (packed) finely chopped fresh dill (about 4 bunches)",
        "1/2 cup pine nuts, toasted",
        "1/3 cup extra-virgin olive oil",
        "2 large garlic cloves, minced",
        "52 (about) grape leaves from jar (about two 2-pound jars)",
        "1/4 cup fresh lemon juice",
        "1 cup plain yogurt (do not use low-fat or nonfat)",
        "4 ounces feta cheese, crumbled",
        "1 large green onion, cut into 1-inch pieces",
        "1/4 teaspoon grated lemon peel"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rice",
        "Tomato",
        "Appetizer",
        "Vegetarian",
        "Yogurt",
        "Ramadan",
        "Feta",
        "Mint",
        "Pine Nut",
        "Dill"
    ],
    "title": "Pine Nut Dolmades with Yogurt-Feta Dip",
    "url": "http://www.epicurious.com/recipes/food/views/pine-nut-dolmades-with-yogurt-feta-dip-1643"
}
