{
    "directions": [
        "Drain pineapple; reserve 1 tablespoon juice.  Chop 2 pineapple slices; set aside for rice.",
        "Mix together reserved juice, garlic powder, thyme, nutmeg, allspice, salt and cinnamon in small bowl, until blended.",
        "Arrange chicken on foil-lined sheet pan.  Season with salt and pepper.  Rub each breast half with spice mixture over and under the skin.  Place two pineapple slices on each breast.  Bake at 350 degrees F 30 to 40 minutes, or until internal temperature of chicken reaches 165 degrees F and is no longer pink in center (Note: if using chicken legs, time will need to be increased 15 to 25 minutes).",
        "Cook olive oil, red onion and red pepper over medium-high heat in medium saucepan about 5 minutes or until onions are tender.  Add rice and chopped pineapple to sauce pan, cook 3 minutes more.  Add chicken broth, heat to boiling.  Reduce heat to simmer and cook for 15 minutes or until all liquid is absorbed.  Add chopped basil; let stand 5 minutes before serving.",
        "Arrange rice and chicken on 4 plates for service.  Garnish with additional chopped basil, if desired."
    ],
    "ingredients": [
        "1 (20 ounce) can DOLE® Pineapple Slices",
        "1 teaspoon garlic powder",
        "1 teaspoon ground thyme",
        "1 teaspoon ground nutmeg",
        "1 teaspoon ground allspice",
        "1/2 teaspoon kosher salt",
        "1/2 teaspoon ground cinnamon",
        "4 boneless skinless chicken breast halves",
        "1 tablespoon olive oil",
        "1/4 cup red onion, finely chopped",
        "1/4 cup chopped red bell pepper",
        "1 cup Jasmine rice",
        "1 1/2 cups reduced-sodium chicken broth",
        "1 tablespoon chopped fresh basil",
        "Salt and ground pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pineapple Spiced Chicken and Rice",
    "url": "http://allrecipes.com/recipe/232611/pineapple-spiced-chicken-and-rice/"
}
