{
    "directions": [
        "Preheat oven to 375°F. and lightly coat an 11-inch tart pan with a removable fluted rim with vegetable-oil cooking spray.",
        "In a food processor grind graham crackers with sugar to fine crumbs. Working quickly, line tart pan with 1 phyllo sheet, allowing edges to overhang evenly, and with a pastry brush dot phyllo on bottom of tart pan with butter in 4 or 5 places. Sprinkle phyllo in bottom of tart pan evenly with one third crumb mixture and top with another phyllo sheet, arranging it at right angles to first phyllo sheet so overhang is even all around. Dot phyllo with butter and sprinkle with one third crumb mixture in same manner. Repeat layering procedure with remaining 2 phyllo sheets, remaining one third crumb mixture, and butter in same manner, ending with phyllo. Trim phyllo overhang with scissors to 1 inch beyond rim of tart pan and roll toward center, forming a shallow edge just inside tart pan. Brush shell with remaining butter and bake in middle of oven 12 minutes, or until golden and crisp. Cool shell in tart pan on a rack. Shell may be made 1 day ahead and kept, covered loosely, in tart pan in a cool dry place.",
        "In a heavy 12-inch skillet simmer pineapple, sugars, vanilla seeds, and reserved vanilla pod over moderate heat, carefully turning pineapple occasionally (try to keep slices whole), until most liquid is evaporated and pineapple is slightly translucent (reducing heat as liquid is evaporated), about 25 minutes. Cool mixture slightly and discard vanilla pod.",
        "Arrange pineapple in overlapping concentric circles in shell and top with any remaining syrup in skillet. Tart may be made 1 day ahead and kept, covered loosely, at room temperature."
    ],
    "ingredients": [
        "vegetable-oil cooking spray",
        "three 2 1/2-inch-square graham crackers",
        "1 1/2 tablespoons granulated sugar",
        "four 17- by 12-inch phyllo sheets, thawed if frozen, stacked between  2 sheets wax paper and covered with a kitchen towel",
        "2 tablespoons unsalted butter, melted",
        "1 large ripe pineapple (about 41/4 pounds), peeled, halved lengthwise, cored, and cut crosswise into 1/4-inch-thick slices",
        "1/4 cup packed light brown sugar",
        "1/4 cup granulated sugar",
        "seeds scraped from 1/2 vanilla bean, halved lengthwise, and pod reserved"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Pineapple",
        "Vanilla",
        "Phyllo/Puff Pastry Dough",
        "Gourmet"
    ],
    "title": "Pineapple Tart",
    "url": "http://www.epicurious.com/recipes/food/views/pineapple-tart-13655"
}
