{
    "directions": [
        "Stand one half of pineapple upright. Position a large sharp knife at top of pineapple, at outer edge of core, and slice downward to cut pineapple into two pieces. Set aside piece that does not contain core for assembly of dish, and cut core out of other section. Repeat with the other half of pineapple. Dice enough of cored sections to produce 1/4 cup diced pineapple.",
        "Purée cream cheese and guanabana in a food processor until very smooth, then transfer mixture to a large bowl. Beat heavy cream in a chilled bowl with whisk until it just holds soft peaks. Fold whipped cream, mango, and diced pineapple into cream cheese mixture and refrigerate for at least 2 hours.",
        "Place strawberries in a food processor or blender and sprinkle with sugar. Let stand for 10 minutes, then process until smooth. Strain and refrigerate until ready to serve.",
        "Preheat broiler. Starting with wider sides, cut 6 thin slices from each half of reserved pineapple using a mandoline or sharp knife, for a total of 12 slices. Trim slices so they are evenly rectangular, lay on a greased baking sheet, and sprinkle with sugar. Broil until sugar melts and browns, about 10 minutes.",
        "To assemble one \"lasagna\": Lay 1 slice of pineapple, sugar side up, on a plate. Spread with guanabana cream, then top with another slice of pineapple, sugar side up, and more guanabana cream. Finish with a third slice of pineapple, sugar side up. Repeat to form 3 more \"lasagnas.\" Decorate with strawberry sauce and serve."
    ],
    "ingredients": [
        "1 fresh pineapple, peeled and cut in half lengthwise",
        "6 oz cream cheese, at room temperature",
        "6 oz guanabana purée",
        "1/4 cup chilled heavy cream",
        "1/4 cup diced ripe mango",
        "3 ounces strawberries, chopped",
        "7 tablespoons sugar",
        "1/4 cup sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Broil",
        "Kid-Friendly",
        "Cream Cheese",
        "Strawberry",
        "Mango",
        "Pineapple",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pineapple \"Lasagna\"",
    "url": "http://www.epicurious.com/recipes/food/views/pineapple-lasagna-109616"
}
