{
    "directions": [
        "Put oven rack in middle position and preheat oven to 375°F. Toast nuts in 1 layer in a shallow baking pan in oven, stirring once or twice, until golden, about 5 minutes. Cool completely in pan on a rack. Coarsely chop 1/4 cup nuts and set aside.",
        "Pulse flour, sugar, salt, and remaining 1/2 cup nuts in a food processor until nuts are finely chopped, then add butter and pulse until mixture resembles coarse meal. Add egg and process until dough begins to come together into a ball but is still crumbly. Form dough into a ball with your hands. Press about 1 tablespoon dough evenly over bottom and up side of each pie plate. Chill shells until firm, about 30 minutes.",
        "Lightly prick bottoms and sides of chilled pie shells all over with a fork.",
        "Bake until edges are golden and bottoms are pale golden, 12 to 15 minutes.",
        "Cool completely in pans on racks. Loosen edges of shells carefully with offset spatula, then carefully remove shells from pans and transfer to a shallow baking pan. Sprinkle chopped nuts into bottoms of shells. Leave oven on.",
        "Simmer butter, pineapple, brown sugar, and lemon juice in a 12-inch heavy skillet over moderate heat, stirring occasionally, until most of liquid is evaporated and pineapple is slightly translucent, about 10 minutes.",
        "Cool slightly, then spoon a heaping tablespoon of filling into each shell.",
        "Beat whites with cream of tartar in a large bowl with an electric mixer at high speed until they just hold soft peaks. Gradually beat in sugar and beat until meringue holds stiff, glossy peaks. Spoon about 2 tablespoons meringue over filling of each pie, covering filling completely and sealing meringue to pastry.",
        "Draw meringue up into small peaks and bake until tops are golden in spots, about 5 minutes.",
        "Cool pies on racks, about 30 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "3/4 cup salted macadamia nuts (about 3 ounces)",
        "1 cup all-purpose flour",
        "2 tablespoons sugar",
        "1/4 teaspoon salt",
        "1/2 stick (1/4 cup) cold unsalted butter, cut into 1/2-inch cubes",
        "1 large egg, lightly beaten",
        "3 tablespoons unsalted butter",
        "2 1/4 cups diced (1/4 inch) cored peeled fresh pineapple (labeled \"extra sweet\")",
        "1/4 cup packed light brown sugar",
        "1 tablespoon fresh lemon juice",
        "2 large egg whites",
        "1/8 teaspoon cream of tartar",
        "1/4 cup sugar",
        "Special equipment: 12 (2- to 2 1/2-inch) metal pie plates or a mini-muffin pan with 12 (1/8-cup) cups; an offset metal spatula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Mixer",
        "Dairy",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Pineapple",
        "Macadamia Nut",
        "Summer",
        "Gourmet",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pineapple Macadamia Nut Meringue Pies",
    "url": "http://www.epicurious.com/recipes/food/views/pineapple-macadamia-nut-meringue-pies-235040"
}
