{
    "directions": [
        "Preheat the oven to 400°F (205°C).",
        "In a large bowl, toss the mustard greens with 1 teaspoon of the oil and season with salt and pepper. Set aside.",
        "Trim the cauliflower and break it into florets. Put the cauliflower and garlic in a 9-by-13-inch (23-by-33-cm) baking dish, drizzle with 1 tablespoon of the oil, and sprinkle with salt and pepper to taste. Toss to coat with the oil. Roast until the cauliflower is very tender and golden brown, about 40 minutes.",
        "Meanwhile, in a small saucepan, heat 1 tablespoon of the butter over medium-high heat. Add the shallot and a pinch of salt and cook, stirring occasionally, until just starting to brown, about 5 minutes. Add the wine and cook until reduced by about half, then add the cream and lemon zest. Simmer over medium heat until reduced and thickened, about 6 minutes, then whisk in the lemon juice. Remove from the heat. Season with salt to taste and set aside, covered to keep warm.",
        "Add the greens to the cauliflower and toss with a metal spatula. Sprinkle with a little water and roast until the greens are wilted and tender and beginning to crisp, 5 to 7 minutes.",
        "In an extra-large sauté pan (or two large ones), heat the remaining 1 tablespoon butter and 2 tablespoons oil over medium-high heat. Spread the oats on a plate. Season the fish with salt and pepper and lay each fillet on the oats, pressing gently so the oats adhere to one side. Put the fish in the pan (or pans), oat side down, and cook without disturbing until the oats are nicely browned and the opaqueness has moved about a third of the way through the thickest part of the fish, about 4 minutes depending on the thickness of the fillets. Use a metal spatula to carefully turn the fish over and cook until just opaque throughout, about 4 minutes. Pile the cauliflower, garlic, and greens on 4 serving plates, top with the fish, and spoon some of the sauce over everything. Serve immediately."
    ],
    "ingredients": [
        "2 packed cups (85 g) chopped mustard greens",
        "3 tablespoons plus 1 teaspoon olive oil",
        "Salt and freshly ground black pepper",
        "1/2 head cauliflower",
        "4 cloves garlic, peeled",
        "2 tablespoons unsalted butter",
        "1 large shallot, minced",
        "1/2 cup (120 ml) white wine",
        "1 cup (240 ml) heavy cream",
        "Finely grated zest of 1/2 lemon",
        "1 tablespoon freshly squeezed lemon juice",
        "1/2 cup (90 g) raw pinhead (Scottish) oats",
        "4 (6-ounce / 170-g) pieces catfish fillet"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Leafy Green",
        "Vegetable",
        "Bake",
        "Sauté",
        "Wheat/Gluten-Free",
        "Dinner",
        "Oat",
        "Seafood",
        "Cauliflower",
        "Mustard Greens",
        "Advance Prep Required",
        "Sugar Conscious",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pinhead Oat-Crusted Catfish, Roasted Cauliflower and Mustard Greens, and Lemon Cream",
    "url": "http://www.epicurious.com/recipes/food/views/pinhead-oat-crusted-catfish-roasted-cauliflower-and-mustard-greens-and-lemon-cream-51123010"
}
