{
    "directions": [
        "Using a small, sharp knife, slice off the top and bottom of 5 of the grapefruits. Cut down the side of each grapefruit, following its natural line, to remove the skin and white pith. Over a small bowl, cut between the membranes to remove the individual segments. Place in a colander to drain and gently squeeze any remaining juices into a small saucepan.",
        "Squeeze enough juice from the last grapefruit to bring the juice in the pan up to 1 1/4 cups (10 fl. oz./310 ml). Add the sugar and chile and bring to a boil. Reduce the heat to medium and simmer until the sauce thickens and you have about 5 Tbs. remaining, about 30 minutes. Set aside to cool, then whisk in the olive oil, lemon juice, sumac and salt.",
        "To assemble the salad, put the grapefruit segments, onion, endive, watercress and basil in a large bowl. Pour over three-quarters of the dressing and toss very gently. Add the remainder of the dressing if the salad seems dry; otherwise, keep in the fridge to save for another leafy salad. Serve immediately. Serves 4.",
        "Adapted from",
        "Plenty More: Vibrant Vegetable Cooking from London’s Ottolenghi",
        ", by Yotam Ottolenghi (Ten Speed Press, 2014)."
    ],
    "ingredients": [
        "6 pink or red grapefruits, about 5 lb. (2.5 kg) total",
        "2 Tbs. superfine sugar",
        "1 small dried red chile (or less if it is very hot)",
        "4 Tbs. (2 fl. oz./60 ml) olive oil",
        "1 1/2 Tbs. fresh lemon juice",
        "1 Tbs. sumac",
        "1/4 tsp. salt",
        "1/2 red onion, very thinly sliced",
        "2 to 3 small heads red Belgian endive, leaves separated and any large leaves halved\n  diagonally (about 9 oz./280 g total)",
        "Scant 3 cups (2 3/4 oz./80 g) watercress",
        "2/3 cup (2/3 oz./20 g) fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pink Grapefruit & Sumac Salad",
    "url": "http://www.williams-sonoma.com/recipe/pink-grapefruit---sumac-salad.html"
}
