{
    "directions": [
        "Cook rind in heavy medium saucepan of boiling water 1 minute; drain. Bring more water to boil in same pan; add rind, boil 1 minute, and drain. Repeat 3 more times (for total of 5 times).",
        "Combine blanched rind, sugar, grapefruit juice, and star anise in same medium saucepan. Stir over medium heat until sugar dissolves. Reduce heat to medium-low and simmer until mixture is almost dry, stirring occasionally, about 18 minutes. Discard star anise. Transfer mixture to mini processor and puree until smooth. Transfer marmalade to small bowl. DO AHEAD: Can be made 2 weeks ahead. Cover and chill.",
        "Blend flour, powdered sugar, and salt in processor 5 seconds. Add butter; using on/off turns, cut in butter until fine meal forms. Add whipping cream; blend until moist clumps form. Shape dough into thin square; wrap and chill 30 minutes.",
        "Line small baking sheet with parchment paper. Roll out dough on lightly floured surface to 1/8-inch-thick square, trimming if necessary. Cut six 3x2-inch rectangles; transfer to prepared sheet. Cover and chill at least 30 minutes and up to 1 day.",
        "Preheat oven to 350°F. Bake pastries uncovered until pale golden but brown at edges, about 12 minutes. Cool pastries on sheet.",
        "Preheat oven to 250°F. Line large rimmed baking sheet with parchment paper. Cut top and bottom 1/2 inch off each grapefruit. Stand each on 1 flat end. Following contour of fruit, cut off all peel and white pith. Working over bowl, cut grapefruits between membranes, releasing segments into bowl.",
        "Drain grapefruit segments well. Arrange segments, on sides and spaced apart, on prepared sheet. Bake segments until dry to touch but still moist inside, about 1 hour. Cool on sheet.",
        "Spread 1 tablespoon marmalade on each pastry. Place pastries on plates. Arrange 3 grapefruit segments on each. Scoop Edamame Ice Cream alongside, garnish with celery leaves, and sprinkle lightly with sesame seeds.",
        "*A brown star-shaped seedpod; available in the spice section of some supermarkets and at specialty foods stores and Asian markets."
    ],
    "ingredients": [
        "2 cups 1/4-inch cubes pink grapefruit rind (peel and white pith; from 2 pink grapefruits)",
        "2/3 cup sugar",
        "1/2 cup fresh pink grapefruit juice",
        "1 whole star anise*",
        "2/3 cup all purpose flour",
        "1/4 cup powdered sugar",
        "Pinch of salt",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "2 tablespoons chilled whipping cream",
        "2 large pink grapefruits",
        "Edamame Ice Cream",
        "Chopped celery leaves or micro celery",
        "Black sesame seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Dessert",
        "Bake",
        "Frozen Dessert",
        "Grapefruit",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pink Grapefruit Tart with Edamame Ice Cream and Black Sesame Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/pink-grapefruit-tart-with-edamame-ice-cream-and-black-sesame-seeds-239809"
}
