{
    "directions": [
        "First make the dressing. Combine the mustard and sherry vinegar in a bowl and add a pinch each of salt and pepper. Whisk in the olive oil, followed by the hazelnut oil to emulsify, then set aside.",
        "Preheat the oven to 350°F (180°C). Place the nuts on a baking sheet and roast in the middle of the oven for 3 to 4 minutes to warm and release their flavor. Turn into a cloth and rub gently to remove the skins, then roughly chop the nuts.",
        "For the salad, wash the watercress and gently pat dry. Peel the grapefruit, removing all the pith, then cut out the segments over a large bowl to catch the juice as well as the segments. Halve, pit, and peel the avocado, then cut into slices, similar in size to the grapefruit. Add to the grapefruit with the watercress and toss gently with your fingers to mix.",
        "If the dressing has separated on standing, give it a whisk, then drizzle half of it over the salad and toss lightly, so you don't break up the avocado or grapefruit. Taste and adjust the seasoning.",
        "Arrange the salad on a plate, interleaving the prosciutto slices and romano if using, with the watercress, grapefruit, and avocado. Sprinkle with the minced parsley and drizzle over the remaining dressing. Finally, scatter over the hazelnuts and serve."
    ],
    "ingredients": [
        "16 shelled hazelnuts",
        "bunch of watercress",
        "1 pink grapefruit",
        "1 ripe avocado",
        "8–12 slices of prosciutto",
        "8–12 wafer-thin slices of young romano (optional)",
        "1 tablespoon minced parsley",
        "1 tablespoon Dijon mustard",
        "2 tablespoons sherry vinegar",
        "sea salt and freshly ground black pepper",
        "3 tablespoons (40ml) mild-tasting extra-virgin olive oil",
        "3 tablespoons hazelnut oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Citrus",
        "Fruit",
        "Pork",
        "Vegetable",
        "Appetizer",
        "Side",
        "Roast",
        "Grapefruit",
        "Ham",
        "Avocado",
        "Prosciutto",
        "Watercress",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Pink Grapefruit, Avocado, and Watercress Salad",
    "url": "http://www.epicurious.com/recipes/food/views/pink-grapefruit-avocado-and-watercress-salad-363393"
}
