{
    "directions": [
        "Cut onion and bell peppers into 1/4-inch dice. Drain whole tomatoes, reserving juice, and chop. Halve olives crosswise.",
        "Heat a large nonstick skillet until hot and crumble beef into skillet. Sauté beef over moderately high heat, stirring and breaking up any clumps, until no longer pink, about 5 minutes. Stir in salt, black pepper, onion, and bell peppers and sauté, stirring, until vegetables are softened, any juices are evaporated, and meat begins to brown, about 6 minutes. Stir in tomatoes with reserved juice, olives, and remaining filling ingredients and simmer, partially covered and stirring occasionally, until most of liquid is evaporated, about 30 minutes. Discard bay leaves. Cool filling uncovered. Filling may be made 2 days ahead and chilled, covered.",
        "Cut ends from plantains and peel fruit. Diagonally cut plantains into 1/3-inch-thick slices. In a large nonstick skillet heat 1/3 cup oil over moderately high heat until hot but not smoking and sauté plantains in batches, without crowding, until golden brown, 1 to 2 minutes on each side, adding remaining oil to skillet as necessary. With a slotted spatula transfer plantains as fried to paper towels to drain.",
        "Preheat oven to 350°F. Oil a 2 1/2-quart baking dish (about 1 1/2 inches deep).",
        "In a small bowl beat together eggs and water and pour half of mixture into baking dish, tilting to coat bottom and sides. Arrange about one third plantains over bottom and up sides of baking dish tightly in one layer. Spread half of filling in dish and sprinkle with half of Parmesan. Arrange half of remaining plantains on top of Parmesan in one layer. Top plantains with remaining filling and sprinkle with remaining Parmesan. Top pie with remaining plantains. Pour remaining egg mixture over pie, tilting dish so egg spreads to edges.",
        "Bake pie, covered with foil, in middle of oven until heated through and bubbling at edges, about 1 hour. Cool pie 10 minutes. (If desired, unmold before serving: Run a thin knife around edge of pie, invert a serving plate on top of pie, and invert pie onto serving plate.)"
    ],
    "ingredients": [
        "1 medium onion",
        "1/2 small green bell pepper",
        "1/2 small red bell pepper",
        "a 14- to 16-ounce can whole tomatoes",
        "1/3 cup drained pimiento-stuffed green olives",
        "1 pound ground beef chuck",
        "1/4 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "1/2 cup tomato sauce",
        "2 tablespoons raisins",
        "1 tablespoon cider vinegar",
        "2 bay leaves",
        "1/4 teaspoon ground achiote (optional)",
        "6 semi-ripe (yellow with some spots) plantains",
        "1/3 to 1/2 cup olive or canola oil",
        "2 large eggs",
        "2 tablespoons water",
        "1/4 cup freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Egg",
        "Fruit",
        "Onion",
        "Tomato",
        "Vegetable",
        "Bake",
        "Casserole/Gratin",
        "Parmesan",
        "Ground Beef",
        "Bell Pepper",
        "Winter",
        "Plantain",
        "Potluck",
        "Gourmet"
    ],
    "title": "Pinon",
    "url": "http://www.epicurious.com/recipes/food/views/pinon-15742"
}
