{
    "directions": [
        "Cut a piece of salt pork into eight thin slices. To tie up hens, place breast up and put thin string over legs, then bring string behind them. Cross string in front by breastbone, then carry around joint of leg near body. Flip hen over. Pull string up from legs and through flaps of wing joints, bringing ends together in center. Tuck loose skin under string. Knot firmly. Bend back wing tips to lie flat against hen's body. Tuck salt pork slices between legs and breast. Cover tops of hens with two more slices pork. Tie fat twice with string to keep it in place.",
        "Melt 6 tablespoons butter in a cocotte or casserole, arrange guinea hens in butter and season them with salt and pepper. Roast in a 375°F oven for 40 minutes, basting twice with butter in pan.",
        "Meanwhile sauté the mushrooms (sliced if they are large, whole if they are small) in remaining butter. When guinea hens are tender and brown, remove to a hot serving platter, remove barding pork and cut them in half for serving. Skim off excess fat from liquid in casserole, pour the juices into a skillet, add the champagne and reduce rapidly over high heat until liquid is half the original amount. Mix egg yolks and cream. Lower heat and carefully stir the egg-cream mixture into the hot liquid (it is a wise precaution to mix one teaspoon potato starch with the egg-cream mixture to prevent the sauce from separating). Cook, stirring, over very low heat, being careful not to let the sauce boil. When smooth and slightly thickened, taste for seasoning and add the mushrooms with their juices. Pour the sauce over the guinea hens. Garnish with the croutons and serve with fondant potatoes and sautéed green beans.",
        "With this, drink a fine dry champagne."
    ],
    "ingredients": [
        "2 Guinea hens",
        "Thin slices of salt pork",
        "12 tablespoons butter",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 pound mushrooms",
        "1 cup champagne",
        "3 egg yolks",
        "1 cup heavy cream",
        "Garnish: tiny fried croutons dipped in finely chopped parsely"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Game",
        "Pork",
        "Poultry",
        "Roast",
        "Christmas",
        "Winter",
        "House & Garden"
    ],
    "title": "Pintade au Champagne",
    "url": "http://www.epicurious.com/recipes/food/views/pintade-au-champagne-101464"
}
