{
    "directions": [
        "In a saucepan simmer the water with the brown sugar until the sugar is dissolved and stir in the cinnamon. Spread the 10 bread slices on one side with the butter and halve each slice diagonally. Arrange half the white bread and half the raisin bread, buttered sides down, decoratively in a buttered 13-by 9-inch baking dish and sprinkle half of the Longhorn over the bread. Peel the apples, grate them coarse, and sprinkle them over the cheese. Top the apples with the remaining cheese and arrange the remaining bread, buttered sides down, decoratively on top, trimming the bread as necessary to fit in one layer. Pour the brown sugar syrup evenly over the bread pudding, pressing down on the top slightly with a spatula, and let the pudding stand, covered, for 1 hour.",
        "Preheat the oven to 350°F. Bake the pudding in the middle of the oven for 30 minutes, spread the jelly over the top, and let the pudding stand for 5 minutes. Serve the bread pudding warm with the ice cream."
    ],
    "ingredients": [
        "2 1/2 cups water",
        "1 1/2 cups firmly packed light brown sugar",
        "1/2 teaspoon cinnamon",
        "5 slices of homemade-style white bread, toasted and the crust discarded",
        "5 slices of homemade-style raisin bread, toasted and the crusts discarded",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "1/2 pound Longhorn (Colby) or mild Cheddar, grated",
        "2 Granny Smith apples",
        "1 cup apple jelly, melted",
        "vanilla ice cream as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Cheddar",
        "Raisin",
        "Apple",
        "Winter",
        "Gourmet"
    ],
    "title": "Pinto Raisin Bread Pudding with Apples and Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/pinto-raisin-bread-pudding-with-apples-and-cheese-11731"
}
