{
    "directions": [
        "In a kettle combine the beans with enough cold water to cover them by 2 inches and simmer them, covered, for 1 to 1 1/2 hours, or until they are tender. Drain the beans in a colander set over a large bowl and reserve the cooking liquid. In a large heavy skillet cook the sausage over moderate heat, stirring and breaking up any lumps, until it is cooked through and transfer it with a slotted spoon to a bowl. To the fat remaining in the skillet add the oil and in the fat cook the onion, the fennel, the bell pepper, the basil, the thyme, and salt and pepper to taste over moderate heat, stirring, until the vegetables are softened. Add the broth and simmer the mixture, covered, for 5 to 10 minutes, or until the vegetables are tender. In a blender or food processor purée 1 1/2 cups of the cooked beans with 1 cup of the reserved cooking liquid. Add the purée to the vegetable mixture with the remaining cooked beans, the sausage, the artichoke hearts, the parsley, and salt and pepper to taste and transfer the mixture to a buttered 4-quart gratin dish, 15 by 10 by 2 inches. In a small bowl stir together the bread crumbs and the Parmesan and sprinkle the mixture evenly over the gratin. Dot the gratin with the butter and bake it in the middle of a preheated 350°F. oven for 45 to 50 minutes, or until the top is golden.",
        "In a colander rinse the beans under cold water and discard any discolored ones. In a kettle combine the beans with enough cold water to cover them by 2 inches, bring the water to a boil, and boil the beans for 2 minutes. Remove the kettle from the heat and let the beans soak, for 1 hour."
    ],
    "ingredients": [
        "1 pound dried pinto or red kidney beans, soaked in enough cold water to cover them by 2 inches overnight or quick-soaked (procedure follows)",
        "1 pound Italian sausage, casings discarded and the meat chopped",
        "1 tablespoon olive oil",
        "2 cups finely chopped onion",
        "3 cups thinly sliced fennel bulb (about 1 large bulb)",
        "1 large red bell pepper, cut into thin strips",
        "1 teaspoon dried basil, crumbled",
        "1 teaspoon dried thyme, crumbled",
        "1/2 cup chicken broth",
        "a 10-ounce can artichoke hearts, rinsed, drained well, and each heart cut into 8 pieces",
        "1/2 cup minced fresh parsley leaves",
        "1 cup fresh bread crumbs",
        "1 cup freshly grated Parmesan",
        "1 tablespoon unsalted butter, cut into bits"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Onion",
        "Pork",
        "Side",
        "Casserole/Gratin",
        "Artichoke",
        "Fennel",
        "Bell Pepper",
        "Winter",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pinto Bean, Sausage, and Fennel Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/pinto-bean-sausage-and-fennel-gratin-11489"
}
