{
    "directions": [
        "In a large bowl let the pinto beans soak in enough water to cover them by 2 inches overnight and drain them, or quick-soak them and drain them. In a large heavy kettle cook the onions and 4 of the garlic cloves, minced, in the oil over moderate heat, stirring, until the onions are softened, add the chili powder, the cumin, and the cayenne, and cook the mixture, stirring, for 30 seconds. Add the beans and the water and simmer the mixture, uncovered, adding more water if necessary to keep the beans barely covered, for 45 minutes to 1 hour, or until the beans are tender. Add the broth, the tomatoes, the bell pepper, and the corn and simmer the mixture, stirring occasionally, for 20 minutes. Add the bulgur and the zucchini and simmer the mixture, stirring occasionally, for 20 minutes, or until the zucchini is just tender. Stir in the remaining 2 garlic cloves, minced, the Worcestershire sauce, the olives, and salt and pepper to taste, simmer the chili for 5 minutes, and stir in the coriander. The chili may be frozen or made 4 days in advance, cooled, uncovered, and kept covered and chilled."
    ],
    "ingredients": [
        "1 pound (about 2 1/2 cups) dried pinto beans, picked over and rinsed",
        "2 large onions, chopped",
        "6 garlic cloves",
        "3 tablespoons vegetable oil",
        "1/3 cup chili powder",
        "1 tablespoon ground cumin",
        "1/2 teaspoon cayenne, or to taste",
        "6 cups water",
        "3 cups chicken broth",
        "a 28-ounce can tomatoes, drained and chopped",
        "1 red bell pepper, chopped fine",
        "a 10-ounce package frozen corn",
        "3/4 cup bulgur",
        "2 medium zucchini, scrubbed well and cut into 3/4-inch pieces",
        "2 tablespoons Worcestershire sauce, or to taste",
        "3/4 cup Kalamata or other brine-cured black olives if desired, pitted and chopped",
        "1/3 cup chopped fresh coriander if desired"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Garlic",
        "Olive",
        "Onion",
        "Tomato",
        "Super Bowl",
        "Zucchini",
        "Winter",
        "Gourmet"
    ],
    "title": "Pinto Bean and Vegetable Chili",
    "url": "http://www.epicurious.com/recipes/food/views/pinto-bean-and-vegetable-chili-11344"
}
