{
    "directions": [
        "Mix first 3 ingredients in medium bowl. Set spiced sugar aside. Mix flour, 3/4 cup sugar, baking powder, and salt in large bowl. Using fingertips, rub in chilled butter until coarse meal forms. Add cream and vanilla; stir until moist clumps form. Gently knead dough on lightly floured surface just until smooth.",
        "Roll out dough on lightly floured surface to 9x15-inch rectangle. Brush with melted butter. Sprinkle with spiced sugar. Starting at 1 long side, roll up dough jelly-roll style. Transfer to baking sheet. Cover log with plastic wrap and refrigerate at least 1 hour and up to 1 day.",
        "Preheat oven to 350°F. Blend sugar, vanilla bean, and flour in processor until vanilla is finely chopped; place in large bowl. Add peaches and lemon juice; toss to coat. Transfer peach mixture to 10-inch-diameter cake pan with 2-inch-high sides. Bake until filling is bubbling, about 30 minutes.",
        "Cut dough log crosswise into 1-inch-thick biscuits. Place biscuits atop filling. Bake until biscuits are golden, about 45 minutes. Cool at least 10 minutes. Dust with powdered sugar and serve warm."
    ],
    "ingredients": [
        "1/2 cup (packed) golden brown sugar",
        "2 tablespoons minced crystallized ginger",
        "1/2 teaspoon ground cinnamon",
        "2 cups all purpose flour",
        "3/4 cup sugar",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into small pieces",
        "2/3 cup whipping cream",
        "2 teaspoons vanilla extract",
        "1 tablespoon butter, melted",
        "1/2 cup sugar",
        "1 vanilla bean, coarsely chopped",
        "1 tablespoon all purpose flour",
        "4 pounds peaches, peeled, cut into 1/2-inch-thick slices",
        "2 teaspoons fresh lemon juice",
        "Powdered sugar (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Peach",
        "Summer",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pinwheel Peach Cobbler",
    "url": "http://www.epicurious.com/recipes/food/views/pinwheel-peach-cobbler-106980"
}
