{
    "directions": [
        "In a food processor blend together the flour, the baking powder, the salt, and the butter until the mixture resembles meal. In a small bowl whisk together the egg yolks and the sour cream, add the sour cream mixture to the flour mixture, and blend the mixture until it just forms a dough, adding the water if the dough seems dry. Divide the dough into fourths, form each fourth into a flattened round, and chill the dough, each round wrapped well in wax paper, for 1 hour or overnight.",
        "Peel the potatoes, cut them into 3/4-inch pieces, and in a steamer set over boiling water steam them, covered, for 12 to 15 minutes, or until they are very tender. Force the potatoes through a ricer or food mill into a bowl and stir in 1 tablespoon of the butter. In a heavy saucepan cook the onion and the caraway seeds in the remaining 1 tablespoon butter and the oil over moderate heat, stirring, until the onion is golden, add the cabbage, and cook the mixture, stirring, for 5 minutes. Cook the mixture, covered, over moderately low heat, stirring occasionally, for 5 minutes more and stir it into the potato mixture with the sour cream, the water if the mixture is too thick, the dill, and salt and pepper to taste. The filling may be made 1 day in advance and kept covered and chilled.",
        "On a lightly floured surface roll out 1 piece of the dough 1/8 inch thick, keeping the remaining pieces wrapped and chilled, and with a 3-inch cutter cut out rounds. Brush each round with some of the egg wash, put 2 level teaspoons of the filling on one half of each round, and fold the dough over the filling to form a half-moon, pressing the edges together firmly to seal them and crimping them with a fork. Gather the scraps of dough, reroll them, and make more pirozhki with the remaining filling and dough and some of the remaining egg wash in the same manner. The pirozhki may be made up to this point 5 days in advance and kept frozen in plastic freeze bags. The pirozhki need not be thawed before baking.",
        "Arrange the pirozhki on lightly greased baking sheets and brush the tops with the remaining egg wash. Bake the pirozhki in preheated 350°F. oven for 25 to 30 minutes, or until they are golden, and serve them warm or at room temperature."
    ],
    "ingredients": [
        "2 2/3 cups all-purpose flour",
        "1/2 teaspoon double-acting baking powder",
        "1/2 teaspoon salt",
        "1 1/2 sticks (3/4 cup) cold unsalted butter, cut into bits",
        "2 large egg yolks",
        "1/2 cup sour cream",
        "1 tablespoon cold water if necessary",
        "3/4 pound russet (baking) potatoes",
        "2 tablespoons unsalted butter",
        "1 onion, chopped fine",
        "3/4 teaspoon caraway seeds",
        "1 tablespoon vegetable oil",
        "3 cups chopped cabbage",
        "3 tablespoons sour cream",
        "2 tablespoons water if necessary",
        "3 tablespoons finely chopped fresh dill",
        "an egg wash made by beating 1 large egg with 1 teaspoon water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Onion",
        "Potato",
        "Appetizer",
        "Side",
        "Bake",
        "Vegetarian",
        "Winter",
        "Cabbage",
        "Sour Cream",
        "Dill",
        "Gourmet"
    ],
    "title": "Pirozhki",
    "url": "http://www.epicurious.com/recipes/food/views/pirozhki-11648"
}
