{
    "directions": [
        "Preheat oven to 350°F. Place butter on heavy large rimmed baking sheet; place in oven until butter melts, about 5 minutes. Spread half of onions on baking sheet; top with 3 thyme sprigs, 2 rosemary sprigs and 1 bay leaf. Sprinkle with salt and pepper. Drizzle with 3 tablespoons oil. Top with remaining onions, 3 thyme sprigs, 2 rosemary sprigs, and 1 bay leaf. Sprinkle with salt and pepper. Drizzle with 3 tablespoons oil (onion layer will be about 2 1/2 inches thick but will settle during baking). Bake until onions are very tender and golden, stirring and turning every 30 minutes, about 2 hours total. Cool. Discard herb sprigs and bay leaves. (Can be made 1 day ahead. Cover; chill. Bring to room temperature before using.)",
        "Pour 1 cup warm water into small bowl; sprinkle yeast and sugar over. Stir to blend. Let stand until foamy, about 10 minutes.",
        "Blend 2 3/4 cups flour and salt in processor. Add yeast mixture and 2 tablespoons oil; process until dough clumps together, adding more flour by tablespoonfuls if dough is sticky. Process until shiny ball forms, about 1 minute. Turn dough out onto floured work surface and knead until smooth and elastic, about 5 minutes. Coat large bowl with remaining 1 tablespoon oil. Add dough to bowl; turn to coat with oil. Cover with plastic wrap, then kitchen towel. Let rise in warm draft-free area until doubled in volume, about 1 1/2 hours. Punch down dough; cover and let rise until puffed and almost doubled, about 1 hour.",
        "Sprinkle heavy 17x11x1-inch baking sheet with cornmeal. Roll out dough on lightly floured surface to 18x12-inch rectangle. Transfer to prepared baking sheet; press edges of dough up along sides and corners of sheet. Cover with dry kitchen towel; let rise until slightly puffed, 1 hour.",
        "Preheat oven to 475°F. Spread onions over top of dough. Arrange anchovies and olives atop. Bake until crust is golden, about 15 minutes. Sprinkle with thyme. Cut into 3-inch squares. Serve warm or at room temperature. (Can be made 4 hours ahead; let stand at room temperature.)"
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) butter",
        "6 pounds onions, thinly sliced",
        "6 fresh thyme sprigs",
        "4 fresh rosemary sprigs",
        "2 bay leaves",
        "6 tablespoons extra-virgin olive oil",
        "1 cup warm water (105°F to 115°F)",
        "1 tablespoon dry yeast (from 2 envelopes)",
        "1 teaspoon sugar",
        "2 3/4 cups (or more) all purpose flour",
        "1 teaspoon salt",
        "3 tablespoons extra-virgin olive oil",
        "Yellow ornmeal",
        "20 drained anchovy fillets",
        "20 oil-cured black olives, pitted",
        "1 tablespoon chopped fresh thyme"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Olive",
        "Onion",
        "Side",
        "Bake",
        "Rosemary",
        "Fall",
        "Thyme",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pissaladiere",
    "url": "http://www.epicurious.com/recipes/food/views/pissaladiere-105654"
}
