{
    "directions": [
        "Divide the pizza dough in half and form each half into a ball.",
        "Prepare a hot fire in a grill and preheat a pizza stone for at least 30 minutes, until the thermometer on the stone registers 500°F.",
        "In a large sauté pan over medium-high heat, warm the 2 Tbs. olive oil. Add the onions, salt, bay leaf and thyme and cook, stirring occasionally, until the onions brown, 4 to 5 minutes. Reduce the heat to low and continue cooking, stirring occasionally, until the onions are tender and translucent, 4 to 5 minutes more. Remove the bay leaf and thyme sprigs and discard. Let the onions cool.",
        "Using a rolling pin or your hands, gently roll out or stretch 1 ball of dough into a 10-by-6-inch rectangle. Lightly dust a pizza peel with flour and lay the dough on top. Spread half of the onions evenly over the dough, leaving a 1/2-inch border. Arrange 10 of the anchovy slices on top of the onions in 2 lengthwise rows. Place 1 bell pepper strip across each anchovy strip. Arrange 15 of the olives in 3 lengthwise rows. Carefully slide the",
        "pissaladière",
        "onto the preheated pizza stone, cover the grill and bake until the crust is golden brown, 10 to 12 minutes.",
        "Using a pizza peel, transfer the",
        "pissaladière",
        "to a cutting board. Sprinkle with 1/2 Tbs. of the oregano and cut into slices. Drizzle with olive oil. Repeat with the remaining ingredients. Serves 4 to 6.",
        "Note",
        ": Use a mandoline to slice the onions quickly and evenly. A cherry pitter makes fast work of pitting the olives."
    ],
    "ingredients": [
        "1 batch thin-crust pizza dough",
        "2 Tbs. extra-virgin olive oil, plus more&nbsp for drizzling",
        "2 yellow onions, cut into slices 1/4 inch thick",
        "1 tsp. salt",
        "1 bay leaf",
        "2 fresh thyme sprigs",
        "All-purpose flour for dusting",
        "10 salt-cured anchovy fillets, rinsed and  halved lengthwise",
        "1 roasted red bell pepper, cut into 20 strips,  each 1/4 inch wide (see tip at right)",
        "30 niçoise olives, pitted",
        "1 Tbs. finely chopped fresh oregano or marjoram"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pissaladière",
    "url": "http://www.williams-sonoma.com/recipe/pissaladiere.html"
}
