{
    "directions": [
        "Preheat oven to 350°F. Line large baking sheet with parchment paper. Whisk flour, baking powder, and salt in medium bowl to blend. Using electric mixer, beat sugar, eggs, oil, and almond extract in large bowl until well blended. Add flour mixture and beat until smooth. Stir in pistachios, dried berries, and 1/2 cup chopped white chocolate. Drop dough by heaping tablespoonfuls in two 12-inch-long strips on prepared baking sheet, spacing strips 3 inches apart. Using wet fingertips, shape each strip into 3-inch-wide log, pressing evenly (logs may look slightly lumpy).",
        "Bake logs until lightly browned and almost firm to touch, about 30 minutes. Cool logs on sheet 30 minutes. Reduce oven temperature to 325°F.",
        "Carefully transfer logs to cutting board. Line same baking sheet with parchment paper. Cut each log crosswise into generous 1/2-inch-thick slices. Stand biscotti upright, spacing about 1/4 inch apart, in 3 rows on prepared baking sheet. Bake until pale golden (biscotti may be soft but will firm as they cool), about 20 minutes. Cool completely on baking sheet.",
        "Line another large baking sheet with parchment paper. Place 8 ounces chopped white chocolate in medium glass bowl. Place 8 ounces chopped bittersweet chocolate in another medium glass bowl, if desired. Microwave separately on medium in 20-second intervals just until chocolate is soft to touch, about 40 seconds total (do not overheat or chocolate will burn or seize). Stir chocolate until smooth.",
        "Dip 1 end or 1 side of each biscotti in chocolate; place on baking sheet. Chill until chocolate is set, about 30 minutes. (Can be made ahead. Arrange in single layer in airtight container and chill up to 5 days or freeze up to 2 weeks.)"
    ],
    "ingredients": [
        "3 cups all purpose flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1 cup sugar",
        "3 large eggs",
        "2 tablespoons canola oil",
        "2 1/2 teaspoons almond extract",
        "3/4 cup shelled raw unsalted natural pistachios",
        "1 cup dried raspberries or chopped dried strawberries (about 5 ounces)",
        "1/2 cup chopped high-quality white chocolate (such as Lindt or Perugina)",
        "8 ounces high-quality white chocolate (such as Lindt or Perugina) and/or 8 ounces bittersweet or semisweet chocolate, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Chocolate",
        "Dessert",
        "Bake",
        "Christmas",
        "Dried Fruit",
        "Pistachio",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pistachio, Raspberry, and White Chocolate Biscotti",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-raspberry-and-white-chocolate-biscotti-233428"
}
