{
    "directions": [
        "Preheat oven to 350°F. Blend shortbread, nuts and sugar in processor until nuts are finely ground. Add butter; process until moist clumps form. Press onto bottom of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Wrap outside of pan with foil. Bake crust until golden, about 15 minutes. Cool crust.",
        "Beat cream cheese, sugar and cardamom in large bowl until smooth. Beat in eggs 1 at a time. Add 1 cup sour cream, pear nectar, flour and vanilla and beat until blended. Pour filling over crust.",
        "Bake cheesecake until puffed at edges and softly set in center, about 1 hour 5 minutes. Transfer cheesecake to rack; let cool 10 minutes.",
        "Meanwhile, stir white chocolate in top of double boiler set over barely simmering water until smooth (do not allow bottom of bowl to touch water). Cool chocolate to lukewarm; whisk in remaining 1 1/4 cups sour cream.",
        "Spread topping over warm filling. Refrigerate cake uncovered overnight. Cut around pan sides; release pan sides. Place cake on platter. Stand brittle pieces on edge in topping on cheesecake."
    ],
    "ingredients": [
        "1 (5 1/2-ounce) package shortbread cookies",
        "1/2 cup natural unsalted pistachios",
        "1/4 cup sugar",
        "1/4 cup (1/2 stick) chilled unsalted butter, diced",
        "3 (8-ounce) packages cream cheese, room temperature",
        "1 1/4 cups sugar",
        "1 teaspoon ground cardamom",
        "4 large eggs, room temperature",
        "2 1/4 cups sour cream",
        "1/2 cup pear nectar",
        "2 tablespoons all purpose flour",
        "2 teaspoons vanilla extract",
        "5 ounces good-quality white chocolate (such as Lindt or Baker's), finely chopped",
        "Pistachio Brittle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Food Processor",
        "Mixer",
        "Cheese",
        "Chocolate",
        "Dairy",
        "Bake",
        "Christmas",
        "Cream Cheese",
        "Pistachio",
        "Winter"
    ],
    "title": "Pistachio Brittle Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-brittle-cheesecake-102701"
}
