{
    "directions": [
        "Cook butter and cardamom in a small saucepan over medium heat, stirring occasionally, until butter is golden brown and fragrant, 6–8 minutes. Let stand 15 minutes, then strain butter through a fine-mesh sieve into a small bowl. Freeze until just firm, about 15 minutes.",
        "Meanwhile, whisk flour, salt, and baking powder in a small bowl.",
        "Transfer butter to the bowl of a stand mixer fitted with the paddle attachment; add sugar. Beat on medium-high speed until pale and well combined, about 2 minutes. Add egg and beat until combined, scraping down sides of bowl as needed. Add dry ingredients and pistachios and beat on low speed just until combined.",
        "Turn out dough onto a clean work surface. Divide in half. Place each half on a 9x13\" sheet of parchment paper with the long end facing you. Roll dough into 2 logs about 1 1/2\" in diameter. Wrap each in parchment paper, making sure to cover ends completely. Chill until firm, at least 1 hour or up to overnight.",
        "Position racks in upper and lower thirds of oven; preheat to 350°F. Let dough stand at room temperature until soft enough to slice, about 15 minutes. Slice logs into 1/4\"-thick rounds. Arrange rounds on 2 parchment-lined rimmed baking sheets about 1\" apart. Bake cookies, rotating sheets halfway through, until bottoms are lightly golden, 12–15 minutes. Transfer sheets to wire racks and let cool.",
        "Combine chocolate and oil in a small heatproof bowl. Heat in 10-second intervals in microwave, stirring, until melted and combined, 30–40 seconds total.",
        "Dip cookies halfway into melted chocolate and transfer to parchment-lined baking sheets. Sprinkle chocolate with pistachios. Chill until chocolate is set, about 10 minutes.",
        "Dough can be made up to 2 weeks ahead; keep frozen. Let stand at room temperature until soft enough to slice, about 30 minutes."
    ],
    "ingredients": [
        "10 tablespoons unsalted butter",
        "2 tablespoons whole cardamom pods, crushed",
        "1 cup all-purpose flour",
        "1 teaspoon kosher salt",
        "1/4 teaspoon baking powder",
        "1/2 cup sugar",
        "1 large egg",
        "1/2 cup chopped unsalted, shelled raw pistachios (about 2 1/4 ounces)",
        "8 ounces white chocolate, coarsely chopped",
        "1 1/2 teaspoons vegetable oil",
        "1/2 cup finely chopped unsalted, shelled raw pistachios (about 2 1/4 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pistachio",
        "Bake",
        "Cookies",
        "Kid-Friendly",
        "Christmas",
        "Cardamom",
        "Dessert",
        "Christmas Eve",
        "Picnic",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pistachio Cardamom Butter Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-cardamom-butter-cookies"
}
