{
    "directions": [
        "Beat together butter and sugars in a large bowl with an electric mixer at medium-high speed until light and fluffy, then beat in baking powder and soda, spices, and salt until well combined. Add eggs and vanilla and beat well.",
        "Add flour and mix on low speed until just combined well. Stir in oats, pistachios, and cranberries.",
        "Divide dough in quarters. Shape each quarter on a large sheet of wax paper, using paper as an aid, into a 9-inch-long log, and wrap up tightly in paper first, then in plastic wrap, twisting ends (like a piece of hard candy). Chill until firm, at least 4 hours.",
        "Heat oven to 350°F with racks in upper and lower thirds. Line 2 large baking sheets with parchment paper.",
        "Work with 1 log at a time, keeping remaining log chilled. If log softens as you work with it, rewrap it and chill or freeze it until firm. Using serrated knife, cut a 1/4-inch-thick slice from log with a sawing motion and place on baking sheet. Continue cutting, arranging slices as cut about 2 inches apart on sheet.",
        "Bake, switching position of sheets halfway through baking, until golden and set, 8 to 10 minutes total. Cool cookies on baking sheets 1 minute before transferring to racks to cool completely. (Parchment can be reused, but cool baking sheets between batches.)",
        "If garnishing with a drizzle of melted chocolate, finely chop the chocolate then melt it in microwave at 50 percent power for 30-second intervals, stirring, until smooth. Or, melt the chopped chocolate in a metal bowl set over a pan of barely simmering water.",
        "Cool chocolate slightly, then put in plastic bag and press out excess air. Snip a tiny opening in bottom corner of bag, then twist bag firmly just above chocolate and drizzle over cookies on racks set over wax paper or a pan. Let cookies stand at cool room temperature until chocolate is set."
    ],
    "ingredients": [
        "2 sticks (1 cup) unsalted butter, softened",
        "1 cup packed light brown sugar",
        "2/3 cup granulated sugar",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon salt",
        "2 large eggs",
        "1 1/2 teaspoons vanilla",
        "1 1/2 cups all-purpose flour",
        "3 cups old-fashioned rolled oats",
        "1 cup roasted and salted shelled pistachios (about 5 ounces)",
        "1 cup dried cranberries (about 4 ounces)",
        "4 ounces bittersweet or white chocolate, melted (see Cooks' notes)",
        "Special equipment: A sharp serrated knife; a heavy-duty sealable plastic bag (not pleated)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Chocolate",
        "Dessert",
        "Bake",
        "Christmas",
        "Cranberry",
        "Pistachio",
        "Edible Gift",
        "Christmas Eve",
        "Oatmeal",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pistachio Cranberry Oatmeal Icebox Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-cranberry-oatmeal-icebox-cookies-51142240"
}
