{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "In a large bowl, toss together the pistachio nuts, hazelnuts, 2 teaspoons cinnamon, 1/2 teaspoon ground cloves, and 1/2 cup sugar.",
        "Unroll thawed phyllo pastry, and cover with a damp towel to prevent drying and cracking. Brush a 10x15-inch jellyroll pan with melted butter using a pastry brush. Lay one sheet of pastry onto the buttered pan, and brush with more butter. Repeat until there are 8 buttered sheets of dough stacked. Sprinkle some of the nut mixture over this layer, then cover with 3 more layers of pastry, each brushed with butter. Sprinkle more of the nut mixture, then 3 layers of buttered pastry. Repeat this pattern until the nut mixture is gone, reserving 8 layers of pastry for the top. Each time a layer of pastry is added, it must be brushed with the melted butter.",
        "Cut the pastry into strips, then into diamonds. Pieces should be somewhat small because they are so sweet. At this point, each piece may be studded with a whole clove. Heat the remaining melted butter until boiling, and drizzle it evenly over the whole pan.",
        "Bake in the preheated oven until evenly golden, about 1 hour and 15 minutes.",
        "While the pastry is baking, combine the remaining 3 cups sugar, water, honey, 1 teaspoon cinnamon, and 1/4 teaspoon ground cloves in a large saucepan. Bring to a boil, then simmer over medium heat for 15 minutes. Set aside to cool.",
        "When the pastry comes out of the oven, immediately pour the syrup evenly over the entire pan. Be careful when pouring; the hot syrup may cause the butter in the pastry to boil up and splatter. Allow baklava to cool to room temperature before serving. Remove whole cloves from pieces before eating."
    ],
    "ingredients": [
        "8 ounces finely chopped pistachio nuts",
        "8 ounces finely chopped hazelnuts",
        "2 teaspoons ground cinnamon",
        "1/2 teaspoon ground cloves",
        "1/2 cup white sugar",
        "2 cups unsalted butter, melted",
        "1 1/2 (16 ounce) packages frozen phyllo pastry, thawed",
        "1/4 cup whole cloves (optional)",
        "3 cups white sugar",
        "2 1/2 cups water",
        "2 tablespoons honey",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground cloves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pistachio Hazelnut Baklava",
    "url": "http://allrecipes.com/recipe/43913/pistachio-hazelnut-baklava/"
}
