{
    "directions": [
        "Pulse pistachios and sugar together in a food processor until nuts are finely chopped (but not ground), then stir together with remaining ingredients in a bowl. Spread dough in a 12-inch-long strip on a large sheet of plastic wrap and, starting with a long side, roll up dough in plastic wrap (dough will be very soft). Chill dough on a baking sheet until firm but still malleable, about 1 hour.",
        "Preheat oven to 325°F.",
        "Roll dough into a 15- by 1-inch log, using plastic wrap as an aid. Halve log crosswise and chill halves, wrapped in plastic wrap, until firm, about 3 hours.",
        "Cut 1 half crosswise into 1/8-inch-thick slices with a serrated knife and arrange about 2 inches apart on 2 parchment-lined large baking sheets. Flatten each cookie into a 1 1/2-inch round with the back of a fork or spoon, dipping fork in water and shaking off excess for each cookie.",
        "Bake in upper and lower thirds of oven, switching position of sheets halfway through baking, until golden, 8 to 10 minutes total. Cool cookies on sheets 5 minutes, then transfer with a metal spatula to racks to cool completely. Make more cookies with remaining dough on cooled baking sheets (line sheets with clean parchment)."
    ],
    "ingredients": [
        "1 1/4 cups salted shelled pistachios (not dyed red; 5 1/2 oz)",
        "3/4 cup sugar",
        "6 tablespoons all-purpose flour",
        "5 tablespoons unsalted butter, melted and cooled slightly",
        "2 tablespoons Grand Marnier or other orange-flavored liqueur",
        "1 teaspoon finely grated fresh orange zest",
        "2 tablespoons fresh orange juice",
        "Special equipment: parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Fruit Juice",
        "Liqueur",
        "Citrus",
        "Nut",
        "Bake",
        "Christmas",
        "Orange",
        "Pistachio",
        "Winter",
        "Gourmet"
    ],
    "title": "Pistachio Orange Lace Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-orange-lace-cookies-107448"
}
