{
    "directions": [
        "Preheat oven to 350°F. Whisk flour, baking powder, baking soda, and salt in a medium bowl. Using an electric mixer on medium-high speed, beat butter, granulated sugar, and pistachio paste in a large bowl until light and fluffy, about 4 minutes. Mix in vanilla, then eggs, one at a time, beating to incorporate completely after each addition. Reduce speed to low and gradually add dry ingredients; mix just until combined.",
        "Scoop heaping tablespoonfuls of dough onto parchment-lined baking sheets, spacing 3\" apart. Bake cookies until golden, 12–15 minutes. Let cool on baking sheets 10 minutes, then transfer to wire racks and let cool completely.",
        "Using an electric mixer on medium-high speed, beat butter, pistachio paste, powdered sugar, vanilla, and salt until light and fluffy, about 3 minutes.",
        "Spread 1 scant tablespoonful pistachio cream onto flat side of a cookie. Top with another cookie, flat side down; press lightly to even out filling. Repeat with remaining cookies and pistachio cream.",
        "Cookies can be made 1 day ahead. Store tightly wrapped at room temperature."
    ],
    "ingredients": [
        "2 1/4 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1 teaspoon baking soda",
        "1/2 teaspoon kosher salt",
        "1 1/2 cups (3 sticks) unsalted butter, room temperature",
        "3/4 cup granulated sugar",
        "1/2 cup pistachio paste",
        "1 1/2 teaspoons vanilla extract",
        "2 large eggs, room temperature",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/2 cup pistachio paste",
        "1/3 cup powdered sugar",
        "1/2 teaspoon vanilla extract",
        "1/4 teaspoon kosher salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Dessert",
        "Kid-Friendly",
        "Pistachio",
        "Cambridge",
        "Massachusetts",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pistachio-Cream Sandwich Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-cream-sandwich-cookies-56389703"
}
