{
    "directions": [
        "Put oven rack in middle position and preheat to 350°F. Oil molds and line bottom of each with an oval of wax paper.",
        "Spread pistachios on a baking sheet and toast until nuts are fragrant but not colored, 4 to 5 minutes. Transfer to a bowl and cool completely. Rub off and discard any skins.",
        "Blend nuts with milk in a blender or food processor 2 minutes. Rinse kitchen towel under cold water and wring out as much water as possible. Line a large sieve with towel, then set sieve over a bowl or large glass measure and pour pistachio mixture into towel. Wrap towel up and around mixture and, working over sieve, squeeze pistachio milk (about 1 cup) from towel into bowl, discarding ground pistachios. Stir in almond extract and a pinch of salt.",
        "Sprinkle gelatin over cold water in a very small bowl or a cup and let stand 1 minute.",
        "Heat pistachio milk and sugar in a small saucepan over moderately low heat, stirring, until sugar is dissolved. Add gelatin mixture and cook, stirring, until gelatin is dissolved. Transfer to a metal bowl set in a larger bowl of ice and cold water and cool, stirring constantly, just until mixture is the consistency of raw egg white. Remove bowl from ice water.",
        "Beat cream in another bowl with an electric mixer until it just holds stiff peaks, then whisk one fourth of cream into pistachio mixture to lighten. Fold in remaining cream gently but thoroughly and spoon mixture into molds. Chill blancmanges, covered with plastic wrap, until set, at least 6 hours.",
        "Working with 1 blancmange at a time, run tip of a thin knife between each custard and metal mold. Tilt mold sideways and tap side of mold against a work surface, turning it, to evenly break seal and loosen custard. Keeping mold tilted, invert a dessert plate over mold, then invert blancmange onto plate."
    ],
    "ingredients": [
        "1 1/2 cups shelled unsalted pistachios (not dyed red; 7 oz)",
        "1 3/4 cups whole milk",
        "1/8 teaspoon almond extract",
        "1 3/4 teaspoons unflavored gelatin (from a 1/4-oz envelope)",
        "2 tablespoons cold water",
        "1/2 cup sugar",
        "1 cup chilled heavy cream",
        "Special equipment: 8 (4-oz) oval or round metal molds or ceramic ramekins; a thin fine-weave kitchen towel (not terry cloth)",
        "Accompaniment: brandied poached peaches",
        "Garnish: chopped unsalted pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Dessert",
        "Bake",
        "Pistachio",
        "Fall",
        "Chill",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Pistachio Blancmanges",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-blancmanges-108527"
}
