{
    "directions": [
        "Stir grapes and sugar in heavy large skillet to coat. Let stand 5 minutes. Add juice concentrate and spice powder. Bring to boil over medium-high heat, stirring until sugar dissolves. Reduce heat to medium and simmer until syrup thickens enough to coat spoon, about 30 minutes. Pour compote into sieve set over medium bowl; drain grapes well. Transfer grapes to another medium bowl. Refrigerate grapes and syrup separately until cold, about 1 hour. (Can be made 1 day ahead. Cover each; keep refrigerated.)",
        "Place mascarpone in small bowl; sift sugar over. Scrape in seeds from vanilla bean; stir to blend. Chill at least 1 hour. (Can be made 1 day ahead. Cover and keep chilled.)",
        "Line 2 large rimmed baking sheets with parchment paper. Blend powdered sugar and nuts in processor until nuts are finely chopped. Sprinkle 10-inch square area on work surface with 1/3 cup nut sugar; top with pastry sheet. Sprinkle pastry with 1/3 cup nut sugar. Roll out pastry to 12-inch square. Roll up into 12-inch-long log. Cut into sixteen 3/4-inch-wide rounds. Roll out each to 4-inch-diameter round, sprinkling with more nut sugar as needed to prevent sticking. Arrange rounds on prepared sheets. Cover and chill at least 30 minutes.",
        "Preheat oven to 375°F. Bake pistachio rounds uncovered until brown on bottom and golden on top, reversing sheets after 10 minutes, about 16 minutes total. Transfer crisps to racks and cool. (Can be made 1 day ahead. Store airtight at room temperature.)",
        "Spread 2 tablespoons mascarpone cream on each of 8 crisps. Place on plates. Spoon cooked grapes atop cream. Cut 8 crisps in half. Drizzle each dessert with grape syrup, then garnish each with 2 crisp halves, grape cluster, and mint.",
        "*Italian cream cheese; available in the cheese department of many supermarkets and at Italian markets."
    ],
    "ingredients": [
        "2 pounds large red seedless grapes, stemmed, halved",
        "1/2 cup sugar",
        "5 tablespoons frozen white grape juice concentrate, thawed",
        "1/4 teaspoon Chinese five-spice powder",
        "1 1/2 8-ounce containers mascarpone cheese*",
        "5 tablespoons powdered sugar",
        "1/2 large vanilla bean, split lengthwise",
        "1/2 cup powdered sugar",
        "1/2 cup shelled natural pistachios",
        "1 frozen puff pastry sheet (half of 17.3-ounce package), thawed",
        "Small grape clusters",
        "Fresh mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Pistachio",
        "Fall",
        "Grape",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pistachio Crisps with Mascarpone Cheese and Grape Compote",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-crisps-with-mascarpone-cheese-and-grape-compote-232894"
}
