{
    "directions": [
        "Stir together flour, cinnamon, and salt in a bowl.",
        "Beat together butter, granulated sugar, and zest in a large bowl with an electric mixer at medium-high speed until pale and fluffy, about 3 minutes. Reduce speed to low and add flour mixture in 3 batches, mixing until dough just comes together in clumps, then mix in pistachios and cranberries. Gather and press dough together, then divide into 2 equal pieces. Using a sheet of plastic wrap or wax paper as an aid, form each piece of dough into a log about 1 1/2 inches in diameter. Square off long sides of each log to form a bar, then chill, wrapped in plastic wrap, until very firm, at least 2 hours.",
        "Put oven racks in upper and lower thirds of oven and preheat oven to 350°F. Line 2 large baking sheets with parchment paper.",
        "Brush egg over all 4 long sides of bars (but not ends). Sprinkle decorative sugar on a separate sheet of parchment or wax paper and press bars into sugar, coating well.",
        "Cut each bar crosswise into 1/4-inch-thick slices, rotating bar after cutting each slice to help keep square shape. (If dough gets too soft to slice, freeze bars briefly until firm.) Arrange cookies about 1/2 inch apart on lined baking sheets.",
        "Bake cookies, switching position of sheets halfway through baking, until edges are pale golden, 15 to 18 minutes total. Transfer cookies from parchment to racks using a slotted spatula and cool completely."
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1/2 teaspoon cinnamon",
        "1/4 teaspoon salt",
        "1 1/2 sticks (3/4 cup) unsalted butter, softened",
        "1/4 cup plus 2 tablespoons granulated sugar",
        "1/2 teaspoon finely grated fresh orange zest",
        "1/2 cup shelled pistachios (2 1/4 oz; not dyed red)",
        "1/3 cup dried cranberries (1 1/4 oz)",
        "1 large egg, lightly beaten",
        "1/4 cup decorative sugar (preferably coarse)",
        "Special equipment: parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Christmas",
        "Cranberry",
        "Pistachio",
        "Fall",
        "Winter",
        "Chill",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pistachio Cranberry Icebox Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-cranberry-icebox-cookies-236664"
}
