{
    "directions": [
        "Line a metal loaf pan (approximately 9x5x3\") with 2 layers of plastic wrap, leaving generous overhang on all sides.",
        "Grind pistachios and 2 tablespoons sugar in a food processor until very finely chopped. Transfer pistachio mixture to a small sauce- pan. Add 1/2 cup milk; bring to a boil. Remove from heat, cover, and let steep for 20 minutes. Set a fine-mesh strainer over a medium bowl; strain, discarding solids. Stir in almond extract; set pistachio mixture aside.",
        "Place remaining 1/2 cup milk in a separate small saucepan. Scrape in seeds from vanilla bean; add bean and bring to a simmer. Re- move from heat, cover, and let steep for 15 minutes. Set a strainer over another medium bowl; strain, discarding solids, and chill vanilla mixture.",
        "Purée strawberries and 2 tablespoons sugar in a food processor until smooth. Set a fine-mesh strainer over another medium bowl; strain, pressing on solids to extract as much juice as possible. Discard solids. Stir in vanilla extract and set strawberry mixture aside.",
        "Whisk eggs, salt, and remaining 1/2 cup sugar in a medium metal bowl. Set bowl over a medium saucepan of simmering water (do not allow bottom of bowl to touch water). Beat egg mixture at high speed until it triples in volume and an instant-read thermometer inserted into mixture registers 170°F, about 3 minutes. Remove bowl from over water and continue beating until thick and cool, about 3 minutes. Add one-third of egg mixture to each of the pistachio, strawberry, and vanilla mixtures; fold each just to blend.",
        "Beat cream in a large bowl until soft peaks form. Add one-third of cream to each of the pistachio, strawberry, and vanilla mixtures; fold each just to blend. Cover vanilla and strawberry mixtures separately; chill. Pour pistachio mixture into pan; smooth top. Cover; freeze until firm, about 45 minutes. Gently pour straw- berry mixture over pistachio layer; smooth top. Freeze until firm, about 45 minutes. Gently fold vanilla mixture to blend; pour over and smooth top. Freeze until firm, about 4 hours. DO AHEAD: Can be made 3 days ahead. Fold plastic wrap over; seal tightly and keep frozen.",
        "Uncover semifreddo. Using plastic wrap as an aid, lift from mold. Invert onto a chilled platter; peel off plastic. Slice crosswise."
    ],
    "ingredients": [
        "1 cup shelled unsalted pistachios",
        "4 tablespoons sugar, divided, plus 1/2 cup",
        "1 cup whole milk, divided",
        "1/4 teaspoon almond extract",
        "1 vanilla bean, halved lengthwise",
        "1 cup fresh strawberries (about 4 ounces), hulled, halved",
        "1 teaspoon vanilla extract",
        "2 large eggs, at room temperature",
        "1/4 teaspoon kosher salt",
        "1 1/3 cups chilled heavy whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Dessert",
        "Backyard BBQ",
        "Frozen Dessert",
        "Strawberry",
        "Pistachio",
        "Summer",
        "Shower",
        "Engagement Party",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pistachio, Strawberry and Vanilla Semifreddo",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-strawberry-and-vanilla-semifreddo-365751"
}
