{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Spread pistachios on a baking sheet and toast until nuts are fragrant but not browned, 4 to 5 minutes. Transfer to a bowl and cool completely. Rub off and discard any loose skins (some will remain on nuts).",
        "Pulse nuts with granulated sugar in a food processor just until finely chopped. (Do not blend to a paste.)",
        "Stir together nuts and cream with a pinch of salt in a 1-quart heavy saucepan and cook over moderate heat, uncovered, stirring occasionally, until just hot. Remove from heat, cover, and let stand 30 minutes.",
        "Rinse kitchen towel under cold water and wring out as much water as possible. Line a large sieve with towel, then set sieve over a bowl or large glass measure and pour pistachio mixture into towel. Wrap towel up around mixture and, working over sieve, squeeze pistachio cream from towel into bowl. Discard ground pistachios.",
        "Lightly beat yolks in a medium bowl, then whisk in pistachio cream. Divide mixture among gratin dishes.",
        "Arrange gratin dishes on a metal rack set in a roasting pan and bake in a hot water bath until custards are just set around edges but centers tremble slightly when dishes are gently shaken, about 20 minutes. Remove gratin dishes from pan and cool, uncovered, then chill, covered, at least 4 hours. (Custards will set completely as they chill.)",
        "Very gently blot any moisture from surface of chilled custards with paper towels. Sprinkle 1 1/2 teaspoons turbinado sugar evenly over each custard, then move blowtorch flame evenly back and forth just over sugar until sugar is melted and caramelized. Serve with sour cherry sauce."
    ],
    "ingredients": [
        "1 cup shelled unsalted pistachios (not dyed red; 4 oz)",
        "5 tablespoons granulated sugar",
        "2 cups heavy cream",
        "3 large egg yolks",
        "6 teaspoons turbinado sugar such as Sugar in the Raw",
        "Sour cherry sauce",
        "Special equipment: a fine-weave kitchen towel (not terry cloth); 4 (1-cup) gratin or other shallow flameproof dishes; a small blowtorch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Cherry",
        "Pistachio",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pistachio Crème Brûlée with Sour Cherry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-creme-brulee-with-sour-cherry-sauce-233281"
}
