{
    "directions": [
        "Stir together flour and baking powder. Stir together yogurt, oil, and yolks in another bowl, then gradually add flour, stirring until a soft dough forms. Put dough in a sealed plastic bag and let stand at room temperature 2 hours.",
        "Pulse pistachios, confectioners sugar, and cardamom in a food processor until finely ground (be careful not to overprocess into a paste). Bring water and sugar to a boil in a very small saucepan, stirring, then add syrup to pistachios and pulse to combine.",
        "Preheat oven to 350°F.",
        "Divide dough in half. Keeping one half wrapped in plastic wrap, roll out other half on a well-floured surface into a 15-inch round (about 1/16 inch thick). Cut out as many rounds as possible with a 2 3/4-inch cutter and add scraps to wrapped dough for rerolling. Mound 1 teaspoon filling in center of each round, then moisten edge of round with water and fold over to form a half-moon. Pinch edges together, then crimp with a fork to seal.",
        "Repeat with remaining dough and filling, rerolling scraps.",
        "Bake crescents 1 inch apart on parchment-lined baking sheets in batches in middle of oven until golden, 18 to 20 minutes. Transfer parchment with crescents to a rack and when cookies are just cool enough to handle, toss, a few at a time, in confectioners sugar to coat, knocking off excess. Cool crescents completely on rack."
    ],
    "ingredients": [
        "1 1/3 cups all-purpose flour",
        "1 teaspoon baking powder",
        "1/3 cup plain yogurt",
        "1/3 cup vegetable oil",
        "2 large egg yolks",
        "1 1/2 cups shelled natural pistachios (7 1/2 oz)",
        "3/4 cup confectioners sugar",
        "1 teaspoon ground cardamom",
        "1/4 cup water",
        "2 tablespoons sugar",
        "1 cup confectioners sugar",
        "*Available by mail order from Kalustyan's (212-685-3451)."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Egg",
        "Yogurt",
        "Ramadan",
        "Pistachio",
        "Spring",
        "Gourmet"
    ],
    "title": "Pistachio-Filled Crescents",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-filled-crescents-105040"
}
