{
    "directions": [
        "To make the cake, preheat the oven to 300°F. Butter a 4-by-8-inch loaf pan. Then, using a sifter or a fine-mesh strainer, dust it with flour, tapping out the excess.",
        "In a food process, combine the pistachios and almonds and pulse until finely ground. Set aside.",
        "Combine the butter and sugar in the bowl of a stand mixer. Grate the zest from the lemons directly into the bowl. Fit the mixer with the paddle attachment and beat on medium speed for about 2 minutes, or until smooth and creamy. Mix in the vanilla just until incorporated. On low speed, gradually add the nuts and mix just until incorporated. Then add the eggs, one at a time, mixing after each addition just until incorporated. Stir in the flour and salt and mix just until incorporated.",
        "Spoon the batter into the prepared loaf pan. Bake until a skewer inserted into the middle of the cake comes out clean, about 45 minutes. Let cool in the pan on a wire rack for 10 minutes. Then, run a paring knife around the inside of the pan to loosen the cake sides, invert the cake onto a plate, and lift off the pan. At this point, the cake can be served warm or allowed to cool completely before being sliced and reheated.",
        "To make the orange salad, cut a slice off the top and bottom of 1 orange, stand the orange upright, and cut downward to remove the rind and pith in thick strips. Cut the orange crosswise into 1/4-inch-thick slices, capturing any juice. Repeat with all of the remaining oranges. Set the oranges slices aside until needed.",
        "Gently heat the marmalade in a pot over low heat for about 3 minutes, or until syrupy. Add any captured orange juice along with the lemon juice to the marmalade. Remove the pot from the heat and add 1 to 2 tablespoons water to think the marmalade to the consistency of a vinaigrette. Let cool.",
        "To serve, preheat the oven to 400°F. Cut the cake into generous slices and place on a baking sheet. Bake the slices, turning them over once, for about 5 minutes, or until warm and slightly toasted on both sides.",
        "Place 4 or 5 orange slices on each plate and drizzle generously with the marmalade syrup. Place the warm pieces of cake next to the orange slices and top with a dollop of yogurt and a few pistachios. Serve immediately."
    ],
    "ingredients": [
        "1 1/3 cups unsalted shelled pistachio nuts",
        "1 1/3 cups blanched whole almonds",
        "1/2 cup plus 2 tablespoons (5 ounces) unsalted butter, at room temperature",
        "3/4 cup plus 3 tablespoons sugar",
        "3 lemons",
        "1/2 teaspoon pure vanilla extract",
        "3 eggs",
        "1/2 cup plus 1 tablespoon \"00\" flour or all-purpose flour",
        "1/4 teaspoon kosher salt",
        "3 blood oranges",
        "2 Valencia, navel, or blood oranges",
        "1/4 cup orange marmalade",
        "1 teaspoon freshly squeezed lemon juice",
        "1/2 cup plain whole-milk yogurt",
        "Unsalted shelled pistachio nuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Orange",
        "Almond",
        "Pistachio",
        "Winter"
    ],
    "title": "Pistachio and Almond Cake with Orange Salad",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-and-almond-cake-with-orange-salad-351331"
}
