{
    "directions": [
        "Scrape seeds from vanilla bean into cream in a 2-quart heavy saucepan, then add pod and bring to a simmer over moderate heat. Remove from heat, then steep, covered, 20 minutes.",
        "Discard pod.",
        "Preheat oven to 325°F.",
        "Whisk together yolks, sugar, and a pinch of salt, then add hot cream in a slow stream, whisking constantly. Pour through a fine sieve into glass loaf pan. Cover pan with foil and bake custard in a hot water bath until set but with center still slightly wobbly, about 1 hour.",
        "Remove foil and cool custard in pan on a rack, then chill, covered, until firm, at least 4 hours.",
        "Scrape seeds from vanilla bean into juice in cleaned 2-quart heavy saucepan, then add pod and sugar. Bring to a boil over moderately high heat, stirring until sugar is dissolved, then boil until reduced to about 1 1/4 cups, about 20 minutes. Remove from heat, then discard pod and stir in Grand Marnier. Cool to room temperature.",
        "Preheat oven to 375°F.",
        "Chop enough pistachios to measure 2 tablespoons. Pulse remaining nuts with regular granulated sugar in a food processor until finely ground. Add flour and salt and pulse to combine. Add milk, butter, and eggs and blend until just combined. Pour batter into well-buttered popover cups, filling them two-thirds full.",
        "Bake in lower third of oven until popovers are puffed and well browned, about 40 minutes. Cut a 1/2-inch slit in top of each popover and bake 10 minutes more. Immediately turn popovers out onto rack to cool.",
        "Cut off tops of cooled popovers and arrange in a baking dish. Brush tops with some syrup and heat in oven until warm, about 3 minutes.",
        "While tops are heating, fill bottoms of popovers with custard. Sprinkle 1 teaspoon superfine sugar evenly over each custard, then move blowtorch flame evenly back and forth just over sugar until sugar is melted and caramelized.",
        "Transfer popovers with tops to plates and spoon some syrup around each. Sprinkle with chopped nuts."
    ],
    "ingredients": [
        "1/4 vanilla bean, halved lengthwise",
        "2 cups heavy cream",
        "4 large egg yolks",
        "1/4 cup sugar",
        "1/2 vanilla bean, halved lengthwise",
        "2 cups fresh orange juice",
        "1 cup sugar",
        "2 tablespoons Grand Marnier or other orange liqueur",
        "1/2 cup unsalted shelled natural pistachios",
        "1/4 cup granulated sugar",
        "1 cup all-purpose flour",
        "1/4 teaspoon salt",
        "1 cup whole milk at room temperature",
        "2 tablespoons unsalted butter, melted",
        "3 large eggs at room temperature",
        "2 tablespoons superfine granulated sugar",
        "Special equipment: a 9- by 5- by 3-inch glass loaf pan; a nonstick popover pan with 6 (51/2-oz) cups; a blowtorch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Liqueur",
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Orange",
        "Pistachio",
        "Vanilla",
        "Fall",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pistachio Popover Cremes Brulees with Grand Marnier Syrup",
    "url": "http://www.epicurious.com/recipes/food/views/pistachio-popover-cremes-brulees-with-grand-marnier-syrup-105625"
}
