{
    "directions": [
        "To make the dough, in a small bowl, stir together the lukewarm water, the honey and 1 tsp. of the olive oil until blended. Sprinkle the yeast on top and let stand until foamy, about 10 minutes.",
        "By hand:",
        "In a large bowl, using a wooden spoon, stir together 1 cup of the all-purpose flour, the whole-wheat flour and the salt. Pour in the yeast mixture and stir, adding enough of the remaining 1/2 cup all-purpose flour, or more if needed, to form a soft dough.",
        "By food processor:",
        "In a food processor, combine 1 cup of the all-purpose flour, the whole-wheat flour and the salt and pulse a few times to blend. Pour in the yeast mixture and pulse until combined. Add enough of the remaining 1/2 cup all-purpose flour, or more if needed, and pulse to form a soft dough.",
        "Turn the dough out onto a floured work area and knead until the surface of the dough is very smooth, about 5 minutes, adding more all-purpose flour as needed. The dough should be soft but not sticky.",
        "Lightly oil a large bowl with the remaining 1 tsp. olive oil. Form the dough into a ball and place in the bowl. Turn to coat with the oil. Cover the bowl with a clean kitchen towel and let the dough rise in a warm place until doubled in bulk, about 1 hour.",
        "To make the caramelized onions, heat a large fry pan over medium heat until hot enough for a drop of water to sizzle and immediately evaporate. Add the olive oil and onions; reduce the heat to low. Add the water and toss to coat. Cover and cook, stirring occasionally and adding more water if needed to prevent scorching, until the onions are tender, about 8 minutes. Uncover and raise the heat to medium-high. Cook, stirring, until all the moisture is evaporated and the onions begin to turn golden, about 5 minutes more. Add the vinegar, oregano, a pinch of salt and a grind of pepper and stir to mix. Cook for 1 minute, then remove from the heat. Let the onions cool to room temperature.",
        "Punch the dough down and let rest for 10 minutes. (You can make the dough up to 1 day in advance, punch it down, place it in a plastic bag and refrigerate it until ready to shape and bake.) If making individual pizzas, divide the dough into 4 equal portions.",
        "Position a rack in the lowest position in an oven and preheat to 450°F. Lightly oil one 14-by-16-inch baking sheet, one 14-inch pizza pan or four 9-inch pizza or tart pans.",
        "On a lightly floured work surface, gently stretch or roll out the dough to fit the prepared pan(s). Transfer the dough to the pan(s). Spread all of the cheese on the large crust and top with the onions, or divide the cheese evenly among the 4 smaller crusts and top with the onions, again dividing evenly.",
        "Bake until the crust is nicely browned, 20 to 25 minutes. Spray the bottom of the oven with water at regular intervals 3 times during the first 5 to 10 minutes of baking. Sprinkle the pizza(s) with the olive halves during the last 5 to 10 minutes of baking. Cut the small pizzas in half or the large pizza into 8 wedges and serve immediately. Serves 8.",
        "Adapted from Williams-Sonoma,",
        "Essentials of Healthful Cooking",
        ", by Mary Abbott Hess, Dana Jacobi & Marie Simmons (Oxmoor House, 2003)."
    ],
    "ingredients": [
        "1 cup lukewarm water",
        "1 Tbs. honey",
        "2 tsp. olive oil",
        "1 envelope (2 1/2 tsp.) active dry yeast",
        "1 1/2 cups all-purpose flour, or more as needed",
        "1/2 cup whole-wheat flour",
        "1 tsp. kosher salt",
        "1 Tbs. olive oil",
        "1 lb. red onions, cut lengthwise into slices 1/8 inch thick",
        "2 Tbs. water",
        "1 Tbs. red wine vinegar",
        "1 tsp. dried oregano",
        "Kosher salt and freshly ground pepper, to taste",
        "2 cups crumbled feta cheese",
        "12 Kalamata olives, pitted and halved"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Greek Pizza with Caramelized Onions, Kalamata Olives and Feta",
    "url": "http://www.williams-sonoma.com/recipe/pizza-with-caramelized-red-onions-olives-and-feta-cheese.html"
}
