{
    "directions": [
        "Add the flour to a large mixing bowl or to the bowl of a stand mixer fitted with the dough hook. In a separate bowl, combine the yeast with the warm water and stir together. Set aside for 1 to 2 minutes. When the yeast mixture starts to bubble after a couple of minutes, it is ready to use. Add the yeast to the flour and start to mix together.",
        "If making by hand, dump the mixture onto a counter lightly dusted with flour and knead for 5 to 6 minutes. Add the salt and knead for another 2 minutes, and add a little more flour if necessary to form an elastic dough. If making in the stand mixer, knead on low for 5 to 6 minutes, until the dough starts to become smooth and elastic. Add the salt and knead for another 2 minutes. In a large clean bowl, add the olive oil. Form the dough into a ball, put in the bowl, and turn the dough around until it is entirely coated with oil. Cover the bowl with plastic wrap and refrigerate for 12 hours. It will double in bulk and start to develop a yeasty aroma.",
        "The dough is now ready to use, but for a more flavorful dough, punch it down and reform into a tight ball. Put the dough ball back in the bowl, cover, and refrigerate for another 12 hours.",
        "To grill the dough, preheat the grill on high. Slide the dough onto the hot grill and cook until grill marks appear and the dough is set, about 2 minutes. Carefully flip the dough over with a large spatula or tongs or your hands; brush the top with olive oil, and cook until the dough is firm but not completely cooked and grill marks appear, another 3 to 4 minutes. Slip the pizza paddle under the crust and remove from the grill. Set a large cast-iron griddle on the grill to heat or place a pizza pan in the oven and preheat to 500°F."
    ],
    "ingredients": [
        "3 cups (14 ounces) unbleached white flour",
        "1 teaspoon active dry yeast",
        "1 cup warm water (105°F to 115°F)",
        "1 tablespoon salt",
        "1 tablespoon olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Backyard BBQ",
        "Grill",
        "Grill/Barbecue"
    ],
    "title": "Pizza Dough",
    "url": "http://www.epicurious.com/recipes/food/views/pizza-dough-51112260"
}
