{
    "directions": [
        "Preheat oven to 375°F. Slice top off garlic head; place in small baking dish. Drizzle with 1 tablespoon olive oil. Brush baking sheet with 1/2 tablespoon olive oil. Place onion slices on sheet and brush onion with 1/2 tablespoon olive oil. Bake garlic and onion until garlic cloves are light brown and soft and onion is tender, about 45 minutes. Remove from oven; let cool.",
        "Using fingers, squeeze out roasted garlic cloves into food processor; add sun-dried tomatoes. Using on/off turns, process until almost smooth, adding enough reserved oil form sun-dried tomatoes to form paste. (Onions and garlic mixture can be prepared 1 day ahead. Cover separately and refrigerate.)",
        "Preheat oven to 450°F. Place crust on baking sheet or pizza pan. Spread garlic paste evenly over crust. Top with mozzarella cheese, onion, pepper strips and feta cheese. Sprinkle with 2 tablespoons basil and 1 tablespoon parsley.",
        "Bake pizza until crust is golden brown and cheese bubbles, about 8 minutes. Transfer to cutting board. Cool 5 minutes. Sprinkle with remaining 2 tablespoons basil and 1 tablespoon parsley. Cut into wedges and serve."
    ],
    "ingredients": [
        "1 large head garlic, unpeeled",
        "2 tablespoons olive oil",
        "1 large red onion, cut into 1/2-inch-thick rings",
        "atoes1/3 cup oil-packed sun-dried tom, drained, oil reserved",
        "1 prepared pizza crust (such as Boboli thin crust)",
        "2 cups grated mozzarella cheese (about 6 ounces)",
        "1/2 cup roasted red bell peppers from jar, cut into 1/2-inch-thick strips",
        "2/3 cup (about 2 1/2 ounces) crumbled feta cheese",
        "4 tablespoons chopped fresh basil or 1 tablespoon dried",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pepper",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Feta",
        "Mozzarella",
        "California"
    ],
    "title": "Pizza with Roasted Garlic, Bell Peppers and Two Cheeses",
    "url": "http://www.epicurious.com/recipes/food/views/pizza-with-roasted-garlic-bell-peppers-and-two-cheeses-1666"
}
