{
    "directions": [
        "In a bowl, dissolve yeast in warm water, and mix in sugar. Proof for ten minutes, or until frothy. Mix in the salt, olive oil, and flour until dough pulls away from the sides of the bowl. Turn onto a lightly floured surface. Knead until smooth, about 8 minutes. Place dough in a well oiled bowl, and cover with a damp cloth. Set aside to rise until doubled, about 1 hour. Punch down, and knead in garlic and basil. Set aside to rise for 1 more hour, or until doubled again.",
        "Preheat grill for high heat. Heat olive oil with garlic for 30 seconds in the microwave. Set aside. Punch down dough, and divide in half. Form each half into an oblong shape 3/8 to 1/2 inch thick.",
        "Brush grill grate with garlic flavored olive oil. Carefully place one piece of dough on hot grill. The dough will begin to puff almost immediately. When the bottom crust has lightly browned, turn the dough over using two spatulas. Working quickly, brush oil over crust, and then brush with 2 tablespoons tomato sauce. Arrange 1/2 cup chopped tomatoes, 1/8 cup sliced black olives, and 1/8 cup roasted red peppers over crust.  Sprinkle with 1 cup cheese and 2 tablespoons basil. Close the lid, and cook until the cheese melts. Remove from grill, and set aside to cool for a few minutes while you prepare the second pizza."
    ],
    "ingredients": [
        "1 (.25 ounce) package active dry yeast",
        "1 cup warm water",
        "1 pinch white sugar",
        "2 teaspoons kosher salt",
        "1 tablespoon olive oil",
        "3 1/3 cups all-purpose flour",
        "2 cloves garlic, minced",
        "1 tablespoon chopped fresh basil",
        "1/2 cup olive oil",
        "1 teaspoon minced garlic",
        "1/4 cup tomato sauce",
        "1 cup chopped tomatoes",
        "1/4 cup sliced black olives",
        "1/4 cup roasted red peppers",
        "2 cups shredded mozzarella cheese",
        "4 tablespoons chopped fresh basil"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pizza On The Grill I",
    "url": "http://allrecipes.com/recipe/14522/pizza-on-the-grill-i/"
}
