{
    "directions": [
        "To make the dough, pour the lukewarm water into the bowl of a stand mixer fitted with the dough hook. Sprinkle the yeast over the top and let stand until slightly foamy, about 5 minutes. Add 1/2 cup of the flour and the salt to the bowl and mix until combined. Add the remaining flour about 1/2 cup at a time, continuing to mix until all of the flour is incorporated, scraping down the sides of the bowl if necessary. Knead with the dough hook until the dough is smooth but not sticky, about 10 minutes.",
        "Transfer the dough to a lightly floured work surface, divide into 4 portions, then shape each into a ball. Rub each ball with oil and lightly oil a baking sheet. Place the balls on the baking sheet and cover loosely with plastic wrap. Set aside in a warm place and let rise until doubled in bulk, about 2 hours.",
        "Alternatively, shape the dough into a large round, coat with olive oil, then place in a large zippered plastic bag. Press out any excess air, and place in the refrigerator overnight. When ready to bake the pizzas, remove the dough from the refrigerator and divide into 4 equal balls. Transfer the balls to a rimmed baking sheet and allow to come to room temperature, about 1 hour.",
        "Meanwhile, make the sauce: In a blender or food processor, puree the tomatoes until smooth. Pour into a fine-mesh sieve placed over a bowl and let drain for about 30 minutes. Pour the drained tomatoes into a bowl and stir in the oil. Season with salt and pepper and set aside.",
        "Place a pizza stone on the bottom rack of an oven and preheat to 500°F about 30 minutes before baking. Lightly flour a work surface. Place 1 of the dough balls on the work surface, leaving the others under the plastic wrap. Flatten into a disk. Turn the disk over, sprinkle with additional flour and, using your hands, stretch the dough into a 12-inch round, turning it over and dusting it regularly with flour as you work.",
        "Dust a baker’s peel or rimless baking sheet with semolina flour. Gently lay the dough round on top. Cover evenly with one-fourth of the tomato sauce, one-fourth of the mozzarella and one-fourth of the pecorino. Drizzle with 1 Tbs. of the olive oil. Bake until the crust is golden and the cheese is melted and bubbly, about 7 minutes. Remove from the oven, scatter with some of the basil leaves and serve immediately. Bake the remaining pizzas in the same way. Makes four 12-inch pizzas; serves 4.",
        "Adapted from Williams-Sonoma",
        "Essentials of Italian",
        "by Michele Scicolone (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "1 1/2 cups lukewarm water (100° to 110°F)",
        "2 packages (about 3 tsp.) active dry yeast",
        "4 to 4 1/2 cups all-purpose flour, plus more as needed",
        "2 tsp. salt",
        "Olive oil",
        "1 can (28 oz.) Italian plum tomatoes, crushed",
        "2 Tbs. extra-virgin olive oil",
        "Sea salt and freshly ground pepper, to taste",
        "Semolina flour for dusting",
        "1 lb. fresh mozzarella cheese, shredded or sliced, well drained and blotted dry",
        "1/2 cup grated pecorino romano or Parmigiano-Reggiano cheese",
        "4 Tbs. extra-virgin olive oil",
        "About 30 fresh basil leaves, torn into pieces"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pizza alla Margherita",
    "url": "http://www.williams-sonoma.com/recipe/pizza-alla-margherita.html"
}
