{
    "directions": [
        "Put a large heavy baking sheet (17 by 14 inches) on lowest rack of oven, then preheat oven to 500°F.",
        "Meanwhile, roll out dough on a lightly floured surface with a floured rolling pin, stretching corners with your hands to form a 16- by 13-inch rectangle. (Dough will be easier to roll out as it warms.) Transfer to a large tray lined with sheet of parchment paper. Lightly prick dough all over with a fork, then slide dough (on parchment) from tray onto hot baking sheet. Bake until top is puffed and pale golden in patches, 6 to 10 minutes. (Prick any large bubbles with a fork and flatten.)",
        "While crust bakes, shred cheese in a food processor fitted with medium shredding disk (you should have 3 cups).",
        "Remove crust from oven and brush all over with crushed garlic, then sprinkle evenly with cheese. Bake pizza until edge of crust is deep golden and cheese is bubbling and golden in patches, 8 to 10 minutes.",
        "Remove from oven, then scatter arugula over pizza and drape prosciutto over arugula. Drizzle with oil and coarsely grind pepper to taste. Serve immediately."
    ],
    "ingredients": [
        "1 lb pizza dough, thawed if frozen",
        "3/4 lb well-chilled Italian Fontina, any rind discarded",
        "1 garlic clove, forced through a garlic press",
        "1/4 lb loosely packed baby arugula (4 cups)",
        "1/4 lb thinly sliced prosciutto",
        "Extra-virgin olive oil for drizzling",
        "Freshly ground black pepper",
        "Special equipment: a 17- by 14-inch sheet of parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Garlic",
        "Leafy Green",
        "Pork",
        "Bake",
        "Quick & Easy",
        "Prosciutto",
        "Fontina",
        "Gourmet"
    ],
    "title": "Pizza with Fontina, Prosciutto, and Arugula",
    "url": "http://www.epicurious.com/recipes/food/views/pizza-with-fontina-prosciutto-and-arugula-236650"
}
