{
    "directions": [
        "To make the dough, in a small bowl, stir the yeast into the 2 Tbs. lukewarm water. Let stand until creamy, about 3 minutes.",
        "On a large work surface, sift together the all-purpose flour, semolina flour and salt into a mound, then make a well in the center. Pour the yeast mixture, olive oil and 1/4 cup of the lukewarm water into the well. Using your fingers or a fork, swirl the liquid in a circular motion, gradually incorporating flour from the sides. Slowly add the remaining 1 cup lukewarm water to the well at the same time, until the ingredients are well combined and a rough dough has formed. Knead vigorously, stretching and pressing the dough against the work surface until it is soft and smooth and comes away cleanly from your hands, about 10 minutes. To check if the dough is sufficiently kneaded, cut off a piece; the cut surface should be pocked with small air holes.",
        "Cover the dough with a damp kitchen towel and let rest for 5 minutes. Then divide the dough into 4 balls, cover again and let rise at room temperature until doubled in volume, about 2 hours.",
        "To prepare the topping, if using fresh tomatoes, preheat an oven to 350°F. Put the tomatoes in a single layer in a roasting pan. Drizzle with 2 Tbs. of the olive oil and season with salt and pepper. Roast until soft and shriveled, 45 to 50 minutes. Set aside.",
        "Preheat the broiler. Arrange the bell peppers on a pan and place under the broiler about 6 inches from the heat source. Broil, turning as needed, until the skin is blistered and charred, 10 to 15 minutes; watch carefully to avoid burning the flesh. Transfer the peppers to a paper bag, close the top and set aside until cool. Cut off the stems and pull off the charred skins. Slit each pepper open lengthwise, remove and discard the seeds and ribs, and cut lengthwise into strips 3/8 inch wide. Set aside.",
        "Place a pizza stone or unglazed tiles on the bottom rack of the oven and preheat to 500°F.",
        "Lightly flour the work surface. Place 1 of the dough balls on the work surface, leaving the others under the damp towel. Punch down and flatten into a disk. Turn the disk over, sprinkle with additional flour and, using a rolling pin or your hands, roll out or stretch the dough into a 12-inch round, turning it over and dusting it regularly with flour as you work.",
        "Sprinkle a baker’s peel or rimless baking sheet with semolina flour. Gently lay the dough round on top. Cover evenly with one-fourth of the tomatoes or tomato puree and drizzle with 1 Tbs. of the remaining olive oil. Slide the pizza onto the baking stone or tiles and bake until the crust begins to brown, about 5 minutes. Scatter one-fourth of the cheese and bell pepper strips over the top and add 3 of the anchovy fillets. Continue to bake until the cheese is melted and the crust is browned and crisp, about 5 minutes more. Begin assembling the other 3 pizzas while the first one is baking.",
        "Remove the first pizza from the oven and serve immediately. Bake the remaining pizzas in the same way. Makes four 12-inch pizzas; serves 4.",
        "Adapted from Williams-Sonoma Foods of the World Series,",
        "Rome,",
        "by Maureen B. Fant (Oxmoor House, 2005)."
    ],
    "ingredients": [
        "For the dough:",
        "1 1/4 tsp. active dry yeast",
        "2 Tbs. plus 1 1/4 cups lukewarm water",
        "2 cups all-purpose flour",
        "2 cups semolina flour, plus more as needed",
        "1/2 tsp. salt",
        "2 Tbs. extra-virgin olive oil",
        "",
        "For the topping:",
        "1 lb. cherry tomatoes, left whole, or 3/4 cup canned plum tomato puree",
        "6 Tbs. extra-virgin olive oil",
        "Salt and freshly ground pepper, to taste",
        "2 red bell peppers",
        "1 lb. fresh mozzarella cheese, shredded or sliced, well drained and blotted dry",
        "12 olive oil-packed anchovy fillets"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pizza with Roasted Peppers, Tomatoes and Anchovies (Pizza con Peperoni, Pomodori e Alici)",
    "url": "http://www.williams-sonoma.com/recipe/pizza-with-roasted-peppers.html"
}
