{
    "directions": [
        "Preheat a Breville pizza maker on the preheat setting for 30 minutes.",
        "Meanwhile, in a large nonstick fry pan over medium-high heat, warm 1 Tbs. of the olive oil. Add the butternut squash and cook, stirring occasionally, until lightly browned and just tender, 7 to 9 minutes. Season with salt and pepper. Transfer to a bowl.",
        "Return the pan to medium-high heat and warm the remaining 1 Tbs. olive oil. Add the mushrooms and cook, tossing occasionally, until browned and tender, 6 to 8 minutes. Transfer to a separate bowl.",
        "On a lightly floured surface, roll out half of the dough into a 10-inch (25-cm) round. Prick the dough all over with the tines of a fork. Transfer the dough to a floured pizza peel. Spread half of the pizza sauce over the dough, leaving a 1/2-inch (12-mm) border uncovered. Top with half",
        "each",
        "of the cheese, butternut squash and mushrooms. Scatter 8 to 10 sage leaves on top.",
        "Transfer the pizza to the pizza maker. Bake on the classic setting according to the manufacturer’s instructions until the crust is crisp and the cheese is lightly browned, 10 to 11 minutes.",
        "Using the pizza peel, transfer the pizza to a cutting board. Preheat the pizza maker again, assemble the remaining pizza and bake on the classic setting. Cut the pizza into slices and serve immediately. Makes two 10-inch (25-cm) pizzas.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "2 Tbs. olive oil",
        "1 small butternut squash, peeled, seeded and cut into 1/2-inch\n  (12-mm) dice",
        "Kosher salt and freshly ground pepper, to taste",
        "1/2 lb. (250 g) assorted wild mushrooms, trimmed and sliced or\n  torn into bite-size pieces",
        "1 batch Thin Crust Pizza Dough",
        "1 cup (8 fl. oz./250 ml) artichoke and garlic pizza sauce",
        "2 cups (8 oz./250 g) shredded mozzarella cheese",
        "16 to 20 small fresh sage leaves (optional)"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pizza with Butternut Squash, Wild Mushrooms and Artichoke Sauce",
    "url": "http://www.williams-sonoma.com/recipe/pizza-with-butternut-squash-wild-mushrooms-and-artichoke-sauce.html"
}
