{
    "directions": [
        "Preheat the grill.",
        "Meanwhile, prepare the burger mixture. Turn on a food processor fitted with metal blades and drop three of the garlic clove halves and the basil leaves through the feed tube to chop them finely. Stop the machine, scrape down the sides of the work bowl, and add the ground beef, Parmesan, tomato paste, oregano, and sugar. Pulse the machine on and off several times until the ingredients are well mixed. With clean hands, form the mixture into four equal circular patties about 3/4 inch thick. Set the patties aside on a plate. Wash your hands and then brush the cut sides of the rolls with the olive oil.",
        "Carefully oil the grill rack. Put the burgers on the grill and cook until done medium well, 12 to 14 minutes, turning once. During the last 2 minutes or so, put the roll halves oiled sides down on the grill to toast until golden.",
        "Quickly rub the toasted side of each roll half lightly with the cut side of the remaining garlic clove half. Place a burger on the bottom half of each roll and serve with condiments for guests to add to taste."
    ],
    "ingredients": [
        "2 garlic cloves, peeled and cut in halves",
        "4 fresh basil leaves",
        "1 1/2 pounds good-quality ground beef",
        "1/2 cup grated Parmesan cheese",
        "2 tablespoons tomato paste",
        "1 tablespoon dried oregano",
        "1 teaspoon sugar",
        "4 soft good-quality sandwich rolls or burger buns, split",
        "2 tablespoons extra-virgin olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Cheese",
        "Garlic",
        "Fourth of July",
        "Picnic",
        "Quick & Easy",
        "Parmesan",
        "Basil",
        "Ground Beef",
        "Summer",
        "Grill/Barbecue",
        "Oregano"
    ],
    "title": "Pizzaiola Burgers",
    "url": "http://www.epicurious.com/recipes/food/views/pizzaiola-burgers-106605"
}
