{
    "directions": [
        "Stir warm water and yeast in small bowl. Let stand 5 minutes to dissolve. Stir in 2 tablespoons oil.",
        "Mix flour and 1 teaspoon salt in processor. With machine running, add yeast mixture, then 1/2 cup cold water; process until dough forms ball on top of blade. Process 45 seconds. Transfer dough to lightly floured surface. Knead until smooth, 1 to 2 minutes. Pour 1 tablespoon oil into medium bowl. Add dough to bowl; turn to coat. Cover with plastic wrap and let rise in warm draft-free area until doubled in volume, about 1 hour 15 minutes.",
        "Meanwhile, heat remaining 3 tablespoons oil and garlic in small saucepan over low heat until mixture begins to bubble, 1 to 2 minutes. Set garlic oil aside.",
        "Place potatoes in medium saucepan. Add enough cold water to cover. Sprinkle with salt. Cover and bring to boil over high heat. Reduce heat to medium and boil with lid slightly ajar until almost tender, about 12 minutes. Drain; let stand until cool. Place pizza stone or baking sheet (if using rimmed sheet, turn upside down) in oven. Preheat oven to 450°F. Transfer dough to work surface. Roll, pat, and stretch dough to 12- to 14-inch round. Sprinkle pizza peel or another baking sheet (if using rimmed sheet, turn upside down) with cornmeal. Transfer dough round to prepared peel. Cover with plastic and let rest 10 minutes.",
        "Using thin knife, cut potatoes into 1/8-inch-thick slices. Sprinkle dough with Parmigiano-Reggiano and Fontina, leaving 1-inch plain border around edge. Arrange potato slices over cheese, then brush potatoes with garlic oil. Sprinkle roasted red peppers over pizza. Spoon heaping 1/4-teaspoon dollops tapenade over. Brush dough border with garlic oil.",
        "Slide pizza from peel to pizza stone or baking sheet in oven. Bake until bottom of crust is golden brown and cheese is melted, 15 to 20 minutes. Using peel, transfer pizza to cutting board. Drizzle any remaining garlic oil over pizza. Sprinkle with chopped rosemary, crushed red pepper, and salt. Cut into wedges and serve.",
        "A thick paste or spread made from brine-cured olives, capers, anchovies, and seasonings; available at some supermarkets and at specialty foods stores and Italian markets."
    ],
    "ingredients": [
        "1/4 cup warm water (105°F to 115°F)",
        "1 1/4-ounce package active dry yeast (2 1/4 teaspoons)",
        "6 tablespoons extra-virgin olive oil, divided",
        "2 cups bread flour",
        "1 teaspoon salt",
        "1/2 cup cold water",
        "1 large garlic clove, finely chopped",
        "4 baby Yukon Gold potatoes",
        "Cornmeal (for sprinkling)",
        "1/3 cup freshly grated Parmigiano-Reggiano cheese",
        "1 1/2 cups (6 ounces) coarsely grated Italian Fontina cheese (such as Fontina d'Aosta)",
        "1 roasted red bell pepper in brine from jar, diced (1/3 cup)",
        "3 tablespoons purchased black olive tapenade*",
        "2 teaspoons finely chopped fresh rosemary",
        "Dried crushed red pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Potato",
        "Appetizer",
        "Bake",
        "High Fiber",
        "Father's Day",
        "Dinner",
        "Lunch",
        "Fontina",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Pizza with Fontina, Potatoes, and Tapenade",
    "url": "http://www.epicurious.com/recipes/food/views/pizza-with-fontina-potatoes-and-tapenade-351536"
}
