{
    "directions": [
        "Place a piece of cheesecloth into a strainer, and place the ricotta cheese into the cheesecloth. Set a bowl underneath the strainer to catch drips, and refrigerate 8 hours, or overnight, to allow moisture to drip from ricotta.",
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Place sausage into a large skillet over medium heat, and cook and stir until browned and crumbly, about 10 minutes. Drain excess grease, and allow sausage to cool.",
        "Place the drained ricotta cheese into a large bowl, and stir in 5 beaten eggs and mozzarella cheese until well mixed. Mix in the cooked sausage, Parmesan cheese, parsley, prosciutto, and black pepper until thoroughly combined.",
        "Divide the pizza dough into fourths, and roll out 2 of the pieces into 12-inch circles. Fit the circles into 2 10-inch pie plates, leaving 1 inch of dough hanging over the edge. Divide the filling between the 2 pies. Roll out 2 top crusts, place onto the pies, and fold the edges of the bottom crusts over the edges of the top crusts to seal. Crimp and flute the edges of the pie crusts.",
        "Beat 1 egg with water in a small bowl, and brush the egg wash over the tops and edges of both pies. Cut several slits into the top crusts to vent steam.",
        "Bake pies in the preheated oven for 15 minutes, then lower oven temperature to 325 degrees F (165 degrees C). Continue to bake until the crust is browned and the filling is hot, 45 to 50 more minutes. Serve at room temperature."
    ],
    "ingredients": [
        "2 pounds ricotta cheese",
        "2 pounds bulk Italian sausage",
        "5 large eggs, beaten",
        "1 pound shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese",
        "1 tablespoon finely chopped parsley",
        "1/4 pound prosciutto, chopped",
        "freshly cracked black pepper to taste",
        "2 pounds prepared pizza dough",
        "1 egg",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pizza Rustica (A Sicilian Sausage and Prosciutto Pie)",
    "url": "http://allrecipes.com/recipe/216565/pizza-rustica-a-sicilian-sausage-and/"
}
