{
    "directions": [
        "Preheat a Breville pizza maker on the preheat setting for 30 minutes.",
        "While the pizza maker heats, in a small saucepan over medium-low heat, warm the cream until reduced by half, 15 to 20 minutes.",
        "In a fry pan over medium-high heat, warm the olive oil. Add the onion and cook until the onions are softened and lightly caramelized, 5 to 7 minutes. Add the garlic and thyme and cook, stirring, for 30 seconds more. Remove from the heat.",
        "Once the cream has reduced, stir the onion mixture into the cream and season with a pinch each of salt and pepper.",
        "On a lightly floured surface, roll out half of the dough into a 10-inch (25-cm) round. Prick the dough all over with the tines of a fork. Transfer the dough to a floured pizza peel. Spread half of the cream mixture over the dough, leaving a 1/2-inch (12-mm) border uncovered. Top with half each of the cheese, prosciutto and lemon slices.",
        "Transfer the pizza to the pizza maker. Bake on the classic setting according to the manufacturer’s instructions until the crust is crisp and the cheese is lightly browned, 10 to 11 minutes.",
        "Using the pizza peel, transfer the pizza to a cutting board. Preheat the pizza maker again, assemble the remaining pizza and bake on the classic setting. Divide the arugula evenly between the pizzas, cut into slices and serve immediately. Makes two 10-inch (25-cm) pizzas.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "2 cups (16 fl. oz./500 ml) heavy cream",
        "2 tsp. olive oil",
        "1/2 yellow onion, diced",
        "2 garlic cloves, minced",
        "1 tsp. fresh thyme leaves",
        "Kosher salt and freshly ground pepper",
        "1 batch food processor pizza dough",
        "2 cups (8 oz./250 g) shredded mozzarella",
        "3 oz. (90 g) thinly sliced prosciutto",
        "1 lemon, quartered and very thinly sliced",
        "2 cups (2 oz./60 g) baby arugula"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pizza with Prosciutto, Arugula and Lemon",
    "url": "http://www.williams-sonoma.com/recipe/pizza-with-prosciutto--arugula-and-lemon.html"
}
