{
    "directions": [
        "Preheat a Breville pizza maker on the preheat setting for 30 minutes.",
        "Meanwhile, in a large nonstick fry pan over medium-high heat, warm the 2 tsp. olive oil. Add the sausage and cook, breaking it up into small pieces with a spatula, until browned, about 6 minutes. Transfer to a paper towel-lined plate.",
        "Wipe out the pan, return it to medium-high heat and warm the 2 Tbs. olive oil. Add the garlic and cook, stirring frequently, for 30 seconds. Add the broccoli rabe, season with salt and pepper and cook, stirring frequently, until crisp-tender, about 4 minutes. Transfer to a bowl.",
        "On a lightly floured surface, roll out half of the dough into a 10-inch (25-cm) round. Prick the dough all over with the tines of a fork. Transfer the dough to a floured pizza peel. Spread half of the pizza sauce over the dough, leaving a 1/2-inch (12-mm) border uncovered. Top with half",
        "each",
        "of the cheese, sausage and broccoli rabe.",
        "Transfer the pizza to the pizza maker. Bake on the classic setting according to the manufacturer’s instructions until the crust is crisp and the cheese is lightly browned, 10 to 11 minutes.",
        "Using the pizza peel, transfer the pizza to a cutting board. Preheat the pizza maker again, assemble the remaining pizza and bake on the classic setting. Cut the pizza into slices and serve immediately. Makes two 10-inch (25-cm) pizzas.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "2 tsp. plus 2 Tbs. olive oil",
        "3/4 lb. (375 g) sweet Italian sausage, casings removed",
        "1 tsp. minced garlic",
        "1 bunch broccoli rabe, about 11 oz. (345 g), cut crosswise into\n  1-inch (2.5-cm) pieces",
        "Kosher salt and freshly ground pepper, to taste",
        "1 batch Thin Crust Pizza Dough",
        "1 cup (8 fl. oz./250 ml) San Marzano tomato pizza sauce",
        "2 cups (8 oz./250 g) shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pizza with Broccoli Rabe and Sausage",
    "url": "http://www.williams-sonoma.com/recipe/pizza-with-broccoli-rabe-and-sausage.html"
}
