{
    "directions": [
        "Pour warm water into large bowl; sprinkle yeast over. Let stand until yeast dissolves, about 10 minutes. Stir in 2 tablespoons olive oil and salt. Mix in 3 1/2 cups flour, 1 cup at a time, stirring well after each addition, until sticky dough forms. Knead dough on floured surface until smooth, adding more flour if very sticky, about 6 minutes.",
        "Coat large bowl with remaining 1 tablespoon olive oil; add dough and turn to coat. Cover bowl with plastic wrap, then kitchen towel. Let dough rise in warm draft-free area until doubled, about 1 hour.",
        "Sprinkle 2 large baking sheets with cornmeal. Divide dough into 6 equal portions. Transfer to floured surface and roll out each to 7-inch round. Transfer to prepared baking sheets. Let stand while preparing topping.",
        "Meanwhile, preheat oven to 450°F.",
        "Heat 3 tablespoons olive oil in large skillet over medium heat. Add peas; sauté 1 minute. Add 4 teaspoons water to skillet and cook until evaporated. Transfer peas to bowl.",
        "Heat 3 tablespoons oil in same skillet over medium-high heat. Add onions and sauté until beginning to brown, about 10 minutes. Reduce heat to medium; sauté until onions are golden brown, about 15 minutes longer.",
        "Divide onions, prosciutto, Gruyère, and peas among pizza crusts. Bake until golden and beginning to crisp, about 17 minutes. Divide sprouts among pizzas."
    ],
    "ingredients": [
        "1 1/2 cups warm water (115°F to 120°F)",
        "1 1/2 tablespoons active dry yeast (from 3 envelopes)",
        "3 tablespoons olive oil, divided",
        "1 tablespoon salt",
        "3 1/2 cups (or more) all purpose flour",
        "Yellow cornmeal (for baking sheet)",
        "6 tablespoons olive oil, divided",
        "2 cups fresh shelled green peas (from 2 1/2 pounds peas in pod)",
        "4 teaspoons water",
        "6 cups thinly sliced onions",
        "6 ounces sliced prosciutto, torn into strips",
        "3 cups (packed) grated Gruyère cheese",
        "3 cups coarsely chopped pea sprouts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Bake",
        "Sauté",
        "Super Bowl",
        "Oscars",
        "Pea",
        "Birthday",
        "Poker/Game Night",
        "Prosciutto"
    ],
    "title": "Pizzas with Prosciutto, Peas, Pea Sprouts and Gruyère",
    "url": "http://www.epicurious.com/recipes/food/views/pizzas-with-prosciutto-peas-pea-sprouts-and-gruyere-241914"
}
