{
    "directions": [
        "To make the dough, in a large bowl, whisk together the water and yeast. Let stand until foamy, about 5 minutes. Whisk in 1 cup of the flour and the salt. Stir in enough flour, about 2 cups, to form a sticky dough. Turn the dough out onto a well-floured work surface and knead, adding more flour as needed, until smooth and satiny, about 5 minutes. Put 1 Tbs. oil in each of 2 bowls. Cut the dough in half, shape each into a ball and put 1 ball in each bowl. Turn the dough to coat with oil and cover each bowl with a kitchen towel. Let rise at room temperature until doubled in bulk, about 2 hours.",
        "Prepare a charcoal or gas grill for indirect grilling over high heat. Oil the grill rack.",
        "Brush a work surface with the remaining 1 Tbs. oil. Transfer 1 dough ball to the oiled surface and pat and stretch the dough into a round about 12 inches in diameter. Lightly dust a pizza peel with cornmeal and lay the dough on top.",
        "Slide the pizza off the peel onto the grill rack away from the fire of a charcoal grill or away from the heat elements of a gas grill. Cook until the bottom of the crust is lightly marked by the grill but not crisp, 4 to 6 minutes. Using 2 spatulas, turn the crust grilled-side up. Working quickly, sprinkle half of the cheese over the crust. Scatter half of the bacon and half of the tomatoes over the cheese, then sprinkle half of the basil evenly over the top. Cook, rotating once or twice, until the cheese is melted and the crust is crisp and brown at the edges, 8 to 10 minutes more.",
        "Using the pizza peel, transfer the pizza to a cutting board, cut into wedges or squares, and serve immediately. Repeat with the remaining ingredients to make a second pizza. Serves 6 to 8 as an appetizer, 4 to 6 as a main course.",
        "Adapted from Williams-Sonoma,",
        "Essentials of Grilling",
        ", by Denis Kelly, Melanie Barnard, Barbara Grunes & Michael McLaughlin (Oxmoor House, 2003)."
    ],
    "ingredients": [
        "1 1/2 cups warm water (105° to 115°F)",
        "1 package (2 1/2 tsp.) active dry yeast",
        "About 3 1/2 cups bread flour",
        "1 1/2 tsp. salt",
        "3 Tbs. olive oil",
        "Cornmeal for dusting",
        "3/4 lb. low-moisture, part-skim mozzarella cheese, coarsely shredded",
        "4 thick-cut bacon slices, about 6 oz. total, cut crosswise into 1/2-inch pieces and cooked until crisp",
        "16 cherry tomatoes, halved",
        "12 large fresh basil leaves, torn into 1-inch pieces"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pizza with Bacon and Tomatoes",
    "url": "http://www.williams-sonoma.com/recipe/pizza-with-bacon-and-tomatoes.html"
}
