{
    "directions": [
        "Preheat an oven to 400°F. Oil a large rimless baking sheet.",
        "Punch down the pizza dough and turn it out onto a lightly floured work surface. Cut the dough into 4 equal pieces. Roll out each piece, stretching the dough if necessary, into a 6- to 8-inch round. Carefully transfer the rounds to the prepared pan. The dough is elastic and will tend to lose shape; use oiled fingertips to reform the rounds on the pan, stretching and pulling the dough as needed. Brush with olive oil. Bake until the rounds are puffed and lightly browned, about 20 minutes. Remove from the oven. Leave the oven on.",
        "Meanwhile, in a small fry pan over medium heat, cook the bacon, stirring, until crisp, 5 to 7 minutes. Using a slotted spoon, transfer to paper towels to drain.",
        "Evenly sprinkle one-fourth",
        "each",
        "of the bacon and the cheese over the top of each pizza. To prevent the egg yolks from breaking, crack each egg into a shallow bowl or saucer, then slide it onto the center of a pizza. Season lightly with salt and pepper. Bake until the egg whites are set and the yolks are glazed over but still soft, about 10 minutes.",
        "Slide each pizza onto an individual plate, garnish with chives and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Essentials of Breakfast and Brunch,",
        "by Georgeanne Brennan, Elinor Klivans, Jordan Mackay and Charles Pierce (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "Olive oil as needed",
        "1 batch Thin Crust Pizza Dough",
        "8 thick bacon slices, about 1/2 lb. total, cut into 1 1/2-inch pieces",
        "1/2 cup grated Parmigiano-Reggiano cheese",
        "4 eggs",
        "Salt and freshly ground pepper, to taste",
        "Snipped fresh chives for garnish"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pizzas with Eggs and Bacon",
    "url": "http://www.williams-sonoma.com/recipe/pizzas-with-eggs-and-bacon.html"
}
