{
    "directions": [
        "Spicy Pizza Sauce: Heat the olive oil in a large saucepan over medium-high heat. Add the onions and saute until they are soft, about 4 minutes. Add the garlic and wine; cook for an additional minute.",
        "Stir in tomato paste, diced tomatoes, red pepper, salt and black pepper. Reduce the heat and simmer for 20 to 25 minutes or until thickened. Stir in the vinegar; cool. Freeze leftover pizza sauce for a future Pizza Stromboli or regular pizza.",
        "Pizza Stromboli: Makes 1 large Stromboli. Preheat oven to 375 degrees F.  Remove crescent roll sheet from tube and place on sheet of parchment paper. Roll dough into a 10x14-inch rectangle. Place on baking sheet.",
        "Spread 1/2 of cheese down the center third of the dough. Top with 1 cup Spicy Pizza Sauce and 1 cup of chopped vegetables. Top with remaining cheese.",
        "Cut 1-inch crosswise strips down the sides of the rectangle. Starting from one end, bring one of the dough strips across the filling diagonally. Repeat on the other side, crisscrossing the dough strips. Continue down the rest of the braid, alternating strips to form the loaf. Brush with egg wash (one egg beaten with a pinch of salt). Sprinkle with dehydrated onions or poppy seed.  Bake for 25 to 30 minutes or until golden brown."
    ],
    "ingredients": [
        "2 tablespoons extra virgin olive oil",
        "1 small onion, chopped",
        "1 garlic clove, crushed",
        "4 tablespoons RED GOLD® Tomato Paste",
        "2 (14.5 ounce) cans RED GOLD® Petite Diced Tomatoes with Garlic & Olive Oil",
        "1 teaspoon red pepper",
        "Salt and black pepper to taste",
        "2 teaspoons balsamic vinegar",
        "1 (10 ounce) package refrigerated pizza crust, or crescent roll sheet",
        "1 (8 ounce) tube crescent roll sheets, or refrigerated pizza crust",
        "1 (8 ounce) package shredded pizza cheese",
        "1 cup assorted vegetables (green pepper, onion, mushrooms, and spinach leaves)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pizza Stromboli",
    "url": "http://allrecipes.com/recipe/240361/pizza-stromboli/"
}
