{
    "directions": [
        "To make the dough, in a small bowl, stir together the lukewarm water, the honey and 1 tsp. of the olive oil until blended. Sprinkle the yeast on top and let stand until foamy, about 10 minutes.",
        "By hand:",
        "In a large bowl, using a wooden spoon, stir together 1 cup of the all-purpose flour, the whole-wheat flour and the salt. Pour in the yeast mixture and stir, adding enough of the remaining 1/2 cup all-purpose flour, or more if needed, to form a soft dough.",
        "By food processor:",
        "In a food processor, combine 1 cup of the all-purpose flour, the whole-wheat flour and the salt and pulse a few times to blend. Pour in the yeast mixture and pulse until combined. Add enough of the remaining 1/2 cup all-purpose flour, or more if needed, and pulse to form a soft dough.",
        "Turn the dough out onto a floured work area and knead until the surface of the dough is very smooth, about 5 minutes, adding more all-purpose flour as needed. The dough should be soft but not sticky.",
        "Lightly oil a large bowl with the remaining 1 tsp. olive oil. Form the dough into a ball and place in the bowl. Turn to coat with the oil. Cover the bowl with a clean kitchen towel and let the dough rise in a warm place until doubled in bulk, about 1 hour.",
        "To make the pesto, place the sun-dried tomatoes in a heatproof bowl and add boiling water to cover. Let stand for 15 minutes, then drain. In a food processor, combine the reconstituted dried tomatoes, the fresh tomatoes, basil, garlic and salt and process until pureed. With the motor running, drizzle the olive oil through the feed tube and process just until the mixture is blended.",
        "To make the topping, heat a large fry pan over medium heat until hot enough for a drop of water to sizzle and then immediately evaporate. Add the olive oil and the mushrooms and stir to blend. Reduce the heat to medium-low, cover and cook until tender, about 5 minutes. Uncover, raise the heat to high and cook, stirring, until any liquid has evaporated and the mushrooms are lightly browned, about 3 minutes. Add the parsley, garlic, salt and a grind of pepper. Cook, stirring, for 2 minutes more. Remove from the heat.",
        "Punch the dough down and let rest for 10 minutes. (You can make the dough up to 1 day in advance, punch it down, place it in a plastic bag and refrigerate it until ready to shape and bake.) If making individual pizzas, divide the dough into 4 equal portions.",
        "Position a rack in the lowest position in an oven and preheat to 450°F. Lightly oil one 14-by-16-inch baking sheet, one 14-inch pizza pan or four 9-inch pizza or tart pans.",
        "Using a food processor fitted with the slicing blade, a mandoline or a large, sharp knife, slice the potatoes paper-thin. Rinse and blot dry between a double thickness of kitchen towels.",
        "On a lightly floured work surface, gently stretch or roll out the dough to fit the prepared pan(s). Transfer the dough to the pan(s). Spread the potato slices on the large crust and scatter the mushrooms randomly on top, or divide the potato slices among the 4 smaller crusts and top with the mushrooms, dividing evenly. Sprinkle the cheese on top.",
        "Bake until the crust is nicely browned, 20 to 25 minutes. Spray the bottom of the oven with water at regular intervals 3 times during the first 5 to 10 minutes of baking. Cut the small pizzas in half or the large pizza into 8 wedges. Top each serving with a spoonful of pesto and serve immediately. Serves 8.",
        "Adapted from Williams-Sonoma,",
        "Essentials of Healthful Cooking",
        ", by Mary Abbott Hess, Dana Jacobi & Marie Simmons (Oxmoor House, 2003)."
    ],
    "ingredients": [
        "1 cup lukewarm water",
        "1 Tbs. honey",
        "2 tsp. olive oil",
        "1 envelope (2 1/2 tsp.) active dry yeast",
        "1 1/2 cups all-purpose flour, or more as needed",
        "1/2 cup whole-wheat flour",
        "1 tsp. kosher salt",
        "1/2 cup dry-packed sun-dried tomato halves",
        "Boiling water",
        "2 firm, ripe plum tomatoes, diced (about 1/2 cup)",
        "1/2 cup packed fresh basil leaves",
        "1 garlic clove, chopped",
        "1/2 tsp. kosher salt",
        "2 Tbs. extra-virgin olive oil",
        "1 Tbs. extra-virgin olive oil",
        "3/4 lb. fresh mushrooms, brushed clean, tough stems removed and caps coarsely chopped (see note above)",
        "2 Tbs. finely chopped fresh flat-leaf parsley",
        "1 garlic clove, finely chopped",
        "1/2 tsp. kosher salt",
        "Freshly ground pepper, to taste",
        "1 lb. Yukon Gold or other small boiling potatoes",
        "1/2 cup grated Parmigiano-Reggiano cheese"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pizza with Potatoes, Mushrooms and Tomato-Basil Pesto",
    "url": "http://www.williams-sonoma.com/recipe/pizza-with-potatoes-mushrooms-and-tomato-basil-pesto.html"
}
