{
    "directions": [
        "Place warm water in large bowl; sprinkle yeast over and stir to blend. Let stand until yeast dissolves, about 10 minutes. Whisk in oil and salt. Stir in 1 1/2 cups flour. Turn out dough onto floured surface; knead until smooth and elastic, adding more flour if dough is sticky, about 10 minutes. Lightly oil large bowl. Add dough, turning to coat. Cover with plastic wrap. Let dough rise in warm area until doubled, about 1 hour.",
        "Punch down dough. Turn out onto floured surface; form into ball. Cover with towel; let rest 30 minutes.",
        "Melt butter in large skillet over medium-low heat. Add leeks; sauté until tender, about 10 minutes. Season with salt and pepper. Stir in parsley. Cool.",
        "Preheat oven to 500°F. Sprinkle 12-inch-diameter pizza pan or baking sheet generously with cornmeal. Roll out dough on lightly floured surface to 11-inch round. Transfer to prepared pan. Spread leek topping evenly over dough; sprinkle tomato over. Top with goat cheese. Drizzle 1 tablespoon oil over. Bake pizza until crust is golden and crisp, about 12 minutes. Remove from oven; brush crust rim with 1 tablespoon oil. Cut into wedges."
    ],
    "ingredients": [
        "3/4 cup warm water (105°F. to 115°F.)",
        "1 1/2 teaspoons dry yeast",
        "1 tablespoon olive oil",
        "1 teaspoon salt",
        "1 1/2 cups (or more) all purpose flour",
        "1 1/2 tablespoons butter",
        "2 medium leeks (white and pale green parts only), thinly sliced",
        "1 tablespoon minced fresh parsley",
        "Yellow cornmeal",
        "3/4 cup chopped seeded peeled tomato",
        "3 ounces soft fresh goat cheese (such as Montrachet), crumbled",
        "2 tablespoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Vegetable",
        "Bake",
        "Super Bowl",
        "Vegetarian",
        "Goat Cheese",
        "Leek",
        "Spring",
        "Healthy",
        "California"
    ],
    "title": "Pizza with Leeks, Tomato and Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/pizza-with-leeks-tomato-and-goat-cheese-423"
}
