{
    "directions": [
        "1. Pour the fruit liqueur into a shallow dish. Sprinkle the pepper on a saucer. Dip the cut sides of the figs first into the fruit liqueur, then into the pepper, and place, cut side up, on a baking sheet to marinate for 20 minutes.",
        "2. Cut each slice of pancetta lengthwise into 1/2-inch strips. Loosely wrap each fig half with a strip of pancetta. Fry the rest of the pancetta until crisp and crumbly and set aside.",
        "3. Prepare a hot fire in your grill.",
        "4. Place the planks on the grill grate and close the lid. When the planks start to smoke and pop, after 3 to 5 minutes, open the lid and turn the planks over using grill tongs. Quickly place the fig halves on the planks, cut side up. Sprinkle the goat cheese and fried pancetta on the figs. Cover and plank-roast for 12 to 15 minutes, or until the figs have softened and are scorched around the edges and the goat cheese has a burnished appearance and a brownish-red color. Drizzle with the honey and serve.",
        "Oven-Planking: Preheat the oven to 450°F. Place the planked pancetta-wrapped figs, sprinkled with goat cheese and fried pancetta, in the middle of the oven. Plank-roast for 12 to 15 minutes, or until the figs are scorched around the edges. Drizzle with honey and serve."
    ],
    "ingredients": [
        "1/2 cup crème de cassis or other not-too-sweet fruit liqueur, such as crème de mûre, or Calvados",
        "1 tablespoon cracked black pepper",
        "8 large, ripe black or green fresh figs, cut in half lengthwise, stems left intact",
        "8 thin slices pancetta",
        "1 cup crumbled fresh goat cheese",
        "Clover or other amber honey for drizzling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Fruit",
        "Appetizer",
        "Marinate",
        "Cocktail Party",
        "Fourth of July",
        "Father's Day",
        "Backyard BBQ",
        "Dinner",
        "Goat Cheese",
        "Fig",
        "Bacon",
        "Summer",
        "Birthday",
        "Shower",
        "Grill",
        "Grill/Barbecue",
        "Party",
        "Advance Prep Required",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Planked Figs with Pancetta and Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/planked-figs-with-pancetta-and-goat-cheese-359589"
}
