{
    "directions": [
        "In a medium bowl, combine the chicken stock, fish sauce, and sugar. Stir until the sugar dissolves.",
        "Peel the shrimp and slice in half lengthwise. Remove any veins. Wash the shrimp under cold water, pat dry with paper towels, and set aside.",
        "Clean the shiitake mushrooms with a dry, clean towel or brush. Cut the mushrooms into 1/4-inch slices. Wash the baby bok choy and cut into 1-inch pieces. Set aside to dry.",
        "Heat a frying pan or wok on high heat until smoking. Pour 1 tablespoon of the oil into the pan. Add the shrimp and cook it until it changes color (20 to 30 seconds). Remove from pan and set aside.",
        "Without cleaning the pan, add the remaining 2 tablespoons oil. Add the garlic and cook until fragrant, about 10 seconds. Add mushrooms and bok choy and stir-fry until the vegetables are tender, 30 seconds to 1 minute.",
        "Add the shrimp to the pan and stir-fry for 10 seconds. Then add the rice wine and continue to stir. Add the stir-fry sauce and cook until shrimp is fully cooked, about 15 seconds.",
        "Remove from heat and serve immediately with steamed rice. Any remaining sauce may be refrigerated for up to 4 days or frozen."
    ],
    "ingredients": [
        "1 1/2 cups chicken stock",
        "5 tablespoons fish sauce",
        "1 tablespoon granulated sugar",
        "12 plantation or tiger shrimp",
        "4 ounces shiitake mushrooms",
        "12 to 16 ounces baby bok choy",
        "3 tablespoons canola oil",
        "1/2 teaspoon minced garlic",
        "2 tablespoons mirin (rice wine)",
        "1/3 cup stir-fry sauce",
        "Steamed rice for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Mushroom",
        "Rice",
        "Stir-Fry",
        "Quick & Easy",
        "Shrimp",
        "Bok Choy"
    ],
    "title": "Plantation Shrimp with Shiitake Mushrooms and Baby Bok Choy",
    "url": "http://www.epicurious.com/recipes/food/views/plantation-shrimp-with-shiitake-mushrooms-and-baby-bok-choy-232841"
}
