{
    "directions": [
        "Bring granulated sugar, 3 cups water, and 1 tablespoon salt to a boil in a 1 1/2- to 2-quart saucepan, stirring until sugar is dissolved, then reduce heat to simmer. While water is coming to a boil, prepare chiles. Cut a slit from stem to point down 1 side of each chile with kitchen shears. (Some brands of chiles may be precut.) Add chiles to sugar water and simmer 5 minutes, then remove pan from heat and cool chiles in liquid while making escabeche and filling.",
        "Cook carrot in 1/4 cup oil in a 10-inch heavy skillet over moderately low heat, covered, stirring occasionally, until crisp-tender, 3 to 5 minutes. Add allspice, thyme, marjoram, bay leaves, vinegar, piloncillo, 2 1/2 teaspoons garlic, and remaining 3/4 cup water, then bring to a simmer, stirring until piloncillo is dissolved. Remove from heat and stir in 1/2 teaspoon salt and half of onion.",
        "Transfer escabeche to a bowl and cool while making filling and stuffing chiles.",
        "Cut off ends of plantains, then remove and discard peel and cut plantains into 1/2-inch cubes. Cook remaining half of onion in remaining 2 tablespoons oil in cleaned skillet over moderate heat, stirring occasionally, until it begins to brown, about 4 minutes. Add remaining 1 1/2 teaspoons garlic and cook, stirring, 30 seconds. Add plantains and cook, stirring occasionally and lightly mashing mixture, until golden brown, about 5 minutes. Stir in remaining 3/4 teaspoon salt and remove from heat.",
        "Drain chiles in a colander. Cut off stems with kitchen shears and carefully scrape out all seeds clinging to seedpod and attached to veins with your fingers. Press 1 tablespoon plantain mixture into an egg shape, then stuff into a chile, molding chile around stuffing. (If chile is split in other places, arrange around stuffing and reshape chile.) Transfer chile, slit side down, to a shallow 2-quart glass or ceramic serving dish. Stuff remaining chiles with remaining filling, transferring to serving dish and arranging in 1 layer. Spoon escabeche over chiles and marinate, uncovered, at room temperature 1 hour."
    ],
    "ingredients": [
        "2 tablespoons granulated sugar",
        "3 3/4 cups water",
        "1 tablespoon plus 1 1/4 teaspoons salt",
        "24 large chiles moritas (dried bright red chipotle chiles, preferably soft; 3 ounces)",
        "1 medium carrot, cut into 1/8-inch dice",
        "6 tablespoons olive oil",
        "1/2 teaspoon ground allspice",
        "3 sprigs fresh thyme or 1/2 teaspoon dried, crumbled",
        "3 sprigs fresh marjoram or 1/2 teaspoon dried, crumbled",
        "2 Turkish bay leaves or 1 California",
        "1/2 cup cider vinegar",
        "2 tablespoons packed coarsely grated piloncillo (unrefined brown sugar; sometimes called panela) or packed dark brown sugar",
        "4 teaspoons finely chopped garlic (3 to 4 cloves)",
        "1 medium red onion, halved lengthwise, then thinly sliced crosswise",
        "2 very ripe large plantains (skin should be predominantly black; 1 1/2 pounds total)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Onion",
        "Marinate",
        "Sauté",
        "Vegetarian",
        "Cinco de Mayo",
        "Vinegar",
        "Hot Pepper",
        "Healthy",
        "Vegan",
        "Plantain",
        "Gourmet"
    ],
    "title": "Plantain-Stuffed Chipotles Chiles in Escabèche",
    "url": "http://www.epicurious.com/recipes/food/views/plantain-stuffed-chipotles-chiles-in-escabeche-235983"
}
