{
    "directions": [
        "Combine milk, sugar, and cream in large bowl, whisking to dissolve sugar. Add lemon juice, lime juice, and lemon extract; whisk to blend (mixture will thicken). Cover and refrigerate at least 2 hours. (Can be made 1 day ahead. Keep refrigerated.) Process mixture in ice cream maker according to manufacturer's instructions. (Can be made 1 day ahead. Cover and freeze in airtight container.)",
        "Blend flour, sugar, lemon peel, and salt in processor. Add butter; using on/off turns, cut in until pea-size pieces form. With machine running, pour egg mixture through feed tube and blend just until dough forms ball. Gather dough into disk; wrap tightly in plastic wrap and refrigerate at least 2 hours. (Can be made up to 3 days ahead. Keep refrigerated.)",
        "Roll out dough between 2 lightly floured sheets of waxed paper to 1/4-inch thickness. Peel off top sheet of paper. Invert crust into 9-inch glass pie dish; peel off paper. Fold edges under to form rim; crimp edges. Refrigerate 1 hour.",
        "Preheat oven to 400°F. Mix walnuts, flour, brown sugar, and 1/2 teaspoon cinnamon in medium bowl to blend. Add butter and rub in with fingertips until coarse meal forms. Set streusel aside. Whisk 3/4 cup sugar, cornstarch, nutmeg, and remaining 1 teaspoon cinnamon in large bowl. Add plums and toss to coat.",
        "Place pie dish on baking sheet. Brush inside of pie shell lightly with egg glaze. Transfer plum filling to pie shell, mounding slightly in center. Sprinkle streusel topping evenly over filling. Bake pie 15 minutes; reduce oven temperature to 375°F. Bake until filling bubbles at edges, about 35 minutes, covering crust edges with foil during last 15 minutes if browning too quickly. Cool pie on rack. (Can be made 8 hours ahead. Cover and let stand at room temperature.) Cut pie into wedges. Serve with ice milk."
    ],
    "ingredients": [
        "2 cups whole milk",
        "3/4 cup sugar",
        "1/2 cup whipping cream",
        "3 tablespoons fresh lemon juice",
        "2 tablespoons fresh lime juice",
        "1/8 teaspoon lemon extract",
        "1 1/4 cups all purpose flour",
        "1/2 teaspoon sugar",
        "1/2 teaspoon grated lemon peel",
        "1/4 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "1 large egg yolk beaten to blend with 3 tablespoons cold water",
        "3/4 cup finely chopped walnuts (about 3 ounces)",
        "1/2 cup all purpose flour",
        "3 tablespoons (packed) golden brown sugar",
        "1 1/2 teaspoons ground cinnamon",
        "3 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "3/4 cup sugar",
        "1/4 cup cornstarch",
        "1/2 teaspoon ground nutmeg",
        "1 1/2 pounds plums (about 5 large), halved, pitted, cut into 1/2-inch-thick wedges",
        "1 large egg beaten with 2 teaspoons water (for glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Ice Cream Machine",
        "Fruit",
        "Dessert",
        "Bake",
        "Frozen Dessert",
        "Lemon",
        "Plum",
        "Walnut",
        "Summer",
        "Chill",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Plum Streusel Pie with Lemon-Lime Ice Milk",
    "url": "http://www.epicurious.com/recipes/food/views/plum-streusel-pie-with-lemon-lime-ice-milk-108263"
}
