{
    "directions": [
        "Blend first 4 ingredients in processor until nuts are finely ground. Add butter; blend until coarse meal forms. Add egg yolk; blend until moist clumps form. Press dough onto bottom and up sides of 9-inch-diameter tart pan with removable bottom. Cover; chill 1 hour.",
        "Preheat oven to 350°F. Blend flour, walnuts, both sugars, coarse salt, cinnamon, nutmeg, and cardamom in processor until nuts are finely ground. Add thyme and blend 5 seconds. Transfer mixture to medium bowl. Add butter. Using fingertips, rub in until small moist clumps form.",
        "Spread streusel mixture on rimmed baking sheet. Bake 8 minutes. Stir, then continue baking until golden brown, about 7 minutes longer. Cool streusel completely (mixture will become crisp).",
        "Combine both cheeses, 1 tablespoon honey, 1 tablespoon oil, sugar, nutmeg, coarse salt, and pepper in large bowl; stir to blend well. Refrigerate while baking crust.",
        "Preheat oven to 350°F. Line crust with foil; fill with dried beans or pie weights. Bake crust until sides are set, about 15 minutes. Remove foil and beans. Continue to bake crust until golden brown, pressing with back of fork if crust bubbles, about 15 minutes longer. Cool crust completely.",
        "Spread cheese filling in crust. Arrange plums in concentric circles atop filling, leaving 3/4-inch plain border. Sprinkle streusel lightly over tart. Refrigerate tart at least 1 hour and up to 4 hours.",
        "Remove pan sides; place tart on platter. Drizzle with 2 tablespoons honey and 2 tablespoons oil; sprinkle with fleur de sel. Cut tart into wedges.",
        "*Fleur de sel, a sea salt from Brittany, can be found at specialty foods stores."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1/2 cup powdered sugar",
        "1/2 cup walnuts (about 2 ounces)",
        "1/4 teaspoon coarse kosher salt",
        "7 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "1 egg yolk",
        "1 cup all purpose flour",
        "2/3 cup walnuts (about 3 ounces)",
        "1/3 cup (packed) golden brown sugar",
        "1/3 cup sugar",
        "1/2 teaspoon coarse kosher salt",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground cardamom",
        "1 teaspoon fresh thyme leaves",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "8 ounces soft fresh goat cheese",
        "8 ounces (1 cup) whole-milk ricotta cheese",
        "3 tablespoons honey",
        "3 tablespoons extra-virgin olive oil",
        "1 tablespoon sugar",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon coarse kosher salt",
        "Pinch of freshly ground black pepper",
        "4 large plums (about 1 pound), halved, pitted, cut into 1/4-inch-thick wedges",
        "Fleur de sel*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fruit",
        "Dessert",
        "Bake",
        "Goat Cheese",
        "Plum",
        "Walnut",
        "Fall",
        "Thyme",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Plum Tart with Goat Cheese and Walnut-Thyme Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/plum-tart-with-goat-cheese-and-walnut-thyme-streusel-108598"
}
