{
    "directions": [
        "Preheat oven to 375°F. Combine first 3 ingredients in processor. Using on/off turns, cut in butter until mixture resembles coarse meal. Mix 2 tablespoons ice water and vanilla in small bowl. Pour water mixture over dough. Process until moist clumps form. Gather dough into ball; flatten into disk. Roll out on floured surface to 12-inch round. Transfer to 9-inch-diameter tart pan with removable bottom. Trim overhang to 1/2 inch. Fold overhang in and press, forming double-thick sides. Using fork, pierce dough all over. Freeze 15 minutes.",
        "Bake crust until pale golden, about 30 minutes (crust may shrink slightly). Cool on rack. Maintain oven temperature.",
        "Finely grind almonds with sugar in processor. Add egg, butter and 2 teaspoons framboise. Process until batter forms. Pour filling into crust. Arrange plums atop filling. Bake until plums are tender and filling is golden and set, about 50 minutes.",
        "Melt jelly with remaining 2 teaspoons framboise in heavy small saucepan over medium-low heat. Brush jelly mixture over plums. Cool tart. Serve at room temperature with whipped cream, if desired."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1 tablespoon sugar",
        "1/8 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces",
        "2 tablespoons ice water",
        "1/4 teaspoon vanilla extract",
        "1/3 cup whole almonds (about 2 ounces)",
        "1/3 cup sugar",
        "1 large egg",
        "3 tablespoons unsalted butter, room temperature",
        "4 teaspoons framboise (raspberry liqueur) or brandy",
        "12 ounces ripe red-skinned plums, pitted, cut into 3/4-inch-thick wedges",
        "1/4 cup red currant jelly",
        "Whipped cream (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Bake",
        "Plum",
        "Almond",
        "Fall"
    ],
    "title": "Plum-Almond Tart",
    "url": "http://www.epicurious.com/recipes/food/views/plum-almond-tart-15566"
}
