{
    "directions": [
        "Preheat oven to 350°F. Line pie dish with crust; crimp edges. Fully bake pie crust according to recipe or box instructions.",
        "Place plums in a large bowl; add 1 1/2 cups sugar and lemon juice. Scrape in seeds from half of vanilla bean; toss to coat. Divide plum mixture between two 13x9x2\" glass baking dishes, arranging plums cut side down and overlapping slightly. Roast until juices are bubbling and slightly thickened and plums are tender but not falling apart, 40-60 minutes (cooking time will depend on ripeness of plums). Let cool slightly.",
        "Using a slotted spatula, transfer plums to a rimmed baking sheet. Cover loosely with plastic wrap; chill. Pour juices in baking dishes into a small saucepan. Bring to a boil and simmer until thickened and reduced to a scant 1/2 cup, 4-5 minutes; set glaze aside.",
        "Combine remaining 2 tablespoons sugar, mascarpone, crème fraîche, and honey in a medium bowl. Scrape in seeds from remaining half vanilla bean. Using an electric mixer, beat on high speed until mixture holds firm peaks (do not overbeat or mascarpone may curdle). DO AHEAD: Plums, glaze, and mascarpone cream can be made 1 day ahead. Cover separately and chill.",
        "Spread mascarpone cream evenly over bottom of crust. Arrange some chilled plum halves tightly (but not overlapping) in a single layer over mascarpone mixture. Starting at edges of pie crust, arrange remaining plum halves on top of base layer, overlapping tightly and forming a spiral to cover. Pie should dome slightly in the center.",
        "Using a pastry brush, spread some of glaze over plums (if glaze has firmed up, gently reheat, adding 1 tablespoon water and whisking to blend).",
        "Cut pie into slices. Top with whipped cream and drizzle with more plum syrup."
    ],
    "ingredients": [
        "1 pie crust, homemade or store-bought",
        "4-5 pounds firm ripe plums (20-25 plums), halved, pitted (with skin)",
        "1 1/2 cups plus 2 tablespoons sugar",
        "2 tablespoons fresh lemon juice",
        "1 vanilla bean, split lengthwise",
        "8 ounces mascarpone",
        "1/3 cup crème fraîche",
        "2 tablespoons honey",
        "Whipped cream",
        "Special equipment: A 9\" pie dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "High Fiber",
        "Plum",
        "Vanilla",
        "Summer",
        "Marscarpone",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Plum and Mascarpone Pie",
    "url": "http://www.epicurious.com/recipes/food/views/plum-and-mascarpone-pie-51108270"
}
