{
    "directions": [
        "1. Prepare the Giblet Broth one day ahead: Simmer the chicken broth, giblets and neck in a saucepan until the giblets are tender, about 1 hour. Strain the broth into a bowl; cover and refrigerate. Shred the meat from the neck and finely chop the giblets; cover and refrigerate.",
        "2. Preheat oven to 325°F. Prepare the turkey: Squeeze the orange inside the body and neck cavities; sprinkle with paprika, salt and pepper. Stuff loosely with Cranberry Fennel Stuffing , using about 3 cups for the neck and 8 cups for the body. Close the turkey with lacers or sew with a large needle and heavy thread; tie legs together. Rub bird with the butter; sprinkle with paprika, salt and pepper.",
        "3. Place a rack in a large roasting pan and cover with 2 long pieces of heavy-duty foil, lengthwise and crosswise. Place the turkey, breast-side up, on top of the foil. Pour 2 cups of the Giblet Broth into the pan. Close the foil loosely over the turkey. Roast for 1 1/2 hours.",
        "4. Open up the foil and roast the turkey, basting with pan juices every 30 minutes, for 2 1/2 hours. If the turkey starts to get too brown, tent it loosely with the foil.",
        "5. Raise the oven temperature to 350°F and cook the turkey for 1 more hour or until an instant-read thermometer inserted into the thickest part of the thigh reads 170°F. The temperature in the breast should read 160°F, and the juices should run clear when the thigh is pricked with a sharp knife. During the last 15 minutes of roasting, brush the turkey with the Plum Glaze . Transfer the turkey to a platter. Let the turkey rest, loosely covered with foil, for 20 minutes before carving. Remove the stuffing to a serving dish and cover.",
        "6. Present the turkey, garnished with the grapes and sage, before carving. Arrange the carved meat on a large, decorative platter and serve with hot Giblet Gravy."
    ],
    "ingredients": [
        "(make one day ahead):",
        "1 large can (48 ounces) chicken broth",
        "Giblets and neck from turkey, rinsed and dried",
        "(make Thanksgiving Day):",
        "1 turkey (about 18 pounds)",
        "1 large orange, halved",
        "Paprika, salt and pepper, to taste",
        "Cranberry Fennel Stuffing",
        "4 to 6 tablespoons unsalted butter, at room temperature",
        "Plum Glaze (make one day ahead)",
        "2 large bunches red grapes, for garnish",
        "2 to 3 large bunches fresh sage, for garnish",
        "(make Thanksgiving Day)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "turkey",
        "Roast",
        "Thanksgiving",
        "Dinner",
        "Orange",
        "Sage",
        "Grape",
        "Parade"
    ],
    "title": "Plum-Glazed Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/plum-glazed-turkey-240889"
}
