{
    "directions": [
        "Preheat oven to 425°F.",
        "Simmer jam, five-spice powder, peppercorns, water, and 1/2 teaspoon salt in a small saucepan, stirring, until jam is melted, about 3 minutes. Pour glaze through a fine-mesh sieve into a small bowl, pressing on and discarding solids, then cool.",
        "Rinse turkey inside and out and pat dry. Season inside and out with remaining teaspoon salt. Loosely fill large body cavity (and neck cavity if desired) with stuffing and tie drumsticks together with string. Fold neck skin under body and secure with skewers, then tuck wings under.",
        "Put turkey on a rack set in a large flameproof roasting pan and roast in middle of oven 30 minutes.",
        "Reduce oven temperature to 350°F.",
        "Brush melted butter over turkey and roast, basting every 30 minutes (add a little water to pan if juices get too dark), 1 1/2 hours.",
        "Brush turkey with plum glaze and continue to roast until thermometer inserted in center of body cavity (stuffing) registers 165°F (fleshy part of thigh will be about 180°F; do not touch bone), 1 to 1 3/4 hours more. If glaze starts browning too much, tent turkey with foil. (Total roasting time: 3 to 3 3/4 hours.) Transfer turkey to a platter (do not clean roasting pan), then remove skewers and discard string. Transfer stuffing from cavity to a serving dish and keep warm, covered. Let turkey stand 30 minutes.",
        "Transfer pan juices to a 2-quart glass measure, then skim fat, reserving 3 tablespoons of it. Add enough turkey stock to pan juices to total 4 1/2 cups. Straddle roasting pan across 2 burners, then add wine and deglaze pan by boiling over moderately high heat, stirring and scraping up brown bits, until wine is reduced by half, about 5 minutes. Add stock mixture and jam and boil, stirring, until jam is melted. Pour through fine-mesh sieve into glass measure.",
        "Whisk together reserved fat and flour in a large heavy saucepan (it will be about the thickness of peanut butter) and cook roux over moderately low heat, stirring, 3 minutes. Add hot stock mixture in a fast stream, whisking constantly to prevent lumps, and simmer, whisking occasionally, until thickened, about 5 minutes. Stir in turkey juices accumulated on platter and simmer 1 minute. Season with salt and pepper.",
        "Serve turkey with gravy."
    ],
    "ingredients": [
        "1/2 cup plum jam (preferably damson plum) or red currant jelly (6 oz)",
        "2 teaspoons Chinese five-spice powder",
        "2 tablespoons whole black peppercorns",
        "2 tablespoons water",
        "1 1/2 teaspoons salt",
        "1 (12- to 14-lb) turkey (preferably kosher), any feathers and quills removed with tweezers or needlenose pliers, and neck and giblets (excluding liver) reserved for making stock",
        "5 to 7 cups spinach, bacon, and cashew stuffing (see stuffed onions )",
        "1/2 stick (1/4 cup) unsalted butter, melted",
        "Pan juices from roast turkey",
        "About 3 1/2 cups turkey giblet stock",
        "1/2 cup dry red wine",
        "1/4 cup plum jam (preferably damson plum) or red currant jelly (3 oz)",
        "1/3 cup all-purpose flour",
        "Special equipment: 2 small metal skewers or wooden toothpicks; kitchen string; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Nut",
        "Pork",
        "Poultry",
        "turkey",
        "Roast",
        "Thanksgiving",
        "Bacon",
        "Cashew",
        "Fall",
        "Jam or Jelly",
        "Gourmet"
    ],
    "title": "Plum-Glazed Roast Turkey with Spinach, Bacon, and Cashew Stuffing and Plum Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/plum-glazed-roast-turkey-with-spinach-bacon-and-cashew-stuffing-and-plum-gravy-107358"
}
