{
    "directions": [
        "Preheat oven to 350°F. Butter and flour a 9-inch springform pan.",
        "Quarter and pit plums. Coarsely chop half of plums and in a bowl toss with 2 tablespoons sugar. In another bowl combine remaining plums with 2 tablespoons sugar. On a baking sheet in middle of oven lightly toast hazelnuts until fragrant and insides are golden, 10 to 15 minutes. Cool nuts and grind fine in a food processor.",
        "In a bowl whisk together hazelnuts, flour, baking powder, salt, and allspice. In a bowl with an electric mixer beat butter and remaining 3/4 cup sugar until light and fluffy. Add eggs, 1 at a time, beating after each addition, and beat in vanilla and flour mixture until batter is just combined.",
        "Drain chopped plums in a sieve, pressing on fruit, and pat dry with paper towels. Stir plums into batter and spread evenly in pan.",
        "Drain quartered plums in sieve, pressing on fruit, and arrange, skin sides up, over batter. Bake torte in middle of oven 1 hour and 20 minutes, or until golden brown and a tester comes out clean. Cool torte in pan on a rack 30 minutes. Remove side of pan and cool completely."
    ],
    "ingredients": [
        "1 1/2 pounds Italian prune plums",
        "1 cup sugar",
        "3/4 cup hazelnuts",
        "1 1/4 cups all-purpose flour",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1/2 teaspoon ground allspice",
        "1 1/2 sticks (3/4 cup) unsalted butter, softened",
        "3 large eggs",
        "1 teaspoon vanilla"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dairy",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Vegetarian",
        "Plum",
        "Fall",
        "Summer",
        "Hazelnut",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Plum Hazelnut Torte",
    "url": "http://www.epicurious.com/recipes/food/views/plum-hazelnut-torte-100776"
}
