{
    "directions": [
        "Place the plums, a few at a time, into a colander set over a large bowl. With gloved hands, squeeze the plums in the colander, forcing the juice through the holes of the colander. Discard spent pulp, and repeat to produce 8 cups of plum juice.",
        "Pour 3/4 cup of plum juice into a small saucepan with garlic and onion, place over medium heat, and bring to a boil. Reduce heat to medium-low, and simmer until the onion is translucent, about 5 minutes.",
        "Pour the juice-onion mixture into a large pot, and add the remaining 7 1/2 cups of plum juice. Stir in the sugar, apple cider vinegar, Southwest chipotle seasoning, roasted garlic seasoning, jalapeno pepper, salt, and liquid smoke flavoring until the sugar and salt have dissolved. Bring the mixture to a boil over medium heat, reduce heat to a simmer, and cook the sauce down until thickened, about 1 1/2 hours. Stir frequently to prevent burning.",
        "Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the sauce into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.",
        "Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes.",
        "Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area."
    ],
    "ingredients": [
        "5 quarts very ripe plums, pitted, or as needed",
        "4 cloves garlic, pressed",
        "1 onion, finely chopped",
        "6 cups white sugar",
        "1/2 cup apple cider vinegar",
        "2 tablespoons Southwest chipotle seasoning",
        "1 tablespoon roasted garlic seasoning",
        "1 jalapeno pepper, finely chopped (remove seeds for milder flavor if desired)",
        "7 teaspoons salt",
        "1 teaspoon liquid smoke flavoring (optional)",
        "8 half-pint canning jars with lids and rings"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Plum Chipotle Sauce",
    "url": "http://allrecipes.com/recipe/215144/plum-chipotle-sauce/"
}
