{
    "directions": [
        "Line six 3/4-cup custard cups with plastic wrap, leaving 3-inch overhang on all sides. Using 3-inch cookie cutter, cut out 1 round from each bread slice; reserve.",
        "Combine plums and sugar in heavy medium saucepan. Stir over medium-low heat until sugar dissolves and syrup forms. Simmer until plums are tender and translucent, stirring often, about 5 minutes. Add all berries; simmer until berries release their juices, stirring occasionally, about 5 minutes. Stir in lemon juice. Cool to room temperature.",
        "Arrange 2 cooked plum slices in bottom of each custard cup. Top plums in each with 2 tablespoons fruit mixture with juices, then 1 bread round. Top each with remaining fruit mixture with juices, dividing equally. Place 1 bread round atop each; press into fruit mixture to compact. Cover puddings tightly with plastic-wrap overhang. Place custard cups on baking sheet. Top cups with another baking sheet. Place several food cans on top baking sheet to weigh down. Chill overnight. (Can be made 2 days ahead. Keep chilled.).",
        "Unfold plastic wrap from top of custard cups. Invert puddings onto plates. Remove plastic wrap. Spoon whipped cream alongside and serve."
    ],
    "ingredients": [
        "12 1/2-inch-thick egg bread slices",
        "12 ounces red or purple plums (about 3 large), halved, pitted, each half cut into 6 slices",
        "3/4 cup sugar",
        "2 1/2-pint baskets raspberries (about 2 2/3 cups)",
        "1 1/2-pint basket blueberries (about 1 1/3 cups)",
        "1 teaspoon fresh lemon juice",
        "Sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Fruit",
        "Dessert",
        "Fourth of July",
        "Blueberry",
        "Raspberry",
        "Plum",
        "Summer",
        "Chill",
        "Party",
        "Ramekin",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Plum and Berry Summer Puddings",
    "url": "http://www.epicurious.com/recipes/food/views/plum-and-berry-summer-puddings-103799"
}
