{
    "directions": [
        "Blend together flour, salt, butter, and shortening with your fingertips or a pastry blender (or pulse in a food processor) just until most of mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Drizzle with 3 tablespoons ice water and gently stir with a fork until incorporated. Squeeze a small handful: If it doesn't hold together, add more ice water, 1/2 tablespoon at a time, stirring (or pulsing) until just incorporated, then test again. (Do not overwork, or pastry will be tough.)",
        "Turn out mixture onto a lightly floured surface and divide into 4 portions. With heel of your hand, smear each portion once or twice in a forward motion. Gather dough together, with a pastry scraper if you have one, and press into a ball, then flatten into a 6-inch disk. Chill, wrapped in plastic wrap, until firm, at least 1 hour.",
        "Toss plums with 2 tablespoons sugar in a bowl and let stand at room temperature 1 hour.",
        "Pulse almonds with flour, salt, and remaining 1/3 cup sugar in a food processor until very finely chopped, then add butter, egg, and Amaretto (if using), pulsing until just blended.",
        "Roll out dough into a 15-inch round (about 1/8 inch thick) on a floured surface with a floured rolling pin. Cut out 6 (5-inch) rounds and fit each round into a tartlet pan (don't trim). Prick bottoms all over with a fork and chill shells until firm, about 15 minutes.",
        "Preheat oven to 375°F with rack in middle.",
        "Drain plums, discarding juices. Divide almond filling among tartlet shells and arrange plums over it. Put pans on a baking sheet and bake until crust and filling are golden and plums are tender, 35 to 45 minutes. Cool tartlets completely in pans on a rack before unmolding. Just before serving, dust with confectioners sugar."
    ],
    "ingredients": [
        "1 1/4 cups all-purpose flour",
        "1/4 teaspoon salt",
        "3/4 stick cold unsalted butter, cut into 1/2-inch cubes",
        "2 tablespoons cold vegetable shortening (preferably trans-fat-free)",
        "3 to 4 tablespoons ice water",
        "2/3 pound small firm-ripe prune plums (9 or 10), quartered lengthwise and pitted",
        "1/3 cup plus 2 tablespoons sugar, divided",
        "1/2 cup whole almonds with skinsv",
        "1/4 cup all-purpose flour",
        "1/8 teaspoon salt",
        "1/2 stick unsalted butter, softened",
        "1 large egg",
        "1 tablespoon Amaretto (optional)",
        "Confectioners sugar for dusting",
        "Equipment:6 (4- by 3/4-inch) round nonstick tartlet pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dessert",
        "Bake",
        "Plum",
        "Almond",
        "Amaretto",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Plum Almond Tartlets",
    "url": "http://www.epicurious.com/recipes/food/views/plum-almond-tartlets-239282"
}
