{
    "directions": [
        "Preheat oven to 400°F. Toss plums, sugar, cornstarch, and vanilla in large bowl to coat. Transfer to 13x9x2-inch glass baking dish. Bake until thick and bubbling at edges, about 30 minutes.",
        "Whisk flour, 3 tablespoons sugar, baking powder, salt, and 1/4 teaspoon cinnamon in large bowl to blend. Add butter; rub in with fingertips until coarse meal forms. Whisk 3/4 cup whipping cream and egg in small bowl to blend. Stir cream mixture into flour mixture just until blended. Gently knead in bowl until dough comes together, about 5 turns.",
        "Remove plums from oven and stir gently. Break off golf-ball-size pieces of dough and arrange over hot plums, spacing apart. Brush dough with remaining 2 tablespoons cream. Mix remaining 2 tablespoons sugar and 1/4 teaspoon cinnamon in small bowl. Sprinkle over dough.",
        "Bake cobbler until fruit is bubbling, biscuits are browned, and tester inserted into center of biscuits comes out clean, about 30 minutes. Cool slightly. Serve hot or warm with vanilla ice cream."
    ],
    "ingredients": [
        "4 pounds plums (about 12 large), halved, pitted, cut into 1/2-inch slices",
        "1 cup sugar",
        "2 1/2 tablespoons cornstarch",
        "1 teaspoon vanilla extract",
        "2 cups all purpose flour",
        "5 tablespoons sugar, divided",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground cinnamon, divided",
        "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
        "3/4 cup plus 2 tablespoons whipping cream",
        "1 large egg",
        "Vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Plum",
        "Summer",
        "Cinnamon",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Plum Cobbler with Cinnamon Biscuits",
    "url": "http://www.epicurious.com/recipes/food/views/plum-cobbler-with-cinnamon-biscuits-109806"
}
