{
    "directions": [
        "To pit the plums, slice them almost in half, open, and remove pit. Place about 1/3 teaspoon of sugar in the hollow of each plum; close the plum, and place in a bowl. Set aside.",
        "Place potatoes in a large pot with enough water to cover. Bring to a boil, and cook until tender. Drain. When cool enough to handle, mash potatoes with a fork or potato masher. You will need 1 cup of mashed potatoes. Set aside, and keep warm.",
        "To make the dough, sift the flour, sugar, baking powder, and salt together into a pile on a breadboard. Make a well in the center; add 1 cup mashed potatoes, egg yolks, and shortening into the well, and work in until the dough is pliable and smooth.",
        "When dough is thoroughly kneaded, roll it out onto a floured board to a thickness of about 1/4 inch. Cut into roughly 4-inch rounds with a biscuit cutter. Holding one piece of dough in your hand, place a whole pitted plum in the center. Place another piece of dough on top, and press to seal the edges of the dough together. Make sure there are no leaks, or the plum will come out during cooking.",
        "To cook, bring a deep pot of salted water to boil. Place dumplings in water, and boil gently for about 10 minutes.",
        "Meanwhile, to make the sauce, melt butter in a large frying pan over medium heat. Stir in brown sugar.  (If you like, stir in some of the juice that collects in the bowl of pitted plums.) Stir in a small amount of bread crumbs to slightly thicken the sauce.",
        "When dumplings are done, remove them from boiling water, and place them in the frying pan, and turn to coat the dumplings. Serve hot with extra sauce poured over them."
    ],
    "ingredients": [
        "25 Italian prune plums",
        "3 tablespoons sugar",
        "2 large potatoes, peeled and quartered",
        "Dough:",
        "2 1/2 cups all-purpose flour",
        "1 teaspoon sugar",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon salt",
        "3 egg yolks",
        "2 tablespoons shortening or butter, softened",
        "Sauce:",
        "1/2 cup butter",
        "1 1/2 cups dark brown sugar",
        "1/4 cup fine dry bread crumbs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Plum Dumplings",
    "url": "http://allrecipes.com/recipe/90225/plum-dumplings/"
}
