{
    "directions": [
        "In a blender or food processer, combine the mango, sugar, lemon and lime juice and process until smooth. Season to taste with salt, cover, and refrigerate until ready to use.",
        "In a blender or food processer, combine the avocados, sour cream, key lime and lemon juice and process until smooth. Season to taste with salt, cover, and refrigerate until ready to use.",
        "In a large pot over moderately high heat, bring the water, wine, lemon halves, bay leaves, peppercorns, and salt to a boil. Add the lobster tails and poach for 6 minutes then transfer to a large baking sheet to let cool. When cool enough to handle, crack open the lobster shells and remove the meat. Set aside while you fry the oysters.",
        "Line a large baking sheet with paper towels. Fill a heavy-bottomed medium saucepan with 1 inch of oil, leaving at least 3 inches between the oil and the top of the saucepan. Heat the oil over moderately high heat until a deep-fry thermometer registers 350°F.",
        "In a small bowl, whisk together the flour, cayenne, paprika, and salt. Dredge the oysters in the flour mixture, shaking off any excess. Working in batches, fry the oysters, turning once, until golden brown, about 5 minutes. Transfer as done to the paper towel–lined baking sheet. Continue to fry the remaining oysters, returning the oil to 350°F between batches.",
        "In a large sauté pan over moderate heat, melt the butter and garlic together. Add the lobster tail meat and sauté, basting with the melted butter, until heated through.",
        "Arrange 1 lobster tail and 3 oysters on each of 4 plates. Serve with mango and avocado purées on the side."
    ],
    "ingredients": [
        "1 mango, peeled and diced",
        "3 tablespoons sugar",
        "2 tablespoons freshly squeezed lemon juice",
        "1 tablespoon freshly squeezed lime juice",
        "Fine sea salt",
        "2 avocados",
        "2 tablespoons sour cream",
        "Juice of 5 key limes or 1 regular lime",
        "1 tablespoon freshly squeezed lemon juice",
        "Fine sea salt",
        "4 quarts water",
        "1 cup white wine",
        "1 lemon, halved",
        "2 dried bay leaves",
        "6 whole black peppercorns",
        "1/4 cup fine sea salt",
        "4 (16-ounce) lobster tails",
        "Vegetable oil for frying oysters",
        "1 cup all-purpose flour",
        "1 teaspoon cayenne",
        "1 teaspoon paprika",
        "2 teaspoon fine sea salt, plus more to taste",
        "12 oysters, shucked",
        "3 tablespoons unsalted butter",
        "1 clove garlic, minced",
        "Deep-fry thermometer, 2 large baking sheets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Shellfish",
        "Vegetable",
        "Fry",
        "Mango",
        "Seafood",
        "Lobster",
        "Oyster",
        "Avocado"
    ],
    "title": "Poached Lobster Tails, and Fried Oyster with Mango and Avocado Purée",
    "url": "http://www.epicurious.com/recipes/food/views/poached-lobster-tails-and-fried-oyster-with-mango-and-avocado-puree-51191010"
}
