{
    "directions": [
        "Drain and rinse the almonds in fresh cold water, then pound them with the herbs, the garlic clove and a little salt. Slowly pour the olive oil into the mixture, stirring to combine.",
        "Put the chicken breasts into a pan of cold water with the reserved herb stalks (from the dressing), the garlic and the salt. Bring the water to a simmer, turn off the heat and immediately cover the pan. Allow the chicken to sit in the hot poaching liquor for 20 minutes, until cooked through.",
        "Bring a medium saucepan of salted water to a boil and blanch the green beans for 1 1/2 to 2 minutes, then cool under cold running water. Transfer to a large mixing bowl.",
        "Preheat the broiler. Shave the fennel bulb with a mandolin or peeler into this slices and do the same with the carrot and zucchini. Add to the beans. Put the tomatoes on a non-stick baking sheet and under a preheated broiler for 2 to 3 minutes until softened. Add to the bowl.",
        "Remove the chicken breasts from the poaching liquor. Thinly slice them and add to the bowl of vegetables. Toss together and season to taste with salt and pepper.  Arrange the chicken and vegetables between plates and serve with the herb dressing and lemon wedges."
    ],
    "ingredients": [
        "10 almonds (1 tablespoon), soaked",
        "2 sprigs each of cilantro, basil, parsley and tarragon, leaves picked and stalks set aside",
        "1 small clove of garlic, peeled",
        "Sea salt",
        "1/2 cup olive oil",
        "2 (5-ounce) chicken breasts",
        "1 clove of garlic, crushed with skin on",
        "1 teaspoon sea salt",
        "A handful (approx. 1/4 pound) of green beans",
        "1 bulb of fennel",
        "1 carrot",
        "1 small zucchini",
        "6 ripe cherry tomatoes, halved",
        "Freshly ground black pepper",
        "Lemon wedges, to serve"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Chicken",
        "Vegetable",
        "Herb",
        "Dinner",
        "Healthy",
        "Low Fat",
        "Kid-Friendly",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Poached Chicken, Crunchy Vegetables, and Herb Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/poached-chicken-crunchy-vegetables-and-herb-dressing"
}
