{
    "directions": [
        "Squeeze juice from 1 lemon half into a bowl of cold water, then drop same half into water.",
        "Cut off stem of 1 artichoke, then trim 1/4 inch from end of stem to expose inner core. Trim sides of stem down to pale inner core, then rub with other lemon half. Drop stem into acidulated water.",
        "Cut off top inch from same artichoke with a serrated knife. Bend back outer leaves until they snap off close to base, then discard several more layers of leaves in same manner until you reach pale yellow leaves with pale green tips.",
        "Cut yellow leaves 1/2 inch above top of artichoke bottom with a sharp knife and trim dark green fibrous parts from base and sides of artichoke with a sharp paring knife. Rub artichoke bottom all over with same lemon half, then drop artichoke into acidulated water.",
        "Trim remaining artichokes in same manner.",
        "Put 2 quarts water in a 4-quart pot and whisk in flour. Whisk in oil, salt, and remaining tablespoon lemon juice and bring to a simmer.",
        "Add artichoke bottoms and stems and simmer, partially covered, until just tender, 15 to 20 minutes.",
        "Remove artichokes with a slotted spoon (leave cooking water in pot), then cut a 1/4-inch slice from each bottom (reserving trimmings) so that artichokes will stand upright. When artichokes are just cool enough to handle, pull out all pointed inner leaves and remove fuzzy choke. Return artichokes to water to keep warm. Cut reserved trimmings and stems into thin slices for sauce.",
        "Thinly slice mushrooms. Combine cream, mushrooms, cheese, and 1/2 teaspoon kosher salt in a small heavy saucepan and simmer until sauce is slightly thickened and reduced to about 1 cup, about 10 minutes. Stir in truffle oil, pepper, salt to taste, and sliced artichoke pieces. Keep sauce warm.",
        "Butter bottom of a 2-quart heavy saucepan and add 1 1/4 inches water. Add vinegar and bring to a simmer. Break 1 egg into a cup and slide into water. Repeat with remaining eggs, spacing them apart, and poach at a bare simmer until whites are firm but yolks are still runny, 2 to 3 minutes.",
        "Transfer eggs as cooked with a slotted spoon to paper towels to drain and season with salt and pepper.",
        "Drain artichoke bottoms and put 1 egg in each. Transfer to plates and spoon sauce over and around eggs."
    ],
    "ingredients": [
        "1 lemon, halved, plus 1 tablespoon fresh lemon juice",
        "4 large artichokes (10 to 12 ounces each)",
        "1 tablespoon all-purpose flour",
        "1 tablespoon olive oil",
        "1 tablespoon kosher salt",
        "3 ounces small fresh porcino or cremino mushrooms (3), trimmed",
        "1 1/4 cups heavy cream",
        "1 tablespoon finely grated Parmigiano-Reggiano",
        "1/2 teaspoon kosher salt, or to taste",
        "1/2 teaspoon white truffle oil",
        "1/4 teaspoon black pepper",
        "1 teaspoon distilled white vinegar",
        "4 large eggs",
        "Garnish: finely chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Vegetable",
        "Breakfast",
        "Brunch",
        "Poach",
        "Spring",
        "Gourmet",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Poached Eggs on Artichoke Bottoms with White Truffle Cream and Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/poached-eggs-on-artichoke-bottoms-with-white-truffle-cream-and-mushrooms-106265"
}
