{
    "directions": [
        "Working from head end to tail end, cut fish crosswise into 3-inch sections (very thick steaks; about 4), tapping back of knife with a mallet when you reach center bone to help cut through it. Discard tail if there is no flesh attached. Otherwise, set aside with steaks to cook.",
        "Bring 8 quarts water to a boil with onion, bay leaves, peppercorns, and allspice in pot, then stir in salt. Add salmon and cover pot with lid, then turn off heat. Let stand, undisturbed, until fish just separates from bones, about 18 minutes. Transfer salmon to a shallow pan with a slotted spoon and let stand just until cool enough to handle, about 10 minutes. Fish should be neither too warm (it may break) or too cool (it will start to congeal, making it more difficult to remove bones cleanly) when handled.",
        "With your hands, carefully remove flesh from each steak in pieces as large as possible, discarding skin and bones and arranging salmon on a platter.",
        "Stir together all sauce ingredients.",
        "Serve salmon at room temperature with sauce on the side."
    ],
    "ingredients": [
        "1 (6- to 6 1/2-lb) whole sockeye salmon (preferably wild), cleaned, discarding head but leaving tail intact",
        "1 large onion (3/4 pound), sliced",
        "4 Turkish or 2 California bay leaves",
        "6 whole black peppercorns",
        "2 whole allspice",
        "3/4 cup table salt",
        "1 cup mayonnaise",
        "1/2 cup sour cream",
        "2 tablespoons Dijon mustard",
        "1 tablespoon whole-grain or coarse-grain mustard",
        "1/3 cup finely chopped fresh dill",
        "1 tablespoon finely chopped fresh tarragon",
        "1/2 teaspoon finely grated fresh lemon zest",
        "Special equipment: a 10-quart pot with a lid"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Herb",
        "Mustard",
        "Poach",
        "Wedding",
        "Dinner",
        "Seafood",
        "Salmon",
        "Shower",
        "Tarragon",
        "Dill",
        "Gourmet",
        "Sugar Conscious"
    ],
    "title": "Poached Sockeye Salmon with Mustard Herb Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/poached-sockeye-salmon-with-mustard-herb-sauce-238701"
}
