{
    "directions": [
        "Put 1 tablespoon of olive oil into a pan on medium heat and sauté the onion, fennel and chili for 2 to 3 minutes, to soften. Add the tomato purée and cherry tomatoes. Simmer for a further 4 to 5 minutes. Season to taste with a little salt and pepper.",
        "Arrange the fish fillets in the pan, on top of the tomato sauce. Cover with a lid and simmer for 8 to 10 minutes, or until the fish is cooked and starting to flake. Just before serving, carefully stir in the olives and baby spinach and heat for a further minute.",
        "Meanwhile combine the parsley, garlic, lemon zest, and juice in a bowl.",
        "To serve, arrange the fish fillets on plates and spoon over the tomato sauce. Sprinkle with the herby topping, and add a squeeze of lemon juice to finish.",
        "Enjoy this with some additional steamed greens."
    ],
    "ingredients": [
        "Olive oil",
        "1 red onion, peeled and finely sliced",
        "1 bulb of fennel, finely sliced",
        "1 fresh red chili, finely sliced (deseeded for less heat, if you like)",
        "2 cups tomato purée from fresh or canned tomatoes",
        "2 handfuls (approx. 6 ounces) of cherry tomatoes, cut in half",
        "Sea salt and freshly ground pepper",
        "4 (5-ounce) white fish fillets, such as cod, hake, or sea bass, skinned and pin-boned",
        "1/2 cup black or green olives, pitted",
        "A handful of baby spinach",
        "2 tablespoons finely chopped flat-leaf parsley",
        "1 small clove of garlic, peeled and finely chopped or grated",
        "Zest of 1 lemon, plus a squeeze of juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Spinach",
        "Chile Pepper",
        "Dinner",
        "Kid-Friendly",
        "Healthy",
        "Low Fat",
        "Low Carb",
        "Low Cholesterol",
        "HarperCollins",
        "One-Pot Meal",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Poached Fish with Spinach in Chili-Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/poached-fish-with-spinach-in-chili-tomato-sauce"
}
