{
    "directions": [
        "Add 3 tablespoon lemon juice to a large bowl of cold water. Working with 1 artichoke at a time, remove tough dark outer leaves. Using a serrated knife, trim top of artichoke to just above the heart. Trim stem, leaving about 1\" intact. Using a paring knife or vegetable peeler, remove dark outer layer from stem. Halve artichoke lengthwise and scoop out choke with a spoon. Transfer artichoke to lemon water to prevent discoloration.",
        "Drain artichokes; pat dry. Cook with thyme, garlic, bay leaves, peppercorns, and oil in a large saucepan over medium heat until oil around artichokes is bubbling. Reduce heat and cook, turning artichokes occasionally, until stems are tender when pierced with a knife, 15-20 minutes; let cool in oil.",
        "Meanwhile, if using fresh fava beans, cook in a medium saucepan of boiling salted water until tender, about 4 minutes. Using a slotted spoon, transfer to a colander set in a bowl of ice water. Drain and peel; place in a large bowl. (If using frozen fava beans, cook 2 minutes; do not peel.)",
        "Return water in saucepan to a boil; add peas and cook until tender, about 2 minutes. Drain; transfer to colander in ice water. Drain and add to bowl with fava beans.",
        "Using a slotted spoon, transfer artichokes to bowl with peas and fava beans. Add 1/4 cup artichoke cooking oil, olives, pea shoots, mint, and remaining 2 tablespoon lemon juice; toss and season with salt and pepper.",
        "Do Ahead: Artichokes can be poached 1 day ahead. Keep in oil; cover and chill.",
        "Bring parsley, dill, lemon slices, lemon juice, wine, peppercorns, and 3 cups water to a simmer in a large saucepan over medium heat; season with salt. Add salmon; cover. Reduce heat and simmer gently until just opaque throughout, 6-8 minutes. Using a large spatula, remove salmon and lemon slices from poaching liquid. Serve salmon with artichoke salad and lemon slices."
    ],
    "ingredients": [
        "5 tablespoons fresh lemon juice, divided",
        "4 artichokes",
        "6 sprigs thyme",
        "4 garlic cloves, peeled",
        "2 bay leaves",
        "1 tablespoon black peppercorns",
        "3 1/2 cups olive oil",
        "1/2 cup fresh fava beans (from about 1/2 pound pods) or frozen, thawed",
        "Kosher salt",
        "1/2 cup shelled fresh peas (from about 1/2 pound pods) or frozen, thawed",
        "3/4 cup green olives, coarsely chopped",
        "1/2 cup pea shoots (tendrils) or fresh flat-leaf parsley leaves with tender stems",
        "1/2 cup torn fresh mint leaves",
        "Freshly ground black pepper",
        "4 sprigs flat-leaf parsley",
        "4 sprigs dill",
        "1 lemon, thinly sliced",
        "2 tablespoons fresh lemon juice",
        "1 cup dry white wine",
        "1 tablespoon black peppercorns",
        "Kosher salt",
        "4 6-ounce skinless salmon fillets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Lunch",
        "Salmon",
        "Artichoke",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Poached Salmon with Artichoke Confit",
    "url": "http://www.epicurious.com/recipes/food/views/poached-salmon-with-artichoke-confit-51236410"
}
