{
    "directions": [
        "Peel pears, leaving stems intact, then core from bottom with melon-ball cutter to create a 2 1/2-inch-deep cavity. Rub pears all over with lemon juice in a large bowl.",
        "Bring wine, sugar, vanilla bean, and zest to a boil in a wide 6-quart heavy pot (at least 12 inches in diameter) over moderate heat, stirring until sugar is dissolved. Add pears, arranging them on their sides in 1 layer, along with any lemon juice from bowl (pears will not be covered by liquid), then reduce heat to low and poach pears, covered, turning occasionally, until just tender, 15 to 20 minutes. Carefully transfer pears with a slotted spoon to a 13- by 9-inch baking dish, standing pears upright and reserving liquid in pot.",
        "When pears are cool enough to handle, fill cavities with quince paste and stand pears upright in dish again.",
        "Boil liquid in pot over high heat until syrupy and reduced to about 3/4 cup, 10 to 15 minutes. Pour syrup over pears and cool, basting occasionally with syrup. Chill, covered, basting occasionally with syrup, until cold, at least 2 hours.",
        "Drizzle each pear lightly with syrup and slip a parmesan cloak over stem. Serve with cheese shavings on the side."
    ],
    "ingredients": [
        "10 firm-ripe Bosc pears with stems (5 lb total)",
        "1/4 cup fresh lemon juice",
        "1 (750-ml) bottle dry white wine",
        "3/4 cup sugar",
        "1 vanilla bean",
        "2 (3- by 1-inch) strips fresh lemon zest",
        "1 lb Spanish or Portuguese quince paste (also called membrillo), cut into 10 equal pieces",
        "parmesan cloaks",
        "Special equipment: a 1-inch melon-ball cutter",
        "Accompaniment: 1 (2-lb) piece Parmigiano-Reggiano for shaving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Poach",
        "Thanksgiving",
        "Pear",
        "Quince",
        "Vanilla",
        "White Wine",
        "Fall",
        "Gourmet",
        "Fat Free",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Poached Pears with Quince Paste in Parmesan Cloaks",
    "url": "http://www.epicurious.com/recipes/food/views/poached-pears-with-quince-paste-in-parmesan-cloaks-231012"
}
