{
    "directions": [
        "Combine wine, sugar, orange juice, orange peel, lemon peel, cinnamon stick, star anise, and 2 cups water in a large heavy saucepan over medium heat. Bring to a boil, stirring until sugar is dissolved. Add apples; reduce heat to low and simmer, occasionally rotating apples, until tender when pierced with a sharp knife, 25-30 minutes.",
        "Using a slotted spoon, transfer apples to a plate and set aside. Strain poaching liquid in pan into a small saucepan, discarding solids in strainer. Set saucepan over medium-high heat and simmer, stirring occasionally, until poaching liquid is syrupy and reduced to about 3/4 cup, 10-15 minutes (syrup will thicken as it cools).",
        "Combine yogurt and honey in a small bowl. Scrape in seeds from vanilla bean; whisk until the yogurt sauce is smooth and well blended.",
        "Divide yogurt sauce among plates. Place warm apples on top. Drizzle syrup over."
    ],
    "ingredients": [
        "1 1/2 cups fruity red wine (such as Syrah or Zinfandel)",
        "3/4 cup sugar",
        "1/3 cup fresh orange juice",
        "2 3x1\" strips orange peel (white pith trimmed)",
        "1 3x1\" strip of lemon peel (white pith trimmed)",
        "1 cinnamon stick",
        "1 whole star anise",
        "4 medium Pink Lady, Golden Delicious, or Braeburn apples, peeled, cored",
        "1 cup 2% Greek-style yogurt",
        "1 1/2 tablespoons honey",
        "1 vanilla bean, split lengthwise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Dessert",
        "Poach",
        "Low Fat",
        "Vegetarian",
        "Quick & Easy",
        "Yogurt",
        "Low Sodium",
        "Apple",
        "Vanilla",
        "Fall",
        "Healthy",
        "Low Cholesterol",
        "Cinnamon",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Poached Apples with Vanilla Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/poached-apples-with-vanilla-yogurt-368301"
}
