{
    "directions": [
        "Find a high-sided pan large enough to accommodate both salmon fillets side-by-side, without too much excess room; a small skillet or medium-sized saucepan should do. Pour lemon juice and olive oil into the pan, along with enough water to bring the water level up to 3/4-inch. Season the water to taste with salt and pepper, then add the salmon. Pour in enough water to just cover the salmon.",
        "Place the salmon over medium-high heat, and heat until the water is hot and steaming, but not simmering (165 degrees F (75 degrees C)); reduce heat if needed to keep the water at the proper temperature. Poach until the salmon turns opaque, and is firm to the touch; or to an internal temperature of 140 degrees F (60 degrees C). Proceed making the Hollandaise sauce while the salmon is poaching.",
        "Pour a few inches of water into a saucepan, and bring to a boil over high heat, then turn heat to medium-high and maintain water at a gentle boil. Place the egg yolks in a metal bowl, and whisk in hot water. Place the bowl over, but not touching, the boiling water. Whisk constantly until the yolks thicken, turn a light, opaque yellow, and double in volume. You may need to remove the bowl from the boiling water from time to time in order to keep from scrambling the yolks.",
        "When the yolks have thickened and increased in volume, begin whisking in the butter, a cube at a time until it melts and incorporates into the hollandaise sauce. Wait for each cube to melt and incorporate before adding the next. Once all of the butter has been incorporated, remove from heat, whisk in the lemon juice, and season to taste with salt and pepper.",
        "To serve, drain the poached salmon and place each piece onto a dinner plate. Generously ladle with the warm hollandaise sauce, and sprinkle with chives."
    ],
    "ingredients": [
        "3 tablespoons fresh lemon juice",
        "1 tablespoon olive oil",
        "Salt and pepper to taste",
        "2 (6 ounce) skinless, boneless salmon fillets",
        "3 egg yolks",
        "1 tablespoon hot water",
        "1 cup butter, cut into small pieces",
        "2 tablespoons fresh lemon juice",
        "Salt and pepper to taste",
        "2 tablespoons chopped fresh chives"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Poached Salmon with Hollandaise Sauce",
    "url": "http://allrecipes.com/recipe/133137/poached-salmon-with-hollandaise-sauce/"
}
