{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Fill a deep 12-inch skillet with 1 1/2 inches cold water. Add vinegar and bring to a simmer. Meanwhile, purée tomatoes, garlic, chile, 1 teaspoon salt, 1/2 teaspoon sugar, and 1 cup water in a blender until smooth, then pour through a medium-mesh sieve into a bowl, pressing hard on and then discarding solids.",
        "Heat 1/4 cup oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then carefully pour in tomato sauce (it will splatter). Stir in cilantro and briskly simmer, uncovered, stirring occasionally, until sauce is slightly thickened, about 10 minutes. Stir in salt and sugar to taste, then reduce heat to low.",
        "While sauce simmers, put baguette slices in a shallow baking pan and brush with remaining tablespoon oil and season lightly with salt and pepper. Bake until just crisp on top, about 10 minutes. Keep toasts warm in turned-off oven.",
        "Meanwhile, break eggs, 2 at a time, into a cup, then slide eggs into simmering water, spacing them in skillet, and poach at a bare simmer until whites are firm but yolks are still runny, 4 to 5 minutes.",
        "Gently transfer eggs with a slotted spoon to soup bowls and season with salt. Spoon sauce generously over eggs and sprinkle with cilantro. Serve with toasts."
    ],
    "ingredients": [
        "1 teaspoon distilled white vinegar",
        "2 lb tomatoes, coarsely chopped",
        "2 large garlic cloves, coarsely chopped",
        "1 small fresh green serrano chile, coarsely chopped",
        "1 teaspoon salt, or to taste",
        "1/2 teaspoon sugar, or to taste",
        "1 cup water",
        "1/4 cup plus 1 tablespoon olive oil",
        "1/4 cup chopped fresh cilantro plus additional for sprinkling",
        "8 (1/2-inch-thick) slices of baguette",
        "8 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Tomato",
        "Breakfast",
        "Brunch",
        "Poach",
        "Quick & Easy",
        "Hot Pepper",
        "Cilantro",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Poached Eggs with Tomato Cilantro Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/poached-eggs-with-tomato-cilantro-sauce-232493"
}
