{
    "directions": [
        "Using melon baller, remove core from bottom end of pears. Combine wine, pear nectar and cinnamon stick in large pot. Scrape in seeds from vanilla bean; add bean. Bring to simmer. Add pears (liquid should cover pears halfway). Reduce heat to medium-low; cook until pears are tender, about 10 minutes, turning pears halfway through. Transfer pears and cooking liquid to large bowl. Cool completely.",
        "Drain poaching liquid back into pot. Mix 2 tablespoons liquid with arrowroot in small bowl; return to pot. Boil until sauce thickens and is reduced to 2 cups, stirring occasionally, about 12 minutes. Cool sauce to room temperature. (Pears and sauce can be prepared 1 day ahead. Cover separately and refrigerate. Bring to room temperature before serving.)",
        "Spoon sauce into 6 shallow bowls. Place pears atop sauce. Sprinkle kiwi, cantaloupe and strawberries around pears. Garnish with mint and serve."
    ],
    "ingredients": [
        "6 small firm but ripe Anjou pears, peeled",
        "3 1/2 cups sweet white or red wine (such as Moscato) from 1-liter bottle",
        "2 cups pear nectar",
        "1 cinnamon stick, broken in half",
        "1 vanilla bean, split lengthwise",
        "1 1/2 teaspoons arrowroot",
        "1/2 cup chopped peeled kiwi",
        "1/2 cup chopped peeled seeded cantaloupe",
        "1/2 cup quartered hulled strawberries",
        "Fresh mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Wine",
        "Fruit",
        "Dessert",
        "Poach",
        "Low Fat",
        "Strawberry",
        "Cantaloupe",
        "Pear",
        "Kiwi",
        "Mint",
        "Fall",
        "Vegan",
        "Fat Free",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Poached Pears with Sweet Wine and Fruit Confetti",
    "url": "http://www.epicurious.com/recipes/food/views/poached-pears-with-sweet-wine-and-fruit-confetti-101379"
}
