{
    "directions": [
        "Preheat oven to 400°F.",
        "Toss tomatoes and mushrooms with salt, pepper, and 2 tablespoons oil in a roasting pan. Arrange tomatoes cut sides up, then bake vegetables in lower third of oven until softened, about 20 minutes for mushrooms and 30 minutes for tomatoes. (Transfer mushrooms to a bowl while tomatoes finish roasting.)",
        "Transfer 8 tomato halves to a blender and purée with 1 tablespoon oil until smooth. (Thin sauce with water if desired.) Season with salt and pepper and transfer to a small ovenproof dish for reheating.",
        "Brush both sides of bread slices with remaining 2 tablespoons oil, then bake on a baking sheet in upper third of oven until crisp and golden on edges, about 10 minutes. Rub tops of toasts with cut sides of garlic. Leave toasts on baking sheet. (Leave oven on.)",
        "Fill a deep 12-inch skillet or small flameproof roasting pan with 1 1/4 inches cold water. Add vinegar and bring to a simmer to poach eggs.",
        "Reheat tomato sauce and roasted tomatoes and mushrooms in lower third of oven 5 to 10 minutes.",
        "Meanwhile, fold a slice of ham on top of each toast and heat in upper third of oven until warm, about 3 minutes.",
        "While other ingredients are reheating, break 1 egg into a cup, then slide egg into simmering water. Repeat with remaining eggs, spacing them apart, and poach at a bare simmer until whites are firm but yolks are still runny, 2 to 3 minutes.",
        "Transfer eggs with a slotted spoon to paper towels to drain and season with salt and pepper. Put 1 or 2 toasts on each plate and top each with a tomato half and a poached egg. Drizzle with tomato sauce and scatter mushrooms around eggs."
    ],
    "ingredients": [
        "8 large plum tomatoes (1 1/3 lb), halved lengthwise",
        "3/4 lb mushrooms, trimmed and halved (quartered if large)",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "5 tablespoons olive oil",
        "8 (1/2-inch-thick) slices Italian bread (3 to 4 inches wide)",
        "1 garlic clove, halved crosswise",
        "1 teaspoon distilled white vinegar",
        "1/4 lb thinly sliced smoked ham (8 slices)",
        "8 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Mushroom",
        "Tomato",
        "Breakfast",
        "Brunch",
        "Poach",
        "Roast",
        "Ham",
        "Gourmet",
        "Sugar Conscious",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Poached Eggs with Roasted Tomatoes, Mushrooms, and Ham",
    "url": "http://www.epicurious.com/recipes/food/views/poached-eggs-with-roasted-tomatoes-mushrooms-and-ham-107976"
}
