{
    "directions": [
        "In a shallow dish sprinkle the chicken with the cumin, the ginger, the salt, and the garlic, drizzle it with the oil, and rub it all over to coat it well. Chill the chicken, covered, for at least 1 hour or overnight.",
        "In a heavy saucepan cook the onion and the garlic in the oil over moderately low heat, stirring, until they are softened, stir in the ginger and the saffron, and cook the mixture for 30 seconds. Add the broth and 2 tablespoons each of the coriander and the parsley, bring the mixture to a boil, and simmer it for 10 minutes. Add the chicken and the carrot and poach the chicken, covered, for 10 minutes. Turn the chicken, add the zucchini, and cook the mixture, covered, for 10 minutes, or until the chicken is cooked through. Transfer the chicken with tongs to a cutting board and let it stand for 5 minutes. While the chicken is standing, add the olives and the remaining 1 tablespoon each of the coriander and the parsley to the pan, bring the liquid to a boil, and boil the mixture for 2 minutes.",
        "Put the saffron in a small dish, set the dish on a rack set over a saucepan of the broth and 3/4 cup water, and bring the liquid to a boil. Heat the saffron for 1 minute, crumble it into the broth, and add the oil. Stir in the couscous, remove the pan from the heat, and let the couscous stand, covered, for 5 minutes. Fluff the couscous with a fork before serving.",
        "Slice the chicken, divide it between 2 plates with the couscous, and spoon the vegetable mixture over it."
    ],
    "ingredients": [
        "3/4 pound boneless skinless chicken breast, halved",
        "1/4 teaspoon ground cumin",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon salt",
        "1 garlic clove, minced",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "2 garlic cloves, minced",
        "3 tablespoons olive oil",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon crumbled saffron threads",
        "2 cups chicken broth",
        "3 tablespoons chopped fresh coriander",
        "3 tablespoons chopped fresh flat-leafed parsley leaves",
        "1 carrot, cut crosswise into 1/4-inch slices",
        "1 zucchini, halved lengthwise and cut crosswise into 1/3-inch slices",
        "1 tablespoon Niçoise olives",
        "saffron couscous",
        "1/4 teaspoon crumbled saffron threads",
        "3/4 cup chicken broth",
        "1 tablespoon olive oil",
        "1/2 cup couscous"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Ginger",
        "Herb",
        "Olive",
        "Onion",
        "Marinate",
        "Poach",
        "Saffron",
        "Zucchini",
        "Winter",
        "Couscous",
        "Gourmet"
    ],
    "title": "Poached Chicken with Vegetables, Coriander and Saffron Couscous",
    "url": "http://www.epicurious.com/recipes/food/views/poached-chicken-with-vegetables-coriander-and-saffron-couscous-11314"
}
