{
    "directions": [
        "Finely grind pistachios and 3 tablespoons sugar in processor. Transfer nut mixture to heavy medium saucepan; add milk and bring to boil. Whisk remaining 4 tablespoons sugar, yolks, and cornstarch in medium bowl to blend. Gradually whisk hot milk mixture into yolk mixture. Return mixture to same pan; whisk constantly over medium-high heat until mixture boils and thickens, about 1 minute. Remove from heat. Whisk butter into pastry cream, 1 piece at a time. Transfer pastry cream to bowl; press plastic wrap directly onto surface. Cover and chill at least 4 hours. Stir in cream. (Can be made 2 days ahead. Keep chilled.)",
        "Bring wine, sugar, orange peel, and lemon peel to boil in heavy large saucepan, stirring until sugar dissolves. Add pears; bring to simmer. Cut parchment paper round to fit pan; press paper atop pears. Partially cover pan; reduce heat to medium-low and simmer gently until pears are tender, turning occasionally, about 30 minutes. Transfer pears and poaching liquid to medium bowl. Cool to room temperature. (Pears can be prepared 2 days ahead. Cover and refrigerate.)",
        "Line rimmed baking sheet with parchment paper. Stir sugar and 2 tablespoons water in heavy small saucepan over medium-low heat until sugar dissolves. Increase heat and boil without stirring until syrup turns medium amber color, occasionally brushing down pan sides with wet pastry brush and swirling pan. Immediately add pistachios; stir until caramel is deep amber and coats nuts. Immediately spread nuts on prepared baking sheet, separating any clumps. Cool completely. (Can be made 2 days ahead. Store airtight at room temperature.)",
        "Preheat oven to 375°F. Butter 9-inch-diameter tart pan with removable bottom. Blend flour, sugar, and salt in processor. Add butter and cut in using on/off turns until mixture resembles coarse meal. Add egg yolk and blend in using on/off turns until moist clumps form. Press dough onto bottom and up sides of prepared pan. Freeze crust 15 minutes.",
        "Bake crust until golden brown, about 20 minutes. Cool completely in pan on rack. (Can be made 1 day ahead. Let stand at room temperature.)",
        "Remove pears from poaching liquid. Pour poaching liquid into medium saucepan; boil until syrup is reduced to 1/2 cup, about 10 minutes. Chill wine syrup until cold.",
        "Cut pears lengthwise in half. Scoop out cores and center veins; cut off stems. Place pears, cut side down, on triple-thick layer of paper towels. Cover with triple-thick layer of paper towels. Pat pears dry, changing paper towels as needed to absorb excess liquid. Cut each pear half lengthwise into 4 to 6 slices.",
        "Spread pastry cream in crust. Arrange pear slices decoratively atop pastry cream, covering completely. (Can be prepared 2 hours ahead. Cover loosely and chill.)",
        "Scatter caramelized pistachios over tart. Cut tart into wedges and serve with wine syrup."
    ],
    "ingredients": [
        "2/3 cup shelled raw unsalted natural pistachios",
        "7 tablespoons sugar, divided",
        "1 1/3 cups whole milk",
        "4 large egg yolks",
        "3 tablespoons cornstarch",
        "2 tablespoons (1/4 stick) chilled unsalted butter, cut into 4 pieces",
        "5 tablespoons whipping cream",
        "3 cups fruity red wine (such as Zinfandel)",
        "3/4 cup sugar",
        "Peel from 1 orange, removed with vegetable peeler in strips",
        "Peel from 1 lemon, removed with vegetable peeler in strips",
        "5 medium-size firm but ripe pears (such as Anjou), peeled, rubbed with cut side of lemon wedge",
        "3 tablespoons sugar",
        "2 tablespoons water",
        "1/2 cup shelled raw unsalted natural pistachios",
        "1 1/2 cups all purpose flour",
        "1/2 cup powdered sugar",
        "1/4 teaspoon salt",
        "9 tablespoons chilled unsalted butter, cut into 1/2-inch cubes",
        "1 large egg yolk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Poach",
        "Christmas",
        "Pear",
        "Pistachio",
        "Red Wine",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Poached Pear Tart with Caramelized Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/poached-pear-tart-with-caramelized-pistachios-233437"
}
