{
    "directions": [
        "Fill a 3-quart saucepan halfway with water and add vinegar, oil, and salt, then whisk in flour. (Do not heat.)",
        "Cut off top inch of leaves of 1 artichoke with a serrated knife, then cut stem flush with base and discard stem. Bend back outer leaves until they snap off close to base, then discard several more layers of leaves in same manner until exposed leaves are pale green at top and pale yellow at base. Trim dark green fibrous parts from base and side of artichoke with a sharp paring knife, then cut remaining leaves flush with top of artichoke bottom. Drop artichoke bottom into water in pot, putting a sieve or small lid directly on top of artichoke to keep submerged, and prepare remaining artichokes in same manner. Bring to a boil, uncovered, then reduce heat and simmer, uncovered, keeping artichokes submerged with sieve or lid, until just tender, 12 to 15 minutes.",
        "Transfer artichokes with tongs (reserving water in saucepan) to a work surface, and, when cool enough to handle, remove pointed inner leaves and fuzzy chokes with a melon-ball cutter or a small spoon. Return artichokes to cooking water to keep warm, covered.",
        "Put 1 inch of water in a 3- to 4-quart pot and bring to a boil over high heat. Add spinach, 1 handful at a time, stirring with tongs, and cooking until all spinach is wilted. Drain spinach in a colander and press firmly with back of a large spoon to remove excess liquid.",
        "Cook shallot in butter in a 10-inch heavy skillet over moderately low heat, stirring, until softened, about 3 minutes. Add spinach, salt, and pepper and cook, stirring, 2 minutes. Keep warm, covered.",
        "Pour oyster liquor into a nonreactive 8-inch heavy skillet and add Champagne, shallot, and vinegar. Bring to a boil and boil, skimming foam, until reduced to about 1/3 cup, about 5 minutes. (Reduce heat if necessary to keep from boiling over.) Pour liquid through a fine-mesh sieve into a measuring cup, pressing on and then discarding shallot. Return liquid to skillet, then add cream and oysters and cook over moderate heat, turning oysters over if not completely covered, until edges curl, about 1 minute. Remove from heat.",
        "Transfer artichoke bottoms with tongs to paper towels to drain, arranging them upside down. Transfer to plates, turning them right side up, then top with spinach. Arrange oysters on top of spinach, lifting them out of sauce with a slotted spoon.",
        "Boil sauce until reduced to about 1/2 cup, 3 to 5 minutes. Reduce heat to low and add butter, then chives, and swirl skillet until butter is incorporated. Remove from heat and season with salt and pepper. Spoon sauce over oysters."
    ],
    "ingredients": [
        "2 tablespoons Champagne vinegar or white-wine vinegar",
        "1 tablespoon olive oil",
        "1 1/2 teaspoons salt",
        "1 tablespoon all-purpose flour",
        "4 medium artichokes (2 pounds total)",
        "1 1/2 pounds spinach (2 bunches), stems discarded and leaves coarsely chopped",
        "2 tablespoons minced shallot (1 small)",
        "2 tablespoons unsalted butter",
        "1/4 teaspoon salt, or to taste",
        "1/8 teaspoon black pepper, or to taste for oysters and sauce",
        "12 shucked large oysters such as Blue Point or Pacific, including liquor",
        "1 cup Champagne or other sparkling white wine",
        "2 tablespoons minced shallot (1 small)",
        "1 tablespoon Champagne vinegar or white-wine vinegar",
        "1/2 cup heavy cream",
        "1/2 stick (1/4 cup) cold unsalted butter, cut into 4 pieces",
        "2 tablespoons chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Champagne",
        "Milk/Cream",
        "Onion",
        "Shellfish",
        "Poach",
        "Valentine's Day",
        "New Year's Eve",
        "Vinegar",
        "Oyster",
        "Artichoke",
        "Spinach",
        "Winter",
        "Gourmet"
    ],
    "title": "Poached Oysters and Artichokes with Champagne Cream",
    "url": "http://www.epicurious.com/recipes/food/views/poached-oysters-and-artichokes-with-champagne-cream-236391"
}
