{
    "directions": [
        "Place salmon, skin side down, in a large high-sided skillet. Add wine, 2 tablespoons salt, and cold water to cover salmon by 1/2\". Cover pan; bring liquid to a simmer over medium heat. Reduce heat to medium-low, uncover, and gently poach salmon until just cooked through and barely opaque in the center, about 6 minutes, depending on thickness. Transfer salmon and 2 tablespoons poaching liquid to a plate; tent loosely with foil.",
        "Meanwhile, melt butter in a medium skillet over medium heat. Add mushrooms and cook, stirring occasionally, until they begin to soften, about 3 minutes. Add 1/2 cup salmon poaching liquid and peas and simmer until peas begin to soften, 2-3 minutes. Add cream and bring sauce to a simmer. Cook until slightly thickened, about 5 minutes. Season with salt and pepper.",
        "Using a spatula, transfer salmon, skin side up, to paper towels. Gently peel off and discard skin. Invert onto serving plates and spoon sauce over. Garnish with chives."
    ],
    "ingredients": [
        "2 6-8-ounce center-cut wild salmon fillets (each about 1 1/2\" thick)",
        "1 cup dry white wine",
        "2 tablespoons kosher salt plus more for seasoning",
        "4 tablespoons (1/2 stick) unsalted butter",
        "4 ounces fresh morels; sliced, stemmed shiitake; or other mushrooms",
        "1/2 cup shelled fresh (or frozen, thawed) peas",
        "1/2 cup heavy cream",
        "Freshly ground black pepper",
        "2 tablespoons minced fresh chives or 2 pea tendrils"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fish",
        "Mushroom",
        "Poach",
        "High Fiber",
        "Dinner",
        "Seafood",
        "Salmon",
        "Legume",
        "Pea",
        "White Wine",
        "Spring",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Poached Wild Salmon With Peas and Morels",
    "url": "http://www.epicurious.com/recipes/food/views/poached-wild-salmon-with-peas-and-morels-395473"
}
