{
    "directions": [
        "Blend extra-virgin olive oil, chives, and lemon juice in blender or processor until smooth. Stir in grated lemon peel. Season to taste with salt and pepper. DO AHEAD Chive oil can be made 3 hours ahead. Cover and chill. Return to room temperature before using.",
        "Fill 2 large bowls with ice water and ice; set aside. Pour enough water into each of 2 large skillets to reach depth of 1 inch. Bring water to slow simmer over medium heat. Add 3 tablespoons vinegar to each skillet. Carefully crack each egg into individual ramekins. Gently slide 1 egg at a time into simmering water, working in batches of 3 eggs for each skillet. Cook until whites are just set, about 3 minutes. Using slotted spoon, very gently transfer eggs to bowls with ice water, being careful not to break eggs. DO AHEAD Can be made 1 day ahead. Cover and refrigerate eggs in bowls of ice water.",
        "Preheat broiler. Spread asparagus in single layer on rimmed baking sheet. Drizzle with 3 tablespoons olive oil; turn asparagus to coat. Sprinkle with salt and pepper. Broil asparagus 6 minutes. Turn asparagus over and continue to broil until crisp-tender and beginning to brown, about 6 minutes longer. Divide asparagus among 6 plates and drape prosciutto slices over.",
        "Pour enough water into each of 2 large skillets to reach depth of 1 inch; bring to simmer. Using slotted spoon, transfer eggs to skillets; cook 1 minute for soft yolks. Using slotted spoon, place 1 or 2 eggs atop each serving of asparagus and prosciutto. Drizzle chive oil over and around each serving. Pass remaining chive oil separately."
    ],
    "ingredients": [
        "1/2 cup extra-virgin olive oil",
        "1/4 cup chopped fresh chives",
        "1 teaspoon fresh lemon juice",
        "1/4 teaspoon finely grated lemon peel",
        "6 tablespoons white wine vinegar or unseasoned rice vinegar",
        "6 to 12 large eggs",
        "2 pounds medium asparagus spears, trimmed",
        "3 tablespoons olive oil",
        "3 ounces thinly sliced prosciutto"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Egg",
        "Herb",
        "Pork",
        "Vegetable",
        "Breakfast",
        "Brunch",
        "Broil",
        "Poach",
        "Roast",
        "Easter",
        "Asparagus",
        "Prosciutto",
        "Chive",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Poached Eggs with Roasted Asparagus, Prosciutto, and Chive Oil",
    "url": "http://www.epicurious.com/recipes/food/views/poached-eggs-with-roasted-asparagus-prosciutto-and-chive-oil-237898"
}
