{
    "directions": [
        "In a small bowl, whisk together the vinegar, lemon juice and mustard. Slowly whisk in the olive oil. Stir in the capers, chopped parsley and chopped dill, and season with salt and pepper. Set the vinaigrette aside.",
        "Put the yellow onion, parsley sprigs, dill sprigs, wine and water in a 5-quart (5-l) poaching pan. Place the poaching insert in the pan; the liquid should reach about 1/4 inch (6 mm) above the insert’s base. Set over high heat and bring to a boil, then reduce the heat so the liquid is just at a very low simmer; you should see only occasional bubbles.",
        "Lightly season 2 salmon fillets with salt. Place, skin side down, on the poaching insert. Cover the pan and poach until the fish is opaque on the outside and the center is just cooked through, 5 to 7 minutes. Carefully transfer the fillets to a paper towel-lined plate. Repeat to cook the remaining salmon.",
        "In a large bowl, toss together the baby greens, red onion, cucumber and vinaigrette, to taste. Divide among 4 plates and top each with a salmon fillet. Drizzle the salmon with a little vinaigrette and serve immediately with rye toast. Serves 4.",
        "Williams-Sonoma Kitchen"
    ],
    "ingredients": [
        "1/4 cup (2 fl. oz./60 ml) Champagne vinegar",
        "2 Tbs. fresh lemon juice",
        "2 tsp. Dijon mustard",
        "3/4 cup (6 fl. oz./180 ml) olive oil",
        "1/4 cup (2 oz./60 g) capers, drained",
        "2 Tbs. chopped fresh flat-leaf parsley, plus 6 sprigs",
        "1 Tbs. chopped fresh dill, plus 6 sprigs",
        "Kosher salt and freshly ground pepper, to taste",
        "1/2 yellow onion, thinly sliced",
        "1/2 cup (4 fl. oz./125 ml) crisp, dry white wine, such as\n  Sauvignon Blanc",
        "5 cups (40 fl. oz./1.25 l) water",
        "4 center-cut salmon fillets, each 6 oz. (185 g)",
        "8 oz. (250 g) mixed baby greens, such as chard, kale, tatsoi,\n  arugula and spinach",
        "1/2 red onion, very thinly sliced",
        "1 English cucumber, very thinly sliced on the bias",
        "Rye toast for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Poached Salmon over Greens with Caper Vinaigrette",
    "url": "http://www.williams-sonoma.com/recipe/poached-salmon-over-greens-with-caper-vinaigrette.html"
}
