{
    "directions": [
        "Preheat oven to 425°F. Combine 1 cup olive oil and next 3 ingredients in small saucepan. Cook over medium-high heat 2 minutes to release flavors. Remove from heat. Season mixture with salt and pepper.",
        "Using large serrated knife, trim off crust from top and sides of bread, leaving bottom crust intact to form rectangle-shaped loaf. Quarter trimmed loaf crosswise, forming 4 thick rectangular pieces. Cut deep nest in 1 piece, leaving 1/2-inch border on all 4 sides and 3/4-inch-thick base. Pull out bread center. Repeat with remaining bread pieces; reserve centers for another use. Place hollowed-out bread pieces on small baking sheet. Brush bread all over with olive oil mixture. Bake until bread is golden brown, about 7 minutes. Cool bread; maintain oven temperature.",
        "Cook bacon in large skillet until crisp. Transfer to paper towels to drain. Heat remaining 2 tablespoons olive oil in large pot over medium heat. Add shallot and sauté 2 minutes. Add spinach and stir until just wilted. Fill 12-inch-diameter skillet with water to within 1/2 inch of top. Add vinegar and 1/2 teaspoon salt. Bring to boil over medium-high heat. Break 1 egg into small custard cup, being careful to keep yolk intact. Gently slide egg into boiling water; repeat with remaining eggs. Simmer until eggs are softly cooked, about 3 minutes.",
        "Meanwhile, fill each bread hollow with spinach; top with bacon, breaking bacon slices in half to fit. Place in oven until heated through, about 5 minutes.",
        "Place 1 bread on each of 4 plates. Using slotted spoon, place 1 poached egg atop each. Sprinkle with salt and pepper.",
        "Top with Parmesan; serve immediately."
    ],
    "ingredients": [
        "1 cup plus 2 tablespoons olive oil",
        "2 garlic cloves, peeled, crushed",
        "1 tablespoon chopped fresh thyme",
        "1 teaspoon dried crushed red pepper",
        "1 16-ounce oval-shaped loaf country white sourdough bread",
        "8 thick bacon slices",
        "2 tablespoons minced shallot",
        "1 10-ounce bag fresh baby spinach",
        "1 tablespoon distilled white vinegar",
        "1/2 teaspoon salt",
        "4 large eggs",
        "Parmesan cheese shavings"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Garlic",
        "Herb",
        "Onion",
        "Breakfast",
        "Brunch",
        "Bake",
        "Poach",
        "Bacon",
        "Spinach",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Poached Egg Crostone with Wilted Spinach and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/poached-egg-crostone-with-wilted-spinach-and-bacon-236183"
}
