{
    "directions": [
        "Cut each shrimp shell lengthwise along back with scissors, leaving last segment of shell intact, then devein shrimp, keeping shell in place. Rinse shrimp and pat dry, then sprinkle with salt.",
        "Heat butter in a 10-inch nonstick skillet over moderately high heat until foam subsides, then sauté shrimp, turning once or twice, until just cooked through, about 3 minutes. Transfer shrimp and butter to a sieve set over a bowl and, when just cool enough to handle, shell shrimp (leave shell on tail segment), reserving shells and butter. Chill shrimp, covered, until ready to use.",
        "Return shells and butter to skillet and reheat briefly to liquefy butter, then transfer to a food processor along with Cognac and water. Purée until as smooth as possible, about 2 minutes. Force mixture through a fine sieve into a small bowl, discarding solids, then chill shrimp butter.",
        "Curl each salmon slice into a circle, skinned sides in, and tie with string to hold its shape.",
        "Cut 48 (3/4- by 1/16-inch) strips from truffles and mince remaining truffles, reserving liquid if using preserved truffles.",
        "Make 6 evenly spaced slits in top of each salmon slice with tip of a small knife, pushing a truffle strip into each slit. Sprinkle salmon with salt and chill on a tray, wrapped well in plastic wrap, until ready to poach.",
        "Simmer Chablis with shallot in a 2-quart heavy saucepan until reduced to about 1/4 cup, about 15 minutes. Add cream and return to a simmer. Pour through fine sieve into another small heavy saucepan, pressing on and discarding shallot. Add minced truffles and any truffle juice and simmer sauce until reduced to about 1 1/4 cups, about 5 minutes. Stir together arrowroot and Cognac and whisk into sauce. Simmer, whisking occasionally, until slightly thickened, about 2 minutes, then stir in salt and pepper.",
        "Butter bottom of a deep 12-inch heavy skillet and arrange salmon in it. Add 1 cup wine and enough water to just cover fish, then top with a round of buttered parchment or wax paper, buttered side down. Bring to a simmer over moderately high heat, then reduce heat and poach at a bare simmer until salmon is just cooked through, 8 to 10 minutes from time heat is turned on. Transfer with a slotted spatula to plates and remove string.",
        "While fish is poaching, combine sauce and cooked shrimp in a heavy skillet and bring to a simmer over moderate heat. Add shrimp butter and swirl skillet until butter is incorporated. Season sauce with salt and pepper and serve with salmon."
    ],
    "ingredients": [
        "2/3 lb medium shrimp (about 28) in shells",
        "1/4 teaspoon salt",
        "3/4 stick (6 tablespoons) unsalted butter",
        "2 tablespoons Cognac",
        "2 tablespoon water",
        "8 (3/4-inch-wide) slices center-cut salmon fillet (1 1/2 to 2 lb total), skinned",
        "1 oz fresh or preserved black winter truffles (28 g)",
        "1/4 teaspoon salt",
        "2 cup dry white wine",
        "1 1/2 cups French Chablis or other dry white wine",
        "1/3 cup finely chopped shallot",
        "1 1/2 cups heavy cream",
        "1 teaspoon arrowroot",
        "2 teaspoons Cognac",
        "1/2 teaspoon salt",
        "1/8 teaspoon black or white pepper",
        "Special equipment: 8 (18-inch) pieces kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fish",
        "Shellfish",
        "Appetizer",
        "Poach",
        "Dinner",
        "Salmon",
        "Shrimp",
        "Cognac/Armagnac",
        "White Wine",
        "Fall",
        "Gourmet",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Poached Salmon with Truffles and Shrimp in Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/poached-salmon-with-truffles-and-shrimp-in-cream-sauce-105495"
}
