{
    "directions": [
        "Preheat oven to 375°F. Have ready a bowl of ice and cold water. Trim beans. In a saucepan of boiling salted water cook beans until crisp-tender, 3 to 5 minutes, and with a slotted spoon transfer to ice water to stop cooking. Drain beans well and pat dry. With a pastry brush gently brush chanterelles to remove any grit and discard any tough stems. In a large saucepan heat 1 tablespoon oil over moderate heat until hot but not smoking and cook chanterelles and garlic, stirring, until liquid mushrooms give off is evaporated and mushrooms are softened. With a truffle slicer slice truffle into paper-thin slices. Finely chop shallots.",
        "In a 3-quart gratin dish (about 15 by 10 by 2 inches) toss together beans, chanterelles, and sea salt and pepper to taste. Arrange beans and chanterelles around edge of dish. Arrange halibut fillets about ․ inch apart in dish and drizzle with lemon juice. Sprinkle fillets with thyme, tarragon, truffle, and sea salt and pepper to taste. Pour stock and vin jaune or Sherry down side of dish, being careful not to disturb fillets. Sprinkle shallots over fillets and vegetables. Brush 1 side of parchment paper with remaining 1/2 tablespoon oil and arrange parchment, oiled side down, on top of fillets.",
        "Bake fillets in middle of oven until just cooked through, about 10 minutes. Carefully tilt gratin dish and pour cooking liquid into a small saucepan. Simmer liquid until reduced to about 1 cup and stir in sea salt and pepper to taste.",
        "Serve fish and vegetables over gratin and top with sauce."
    ],
    "ingredients": [
        "1/2 pound haricots verts (French thin green beans) or regular green beans",
        "1/2 pound fresh chanterelle mushrooms*",
        "1 1/2 tablespoons olive oil",
        "1 teaspoon minced garlic",
        "1/3 ounce fresh black truffle* (about 9 grams)",
        "3 shallots",
        "sea salt",
        "six 5-ounce skinless halibut fillets",
        "1/4 cup fresh lemon juice",
        "1 tablespoon fresh thyme leaves",
        "1 tablespoon packed fresh tarragon leaves",
        "1 1/4 cups fish stock**",
        "1 cup vin jaune or dry Sherry",
        "parchment paper",
        "*available seasonally at some specialty foods shops and by mail order from Marché aux Delices, tel. (888) 547-5471",
        "**available at fish markets and specialty foods shops",
        "Accompaniment: purple-potato and crab gratin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Mushroom",
        "Bake",
        "Halibut",
        "Green Bean",
        "Sherry",
        "Gourmet"
    ],
    "title": "Poached Halibut with Black Truffles and Purple-Potato and Crab Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/poached-halibut-with-black-truffles-and-purple-potato-and-crab-gratin-15628"
}
