{
    "directions": [
        "A poached salmon of anywhere from 8-25 pounds will poach perfectly and may be eaten hot or cold.",
        "If you do not have a large poissonière — and very few people do these days — you can find various types of vessels, including a baby's bathtub, which will do the job extremely well.",
        "You may poach the fish in salted water, or in a court bouillon made from water, white wine, herbs and seasonings to your taste. Be certain you make enough bouillon to cover the fish well during cooking.",
        "Wrap the fish in several thicknesses of cheese cloth, leaving long ends to hang over the edges of the fish cooker. Bring the water or bouillon to a boil and lower the fish into it. If you have a rack that will fit in the pan and hold the fish, it is ideal. If not, you must be careful not to split the fish when removing it from the liquid. Reduce the heat when you place the fish in the cooker so that you have what the French call a faible ebullition, and poach until a meat thermometer plunged into the thickest part of the fish registers 160°F.",
        "Serve the poached salmon hot with lemon butter or with a Bearnaise sauce or mustard hollandaise or a rich Bechamel sauce to which you have added chopped hard-cooked eggs and parsley.",
        "Or serve cold with a good homemade mayonnaise or mustard mayonnaise. Allow 1/2 pound for each serving.",
        "Beer or chilled wine — Muscadet or a Pinot Chardonnay go well with salmon. Cucumber salad and tiny new potatoes are extremely pleasant with it (chopped chives and tarragon will give the potatoes a different flavor)."
    ],
    "ingredients": [],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Herb",
        "Brunch",
        "Poach",
        "Buffet",
        "Salmon",
        "White Wine",
        "Healthy",
        "House & Garden"
    ],
    "title": "Poached Salmon",
    "url": "http://www.epicurious.com/recipes/food/views/poached-salmon-102305"
}
