{
    "directions": [
        "Sprinkle chicken all over with 1 tablespoon salt and let stand.",
        "While chicken is standing, bring water, broth, and thyme to a boil in a 4- to 6-quart heavy pot, then add beans and cook, uncovered, until crisp-tender, 3 to 6 minutes. Transfer beans with a slotted spoon to a bowl and toss with 1 tablespoon oil and salt and pepper to taste.",
        "Add salted chicken to broth and cook at a bare simmer, uncovered, 6 minutes. Remove pot from heat and let stand, covered, until chicken is cooked through, about 15 minutes .",
        "Transfer chicken with tongs to a cutting board and cool, about 5 minutes.",
        "While chicken is cooling, stir together tomatoes, olives, oregano, pepper, and remaining 1/4 teaspoon salt and 4 tablespoons oil in a bowl.",
        "Holding a knife at a 45-degree angle, cut chicken across the grain into 1-inch-thick slices.",
        "Divide green beans among 4 plates, then arrange sliced chicken over beans and top with tomato olive mixture."
    ],
    "ingredients": [
        "4 skinless boneless chicken breast halves (1 3/4 lb total)",
        "1 tablespoon plus 1/4 teaspoon kosher salt",
        "5 cups water",
        "1 3/4 cups low-sodium chicken broth (14 fl oz)",
        "1 fresh thyme sprig",
        "3/4 lb haricots verts or other thin green beans, trimmed",
        "5 tablespoons extra-virgin olive oil",
        "1 lb tomatoes, cut into 1/4-inch dice (3 cups)",
        "1/2 cup brine-cured green and black olives such as picholine and Kalamata, pitted and chopped",
        "1 tablespoon torn fresh oregano leaves",
        "1/8 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Olive",
        "Tomato",
        "Poach",
        "Green Bean",
        "Summer",
        "Thyme",
        "Oregano",
        "Gourmet"
    ],
    "title": "Poached Chicken with Tomatoes, Olives, and Green Beans",
    "url": "http://www.epicurious.com/recipes/food/views/poached-chicken-with-tomatoes-olives-and-green-beans-109737"
}
