{
    "directions": [
        "1. To poach the eggs, bring the wine and stock to a vigorous boil in a large shallow pan. Break four eggs, one by one, into the places where the liquid is bubbling so the bubbles spin the eggs. Lower the heat and poach the eggs for 3 to 4 minutes until the yolks are fairly firm but still soft to the touch. Lift out the eggs with a slotted spoon and drain them on paper towels. Poach the remaining eggs in the same way. Trim off the stringy edges with scissors and set the eggs aside. Add the onion, carrot, celery, garlic, bouquet garni, and peppercorns to the poaching liquid and simmer until it is concentrated and reduced by half, 20 to 25 minutes.",
        "2. Meanwhile, cook the garnish, melt half the butter in a medium saucepan, add the mushrooms, and sauté until tender, 2 to 3 minutes. Remove mushrooms, add bacon with the remaining butter, and fry until brown. Lift out the bacon and drain it on paper towels. Add the baby onions and sauté them gently until brown and tender, shaking the pan often so they color evenly, 10 to 15 minutes. Drain off all the fat, replace the mushrooms and bacon, and set the pan aside.",
        "3. Make the croûtes, using a round or oval cutter, and cut the bread into 8 shapes just larger than a poached egg. Heat 1/4 inch (6 mm) of oil in a frying pan, over medium heat. Working in batches, fry the croûtes until browned on both sides, 1 to 2 minutes per side. Drain on paper towels. Set the croûtes aside.",
        "4. To thicken the sauce, crush the butter on a plate with a fork and work in the flour to form a soft paste. Whisk this kneaded butter, a piece at a time, into the simmering wine mixture until the mixture becomes thick enough to lightly coat a spoon. Strain the sauce over the garnish of mushrooms, baby onions, and bacon, pressing on the carrot, onion, and celery to extract all the liquid and flavor. Bring the sauce to a boil, taste, and adjust the seasoning.",
        "5. To prepare ahead, poach the eggs up to a day in advance, keeping them in a bowl of cold water in the refrigerator. Store the sauce and garnish also in the refrigerator. The croûtes will be fine if kept tightly wrapped, then warmed in a low oven.",
        "6. To serve, reheat the eggs by immersing them in hot water for 1 minute. If necessary, reheat the garnish and sauce on top of the stove, and warm croûtes in the oven. Set the croûtes on warm serving plates. Drain the eggs on paper towels, set one on each croûte, and spoon over the sauce and garnish.",
        "Oeufs au Meursault",
        "A full-bodied chardonnay from California's Monterey peninsula or, to be somewhat extravagant, a meursault from Burgundy's Côte de Beaune is the sort of wine required here, particularly if you want to savor it at the table as well. If the wine is too dry and thin, the sauce will be acidic.",
        "Simply follow the recipe for Poached Eggs in Red Wine Sauce, substituting white for red wine. Just before serving, stir 3 to 4 tablespoons of crème fraîche or heavy cream into the sauce."
    ],
    "ingredients": [
        "8 fresh eggs",
        "1 bottle (750 ml) fruity red wine",
        "2 cups (500 ml/16 fl oz) brown veal or chicken stock",
        "1 onion, thinly sliced",
        "1 carrot, thinly sliced",
        "1 celery stalk, thinly sliced",
        "1 garlic clove, crushed",
        "a bouquet garni of thyme sprigs, parsley stems, and a bay leaf",
        "1/2 teaspoon black peppercorns",
        "salt and pepper",
        "2 tablespoons butter",
        "1/4 pound (125 g/4 oz) mushrooms, sliced",
        "1/4 pound (125 g/4 oz) piece of bacon, diced",
        "16 to 20 baby onions, peeled",
        "8 slices of white bread, 1/4 inch (6 mm) thick",
        "oil for frying",
        "2 tablespoons butter",
        "2 tablespoons flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Mushroom",
        "Onion",
        "Poach",
        "Bacon",
        "Fall",
        "Thyme"
    ],
    "title": "Poached Eggs in a Red Wine Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/poached-eggs-in-a-red-wine-sauce-105463"
}
