{
    "directions": [
        "Lay chiles on their sides on racks of gas burners and turn flames on moderately high. (Or arrange chiles on rack of a broiler pan about 2 inches from heat.) Roast chiles, turning with tongs, until skins are blackened, 5 to 8 minutes.",
        "Transfer to a bowl, then cover and let steam 10 minutes. Peel chiles and discard seeds, ribs, and stems, then coarsely chop.",
        "Preheat oven to 325°F.",
        "Cook chiles, onion, garlic, cumin, salt, and oregano in 1 1/4 sticks butter in a large heavy skillet over moderate heat, stirring, until onion is slightly softened, about 5 minutes. Add cream and simmer, stirring, 1 minute. Transfer mixture to a large bowl and toss with corn bread crumbs.",
        "Toast pumpkin seeds in cleaned skillet over moderate heat, stirring constantly, until puffed, 5 to 8 minutes (seeds will pop as they puff). Remove from heat and stir in remaining 1/2 tablespoon butter and salt to taste. Add to corn bread mixture with cilantro and drizzle with broth, tossing to combine. (Use 1 1/2 cups broth if you like a moist stuffing, 1 cup if you prefer it drier.)",
        "Transfer stuffing to a buttered 3-quart shallow baking dish. Cover with foil and bake in middle of oven 30 minutes, then uncover and bake until top is crisp and stuffing is heated through, about 30 minutes more."
    ],
    "ingredients": [
        "1 1/2 lb fresh poblano chiles (8 to 10)",
        "3 cups chopped white onion",
        "1 1/2 tablespoons finely chopped garlic",
        "1 tablespoon ground cumin",
        "2 teaspoons kosher salt",
        "1 1/2 teaspoons dried oregano (preferably Mexican), crumbled",
        "1 1/4 sticks (10 tablespoons) plus 1/2 tablespoon unsalted butter",
        "3/4 cup heavy cream",
        "2 (8-oz) packages dry corn bread stuffing",
        "3/4 cup (hulled) green pumpkin seeds",
        "1/3 cup chopped fresh cilantro",
        "1 to 1 1/2 cups chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Pepper",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Fall",
        "Cilantro",
        "Seed",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Poblano Chile and Pumpkin Seed Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/poblano-chile-and-pumpkin-seed-stuffing-104259"
}
