{
    "directions": [
        "Preheat the oven to 375 degrees F (175 degrees C).",
        "Coat the poblano peppers with a small amount of oil or cooking spray. Place directly on the oven rack. On a baking sheet, combine the onions, red and green bell peppers, celery and corn.",
        "Roast the vegetables and peppers for about 15 minutes in the preheated oven. Check occasionally, and turn or stir as needed for even browning. Remove from the oven, and refrigerate until needed.",
        "Tear the corn tortillas into pieces, and place them in a food processor. Process into fine crumbs. Do this in smaller batches if necessary. Place crumbs on a plate. In a shallow bowl, whisk together the eggs and milk.",
        "Heat the oil in a large skillet over medium heat. Dip chicken breast halves into the tortilla crumbs to coat, then into the egg mixture, and again in the tortilla crumbs to give them a nice thick coating. Fry the chicken until golden brown on each side, about 4 minutes per side. If your chicken is thick and isn't cooked through when the coating is browned, you can place it in the hot oven to finish it. When done, refrigerate until cooled completely.",
        "Peel and seed the poblano peppers. Place into a food processor along with the mayonnaise. Puree until smooth, and set aside.",
        "When everything has chilled, dice the chicken breasts. In a large food processor, combine the chicken and roasted vegetables. Blend in the poblano mayonnaise until your desired consistency is reached. Taste and season with salt and pepper as desired."
    ],
    "ingredients": [
        "3 large poblano peppers",
        "3 pounds skinless, boneless chicken breast halves",
        "1 pound fresh corn kernels",
        "4 green bell peppers, seeded and chopped",
        "4 red bell peppers, seeded and chopped",
        "1 stalk celery, chopped",
        "2 large yellow onions, chopped",
        "1 pound corn tortillas",
        "2 eggs, beaten",
        "1 cup milk",
        "2 cups mayonnaise",
        "1 cup vegetable oil for frying"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Poblano Chicken Salad",
    "url": "http://allrecipes.com/recipe/84783/poblano-chicken-salad/"
}
