{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Combine graham cracker crumbs, butter, confectioners' sugar, and 1 teaspoon cinnamon together in an 8-inch pie pan using a fork; press lightly into bottom and up sides of pan.",
        "Bake in the preheated oven until crust is set and lightly browned, about 7 minutes; remove from oven and cool.",
        "Increase oven temperature to 425 degrees F (220 degrees C).",
        "Whisk pumpkin, sweetened condensed milk, eggs, 1 teaspoon cinnamon, lemon zest, salt, 1/4 teaspoon nutmeg, ginger, and cloves together in a bowl until smooth; pour over cooled crust.",
        "Bake in the oven for 15 minutes. Lower oven temperature to 350 degrees F (175 degrees C) and continue baking until filling is set and edges of crust are dark golden brown, 35 to 40 minutes. Cool pie completely.",
        "Beat cream, brown sugar, and vanilla extract together in a bowl using an electric mixer until stiff peaks form. Lift your beater: whipped cream should form sharp peaks. Spread whipped cream over cooled pie and lightly dust with a pinch nutmeg."
    ],
    "ingredients": [
        "Crust:",
        "2 cups graham cracker crumbs",
        "1/2 cup butter, melted",
        "1/4 cup confectioners' sugar",
        "1 teaspoon ground cinnamon",
        "Filling:",
        "1 (15 ounce) can pumpkin puree",
        "1 (14 ounce) can sweetened condensed milk",
        "2 large eggs",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon lemon zest",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground ginger",
        "1/8 teaspoon ground cloves",
        "Brown Sugar Whipped Cream:",
        "1 cup heavy whipping cream",
        "2 1/2 tablespoons brown sugar",
        "1 teaspoon vanilla extract",
        "1 pinch ground nutmeg"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Poetic Pumpkin Pie",
    "url": "http://allrecipes.com/recipe/235464/poetic-pumpkin-pie/"
}
