{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper. Mix the flour with baking soda in a bowl; set aside.",
        "Mix the canola oil, butter, yogurt, eggs, sour cream, sugar, and salt together in a large mixing bowl until smooth. Gradually stir the flour mixture into the wet ingredients to form a soft dough. Knead and squeeze the dough in the bowl until it is no longer sticky, about 5 minutes. Stir the feta cheese, parsley, olive oil, and paprika together in a bowl with a fork to make a filling.",
        "Make each dumpling by pinching off about 2 1/2 tablespoons of dough; roll into a ball about 1 3/4 inches across between your hands, and press it into a flat circle 3 inches across on your palm. Spoon 1 scant tablespoon of filling into the center of the circle. Bring the edges of the circle together over the filling, and pinch them together to make a fat, round little stuffed dumpling. Set the dumplings onto the parchment paper-lined baking sheet, seam sides down. Beat the egg yolks in a small bowl, and brush the pogaca tops with the egg yolk. Sprinkle each with about 1/4 teaspoon of sesame seeds.",
        "Bake in the preheated oven until the tops are shiny, brown, and crackled, 20 to 30 minutes."
    ],
    "ingredients": [
        "3 1/2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "1/2 cup canola oil",
        "1/4 cup butter, melted",
        "1 cup plain yogurt",
        "3 beaten eggs",
        "1 tablespoon sour cream",
        "1 tablespoon white sugar",
        "1 1/2 teaspoons salt",
        "1 cup crumbled feta cheese",
        "1 cup finely chopped fresh parsley",
        "1 tablespoon olive oil",
        "2 teaspoons paprika",
        "2 egg yolks",
        "2 tablespoons sesame seeds"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pogaca (Feta Dumplings)",
    "url": "http://allrecipes.com/recipe/216186/pogaca-feta-dumplings/"
}
