{
    "directions": [
        "Bring the water, 1 tablespoon butter, and 1/2 teaspoon salt to a boil in a heavy medium saucepan. Gradually whisk in the polenta. Reduce the heat to medium-low. Stir constantly until the polenta thickens, about 5 minutes. Pour the polenta into a greased 9 by 9-inch baking pan, spreading so that it is 1/3-inch thick. Cover and let stand at room temperature until set, about 15 minutes.",
        "Meanwhile, heat the oil in a heavy large frying pan over medium-high heat. Add the mushrooms and onion. Sprinkle with 1/2 teaspoon of salt and 1/4 teaspoon of pepper and saute until the juices evaporate, about 8 minutes. Add the garlic and saute until the mushrooms are golden brown, about 2 minutes longer. Decrease the heat to medium-low. Add the Marsala. Cover and simmer until the Marsala has reduced by about half, about 5 minutes. Stir the flour and remaining 2 tablespoons of butter in a small bowl to form a paste, then stir the paste into the mushroom mixture. Cover and simmer until the sauce thickens slightly, about 2 minutes. Remove from the heat. Stir the parsley into the ragu. Season the ragu, to taste, with more salt and pepper.",
        "Cut the polenta into 36 bite-size squares. Arrange the polenta squares on a platter. Spoon the warm ragu atop the polenta and serve immediately."
    ],
    "ingredients": [
        "2 cups boiling water",
        "3 tablespoons butter, at room temperature",
        "1 teaspoon salt, plus more for seasoning",
        "1/2 cup quick-cooking polenta",
        "1 tablespoon olive oil",
        "8 ounces cremini mushrooms, chopped",
        "1/2 cup chopped onion",
        "1/4 teaspoon freshly ground black pepper, plus more for seasoning",
        "1 clove garlic, minced",
        "3/4 cup dry Marsala",
        "1/2 teaspoon all-purpose flour",
        "2 tablespoons chopped fresh Italian parsley leaves"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Appetizer",
        "Appetizer",
        "Easy Recipes",
        "Easy Side Dish Recipes",
        "Healthy Dinner",
        "Healthy",
        "Vegetarian",
        "Italian",
        "European Recipes",
        "Polenta Recipes",
        "Grain Recipes",
        "Mushroom",
        "Vegetable",
        "Rice Recipes",
        "Low-Carb",
        "Diabetes-Friendly",
        "Gluten Free",
        "Low-Fat",
        "Low-Cholesterol",
        "Low Sodium",
        "Low Calorie",
        "Heart-Healthy",
        "Holiday",
        "Cocktail Party",
        "Recipes for Parties",
        "Dinner Parties",
        "Sauteing Recipes"
    ],
    "title": "Polenta Squares with Mushroom Ragu",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/polenta-squares-with-mushroom-ragu-recipe"
}
