{
    "directions": [
        "Preheat oven to 325° F. and butter and flour a 12-inch round cake pan.",
        "In a bowl with an electric mixer beat together butter and confectioners' sugar until light and fluffy. Split vanilla bean lengthwise. Scrape seeds from pod and add to butter mixture. Beat in whole eggs and egg yolks 1 at a time, beating well after each addition, and fold in flour and cornmeal. Pour batter into pan and bake cake in middle of oven 1 hour and 15 minutes, or until golden. Invert cake onto a rack and cool completely. Transfer cake to a large platter.",
        "In a saucepan cook blackberries, granulated sugar, and grappa over moderate heat, stirring occasionally, 10 minutes, or until sugar is dissolved.",
        "Pour compote over cake. Let pudding stand, loosely covered, at room temperature at least 6 hours and up to 1 day.",
        "In a bowl with an electric mixer beat mascarpone until light and fluffy. Add cream and granulated sugar and beat mixture until it holds soft peaks.",
        "Garnish pudding with blackberries and serve with mascarpone cream."
    ],
    "ingredients": [
        "3 sticks (1 1/2 cups) unsalted butter, softened",
        "5 cups confectioners' sugar",
        "1 vanilla bean",
        "4 large whole eggs",
        "2 large egg yolks",
        "2 cups bread flour",
        "1 cup cornmeal",
        "3 1/2 cups blackberries",
        "1/2 cup granulated sugar, or to taste",
        "1/4 cup grappa",
        "1/2 cup mascarpone* cheese",
        "1 cup heavy cream",
        "3 tablespoons granulated sugar",
        "Garnish: 1/2 cup blackberries",
        "*available at specialty foods shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Blackberry",
        "Cornmeal",
        "Grappa",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Polenta Pudding with Blackberry Compote and Mascarpone Cream",
    "url": "http://www.epicurious.com/recipes/food/views/polenta-pudding-with-blackberry-compote-and-mascarpone-cream-15214"
}
