{
    "directions": [
        "Line fine-mesh sieve with double layer cheesecloth and set over medium bowl. Transfer yogurt to lined sieve, then pull up and tie together edges of cheesecloth, wrapping yogurt into bundle. Cover with plastic wrap and allow to drain in refrigerator at least 8 hours or overnight. (The yogurt can be prepared 2 days ahead. Once drained, transfer to airtight container and refrigerate, covered.)",
        "In medium heavy saucepan, combine milk and sea salt with 3/4 cup water. Bring to boil over high heat, then gradually whisk in polenta, until smooth. Reduce heat to low and cook, uncovered, whisking often, until very thick, about 25 minutes. Spread into 8- x 8-inch baking dish and cool slightly. Cover and chill until firm, at least 6 hours or overnight. (Polenta can be prepared ahead and refrigerated, covered, up to 1 day.)",
        "Bring small pan of water to boil. Add pistachios and boil, uncovered, 1 minute. Drain, then roll between towels until brown papery skins are removed. Set pistachios aside.",
        "If using charcoal grill, open vents on bottom, then light charcoal and preheat grill to moderately high. If using gas grill, preheat burners on high with hood closed 10 minutes, then turn down to moderately high. Brush grill rack with oil.",
        "Cut polenta into 4 rectangles and grill, turning once, until heated through and crusty, about 3 minutes per side. Remove from heat and slice each rectangle in half diagonally to produce 2 wedges.",
        "While polenta is on grill, transfer thickened yogurt to small bowl, discarding liquid, and stir in orange blossom water and honey.",
        "Divide polenta wedges among 4 plates, top with yogurt, and garnish with strawberries and pistachios. Serve immediately."
    ],
    "ingredients": [
        "1 3/4 cups plain low-fat yogurt",
        "2 cups low-fat (1%) milk",
        "1 teaspoon fine sea salt",
        "1/2 cup polenta (not quick-cooking)",
        "1/4 cup (1 ounce) unsalted pistachios, preferably organic (natural; not dyed red)",
        "Olive oil (for brushing)",
        "12 drops orange blossom water (also called orange flower water)*",
        "1/2 cup rambutan honey or other high-quality organic or raw honey with a fruity, citrusy flavor",
        "1 1/2 pounds strawberries, hulled and halved",
        "*Available at supermarkets, liquor stores, and Middle Eastern markets.",
        "2 (12-inch) squares cheesecloth",
        "*Available at supermarkets, liquor stores, and Middle Eastern markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Bake",
        "Yogurt",
        "Backyard BBQ",
        "Strawberry",
        "Pistachio",
        "Cornmeal",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Honey"
    ],
    "title": "Polenta Cake with Orange Blossom Yogurt, Berries, and Pistachios",
    "url": "http://www.epicurious.com/recipes/food/views/polenta-cake-with-orange-blossom-yogurt-berries-and-pistachios-242946"
}
