{
    "directions": [
        "Preheat oven to 400°F.",
        "In an 8- by 3-inch springform pan stir together flour, sugar, and salt and with your fingertips blend in butter until mixture resembles coarse meal. Stir in ice water until incorporated and press mixture evenly onto bottom of pan. Bake pastry in middle of oven until golden, about 12 minutes.",
        "In a small saucepan bring grappa or rum with raisins to a boil, stirring occasionally, and remove pan from heat. With back of a spoon force polenta through a coarse sieve into a bowl to break up lumps. Stir in cream cheese until smooth and whisk in remaining ingredients until combined well.",
        "Reduce temperature to 350°F. Drain any liquid from raisins. Pour filling over pastry and gently stir in raisins. Bake cheesecake in middle of oven 1 hour, or until edges are golden but middle trembles slightly. Turn off oven and cool cheesecake in oven 1 hour. Remove cheesecake from oven and chill, covered, until cold. Cheesecake may be made 2 days ahead and chilled, covered.",
        "In a heavy saucepan cook sugar over moderate heat, without stirring, until it begins to melt. Continue to cook sugar, stirring with a fork, until melted and swirl pan until a deep caramel. Add water (mixture will bubble up) and cook, stirring until caramelized sugar dissolves. Cool sauce slightly and stir in pine nuts and vanilla until combined.",
        "Serve cheesecake drizzled with sauce.",
        "In a heavy saucepan bring water and salt to a boil and gradually whisk in cornmeal in a thin stream. Cook polenta over moderately low heat (it should be barely boiling), stirring constantly, until very thick and pulls away from side of pan, about 40 minutes for cornmeal and about 15 minutes for instant polenta. Remove pan from heat and cover to keep warm. Stir polenta just before using. Polenta will keep warm, covered, about 20 minutes. Makes about 3 cups.",
        "In a heavy saucepan bring water and salt to a boil and gradually whisk in cornmeal in a thin stream. Cook polenta over moderately low heat (it should be barely boiling), stirring constantly, until very thick and pulls away from side of pan, about 40 minutes for cornmeal and about 15 minutes for instant polenta. Remove pan from heat and cover to keep warm. Stir polenta just before using. Polenta will keep warm, covered, about 20 minutes. Makes about 3 cups.",
        "Note: In the traditional method of cooking polenta, forty minutes of constant stirring is required to achieve a lumpless texture and fragrant flavor. However, Italian-food expert Marcella Hazan has developed a method that involves very little stirring during this time. We believe it produces a very good polenta, one nearly as flavorful and smooth as the traditional procedure. To make satisfactory polenta in a real hurry, an imported instant polenta (precooked cornmeal) is available. This cooks in a mere fifteen minutes."
    ],
    "ingredients": [
        "1/2 cup all-purpose flour",
        "2 tablespoons sugar",
        "1/4 teaspoon salt",
        "2 1/2 tablespoons cold unsalted butter, cut into bits",
        "2 teaspoons ice water",
        "3 tablespoons grappa or rum",
        "1/2 cup golden raisins",
        "1 1/2 cups cooled prepared polenta (leftover or made by following procedure for basic polenta, follows, using 1/2 cup cornmeal or instant polenta, 2 cups water, and 1/2 teaspoon salt)",
        "two 8-ounce packages cream cheese, softened",
        "1 cup sugar",
        "3 whole large eggs",
        "1 large egg yolk",
        "1 teaspoon vanilla",
        "1/2 teaspoon cinnamon",
        "1 cup sugar",
        "1/2 cup water",
        "1/2 cup pine nuts, toasted",
        "1 teaspoon vanilla"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Nut",
        "Dessert",
        "Bake",
        "Fall",
        "Gourmet"
    ],
    "title": "Polenta Cheesecake with Pine Nut Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/polenta-cheesecake-with-pine-nut-sauce-13078"
}
