{
    "directions": [
        "Bring 2 cups water and salt to boil in heavy small saucepan. Gradually whisk in cornmeal. Reduce heat to medium-low; simmer until polenta is very thick, whisking constantly, about 6 minutes. Remove from heat. Add cheese and butter; whisk until melted. Mix in basil. Season generously with pepper. Spread in 9x9x2-inch metal baking pan. Chill until cold, about 1 hour.(Can be made 1 day ahead. Cover, keep chilled.)",
        "Preheat broiler. Place eggplant on baking sheet. Brush with oil on both sides; sprinkle with salt and pepper. Broil until brown, about 4 minutes per side. Arrange 12 tomato slices on large plate (discard end slices). Drizzle each slice with a few drops of vinegar. Sprinkle eggplant and tomatoes with oregano.",
        "Preheat oven to 375°F. Oil baking sheet. Cut polenta into 25 squares. Place 12 squares on sheet. Top each with eggplant round. Cut cheese into 1/3-inch thick slices; place atop squares. Top each with tomato slice (save remaining polenta and cheese for another use).",
        "Bake polenta stacks until heated through and cheese melts, about 15 minutes. Top each stack with 1 basil leaf."
    ],
    "ingredients": [
        "2 cups water",
        "1/2 teaspoon salt",
        "1/2 cup yellow cornmeal",
        "1/4 cup freshly grated Romano cheese",
        "1 tablespoon butter",
        "1/4 cup chopped fresh basil",
        "2 large Japanese eggplants, each cut into six 1/2-inch-thick rounds",
        "Olive oil",
        "4 large plum tomatoes, each cut into 1/2-inch-thick rounds",
        "Balsamic vinegar",
        "Dried oregano",
        "1 7 3/4-ounce package small fresh mozzarella balls in water, drained",
        "12 fresh basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Tomato",
        "Vegetable",
        "Bake",
        "Vegetarian",
        "Mozzarella",
        "Basil",
        "Cornmeal",
        "Eggplant",
        "Winter",
        "Chill",
        "Healthy"
    ],
    "title": "Polenta Stacks with Eggplant, Tomato and Mozzarella",
    "url": "http://www.epicurious.com/recipes/food/views/polenta-stacks-with-eggplant-tomato-and-mozzarella-1174"
}
