{
    "directions": [
        "To make the polenta crust, in a microwave-safe bowl, mix 4 cups (32 fl. oz./1 l) water, the cornmeal and 1 3/4 tsp. salt. Place in the microwave and cook at the high setting for 5 minutes. Stir thoroughly, then return to the microwave and cook at the high setting for 5 more minutes. Stir well. Return to the microwave and cook at the high setting until very thick, about 5 minutes longer. Stir again, and then mix in the 1 1/2 Tbs. olive oil and a generous amount of pepper.",
        "Brush a large pizza pan generously with olive oil. Spread the cornmeal mixture out on the pan in a circle about 1/3 inch (9 mm) thick and about 12 inches (30 cm) in diameter, building up the edges slightly.",
        "Preheat an oven to 375°F (190°C).",
        "Sprinkle the mozzarella cheese over the pizza crust on the pizza pan, leaving a border.",
        "In a small bowl, mix the tomatoes, shallot, 1 1/2 Tbs. olive oil and the vinegar. Season to taste with salt and pepper. Spoon the tomato mixture over the cheese. Sprinkle with the Parmesan cheese.",
        "Bake the pizza until it is beginning to brown in spots, about 20 minutes. Let stand for 5 minutes to set up. Sprinkle with the herbs and serve immediately with forks and knives for eating. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Weeknight Gluten Free",
        ", by Kristine Kidd (Weldon Owen 2013)"
    ],
    "ingredients": [
        "1 1/3 cups (7 oz./220 g) gluten-free medium-grind cornmeal",
        "Kosher salt and freshly ground pepper",
        "1 1/2 Tbs. olive oil, plus more as needed",
        "1/2 lb. (250 g) fresh mozzarella cheese, coarsely grated",
        "1 1/3 cups (8 oz./250 g) small cherry tomatoes or grape tomatoes, halved",
        "2 Tbs. minced shallot, or 2 garlic cloves, minced",
        "1 1/2 Tbs. olive oil",
        "1 1/2 tsp. balsamic vinegar",
        "Kosher salt and freshly ground pepper",
        "1/3 cup (1 1/2 oz./45 g) freshly grated Parmesan cheese",
        "1/4 cup (1/3 oz./10 g) sliced fresh basil, or 3 Tbs. chopped fresh marjoram"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Polenta Pizza with Tomatoes and Fresh Herbs",
    "url": "http://www.williams-sonoma.com/recipe/polenta-pizza-with-tomatoes-and-fresh-herbs.html"
}
