{
    "directions": [
        "Put the dried mushrooms in a medium bowl and pour in the boiling water. Press them down into the water now and then until they are soft, anywhere from 5 to 30 minutes depending on how dry they were. When it’s time to cook them, lift them out of the water with your hands or a slotted spoon and chop them roughly. Reserve the soaking water.",
        "Put the oil in a large skillet over medium heat. When it’s hot, add the soaked dried and fresh mushrooms and sprinkle with salt and pepper. Cook, stirring occasionally, until the mushrooms are tender and have released all their liquid. 10 to 15 minutes.",
        "Add the wine and let it bubble away for 1 minute, then stir in the garlic, 1/4 cup of the parsley, and 1 cup of the reserved soaking water. Cook until the liquid thickens a bit, another 2 or 3 minutes, then taste, adjust the seasoning, and turn off the heat under the skillet.",
        "Put the polenta in a medium pot with 1 cup water and whisk to form a smooth slurry. Whisk in the milk and a pinch of salt and set the pot over medium-high heat. Heat until the mixture boils then lower the heat to medium and cook, whisking frequently adding more water a little at a time to prevent lumps and keep the mixture somewhat soupy. Expect to add another 2 1/2 to 3 1/2 cups of water before the polenta is ready. The polenta will be done in 15 to 30 minutes, depending on the grind. It will be thick and creamy, with just a little grittiness, and the mixture will pull away from the sides of the pan when you stir. When the polenta is done, turn the heat under the mushrooms to medium to warm them quickly.",
        "Stir the butter and cheese into the polenta then taste and adjust the seasoning. Serve the polenta topped with the mushrooms and garnished with the remaining 1/4 cup parsley.",
        "Soaking Dried Mushrooms: The time needed to soften mushrooms depends on their size and age. They’re ready when you can cut one easily with a paring knife. You want to reserve the soaking liquid but leave the grit behind, so lift out the mushrooms rather than pouring to drain them.",
        "Making The Sauce: When the mushrooms are tender and the wine has bubbled away, stir in the garlic, parsley, and soaking water.",
        "Making Polenta by the Slurry Method: When the slurry just starts to boil, turn it down a bit so it bubbles gently. Add more water or stir with a wooden spoon.",
        "Recognizing Doneness: When the polenta starts to pull away from the pan and is no longer gritty, it’s time to stir in the butter and Parmesan."
    ],
    "ingredients": [
        "1/2 cup dried porcini mushrooms (about 1/2 ounce)",
        "2 cups boiling water",
        "1/4 cup olive oil",
        "1 pound fresh button or cremini mushrooms, sliced",
        "Salt and freshly ground black pepper",
        "1/4 cup red wine",
        "1 tablespoon minced garlic",
        "1/2 cup chopped fresh parsley",
        "1 cup medium or coarse polenta",
        "1/2 cup milk, preferably whole",
        "1 tablespoon butter",
        "1/2 cup freshly grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Hominy/Cornmeal/Masa",
        "Dinner",
        "Vegetarian",
        "Parsley",
        "Parmesan"
    ],
    "title": "Polenta With Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/polenta-with-mushrooms"
}
