{
    "directions": [
        "In a heavy saucepan bring water and salt to a boil and gradually whisk in cornmeal in a thin stream. Cook polenta over moderately low heat (it should be barely boiling), stirring constantly, until very thick and pulls away from side of pan, about 40 minutes for cornmeal and about 15 minutes for instant polenta. Remove pan from heat and cover to keep warm. Stir polenta just before using. Polenta will keep warm, covered, about 20 minutes. Makes about 3 cups.",
        "Note: In the traditional method of cooking polenta, forty minutes of constant stirring is required to achieve a lumpless texture and fragrant flavor. However, Italian-food expert Marcella Hazan has developed a method that involves very little stirring during this time. We believe it produces a very good polenta, one nearly as flavorful and smooth as the traditional procedure. To make satisfactory polenta in a real hurry, an imported instant polenta (precooked cornmeal) is available. This cooks in a mere fifteen minutes.",
        "On a lightly oiled large baking sheet spread warm polenta into a 15- by 12-inch rectangle (about 1/2 inch thick) and cool to room temperature. Polenta may be made 2 days ahead and chilled, covered.",
        "Pat pork dry and season with salt. In a heavy 7- to 8-quart kettle heat oil over moderately high heat until hot but not smoking and brown pork in 2 batches, transferring with tongs to a bowl. In fat remaining in kettle sauté onion and celery, stirring occasionally, until just tender. Add garlic and rosemary and sauté, stirring, 1 minute. Return pork to kettle and add tomatoes with juice and 2 cups water. Simmer mixture, covered, 1 1/2 hours, or until meat is very tender.",
        "Transfer pork to a cutting board to cool. In a small bowl stir together flour and remaining 3 tablespoons water and whisk into liquid remaining in kettle. Discard bones and fat from pork and chop meat. Add pork and tomato paste to kettle, stirring, and simmer until filling is reduced to about 6 cups. Filling may be made 2 days ahead and chilled, covered.",
        "Preheat oven to 400°F.",
        "In a small saucepan heat butter over moderate heat until foam subsides and whisk in flour. Cook roux, whisking, 1 minute and add milk in a stream, whisking. Simmer béchamel sauce, whisking, until smooth and thickened slightly, about 2 minutes, and season with salt.",
        "Cut polenta into 3-inch squares. In a 3-quart shallow baking dish spoon half of filling and top with half of polenta squares. Repeat layering with remaining filling and polenta squares and spread béchamel sauce over top to cover completely. Sprinkle cheese over béchamel sauce and bake, uncovered, 45 minutes, or until heated through and top is golden."
    ],
    "ingredients": [
        "(kept warm)",
        "4 cups water",
        "1 teaspoon salt",
        "1 cup cornmeal or instant polenta",
        "4 pounds country-style pork ribs, cut into 2-rib portions",
        "2 tablespoons olive oil",
        "1 large onion (about 1 pound), chopped",
        "2 celery ribs, chopped",
        "2 large garlic cloves, sliced",
        "1 teaspoon dried rosemary, crumbled",
        "a 28- to 32-ounce can whole tomatoes including juice",
        "2 cups plus 3 tablespoons water",
        "1 tablespoon all-purpose flour",
        "1 tablespoon tomato paste",
        "1 1/2 tablespoons unsalted butter",
        "1 1/2 tablespoons all-purpose flour",
        "1 1/4 cups milk",
        "1/4 pound aged Provolone or mozzarella, grated coarse (about 1 cup)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Bake",
        "Braise",
        "Sauté",
        "Fall",
        "Gourmet"
    ],
    "title": "Polenta and Braised Pork \"Lasagne\"",
    "url": "http://www.epicurious.com/recipes/food/views/polenta-and-braised-pork-lasagne-13074"
}
