{
    "directions": [
        "Line baking sheet with aluminum foil. Spray bottoms only of six 3/4-cup custard cups with vegetable oil spray. Pour cornmeal into heavy medium saucepan. Gradually whisk in chicken broth. Whisk over medium-high heat until mixture boils. Reduce heat to medium-low. Simmer slowly until cornmeal loses its raw taste and mixture is very thick and is reduced to 3 1/2 cups, stirring frequently, about 45 minutes. Whisk in 1/2 cup butter and Parmesan cheese. Season polenta to taste with salt and pepper.",
        "Preheat oven to 375°F. Ladle generous 1/4 cup hot polenta into each custard cup; cool 2 minutes. Using back of spoon, spread polenta evenly over bottom and up sides of cup. Drop generous 1 tablespoon warm polenta onto prepared baking sheet; repeat 5 more times, forming 6 mounds total and spacing 3 inches apart (reserve remaining polenta for another use). Using back of spoon, spread each portion on baking sheet to 3 1/4-inch round. Sprinkle 2 tablespoons Gruyère cheese into each polenta-lined cup. (Can be prepared 1 day ahead. Cover and refrigerate polenta-lined custard cups and polenta rounds separately.)",
        "Carefully break 1 egg into each polenta-lined custard cup. Sprinkle egg with salt and pepper. Sprinkle remaining Gruyère cheese over. Cover Gruyère in each cup with 1 polenta round. Transfer cups to baking sheet. Bake until polenta is heated through and eggs are softly set, about 25 minutes. Let stand 10 minutes. Using small sharp knife, cut around polenta in each cup. Place plate atop each custard cup; invert, holding plate and cup together and allowing polenta to settle onto plate.",
        "Melt remaining 2 tablespoons butter in heavy large skillet over medium-high heat. Add spinach; stir until wilted, about 2 minutes. Season with salt and pepper. Surround polenta timballos with spinach. Sprinkle chopped tomatoes over spinach."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 cup yellow cornmeal",
        "5 cups canned low-salt chicken broth",
        "1/2 cup plus 2 tablespoons (1 1/4 sticks) butter",
        "3 tablespoons freshly grated Parmesan cheese",
        "1 1/2 cups (packed) grated Gruyère cheese (about 6 ounces)",
        "6 medium eggs",
        "2 10-ounce packages ready-to-use fresh spinach leaves",
        "3 large plum tomatoes (about 10 ounces), peeled, seeded, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Bake",
        "Dinner",
        "Cornmeal",
        "Spinach",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Polenta-Cheese Timballos with Eggs and Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/polenta-cheese-timballos-with-eggs-and-spinach-4553"
}
