{
    "directions": [
        "Bring 2 cups water to a boil in a medium saucepan. Whisking constantly, gradually add polenta; whisk until smooth. Reduce heat to low and cook polenta, whisking and breaking up any lumps, until thickened, about 3 minutes. Whisk in granulated sugar, brown sugar, and salt (mixture will loosen) and cook, whisking often, until mixture thickens again and polenta is tender, 20–25 minutes. Remove from heat and whisk in butter.",
        "Whisk egg yolk and cream in a small bowl to combine, then vigorously whisk into polenta. Transfer mixture to a large bowl and cover with plastic wrap, pressing directly onto surface. Let cool.",
        "Bring sugar, lemon juice, salt, and half of plums to a simmer in a medium saucepan over medium heat and cook, stirring occasionally, until mixture is thickened and some of the fruit is starting to fall apart, 10–15 minutes.",
        "Mix half of the remaining plums into marmellata and cook, stirring occasionally, until softened but still holding their shape, 5 minutes. Remove from heat and mix in remaining plums. Cover marmellata and let cool.",
        "Stir polenta to loosen and smooth out any lumps. Spoon into bowls and top each serving with some marmellata and a scoop of vanilla ice cream.",
        "Polenta can be made 2 days ahead. Chill. Bring to room temperature before serving.\nMarmellata can be made 3 days ahead. Chill."
    ],
    "ingredients": [
        "1/2 cup coarse-grind polenta",
        "1/3 cup granulated sugar",
        "1/4 cup (packed) dark brown sugar",
        "1/4 teaspoon kosher salt",
        "1 tablespoon unsalted butter",
        "1 large egg yolk",
        "1/4 cup heavy cream",
        "3/4 cup granulated sugar",
        "1 tablespoon fresh lemon juice",
        "1/4 teaspoon kosher salt",
        "4 ripe plums, cut into 1/2-inch pieces",
        "1 pint vanilla ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Hominy/Cornmeal/Masa",
        "Plum",
        "Summer",
        "Custard",
        "Dessert",
        "Fall",
        "Wheat/Gluten-Free"
    ],
    "title": "Polenta Budino With Plum Marmellata",
    "url": "http://www.epicurious.com/recipes/food/views/polenta-budino-with-plum-marmellata"
}
