{
    "directions": [
        "Rinse chicken and cut garlic head in half crosswise. In a 6-quart kettle cover chicken, garlic halves, onion, coriander, salt, peppercorns, and allspice with water and simmer, covered, 1 hour, or until chicken is tender. Transfer chicken to a bowl to cool and reserve stock.",
        "Shred chicken, discarding skin and bones. Pour reserved stock through a fine sieve into a bowl, pressing garlic pulp through sieve. Measure 3 cups stock for sauce and reserve remainder for another use. Chicken and stock may be made 1 day ahead and cooled completely, uncovered, before being chilled separately, covered. (Stock keeps, frozen, 1 month.)",
        "Heat a large heavy skillet over moderate heat until hot and toast pumpkin seeds, stirring constantly, until they have expanded and begin to pop, 3 to 5 minutes. Transfer seeds to a plate to cool. In skillet heat sesame and cumin seeds, allspice, cloves, and peppercorns, stirring, until fragrant, about 1 minute, and transfer to plate. When seeds and spices are cool, in an electric spice/coffee grinder grind mixture in 4 batches to a powder.",
        "If using fresh tomatillos, discard husks and rinse with warm water to remove stickiness. Stem serrano chilies. In a saucepan simmer fresh tomatillos and serranos in salted water to cover 10 minutes. If using canned tomatillos, drain them and leave serranos uncooked. Transfer tomatillos and serranos (use a slotted spoon if simmered) to a blender and purée with onion, garlic, 1/4 cup coriander, and salt until completely smooth.",
        "In a 5-quart heavy kettle simmer tomatillo purée in lard or oil, stirring frequently, 10 minutes. Add 2 1/2 cups stock and stir in powdered pumpkin-seed mixture. Simmer sauce, stirring occasionally, 15 minutes, or until slightly thickened. Sauce may be prepared up to this point 1 day ahead and cooled completely, uncovered, before being chilled, covered.",
        "Roast and peel poblano chili . In blender purée poblano with remaining 1/2 cup stock and remaining 1/4 cup coriander until completely smooth. Stir poblano purée and chicken into sauce and heat on top of stove or in a 350° F. oven until chicken is heated through.",
        "Garnish chicken with pumpkin seeds and coriander and serve with tortillas."
    ],
    "ingredients": [
        "1 whole 3 1/2-pound chicken plus 1 whole chicken breast",
        "1 head garlic, unpeeled",
        "1/2 large white onion",
        "6 long sprigs fresh coriander",
        "1/2 teaspoon salt",
        "6 black peppercorns",
        "3 allspice berries",
        "1 1/2 cups hulled green pumpkin seeds (about 7 ounces)",
        "2 tablespoons sesame seeds",
        "1/2 teaspoon cumin seeds",
        "4 allspice berries",
        "3 cloves",
        "6 black peppercorns",
        "1 pound fresh tomatillos or a 28-ounce can tomatillos",
        "6 fresh serrano chilies",
        "1/2 large white onion",
        "4 garlic cloves",
        "1/2 cup packed coarsely chopped fresh coriander",
        "2 teaspoons salt",
        "1/4 cup lard or vegetable oil",
        "3 cups stock from cooking chicken",
        "1 fresh poblano chili",
        "Garnish: chopped toasted hulled pumpkin seeds and chopped fresh coriander",
        "Accompaniment:Warm Tortillas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Garlic",
        "Herb",
        "Nut",
        "Onion",
        "Hot Pepper",
        "Summer",
        "Healthy",
        "Tomatillo",
        "Seed",
        "Gourmet"
    ],
    "title": "Pollo en Pipian Verde",
    "url": "http://www.epicurious.com/recipes/food/views/pollo-en-pipian-verde-14143"
}
