{
    "directions": [
        "Combine the flour in a plastic bag with 1/2 teaspoon salt and 1/4 teaspoon black pepper. Add the chicken pieces, and toss to coat evenly with flour. Heat the corn oil in a Dutch oven over medium heat. Shake the excess flour from the chicken pieces, and place into the hot oil. Cook until browned on all sides turning occasionally, about 15 minutes. Pour in the water, cover, and reduce the heat to medium-low. Cook 30 minutes.",
        "After 30 minutes, stir in the onion and green bell pepper. Cook and stir until the chicken is no longer pink at the bone, and the onion is tender, about 10 minutes. Pour 2 tablespoons of the reserved peach juice into a small bowl, and set aside. Pour the remaining peach juice into the pot along with the soy sauce and vinegar; bring to a boil over medium-high heat. Dissolve the cornstarch in the reserved peach juice, and stir into the boiling sauce. Cook and stir until the sauce thickens and is no longer cloudy, about 1 minute. Stir in the peach halves and chopped tomatoes. Cook and stir until the peaches are hot and the tomatoes are beginning to fall apart, about 5 minutes. Season to taste with salt and pepper before serving."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3024&h=1583&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F5789439.jpg",
    "ingredients": [
        "½ cup all-purpose flour",
        "½ teaspoon salt",
        "¼ teaspoon ground black pepper",
        "3 pounds bone-in chicken pieces",
        "¼ cup corn oil",
        "1 ½ cups water",
        "1  onion, chopped",
        "1  green bell pepper, cut into strips",
        "1 (15 ounce) can peach halves, liquid reserved",
        "1 tablespoon soy sauce",
        "3 tablespoons distilled white vinegar",
        "1 tablespoon cornstarch",
        "4  tomatoes, chopped (optional)",
        "salt and black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Polynesian Peach Chicken",
    "url": "http://allrecipes.com/recipe/214078/polynesian-peach-chicken/"
}