{
    "directions": [
        "Whisk palm sugar and 1 tablespoon water in a medium bowl to dissolve sugar. Whisk in chiles, garlic, lime juice, and fish sauce; season with salt. Balance with more sugar, lime juice, or fish sauce if needed.",
        "Toast coconut in a dry small saucepan over medium-high heat, stirring occasionally, until golden brown, about 4 minutes. Transfer to a small bowl.",
        "Heat oil in same saucepan. Add half of shallots and fry, swirling, until golden brown and crisp, about 3 minutes. Transfer to paper towels with a slotted spoon to drain; season with salt.",
        "Cook peanuts in shallot oil until golden brown, about 2 minutes. Transfer to paper towels to drain; season with salt.",
        "Remove peel and white pith from pomelos. Tear membrane off and pull segments into large pieces, transferring to a large bowl as you go. Add cilantro, remaining shallots, and half of dressing and toss to coat. Add coconut, peanuts, and dried shrimp; toss again. Divide among plates, drizzle with remaining dressing, and top with fried shallots."
    ],
    "ingredients": [
        "2 tablespoons palm sugar or light brown sugar",
        "2 red or green Thai chiles, finely chopped",
        "2 garlic cloves, finely chopped",
        "1/4 cup fresh lime juice",
        "3 tablespoons fish sauce",
        "Kosher salt",
        "1/2 cup unsweetened shredded coconut",
        "1/2 cup vegetable oil",
        "2 shallots, thinly sliced, divided",
        "1/4 cup peanuts, preferably skin-on",
        "2 pomelos or 3 ruby red grapefruit",
        "3/4 cup torn cilantro leaves with tender stems",
        "2 tablespoons dried shrimp"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Citrus",
        "Side",
        "Grapefruit",
        "Peanut",
        "Spring",
        "Summer",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pomelo Salad with Chile, Lime, Peanuts, and Coconut",
    "url": "http://www.epicurious.com/recipes/food/views/pomelo-salad-with-chile-lime-peanuts-and-coconut-56389542"
}
