{
    "directions": [
        "Preheat the oven to 400°F.",
        "Put a small, dry skillet over medium-low heat. Add the pine nuts and cook, shaking the pan and tossing the nuts frequently, until they are lightly browned and fragrant. Watch them carefully, and keep them moving, so they don't burn. Immediately transfer them to a plate to cool; if you leave them in the pan, even off the heat, they could burn.",
        "Brush the cut side of the eggplant halves with oil and sprinkle them with za'atar and a little salt. Set the halves on a large piece of aluminum foil and fold it up to tightly enclose them. Put the foil packet on a small baking sheet and bake until the eggplant is fork tender, 30 to 40 minutes.",
        "When the eggplant is tender, remove it from the oven, turn the oven to broil, and arrange a rack so the eggplant will be just a few inches from the flame. Open the foil packet, brush the eggplant with the pomegranate molasses, and broil just until the molasses is bubbly, about a minute.",
        "Drizzle the juices from the foil packet over the rice. Top with the eggplant halves and scatter on the cherry tomatoes, mint, feta, and pine nuts."
    ],
    "ingredients": [
        "1 tablespoon pine nuts",
        "1 small (5- to 8-ounce) eggplant, halved lengthwise through the stem",
        "2 teaspoons extra-virgin olive oil",
        "2 teaspoons Za'atar",
        "Sea salt",
        "2 teaspoons pomegranate molasses",
        "1/2 cup warm cooked brown basmati rice or another grain",
        "6 large cherry tomatoes, quartered",
        "4 large mint leaves, chopped",
        "2 tablespoons crumbled feta"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Bake",
        "Broil",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Eggplant",
        "Healthy",
        "Brown Rice"
    ],
    "title": "Pomegranate-Glazed Eggplant",
    "url": "http://www.epicurious.com/recipes/food/views/pomegranate-glazed-eggplant-51185220"
}
