{
    "directions": [
        "Preheat oven to 375°F. Butter 9-inch-diameter tart pan with removable bottom. Roll out puff pastry sheet on lightly floured surface to 1/8-inch-thick square. Trim edges, making 10-inch round; pierce round with fork. Transfer pastry to tart pan; freeze crust while preparing filling.",
        "Bring whipping cream to simmer in small saucepan over medium-high heat; remove from heat. Stir sugar and 1/4 cup water in heavy medium saucepan over medium-low heat until sugar dissolves. Increase heat to high and boil without stirring until mixture turns deep amber color, brushing down sides of pan with wet pastry brush and swirling pan occasionally, about 8 minutes. Remove caramel from heat and carefully stir in warm whipping cream (mixture will bubble vigorously). Stir in toasted walnuts, pomegranate molasses, and vanilla extract; cool filling 15 minutes.",
        "Remove prepared crust from freezer. Spread tart filling evenly in crust. Line baking sheet with aluminum foil. Place tart pan on sheet and bake until filling is bubbling and crust is golden brown, about 25 minutes. Cool 10 minutes in pan on rack. Remove tart pan sides. (Can be made 1 day ahead. Cover and let stand at room temperature.) Sprinkle tart with pomegranate seeds and serve.",
        "*A thick pomegranate syrup available at Middle Eastern markets, some supermarkets, and by mail from Adriana's Caravan (adrianascaravan.com)."
    ],
    "ingredients": [
        "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed",
        "2/3 cup whipping cream",
        "3/4 cup sugar",
        "1/4 cup water",
        "2 cups coarsely chopped toasted walnuts",
        "2 tablespoons pomegranate molasses*",
        "3/4 teaspoon vanilla extract",
        "1/4 cup pomegranate seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Walnut",
        "Winter",
        "Pomegranate",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pomegranate-Caramel Tart with Walnuts",
    "url": "http://www.epicurious.com/recipes/food/views/pomegranate-caramel-tart-with-walnuts-108858"
}
