{
    "directions": [
        "Preheat oven to 425°:. Mix oregano, olive oil, 3 tablespoons pomegranate molasses, and 2 tablespoons fennel seeds in a small bowl; season oregano mixture with salt and pepper.",
        "Toss fennel, onion, remaining 1 tablespoon fennel seeds, and remaining 2 teaspoons pomegranate molasses in a large baking dish or roasting pan; season with salt and pepper. Distribute evenly across bottom of pan.",
        "Season lamb with salt and pepper. Heat 1 tablespoon vegetable oil in a large skillet, preferably cast iron, over medium. Cook 1 rack of lamb, fat side down, until golden brown, 8–10 minutes. Turn and cook until other side is just browned, about 5 minutes. Transfer to dish with fennel mixture, placing fat side up, and rub with half of oregano mixture. Wipe out skillet and repeat with remaining 1 tablespoon vegetable oil, second rack of lamb, and remaining oregano mixture.",
        "Roast lamb and vegetables until an instant-read thermometer inserted into thickest part of lamb registers 125°: for medium-rare, 25–30 minutes. Transfer lamb to a cutting board and let rest at least 10 minutes before carving.",
        "Serve lamb over vegetables topped with pomegranate seeds."
    ],
    "ingredients": [
        "3 tablespoons chopped fresh oregano",
        "2 tablespoons olive oil",
        "3 tablespoons plus 2 teaspoons pomegranate molasses",
        "3 tablespoons fennel seeds, divided",
        "Kosher salt",
        "Freshly ground pepper",
        "2 medium fennel bulbs, sliced lengthwise",
        "1 small onion, thinly sliced",
        "2 3–3 1/2-pound racks of lamb, rib bones frenched",
        "2 tablespoons vegetable oil",
        "2 tablespoons white wine vinegar",
        "1/4 cup pomegranate seeds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [],
    "title": "Pomegranate and Fennel Glazed Rack of Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/pomegranate-and-fennel-glazed-rack-of-lamb-51259440"
}
