{
    "directions": [
        "Whisk pomegranate molasses, coarsely chopped garlic, olive oil, ground ginger, cinnamon, 1 3/4 teaspoons cumin, paprika, 1/2 teaspoon salt, and 1/4 teaspoon pepper in large bowl. Add lamb and toss to coat. Cover and marinate 2 hours at room temperature, or up to 2 days in the refrigerator. Drain, reserving marinade. Pat lamb dry.",
        "Heat heavy large nonstick skillet over medium-high heat. Working in batches, add meat and bones, if using, and cook until browned, turning occasionally, about 2 minutes total per batch. Return all lamb and bones to skillet. Add reserved marinade and 1/4 cup water. Cover with lid slightly ajar and simmer over medium-low heat until meat is tender, about 8 minutes. Remove from heat and set aside.",
        "Meanwhile, bring remaining 1 cup water and chicken broth to boil in medium saucepan over medium-high heat. Add couscous and remaining 1/4 teaspoon cumin. Remove saucepan from heat and let stand covered 5 minutes. Fluff couscous with fork, then stir in butter until melted. Divide couscous among plates and top with lamb, pomegranate seeds, and basil leaves, spooning remaining sauce over lamb.",
        "A thick pomegranate syrup; available at some supermarkets, at Middle Eastern markets, and from adrianascaravan.com."
    ],
    "ingredients": [
        "1/2 cup pomegranate molasses*",
        "4 garlic cloves, coarsely chopped",
        "2 tablespoons olive oil",
        "1 tablespoon ground ginger",
        "1 tablespoon ground cinnamon",
        "2 teaspoons ground cumin, divided",
        "1 1/2 teaspoons paprika",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "2 pounds lamb shoulder blade chops, cut into 3/4-inch square pieces, bones reserved",
        "1 1/4 cups water, divided",
        "2 cups low-salt chicken broth",
        "1 10-ounce box plain couscous",
        "2 tablespoons (1/4 stick) unsalted butter",
        "3/4 cup pomegranate seeds",
        "3 tablespoons torn basil leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Marinate",
        "High Fiber",
        "Dinner",
        "Fall",
        "Family Reunion",
        "Pan-Fry",
        "Pomegranate",
        "Couscous",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pomegranate-Marinated Lamb with Spices and Couscous",
    "url": "http://www.epicurious.com/recipes/food/views/pomegranate-marinated-lamb-with-spices-and-couscous-350408"
}
