{
    "directions": [
        "Preheat oven to 500 degrees F (260 degrees C).",
        "Combine ponzu sauce, 1 cup cilantro, pineapple juice, mint leaves, garlic, fresh ginger, sesame oil, chili oil, and brown sugar together in a large bowl. Add chicken and toss to coat.",
        "Remove chicken from ponzu sauce mixture, reserving marinade. Heat large pot or Dutch oven over medium-high heat. Add chicken and cook, stirring frequently, until browned, about 5 minutes. Stir in olive oil, onion, red bell pepper, jalapeno pepper, salt, and black pepper. Cook and stir until onion has softened and turned translucent, about 5 minutes.",
        "Pour reserved marinade into chicken mixture and bring to a boil. Stir in cabbage and cook until slightly wilted, 4 to 5 minutes.",
        "Using a slotted spoon, transfer chicken mixture into toasted hoagie buns and top each sandwich with 3 slices Swiss cheese.",
        "Place sandwiches onto a baking sheet and bake in the preheated oven until cheese is melted and buns are toasted, about 5 minutes. Garnish each sandwich with 2 tablespoons cilantro, 1/4 of the sesame seeds, and 1/4 of the chile-garlic sauce. Serve with lime wedges."
    ],
    "ingredients": [
        "1 cup prepared ponzu sauce",
        "1 cup chopped fresh cilantro",
        "1/2 cup pineapple juice",
        "4 fresh mint leaves, chopped",
        "4 cloves garlic, crushed",
        "1 tablespoon grated fresh ginger",
        "1 tablespoon toasted sesame oil",
        "1 tablespoon chili oil",
        "1 teaspoon brown sugar",
        "3 skinless, boneless chicken breast halves, cut into chunks",
        "1 tablespoon olive oil",
        "1 onion, sliced",
        "1 red bell pepper, sliced",
        "1 jalapeno pepper, sliced",
        "salt and freshly ground black pepper to taste",
        "1 small head cabbage, shredded",
        "4 Italian-style hoagie buns, split lengthwise and toasted",
        "12 slices Swiss cheese",
        "1/4 cup chopped fresh cilantro, divided",
        "1 tablespoon sesame seeds, divided",
        "1 tablespoon chile-garlic sauce (such as Sriracha®), or to taste - divided",
        "1 lime, cut into wedges"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ponzu Chicken Sandwich",
    "url": "http://allrecipes.com/recipe/230489/ponzu-chicken-sandwich/"
}
