{
    "directions": [
        "For the popovers: Preheat the oven to 450 degrees F; position a rack in the lower third with at least 6 inches of clearance above it. Place a baking sheet on the rack and preheat for 15 minutes.",
        "Meanwhile, melt 1 tablespoon of the butter and pour it in a large bowl with the eggs, milk, salt and sugar. Whisk until very well combined. Add the flour and whisk until smooth; pour into a liquid measuring cup.",
        "Cut the remaining butter into 12 equal pieces; put one piece in each cup of a 12-cup muffin tin. Set the tin in the oven, on top of the preheated baking sheet, and heat until the butter starts to sizzle, about 3 minutes. Remove the muffin tin from the oven and pour the batter into the cups, filling each about halfway. Return to the oven and bake until the popovers are puffed and starting to brown (do not open the oven door!), about 12 minutes. Reduce the heat to 325 degrees and continue to cook (again, without opening the oven!) until the popovers are golden brown all over, 12 to 15 minutes more. Remove the popovers from the tin onto a cooling rack. Let cool until just cool enough to handle, about 3 minutes.",
        "For the sandwiches: In a bowl, stir together the horseradish, sour cream and chives. Season with salt and pepper. Working one popover at a time, dollop about a teaspoon of the horseradish cream into the divot on the top of the popover; if the divot is not very deep, push in lightly with your thumb to make a deeper indentation or hole. Top with a slice or two of roast beef and then with another dollop of horseradish cream. Sprinkle with a little finishing salt. Repeat with the remaining popovers and serve immediately."
    ],
    "ingredients": [
        "4 tablespoons unsalted butter, softened",
        "2 large eggs, room temperature",
        "1 cup whole milk, room temperature",
        "1 teaspoon kosher salt",
        "1/2 teaspoon sugar",
        "1 cup all-purpose flour",
        "1/4 cup prepared horseradish",
        "1/4 cup sour cream",
        "2 tablespoons chopped fresh chives",
        "Kosher salt and freshly ground black pepper",
        "8 ounces sliced roast beef",
        "Finishing salt, to top"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Roast Beef",
        "Beef",
        "Meat",
        "Roast Recipes",
        "Sandwich",
        "Appetizer"
    ],
    "title": "Popovers with Roast Beef and Horseradish",
    "url": "http://www.foodnetwork.com/recipes/patricia-heaton/popovers-with-roast-beef-and-horseradish"
}
