{
    "directions": [
        "In a bowl with a pastry blender or in a food processor blend or pulse together flour, cornmeal, poppy seeds, salt, and baking powder. Add butter and blend or pulse until mixture resembles coarse meal. Add Cheddar and 4 tablespoons water and toss with a fork or pulse until water is incorporated, adding enough of remaining tablespoon water if necessary to form a soft dough.",
        "On a work surface smear dough in 3 or 4 forward motions with heel of hand to develop gluten in flour slightly and make dough easier to work with. Form dough into 2 balls and flatten into disks.",
        "Preheat oven to 400°F. and lightly grease 2 large baking sheets.",
        "On a lightly floured surface roll out half of dough with a lightly floured rolling pin into a 12-inch round (about 1/16 inch thick) and with a 2 3/4-inch crescent-moon cutter cut out shapes, transferring them to lightly greased baking sheets. Gather scraps and reroll dough. Cut out more crescent shapes in same manner and transfer to baking sheets.",
        "Brush crescents lightly with egg wash and prick all over with a fork. Sprinkle crescents with salt and bake in upper and lower thirds of oven, switching position of sheets halfway through baking, until golden, 12 to 14 minutes. Transfer crackers with a metal spatula to racks and cool. Make more crackers with remaining dough in same manner. Crackers may be made 3 days ahead and kept in an airtight container at room temperature."
    ],
    "ingredients": [
        "3/4 cup all-purpose flour",
        "1/4 cup yellow cornmeal",
        "1 tablespoon poppy seeds",
        "1/4 teaspoon salt",
        "1/4 teaspoon baking powder",
        "1/2 stick (1/4 cup) cold unsalted butter, cut into bits",
        "1 cup coarsely shredded extra-sharp Cheddar",
        "4 to 5 tablespoons cold water",
        "an egg wash made by beating 1 large egg with 1 tablespoon water",
        "coarse salt for sprinkling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Bake",
        "Super Bowl",
        "Fall",
        "Gourmet"
    ],
    "title": "Poppy Cheddar Moon Crackers",
    "url": "http://www.epicurious.com/recipes/food/views/poppy-cheddar-moon-crackers-13043"
}
