{
    "directions": [
        "Preheat oven to 350°F. Generously butter and flour 9-inch-diameter spring-form pan with 2 3/4-inch-high sides. Melt 4 ounces bittersweet chocolate in top of double boiler set over simmering water, stirring chocolate until smooth. Remove melted chocolate from over water. Cool chocolate 10 minutes.",
        "Using electric mixer, 3/4 cup sugar, unsalted butter and vanilla extract in large bowl to blend. Add egg yolks 1 at a time, beating well after each addition. Add melted bittersweet chocolate; beat until just combined. Mix in poppy seeds. Using electric mixer fitted with clean dry beaters, beat egg whites in another large bowl until stiff but not dry. Fold half of beaten egg white into chocolate mixture. Fold flour into remaining beaten white. Fold egg white mixture into chocolate mixture.",
        "Pour batter into prepared spring-form pan. Using spatula, smooth top. Bake until tester inserted into center of torte comes out clean, about 45 minutes. Transfer pan to rack and cool completely. (Can be prepared 1 day ahead. Cover tightly with aluminum foil and store torte at room temperature.)",
        "Cut around sides of pan to loosen torte. Remove pan sides. Sift powdered sugar over torte. Place on platter. Serve with whipped cream."
    ],
    "ingredients": [
        "4 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "3/4 cup sugar",
        "6 tablespoons (3/4 stick) unsalted butter, room temperature",
        "1 teaspoon vanilla extract",
        "6 large eggs, separated",
        "1/2 cup poppy seeds, ground (about 3 1/4 ounces)",
        "2 tablespoons all purpose flour",
        "Powder sugar",
        "Whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dessert",
        "Bake",
        "Winter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Poppy Seed Chocolate Torte",
    "url": "http://www.epicurious.com/recipes/food/views/poppy-seed-chocolate-torte-941"
}
