{
    "directions": [
        "Preheat oven to 350°F. Butter 10-inch-diameter springform pan with 2 3/4-inch-high sides. Line bottom of pan with waxed paper; butter paper.",
        "Combine first 4 ingredients in medium bowl. Using electric mixer, beat sugar, butter and lemon peel in large bowl until smooth. Add eggs 1 at a time, beating well after each addition. Beat in lemon juice and vanilla. Add dry ingredients alternately with buttermilk in 3 additions each, beating just until blended. Stir in poppy seeds.",
        "Transfer batter to prepared pan. Bake until cake is golden and tester comes out clean, about 55 minutes. Transfer pan to rack. Run knife around pan sides to loosen cake. Release pan sides; cool cake. (Can be make 1 day ahead. Cover and keep at room temperature.)",
        "Combine 1/2 cup sugar, eggs and lemon juice in top of double broiler set over simmering water. Whisk until very thick and candy thermometer registers 160°F, about 3 minutes. Remove from over water. Add chopped white chocolate and whisk until smooth. Cool to room temperature.",
        "Beat cream and remaining 1/4 cup sugar in large bowl to firm peaks. Fold in white chocolate mixture.",
        "Turn cake out onto work surface. Peel off paper. Cut cake horizontally into 3 equal layers. Using bottom of springform pan as aid, transfer 1 cake layer to platter, cut side up. Spread 1 cup chocolate cream over. Arrange half of sliced strawberries in single layer over chocolate cream. Repeat layering with 1 cake layer, 1 cup chocolate cream, remaining sliced berries and 1/2 cup chocolate cream. Top with third cake layer, cut side down. Spread 3 cups chocolate cream over top and sides of cake. Press white chocolate curls onto sides of cake. Spoon remaining chocolate cream into pastry bag fitted with medium star tip. Pipe around top edge of cake. Garnish cake with whole berries. (Can be made 4 hours ahead. Cover; chill. Let stand at room temperature 1 hour before serving.)"
    ],
    "ingredients": [
        "3 cups cake flour",
        "2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "3/4 stick (6 tablespoons) cold unsalted butter, cut into bits",
        "1/2 teaspoon salt",
        "2 cups sugar",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "1 tablespoon plus 1 teaspoon grated lemon peel",
        "4 large eggs",
        "2 tablespoons fresh lemon juice",
        "1 1/2 teaspoons vanilla extract",
        "1 cup buttermilk, room temperature",
        "2 tablespoons poppy seeds",
        "3/4 cup sugar",
        "2 large eggs",
        "6 tablespoons fresh lemon juice",
        "8 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
        "3 cups chilled whipping cream",
        "2 1/2 cups sliced hulled strawberries",
        "4 ounces good-quality white chocolate, shaved into curls",
        "12 whole strawberries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Strawberry",
        "Lemon",
        "Summer",
        "Birthday",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Poppy Seed Layer Cake with Strawberries and White Chocolate Cream",
    "url": "http://www.epicurious.com/recipes/food/views/poppy-seed-layer-cake-with-strawberries-and-white-chocolate-cream-5910"
}
