{
    "directions": [
        "Preheat oven to 350°F with rack in middle. Butter and flour a 9- by 5-inch loaf pan.",
        "Whisk together flour, poppy seeds, baking powder, and salt.",
        "Scrape seeds from vanilla bean with tip of a paring knife into a bowl, then add butter and sugar and beat with an electric mixer at medium-high speed until pale and fluffy, about 3 minutes. Add eggs 1 at a time, beating well after each addition. At low speed, add flour mixture in 3 batches, alternating with half-and-half, beginning and ending with flour, and mixing until just incorporated.",
        "Spoon batter into loaf pan, smoothing top.",
        "Bake until golden-brown and a wooden pick inserted into center comes out with crumbs adhering, 1 to 1 1/4 hours. Cool in pan 30 minutes. Run a knife around edge of cake to loosen, then invert cake onto a rack. Cool completely, right side up.",
        "Stir together fruit, 3/4 cup sugar, 1/2 teaspoon zest, and lemon juice in a heavy medium saucepan. Simmer, stirring occasionally, until fruit begins to fall apart and liquid is slightly syrupy, about 30 minutes. Remove from heat and stir in remaining 1/2 teaspoon zest, nutmeg, and more sugar if desired. Transfer to a bowl to cool. Serve warm or at room temperature."
    ],
    "ingredients": [
        "2 cups sifted cake flour (not self-rising; sift before measuring)",
        "1/4 cup poppy seeds",
        "3/4 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/2 vanilla bean",
        "1 3/4 sticks unsalted butter, softened",
        "1 1/2 cups sugar",
        "3 large eggs, warmed in very warm water 10 minutes",
        "1/2 cup half-and-half at room temperature 30 minutes",
        "2 pounds firm-ripe plums and pluots, peeled and cut into 1/2-inch wedges",
        "3/4 cup sugar, or to taste",
        "1 teaspoon grated lemon zest , divided",
        "1 tablespoon fresh lemon juice",
        "1/2 teaspoon grated nutmeg",
        "Accompaniment: lightly sweetened whipped creamAccompaniment: lightly sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Picnic",
        "Backyard BBQ",
        "Lemon",
        "Plum",
        "Summer",
        "Poppy",
        "Butter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Poppy Seed Pound Cake with Plum Pluot Compote",
    "url": "http://www.epicurious.com/recipes/food/views/poppy-seed-pound-cake-with-plum-pluot-compote-354984"
}
