{
    "directions": [
        "Stir together water and 1 teaspoon sugar in a small bowl. Sprinkle yeast over mixture and let stand until foamy, about 5 minutes. (If yeast doesn't foam, discard and start over with new yeast.)",
        "Beat together butter and remaining 1/2 cup sugar in mixer at medium speed until pale and fluffy. Add yolks, vanilla, salt, and zest, beating until combined, then add yeast mixture. Reduce speed to low and add flour (2 1/2 cups) and milk, alternating in 2 batches and mixing until combined. Increase speed to medium and beat until dough is shiny and elastic, 4 to 6 minutes. (Dough will be very soft and sticky.)",
        "Scrape down side of bowl and cover bowl with plastic wrap and a kitchen towel. Dust dough with 2 tablespoons flour. Let rise in a warm, draft-free place until doubled in bulk, 1 1/2 to 2 hours.",
        "Bring raisins, cream, zest, and juice to a simmer in a 1-quart heavy saucepan over moderate heat, stirring occasionally. Remove from heat and let stand until most of cream is absorbed, about 20 minutes.",
        "Stir mixture into poppy-seed filling in a bowl.",
        "Line a 17- by 12-inch baking sheet with parchment paper.",
        "Punch down dough with a lightly oiled spatula and divide into 2 equal pieces. Roll out 1 piece on a well-floured surface with a floured rolling pin to a 12- by 9-inch rectangle (about 1/4 inch thick) with a long side nearest you.",
        "Spread half of filling evenly over dough with offset spatula, leaving a 1/2-inch border all around edge. Beat together yolk and cream for egg wash and brush on long border nearest you.",
        "Starting with long side farthest from you, roll dough toward you into a snug log, pinching firmly along egg-washed edge to seal. Pinch ends of loaf together and arrange lengthwise on baking sheet, off center and seam side down. Tuck ends under slightly. Form a second loaf in same manner, spacing loaves about 4 inches apart. Chill remaining egg wash to use later. Loosely cover with buttered plastic wrap and let rise in a warm, draft-free place until loaves double in bulk, about 1 hour.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Cut 3 steam vents, spaced 3 to 4 inches apart, in each loaf with a sharp knife, then brush loaves with remaining egg wash. Bake until crusts are deep golden brown and bottoms sound hollow when tapped, about 45 minutes. Transfer to a rack and cool to room temperature."
    ],
    "ingredients": [
        "1/4 cup warm water (105-115°F)",
        "1/2 cup plus 1 teaspoon sugar",
        "1 (1/4-oz) package active dry yeast (2 1/2 teaspoons)",
        "1/2 stick (1/4 cup) unsalted butter, softened",
        "2 large egg yolks",
        "1 teaspoon vanilla",
        "1/4 teaspoon salt",
        "1 teaspoon finely grated fresh lemon zest",
        "2 1/2 cups plus 2 tablespoons all-purpose flour (plus additional for dusting and rolling)",
        "1/2 cup warm milk (105-115°F)",
        "3/4 cup golden raisins, coarsely chopped",
        "1/2 cup heavy cream",
        "1 teaspoon finely grated fresh lemon zest",
        "2 teaspoons fresh lemon juice",
        "1 1/4 cups canned poppy-seed filling (12 oz)",
        "1 large egg yolk",
        "1 tablespoon heavy cream",
        "Special equipment: a stand mixer fitted with paddle attachment; parchment paper; an offset spatula",
        "Accompaniment: vanilla sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Poppy",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Poppy-Seed Sweet Bread",
    "url": "http://www.epicurious.com/recipes/food/views/poppy-seed-sweet-bread-236425"
}
