{
    "directions": [
        "In a saucepan, heat together milk, sugar, shortening, and salt until warm.",
        "Combine 2 cups of the flour and the yeast in a large mixing bowl.  Stir in warm milk mixture.  Add 3 eggs; beat with an electric mixer at low speed for 1/2 min, scraping sides of bowl constantly.  Beat for 3 minutes at high speed.  Stir in as much of remaining flour as you can.  Turn out onto a lightly floured surface.  Knead in remaining flour to make a stiff dough, and continue kneading for 6 to 8 minutes.  Place dough in a lightly greased bowl, and turn once to grease surface.   Cover, and let rise in a warm place until doubled.",
        "Meanwhile, pour boiling water over poppy seeds; let stand 30 minutes.  Drain thoroughly, and place in a blender.  Grind.  In a small bowl, blend  together ground poppy seeds, chopped nuts, honey, and lemon zest.  Beat 1 egg white until stiff, and fold into poppy seed mixture.",
        "Punch down dough, and divide in half.  Cover, and let rest for 10 minutes.  On a lightly floured surface, roll half of the dough into 24 x 8 inch rectangle.  Spread with half the poppy seed mixture.  Roll up jelly roll style, starting with the narrow edge.  Seal the edge.  Place seam side down, in a greased 8 x 4 inch loaf pan.  Repeat with the other half of the dough.  Cover.  Let rise for 30 to 45 minutes, or until doubled.",
        "Bake in a preheated 350 degrees F (175 degrees C) oven for 35 to 40 minutes."
    ],
    "ingredients": [
        "5 1/2 cups all-purpose flour",
        "2 (.25 ounce) packages active dry yeast",
        "1 1/2 cups milk",
        "1/3 cup white sugar",
        "1/3 cup shortening",
        "1 teaspoon salt",
        "3 eggs",
        "1 cup boiling water",
        "3/4 cup poppy seeds",
        "1/2 cup chopped walnuts",
        "1/3 cup honey",
        "1 teaspoon grated lemon zest",
        "1 egg white"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Poppy Seed Loaf",
    "url": "http://allrecipes.com/recipe/6973/poppy-seed-loaf/"
}
