{
    "directions": [
        "Whisk together flour, cornmeal, poppy seeds, salt, and baking powder in a large bowl. Blend in butter with a pastry blender or your fingertips (or pulse in a food processor) just until mixture resembles coarse meal. Add cheese and 4 Tbsp cold water and mix with a fork (or pulse) until incorporated. If mixture is still dry, add enough of remaining tablespoon cold water until mixture holds together to form a soft dough.",
        "Turn out dough onto a work surface. With heel of your hand, smear dough 3 or 4 times in a forward motion to help distribute fat. Gather dough together, with a pastry scraper if you have one, then divide dough in half. Press each half into a disk, then chill, wrapped in plastic wrap, until firm, about 1 hour.",
        "Preheat oven to 400°F with racks in upper and lower thirds. Line 2 large baking sheets with parchment paper.",
        "Roll out 1 disk of dough on a lightly floured surface (keep remaining disk chilled until ready to use) with a lightly floured rolling pin into a 12-inch round and cut out as many crescent moons as possible with cutter. Transfer to baking sheets, arranging them 1/2 inch apart. Gather scraps, then reroll and cut out.",
        "Lightly beat egg with warm water in a small bowl for egg wash. Lightly brush crescents with egg wash and prick all over with a fork, then sprinkle with sea salt. Bake, switching position of sheets halfway through, until golden, 12 to 14 minutes. Cool completely on sheets on racks. Make more crackers with remaining dough (cool baking sheets between batches)."
    ],
    "ingredients": [
        "3/4 cup all-purpose flour",
        "1/4 cup yellow cornmeal",
        "1 tablespoon poppy seeds",
        "1/4 teaspoon salt",
        "1/4 teaspoon baking powder",
        "1/2 stick cold unsalted butter, cut into bits",
        "1 cup coarsely grated extra-sharp Cheddar (preferably orange)",
        "4 to 5 tablespoons cold water",
        "1 large egg",
        "1 tablespoon warm water",
        "Coarse sea salt for sprinkling",
        "Equipment: a 2 3/4-inch crescent cookie cutter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Bake",
        "Kid-Friendly",
        "Halloween",
        "Back to School",
        "Cheddar",
        "Cornmeal",
        "Party",
        "Poppy",
        "Butter",
        "Gourmet"
    ],
    "title": "Poppy Cheddar Moon Crackers",
    "url": "http://www.epicurious.com/recipes/food/views/poppy-cheddar-moon-crackers-356190"
}
