{
    "directions": [
        "Grind fennel seeds and red pepper flakes in a spice mill or with a mortar and pestle until very fine. Toss spice mixture and salt in a small bowl; set aside.",
        "Heat oil in a small skillet over medium. Cook pancetta, stirring often, until brown and crisp, 5–8 minutes. Let cool. Transfer pancetta and fat in skillet to a food processor, add garlic, and process to a smooth paste. Add sage, parsley, chives, rosemary, and lemon zest and process until smooth; set paste aside.",
        "Pat turkey breast dry and place skin side down on a large rimmed baking sheet so thickest part of breast is closest to you. Run your fingers underneath fillets lengthwise to detach. Using a thin, sharp blade, position knife about 3\" from neck end and cut downward at a 45ºF angle into the thickest part of the breast (do not cut all the way through; you're butterflying only the top portion). Open top flap you've just created like a book. Fold fillets in half and place in the top and bottom gaps between the breasts so tapered ends are facing in. The idea is to create a layer of meat of uniform thickness across the entire breast.",
        "Sprinkle reserved spice mixture all over turkey flesh; rub into crevices. Rub paste all over flesh of turkey to coat evenly, working into crevices. Roll up turkey breast left to right like a jelly roll to form a log; position seam side down and tuck skin under at each end. Starting at center, tie with kitchen twine at even intervals (apply some pressure with string so turkey holds a nice round shape, but don't tie too tightly or it will bulge when cooked).",
        "Let rolled turkey sit 2 hours to bring to room temperature.",
        "Preheat oven to 325ºF. Roast turkey on baking sheet until skin is golden and starting to crisp, 40–45 minutes. Remove from oven and carefully remove strings with kitchen shears. Drape with bacon slices, overlapping; tuck ends underneath turkey to secure. Roast until an instant-read thermometer inserted into the thickest part registers 140ºF, 30–40 minutes.",
        "Increase oven temperature to 400ºF and cook until bacon is browned and crisp and thermometer registers 150ºF, 5–10 minutes longer. Transfer to a platter and let rest at least 40 minutes before slicing. Serve with pan juices.",
        "Turkey breast can be rolled 1 day ahead. Chill uncovered on a rimmed baking sheet."
    ],
    "ingredients": [
        "1 teaspoon fennel seeds",
        "1/2 teaspoon crushed red pepper flakes",
        "1 tablespoon kosher salt",
        "2 tablespoons olive oil",
        "2 ounces pancetta (Italian bacon), chopped",
        "4 garlic cloves",
        "3 sage leaves",
        "1/2 cup parsley leaves",
        "1/4 cup coarsely chopped fresh chives",
        "1 teaspoon finely chopped fresh rosemary",
        "2 teaspoons finely grated lemon zest",
        "1 whole skin-on, bone-in turkey breast, bones removed",
        "12 slices bacon",
        "A spice mill or a mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bacon",
        "Dinner",
        "Thanksgiving",
        "Kid-Friendly",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "turkey"
    ],
    "title": "Porchetta-Style Roast Turkey Breast",
    "url": "http://www.epicurious.com/recipes/food/views/porchetta-style-roast-turkey-breast"
}
