{
    "directions": [
        "Make a deep cut into the top side of tenderloin, about 4 inches from tail end, to facilitate folding the tail end under the roast to give the meat a more uniform thickness. Tie roast at 1-inch intervals with kitchen string.",
        "Heat oven to 350°F with rack in middle.",
        "Pat tenderloin dry and sprinkle all over with 1 teaspoon each salt and pepper, rubbing into meat.",
        "Set roasting pan over 2 burners, then add 3 tablespoons oil and heat over medium-high heat until shimmering. Brown tenderloin on all sides, about 10 minutes.",
        "Sprinkle porcini powder evenly on top of tenderloin and roast in oven until thermometer inserted diagonally 2 inches into center of thickest part of meat registers 120°F, 30 to 40 minutes.",
        "Toward end of roasting tenderloin, stir together truffle butter and flour. Heat remaining tablespoon oil in a 12-inch heavy skillet over medium-high heat until shimmering, and sauté mushrooms with 1/4 teaspoon each salt and pepper until liquid released by the mushrooms evaporates and mushrooms are tender and golden, 10 to 12 minutes.",
        "Add 2 cups stock to skillet and simmer, stirring up brown bits, 1 minute. Remove skillet from heat.",
        "Transfer tenderloin to a cutting board and let stand 15 minutes (internal temperature will rise to about 130°F for medium-rare).",
        "Set roasting pan over 2 burners and add remaining 1 cup stock. Bring to a boil, scraping up brown bits, then pour stock into mushroom mixture in skillet.",
        "Bring mushroom mixture to a boil and whisk in truffle butter mixture, bit by bit. Reduce heat and simmer, whisking occasionally until thickened, about 2 minutes. Stir in scallion greens and salt and pepper to taste.",
        "Cut tenderloin into 1/2-inch-thick slices, discarding string, and serve with sauce."
    ],
    "ingredients": [
        "1 (6- to 6 1/2-pound) whole beef tenderloin, trimmed of fat, silverskin, and the chain (see Cooks' Notes); or a 5- to 5 1/2-pound well-trimmed tenderloin roast",
        "Salt",
        "Freshly ground black pepper",
        "4 tablespoons olive oil, divided",
        "1/2 ounce (about 1/2 cup) dried porcini mushrooms, ground to a powder in a blender",
        "1/4 cup (2 ounces) black-truffle butter, softened",
        "1/4 cup all-purpose flour",
        "1 pound crimini (baby bella) mushrooms, trimmed and quartered into wedges",
        "3 cups beef stock or low-sodium broth, divided",
        "1/2 cup chopped scallion greens",
        "Special equipment: Kitchen string; large heavy roasting pan; instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Roast",
        "Christmas",
        "Dinner",
        "Meat",
        "Beef Tenderloin",
        "Winter",
        "Christmas Eve",
        "Butter",
        "Gourmet",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Porcini-Crusted Beef Tenderloin with Truffle Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/porcini-crusted-beef-tenderloin-with-truffle-butter-sauce-387490"
}
