{
    "directions": [
        "Bring 2 cups water to boil in heavy small saucepan. Add mushrooms. Cover; let stand until mushrooms soften, about 10 minutes. Using slotted spoon, transfer mushrooms to work surface; reserve soaking liquid. Chop mushrooms coarsely.",
        "Melt butter with oil in pressure cooker over medium-high heat. Add rice, shallots, and fennel seeds; stir 1 minute. Add wine and cook until almost evaporated, stirring frequently, about 1 minute. Mix in 2 cups broth and salt, then mushrooms and reserved mushroom soaking liquid, leaving any sediment behind in pan. Lock lid in place. Bring to high pressure over high heat. Cook rice 4 minutes, adjusting heat as necessary to maintain high pressure. Quick-release pressure.",
        "Slowly release lid, standing back and allowing steam to escape. Cook rice over medium-high heat until creamy and tender but still firm to bite, stirring often and adding more broth by 1/4 cupfuls if thinner consistency is desired, about 2 minutes. Mix in cheese and parsley. Season risotto to taste with pepper.",
        "*Dried porcini mushrooms are available at Italian markets, specialty foods stores, and many supermarkets."
    ],
    "ingredients": [
        "2 cups water",
        "1 ounce dried porcini mushrooms*",
        "1 tablespoon butter",
        "1 tablespoon olive oil",
        "1 1/2 cups arborio rice or medium-grain white rice (about 9 1/2 ounces)",
        "3 large shallots, chopped",
        "1 teaspoon fennel seeds",
        "1/2 cup dry white wine",
        "2 cups (or more) low-salt chicken broth",
        "1/2 teaspoon salt",
        "1 cup freshly grated Parmesan cheese (about 3 ounces)",
        "2 tablespoons chopped fresh parsley",
        "Special equipment: pressure cooker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Rice",
        "Appetizer",
        "Side",
        "Vegetarian",
        "Parmesan",
        "White Wine",
        "Fall",
        "Simmer",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Porcini Mushroom Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/porcini-mushroom-risotto-108603"
}
