{
    "directions": [
        "Place porcini in small bowl; add 1 cup boiling water. Let stand until softened, at least 30 minutes and up to 2 hours. Drain mushrooms, reserving soaking liquid. Chop mushrooms. Transfer half of chopped mushrooms (about 1/3 cup) to small bowl; reserve for gravy.",
        "Chop garlic finely in processor. Add butter and next 6 ingredients, then remaining porcini. Blend to coarse paste. DO AHEAD: Can be made 2 days ahead. Transfer to bowl. Cover and chill mushroom butter, reserved chopped porcini, and mushroom liquid separately. TRUE GRIT: When using the porcini soaking liquid, pour it off slowly so that any grit or sediment at the bottom remains in the bowl.",
        "*Dried porcini are available at supermarkets, specialty foods stores, and Italian markets.",
        "Set rack at lowest position in oven and preheat to 325°F. Sprinkle main turkey cavity with salt and pepper. Spread with 2 tablespoons mushroom butter. Starting at neck end of turkey, carefully slide hand between skin and meat of breast, thighs, and upper drumsticks to loosen skin. Spread mushroom butter over thighs and drumsticks, then over breast meat under skin. Fill main cavity with herb sprigs. Tie legs together loosely to hold shape. Tuck wing tips under.",
        "Place turkey on rack set in large roasting pan. Rub outside of turkey all over with oil; sprinkle with salt and pepper. Pour 2 cups stock into pan. Roast turkey until thermometer inserted into thickest part of thigh registers 165°F to 170°F, about 3 hours. Tilt turkey so juices from main cavity run into pan. Transfer turkey to platter. Tent very loosely with foil; let rest at least 30 minutes (internal temperature will rise 5 to 10 degrees). Reserve pan.",
        "Scrape juices and browned bits from reserved roasting pan into large glass measuring cup. Spoon off fat, reserving 3 tablespoons.",
        "Heat reserved 3 tablespoons fat in heavy large skillet over medium-high heat. Add crimini mushrooms, garlic, and shallot. Sauté until mushrooms are tender, about 6 minutes. Transfer mushrooms to bowl and set aside. Add wine to skillet. Boil until reduced to 1/2 cup, about 3 minutes. Add reserved 1/3 cup chopped porcini mushrooms, reserved mushroom soaking liquid (leaving any sediment behind), 2 cups stock, and degreased pan juices. Bring to boil. Reduce heat to medium-low and simmer to reduce slightly, about 10 minutes.",
        "Add cream and crimini mushrooms to skillet. Mix 2 tablespoons water and cornstarch in small bowl until smooth. Whisk into gravy. Continue to simmer until reduced to desired consistency, whisking occasionally, about 5 minutes. Mix in parsley and mint. Season gravy to taste with salt and pepper."
    ],
    "ingredients": [
        "1 ounce dried porcini mushrooms*",
        "1 cup boiling water",
        "4 garlic cloves, peeled",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1/4 cup chopped fresh Italian parsley",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh rosemary",
        "1 teaspoon chopped fresh mint",
        "1 1/2 teaspoons salt",
        "1 teaspoon freshly ground black pepper",
        "1 14- to 16-pound turkey, rinsed, patted dry inside and out; neck, heart, and gizzard reserved for Shortcut Turkey Stock",
        "10 fresh Italian parsley sprigs",
        "6 fresh rosemary sprigs",
        "6 fresh thyme sprigs",
        "2 tablespoons olive oil",
        "2 cups Shortcut Turkey Stock or water",
        "1 pound crimini mushrooms, sliced",
        "3 garlic cloves, chopped",
        "2 tablespoons chopped shallot",
        "1 cup dry white wine",
        "2 cups Shortcut Turkey Stock",
        "1 cup heavy whipping cream",
        "2 tablespoons water",
        "5 teaspoons cornstarch",
        "1/4 cup chopped fresh Italian parsley",
        "1 teaspoon chopped fresh mint"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "turkey",
        "Roast",
        "Thanksgiving"
    ],
    "title": "Porcini Mushroom Turkey with Mushroom Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/porcini-mushroom-turkey-with-mushroom-gravy-240380"
}
