{
    "directions": [
        "Add enough hot water to porcini soaking liquid to measure 3/4 cup if necessary. Heat liquid in small saucepan to 105°F to 115°F. Pour into processor. Sprinkle yeast over. Let stand until yeast dissolves, about 12 minutes. Add oil, 1 teaspoon salt and 1 teaspoon rosemary. Process 3 seconds. Add 2 cups plus 2 tablespoons flour and process until moist clumps form, adding more flour if necessary. Mix in olives, using 4 on/off turns. Turn out dough into large bowl. Add porcini and knead until mixed in (dough will be firm and sticky).",
        "Generously flour heavy large baking sheet. Turn out dough onto sheet. Using floured hands, press out dough to irregular 13 x 9-inch rectangle. Sprinkle dough with remaining 1 teaspoon salt and 1 teaspoon rosemary. Cover baking sheet with plastic wrap. Let dough rise in warm draft-free area until puffy, about 1 hour.",
        "Preheat oven to 400°F. Bake bread until crusty, about 25 minutes. Serve warm or at room temperature.",
        "Combine porcini and water in medium bowl. Let stand until porcini soften, about 40 minutes. Pour mixture into strainer set over small bowl. Press porcini to release excess liquid. Coarsely chop porcini. Pour soaking liquid into measuring cup, leaving any sediment behind; reserve soaking liquid."
    ],
    "ingredients": [
        "Hot water",
        "1 ounce dried porcini mushrooms, reconstituted in 1 cup hot water (see instructions below)",
        "1 envelope dry yeast",
        "1/4 cup olive oil",
        "2 teaspoons coarse salt",
        "2 teaspoons chopped fresh rosemary",
        "2 cups plus 4 tablespoons (about) unbleached all purpose flour",
        "1/2 cup coarsely chopped pitted brine-cured olives (such as Kalamata)",
        "1 ounce dried porcini mushrooms",
        "1 cup hot water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Food Processor",
        "Mushroom",
        "Olive",
        "Appetizer",
        "Bake",
        "Rosemary",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Porcini, Olive and Rosemary Focaccia",
    "url": "http://www.epicurious.com/recipes/food/views/porcini-olive-and-rosemary-focaccia-781"
}
