{
    "directions": [
        "Place porcini mushrooms in small bowl; add 2 cups boiling water. Let soak until mushrooms soften, at least 30 minutes and up to 2 hours. Strain, reserving mushrooms and liquid separately.",
        "Sauté bacon in large saucepan over medium heat until golden. Add garlic and shallots; sauté 3 minutes. Add fresh mushrooms; sauté 8 minutes. Transfer half of mushrooms to bowl; reserve.",
        "Add drained porcini and wine to pan. Boil 15 minutes. Mix in all broth. Add porcini liquid, leaving sediment behind. Return mixture to boil, reduce heat, and simmer until mixture is reduced to 5 cups, about 1 hour 30 minutes. Skim fat from top; add rosemary. Simmer 3 minutes; discard rosemary. (Can be made 2 days ahead. Cover mushroom-wine mixture and reserved mushrooms separately; chill.)",
        "Place reserved roasting pan over 2 burners. Add mushroom-wine mixture and bring to boil, scraping up browned bits. Strain back into same saucepan, pressing out all liquid. Simmer over medium heat until reduced to 2 cups, about 5 minutes. Mix in reserved mushrooms from bowl. Whisk in butter. Season with salt and pepper."
    ],
    "ingredients": [
        "2 ounces dried porcini mushrooms",
        "2 cups boiling water",
        "1/4 pound sliced bacon, chopped",
        "9 garlic cloves, sliced",
        "2 shallots, thinly sliced",
        "1 pound button mushrooms, sliced",
        "3 cups dry red wine",
        "4 cups low-salt chicken broth",
        "1 cup beef broth",
        "1 large fresh rosemary sprig",
        "Reserved roasting pan with juices",
        "1/4 cup (1/2 stick) chilled butter, diced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Garlic",
        "Mushroom",
        "Sauté",
        "Christmas",
        "Bacon",
        "Red Wine",
        "Winter"
    ],
    "title": "Porcini and Bacon Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/porcini-and-bacon-sauce-233416"
}
