{
    "directions": [
        "Slice pork roast horizontally through the middle, stopping short of the opposite edge so it stays in one piece. Open the two sides and spread them out like an open book.",
        "Rub 1/4 cup plus 2 tablespoons olive oil over both sides of the pork roast. Rub 3 tablespoons salt and black pepper into the flesh. Spread onion, 8 garlic cloves, dill, rosemary, and parsley over both sides of the roast. Transfer to a cast iron pan and pour in wine. Cover with plastic wrap and let marinate in the refrigerator for 3 days.",
        "Remove roast from refrigerator, remove plastic wrap, and bring to room temperature, about 1 hour.",
        "Preheat oven to 225 degrees F (110 degrees C).",
        "Set cast iron pan over medium-high heat. Cook roast until browned, about 5 minutes per side.",
        "Roast in the preheated oven, covered, until pork falls off the bone, about 5 hours. Remove bone and stir pork; continue cooking until juices are absorbed, about 3 hours more. Remove from oven and let cool, covered, about 1 hour.",
        "Heat 1 tablespoon olive oil in a large skillet over medium-high heat. Add remaining 2 garlic cloves and broccoli rabe; cook and stir until browned, about 5 minutes.",
        "Heat remaining 1 tablespoon olive oil in another skillet over medium heat. Add red bell peppers and remaining 1 tablespoon salt; cook and stir until peppers have softened, 10 to 15 minutes.",
        "Divide pork among rolls. Top with broccoli rabe mixture, red bell peppers, and provolone cheese."
    ],
    "ingredients": [
        "8 pounds bone-in pork butt (shoulder) roast",
        "1/2 cup olive oil, divided",
        "1/4 cup kosher salt, divided",
        "2 tablespoons ground black pepper",
        "1/2 onion, finely chopped",
        "10 cloves garlic, slivered, divided",
        "2 tablespoons chopped fresh dill weed",
        "2 tablespoons chopped fresh rosemary",
        "1 tablespoon chopped fresh parsley",
        "1/4 cup red wine",
        "1 bunch broccoli rabe, trimmed and chopped",
        "2 red bell peppers, chopped",
        "24 hard rolls",
        "1/2 pound sharp provolone cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Porchetta Italiano",
    "url": "http://allrecipes.com/recipe/246690/porchetta-italiano/"
}
