{
    "directions": [
        "Cook onions in large saucepan of boiling salted water 2 minutes; transfer to bowl of ice water to cool. Peel onions; set aside.",
        "Cook bacon in heavy large pot over medium heat until lightly browned. Using slotted spoon, transfer bacon to paper towels to drain. Sprinkle pork shoulder with coarse salt and pepper. Increase heat to medium-high. Working in 2 batches, add pork to same pot and cook until browned, about 7 minutes per batch. Using slotted spoon, transfer pork to large bowl. Reduce heat to medium; add shallots and parsnips. Cover pot and cook until beginning to soften, stirring occasionally, about 5 minutes. Stir in 3 teaspoons sage; stir 1 minute. Add 1/2 cup Calvados, if using; cook until almost evaporated, about 3 minutes. Add broth, cider, reserved bacon, and pork with any accumulated juices. Bring to boil, scraping up any browned bits with wooden spoon. Reduce heat to medium-low; cover and simmer until pork is tender, about 1 hour 15 minutes.",
        "Add potatoes and pearl onions to stew; cover and cook until vegetables are almost tender, about 30 minutes. Add apples; cover and cook until potatoes are tender, 15 to 20 minutes. Spoon fat from surface of juices, if necessary. Stir butter and flour in small bowl to form paste; add to pot and whisk to blend. Stir in mustard, 2 teaspoons sage, and 1 tablespoon Calvados, if using. Bring to boil; reduce heat to medium and simmer until thickened, stirring often, 2 to 3 minutes. Season to taste with salt and pepper. DO AHEAD: Stew can be made 1 day ahead. Cool slightly. Refrigerate uncovered until cold, then cover and keep chilled. Simmer stew over medium heat to rewarm before serving.",
        "Divide stew among bowls, sprinkle with remaining 1 teaspoon sage, and serve.",
        "Alcoholic apple cider; available in the liquor department of most supermarkets and at liquor stores."
    ],
    "ingredients": [
        "30 1-inch-diameter pearl onions (from two 10-ounce bags)",
        "5 slices thick-cut bacon (preferably applewood-smoked), cut crosswise into 1/4-inch-thick strips",
        "3 1/2 pounds boneless pork shoulder (Boston butt) or boneless country ribs, external fat trimmed, cut into 2-inch cubes",
        "Coarse kosher salt",
        "1 cup chopped shallots (about 4 large)",
        "1 cup finely chopped parsnips",
        "6 teaspoons chopped fresh sage, divided",
        "1/2 cup plus 1 tablespoon Calvados (apple brandy; optional)",
        "2 cups low-salt chicken broth",
        "1 12-ounce bottle hard apple cider*",
        "1 1/2 pounds unpeeled baby red potatoes (about 2 inches in diameter), scrubbed, halved",
        "2 large Granny Smith apples, peeled, cored, cut into 1-inch cubes (about 3 cups)",
        "2 tablespoons (1/4 stick) butter, room temperature",
        "2 tablespoons all purpose flour",
        "1 tablespoon whole grain Dijon mustard"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Pork",
        "Potato",
        "Vegetable",
        "Stew",
        "Dinner",
        "Meat",
        "Bacon",
        "Root Vegetable",
        "Fall",
        "Winter",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork Stew with Hard Cider, Pearl Onions, and Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/pork-stew-with-hard-cider-pearl-onions-and-potatoes-357274"
}
