{
    "directions": [
        "To make the filling: Place pork in a large pot and cover with water. Add onion, garlic, salt, oregano, cumin and bay leaves. Bring to a boil, reduce heat and simmer for 1 1/2 hours. While pork is cooking, prepare dough.",
        "To make the dough: Sift together the flour, masa harina, baking powder and salt. Add the shortening to the dry ingredients and mix well. In a separate bowl, beat together the egg and 1/2 cup milk. Make a well in the center of the dry ingredients. Add the egg mixture and stir with a fork until the dough comes together in a ball. Divide the dough into 16 even pieces and roll each piece into a ball. Place in a container, cover, and refrigerate.",
        "Preheat oven to 375 degrees F (190 degrees C).",
        "After the pork has simmered for 1 1/2 hours, remove from liquid. Place pork in a baking dish and bake for 1 hour or until meat shreds easily with fork. Remove from oven (keep oven turned on) and shred into small pieces. Add salsa to shredded pork.",
        "Lightly grease a baking sheet.",
        "On lightly floured surface, flatten a piece of dough with the palm of your hand. With a rolling pin, roll out the dough to make a 5-inch circle about 1/8-inch thick. Place 2 to 3 tablespoons of filling in the center of the dough circle. Brush edges of dough with milk. Fold dough over filling. Pinch edges together. Crimp with fork to seal.",
        "Place on prepared baking sheet and repeat with remaining empanada dough. Leftover filling can be frozen or used in tacos, tamales, or burritos.",
        "Bake in preheated oven until golden, about 20 minutes. Remove to rack and cool for about 5 minutes. Serve warm."
    ],
    "ingredients": [
        "2 pounds pork butt roast",
        "1 onion, quartered",
        "2 cloves garlic",
        "1/2 teaspoon salt",
        "1 teaspoon dried oregano",
        "1 teaspoon ground cumin",
        "2 bay leaves",
        "1 1/2 cups all-purpose flour",
        "3/4 cup masa harina",
        "1 teaspoon baking powder",
        "1/4 teaspoon salt",
        "1/2 cup lard",
        "1 egg, beaten",
        "1/2 cup milk",
        "1 cup chipotle salsa"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pork Empanadas",
    "url": "http://allrecipes.com/recipe/21690/pork-empanadas/"
}
