{
    "directions": [
        "Place a roasting pan in oven; preheat to 450°F. Cut shoulder into four 1\"-thick steaks; season with salt. Whisk ginger, garlic, 1 Tbsp. vinegar, and 1 Tbsp. soy sauce in a small bowl. Set both aside.",
        "Remove stalk from broccoli. Peel, trim, and slice into 1/4\"-thick planks. Divide broccoli into large florets. Blanch stems and florets in a large saucepan of boiling salted water until bright green, about 10 seconds. Transfer to a rimmed baking sheet; let cool. Pat dry and toss in a medium bowl with shallots, olive oil, and sesame seeds; season with salt.",
        "Heat vegetable oil in a large skillet, preferably cast iron, over medium-high. Cook reserved pork, undisturbed, until deep golden brown underneath, about 5 minutes. Turn and cook until an instant-read thermometer inserted into the thickest part registers 135°F–140°F for medium, about 3 minutes. Transfer to a cutting board and let rest 10 minutes.",
        "Pour off fat from skillet and cook pineapple, tossing often and adding a splash or so of water if needed to keep mixture saucy, until slightly softened and browned in spots, about 3 minutes. Add 1 Tbsp. butter along with any pork juices on cutting board; toss until sauce is glossy and emulsified. Stir in remaining 2 tsp. vinegar and soy sauce. Season with salt.",
        "Meanwhile, transfer broccoli mixture to hot roasting pan. Roast until lightly browned but still crisp-tender, 8–10 minutes. Add to reserved dressing and toss to coat; season with salt. Serve pork with pineapple and broccoli."
    ],
    "ingredients": [
        "1 (1 1/2–2-pound) skinless, boneless pork shoulder (Boston butt) or 4 pork blade chops",
        "Kosher salt",
        "1 (1-inch) piece ginger, peeled, finely grated",
        "1 garlic clove, finely grated",
        "1 tablespoon plus 2 teaspoons balsamic vinegar",
        "1 tablespoon plus 2 teaspoons soy sauce",
        "1 1/2 pounds broccoli",
        "3 small shallots, thickly sliced",
        "2 tablespoons olive oil",
        "2 tablespoons sesame seeds",
        "1 tablespoon vegetable oil",
        "1/2 small pineapple, peeled, cut into 1/2-inch pieces",
        "1 tablespoon unsalted butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Hawaii",
        "Pineapple",
        "Pork",
        "Ginger",
        "Broccoli",
        "Sesame",
        "Soy Sauce"
    ],
    "title": "Pork Shoulder With Pineapple and Sesame Broccoli",
    "url": "http://www.epicurious.com/recipes/food/views/pork-shoulder-with-pineapple-and-sesame-broccoli"
}
