{
    "directions": [
        "Mince and mash garlic, salt, and thyme to make a paste with a large heavy knife and transfer to a small bowl.",
        "Grind fennel seeds and peppercorns in spice grinder until finely ground and stir into garlic paste.",
        "Rub paste all over meat and fat side of roast, pressing to adhere. Place, fat side up, in a small roasting pan or a (13- by 9-inch) baking pan and marinate in the fridge, loosely covered, for at least to 2 and up to 6 hours. Let stand at room temperature 1 hour before roasting.",
        "Preheat oven to 350°F.",
        "Put roast in a small roasting pan fat side up (if it isn't in roasting pan already) and pour wine and water into bottom of pan.",
        "Roast pork in middle of oven (or lower third if making whole menu) until an instant read thermometer inserted into center of meat (do not touch bone) registers 140°F, about 1 1/2 to 1 3/4 hours.",
        "Remove roast from oven and let rest, loosely covered with foil, in roasting pan 25 to 30 minutes (internal temperature will go up 10 degrees while meat is resting).",
        "Transfer the roast to a cutting board, and using a long knife, cut meat from bone in one piece. Slice into 1/2-inch thick slices, keeping slices together.",
        "Transfer the bones to a large serving platter and arrange meat on the bone.",
        "Heat juices in roasting pan until bubbling, then add butter and whisk into pan until incorporated.",
        "Serve sauce alongside meat."
    ],
    "ingredients": [
        "2 tablespoons chopped garlic (4 to 5 cloves)",
        "1 tablespoon kosher salt",
        "1 tablespoon chopped fresh thyme",
        "2 teaspoons fennel seeds",
        "1 teaspoon black peppercorns",
        "1 6 pound bone-in pork loin roast",
        "1 cup dry white wine",
        "1 cup water",
        "2 tablespoons cold unsalted butter, cut into pieces",
        "Special equipment: a coffee/spice grinder; an instant read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pork",
        "Roast",
        "Easter",
        "Dinner",
        "Meat",
        "White Wine",
        "Gourmet",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork Loin Roast with Fennel-Garlic Rub",
    "url": "http://www.epicurious.com/recipes/food/views/pork-loin-roast-with-fennel-garlic-rub-395012"
}
