{
    "directions": [
        "Peel garlic cloves and reserve 2 for chile sauce. Slice remaining garlic. In a 7- to 8-quart heavy kettle bring water and broth just to a boil with sliced garlic and pork. Skim surface and add oregano. Gently simmer pork, uncovered, until tender, about 1 1/2 hours.",
        "While pork is simmering, wearing protective gloves, discard stems from chiles and in a bowl combine chiles with boiling-hot water. Soak chiles, turning them occasionally, 30 minutes. Cut onion into large pieces and in a blender purée with chiles and soaking liquid, reserved garlic, and 2 teaspoons salt until smooth.",
        "Transfer pork with tongs to a cutting board and reserve broth mixture. Shred pork, using 2 forks, and discard bones. Rinse and drain hominy. Return pork to broth mixture and add chile sauce, hominy, and remaining teaspoon salt. Simmer pozole 30 minutes and, if necessary, season with salt. Pozole may be made 2 days ahead and chilled, covered.",
        "While pozole is simmering, stack tortillas and halve. Cut halves crosswise into thin strips. In a 9- to 10-inch skillet heat 1/2 inch oil until hot but not smoking and fry tortilla strips in 3 or 4 batches, stirring occasionally, until golden, 1 to 2 minutes. Transfer tortilla strips with a slotted spoon as fried to brown paper or paper towels to drain. Transfer tortilla strips to a bowl. Tortilla strips may be made 1 day ahead and kept, covered, at room temperature.",
        "Serve pozole with tortilla strips and bowls of accompaniments."
    ],
    "ingredients": [
        "1 large head garlic",
        "12 cups water",
        "4 cups chicken broth",
        "4 pounds country-style pork ribs",
        "1 teaspoon dried oregano (preferably Mexican), crumbled",
        "2 ounces dried New Mexico red chiles",
        "1 1/2 cups boiling-hot water",
        "1/4 large white onion",
        "3 teaspoons salt",
        "two 30-ounce cans white hominy (preferably Bush's Best)",
        "8 corn tortillas",
        "about 1 1/2 cups vegetable oil",
        "diced avocado",
        "thinly sliced iceberg or romaine lettuce",
        "chopped white onion",
        "diced radishes",
        "lime wedges",
        "dried oregano",
        "dried hot red pepper flakes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pepper",
        "Pork",
        "Stew",
        "Kid-Friendly",
        "Pork Rib",
        "Hot Pepper",
        "Spring",
        "Tortillas",
        "Hominy/Cornmeal/Masa",
        "Gourmet"
    ],
    "title": "Pork and Hominy Stew with Red Chiles (Pozole Rojo)",
    "url": "http://www.epicurious.com/recipes/food/views/pork-and-hominy-stew-with-red-chiles-pozole-rojo-101285"
}
