{
    "directions": [
        "In a kettle heat the oil over moderately high heat until it is hot but not smoking and in it brown the pork, patted dry, in batches, transferring it as it is browned to a large bowl. Pour off the fat from the kettle, return the pork to the kettle with the onion, the celery, the bay leaf, the broth, and the water, and simmer the mixture, uncovered for 1 1/2 hours, or until the pork is tender. Add the carrots, simmer the mixture, covered for 15 minutes, or until the carrots are tender, and transfer the pork and the carrots with tongs to a bowl. Strain the mixture through a fine sieve into a bowl return the cooking liquid to the kettle, and boil it until it is reduced to about 3 cups.",
        "In a large heavy skillet cook the mushrooms in the butter over moderate heat, stirring occasionally, until most of the liquid the mushrooms give off is evaporated, sprinkle the mixture with the flour, and cook it over moderately low heat, scraping up the brown bits, for 3 minutes. Stir in the cream, stirring until the mixture is combined well, add the mushroom mixture to the cooking liquid, and simmer the sauce, stirring, until it is thickened. Stir in the lemon juice, the pork, the carrots, salt and pepper to taste . The fricassee may be made 2 days in advance and kept covered and chilled. Stir in the parsley and serve the fricassee over the paprika rice."
    ],
    "ingredients": [
        "3 tablespoons vegetable oil",
        "3 1/2 pounds boneless pork shoulder, trimmed of excess fat and cut into 2-inch pieces",
        "1 large onion, chopped",
        "2 ribs of celery, chopped",
        "1 bay leaf",
        "4 cups chicken broth",
        "4 cups water",
        "8 large carrots, cut diagonally into 1-inch-thick pieces",
        "1 pound mushrooms, sliced thin",
        "1/2 stick (1/4 cup) unsalted butter",
        "1/4 cup all-purpose flour",
        "1 cup heavy cream",
        "1 tablespoon fresh lemon juice, or to taste",
        "1/2 cup minced fresh parsley leaves",
        "paprika rice as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Mushroom",
        "Pork",
        "Stew",
        "Carrot",
        "Fall",
        "Winter",
        "Gourmet"
    ],
    "title": "Pork Fricassée with Mushrooms and Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/pork-fricassee-with-mushrooms-and-carrots-13320"
}
