{
    "directions": [
        "Sprinkle the pork with salt and pepper. In a baking dish, mix 1/2 cup of the teriyaki sauce together with the cider vinegar, ginger sauce, orange juice and garlic. Add the pork and coat well with the marinade. Cover and refrigerate for 3 hours or up to 24 hours.",
        "The next day, preheat the oven to 350 degrees F.",
        "Heat the olive oil in a large, heavy skillet. Remove the tenderloins from the marinade and put them in the hot oil. Sear on all sides, then return the pork to the baking dish with the marinade. Add the chopped red onion to the skillet, saute until translucent, then add it to the baking dish. Cover the baking dish loosely with foil and bake for 20 minutes.",
        "In a small bowl, mix together the remaining 1/4 cup teriyaki sauce along with the honey, marmalade, and tomato-vegetable juice. When 20 minutes are up, remove the pork from the oven, remove the foil, and with a very sharp knife cut deep slits into the meat. Pour the honey sauce into these slits and over the meat. Slice the unpeeled oranges into 1/4-inch crosswise pieces and arrange the slices on the top and sides of tenderloins. Return the meat to the oven and bake, uncovered, until the orange slices begin to curl, about 15 additional minutes. Remove the meat from the oven and let stand for 10 minutes before slicing into medallions. Transfer to a platter to serve."
    ],
    "ingredients": [
        "2 pork tenderloins (about 1 pound each)",
        "Kosher salt and freshly ground black pepper",
        "3/4 cup teriyaki sauce",
        "1/4 cup apple cider vinegar",
        "1/4 cup ginger sauce",
        "1/4 cup orange juice",
        "2 cloves garlic, minced",
        "4 tablespoons olive oil",
        "1 medium red onion, coarsely chopped",
        "1/4 cup honey",
        "1/4 cup orange marmalade",
        "1/4 cup tomato-vegetable juice, such as V8",
        "2 oranges"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Meat",
        "Pork",
        "Main Dish Recipes"
    ],
    "title": "Pork Medallions",
    "url": "http://www.foodnetwork.com/recipes/trisha-yearwood/pork-medallions"
}
