{
    "directions": [
        "Cook garlic and shallot in 1 tablespoon oil in a 3-quart heavy saucepan over low heat, stirring occasionally, until softened, 3 to 5 minutes. Add wine and vinegar and boil until reduced to about 1/2 cup, 8 to 10 minutes. Add chicken and veal stocks and boil until reduced to about 1 1/3 cups, 15 to 20 minutes.",
        "Preheat oven to 400°F.",
        "Heat remaining 2 tablespoons oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking. While oil is heating, pat pork chops dry and season with salt and pepper. Sear 3 chops, turning over once, 4 minutes total, then transfer to a shallow baking pan. Sear remaining chops in same manner, then transfer to baking pan (reserving fat in skillet). Roast in middle of oven until an instant-read thermometer inserted horizontally into center of chops (do not touch bone) registers 155°F, 8 to 12 minutes.",
        "While pork is roasting, peel apple and cut into 1/3-inch dice. Pour off all but 1 tablespoon fat from skillet, then cook apple and raisins over moderate heat, stirring occasionally, until apple is golden brown and caramelized but not falling apart, 2 to 3 minutes. Add sauce and simmer, stirring, 1 minute. Season with salt and pepper.",
        "Spoon sauce over pork chops.",
        "Available at some specialty foods shops and Dean & DeLuca (877-826-9246).",
        "** Use stock available at specialty foods shops and butcher shops."
    ],
    "ingredients": [
        "1 tablespoon minced garlic",
        "1 tablespoon minced shallot",
        "3 tablespoons olive oil",
        "1/2 cup dry red wine",
        "1/2 cup apple balsamic vinegar *, or 5 tablespoons cider vinegar mixed with 3 tablespoons balsamic vinegar",
        "1 1/2 cups chicken stock, homemade or store-bought**, but not canned broth",
        "1 cup veal stock, homemade or store-bought**",
        "6 (1-inch-thick) rib pork chops (each about 1/2 pound)",
        "1/2 Granny Smith apple",
        "1/2 cup golden raisins",
        "Accompaniment: blue cheese potato gratin"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Roast",
        "Vinegar",
        "Raisin",
        "Apple",
        "Pork Chop",
        "Red Wine",
        "Fall",
        "Gourmet"
    ],
    "title": "Pork Chops with Apple Balsamic Sauce and Blue Cheese Tomato Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/pork-chops-with-apple-balsamic-sauce-and-blue-cheese-tomato-gratin-107205"
}
