{
    "directions": [
        "Place shrimp in a bowl and pour in enough water to cover; set aside until shrimp are rehydrated, about 10 minutes. Drain.",
        "Mix 1 tablespoon cornstarch and 1 tablespoon water together in a bowl until a smooth paste forms. Mix sugar, soy sauce, and 1 teaspoon salt into cornstarch paste until marinade is well combined. Stir pork into marinade moving the spoon in one direction.",
        "Heat 1 tablespoon peanut oil in a large skillet over high heat; fry shrimp until fragrant, 2 to 3 minutes. Add shrimp to pork mixture, stirring in 1 direction until it reaches a paste-like consistency.",
        "Sprinkle salt over bitter melon and let sit for 5 minutes.",
        "Bring a pot of water to a boil; add bitter melon and cook for 3 minutes. Drain well.",
        "Stuff each bitter melon slice with pork mixture and sprinkle cornstarch evenly over each.",
        "Heat peanut oil in a large skillet over high heat. Reduce heat to medium and fry stuffed bitter melon until brown, 3 to 5 minutes per side. Transfer bitter melon to a serving plate.",
        "Mix 1/2 cup water, oyster sauce, and 1 teaspoon sugar together in a bowl until oyster sauce mixture is smooth.",
        "Heat 1 tablespoon peanut oil in the same skillet over high heat. Cook and stir black bean-garlic sauce, red pepper, and garlic until fragrant, 3 to 4 minutes. Add oyster sauce mixture and stir until heated through, 1 to 2 minutes. Reduce heat to medium; add stuffed bitter melons and simmer, 5 to 6 minutes.",
        "Mix 1 tablespoon cornstarch and 1 tablespoon water together in a small bowl until a smooth paste forms; stir into skillet until sauce is thickened, 1 to 2 minutes."
    ],
    "ingredients": [
        "2 tablespoons chopped dried shrimp",
        "Marinade:",
        "1 tablespoon cornstarch, or more as needed",
        "1 tablespoon water",
        "1 1/2 teaspoons white sugar",
        "1 1/2 teaspoons light soy sauce",
        "1 teaspoon salt",
        "12 ounces ground pork",
        "1 teaspoon peanut oil (groundnut oil)",
        "salt as needed",
        "2 bitter melon, cut into thick rings and cores removed",
        "cornstarch as needed",
        "1 tablespoon peanut oil (groundnut oil)",
        "Sauce:",
        "1/2 cup water",
        "1 tablespoon oyster sauce",
        "1 teaspoon white sugar",
        "1 tablespoon peanut oil (groundnut oil)",
        "3 tablespoons black bean-garlic sauce",
        "1 tablespoon chopped red pepper",
        "1 tablespoon minced garlic",
        "1 tablespoon cornstarch",
        "1 tablespoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pork Stuffed Bitter Melon",
    "url": "http://allrecipes.com/recipe/246184/pork-stuffed-bitter-melon/"
}
