{
    "directions": [
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Arrange pork pieces one layer deep in a large baking pan. Broil, stirring often, until meat is browned, about 10 minutes. Pour off and discard the fat.",
        "Heat vegetable oil in a Dutch oven or large skillet over medium heat. Stir in onions; cook and stir until the onions have softened and turned translucent, about 5 minutes. Add garlic and cook, stirring frequently, until the garlic is fragrant but not brown, 2 minutes more.",
        "Stir in potatoes and cook for 5 minutes. Pour in water, beef bouillon, sliced carrots, chili powder, marjoram, 1/2 teaspoon thyme, bay leaves, nutmeg, 1 teaspoon salt, and pepper. Bring to a boil, then reduce the heat and cover. Simmer until the meat and all of the vegetables are tender, about 3 hours.",
        "To make the Sage-Cornmeal Dumplings: combine flour, cornmeal, sugar, baking powder, sage, 1/4 teaspoon thyme, and 1/2 teaspoon salt in a large bowl. Cut in the shortening until the mixture resembles a coarse meal. Add milk all at once, stirring just until the mixture holds together.",
        "When the stew is ready, remove the bay leaves. Bring the stew to a gentle boil over medium-low heat. Drop the dumplings by rounded spoonfuls evenly over the surface. Cover the pot and boil for 12 minutes, until the dumplings are cooked through. Ladle the dumplings into soup bowls and top with lots of stew."
    ],
    "ingredients": [
        "1 pound boneless country-style pork ribs, cut into 1-inch chunks",
        "2 tablespoons vegetable oil",
        "2 cups chopped onions",
        "2 cloves garlic, crushed",
        "1 1/2 pounds potatoes, peeled and cubed",
        "2 quarts water",
        "2 teaspoons beef bouillon granules",
        "4 large carrots, peeled and cut into 1/2-inch pieces",
        "1 1/2 tablespoons chili powder",
        "1 teaspoon dried marjoram",
        "1/2 teaspoon dried thyme",
        "2 bay leaves",
        "1/8 teaspoon ground nutmeg",
        "1 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "6 tablespoons all-purpose flour, sifted",
        "1/4 cup yellow cornmeal",
        "2 teaspoons white sugar",
        "1 1/2 teaspoons baking powder",
        "1/4 teaspoon dried sage, crumbled",
        "1/4 teaspoon dried thyme",
        "1/2 teaspoon salt",
        "2 tablespoons vegetable shortening",
        "1/2 cup milk, or as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pork Rib Stew with Sage Cornmeal Dumplings",
    "url": "http://allrecipes.com/recipe/89257/pork-rib-stew-with-sage-cornmeal-dump/"
}
