{
    "directions": [
        "In large bowl, combine flour, salt, and 1 cup boiling water. Using wooden spoon, mix until dough forms shaggy ball, then transfer to lightly floured surface and knead until smooth and shiny, 6 to 8 minutes. (Alternatively, mix and knead using electric mixer fitted with dough hook; kneading time will be shorter.) Wrap lightly in plastic wrap and let rest at room temperature 20 minutes.",
        "In large bowl, combine all ingredients. Using hands, gently knead mixture in bowl until just combined. Refrigerate until ready to use.",
        "Line large baking sheet with paper towels and dust lightly with flour. Divide dough into 3 even pieces. On lightly floured surface, using palms of hands, roll each piece into 3/4-inch-diameter log. Using floured knife, cut each log into 1-inch-long sections.",
        "Pinch 1 dough section out into circle, then roll out on floured surface using floured rolling pin to 4-inch-diameter round. Transfer round to baking sheet and repeat with remaining dough sections, stacking rounds in layers on floured paper towels.",
        "Line second large baking sheet with paper towels and dust lightly with flour. Hold 1 wrapper in palm of hand. Using fingertip dippsed in water, gently wet around edge of wrapper. Place 1 heaping tablespoon filling in center of wrapper, then fold wrapper in half without sealing edges, cupping half-moon (open side-up) between thumb and fingers and gently tamping down filling with other hand to keep edge of wrapper free of filling.",
        "Using thumb and forefinger of left hand, begin pinching edges of wrapper together while pushing 1 edge into tiny pleats with thumb of right hand. Continue pleating and pinching across entire semicircle until wrapper is sealed (unpleated side will automatically curve). Set dumpling, sealed edge up, on baking sheet and repeat with remaining wrappers and filling.",
        "In large saucepan with tight-fitting lid, bring 1 1/2 inches water to boil. Lightly oil metal steamer (if using bamboo, line with cabbage leaves to prevent sticking) and set in pan. Arrange dumplings, sealed edges up, on steamer, cover, and steam until filling is firm and wrappers are slightly translucent.",
        "In large lidded nonstick sauté pan over moderately high heat, heat 1 1/2 tablespoons vegetable oil until hot but not smoking. Add 13 to 14 dumplings, pleated sides up and sides not touching, and immediately pour in enough cold water to come halfway up sides of dumplings (use care; oil may splatter). Cover and cook until liquid is evaporated and bottoms of dumplings are crisp and golden, about 10 minutes. (Use spatula to loosen and lift edges to check bottoms; replace lid and continue cooking if necessary, checking after 1 to 2 minutes.) Transfer dumplings, crisp sides up, to platter and keep warm. Repeat with remaining 2 batches of dumplings.",
        "In medium bowl, stir together all ingredients.",
        "Serve dumplings warm with dipping sauce."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "3/4 teaspoon salt",
        "2 teaspoons dried shrimp",
        "2 teaspoons Chinese rice wine, such as Shaoxing, or medium-dry Sherry",
        "6 ounces cabbage (1/4 medium head), roughly chopped",
        "1/2 teaspoon kosher salt",
        "1 pound ground pork",
        "1 bunch golden or green garlic chives, finely chopped (1/2 cup)",
        "2 scallions (green parts only), thinly sliced on the diagonal",
        "1 clove garlic, finely chopped",
        "1/8 teaspoon fresh ginger, finely grated",
        "3 tablespoons soy sauce",
        "1 tablespoon oyster sauce",
        "1 tablespoon sugar",
        "1/2 teaspoon Asian sesame oil",
        "1 large egg, beaten",
        "1/4 teaspoon freshly ground black pepper",
        "1 heaping tablespoon cornstarch",
        "4 1/2 tablespoons vegetable oil",
        "1/4 cup soy sauce",
        "1/3 cup unseasoned rice vinegar",
        "1 teaspoon Sriracha (Southeast Asian chile sauce)",
        "1 scallion (green part only), thinly sliced on the diagonal",
        "Special equipment: 2 large baking sheets; large saucepan or large nonstick skillet with tight-fitting lid; metal or bamboo steamer (if steaming dumplings)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Pork",
        "Steam",
        "Lunch",
        "Lunar New Year",
        "Shrimp",
        "Pan-Fry",
        "Chive",
        "Cabbage",
        "Sesame",
        "Soy Sauce",
        "Sugar Conscious",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Pork and Chive Dumplings with Dried Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/pork-and-chive-dumplings-with-dried-shrimp-241625"
}
