{
    "directions": [
        "Stir together cumin, coriander, pepper, cinnamon, and salt in a shallow bowl. Pat tenderloins dry and dredge in spice mixture until evenly coated.",
        "Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking. Reduce heat to moderate and cook pork, turning occasionally, until meat is browned on all sides and thermometer inserted diagonally into center of each tenderloin registers 145°F, 20 to 25 minutes. Transfer pork with tongs to a cutting board (reserve skillet) and let stand 10 minutes.",
        "While pork stands, pour off and discard any fat from skillet, then add pomegranate juice to skillet and boil over moderately high heat until reduced to about 2/3 cup, about 3 minutes (if side of skillet begins to scorch, reduce heat to moderate). Stir together cornstarch and water and whisk into juice, then boil sauce until thickened slightly, 1 to 2 minutes.",
        "Remove from heat and add Sherry vinegar to taste, then swirl in butter until incorporated. Pour sauce through a fine-mesh sieve into a bowl and skim off any fat. Season with salt. Slice pork and serve with sauce."
    ],
    "ingredients": [
        "3/4 teaspoon ground cumin",
        "3/4 teaspoon ground coriander",
        "3/4 teaspoon black pepper",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon salt",
        "2 pork tenderloins (each about 3/4 pound)",
        "2 tablespoons olive oil",
        "1 cup plain pomegranate juice (such as POM Wonderful)",
        "3/4 teaspoon cornstarch",
        "1 tablespoon water",
        "1 to 2 teaspoons Sherry vinegar",
        "1 tablespoon unsalted butter",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit Juice",
        "Pork",
        "Sauté",
        "Quick & Easy",
        "Dinner",
        "Vinegar",
        "Meat",
        "Pork Tenderloin",
        "Spice",
        "Fall",
        "Healthy",
        "Pomegranate",
        "Cinnamon",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pork Tenderloin with Pomegranate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pork-tenderloin-with-pomegranate-sauce-236404"
}
