{
    "directions": [
        "For the tortilla chips: Heat oil in a deep fryer to 340 to 350 degrees F. Fry the tortillas, in batches, until firm. Drain on paper towels and season immediately with salt. For the new mexican rubbed pork tenderloin: Combine the ancho chili powder, sugar, pasilla chili powder, salt, allspice, chile de arbol, cinnamon and some black pepper in a small bowl. Heat the oil in a medium saute pan over high heat. Sprinkle the pork with salt on both sides, and then dredge in the spice rub, tapping off any excess. Sear the pork on all sides until golden brown, and then continue cooking to medium doneness or when an instant-read thermometer inserted into the center registers 135 to 140 degrees F, 8 to 10 minutes. Transfer to a cutting board and let rest 10 minutes before thinly slicing. For the mornay sauce: Melt the butter in a medium saucepan over medium heat. Whisk in the flour and cook 1 minute. Slowly whisk in 2 cups of the warm milk, bring to a boil and continue whisking until the sauce thickens and the flour taste has been cooked out, about 5 minutes. Remove from the heat and slowly whisk in the Monterey Jack a handful at a time. Continue whisking until smooth, adding more milk if too thick. Whisk in the Parmigiano-Reggiano and season with salt, black pepper and chile de arbol. Set aside. For the avocado-corn relish: Combine the avocado, corn, jalapeno, lime juice, onions and olive oil in a bowl. Season with salt and black pepper, and fold in the cilantro. For the charred jalapenos: Toss the jalapenos with the oil and sprinkle with salt and black pepper. Char in a cast-iron pan over high heat or on a baking sheet in a 400 degrees F oven until the skin is charred on both sides. Let cool before slicing. For assembly: Arrange the tortilla chips on a large platter in a single layer. Top each chip with a heaping teaspoon of the avocado-corn relish, a slice of pork and some of the Mornay sauce. Garnish with the sliced charred jalapenos, pickled red onions, a dollop of the goat cheese and cilantro leaves."
    ],
    "ingredients": [
        "Canola oil, for deep frying",
        "6 blue corn tortillas, cut into strips",
        "6 flour tortillas, cut into quarters",
        "1 tablespoon kosher salt",
        "3 tablespoons ancho chili powder",
        "2 tablespoons light brown sugar",
        "1 tablespoon pasilla chili powder",
        "1 tablespoon kosher salt",
        "2 teaspoons allspice",
        "2 teaspoons chile de arbol",
        "2 teaspoons ground cinnamon",
        "Freshly ground black pepper",
        "2 tablespoons canola oil",
        "1 1/2 pounds pork tenderloin, split in half",
        "2 tablespoons unsalted butter",
        "2 tablespoons all-purpose flour",
        "2 to 2 1/2 cups whole milk, heated",
        "12 ounces Monterey Jack cheese, grated",
        "1/2 cup grated Parmigiano-Reggiano",
        "Kosher salt and freshly ground black pepper",
        "Pinch chile de arbol",
        "2 ripe Hass avocados, diced",
        "2 ears corn, roasted in husks and grilled, kernels removed",
        "1 Charred Jalapeno, seeded and finely diced, recipe follows",
        "Juice of 1 lime",
        "1/2 small red onion, finely diced",
        "Splash olive oil",
        "Salt and freshly ground black pepper",
        "1/4 cup chopped fresh cilantro, for garnish",
        "6 jalapenos",
        "2 teaspoons canola oil",
        "Kosher salt and freshly ground black pepper",
        "Pickled red onions, for garnish",
        "4 ounces soft goat cheese, cut into small pieces",
        "Fresh cilantro leaves, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sauce Recipes",
        "Avocado",
        "Vegetable",
        "Meat",
        "Pork",
        "Corn Recipes",
        "Pork Tenderloin",
        "Jalapeno Recipes",
        "Cheese",
        "Main Dish Recipes"
    ],
    "title": "Pork Tenderloin Nachos with Mornay Sauce, Avocado-Corn Relish, Charred Jalapeno and Goat Cheese",
    "url": "http://www.foodnetwork.com/recipes/bobby-flay/pork-tenderloin-nachos-with-mornay-sauce-avocado-corn-relish-charred-jalapeno-and-goat-cheese-recipe"
}
