{
    "directions": [
        "Preheat oven to 350°F. Heat 3 tablespoons oil in heavy large skillet over high heat. Season pork with salt and pepper. Dredge in 1 cup flour; shake off excess. Working in batches, add pork to skillet and sauté until brown, about 3 minutes per side. Arrange pork in single layer in 15x10x2-inch glass baking dish. Sprinkle 1 teaspoon paprika over pork.",
        "Discard contents of skillet; wipe clean. Add 3 tablespoons oil; heat over medium-high heat. Add onions; sprinkle with sugar and sauté until well browned, stirring often, about 20 minutes. Add garlic; sauté 1 minute. Add 1 tablespoon paprika. Place onions over pork. Pour enough broth over so that chops are almost covered. Cover with foil. Bake until pork is tender, about 45 minutes. (Can be made 1 day ahead. Uncover; cool slightly. Cover; chill. Rewarm covered pork in 350°F. oven, about 20 minutes.)",
        "Reduce oven temperature to 200°F. Using tongs, transfer pork to large bowl, leaving onion mixture in baking dish. Pour contents of baking dish into strainer set over medium bowl. Return onion mixture to same baking dish, spreading evenly (reserve cooking liquid). Arrange pork atop onions; sprinkle cheese. Cover dish with foil; set in oven to keep warm.",
        "Melt butter in heavy large saucepan over medium heat. Add 5 tablespoons flour. Cook, until mixture just begins to color, whisking often (mixture will be dry and crumbly), about 4 minutes. Gradually whisk in reserved cooking liquid. Bring sauce to boil, whisking constantly. Boil until thickened, whisking often, about 5 minutes. Season with salt and pepper.",
        "Transfer pork and onions to plates. Spoon sauce around pork and serve."
    ],
    "ingredients": [
        "6 tablespoons vegetable oil",
        "8 1-inch-thick center cut rib pork chops (each about 8 ounces)",
        "1 cup plus 5 tablespoons all purpose flour",
        "1 teaspoon plus 1 tablespoon Hungarian sweet paprika",
        "8 cups sliced onions (about 4 large)",
        "1 teaspoon sugar",
        "4 teaspoons minced garlic",
        "4 cups (about) canned beef broth",
        "3/4 cup grated smoked Gouda cheese with rind (about 3 ounces)",
        "3 tablespoons butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Bake",
        "Kid-Friendly",
        "Gouda",
        "Pork Chop",
        "Winter"
    ],
    "title": "Pork Chops with Caramelized Onions and Smoked Gouda",
    "url": "http://www.epicurious.com/recipes/food/views/pork-chops-with-caramelized-onions-and-smoked-gouda-2477"
}
