{
    "directions": [
        "Arrange racks in middle and upper thirds of oven; preheat to 450°F. Mix turmeric, salt, pepper, and cumin in a small bowl; set aside.",
        "Using a peeler, slice ribbons off long neck of squash until you have 2 cups ribbons; set aside. Cut remaining squash in half lengthwise; scoop out and discard seeds. Cut squash into 1/2\" half-moons.",
        "Toss squash pieces with 2 Tbsp. coconut oil in a large bowl. Add 1 1/2 tsp. turmeric mixture and toss to coat. Spread squash mixture on a rimmed baking sheet, reserving large bowl, and roast in upper third of oven until golden-brown and tender, about 20 minutes.",
        "Whisk lime juice, honey, and fish sauce in a large bowl. Add squash ribbons and toss to coat; let sit until ready to use.",
        "Meanwhile, rub pork with remaining turmeric mixture in reserved large bowl. Heat remaining 2 Tbsp. coconut oil in a large heatproof skillet (preferably cast iron) over high and sear pork, turning often, until browned on all sides, about 5 minutes. Transfer skillet to center rack in oven and roast, flipping pork halfway through, until an instant-read thermometer inserted into thickest part of tenderloin registers 145°F, 10–12 minutes. Transfer to a cutting board and let rest 5 minutes before slicing.",
        "While pork and squash roast, remove stems from collards. Stack halved leaves into a neat pile. Starting at 1 long side, roll into a tube, then slice at 1/2\" intervals across tube to create ribbons.",
        "Transfer squash ribbons to a plate. Add vegetable oil to dressing and whisk to combine. Using your hands, massage collards in dressing until dark green. Return squash ribbons to bowl and toss to combine.",
        "Divide salad among plates or transfer to a serving platter; top with coconut chips. Serve roasted squash and pork with yogurt alongside."
    ],
    "ingredients": [
        "1 1/2 teaspoons ground turmeric",
        "1 1/2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon ground cumin",
        "1 medium butternut squash (about 2 1/2 pounds), peeled",
        "4 tablespoons coconut oil, warmed, divided",
        "3 tablespoons fresh lime juice",
        "1 tablespoon honey",
        "3 1/2 teaspoons fish sauce",
        "2 small pork tenderloins (about 1 1/2 pounds total)",
        "1 large bunch collard greens (about 12 ounces)",
        "2 tablespoons vegetable or canola oil",
        "1/4 cup toasted coconut chips",
        "1 cup plain Greek yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Quick and Healthy",
        "Pork",
        "Pork Tenderloin",
        "Cumin",
        "Butternut Squash",
        "Collard Greens",
        "Coconut",
        "Yogurt",
        "Roast",
        "Wheat/Gluten-Free",
        "Fall"
    ],
    "title": "Pork Tenderloin With Turmeric, Squash, and Collard Greens Salad",
    "url": "http://www.epicurious.com/recipes/food/views/pork-tenderloin-with-turmeric-squash-and-collard-greens-salad"
}
