{
    "directions": [
        "To make the romesco sauce, in a blender, combine the bell peppers, almonds, bread, garlic, vinegar and red pepper flakes and process until fairly smooth. With the machine running, slowly pour in the extra-virgin olive oil and process until the sauce emulsifies. (The sauce can be made 1 day in advance and refrigerated. Bring to room temperature before using.)",
        "About 30 minutes before you plan to begin grilling, remove the pork chops from the refrigerator. Season the chops generously on both sides with salt and black pepper. Brush both sides with olive oil.",
        "Prepare a medium fire in a grill. Brush and oil the grill grate.",
        "Toss the green onions lightly with olive oil and season with salt. Place the chops on the grill directly over the fire and cook until nicely grill-marked, about 5 minutes. Turn the chops over and add the green onions to the grill. Cook the chops until well marked and cooked to your liking, 5 to 7 minutes more for medium, or until an instant-read thermometer inserted horizontally into the center of a chop, away from the bone, registers 145°F. Transfer the chops to a platter. Turn the green onions over and cook until tender and slightly wilted, about 2 minutes more.",
        "Place the green onions on the platter with the pork chops and serve immediately. Pass the romesco sauce on the side. Serves 6.",
        "Adapted from Williams-Sonoma",
        "Grill Master,",
        "by Fred Thompson (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "1/2 cup roasted red bell peppers",
        "1/3 cup raw almonds",
        "1 slice sourdough bread, crust removed",
        "2 garlic cloves",
        "2 Tbs. red wine vinegar",
        "1/2 tsp. red pepper flakes",
        "1/4 cup extra-virgin olive oil",
        "",
        "6 bone-in center-cut pork loin chops, each about 10 oz. and 1\n  inch thick",
        "Kosher salt and freshly ground black pepper, to taste",
        "Olive oil for brushing",
        "12 green onions, trimmed but left whole"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pork Loin Chops with Romesco Sauce and Grilled Onions",
    "url": "http://www.williams-sonoma.com/recipe/pork-loin-chops-romesco-sauce.html"
}
