{
    "directions": [
        "Char Anaheim chilies over gas flame or in broiler until blackened on all sides. Enclose in plastic bag 10 minutes. Peel, seed and coarsely chop chilies.",
        "Combine broth, 1/2 cup onion, tomatillos, jalapeño and garlic in medium saucepan. Simmer over medium heat until liquid is reduced to 1 cup, about 10 minutes. Transfer to blender. Cool to room temperature. Add Anaheim chilies, cilantro and lime juice. Blend until smooth. Transfer to bowl. Whisk in sour cream. Season with salt and pepper. (Can be made 1 day ahead. Cover; chill.)",
        "Preheat oven to 350°F. Lightly oil 15x10x2-inch baking dish. Place 6 tortillas between 2 damp paper towels. Cook in microwave on high until warm, about 1 minute. Working with 1 warm tortilla at a time, dip tortillas into sauce; shake excess sauce back into bowl. Place tortillas on work surface. Spoon scant 1/4 cup Pork Chili Verde, 2 tablespoons cheese and 1 tablespoon onion down center of each. Roll up tortillas. Arrange enchiladas, seam side down, in dish. Repeat with remaining 6 tortillas. (Can be made 8 hours ahead. Cover enchiladas, remaining sauce and cheese separately. Chill.) Top enchiladas with remaining sauce, then cheese.",
        "Bake enchiladas uncovered until heated through, about 20 minutes (or 30 minutes if enchiladas have been refrigerated). Sprinkle tomatoes over and serve."
    ],
    "ingredients": [
        "2 fresh Anaheim chilies",
        "1 14 1/2 -ounce can low-salt chicken broth",
        "1 1/4 cups chopped onion",
        "4 ounces tomatillos, husked, rinsed, quartered",
        "1 jalapeño chili, seeded, coarsely chopped",
        "1 garlic clove, chopped",
        "1/4 cup chopped fresh cilantro",
        "1 tablespoon fresh lime juice",
        "1/4 cup sour cream",
        "12 6-inch-diameter corn tortillas",
        "Pork Chili Verde , chilled",
        "2 1/4 cups shredded asadero cheese",
        "2 plum tomatoes, seeded, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Pepper",
        "Bake",
        "Dinner",
        "Spring",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pork Chili Verde Enchiladas",
    "url": "http://www.epicurious.com/recipes/food/views/pork-chili-verde-enchiladas-103134"
}
