{
    "directions": [
        "Peel plums, if desired. Halve and pit. Cut into 1/2\" wedges.",
        "Heat oil in a medium saucepan over medium heat. Add shallot and cook, stirring occasionally, until shallot begins to soften, about 2 minutes. Add brown sugar, next 6 ingredients, and 1/4 cup water. Cook, stirring occasionally, until mixture is fragrant, about 2 minutes. Stir in plums. Cover and simmer over medium heat, stirring occasionally, for 8 minutes. Uncover and continue cooking, stirring occasionally, until fruit is soft and juices have thickened, 20-25 minutes. Season to taste with salt. Let cool slightly. DO AHEAD: Chutney can be made 1 week ahead. Cover and chill. Rewarm slightly before serving.",
        "Stir rosemary, herbes de Provence, and oil in a small bowl. Rub all over pork; season with salt and pepper. Wrap pancetta slices around pork and tie at 2\" intervals with kitchen twine to hold together. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "If using a charcoal grill, build a medium-hot fire; push coals over to 1 side of grill. If using a gas grill, heat all but 1 burner to high. Grill tenderloins over hot part of grill, turning frequently, until a crisp brown crust forms on all sides, 8-10 minutes. Move tenderloins to cooler part of grill to gently cook through; cover and cook until an instant-read thermometer inserted into the middle of each loin registers 145°F, 15-20 minutes longer.",
        "Transfer tenderloins to a cutting board. Let rest for 10 minutes. Slice thinly and serve with plum chutney alongside."
    ],
    "ingredients": [
        "4 red or black plums",
        "1 tablespoon olive oil",
        "1 large shallot, sliced lengthwise",
        "1/2 cup (packed) light brown sugar",
        "1/4 cup Sherry vinegar or apple cider vinegar",
        "1 tablespoon chopped garlic",
        "1 tablespoon mustard seeds",
        "2 teaspoons grated peeled ginger",
        "1/2 teaspoon freshly ground black pepper",
        "1 bay leaf",
        "Kosher salt",
        "2 tablespoons minced fresh rosemary",
        "4 teaspoons herbes de Provence",
        "4 teaspoons olive oil",
        "2 pork tenderloins (about 2 pounds)",
        "Kosher salt, freshly ground pepper",
        "16 thin slices pancetta (Italian bacon; about 8 ounces) or prosciutto",
        "Ingredient info: Herbes de Provence, a dried herb mixture, can be found at specialty foods stores and in the spice section of most supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Pork",
        "Backyard BBQ",
        "Dinner",
        "Plum",
        "Meat",
        "Pork Tenderloin",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork Tenderloin with Plum Chutney",
    "url": "http://www.epicurious.com/recipes/food/views/pork-tenderloin-with-plum-chutney-51108390"
}
