{
    "directions": [
        "Place a rack in the upper third of the oven and heat to 400 degrees F.",
        "Whisk the egg and water in a small bowl and set aside. Place the apple rings into the bowl of a mini food processor and process for 30 to 45 seconds or until they are the size of a medium dice. Set aside.",
        "Trim the pork tenderloin of any excess fat and silver skin. Slice the tenderloin down the middle lengthwise, creating 2 separate pieces. Lay the tenderloin pieces next to each other head to tail, so when laid back together they are the same size at the ends.",
        "Lay out a 12 by 16-inch piece of parchment paper on the counter and arrange the pieces of prosciutto in the center, overlapping them enough to create solid layer that is as long as the tenderloin. Top with a second piece of parchment, and using a rolling pin, roll over the prosciutto to help adhere the pieces to each other. Remove the parchment paper and sprinkle the prosciutto with the salt, pepper, and thyme. Set the tenderloin down the middle of the prosciutto. Spread the dried apples in between the 2 pieces of tenderloin and push back together so the apples are held between them. Using the parchment paper to assist, wrap the prosciutto around the tenderloin to completely enclose in a package.",
        "Sprinkle the counter with flour and roll out the pastry to 12 by 14 inches. Spread the mustard thinly in the center of pastry and lay the prosciutto wrapped tenderloin in the center of the pastry on the mustard. Fold the puff pastry up and over the top of the tenderloin, then roll to completely enclose, brushing the edges of the pastry with the egg wash in order to seal. Turn the tenderloin over so the side of the tenderloin with the double thickness of pastry is underneath. Pinch the ends of the pastry to seal.",
        "Brush the entire pastry with the egg wash. Place the tenderloin on a parchment lined half sheet pan and bake for 25 to 30 minutes or until the pork reaches an internal temperature of at least 140 degrees F.",
        "Remove the tenderloin from the oven, transfer to a cooling rack and let rest for 10 minutes before slicing and serving."
    ],
    "ingredients": [
        "1 whole egg",
        "1 tablespoon water",
        "1-ounce dried apple rings",
        "1 whole pork tenderloin, approximately 1 pound",
        "4 1/2 ounces thinly slice prosciutto ham",
        "1/4 teaspoon kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 teaspoon chopped fresh thyme leaves",
        "1 teaspoon all-purpose flour",
        "1 sheet puff pastry, thawed completely",
        "1 tablespoon whole-grain mustard"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Meat",
        "Apple",
        "Fruit",
        "Pork",
        "Main Dish Recipes",
        "Lunch"
    ],
    "title": "Pork Wellington",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/pork-wellington-recipe"
}
