{
    "directions": [
        "Using the tip of a knife, lightly score fatty side of pork; season all over with salt.",
        "Coarsely grind peppercorns, coriander, red pepper flakes, oregano, and mustard seeds in spice mill or with mortar and pestle; set spice mixture aside.",
        "Heat oil in a small saucepan over low heat; add garlic and cook, stirring, until fragrant and barely golden, about 5 minutes. Stir in lemon zest, paprika, and reserved spice mixture. Let marinade cool.",
        "Rub marinade all over pork, working some marinade into interior of roast. Tie pork at 1\" intervals with kitchen twine. Wrap tightly in plastic and chill at least 8 hours.",
        "Let pork sit at room temperature 1 hour.",
        "Preheat oven to 375°F. Unwrap pork, place on a rack set inside a roasting pan, and roast until golden brown and fat has just started to render, 40–50 minutes. Reduce oven temperature to 300°F and continue to roast until meat is very tender, 1 1/2–2 hours longer.",
        "Transfer pork to a cutting board and let rest 30 minutes before slicing.",
        "DO AHEAD: Marinade can be made 1 week ahead; cover and chill. Pork can be seasoned 3 days ahead; keep chilled."
    ],
    "ingredients": [
        "1 skinless, boneless pork shoulder (Boston butt; about 6 pounds)",
        "Kosher salt",
        "1 tablespoon black peppercorns",
        "1 tablespoon coriander seeds",
        "1 tablespoon crushed red pepper flakes",
        "1 tablespoon dried oregano",
        "1 tablespoon yellow mustard seeds",
        "1/2 cup olive oil",
        "6 garlic cloves, peeled, crushed",
        "1 tablespoon finely grated lemon zest",
        "2 teaspoons smoked paprika",
        "Special equipment: A spice mill or mortar and pestle"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Roast",
        "Christmas",
        "Dinner",
        "Meat",
        "Spice",
        "Coffee Grinder",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pork Shoulder Al'Diavolo",
    "url": "http://www.epicurious.com/recipes/food/views/pork-shoulder-aldiavolo-51205450"
}
