{
    "directions": [
        "In a large bowl whisk together the red-wine vinegar, the garlic paste, and the red pepper flakes, add the vegetable oil in a stream, whisking, and whisk the marinade until it is emulsified. Add the pork, stirring to coat it with the marinade, and let it marinate, covered and chilled, for at least 6 hours or overnight.",
        "In a bowl whisk together the ketchup, the distilled vinegar, the sugar, the soy sauce, the salt, and the sesame oil until the sugar is dissolved and reserve the sauce.",
        "Drain the pork, reserving the marinade, and thread it and the pineapple, alternating them, onto the skewers, using 4 pieces of pork and 3 pieces of pineapple on each skewer. Brush the kebabs with some of the reserved marinade and grill them on a rack set 5 to 6 inches over glowing coals, basting them for the first 10 minutes with the reserved marinade and turning them, for 20 to 25 minutes, or until the pork is just cooked through but still juicy. Brush the kebabs with the reserved sweet-and sour sauce and grill them, turning them, for 2 minutes more. (Discard any remaining marinade; do not serve it as an accompaniment.)"
    ],
    "ingredients": [
        "2 tablespoons red-wine vinegar",
        "1 garlic clove, minced and mashed to a paste with 1/2 teaspoon salt",
        "1 tablespoon dried hot red pepper flakes",
        "1/4 cup vegetable oil",
        "1 1/2 pounds boneless trimmed pork shoulder or pork loin, cut into forty 1-inch pieces",
        "1/4 cup ketchup",
        "2 tablespoons distilled vinegar",
        "2 tablespoons sugar",
        "2 teaspoons soy sauce",
        "1/2 teaspoon salt",
        "1/4 teaspoon Oriental sesame oil",
        "a 4-pound pineapple, peeled, cored, and cut into thirty 3/4-inch-thick wedges",
        "ten 10-inch wooden skewers, soaked in water for 30 minutes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Marinate",
        "Low Cal",
        "Pineapple",
        "Grill",
        "Chill",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Pork and Pineapple Kebabs with Sweet-and-Sour Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pork-and-pineapple-kebabs-with-sweet-and-sour-sauce-11981"
}
