{
    "directions": [
        "In a bowl, toss the pork with the salt. Cover and refrigerate for at least overnight or up to 3 days.",
        "To make the soffritto, soak the currants in just enough warm water to cover for about 20 minutes.",
        "Meanwhile, add the pine nuts and 1/2 cup of the olive oil to a small, heavy pot and place over low heat. Gradually bring to a low simmer, stirring frequently, and cook, stirring, for about 5 minutes, or until the pine nuts have started to brown. Stir in the garlic and continue to cook on low heat for about 8 minutes, or until the garlic is a light golden brown. Watch the soffritto carefully; the pine nuts and garlic will burn easily. Drain the currants, add them to the pot, and then remove the pot from the heat. Let the soffritto cool to room temperature. It will keep, tightly covered, in the refrigerator for 2 weeks.",
        "About 30 minutes before cooking, remove the pork from the refrigerator. If using wooden skewers, soak them in water to cover to prevent them from scorching. Prepare a hot fire in a grill, stacking the coals to one side so you have two areas of heat, one with direct heat and one with indirect heat.",
        "Drizzle the remaining 1 tablespoon olive oil over the pork and toss to coat evenly. Drain the skewers, and thread about 5 pieces of pork onto each skewer.",
        "Place the skewers over the coals and grill for about 1 minute on each side, or until well seared. Move the skewers to the cooler side of the grill and continue to cook over indirect heat for 8 to 10 minutes, until cooked medium-well but still juicy.",
        "Arrange a bed of arugula on a platter. Place the pork skewers on top. Drizzle some of the soffritto over the top of the pork and the arugula. Pass the remaining sauce at the table. Serve immediately."
    ],
    "ingredients": [
        "2 pounds boneless pork loin, cut into 1-inch cubes",
        "About 1 tablespoon kosher salt",
        "1/2 cup dried currants",
        "3/4 cup pine nuts",
        "1/2 cup plus 1 tablespoon extra-virgin olive oil",
        "2/3 cup garlic cloves, minced",
        "3 ounces arugula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Nut",
        "Pork",
        "Pine Nut",
        "Summer",
        "Grill/Barbecue",
        "Simmer",
        "Advance Prep Required"
    ],
    "title": "Pork Loin Spiedino with Pine Nut, Garlic, and Currant Soffritto",
    "url": "http://www.epicurious.com/recipes/food/views/pork-loin-spiedino-with-pine-nut-garlic-and-currant-soffritto-363373"
}
