{
    "directions": [
        "Bring 4 quarts water to boil in large pot. Add beans. Boil 3 minutes. Remove pot from heat, cover, and let stand 1 hour. Drain; return beans to pot. Using kitchen string, tie parsley, thyme, and bay leaves in double layer of cheesecloth; add to pot. Add remaining 4 quarts water, pancetta, onion, garlic, salt, and pepper to beans; bring to boil. Reduce heat, cover, and simmer over medium-low heat until beans are just tender, 1 to 1 1/2 hours.",
        "Drain beans, reserving 2 cups cooking liquid. Discard herb bundle, onion, and garlic. Transfer pancetta to work surface (reserve pancetta for wine sauce).",
        "Heat olive oil in heavy large saucepan over medium-high heat. Add onions to pot and sauté until tender and beginning to brown, about 5 minutes. Add wine; boil until liquid is reduced by half, stirring occasionally, about 6 minutes. Add reserved juices from confit. Bring to boil; reduce heat to medium and simmer 15 minutes.",
        "Meanwhile, cut reserved pancetta into 1/2-inch cubes. Heat heavy medium skillet over medium-high heat; add pancetta and sauté until beginning to turn brown and crisp, about 4 minutes. Using slotted spoon, transfer pancetta to wine sauce. Add Winter Tomato Sauce to pot; season to taste with salt and pepper.",
        "Preheat oven to 400°F. Heat 2 heavy large skillets over medium heat. Divide sausages among skillets; cover and cook until brown and cooked through, turning occasionally, about 20 minutes. Transfer sausages to work surface. Cool slightly, then cut into 2-inch pieces.",
        "Spoon 1/3 of beans (about 4 cups) into 8-quart ovenproof pot, spreading in even layer. Arrange half of confit and half of sausages over beans. Pour 1/3 of wine sauce (about 2 1/3 cups) over meat. Spoon half of remaining beans (about 4 cups) over sauce. Arrange remaining confit and sausages over beans. Pour half of remaining sauce over meat (about 2 1/3 cups). Spoon remaining beans over sauce, then pour remaining sauce over beans. (Can be prepared 2 days ahead. Cover cassoulet and reserved cooking liquid separately and chill. Let stand at room temperature 2 hours before continuing.) Drizzle enough reserved bean cooking liquid over beans to barely submerge if needed. Sprinkle breadcrumbs over. Drizzle breadcrumbs with olive oil.",
        "Bake cassoulet uncovered until bubbling around edges and crumbs are beginning to brown, about 1 hour.",
        "Emergo beans can be purchased through chefshop.com, and heirloom French horticultural beans can be purchased through beanbag.net. If you can't find them, Great Northern beans or cannellini (white kidney beans) will also work."
    ],
    "ingredients": [
        "8 quarts water, divided",
        "2 pounds dried beans, such as Emergo beans or French horticultural beans (about 5 cups)",
        "12 fresh parsley sprigs",
        "6 large fresh thyme sprigs",
        "4 bay leaves",
        "1 8-ounce piece pancetta (Italian bacon; about 1 inch thick)",
        "1 medium onion, skin on",
        "1 whole garlic head, skin on",
        "2 teaspoons coarse kosher salt",
        "2 teaspoons ground black pepper",
        "2 tablespoons olive oil",
        "2 cups chopped onions",
        "2 cups dry white wine",
        "Thawed reserved juices from Pork Confit plus additional low-salt chicken broth (if needed) to measure 2 cups total",
        "4 cupsWinter Tomato Sauce",
        "3 pounds sweet Italian sausages",
        "Pork Confit (see recipe)",
        "2 cups coarse fresh breadcrumbs",
        "1/4 cup olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Onion",
        "Pork",
        "Tomato",
        "Sauté",
        "Sausage",
        "White Wine",
        "Winter",
        "Thyme",
        "Parsley"
    ],
    "title": "Pork Cassoulet with Pork Confit and Winter Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pork-cassoulet-with-pork-confit-and-winter-tomato-sauce-233500"
}
