{
    "directions": [
        "Heat a dry small heavy skillet over medium heat until hot, then toast chiles, turning and pressing with tongs, until more pliable and slightly changed in color, about 30 seconds. Stem chiles.",
        "Purée 1 chile (reserve remainder for salsa) in a blender with pineapple, vinegar, oil, garlic, oregano, cumin, and 1 3/4 tsp salt, then transfer to a bowl.",
        "Preheat broiler.",
        "Oil a small baking pan, then add tomatoes and onion. Broil 4 to 6 inches from heat, turning occasionally, until tomatoes are wilted, skins are blistered, and onions begin to soften and are charred in spots, 16 to 18 minutes. Transfer to blender. Add remaining 2 toasted chiles, water, and 1 tsp salt and purée until smooth. Add cilantro and 1/2 cup pineapple basting sauce and pulse until cilantro is finely chopped.",
        "Prepare grill for direct-heat cooking over medium-hot charcoal (medium-high heat for gas).",
        "Toss pork with half of remaining pineapple basting sauce, then thread pork, onion, and pineapple onto skewers, leaving small spaces between pieces. Put on a tray. Wrap tortillas in 2 separate foil packages.",
        "Oil grill rack, then grill skewers, covered only if using a gas grill, turning and basting frequently with remaining sauce (do not baste during last 3 minutes), until pork is cooked through, 8 to 10 minutes. Transfer to a platter and keep warm, covered.",
        "Heat tortillas (in foil) on grill, turning once, until warmed through, about 3 minutes total.",
        "Remove pork, pineapple, and onion from skewers. Serve wrapped in tortillas with salsa and other accompaniments."
    ],
    "ingredients": [
        "3 dried chiles de árbol, wiped clean",
        "1 cup chopped fresh pineapple",
        "1/2 cup distilled white vinegar",
        "2 tablespoons vegetable oil",
        "2 large garlic cloves, smashed",
        "1 teaspoon dried oregano",
        "1/2 teaspoon ground cumin",
        "1 pound tomatoes (4 medium), halved",
        "1 small white onion (6 to 8 ounces), quartered",
        "3 tablespoons water",
        "1/4 cup chopped cilantro",
        "2 pounds boneless pork shoulder, cut into 1 1/2-inch chunks",
        "1 large white onion, cut into 1 1/2-inch pieces",
        "3 cups (1-inch) chunks fresh pineapple",
        "16 (6-inch) corn tortillas",
        "Equipment: 12 (12-inch) wooden skewers, soaked in water 30 minutes",
        "Accompaniments: fresh cilantro; lime wedges; thinly sliced radishes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Fruit",
        "Pork",
        "Tomato",
        "Marinate",
        "Backyard BBQ",
        "Dinner",
        "Pineapple",
        "Hot Pepper",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Cilantro",
        "Tortillas",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pork Kebabs al Pastor",
    "url": "http://www.epicurious.com/recipes/food/views/pork-kebabs-al-pastor-242628"
}
