{
    "directions": [
        "Heat oil in large nonstick skillet over medium-high heat. Add pork, serrano chili, chili powder, cumin, cinnamon and allspice to skillet and stir 3 minutes. Add raisins and lime juice; boil until almost all liquid evaporates, about 1 minute. Remove from heat. Mix in almonds and sour cream. Season with salt and pepper. Cool.",
        "Butter 2 large baking sheets. Mix flour, Masa Harina, baking powder and salt in large bowl. Stir in melted butter. Whisk water and 1 egg in small bowl to blend. Add to flour mixture; knead in bowl until smooth pliable dough forms, about 2 minutes. Working with half of dough at a time, roll out on floured surface to 1/8-inch thickness. Using 3 3/4-inch-diameter biscuit cutter, cut out rounds. Reroll scraps and cut out additional rounds for a total of 12 rounds per dough half.",
        "Whish remaining egg in small bowl to blend. Place 1 tablespoon filling in center of each dough round. Lightly brush edges with egg. Fold dough over, pressing edges with fork to seal. Place on prepared baking sheets. (Can be made 1 day ahead. Cover with plastic wrap; chill.)",
        "Preheat oven to 375°F. Brush empanadas with beaten egg. Bake until light golden brown, about 25 minutes. Serve with Chipotle Salsa and sour cream."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 12-ounce pork tenderloin, trimmed, cut into 1/3-inch pieces",
        "1 jalapeño chili, minced",
        "2 teaspoons chili powder",
        "2 teaspoons ground cumin",
        "1 1/2 teaspoons ground cinnamon",
        "1 teaspoon ground allspice",
        "1/2 cup golden raisins",
        "1/4 cup fresh lime juice",
        "6 tablespoons chopped toasted almonds",
        "3 tablespoons sour cream",
        "1 1/2 cups all purpose flour",
        "1 cup Masa Harina (corn tortilla mix)*",
        "1 teaspoon baking powder",
        "1 teaspoon salt",
        "1/2 (1 stick) unsalted butter, melted, cooled",
        "1/2 cup plus 1 tablespoon water",
        "2 large eggs",
        "Chipotle Salsa (see recipe)",
        "Sour cream",
        "*Available at Latin American markets and many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Appetizer",
        "Bake",
        "Raisin",
        "Pork Tenderloin",
        "Almond",
        "Sour Cream",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pork Picadillo Empañadas with Chipotle Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/pork-picadillo-empanadas-with-chipotle-salsa-696"
}
