{
    "directions": [
        "Heat butter and 1 tablespoon oil in a 12-inch heavy skillet over medium heat until foam subsides. Cook shallots and garlic with 1/4 teaspoon salt and 1/8 teaspoon pepper, stirring occasionally, until pale golden, about 5 minutes.",
        "Add wine and boil until reduced by half. Add cream, 1/2 cup water, sage, 1/4 teaspoon salt, and 1/8 teaspoon pepper and bring just to a boil. Add green beans and simmer, tightly covered, stirring occasionally, until beans are tender and liquid is slightly thickened, 20 to 25 minutes. Transfer to a bowl and keep warm, covered.",
        "Clean skillet, then heat remaining 2 tablespoons oil in skillet over medium-high heat until it shimmers. Pat pork dry and season with 1/2 teaspoon salt and 1/4 teaspoon pepper, then cook, turning once, until lightly browned and just cooked through, about 4 minutes total. Transfer pork to a plate. Pour off oil in skillet. Return skillet to medium-high heat and add remaining tablespoon water, stirring and scraping up brown bits. Stir in bean mixture and meat juices from plate and heat over medium heat. Stir in parmesan.",
        "Serve pork over green beans."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "3 tablespoons extra-virgin olive oil, divided",
        "3 to 4 large shallots, thinly sliced lengthwise (1 cup)",
        "2 garlic cloves, smashed",
        "2/3 cup dry white wine",
        "2/3 cup heavy cream",
        "1/2 cup plus 1 tablespoon water, divided",
        "2 teaspoons finely chopped sage",
        "2 (12-ounces) packages frozen frenched green beans (do not thaw)",
        "4 (1/2-to 3/4-inch-thick) boneless pork cutlets or chops (1 to 1 1/4 pounds total; preferably sirloin)",
        "1/2 cup grated parmesan",
        "Garnish: chopped flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauté",
        "Quick & Easy",
        "Father's Day",
        "Dinner",
        "Parmesan",
        "Pork Chop",
        "Green Bean",
        "Simmer",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork Cutlets with Smothered Parmesan Green Beans",
    "url": "http://www.epicurious.com/recipes/food/views/pork-cutlets-with-smothered-parmesan-green-beans-351850"
}
