{
    "directions": [
        "Oil large rimmed baking sheet. Whisk Dijon mustard, olive oil and thyme in small bowl to blend. Sprinkle pork tenderloins with salt and pepper. Heat heavy large nonstick skillet over high heat. Add pork and sear until brown all over, turning occasionally, about 10 minutes. Transfer seared pork to prepared baking sheet. Spread Dijon mustard mixture over all sides of pork. (Can be prepared up to 2 hours ahead. Refrigerate pork uncovered.)",
        "Preheat oven to 425°F. Roast pork until thermometer inserted into thickest part of meat registers 150°F, about 30 minutes. Remove from oven and let stand 5 minutes.",
        "Melt 1 tablespoon butter in heavy small saucepan over medium heat. Add 1 tablespoon flour and whisk 1 minute. Gradually whisk in whipping cream, white wine and chicken broth. Boil until mixture is thick enough to coat spoon, whisking frequently, about 1 minute. Add crumbled Gorgonzola and whisk until cheese is melted and smooth and sauce is reduced to desired consistency, about 5 minutes.",
        "Slice pork and transfer to plates. Ladle some sauce over pork. Serve, passing additional sauce separately."
    ],
    "ingredients": [
        "1/4 cup Dijon mustard",
        "1 tablespoon olive oil",
        "1 tablespoon dried thyme",
        "2 3/4-pound pork tenderloins",
        "1 tablespoon butter",
        "1 tablespoon all purpose flour",
        "1 cup whipping cream",
        "1/4 cup dry white wine",
        "1/4 cup canned low-salt chicken broth",
        "1 cup crumbled Gorgonzola cheese (about 4 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Cheese",
        "Mustard",
        "Pork",
        "Roast",
        "New Year's Eve",
        "Blue Cheese",
        "Pork Tenderloin",
        "White Wine",
        "Winter"
    ],
    "title": "Pork with Gorgonzola Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pork-with-gorgonzola-sauce-104590"
}
