{
    "directions": [
        "Preheat oven to 350°F. Heat 2 teaspoons oil in heavy large skillet over medium-high heat. Add mushrooms; sauté until beginning to soften, about 2 minutes. Add 2 tablespoons broth. Cover skillet; cook until mushrooms are beginning to brown, stirring occasionally, about 5 minutes. Uncover; simmer until any juices evaporate. Transfer to bowl. Add 2 teaspoons oil and onion to same skillet. Cover; cook until onion browns, stirring occasionally, about 8 minutes; add to mushrooms.",
        "Sprinkle pork with salt and pepper. Add to skillet; sauté over medium-high heat until brown, about 3 minutes per side. Remove from heat. Transfer pork to 13 x 9 x 2-inch glass baking dish. Add 3/4 cup broth, then brandy and herbs to skillet. Place over medium-high heat. Boil until reduced by half, scraping up browned bits, about 6 minutes. Pour over pork. Cover.",
        "Bake pork until tender, about 25 minutes. Spoon mushrooms and onion over. Cover; bake 5 minutes longer."
    ],
    "ingredients": [
        "4 teaspoons olive oil",
        "3/4 pound assorted wild mushrooms (such as portobello, crimini and stemmed shiitake), sliced",
        "2 tablespoons plus 3/4 cup canned low-salt chicken broth",
        "1 large onion, thinly sliced into rounds",
        "4 1-inch-thick pork rib chops",
        "1/2 cup brandy",
        "1/2 teaspoon dried rubbed sage",
        "1/2 teaspoon dried rosemary"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Mushroom",
        "Onion",
        "Pork",
        "Bake",
        "Dinner",
        "Meat",
        "Pork Chop",
        "Winter",
        "Sugar Conscious",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork Chops with Wild Mushrooms and Caramelized Onions",
    "url": "http://www.epicurious.com/recipes/food/views/pork-chops-with-wild-mushrooms-and-caramelized-onions-4623"
}
