{
    "directions": [
        "Bring 6 cups water, 1/4 cup kosher salt, 1/4 cup brown sugar, whole allspice, and bay leaves to boil in large saucepan, stirring to dissolve salt and brown sugar. Cool brine completely in refrigerator; add pork chops and refrigerate overnight.",
        "Heat olive oil in heavy large saucepan over medium-high heat. Add sliced red onion and sauté 2 minutes. Stir in bay leaf, sage sprig, and dried crushed red pepper. Add sliced red cabbage and cook until wilted and crisptender, stirring often, about 10 minutes. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Preheat oven to 300°F. Remove pork chops from brine; pat dry. Season lightly with salt and generously with ground black pepper. Heat olive oil in heavy large ovenproof skillet over high heat. Cook pork chops in skillet until browned, about 3 minutes per side. Transfer skillet to oven and cook until thermometer inserted horizontally into pork chops registers 145°F, about 7 minutes. Transfer pork to plate (do not clean skillet). Add chicken broth, beef broth, thyme sprig, sage leaves, rosemary sprig, and parsley sprig to skillet and boil until liquid is reduced to 1/2 cup, about 9 minutes. Discard herbs. Whisk in 1 teaspoon chopped sage and 1 tablespoon butter. Keep warm.",
        "Rewarm cabbage. Stir in remaining 2 tablespoons butter and 2 tablespoons red wine vinegar. Season to taste with salt and pepper.",
        "Divide cabbage among plates. Place 1 pork chop on each plate. Drizzle pork with sauce and serve."
    ],
    "ingredients": [
        "6 cups water",
        "1/4 cup coarse kosher salt",
        "1/4 cup (packed) golden brown sugar",
        "8 whole allspice",
        "2 bay leaves",
        "4 1- to 1 1/4-inch-thick pork rib chops",
        "3 tablespoons olive oil",
        "3/4 cup thinly sliced red onion",
        "1 bay leaf",
        "1 large fresh sage sprig",
        "1/4 teaspoon dried crushed red pepper",
        "6 cups thinly sliced red cabbage (about 1/2 of large head)",
        "1 tablespoon olive oil",
        "1 cup low-salt chicken broth",
        "1 cup beef broth",
        "1 large fresh thyme sprig",
        "2 fresh sage leaves plus 1 teaspoon chopped fresh sage",
        "1 large fresh rosemary sprig",
        "1 fresh parsley sprig",
        "3 tablespoons butter, divided",
        "2 tablespoons red wine vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Vegetable",
        "Sauté",
        "Dinner",
        "Pork Chop",
        "Cabbage",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork Chops with Sauteed Red Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/pork-chops-with-sauteed-red-cabbage-239849"
}
