{
    "directions": [
        "Char poblano chiles and bell pepper directly over flame or in broiler until blackened on all sides. Transfer chiles and bell pepper to large bowl; cover and let steam 10 minutes. Peel, seed, and coarsely chop chiles and bell pepper.",
        "Stir cumin seeds and coriander seeds in small dry skillet over medium heat until fragrant and slightly darker in color, about 3 minutes. Remove seeds from heat and cool completely. Finely grind toasted seeds in spice mill or in mortar with pestle. Transfer to small bowl and set aside.",
        "Coarsely puree thawed corn kernels in processor. Cover and refrigerate corn puree until ready to use.",
        "Heat 1 tablespoon vegetable oil in heavy large pot over medium-high heat. Sprinkle pork with coarse salt and pepper. Working in batches, add pork to pot and sauté until brown on all sides, about 8 minutes. Using slotted spoon, transfer pork to medium bowl. Add remaining 1 tablespoon oil to pot, then add chopped onions and sauté until tender, about 5 minutes. Add ground spice mixture, garlic, jalapeño, and oregano; stir 1 minute. Return pork and any accumulated juices to pot. Add chicken broth, scraping up any browned bits. Add salsa verde and bring to boil. Reduce heat; cover partially and simmer 30 minutes. Add chopped chiles, chopped bell pepper, and half of corn puree to pork mixture; cover partially and simmer until pork is very tender, stirring occasionally, about 1 hour 15 minutes longer. Season pie filling to taste with coarse salt and pepper. DO AHEAD: _Pie filling can be made 1 day ahead. Cool slightly. Chill uncovered until cold, then cover and keep refrigerated. Rewarm pie filling, stirring over medium heat, before continuing._Transfer pie filling to 10-inch-diameter 2 1/2-inch-deep ovenproof skillet (preferably cast-iron). Stir in chopped cilantro.",
        "Preheat oven to 400°F. Whisk flour, yellow cornmeal, baking powder, salt, and chili powder in large bowl to blend. Whisk remaining corn puree, whole milk, melted butter, egg, and honey in medium bowl to blend. Add corn puree mixture to flour mixture and stir just until blended. Stir in 1/2 cup grated cheddar cheese. Sprinkle remaining 3/4 cup cheddar cheese over pie filling in skillet. Drop cornbread batter by large spoonfuls atop pie filling. Spread cornbread batter evenly to cover pie filling completely.",
        "Bake tamale pie until cornbread topping is deep golden brown and tester inserted into center comes out clean, 30 to 40 minutes. Serve tamale pie hot, passing sour cream alongside.",
        "Often called pasillas; available at some supermarkets and at specialty foods stores, farmers' markets, and Latin markets."
    ],
    "ingredients": [
        "12 ounces fresh poblano chiles* (about 4 large)",
        "1 large green bell pepper",
        "1 1/2 teaspoons cumin seeds",
        "1 teaspoon coriander seeds",
        "1 10-ounce package frozen corn kernels, thawed",
        "2 tablespoons vegetable oil or olive oil, divided",
        "1 1/2 pounds trimmed boneless country-style pork ribs, cut into 1-inch cubes",
        "Coarse kosher salt",
        "2 cups chopped white onions",
        "3 garlic cloves, minced",
        "1 1/2 tablespoons minced seeded jalapeño chiles",
        "1 tablespoon dried oregano",
        "1 cup low-salt chicken broth",
        "1 cup purchased salsa verde (tomatillo salsa)",
        "1/3 cup coarsely chopped fresh cilantro",
        "3/4 cup all purpose flour",
        "3/4 cup yellow cornmeal (preferably whole-grain stone-ground)",
        "1 teaspoon baking powder",
        "3/4 teaspoon salt",
        "3/4 teaspoon chili powder",
        "3/4 cup whole milk",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "1 large egg",
        "1 tablespoon honey",
        "1 1/4 cups (packed) coarsely grated sharp cheddar cheese (about 5 ounces), divided",
        "Sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Roast",
        "High Fiber",
        "Dinner",
        "Cheddar",
        "Hominy/Cornmeal/Masa",
        "Chile Pepper"
    ],
    "title": "Pork and Poblano Tamale Pie",
    "url": "http://www.epicurious.com/recipes/food/views/pork-and-poblano-tamale-pie-357537"
}
