{
    "directions": [
        "Season the pork chops with salt and pepper; sprinkle all over with 1 1/2 tablespoons flour. Heat 1/2 tablespoon olive oil in a large nonstick skillet over medium-high heat. Working in 2 batches, add the chops and cook until golden and just cooked through, 3 to 4 minutes per side, adding 1/2 tablespoon olive oil to the skillet between batches. Transfer the chops to a plate and keep warm.",
        "Heat the remaining 1/2 tablespoon olive oil in the same skillet; add the mushrooms, garlic, scallion whites and a pinch of salt and cook, without stirring, until the mushrooms begin to brown, about 3 minutes. Sprinkle in the remaining 1/2 tablespoon flour and cook, stirring occasionally, until the mushrooms are soft, about 3 more minutes. Stir in the chicken broth and sour cream, bring to a simmer and cook until the gravy thickens, about 1 more minute.",
        "Divide the pork chops among plates. Drizzle any juices from the pork into the gravy; stir in the scallion greens and parsley. Season with salt and pepper; spoon over the pork. Serve with cornbread.",
        "Photograph by Christopher Testani"
    ],
    "ingredients": [
        "4 1/2-inch-thick bone-in pork chops (2 to 2 3/4 pounds), fat trimmed",
        "Kosher salt and freshly ground pepper",
        "2 tablespoons all-purpose flour",
        "1 1/2 tablespoons extra-virgin olive oil",
        "12 ounces cremini or white mushrooms, thinly sliced",
        "3 cloves garlic, thinly sliced",
        "1 bunch scallions, whites sliced, greens cut into 2-inch pieces",
        "1/2 cup low-sodium chicken broth",
        "2 tablespoons low-fat sour cream",
        "3/4 cup chopped fresh parsley",
        "Cornbread, for serving (optional)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Gravy",
        "Meat",
        "Pork",
        "Main Dish Recipes"
    ],
    "title": "Pork Chops With Mushroom Gravy",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/pork-chops-with-mushroom-gravy-recipe"
}
