{
    "directions": [
        "1 Remove the bones from the pork chops. Using a meat mallet, carefully pound the pork chops until they are uniformly 1/4 inch thick. Season the pork chops with salt and pepper. Dip each chop into the beaten eggs, allowing excess to drip off. Dredge each chop in the bread crumbs and set on a plate.",
        "2 In a 14- to 16-inch sauté pan, heat 1/4 cup of the olive oil over medium heat until just smoking. Add the butter and allow it to foam for 10 to 15 seconds. Place the chops in the pan and cook until light golden brown on one side, about 5 minutes. Using tongs, carefully turn the chops and cook on the other side until light golden brown, about 5 more minutes. Add more oil if necessary, 1/2 tablespoon at a time, to avoid scorching the breading.",
        "3 In a large bowl, combine the arugula and tomatoes. Add the remaining 3 tablespoons of olive oil, the lemon juice, and salt and pepper and toss to coat the greens.",
        "4 Place one pork chop on each of four warmed dinner plates. Divide the arugula salad evenly among the plates, place a lemon wedge on each plate, and serve immediately."
    ],
    "ingredients": [
        "4 center-cut pork chops, 1 inch thick",
        "Kosher salt and freshly ground black pepper",
        "2 extra-large eggs, lightly beaten",
        "1 cup fresh bread crumbs, lightly toasted",
        "1/4 cup plus 3 tablespoons extra-virgin olive oil",
        "1 tablespoon unsalted butter",
        "1 bunch of arugula, stems removed",
        "1/2 pound teardrop tomatoes, halved lenghtwise",
        "1 tablespoon fresh lemon juice",
        "1 lemon, cut into 4 wedges, seeds removed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Pork",
        "Tomato",
        "Sauté",
        "Spring",
        "Pan-Fry"
    ],
    "title": "Pork Chop Milanese with Arugula and Teardrop Tomatoes",
    "url": "http://www.epicurious.com/recipes/food/views/pork-chop-milanese-with-arugula-and-teardrop-tomatoes-107558"
}
