{
    "directions": [
        "Peel garlic and reserve 2 whole cloves, then slice remaining cloves. Combine sliced garlic, pork, water, and broth in a 7- to 8-quart heavy pot and bring to a boil, skimming froth. Add oregano, then reduce heat and simmer, uncovered, skimming occasionally, until pork is very tender, about 1 1/2 hours.",
        "Meanwhile, discard stems from chiles (do not seed), then soak in boiling-hot water (1 1/2 cups) in a bowl, turning occasionally, until softened, about 30 minutes (do not drain). Purée chiles with soaking water, onion, 2 teaspoons salt, and reserved garlic cloves in a blender until smooth, about 1 minute.",
        "Transfer pork with tongs to a large bowl, reserving broth in pot. Shred pork, using 2 forks (discard bones). Return pork to broth, then add hominy, chile purée, and remaining teaspoon salt and simmer, uncovered, skimming froth and stirring occasionally, 30 minutes. Season with salt. 3Serve pozole in shallow bowls with accompaniments.",
        "*Available at Latino markets and kitchenmarket.com."
    ],
    "ingredients": [
        "1 large head garlic",
        "4 lb country-style pork ribs (not lean)",
        "12 cups cold water",
        "4 cups reduced-sodium chicken broth (32 fl oz)",
        "1 teaspoon dried oregano (preferably Mexican), crumbled",
        "6 dried New Mexico or guajillo red chiles* (2 oz)",
        "1 1/2 cups boiling-hot water",
        "1 cup coarsely chopped white onion (1 large)",
        "1 tablespoon salt",
        "4 (15-oz) cans white hominy (also called pozole), drained and rinsed",
        "Accompaniments: fried tortilla strips (see cooks' note, below); 1/2-inch cubes of California avocado; thinly sliced cabbage or lettuce; chopped white onion; chopped radishes; lime wedges; crumbled dried oregano (preferably Mexican); dried hot red pepper flakes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Garlic",
        "Onion",
        "Pepper",
        "Pork",
        "Hominy/Cornmeal/Masa",
        "Simmer",
        "Gourmet"
    ],
    "title": "Pork and Hominy Stew with Red Chiles",
    "url": "http://www.epicurious.com/recipes/food/views/pork-and-hominy-stew-with-red-chiles-233550"
}
