{
    "directions": [
        "Finely grind coriander seeds in grinder. Stir together ground coriander and 2 tablespoons water in a small bowl.",
        "Coarsely purée shallots and garlic in mini processor, scraping down side occasionally. Heat oil in a 6- to 7-quart wide heavy pot over moderately high heat until hot but not smoking, then cook shallot purée with cinnamon stick, stirring occasionally and scraping up any brown bits, until pale golden, 4 to 5 minutes. Add coriander mixture, mashed soybean sauce, sugar, and cloves and cook, stirring, 2 minutes. Increase heat to high, then add pork and cook, stirring occasionally, until pork is no longer pink on the outside, 2 to 3 minutes. Add soy sauce and remaining 5 cups water and bring to a boil, stirring occasionally. Reduce heat and simmer, partially covered, until meat is tender, 1 1/2 to 1 3/4 hours.",
        "Meanwhile, blanch bamboo shoots in a large saucepan of boiling water 1 minute, then drain well in a colander. Stir bamboo shoots into braised pork and simmer, uncovered, until tender, about 15 minutes. (Liquid should be reduced to about 2 cups. If necessary, transfer pork and bamboo shoots with a slotted spoon to a bowl and boil liquid to reduce, then stir in pork and bamboo shoots.) Discard cinnamon stick and season with salt."
    ],
    "ingredients": [
        "3 tablespoons coriander seeds, toasted and cooled",
        "5 cups plus 2 tablespoons water",
        "3/4 cup chopped shallots (3 large)",
        "8 garlic cloves, chopped",
        "1/4 cup vegetable oil",
        "1 (3 1/2- to 4-inch) cinnamon stick",
        "3 tablespoons yellow soybean sauce, mashed with back of a spoon to a coarse paste",
        "2 tablespoons sugar",
        "1/2 teaspoon ground cloves",
        "2 1/2 lb boneless pork shoulder (sometimes called pork butt; in 1 or 2 solid pieces), cut into 1 1/2-inch cubes",
        "1 tablespoon dark soy sauce",
        "1 (1 1/4-lb) can sliced bamboo shoots, drained and rinsed",
        "Special equipment: an electric coffee/spice grinder; a mini food processor",
        "Garnish: 3 (5 1/2-inch) fresh Holland red chiles, halved lengthwise, seeded, and thinly sliced; 1 cup fresh cilantro sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Garlic",
        "Pork",
        "Appetizer",
        "Braise",
        "Winter",
        "Shallot",
        "Soy Sauce",
        "Coriander",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Pork Braised in Dark Soy Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pork-braised-in-dark-soy-sauce-234658"
}
