{
    "directions": [
        "Heat 2 tablespoons olive oil in heavy large skillet over medium-high heat. Add 1 teaspoon crushed fennel seeds and stir until fragrant, about 30 seconds. Reduce heat to medium-low. Stir in sliced fennel and onion and sauté until vegetables are very tender and caramelized, about 40 minutes. Add 1 tablespoon minced garlic and sauté until tender, about 5 minutes. Season with salt and pepper. (Fennel mixture can be prepared 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 450°F. Heat 1 tablespoon olive oil in another heavy large skillet over high heat. Season pork tenderloins with salt and pepper. Add pork to skillet; cook until brown on all sides, about 10 minutes. Transfer pork to baking sheet; reserve drippings in skillet. Roasts pork until thermometer inserted into center registers 150°F, about 5 minutes. Remove pork from oven; cover with foil and keep warm.",
        "Meanwhile, add minced shallots and remaining 1 teaspoon crushed fennel seeds and 1 tablespoon garlic to skillet with drippings and sauté over medium heat until shallots are tender, about 2 minutes. Increase heat to high. Add white wine and boil until liquid is reduced to glaze, about 2 minutes. Add chicken broth and whipping cream and boil until reduced to sauce consistency, whisking often, about 5 minutes. Season sauce to taste with salt and pepper.",
        "Rewarm fennel mixture over medium heat until heated through. Divide fennel mixture among 4 plates. Cut pork into 1/2-inch-thick rounds. Arrange pork atop fennel. Spoon sauce over pork. Garnish with fennel fronds."
    ],
    "ingredients": [
        "3 tablespoons olive oil",
        "2 teaspoons fennel seeds, crushed",
        "2 medium fennel bulbs, quartered, cored, thinly sliced",
        "1 large onion, thinly sliced",
        "2 tablespoons minced garlic",
        "2 12-ounce pork tenderloins, trimmed, each cut crosswise in half",
        "3 large shallots, minced",
        "1/2 cup dry white wine",
        "1 1/2 cups canned low-salt chicken broth",
        "1/2 cup whipping cream",
        "Fennel fronds"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Onion",
        "Pork",
        "Vegetable",
        "Roast",
        "Pork Tenderloin",
        "Fennel",
        "Fall"
    ],
    "title": "Pork Tenderloin with Sauteed Onion and Fennel and Fennel Cream",
    "url": "http://www.epicurious.com/recipes/food/views/pork-tenderloin-with-sauteed-onion-and-fennel-and-fennel-cream-1049"
}
