{
    "directions": [
        "Put the potatoes and garlic in a saucepan, cover with cold water and season with salt. Cover and bring to a boil, then uncover and continue cooking until tender, about 15 minutes. Cover and set aside.",
        "Meanwhile, rub both sides of the pork chops with the sage, and salt and pepper to taste. Heat a large cast-iron skillet over high heat, then add 1 teaspoon olive oil and sear the chops until golden on both sides, about 5 minutes total. Transfer to a plate. Wipe out the skillet and add the remaining 2 teaspoons olive oil. Add the onion and apples and cook over medium-high heat until lightly browned, about 5 minutes. Season with salt and pepper and stir in the cider.",
        "Return the chops to the skillet. Cover and cook, turning once, until just cooked through, 4 to 5 minutes. Drain the potatoes, reserving 1/4 cup liquid. Return the potatoes to the pan; add the buttermilk and mash, adding cooking liquid as needed. Season with salt and pepper. Serve with the pork chops, onion and apples. Drizzle with the pan juices.",
        "Photograph by Antonis Achilleos"
    ],
    "ingredients": [
        "1 pound small fingerling potatoes",
        "2 cloves garlic",
        "Kosher salt",
        "4 1/2-inch-thick boneless pork loin chops (5 ounces each)",
        "2 teaspoons chopped fresh sage",
        "Freshly ground pepper",
        "1 tablespoon extra-virgin olive oil",
        "1 large red onion, cut into 1/2-inch wedges",
        "2 Granny Smith apples, cut into 1/2-inch pieces",
        "3/4 cup apple cider",
        "1/4 cup buttermilk"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Healthy Dinner",
        "Healthy",
        "Pork Chop",
        "Potato",
        "Vegetable",
        "Apple",
        "Fruit",
        "Meat",
        "Pork"
    ],
    "title": "Pork Chops With Apples and Garlic Smashed Potatoes",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/pork-chops-with-apples-and-garlic-smashed-potatoes-recipe"
}
