{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Grease an 8x10-inch casserole dish.",
        "Make 1/2-inch slits in pork roast using a sharp knife. Slice 2 garlic cloves; place garlic slices into the slits in pork roast.",
        "Place mushrooms in the bottom of the prepared casserole dish. Sprinkle parsley, thyme, salt, and pepper over mushrooms; grate remaining garlic clove with a microplane grater over mushrooms.",
        "Heat olive oil in a large skillet over medium-high heat; place pork in hot skillet and cook, turning, until lightly browned on all sides, about 5 minutes. Transfer pork to the casserole dish.",
        "Stir white wine and chicken stock together in a cup; pour into the skillet and bring to a boil while scraping the browned bits of food off the bottom of the skillet with a wooden spoon. Pour wine mixture over pork.",
        "Roast in the preheated oven until pork is slightly pink in the center, about 50 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Transfer roast to a warm serving dish; cover to keep warm.",
        "Pour drippings with mushroom mixture into a saucepan; bring to a boil and cook until liquid is reduced by half. Stir cornstarch into water until smooth; pour into drippings and cook until thickened, about 3 minutes. Slice pork roast and serve with mushroom pan sauce."
    ],
    "ingredients": [
        "1 (3 pound) boneless pork loin roast, trimmed of fat",
        "3 cloves garlic, divided",
        "8 small baby bella mushrooms, roughly chopped",
        "1/2 teaspoon dried parsley",
        "1/4 teaspoon dried thyme",
        "salt and ground black pepper to taste",
        "1 teaspoon olive oil",
        "1/2 cup dry white wine",
        "1/2 cup chicken broth",
        "1 teaspoon cornstarch, or as needed",
        "1/2 cup water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pork Loin Roast with Baby Bellas",
    "url": "http://allrecipes.com/recipe/247371/pork-loin-roast-with-baby-bellas/"
}
