{
    "directions": [
        "Whisk rice wine and cornstarch together in large bowl. Add ground pork, 2 tablespoons green onion, soy sauce, ginger, sesame oil, and sugar; stir until well combined and paste-like, about 10 minutes. Cover and refrigerate for 1 hour.",
        "Place about 1 tablespoon pork mixture in the middle of a wonton wrapper. Brush edges with beaten egg and pinch edges to seal, creating a small pouch. Repeat with remaining wonton wrappers and pork mixture. Refrigerate until ready to use.",
        "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add bok choy, snap peas, carrot, and 2 tablespoons green onion, cover, and steam until tender, 2 to 6 minutes. Remove and distribute evenly among 4 soup bowls.",
        "Place wontons in steamer basket and steam until pork is no longer pink inside, about 10 minutes. Remove and place in soup bowls alongside vegetables.",
        "Heat chicken broth and water in a saucepan until hot, 5 to 7 minutes. Pour hot broth mixture evenly into soup bowls atop vegetables and wontons. Sprinkle 1/4 cup chopped green onion evenly over each bowl."
    ],
    "ingredients": [
        "1 tablespoon rice wine",
        "1/2 teaspoon cornstarch",
        "3/4 pound ground pork",
        "2 tablespoons finely chopped green onion (white and light green parts)",
        "1 tablespoon soy sauce",
        "1 teaspoon minced fresh ginger",
        "1 teaspoon sesame oil",
        "1 teaspoon white sugar",
        "salt to taste",
        "25 wonton wrappers",
        "1 egg, beaten",
        "3 heads bok choy, sliced",
        "10 sugar snap peas, sliced",
        "1 carrot, thinly sliced",
        "2 tablespoons finely chopped green onion (white and light green parts)",
        "2 cups chicken broth",
        "1 cup water",
        "1/4 cup finely chopped green onion (white and light green parts)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pork Wonton Soup",
    "url": "http://allrecipes.com/recipe/231306/pork-wonton-soup/"
}
