{
    "directions": [
        "Place the pork chops between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the pork with the smooth side of a meat mallet to a thickness of 1/8-inch. Trim any fat from the edges, and make a few small slits along the edge to prevent the pork from curling during cooking.",
        "Combine the flour, 1 teaspoon salt, and pepper in a bowl. Whisk the egg and milk together in another bowl until well blended, then mix the panko bread crumbs and paprika together in a third bowl. Dredge the pork chops in the flour mixture one at a time, then dip them into the egg mixture followed by the panko mixture.",
        "Heat the vegetable oil in a large skillet over medium-high heat. Arrange no more than two pork chops in the skillet at a time, cooking until the meat is golden brown no longer pink in the center, 3 to 4 minutes on each side.  Place the pork chops in a warm oven to keep warm.",
        "Pour the chicken stock into the skillet used to cook the pork. Reduce the heat to low, and scrape up any brown bits in the bottom of the pan. As the stock simmers, mix the dill, 1/2 teaspoon salt, and sour cream together in a bowl. Whisk about 1/4 cup of the hot stock into the sour cream mixture, then pour it back into the skillet. Heat until warm and thick, about 5 minutes. Serve with the pork chops."
    ],
    "ingredients": [
        "4 (4 ounce) boneless pork chops",
        "1/4 cup flour",
        "1 teaspoon salt",
        "1/4 teaspoon freshly ground black pepper",
        "1 egg, beaten",
        "2 tablespoons milk",
        "3/4 cup panko bread crumbs",
        "1 teaspoon ground paprika",
        "1/4 cup vegetable oil",
        "3/4 cup chicken stock",
        "2 teaspoons chopped fresh dill",
        "1/2 teaspoon salt",
        "1/2 cup sour cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pork Schnitzel with Dipping Sauce",
    "url": "http://allrecipes.com/recipe/216908/pork-schnitzel-with-dipping-sauce/"
}
