{
    "directions": [
        "Put oven rack in lower third of oven and preheat oven to 375°F.",
        "Halve pork loin crosswise, then pat dry and sprinkle with 1 teaspoon salt and 3/4 teaspoon pepper (total). Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then brown pork, 1 piece at a time, turning occasionally, 6 to 8 minutes per piece. Transfer to a small flameproof roasting pan as browned (do not clean skillet) and roast pork until thermometer inserted diagonally at least 2 inches into meat registers 150°F, 40 to 50 minutes.",
        "While pork roasts, peel, quarter, and core apples, then cut into 1/4-inch-thick wedges. Pour off all but 1 tablespoon fat from skillet, then cook onion in skillet over moderate heat, stirring occasionally, until softened, 3 to 5 minutes. Add apples, prunes, broth, and water and simmer, uncovered, stirring occasionally, until apples are tender, 10 to 12 minutes. Stir in cream and mustard and simmer until sauce is slightly thickened, 2 to 3 minutes. Remove from heat and keep sauce warm, partially covered.",
        "Transfer pork to a cutting board and let stand 10 minutes. Add wine to roasting pan and boil over high heat, stirring and scraping up brown bits, until reduced to about 1/4 cup, 2 to 3 minutes. Stir pan juices into cream sauce along with remaining 3/4 teaspoon salt and remaining 3/4 teaspoon pepper and heat sauce over moderate heat, stirring, until hot.",
        "Discard string from pork and cut each half crosswise into 4 slices. Serve pork with sauce."
    ],
    "ingredients": [
        "1 (4-lb) boneless pork loin roast, tied by butcher",
        "1 3/4 teaspoons salt",
        "1 1/2 teaspoons black pepper",
        "1 tablespoon olive oil",
        "2 Granny Smith apples (3/4 lb total)",
        "1 large onion, chopped",
        "1/2 cup packed dried pitted prunes (sometimes called dried plums; 4 1/2 ounces), quartered",
        "1 1/2 cups low-sodium chicken broth (12 ounces)",
        "3/4 cup water",
        "1/2 cup heavy cream",
        "2 tablespoons coarse-grain mustard",
        "1/2 cup dry white wine",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Mustard",
        "Pork",
        "Roast",
        "Sauté",
        "Prune",
        "Apple",
        "Pork Tenderloin",
        "Winter",
        "Simmer",
        "Gourmet"
    ],
    "title": "Pork Loin with Apples, Prunes, and Mustard Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pork-loin-with-apples-prunes-and-mustard-cream-sauce-109114"
}
