{
    "directions": [
        "Mix first 8 ingredients in a large bowl. Add pork and toss to coat. Cover and chill, tossing occasionally, at least 8 hours or overnight.",
        "Heat 2 tablespoons oil in a large heavy pot over medium-high heat. Working in batches, brown pork on all sides, lowering heat if meat begins to scorch, about 5 minutes per batch. Using tongs, transfer pork to a medium bowl. Add remaining 1 tablespoon oil and onions to pot; sauté until slightly softened and golden brown, about 5 minutes. Add wine; cook, scraping up browned bits, until reduced by half, about 2 minutes. Add broth; return pork to pot.",
        "Reduce heat to low, cover pot, and simmer, stirring occasionally, until pork is tender, about 2 hours. Reserve 3/4 cup braising liquid for radicchio. Set pork in remaining liquid aside. DO AHEAD: Can be made 2 days ahead. Chill pork and reserved 3/4 cup braising liquid separately (uncovered) until cold, then cover and keep chilled. Rewarm before serving.",
        "Heat 1 tablespoon oil in a large skillet over medium-high heat. Working in batches, add radicchio and sauté on each cut side, adding more oil to pan between batches if needed, until browned, 2-3 minutes per side; transfer radicchio to a plate. Place all cooked radicchio back in skillet and add reserved pork-braising liquid. Cover and cook until crisp-tender, about 3 minutes. Add 2 tablespoons vinegar; bring to a simmer and cook, uncovered, until juices have thickened, about 1 minute. Season to taste with salt and pepper.",
        "Toss arugula, remaining 3 tablespoons oil, and lemon juice in a large bowl. Season to taste with salt and pepper.",
        "Divide pork with juices among plates. Arrange radicchio alongside. Divide arugula salad among plates. Drizzle radicchio with oil and a small amount of vinegar."
    ],
    "ingredients": [
        "1 tablespoon kosher salt",
        "1 tablespoon (packed) dark brown sugar",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon freshly ground black pepper",
        "1/4 teaspoon ground cinnamon",
        "1/4 teaspoon cayenne pepper",
        "1/8 teaspoon ground cloves",
        "1 3 1/2-3 3/4-pound boneless pork shoulder (Boston butt), trimmed, cut into",
        "1 1/2\"-2\" cubes",
        "3 tablespoons olive oil, divided",
        "4 cups sliced onions (about 2 large onions)",
        "1 1/2 cups fruity white wine (such as Pinot Gris or Chenin Blanc)",
        "2 cups low-salt chicken broth",
        "4 tablespoons (plus more) extra-virgin olive oil, divided, plus more for drizzling",
        "2 heads of Treviso radicchio, each cut into 6 wedges with some core attached",
        "2 tablespoons aged balsamic vinegar plus more for drizzling",
        "Kosher salt and freshly ground black pepper",
        "3 cups (lightly packed) arugula",
        "1 tablespoon fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Sauté",
        "Dinner",
        "Vinegar",
        "Simmer",
        "Radicchio",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork Shoulder with Treviso Radicchio and Balsamic Vinegar",
    "url": "http://www.epicurious.com/recipes/food/views/pork-shoulder-with-treviso-radicchio-and-balsamic-vinegar-394711"
}
