{
    "directions": [
        "Pat pork chop dry with paper towels. Mix salt, pepper, and sugar in a small bowl; sprinkle all over pork. Place pork on a wire rack set inside a rimmed baking sheet so it’s resting on its side with bone sticking upright and chill, uncovered, at least 8 hours and up to 1 day.",
        "Let pork chop sit at room temperature at least 1 hour for even roasting.",
        "Preheat oven to 300°F. Heat a large skillet, preferably cast iron, over medium-high. Rub chop all over with oil and carefully place in skillet; reserve rack and baking sheet. Cook chop, turning every minute or so, until deeply browned on both sides, 5–8 minutes. Turn on its side and sear edges and fat cap until browned, about 3 minutes total. Transfer back to rack, place in oven, and roast until a thermometer inserted into the center of chop about 1\" from bone registers 130°F, 25–35 minutes (use a probe thermometer if you’ve got one, or use an instant-read thermometer and check every few minutes after pork has been roasting 20 minutes). Transfer pork to a cutting board; let rest 15–20 minutes.",
        "While the pork is resting, whisk egg yolk, garlic, vinegar, mustard, and honey in a medium bowl. Gradually add 1/2 cup oil, whisking until dressing is emulsified (it should be the consistency of heavy cream). Season with kosher salt and pepper.",
        "Toss lettuce, frisée, celery root, apple, Pecorino, and almonds in a large bowl; season with kosher salt and pepper. Add about three-quarters of dressing and toss to coat; add more dressing to taste and season with more kosher salt and pepper.",
        "Use a thin-bladed knife to cut pork chop away from rib bone, then cut between bones to separate into 2 ribs (or don’t, and greedily eat both bones in the kitchen before serving others, because you’re the cook and you deserve it). Slice chop 1/2\" thick, drizzle with oil, and sprinkle with sea salt. Serve with salad."
    ],
    "ingredients": [
        "1 double-cut pork chop (1 1/2–2 pounds)",
        "1 tablespoon Diamond Crystal or 1 1/2 teaspoons Morton kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1/2 teaspoon sugar",
        "2 tablespoons olive oil",
        "1 large egg yolk",
        "1 garlic clove, finely grated",
        "1/4 cup red wine vinegar",
        "1 tablespoon Dijon or horseradish mustard",
        "1 teaspoon honey",
        "1/2 cup olive oil, plus more for drizzling",
        "Kosher salt, freshly ground pepper",
        "8 cups torn red leaf lettuce (from about 1 head)",
        "4 cups torn frisée (from about 1 head)",
        "1/2 small celery root (celeriac), peeled, cut into matchsticks (about 2 cups)",
        "1 apple, cut into matchsticks",
        "2 ounces Pecorino, shaved",
        "1/2 cup chopped smoked almonds",
        "Flaky sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Pork Chop",
        "Apple",
        "Fall",
        "Winter",
        "Dinner",
        "Lettuce",
        "Salad",
        "Almond",
        "Wheat/Gluten-Free"
    ],
    "title": "Pork Chop With Apple and Celery Root Salad",
    "url": "http://www.epicurious.com/recipes/food/views/pork-chop-with-apple-and-celery-root-salad"
}
