{
    "directions": [
        "Pat chops dry with paper towels. Mix 2 teaspoons coarse salt, thyme, rosemary, and 1 teaspoon pepper in small bowl. Sprinkle seasoning mixture on both sides of chops. Let stand at room temperature 1 to 2 hours or wrap and chill up to 1 day.",
        "Heat heavy large skillet over medium heat. Add bacon and sauté until crisp and lightly browned. Using slotted spoon, transfer bacon to small bowl. Increase heat to medium-high. Add chops to skillet. Sear until brown, 4 to 5 minutes per side. Transfer chops to small baking sheet.",
        "Pour off all but 3 tablespoons drippings from skillet (or add olive oil to make 3 tablespoons). Add leeks and sauté until soft, about 7 minutes. Add garlic and stir 1 minute. Add brandy, then broth and bring to boil, scraping up browned bits. Return bacon to skillet; add sage and stir to blend.",
        "Nestle chops in leeks in skillet. Reduce heat to medium-low. Cover; simmer 3 minutes. Turn chops over. Cover; simmer until thermometer inserted into thickest part of chops registers 140°F to 145°F, about 3 minutes longer. Transfer chops to platter. Tent loosely with foil to keep warm.",
        "Spoon off any fat from cooking liquid in skillet. Boil until all liquid evaporates, about 3 minutes. Whisk in mustard, then crème fraîche (do not boil). Season with salt and pepper. Spoon over chops."
    ],
    "ingredients": [
        "4 1 1/2- to 2-inch-thick bone-in heritage pork rib chops",
        "2 teaspoons coarse kosher salt",
        "2 teaspoons chopped fresh thyme",
        "1 teaspoon finely chopped fresh rosemary",
        "1 teaspoon freshly ground black pepper",
        "2 bacon slices, coarsely chopped",
        "Olive oil (optional)",
        "4 cups thinly sliced leeks (white and pale green parts only; about 3 large)",
        "3 garlic cloves, minced",
        "1/4 cup brandy",
        "1 cup low-salt chicken broth",
        "2 teaspoons finely chopped fresh sage",
        "2 tablespoons Dijon mustard",
        "1/3 cup créme fraîche or sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mustard",
        "Marinate",
        "Sauté",
        "Father's Day",
        "Dinner",
        "Pork Chop",
        "Leek",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork Chops with Leeks in Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pork-chops-with-leeks-in-mustard-sauce-352613"
}
