{
    "directions": [
        "Preheat the oven to 325 degrees F.",
        "Heat a large Dutch oven over medium-high heat. Liberally season all sides of the shanks with salt and pepper. Add 2 tablespoons of the oil to the pan and sear the shanks until golden brown on all sides, about 5 minutes a side. Transfer to a plate.",
        "Add the remaining tablespoon of oil to the Dutch oven, then add the carrots, celery and onions. Season with salt and pepper and saute until the vegetables are slightly soft and browned, about 8 minutes. Add the tomato paste and garlic and saute until fragrant, about 30 second. Add the wine to deglaze, scraping all the bits off the bottom. Add the shanks, any accumulated juices, the warm stock, tomatoes and bay leaves. Cover, transfer to the oven and cook until the shanks are extremely fork-tender, about 2 hours. Remove the shanks and tent with foil on a plate.",
        "If the braising liquid is a bit thin, right before serving, simmer the remaining liquid until thickened slightly, 5 to 10 minutes. Add additional salt and pepper if necessary.",
        "For each serving, put a ladle of Creamy Polenta in a shallow bowl, followed by a warm shank with a ladle of rich braising liquid, then top with the fresh Gremolata.",
        "Bring 6 cups water to a rolling boil in a heavy-bottomed 4-quart saucepan over medium-high heat. Reduce the heat to the lowest possible setting, add 1 1/2 teaspoons salt and pour the cornmeal into the water in a very slow stream from a measuring cup, all the while whisking in a circular motion to prevent lumps.",
        "Cover and cook, vigorously stirring the polenta with a wooden spoon for about 10 seconds once every 5 minutes and making sure to scrape clean the bottom and corners of the pot, until the polenta has lost its raw cornmeal taste and becomes soft and smooth, about 30 minutes. Stir in the cream, butter, cheese and salt and pepper to taste.",
        "Mix the parsley, lemon zest, orange zest and garlic together in a bowl and season with salt and pepper."
    ],
    "ingredients": [
        "Four 8-ounce pork shanks, tied with twine",
        "Kosher salt and freshly cracked black pepper",
        "3 tablespoons vegetable oil",
        "2 carrots, diced",
        "2 stalks celery, diced",
        "2 yellow onions, diced",
        "1 tablespoon tomato paste",
        "4 cloves garlic, minced",
        "2 cups dry white wine",
        "2 cups warm chicken stock",
        "One 14.5-ounce can crushed tomatoes",
        "2 bay leaves",
        "Creamy Polenta, recipe follows",
        "Gremolata, recipe follows",
        "Kosher salt and freshly cracked black pepper",
        "1 1/2 cups medium-grind stone-ground cornmeal",
        "1/3 cup heavy cream",
        "4 tablespoons (1/2 stick) cold unsalted butter",
        "1/4 cup grated Parmigiano-Reggiano",
        "1 cup fresh parsley, minced",
        "2 teaspoons lemon zest",
        "1 teaspoon orange zest",
        "2 cloves garlic, grated on a rasp grater",
        "Kosher salt and freshly cracked black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Polenta Recipes",
        "Tomato",
        "Vegetable",
        "Meat",
        "Pork",
        "Beef",
        "Main Dish Recipes"
    ],
    "title": "Pork Shank Osso Buco with Polenta and Gremolata",
    "url": "http://www.foodnetwork.com/recipes/jeff-mauro/pork-shank-osso-buco-with-polenta-and-gremolata"
}
