{
    "directions": [
        "Simmer apricots, prunes, and Port in a small heavy saucepan, covered, 5 minutes. Remove from heat and let stand 10 minutes.",
        "Cook onion and shallot in butter in a 12-inch heavy skillet over medium heat, stirring occasionally, until softened, 4 to 5 minutes. Add apple and 1/2 teaspoon each of salt and pepper and cook, stirring occasionally, until apple is just tender, about 5 minutes. Stir in apricot mixture and cool.",
        "Preheat oven to 500°F with rack in middle.",
        "Make a pocket in center of roast by making a horizontal 1 1/2-inch-wide cut into 1 end of roast with a long thin knife, repeating from opposite end so pocket runs all the way through. Then make a vertical cut through center (forming a cross) to widen pocket. Push about 1 cup stuffing into pocket using a long-handled wooden spoon (you may need to stuff from both sides if roast is long). Reserve remaining stuffing for sauce.",
        "Season roast with 1 1/2 teaspoons salt and 1/2 teaspoon pepper and put in a large flameproof roasting pan. Wrap with bacon, between rib bones, tucking ends under roast. Roast pork 20 minutes, then reduce oven to 325°F and roast until an instant-read thermometer inserted 2 inches into center of roast (do not touch bone or stuffing) registers 155°F, 1 1/4 to 1 1/2 hours total.",
        "Transfer roast to a cutting board, reserving pan, and let stand, loosely covered with foil, 15 to 20 minutes. (Temperature of meat will rise to about 160°F; meat will be slightly pink.)",
        "Skim fat from pan drippings and reserve 1 1/2 tablespoons fat. Straddle pan across 2 burners and add Port to drippings, then deglaze pan by boiling over high heat, stirring and scraping up brown bits, 1 minute. Strain pan juices through a fine-mesh sieve into a bowl, discarding solids.",
        "Cook shallot in reserved fat in a heavy medium saucepan over medium heat, stirring occasionally, until softened, about 3 minutes. Stir in pan juices, 1 1/4 cups water, and reserved fruit stuffing and bring to a simmer. Whisk together arrowroot and remaining 1/4 cup water until smooth, then whisk into sauce with any juices from cutting board.",
        "Simmer sauce, whisking occasionally, until slightly thickened, about 5 minutes. Season with salt and pepper.",
        "Carve roast into chops by cutting between ribs, then serve with sauce."
    ],
    "ingredients": [
        "1/4 pound California dried apricots, cut into 1/2-inch pieces",
        "1/4 pound pitted prunes, cut into 1/2-inch pieces",
        "2/3 cup ruby Port",
        "1 medium onion, finely chopped",
        "1 small shallot, finely chopped",
        "3/4 stick unsalted butter",
        "1 tart apple such as Granny Smith, peeled and cut into 1/2-inch pieces",
        "1 (6-pound) bone-in pork loin roast (10 ribs), frenched, at room temperature 1 hour",
        "9 or 10 bacon slices",
        "1/2 cup ruby Port",
        "1 small shallot, finely chopped",
        "1 1/2 cups water, divided",
        "2 teaspoons arrowroot"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Roast",
        "Christmas",
        "Dinner",
        "Dried Fruit",
        "Pork Tenderloin",
        "Port",
        "Winter",
        "Christmas Eve",
        "Gourmet",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork Roast with Winter Fruits and Port Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pork-roast-with-winter-fruits-and-port-sauce-350938"
}
