{
    "directions": [
        "Stir water, kosher salt, bay leaves, allspice, and black peppercorns in medium bowl until salt dissolves for brine. Arrange pork chops in 13 x 9 x 2-inch baking dish. Pour brine over. Cover and refrigerate 1 hour, turning occasionally.",
        "Remove top rack from barbecue. Place 1 aluminum pan in center of lower grill rack for drip pan. Light briquettes in chimney; carefully pour onto lower grill rack, forming piles on either side of drip pan. Drain wood chips; scatter wood chips evenly over coals. Return top grill rack to barbecue.",
        "Remove top grill rack from barbecue. Prepare barbecue (medium heat). If using 2-burner grill, light 1 burner. If using 3-burner grill, do not light center burner. Drain wood chips. Stack 2 mini loaf pans (one inside the other); fill with 1 cup wood chips. Stack remaining loaf pans; fill with 1 cup wood chips. Place pans directly on flame (if using 3-burner grill, place both pans on 1 lit side). Place aluminum baking pan on unlit portion of grill. Return top grill rack to barbecue.",
        "Grill onion quarters until browned (skin may burn), about 3 minutes per side. Cool and peel. Thinly slice and place in bowl. Add orange juice and lime juice. Season onion mixture to taste with salt. Mix in chopped cilantro.",
        "Remove pork from brine; pat dry, then grill covered over drip pan until cooked through, 4 to 6 minutes per side. Transfer to plate; let rest 10 minutes.",
        "Arrange cabbage on platter. Top with pork, avocado, and radishes. Drain onion; scatter over pork and vegetables. Sprinkle chopped cilantro leaves over. Serve with warm corn tortillas."
    ],
    "ingredients": [
        "2 cups water",
        "3 tablespoons coarse kosher salt",
        "2 bay leaves",
        "1 teaspoon whole allspice",
        "1 teaspoon whole black peppercorns",
        "4 large bone-in rib pork chops",
        "1 11 3/4 x 8 1/2 x 1 1/4-inch disposable aluminum baking pan (to catch drips)",
        "2 cups wood chips, soaked in water 1 hour",
        "4 6 x 3 3/4 x 2-inch disposable mini aluminum loaf pans (for wood chips, if using gas grill)",
        "1 large white onion with skin, quartered through core with some core still attached to each piece",
        "1/2 cup fresh orange juice",
        "1/2 cup fresh lime juice",
        "1/4 cup coarsely chopped fresh cilantro plus 1/4 cup fresh cilantro leaves",
        "1/2 small green cabbage, thinly sliced",
        "1 avocado, halved, pitted, peeled, sliced",
        "1 bunch red radishes, trimmed, sliced",
        "Warm corn tortillas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Low Cal",
        "High Fiber",
        "Backyard BBQ",
        "Dinner",
        "Pork Chop",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork Chops Yucatán-Style",
    "url": "http://www.epicurious.com/recipes/food/views/pork-chops-yucatan-style-359769"
}
