{
    "directions": [
        "Chill pork in freezer while making lemongrass paste. Combine lemongrass, 1/2 teaspoon salt, and remaining ingredients in processor; pulse until paste forms. Add chilled pork; pulse to blend. Shape into 24 balls (each about 1 tablespoonful). Place on rimmed baking sheet. Cover; chill at least 1 hour and up to 1 day.",
        "Cut bottom 3 inches from lemongrass. Smash with rolling pin, then mince. Measure 1 tablespoon and place in small bowl (reserve the rest for another use). Add lime juice, fish sauce, cilantro, carrot, sugar, and chile to bowl; whisk until sugar dissolves.",
        "Heat oil in large skillet over medium heat. Add meatballs; brown until cooked through, turning occasionally, about 15 minutes. Transfer to 1 side of large platter.",
        "Arrange lettuce leaves and cucumber on platter with meatballs. Allow guests to place meatballs in leaves, garnish with cucumber, and drizzle dipping sauce over."
    ],
    "ingredients": [
        "1 pound ground pork",
        "1 lemongrass stalk, bottom 5 inches only, smashed with rolling pin, then minced",
        "1/4 cup chopped shallots",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons fish sauce (such as nam pla or nuoc nam)",
        "2 garlic cloves, chopped",
        "1 tablespoon vegetable oil",
        "1 teaspoon sugar",
        "1/2 teaspoon ground white pepper",
        "1 lemongrass stalk",
        "1/4 cup fresh lime juice",
        "1/4 cup fish sauce",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons coarsely grated carrot",
        "4 teaspoons (packed) golden brown sugar",
        "2 teaspoons minced green Thai chile or serrano chile with seeds",
        "2 tablespoons vegetable oil",
        "1 head of butter lettuce, leaves separated",
        "1 small persian cucumber, thinly sliced",
        "Ingredient info: Fish sauce can be found in the Asian foods section of many supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Appetizer",
        "Low Cal",
        "Dinner",
        "Healthy",
        "Lemongrass",
        "Lettuce",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork and Lemongrass Meatballs in Lettuce Cups",
    "url": "http://www.epicurious.com/recipes/food/views/pork-and-lemongrass-meatballs-in-lettuce-cups-363971"
}
