{
    "directions": [
        "Preheat the oven to 400°F.",
        "Rub the flesh of the squash with 1 tablespoon of the ghee or oil and season with a couple of pinches of sea salt and black pepper. On a baking sheet, place the squash halves, flesh side down, and add the broth to the sheet. Cover with aluminum foil and bake for 40 to 50 minutes, until the squash is knife-tender.",
        "While the pumpkin cooks, clean the seeds. Toss with the remaining 1 tablespoon ghee or oil and a pinch of sea salt and bake for 10 to 12 minutes, until browned, remove from the oven and process in the food processor until finely ground.",
        "In a cast-iron skillet or sauté pan, combine the carrots, onion, garlic, and a pinch of sea salt. Sweat the veggies, stirring occasionally, until the onions are translucent. Transfer to a large mixing bowl.",
        "When the squash is done, remove it from the oven and reserve the cooking broth from squash in a small saucepan; scrape the flesh from the squash skin. Place the saucepan of the reserved cooking broth over medium heat and reduce by three quarters. Transfer the squash flesh to the bowl with the pork and vegetables. Add the almond flour, walnuts, squash seeds, herbs, eggs, and reduced cooking broth and mix thoroughly to combine.",
        "Spread the stuffing out on a baking sheet and bake for 25 minutes, or until the pork is fully cooked through. Remove from the oven and serve immediately.",
        "Store any leftovers, refrigerated, for up to 1 week."
    ],
    "ingredients": [
        "1 medium butternut squash or pumpkin, halved, seeds removed and reserved",
        "2 tablespoons ghee or olive oil",
        "Sea salt as needed",
        "A few pinches freshly ground pepper",
        "1 cup Turkey Bone Broth or Chicken Bone Broth",
        "Reserved squash seeds",
        "3 carrots, peeled and diced",
        "1 onion, peeled and diced",
        "3 garlic cloves, minced",
        "2 pounds ground pork",
        "1/2 cup almond flour",
        "1 cup walnuts, toasted",
        "1 teaspoon chopped fresh rosemary",
        "1 tablespoon chopped fresh oregano",
        "1 tablespoon chopped fresh sage",
        "2 eggs, beaten"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Squash",
        "Stuffing/Dressing",
        "Carrot",
        "Oregano",
        "Walnut",
        "Rosemary",
        "Sage",
        "Onion",
        "Side",
        "Kid-Friendly",
        "Healthy",
        "Low Fat",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pork Walnut Stuffing with Squash and Sage",
    "url": "http://www.epicurious.com/recipes/food/views/pork-walnut-stuffing-with-squash-and-sage"
}
