{
    "directions": [
        "Remove the pork chops from the refrigerator and let stand for 30 minutes. Pat the chops dry with paper towels and season both sides generously with salt and pepper.",
        "Preheat an oven to 200°F (95°C). Place a platter in the oven to warm.",
        "Warm a large sauté pan or fry pan over high heat and pour in half of the olive oil. When the oil appears to shimmer, reduce the heat to medium-high, add 2 chops and sear without moving them for 2 1/2 minutes. Turn the chops over and cook until they are golden and firm to the touch but still have a little give, about 2 1/2 minutes more. An instant-read thermometer inserted horizontally into a chop, away from the bone, should register 140°F (60°C) for medium-rare and 145°F (63°C) for medium. Transfer the chops to the platter in the oven. Repeat with the remaining olive oil and chops.",
        "Pour out any oil in the pan. Reduce the heat to medium, add the capers and cook for 1 minute. Add the wine, bring to a simmer and cook until reduced by about half, about 2 minutes. Stir in the cream, vinegar, the 1/4 tsp.  salt and pepper, to taste. Simmer the sauce until lightly thickened, about 30 seconds. Remove from the heat and whisk in the mustard. Taste and adjust the seasoning with salt and pepper.",
        "Pour some of the sauce over the chops on the platter. Serve immediately and pass the remaining sauce at the table. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Cook Good Food",
        "(Weldon Owen, 2014)."
    ],
    "ingredients": [
        "4 center-cut pork loin chops, each about 7 oz. (220 g) and 3/4\n  inch (2 cm) thick",
        "Kosher salt, to taste, plus 1/4 tsp.",
        "Freshly ground pepper, to taste",
        "1 1/2 Tbs. olive oil",
        "1/3 cup  (2 1/2 oz./75 g) capers",
        "1 1/4 cups  (10 fl. oz./310 ml) dry white wine",
        "1/3 cup  (3 fl. oz./80 ml) heavy cream",
        "1/4 tsp. white wine vinegar",
        "2 Tbs. whole-grain mustard"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pork Chops with Mustard and Caper Pan Sauce",
    "url": "http://www.williams-sonoma.com/recipe/pork-chops-with-mustard-and-caper-pan-sauce.html"
}
