{
    "directions": [
        "At least 30 minutes before grinding the meat, chill all of your tools, including the bowl of the stand mixer, in the freezer.",
        "In a large bowl combine the pork butt, bacon, fatback, brown sugar, salt, pepper, paprika, coriander, garlic and onion powders, and Worcestershire sauce and stir well to combine.",
        "Using your meat grinder, grind the meat mixture through the medium die into the chilled bowl of the stand mixer. Cover the meat mixture and refrigerate until ready to use. Stuff the meat mixture into the sausage casings, and for best results, chill in the refrigerator overnight.",
        "In a medium saucepan over moderate heat, warm the olive oil. Add the red onion and garlic and sauté, stirring occasionally, until translucent. Add the cabbage, vinegar, and chicken stock and cook, stirring occasionally, until the cabbage is tender. Season with salt and pepper and keep warm.",
        "In a small saucepan over moderate heat, combine the apples, onion, brown sugar, vinegar, and water and cook, stirring occasionally, until the mixture is jammy and slightly reduced. Season with salt and pepper and keep warm.",
        "Using a toothpick, prick each sausage a few times. In a heavy, large skillet over moderate heat, warm the olive oil and butter until hot but not smoking. Add the sausage and cook, turning over a couple times, until golden brown on both sides, 8 to 10 minutes total. Transfer the sausage to a cutting board and cut into smaller pieces for serving.",
        "Divide the cabbage among 4 plates then top with sausage and apple chutney."
    ],
    "ingredients": [
        "3/4 pound pork butt, cut into cubes",
        "4 ounces bacon",
        "4 ounces fatback",
        "1 1/2 tablespoons packed dark brown sugar",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/2 teaspoon smoked paprika",
        "1/2 teaspoon ground coriander",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon onion powder",
        "3 dashes Worcestershire sauce",
        "All-natural hog casing, soaked in water 30 minutes and then flushed with water",
        "1 to 2 tablespoons olive oil",
        "1 tablespoon butter",
        "1/4 cup olive oil",
        "1 medium red onion, diced",
        "3 cloves garlic, minced",
        "1 head purple cabbage, shredded",
        "3/4 cup cider vinegar",
        "2 cups chicken stock or low-sodium chicken broth",
        "Salt and freshly ground black pepper",
        "2 medium Granny Smith apples, cored and diced",
        "1 medium red onion, diced",
        "1/2 cup packed dark brown sugar",
        "1/2 cup cider vinegar",
        "1/4 cup water",
        "Salt and freshly ground black pepper",
        "Meat grinder fitted with a medium die"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Dinner",
        "Apple",
        "Bacon",
        "Sausage",
        "Cabbage",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork Sausage with Braised Purple Cabbage and Apple Chutney",
    "url": "http://www.epicurious.com/recipes/food/views/pork-sausage-with-braised-purple-cabbage-and-apple-chutney-51181600"
}
