{
    "directions": [
        "In a large skillet cook the onion and the bell pepper in the oil over moderately low heat, stirring, until the onion is softened, add the pork, and cook the mixture over moderate heat, stirring and breaking up any lumps, until the pork is no longer pink. Stir in the tomato paste, the corn, the cumin, the allspice, the chili powder, the Worcestershire sauce, 1 teaspoon of the Tabasco, the cornmeal, and salt and black pepper to taste, simmer the mixture, stirring occasionally, for 30 minutes, and add the additional Tabasco. Spoon the mixture into a shallow 2 1/2-quart casserole. The mixture may be made 1 day in advance and kept, covered and chilled.",
        "Into a bowl sift together the flour, the cornmeal, the sugar, and the baking powder, add the butter, the milk, and the egg, and stir the batter until it is just combined. Stir in the Monterey Jack and the chili peppers and drop the batter by the large spoonfuls around the edge of the casserole.",
        "Bake the potpie in the middle of a preheated 400°F. oven for 10 minutes, reduce the heat to 350°F., and bake the potpie for 30 minutes more."
    ],
    "ingredients": [
        "1 cup chopped onion",
        "1 cup chopped green bell pepper",
        "2 tablespoons vegetable oil",
        "1 1/2 pounds lean ground pork",
        "a 12-ounce can tomato sauce",
        "2 tablespoons tomato paste",
        "a 10-ounce package of frozen corn, thawed",
        "1 tablespoon ground cumin",
        "1/2 teaspoon ground allspice",
        "2 teaspoons chili powder",
        "1 tablespoon Worcestershire sauce",
        "1 teaspoon Tabasco plus additional to taste",
        "1 tablespoon yellow cornmeal",
        "1 cup all-purpose flour",
        "1 cup yellow cornmeal",
        "3 tablespoons sugar",
        "2 teaspoons double-acting baking powder",
        "3 tablespoons unsalted butter, melted and cooled",
        "3/4 cup milk",
        "1 large egg, beaten lightly",
        "1/2 cup grated Monterey Jack",
        "a 4-ounce can green chili peppers, drained and chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pork",
        "Tomato",
        "Bake",
        "Cornmeal",
        "Gourmet"
    ],
    "title": "Pork Tamale Potpie with Corn Bread Crust",
    "url": "http://www.epicurious.com/recipes/food/views/pork-tamale-potpie-with-corn-bread-crust-10302"
}
