{
    "directions": [
        "Lay the pork flat, boned side up, on a cutting board. Using a sharp knife, trim away any large pockets of fat. Starting at the thinner end of the meat, roll up the pork and securely tie the roll at regular intervals with kitchen twine. Season the pork generously with salt and pepper.",
        "In a fry pan over medium-high heat, melt the butter with the canola oil. Add the pork and cook, turning frequently, until browned on all sides, about 10 minutes. Transfer the pork to a platter.",
        "Return the pan to medium-high heat, add the onion, apples and thyme, and sauté until the onion and apples are lightly browned, about 5 minutes. Transfer the apple mixture to a bowl.",
        "Pour off the fat from the pan. Return the pan to medium-high heat, add the wine and deglaze the pan, stirring with a wooden spoon to scrape up the browned bits from the pan bottom.",
        "Oven method:",
        "Preheat an oven to 325°F. Cover the bottom of a large Dutch oven with the sauerkraut. Sprinkle with the brown sugar and caraway seeds. Place the pork on top and surround with the apple mixture. Pour in the wine mixture. Cover, transfer to the oven and cook until the pork is fork-tender and shreds easily, 4 to 5 hours.",
        "Slow-cooker method:",
        "Cover the bottom of a slow cooker with the sauerkraut. Sprinkle with the brown sugar and caraway seeds. Place the pork on top and surround with the apple mixture. Pour in the wine mixture. Cover and cook on low according to the manufacturer's instructions until the pork is fork-tender and shreds easily, 8 to 10 hours.",
        "Transfer the pork to a carving board. Using a sharp knife, cut the pork crosswise into slices about 1/2 inch thick, removing the twine as you slice. Place the sauerkraut on a large platter and top with the pork slices. Surround with the apples and serve immediately. Serves 4 to 6.",
        "Adapted from Williams-Sonoma",
        "Essentials of Slow Cooking,",
        "by Melanie Barnard, Charles Pierce & Denis Kelly (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "1 boneless pork shoulder roast, 4 to 5 lb.",
        "Salt and freshly ground pepper, to taste",
        "2 Tbs. unsalted butter",
        "2 Tbs. canola oil",
        "1 yellow onion, thinly sliced",
        "3 Golden Delicious apples, peeled, halved and cored",
        "1 Tbs. fresh thyme",
        "1/2 cup dry white wine, such as Chardonnay",
        "2 lb. sauerkraut, squeezed dry",
        "1/4 cup firmly packed dark brown sugar",
        "1 Tbs. caraway seeds"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pork Shoulder with Sauerkraut and Apples",
    "url": "http://www.williams-sonoma.com/recipe/pork-shoulder-with-sauerkraut-and-apples.html"
}
