{
    "directions": [
        "Mix 1 tablespoon chili powder, salt, and pepper in bowl. Rub spice mixture all over pork. Sauté bacon in heavy large pot over medium heat until crisp, about 5 minutes. Transfer bacon to paper towels to drain. Working in batches, add pork to drippings in pot and sauté until brown on all sides, about 10 minutes per batch. Using slotted spoon, transfer pork to bowl.",
        "Reduce heat to medium. Add onion, ham, carrot, and garlic to pot; cover and cook 5 minutes, stirring occasionally and scraping up browned bits. Add chilies; stir 1 minute. Stir in hominy, tomatoes with juices, beer, broth, marjoram, pork, and remaining 2 teaspoons chili powder and bring to boil. Reduce heat; cover and simmer until pork is very tender, about 1 hour. (Can be prepared 1 day ahead. Cover and chill bacon. Cool stew slightly. Chill uncovered until cold, then cover and keep chilled.)",
        "Simmer stew uncovered until liquid is slightly reduced and thickened, about 10 minutes. Season with salt and pepper. Transfer to bowl. Sprinkle with reserved bacon and cilantro.",
        "These fresh green chilies, often called pasillas, are available at Latin American markets and also at some supermarkets."
    ],
    "ingredients": [
        "1 tablespoon plus 2 teaspoons chili powder",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "2 1/2 pounds boneless pork shoulder butt, cut into 2 1/2-inch pieces or boneless country pork spareribs, cut into 2-inch pieces",
        "3 bacon slices, chopped",
        "1 large onion, thinly sliced",
        "1 cup diced smoked ham",
        "1 medium carrot, peeled, chopped",
        "6 large garlic cloves, chopped",
        "2 poblano chilies,* seeded, cut into 2x1/4-inch strips",
        "2 cups drained canned hominy (from two 15-ounce cans)",
        "1 cup canned diced tomatoes in juice",
        "1 cup beer",
        "1 cup canned low-salt chicken broth",
        "1 teaspoon dried marjoram",
        "1/4 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Pork",
        "Stew",
        "Dinner",
        "Ham",
        "Winter",
        "Hominy/Cornmeal/Masa",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pork and Hominy Stew",
    "url": "http://www.epicurious.com/recipes/food/views/pork-and-hominy-stew-106213"
}
