{
    "directions": [
        "Place bay leaves and peppercorns in center of cheesecloth and tie closed with kitchen twine; set sachet aside. Grind mushrooms in spice mill to a powder.",
        "Heat 2 Tbsp. oil in a large heavy pot over medium-high. Cook onion, garlic, and chiles, stirring often, until softened, about 5 minutes. Add tomatoes and cook, stirring often, until partly broken down and very saucy, about 5 minutes. Add ribs, mushroom powder, reserved sachet, and 12 cups water. Bring to a boil, then reduce heat. Place tamarind pulp in a small medium-mesh sieve and partially submerge into simmering liquid (it will soften and start to dissolve as time goes by). Cook ribs, skimming foam from the surface, until very tender (meat should be practically falling off the bone for ribs and shred easily for pork shoulder), 2–2 1/2 hours. Season with salt and push tamarind pulp through sieve with a rubber spatula, tasting as you go, until desired level of sourness is reached. Discard any remaining tamarind.",
        "Heat remaining 1 Tbsp. oil in a medium skillet over medium-high. Cook bok choy, eggplant, radishes, beans, and okra, tossing occasionally, until crisp-tender, about 5 minutes. Add 1 Tbsp. fish sauce and toss to coat. Divide vegetables, ribs, and broth among bowls; serve drizzled with more fish sauce, if desired.",
        "Ribs can be cooked 3 days ahead. Let cool; cover and chill."
    ],
    "ingredients": [
        "10 dried bay leaves",
        "1/2 cup black peppercorns",
        "1 cup dried shiitake mushrooms",
        "3 tablespoons vegetable oil, divided",
        "1 medium white onion, chopped",
        "2 heads of garlic, cloves chopped",
        "2 jalapeños, thinly sliced",
        "3 medium tomatoes, quartered",
        "4 pounds St. Louis–style pork spareribs or skinless, boneless pork shoulder (Boston butt), or a combination of both",
        "1 (8-ounce) package dried tamarind pulp with or without seeds",
        "Kosher salt",
        "4 baby bok choy, halved lengthwise",
        "1 small Japanese eggplant, cut into 1-inch pieces",
        "2 watermelon radishes or globe radishes, cut into 3/4-inch pieces",
        "4 ounces Chinese long beans or green beans, cut into 2-inch lengths",
        "1 cup small okra",
        "1 tablespoon fish sauce; plus more for serving (optional)",
        "A layer of cheesecloth; a spice mill"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Philippines",
        "Soup/Stew",
        "Pork",
        "Tamarind",
        "Garlic",
        "Bok Choy",
        "Mushroom",
        "Pepper",
        "Eggplant",
        "Radish",
        "Dinner",
        "Winter",
        "Okra",
        "Stew"
    ],
    "title": "Pork, Vegetable, and Tamarind Stew",
    "url": "http://www.epicurious.com/recipes/food/views/pork-vegetable-and-tamarind-stew"
}
