{
    "directions": [
        "Melt 1 tablespoon butter with 1 tablespoon oil in large skillet over medium-high heat. Add leeks and cook until beginning to turn golden, stirring frequently, about 5 minutes. Stir in broth, wine, and garlic. Boil until mixture is reduced to 1 2/3 cups, about 4 minutes. Whisk in crème fraîche and mustard; set aside. (Sauce can be made 2 hours ahead. Let stand at room temperature.) Melt 1 tablespoon butter with 1 tablespoon oil in another large skillet over medium-high heat. Sprinkle pork with salt and pepper. Sauté until browned and cooked, about 5 minutes per side. Transfer pork to platter. Add sauce to skillet; simmer sauce over medium heat until slightly thickened, scraping up any browned bits, about 2 minutes. Stir in chopped chives and tarragon. Season with salt and pepper.",
        "Return pork to skillet. Cook over medium heat just until rewarmed, stirring frequently, about 1 minute. Transfer to platter, sprinkle with parsley, and serve."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) butter, divided",
        "2 tablespoons olive oil, divided",
        "2 cups chopped leeks (white and pale green parts only; about 2 medium)",
        "1 cup low-salt chicken broth",
        "1/2 cup dry white wine",
        "2 garlic cloves, minced",
        "1/2 cup crème fraîche or sour cream",
        "3 tablespoons whole grain Dijon mustard",
        "2 1-pound pork tenderloins, each cut crosswise into 6 slices",
        "2 tablespoons chopped fresh chives",
        "1 tablespoon chopped fresh tarragon",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mustard",
        "Pork",
        "Sauté",
        "Dinner",
        "Pork Tenderloin",
        "Leek",
        "White Wine",
        "Fall",
        "Tarragon",
        "Chive",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pork Medallions with Mustard-Chive Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pork-medallions-with-mustard-chive-sauce-230934"
}
