{
    "directions": [
        "Boil beef and chicken stocks in medium saucepan until reduced to 2 1/2 cups, about 45 minutes.",
        "Heat 2 tablespoons olive oil in heavy large saucepan over medium-high heat. Add shallots and sauté until tender, about 4 minutes. Add reduced stock mixture, marmalade and chipotle chilies. Simmer until mixture is reduced to 2 cups, about 5 minutes. Mix 1 tablespoon water and cornstarch in small bowl. Whisk cornstarch mixture into stock mixture. Stir until sauce boils and thickens, about 5 minutes. Season to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 425°F. Sprinkle pork with salt and pepper. Heat remaining 1 tablespoon olive oil in heavy large ovenproof skillet over high heat. Add pork and cook until brown on all sides, about 4 minutes.",
        "Transfer skillet to oven and bake until thermometer inserted into pork registers 155°F, about 15 minutes. Let pork rest 5 minutes.",
        "Bring sauce to simmer. Slice pork into 1/2-inch-thick medallions; arrange on plates. Spoon sauce over and serve.",
        "*Chipotle chilies canned in a spicy tomato sauce, sometimes called adobo, are available at Latin American markets, specialty foods stores and some supermarkets."
    ],
    "ingredients": [
        "3 2/3 cups beef stock or canned beef broth",
        "3 2/3 cups chicken stock or canned low-salt chicken broth",
        "3 tablespoons olive oil",
        "3/4 cup finely chopped shallots",
        "1/2 cup orange marmalade",
        "1 tablespoon chopped canned chipotle chilies*",
        "1 tablespoon water",
        "2 teaspoons cornstarch",
        "2 1-pound pork tenderloins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pepper",
        "Pork",
        "Bake",
        "Sauté",
        "Shallot",
        "Jam or Jelly"
    ],
    "title": "Pork Tenderloin with Chipotle-Marmalade Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pork-tenderloin-with-chipotle-marmalade-sauce-103263"
}
