{
    "directions": [
        "Puree 2 cups chicken broth, 1/4 of tomatillos, green onions, cilantro with stems, and garlic in blender. Set salsa verde aside.",
        "Brush heavy large pot with oil; heat over medium-high heat. Sprinkle pork with salt and pepper. Working in batches, add pork to pot; cook until browned, turning occasionally, about 4 minutes per batch. Using slotted spoon, transfer pork to bowl. Pour off all but 1 tablespoon fat from pot (add oil if needed). Add onion to pot; sauté until soft, about 5 minutes. Sprinkle cumin seeds over; cook until onion is golden and cumin is toasted, about 2 minutes. Add remaining tomatillos; cook until tender and browned in spots, stirring occasionally and reducing heat to medium if browning too quickly, about 8 minutes. Return pork and any juices to pot. Add 2 cups reserved salsa verde, 1 cup broth, chiles, and oregano. Cover; simmer over medium-low heat until pork is tender, about 2 hours. DO AHEAD: Can be made 3 days ahead. Cool slightly. Chill uncovered until cold, then cover and keep chilled. Bring to simmer before continuing.",
        "Add potatoes to pork. Simmer until potatoes are tender, about 30 minutes. Stir in remaining salsa verde; bring to simmer. Thin with additional broth, if desired. Season with salt and pepper.",
        "Divide chile verde among bowls. Top with cilantro and dollop of red chile salsa."
    ],
    "ingredients": [
        "3 cups (or more) chicken broth, divided",
        "1 pound tomatillos, husked, rinsed, cut into 1/2-inch wedges, divided",
        "1 bunch green onions, coarsely chopped",
        "1 1/2 cups (packed) fresh cilantro with tender stems",
        "Olive oil",
        "6 garlic cloves, peeled",
        "1 4- to 4 1/2-pound pork shoulder (Boston butt), trimmed, cut into 1 1/2-inch cubes",
        "1 large onion, chopped (about 2 cups)",
        "1 tablespoon cumin seeds",
        "3/4 cup diced roasted peeled seeded mild green chiles (such as Hatch or Anaheim)",
        "2 teaspoons dried oregano (preferably Mexican)",
        "1 pound yukon gold potatoes, peeled, cut into 3/4-inch cubes chopped",
        "Fresh cilantro",
        "Red chile salsa",
        "Ingredient info: Look for tomatillos (green, tomato-like fruits with papery husks) at supermarkets and Latin markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Pork",
        "Potato",
        "Super Bowl",
        "Dinner",
        "Winter",
        "Family Reunion",
        "Tomatillo",
        "Potluck",
        "Chile Pepper",
        "One-Pot Meal",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pork Chile Verde with Red Chile Salsa",
    "url": "http://www.epicurious.com/recipes/food/views/pork-chile-verde-with-red-chile-salsa-363730"
}
