{
    "directions": [
        "Preheat oven to 425°F. Spread out pumpkin seeds on a large rimmed baking sheet. Toast, tossing once, until just beginning to darken, about 4 minutes. Let cool. Coarsely chop; set aside.",
        "Toss squash with 1 tablespoon oil on a large rimmed baking sheet; season with salt and pepper. Roast squash, turning occasionally, until golden brown and tender, 35-40 minutes.",
        "When squash has been roasting for 30 minutes, heat 1 tablespoon oil in a large heavy skillet over medium-high heat. Season pork chops with salt and pepper and cook until brown, 5-8 minutes. Turn over and cook until pork is cooked through, about 3 minutes longer.",
        "Whisk garlic, 3 tablespoons chopped cilantro, 2 tablespoons lime juice, reserved toasted pumpkin seeds, and remaining 3 tablespoons oil in a small bowl to combine. Season vinaigrette with salt, pepper, and more lime juice, if desired.",
        "Divide squash and pork among plates; spoon vinaigrette over. Top with cilantro leaves."
    ],
    "ingredients": [
        "2 tablespoons shelled pumpkin seeds (pepitas)",
        "3 pounds winter squash (such as acorn, kabocha, delicata, or butternut), halved, seeded, cut into 1\" wedges",
        "5 tablespoons olive oil, divided",
        "Kosher salt, freshly ground pepper",
        "4 1\"-thick bone-in pork chops",
        "1/2 small garlic clove, finely grated",
        "3 tablespoons coarsely chopped fresh cilantro plus leaves for garnish",
        "2 tablespoons (or more) fresh lime juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Pork Chop",
        "Squash",
        "Winter",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pork Chops and Squash with Pumpkin Seed Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/pork-chops-and-squash-with-pumpkin-seed-vinaigrette-51148610"
}
