{
    "directions": [
        "Combine pork, coriander, half of garlic, and 1 tablespoon salt in a large bowl; season with pepper and toss. Cover; chill at least 4 hours.",
        "Preheat oven to 350°F. Toast pumpkin seeds on a rimmed baking sheet, tossing occasionally, until golden, about 5 minutes; set aside.",
        "Toast chiles on clean baking sheet until slightly darkened, about 5 minutes. Let cool slightly, then remove stems, and seeds, if you prefer less heat. Place chiles, half of yellow onion, remaining garlic, and 1 cup hot water in a blender; let sit 10 minutes to soften chiles. Blend until smooth; set chile purée aside.",
        "Heat oil in a large Dutch oven over medium-high heat. Working in batches, cook pork, turning occasionally, until browned, 8–10 minutes; transfer to a plate.",
        "Pour off fat from pot. Cook chile purée in pot over medium-high heat, stirring occasionally, until reduced by half, 8–10 minutes. Add pork, oregano, remaining yellow onion, and 10 cups water to pot; season with salt and pepper. Bring to a boil, reduce heat, and simmer, partially covered, skimming occasionally, until pork is very tender, 3–3 1/2 hours.",
        "Add squash to stew and cook, uncovered, until pork is falling apart and squash is soft, 30–35 minutes; season with salt and pepper.",
        "Toss red onion and lime juice in a small bowl; let sit, tossing occasionally, 30 minutes.",
        "Serve stew with red onion, cilantro, and reserved pumpkin seeds.",
        "DO AHEAD: Pork can be marinated 2 days ahead; keep chilled. Stew can be made 3 days ahead; let cool, then cover and chill."
    ],
    "ingredients": [
        "3 pound boneless pork shoulder (Boston butt), cut into 2\" pieces",
        "1 tablespoon ground coriander",
        "10 garlic cloves, finely chopped, divided",
        "1 tablespoon kosher salt, plus more",
        "Freshly ground black pepper",
        "1/2 cup raw shelled pumpkin seeds",
        "6 dried New Mexico or guajillo chiles",
        "2 chiles de árbol or 1/2 teaspoon crushed red pepper flakes",
        "2 large yellow onions, cut into 1/8\"-thick wedges, divided",
        "2 tablespoons vegetable oil",
        "4 sprigs oregano",
        "1/2 kabocha squash (about 1 pound), peeled, seeds removed, cut into 1\" pieces",
        "1 delicata squash, seeds removed, cut into 1/2\"-thick slices",
        "1/2 small red onion, thinly sliced",
        "1/4 cup fresh lime juice",
        "Cilantro sprigs (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Pork",
        "Dinner",
        "Lunch",
        "Squash",
        "Fall",
        "Winter",
        "Chile Pepper",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pork and Squash Stew with Chiles",
    "url": "http://www.epicurious.com/recipes/food/views/pork-and-squash-stew-with-chiles-51214660"
}
