{
    "directions": [
        "Trim off tail ends of tenderloins to form 2 (8-ounce) pieces, reserving trimmings for another use.",
        "Boil wine, rosemary sprig, garlic, and red pepper flakes in a small heavy saucepan until reduced to about 1/2 cup, 7 to 8 minutes. Pour through a fine sieve into a measuring cup, then transfer rosemary sprig, garlic, and red pepper flakes to a sealable plastic bag along with 1/4 cup wine marinade and tenderloins. Marinate, chilled, turning bag occasionally, at least 2 hours or overnight.",
        "Return remaining 1/4cup wine marinade to saucepan and add vinegar, honey, and chopped rosemary, then boil dressing until reduced to about 1/4 cup, 6 to 8 minutes.",
        "Prepare grill for cooking.",
        "When fire is medium-hot (you can hold your hand 5 inches above rack for 3 to 4 seconds), put bell peppers, zucchini, and onion on a lightly oiled grill rack and place over fire. Grill zucchini and onion, turning, until tender, 8 to 10 minutes, then transfer to a cutting board. Grill peppers until skins are blackened and flesh begins to soften, about 8 minutes, then transfer to a bowl, cover, and let steam 10 minutes.",
        "While peppers are steaming, pat pork dry and season with salt and pepper. Grill on lightly oiled grill rack over medium-hot fire, turning frequently, until an instant-read thermometer inserted diagonally 2 inches into meat registers 155°F, about 20 minutes. Transfer to a cutting board, then tent loosely with foil and let stand 10 minutes before slicing.",
        "Peel peppers and cut into 1-inch pieces. Transfer to a large bowl.",
        "Cut zucchini and onion into 1-inch pieces and add to peppers. Toss vegetables with 2 tablespoons rosemary dressing, 1 teaspoon oil, and salt and pepper to taste.",
        "Toss arugula with remaining teaspoon oil. Mound grilled vegetables on 4 plates and top with sliced pork. Add any juices from cutting board to remaining 2 tablespoons dressing and drizzle over pork. Top with arugula."
    ],
    "ingredients": [
        "2 (3/4-lb) pork tenderloins",
        "1 cup dry red wine",
        "1 (2-inch) sprig fresh rosemary plus 1/4 teaspoon finely chopped",
        "1 garlic clove, smashed",
        "1/4 teaspoon dried hot red pepper flakes",
        "1/4 cup red-wine vinegar",
        "1 tablespoon mild-flavored honey",
        "2 medium red bell peppers, quartered",
        "3 medium zucchini (1 lb total), trimmed and cut lengthwise into 1/4-inch-thick slices",
        "1 medium onion, cut lengthwise into 6 wedges, leaving root ends intact",
        "2 teaspoons extra-virgin olive oil",
        "2 cups trimmed baby arugula (1 oz)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetable",
        "Low Fat",
        "Pork Tenderloin",
        "Arugula",
        "Bell Pepper",
        "Zucchini",
        "Summer",
        "Grill/Barbecue",
        "Healthy",
        "Gourmet"
    ],
    "title": "Pork Tenderloin and Grilled Vegetable Salad",
    "url": "http://www.epicurious.com/recipes/food/views/pork-tenderloin-and-grilled-vegetable-salad-105121"
}
