{
    "directions": [
        "Place pork tenderloin strips in medium bowl; sprinkle with salt and freshly ground black pepper and toss with cornstarch to coat. Heat 1 tablespoon sesame oil in large nonstick skillet over medium-high heat. Add minced ginger; stir 30 seconds. Add pork tenderloin strips; stir-fry until pork is beginning to brown and is almost cooked through, about 3 minutes. Add tangerine pieces; toss 30 seconds. Add sweet chili sauce, soy sauce, and Chinese five-spice powder; boil until sauce in skillet thickens slightly, tossing to blend, about 1 minute. Stir in remaining 1 tablespoon sesame oil, bok choy, and half of sliced green onions. Stir-fry just until bok choy is wilted, 1 to 2 minutes. Season to taste with salt and freshly ground black pepper. Transfer to bowl; sprinkle with remaining sliced green onions and serve."
    ],
    "ingredients": [
        "1 1 1/4-pound pork tenderloin, trimmed, cut crosswise into 1/2-inch-thick rounds, then cut into 1/2-inch-wide strips",
        "1 tablespoon cornstarch",
        "2 tablespoons Asian sesame oil, divided",
        "1 tablespoon minced peeled fresh ginger",
        "4 small unpeeled tangerines or clementines, cut (with peel) into 3/4-inch pieces",
        "1/4 cup Asian sweet chili sauce",
        "2 tablespoons soy sauce",
        "1/4 teaspoon Chinese five-spice powder",
        "6 baby bok choy, cut crosswise into 1-inch-thick ribbons, tough bases discarded",
        "5 green onions, thinly sliced on diagonal, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Stir-Fry",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Pork Tenderloin",
        "Healthy",
        "Tangerine",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Pork Tenderloin Stir-Fry with Tangerines and Chili Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pork-tenderloin-stir-fry-with-tangerines-and-chili-sauce-355769"
}
