{
    "directions": [
        "Heat the oil in a large saucepan or casserole over medium heat. Add the onion and garlic and sauté gently for about 10 minutes, until softened. Add the paprika and 1 tablespoon of the oregano. Cook for another minute.",
        "If using dried beans, drain them after soaking and add to the pan with the stock and bay leaf. Bring to a boil, then lower the heat and simmer for about 45 minutes, or until the beans are completely tender (dried beans vary, and sometimes this may take over an hour). Add the squash, stir well, and simmer for 10 to 15 minutes, until the squash is just tender, then add the green beans and corn kernels and simmer for another 5 minutes.",
        "If using canned beans, add the drained, rinsed beans, the squash, bay leaf, and stock at the same time, and simmer until the squash is just tender, 10 to 15 minutes. Then add the green beans and corn kernels and simmer for a further 5 minutes.",
        "To finish, season well—I use about 1 teaspoon of salt and plenty of pepper. Stir in the remaining oregano, leave to settle for a couple of minutes, then serve."
    ],
    "ingredients": [
        "2 tablespoons canola or olive oil",
        "1 onion, chopped",
        "2 garlic cloves, finely chopped",
        "1 teaspoon sweet smoked paprika",
        "A handful of oregano or marjoram, chopped",
        "3 1/2 ounces/100g small dried beans, such as pinto, navy, or cannellini beans, soaked overnight in cold water, or 1 (14-ounce/400g) can beans, drained and well rinsed",
        "1 quart/liter vegetable stock",
        "1 bay leaf",
        "1 1/2 pounds/750g squash, such as butternut or red kuri, peeled, seeded, and cut into 3/4-inch/2cm chunks",
        "7 ounces/200g green beans, trimmed and cut into 3/4-inch/2cm pieces",
        "Kernels cut from 2 cobs of corn",
        "Sea salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Vegetarian",
        "Dinner",
        "Corn",
        "Green Bean",
        "Legume",
        "Squash",
        "Fall",
        "Winter",
        "Vegan",
        "Advance Prep Required",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Porotos Granados",
    "url": "http://www.epicurious.com/recipes/food/views/porotos-granados-51174610"
}
