{
    "directions": [
        "In the top of a double boiler, melt unsweetened chocolate and 3/4 cup butter, stirring occasionally, until smooth. Set aside to cool to room temperature. Preheat oven to 350 degrees F (175 degrees C). Grease a 10 inch Bundt or tube pan.",
        "In a large bowl, beat egg yolks and 3/4 cup sugar together with an electric mixer on High speed until light and fluffy, about 5 minutes. Gradually stir in the 3/4 cup of port wine and flour. Fold in the cooled chocolate mixture.",
        "In a clean bowl, whip egg whites with cream of tartar until frothy. Gradually whisk in 3 tablespoons sugar, and continue to whip until stiff peaks form. Fold 1/3 of the whites into the batter, then quickly fold in remaining whites until no streaks remain. Quickly fold in walnuts.  Pour batter into prepared pan.",
        "Bake in the preheated oven for about 45 minutes, or until tested done with a toothpick.  Cool in pan 10 minutes.  Invert onto serving plate.  Cool completely.",
        "To make the glaze:  In the top of a double boiler, over lightly simmering water, combine chocolate chips, 1/2 cup butter and corn syrup. Stir frequently until chocolate is melted.  Stir in the remaining 1/2 cup port wine and vanilla until mixture is smooth. Set aside to cool for about 30 minutes. Pour glaze over the cooled cake."
    ],
    "ingredients": [
        "10 (1 ounce) squares unsweetened chocolate",
        "3/4 cup butter",
        "5 egg yolks",
        "3/4 cup white sugar",
        "3/4 cup port wine",
        "1/2 cup all-purpose flour",
        "5 egg whites",
        "1/2 teaspoon cream of tartar",
        "3 tablespoons white sugar",
        "1 cup chopped walnuts",
        "1 cup semisweet chocolate chips",
        "1/2 cup butter",
        "1/2 tablespoon corn syrup",
        "1/2 cup port wine",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Port Wine Chocolate Cake",
    "url": "http://allrecipes.com/recipe/8189/port-wine-chocolate-cake/"
}
