{
    "directions": [
        "Position rack in bottom third of oven and preheat to 325°F. Pat turkey dry. Place turkey on rack set in large roasting pan. Rub turkey breast with 2 tablespoons butter. Sprinkle with salt and pepper. Fold 2-foot-square piece of cheesecloth in half twice, forming 12-inch square. Dip cloth into water; squeeze out excess moisture. Drape cloth over turkey breast, tucking cloth under at sides. Roast 30 minutes.",
        "Meanwhile, bring 1 1/2 cups broth, Port and 4 tablespoons butter to simmer in heavy medium saucepan, stirring until butter melts. Baste turkey with 3/4 cup Port mixture. Roast turkey 1 hour 10 minutes, basting twice with remaining Port mixture.",
        "Add water, onion, carrot and apple to roasting pan; stir to coat vegetables with pan juices. Baste turkey with pan juices. Roast 20 minutes. Remove cheesecloth. Roast turkey until skin browns and meat thermometer inserted into innermost part of thigh registers 180°F, basting occasionally with pan juices, about 50 minutes. Transfer turkey to platter; tent with foil.",
        "Place roasting pan over medium-high heat. Bring pan juices and vegetables to boil, scraping up any browned bits. Add Gravy Base and boil uncovered 5 minutes. Scrape mixture into strainer set over large measuring cup, pressing on solids with back of spoon. Spoon fat off top of pan juices. Add enough additional broth to cup to measure 3 cups liquid if necessary, or transfer pan juices to saucepan and boil until reduced to 3 cups if necessary. Bring pan juices to simmer in heavy medium saucepan. Mix 3 tablespoons butter and flour in small bowl to form paste. Add paste to pan juices; bring to boil, whisking constantly. Boil until sauce thickens, whisking occasionally, about 5 minutes. Season to taste with salt and pepper. Serve turkey, passing gravy separately."
    ],
    "ingredients": [
        "1 13- to 14-pound turkey; neck, gizzard and heart reserved for Gravy Base",
        "9 tablespoons butter, room temperature",
        "1 1/2 cups (or more) canned low-salt chicken broth",
        "1/2 cup tawny Port",
        "1 cup water",
        "1 medium onion, coarsely chopped",
        "1 large carrot, coarsely chopped",
        "1 medium Granny Smith apple, peeled, cored, coarsely chopped",
        "Gravy Base",
        "3 tablespoons all purpose flour"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Poultry",
        "turkey",
        "Roast",
        "Christmas",
        "Thanksgiving",
        "Port",
        "Fall"
    ],
    "title": "Port-Basted Roast Turkey with Pan Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/port-basted-roast-turkey-with-pan-gravy-2764"
}
