{
    "directions": [
        "In a small bowl whisk together marinade ingredients. Put half of mushroom caps and half of marinade in each of 2 large sealable plastic bags, arranging mushroom caps in one layer, and seal bags, pressing out excess air. Marinate mushrooms at room temperature, turning bags over several times, at least 1 and up to 2 hours.",
        "On a plate with a fork mash Gorgonzola and butter together until blended well.",
        "In a blender blend vinaigrette ingredients with salt and pepper to taste until smooth and emulsified.",
        "Prepare grill.",
        "Grill one side of bread on a rack set 5 to 6 inches over glowing coals until golden, about 1 minute. (Alternatively, bread may be grilled in a hot well-seasoned ridged grill pan over moderately high heat.) Divide bread, toasted sides down, among 4 plates. Spread soft side of bread with Gorgonzola butter.",
        "Remove mushrooms from marinade and grill 2 to 3 minutes on each side, or until tender. (Alternatively, mushrooms may be grilled in a hot well-seasoned ridged grill pan over moderately high heat.) Transfer mushrooms with tongs to a cutting board and slice thin.",
        "Arrange warm mushrooms on toasts and spoon vinaigrette over each open-faced sandwich. Garnish sandwiches with thyme.",
        "Using a long-handled fork char peppers over an open flame, turning, until skins are blackened, 2 to 3 minutes. (Or broil peppers on rack of a broiler pan under a preheated broiler about 2 inches from heat, turning every 5 minutes, until skins are blistered and charred, 15 to 25 minutes.) Transfer peppers to a bowl and let stand, covered, until cool enough to handle. Keeping peppers whole, peel them, starting at blossom end. Cut off tops and discard seeds and ribs. (Wear rubber gloves when handling chilies.)"
    ],
    "ingredients": [
        "5 tablespoons balsamic vinegar",
        "6 large garlic cloves, minced",
        "2 tablespoons chopped fresh thyme leaves or 2 teaspoons dried thyme, crumbled",
        "1/2 cup olive oil",
        "1 1/2 pounds fresh Portobello mushrooms, stems trimmed flush with caps",
        "2 ounces Gorgonzola cheese (about 1/4 cup) at room temperature",
        "1 tablespoon unsalted butter, softened",
        "1 red bell pepper, roasted (procedure follows), or 1/3 cup chopped drained bottled roasted red peppers",
        "1 tablespoon white-wine vinegar",
        "1 tablespoon water",
        "2 tablespoons extra-virgin olive oil",
        "four 1/2-inch-thick slices crusty bread, cut diagonally from a large loaf",
        "Garnish: fresh thyme leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Mushroom",
        "Pepper",
        "Marinate",
        "Quick & Easy",
        "Gourmet"
    ],
    "title": "Portobello \"Steak\" Sandwiches with Gorgonzola Butter and Red Pepper Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/portobello-steak-sandwiches-with-gorgonzola-butter-and-red-pepper-vinaigrette-12008"
}
