{
    "directions": [
        "In large bowl, combine wine, paprika, salt and pepper, blend well.  Add garlic cloves, bay leaf, and cubed meat, turn meat in marinade to coat pieces. Marinate for 6 hours, turning occasionally.",
        "Drain pork; reserve marinade. Pat cubes completely dry.  Discard garlic and bay leaf.  Melt 1 teaspoon of oil in large skillet.  Add pork cubes, stirring frequently so that the meat colors quickly and evenly.  Transfer with slotted spoon to a bowl.",
        "Pour reserved marinade into skillet and bring to a boil over high heat, scraping off any brown particles clinging to the inside of pan. Boil briskly uncovered until marinade is reduced to 1 cup. Pour over pork and set aside.",
        "In 6 to 8 quart pan, heat remaining 2 teaspoons oil; add onion and cook for 5 minutes, stirring frequently until onion is soft but not brown.  Add garlic, tomatoes and crushed red pepper. Simmer, stirring constantly for 5 minutes.",
        "Spread the clams, hinged side down, over the tomato sauce; cover the pan tightly and cook over medium to high heat for ten minutes or until clams open.  Stir in reserved pork and juices.  Simmer for 5 minutes to heat thoroughly.  Sprinkle with parsley."
    ],
    "ingredients": [
        "1 1/2 cups dry white wine",
        "1 teaspoon paprika",
        "2 1/2 teaspoons salt",
        "1/4 teaspoon black pepper",
        "2 cloves garlic, peeled and cut in half",
        "1 bay leaf",
        "2 pounds pork loin, cut into 1 inch cubes",
        "3 teaspoons olive oil, divided",
        "2 onions, peeled and thinly sliced",
        "2 teaspoons finely chopped garlic",
        "2 tomatoes - peeled, seeded and chopped",
        "1/4 teaspoon crushed red pepper flakes",
        "24 small clams in shell, scrubbed",
        "1/4 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Portuguese Pork Alentejana",
    "url": "http://allrecipes.com/recipe/24164/portuguese-pork-alentejana/"
}
