{
    "directions": [
        "Bring wine to simmer in small saucepan. Add saffron. Remove from heat. Cover; let stand 15 minutes.",
        "Heat 1 tablespoon oil in heavy large saucepan over medium-high heat. Add leeks and onion; sauté until tender, about 8 minutes. Add garlic; sauté 1 minute. Add stock, tomatoes with their juices, oregano and saffron mixture. Simmer 20 minutes. Add sausage, mussels and clams. Cover; boil until shellfish open, about 8 minutes (discard any that do not open).",
        "Meanwhile, dip 1 side of fish in cornmeal. Sprinkle with salt and pepper. Heat 2 tablespoons oil in heavy large nonstick skillet over high heat. Add fish, cornmeal side down, and cook until bottom is golden, about 4 minutes. Turn fish over. Ladle 1 cup of soup over. Cover and simmer until fish is just cooked through, about 4 minutes.",
        "Transfer fish, cornmeal side up, to 4 shallow bowls. Arrange clams, mussels and sausage around fish. Top with remaining soup. Sprinkle with parsley."
    ],
    "ingredients": [
        "1/4 cup dry white wine",
        "1 generous pinch of saffron threads",
        "3 tablespoons olive oil",
        "1 1/4 cups coarsely chopped leeks",
        "1 cup coarsely chopped onion",
        "1 tablespoon minced garlic",
        "3 cups fish stock or bottled clam juice",
        "1 14 1/2-ounce can diced tomatoes in juice",
        "1/2 teaspoon dried oregano",
        "6 ounces linguiça sausage or hot links, cut diagonally into 1/4-inch-thick slices",
        "20 mussels, scrubbed, debearded",
        "12 littleneck clams, scrubbed",
        "4 5-ounce cod fillets",
        "Yellow cornmeal",
        "1/4 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Tomato",
        "Stew",
        "Sausage",
        "Cod",
        "Clam",
        "Mussel",
        "Saffron",
        "Leek",
        "White Wine",
        "Fall"
    ],
    "title": "Portuguese Fisherman's Stew",
    "url": "http://www.epicurious.com/recipes/food/views/portuguese-fishermans-stew-5714"
}
