{
    "directions": [
        "Preheat an oven to 400 degrees F (200 degrees C).",
        "Cut the tops off the beets and place them in a baking dish with enough water to cover the bottom of the dish.",
        "Roast the beets in the preheated oven until they are easily pierced with a knife, 40 to 50 minutes. Refrigerate until cool. Slice and set aside.",
        "Preheat the oven's broiler and set the oven rack to the second level from the heat source.",
        "Whisk the olive oil, balsamic vinegar, rosemary, and 2 cloves minced garlic together in a bowl. Spread about half of this mixture over the ribbed side of the portobello mushroom caps; arrange the mushrooms on a baking sheet with the ribbed sides facing upwards.",
        "Broil the mushrooms until tender, making sure to not burn the garlic, 5 to 7 minutes. Flip the mushrooms and brush the remaining olive oil mixture over the tops of the caps. Return to the oven and broil until tender, about 5 minutes more.",
        "Spread equal amounts of the goat cheese on one half of each of the sandwich rolls. Top each with a portion of the sliced beets and the spinach. Whisk the mayonnaise, garlic, and lime juice together in a bowl; spread evenly over the remaining sandwich roll halves and top with one mushroom cap each. Bring the two halves together to form the sandwiches to serve."
    ],
    "ingredients": [
        "2 medium beets",
        "1/4 cup olive oil",
        "2 tablespoons balsamic vinegar",
        "1 teaspoon dried rosemary",
        "2 cloves garlic, minced and divided",
        "4 portobello mushroom caps",
        "1/2 cup goat cheese",
        "4 sandwich buns, split and toasted",
        "1 1/2 cups baby spinach leaves",
        "3 tablespoons mayonnaise",
        "2 cloves garlic, minced",
        "2 limes, juiced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Portobello Burgers with Goat Cheese",
    "url": "http://allrecipes.com/recipe/203699/portobello-burgers-with-goat-cheese/"
}
