{
    "directions": [
        "Whisk first 6 ingredients and Marsala, if desired, in medium bowl for marinade. Stir in thyme sprigs. Cut stems from mushrooms and place stems in processor. Arrange mushrooms, gill side up, in 15x10x2-inch glass baking dish. Pour marinade over mushrooms and marinate 4 hours, turning to coat occasionally.",
        "Cook spinach according to package directions. Drain; cool. Using hands, squeeze excess water from spinach. Place in small bowl.",
        "Add half of button mushrooms to processor with portobello mushroom stems. Using on/off turns, process until coarsely chopped. Transfer to medium bowl and repeat with remaining mushrooms. Heat oil in heavy large skillet over high heat. Add onion; sauté until beginning to brown, stirring often, about 3 minutes. Add garlic and stir 30 seconds. Add chopped mushrooms, sprinkle with salt, and increase heat to high. Cook until almost all liquid evaporates, stirring often, about 8 minutes. Season mushroom mixture with salt and pepper. Transfer to large bowl; cool to room temperature.",
        "Add spinach, 1/4 cup Parmesan, and breadcrumbs to mushroom mixture; toss to distribute evenly. Add goat cheese and toss gently to distribute evenly. Season filling to taste with salt and pepper. DO AHEAD: Can be made 2 hours ahead. Cover filling and let stand at room temperature.",
        "Preheat oven to 400°F. Transfer marinated mushrooms, with some marinade still clinging, to rimmed baking sheet, gill side down. Roast until beginning to soften, about 15 minutes. Turn mushrooms over. Divide filling among mushrooms. Sprinkle remaining 6 tablespoons Parmesan cheese over and bake until heated through and cheese begins to brown, about 15 minutes."
    ],
    "ingredients": [
        "1 cup olive oil",
        "1/2 cup balsamic vinegar",
        "1/2 cup reduced-sodium soy sauce",
        "2 garlic cloves, pressed",
        "1/4 teaspoon coarse kosher salt",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 cup Marsala (optional)",
        "4 large fresh thyme sprigs",
        "6 large portobello mushrooms",
        "1 10-ounce package frozen spinach",
        "1 pound button mushrooms",
        "2 tablespoons olive oil",
        "1 cup chopped sweet onion (such as Maui or Vidalia)",
        "3 garlic cloves, pressed",
        "1/4 cup plus 6 tablespoons finely grated Parmesan cheese",
        "1/4 cup unseasoned dry breadcrumbs",
        "1 5-ounce package soft fresh goat cheese, crumbled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Marinate",
        "Roast",
        "Vegetarian",
        "Lunch",
        "Goat Cheese",
        "Parmesan",
        "Spinach",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Portobello Mushrooms Stuffed with Spinach and Goat Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/portobello-mushrooms-stuffed-with-spinach-and-goat-cheese-351016"
}
