{
    "directions": [
        "In a kettle cook the garlic, the onions, and the carrot in the oil over moderately low heat, stirring, until the vegetables are softened. Add the russet potatoes, peeled and cut into 1-inch pieces, the broth, and 4 cups water, bring the liquid to a boil, and simmer the mixture, covered, for 10 to 15 minutes, or until the potatoes are tender. While the potatoes are cooking, in a skillet cook the chorizo over moderate heat, stirring, until it is browned lightly and transfer it with a slotted spoon to paper towels to drain. With the slotted spoon transfer the cooked potatoes to a blender, add about 1 1/2 cups of the cooking liquid and purée the mixture until it is smooth. Stir the purée into the broth mixture, add the chorizo, the kale, the red potatoes, cut into 1-inch pieces, and salt and pepper to taste, and simmer the soup, covered, for 10 minutes, or until the potatoes are tender."
    ],
    "ingredients": [
        "2 garlic cloves, minced",
        "1 1/2 cups finely chopped onions",
        "3/4 cup sliced carrots",
        "1/4 cup olive oil",
        "1 pound russet (baking) potatoes (about 2 large)",
        "4 cups chicken broth",
        "3/4 pound Spanish chorizo (cured spicy pork sausage, available at Hispanic markets and some specialty food shops), cut into 1/4-inch pieces",
        "3/4 pound kale, stems discarded and the leaves washed well, spun dry, and shredded thin (about 8 cups packed)",
        "1 pound red potatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Potato",
        "Lunch",
        "Sausage",
        "Kale",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Portuguese Kale and Potato Soup",
    "url": "http://www.epicurious.com/recipes/food/views/portuguese-kale-and-potato-soup-10261"
}
