{
    "directions": [
        "Preheat oven to 400°F. Arrange mushrooms, rounded side down, in 13 x 9 x 2-inch glass baking dish. Sprinkle with salt and pepper. Bake until tender, about 15 minutes. Transfer mushrooms to plate. Reduce oven temperature to 250°F.",
        "Meanwhile, heat 3 teaspoons oil in large nonstick skillet over medium heat. Add onion and garlic; sauté until tender, about 7 minutes. Add spinach; toss until wilted, about 3 minutes. Stir in thyme.",
        "Arrange spinach in same baking dish. Top with mushrooms, rounded side down. Fill each mushroom with 2 tablespoons peppers. Place in oven to keep warm.",
        "Whisk eggs in medium bowl to blend. Sprinkle with salt and pepper. Heat 1 teaspoon oil in medium nonstick skillet over medium heat. Pour eggs into skillet; stir until softly set, about 2 minutes. Fill mushrooms with scrambled eggs. Top each with 1 tablespoon peppers. Divide spinach and mushrooms among 4 plates."
    ],
    "ingredients": [
        "4 3 1/2- to 4-inch-diameter portobello mushrooms, stems and gills removed",
        "4 teaspoons olive oil",
        "3/4 cup chopped onion",
        "1 tablespoon minced garlic",
        "1 10-ounce package ready-to-use fresh spinach leaves",
        "1 teaspoon chopped fresh thyme",
        "1 7.25-ounce jar roasted red peppers, drained, finely chopped",
        "4 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Mushroom",
        "Onion",
        "Pepper",
        "Breakfast",
        "Brunch",
        "Sauté",
        "Wheat/Gluten-Free",
        "Spinach",
        "Spring",
        "Healthy",
        "Vegetarian",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Portobello Mushrooms with Scrambled Eggs, Spinach and Roasted Red Peppers",
    "url": "http://www.epicurious.com/recipes/food/views/portobello-mushrooms-with-scrambled-eggs-spinach-and-roasted-red-peppers-5218"
}
