{
    "directions": [
        "Peel pears, leaving stems intact. Cut a round of parchment paper to fit inside a wide 4-quart heavy pot.",
        "Bring grape juice, Port, sugar, spices, and 1 cup water to a boil in pot over moderate heat, stirring until sugar is dissolved. Add pears, arranging them on their sides in 1 layer (pears will not be covered by liquid). Cover pears directly with round of parchment. Reduce heat to low and poach pears, turning occasionally, until just tender when pierced with a sharp knife, about 25 minutes. Remove from heat and let pears steep in liquid, covered with parchment, turning occasionally, at least 2 hours and up to 3.",
        "Carefully transfer pears with a slotted spoon to a shallow dish, reserving poaching liquid. Let pears stand at room temperature or chill, covered with parchment.",
        "Pour poaching liquid through a fine-mesh sieve into a bowl (discard spices) and return to pot. Boil, uncovered, until liquid is reduced to about 2 1/2 cups, 25 to 30 minutes. Remove from heat and stir in lemon juice and remaining 1/4 cup water. Pour liquid into an 8- to 9-inch square baking pan (not nonstick).",
        "Freeze liquid 1 1/2 hours, then scrape and stir with a fork, crushing any lumps. Repeat, scraping every hour until evenly frozen, about 4 hours more.",
        "Bring chilled pears to room temperature before serving, about 30 minutes.",
        "Cut a thin slice from bottom of each pear, then stand pears upright on chilled plates. Scrape granita, then serve pears with granita and créme fraîche."
    ],
    "ingredients": [
        "4 firm-ripe Bosc pears",
        "2 cups unsweetened white grape juice",
        "2 cups ruby Port",
        "1/4 cup sugar",
        "6 green or white cardamom pods, smashed",
        "1 (1-inch) piece cinnamon stick",
        "2 whole cloves",
        "1 1/4 cups water",
        "3 tablespoons fresh lemon juice",
        "2/3 cup créme fraîche, well stirred",
        "Special equipment: parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Freeze/Chill",
        "Poach",
        "Pear",
        "Spice",
        "Port",
        "Fall",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Port-and-Spice Poached Pears with Granita",
    "url": "http://www.epicurious.com/recipes/food/views/port-and-spice-poached-pears-with-granita-236028"
}
