{
    "directions": [
        "Heat 2 tablespoons oil in large skillet over medium-high heat. Add onions and sauté until soft, about 5 minutes. Add peppers and sauté until lightly browned, about 6 minutes. Sprinkle mixture with sugar and paprika and sauté 1 minute. Using slotted spoon, transfer mixture to plate; leave drippings in skillet.",
        "Add remaining 1 tablespoon oil to drippings in skillet. Add sausage and cook over medium heat until browned and heated through, turning occasionally, about 5 minutes. Transfer sausage to plate with pepper mixture.",
        "Add wine to skillet; boil until reduced by half, scraping up browned bits, about 3 minutes. Return sausage and pepper mixture to skillet; stir in olives. Cook until heated through, about 2 minutes.",
        "Place baguette quarters on each of 4 plates; fill with sausage mixture, spooning juices over each, and serve."
    ],
    "ingredients": [
        "3 tablespoons olive oil, divided",
        "2 medium onions, thinly sliced",
        "3 bell peppers (1 orange, 1 red, 1 green), thinly sliced into strips",
        "1 teaspoon sugar",
        "1/2 teaspoon sweet paprika",
        "1 pound fully cooked sausage, such as linguiça or kielbasa, cut in half lengthwise and crosswise into 6-inch-long pieces",
        "1 cup dry red wine",
        "2/3 cup Kalamata olives, pitted",
        "1 baguette, halved lengthwise, cut crosswise into quarters"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Olive",
        "Onion",
        "Sauté",
        "Quick & Easy",
        "Lunch",
        "Sausage",
        "Bell Pepper",
        "Red Wine",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Portuguese Sausage Sandwiches with Peppers, Onions, and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/portuguese-sausage-sandwiches-with-peppers-onions-and-olives-109389"
}
