{
    "directions": [
        "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil.",
        "Cut the peppers in half from top to bottom; remove the stem, seeds, and ribs, then place the peppers cut sides down onto the prepared baking sheet.",
        "Cook under the preheated broiler until the skin of the peppers has blackened and blistered, about 5 minutes. Place the blackened peppers into a bowl, and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Once cool, remove the skins and discard. Refrigerate overnight.",
        "Place the portobello mushroom caps into a resealable plastic bag, and pour in the balsamic vinaigrette. Squeeze out excess air, and seal. Marinate overnight in the refrigerator.",
        "The following day, preheat an electric double sided grill (such as George Foreman(R) grill) according to manufacturers' directions. Sprinkle the eggplant slices with garlic powder and onion powder.",
        "Remove the portobello mushrooms from the marinade, and discard the remaining marinade. Cook on the preheated grill until tender 4 to 5 minutes. Cook the eggplant slices on the preheated grill until tender 4 to 5 minutes. Remove, set onto a plate, and sprinkle with Parmesan cheese. Set aside.",
        "To assemble the sandwiches, spread each slice of focaccia with ranch dressing. Place a slice of cheese on each piece of bread. Place the eggplant slices, roasted peppers, and a portobello mushroom onto four of the slices of bread. Top with the remaining bread.",
        "Spray the double sided grill with cooking spray, and cook the sandwiches until the cheese has melted, the sandwiches are hot in the center, and the bread is golden brown, 4 to 5 minutes."
    ],
    "ingredients": [
        "2 red bell peppers",
        "4 portobello mushroom caps",
        "1 cup fat-free balsamic vinaigrette",
        "4 (1/2 inch thick) slices eggplant, peeled",
        "1 teaspoon garlic powder",
        "1 teaspoon onion powder",
        "2 teaspoons grated Parmesan cheese",
        "8 slices focaccia bread",
        "1/4 cup fat free ranch dressing",
        "4 thin slices Swiss cheese",
        "4 thin slices Asiago cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Portobello, Eggplant, and Roasted Red Pepper Panini",
    "url": "http://allrecipes.com/recipe/218636/portobello-eggplant-and-roasted-red/"
}
