{
    "directions": [
        "1. Preheat the oven to 400°F. Puncture each potato with a fork three times, sprinkle each with 1/2 teaspoon of the coarse sea salt, and wrap individually in foil. Bake until tender to the touch, about 40 minutes. Unwrap the potatoes and let cool; when cool enough to handle, cut each into eight wedges. Set aside.",
        "2. While the potatoes are cooling, whisk together the olive oil, 1 teaspoon of the salt, the garlic, pepper, and shallots in a small bowl.",
        "3. Place the portobello caps on a sheet pan with rimmed edges and coat them evenly on both sides with the olive oil mixture, leaving them rounded sides up. Roast until soft in the middle, 8 to 12 minutes.",
        "4. Transfer the portobello caps to a plate, still rounded sides up, and set aside to cool. Pour the wine, vegetable stock, and mustard onto the warm sheet pan to mix with the mushroom cooking juices. Scrape any solids off the tray, then carefully pour this mixture into a large saucepan. Heat the mixture over medium heat until reduced by half, 8 to 10 minutes.",
        "5. Stir the tarragon into the red wine sauce. Remove the saucepan from the heat and cover to keep warm.",
        "6. In a large sauté pan, heat the canola oil over high heat. When the oil is very hot, carefully fry a few potato wedges at a time until they turn brown on all sides, about 6 minutes. Transfer the frites as they are done to a plate lined with paper towels and sprinkle them lightly with the remaining 1 teaspoon salt.",
        "7. Reheat the portobello caps in the oven if necessary. Serve smothered with red wine sauce and frites on the side."
    ],
    "ingredients": [
        "2 russet potatoes, scrubbed",
        "1 teaspoon coarse sea salt",
        "1/4 cup olive oil",
        "2 teaspoons salt",
        "1 teaspoon minced garlic",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon minced shallots",
        "4 portobello mushrooms, stems removed, caps wiped clean",
        "1 cup dry red wine",
        "1/4 cup Vegetable Stock",
        "1 teaspoon Dijon mustard",
        "1 tablespoon chopped fresh tarragon",
        "1/4 cup canola oil for frying"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Mushroom",
        "Potato",
        "Vegetable",
        "Bake",
        "Fry",
        "Vegetarian",
        "Dinner",
        "Vegan",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Portobello Frites",
    "url": "http://www.epicurious.com/recipes/food/views/portobello-frites-51199220"
}
