{
    "directions": [
        "Starting a day ahead, soak the dried cod in cold water for 18 to 24 hours, changing the water several times to remove the majority of the salt. Drain the cod, rinse, and put it in a large pot. Add the milk, garlic, bay leaves, thyme, and enough water to cover the cod by 1 inch; cooking the cod in milk keeps it very moist. Bring to a boil, then simmer gently over medium-low heat for 20 minutes, or until the cod is tender and pliable. Drain (discard the milk) and rinse the fish well, then flake it into a bowl, removing any little bits of skin and bone.",
        "While the cod is cooking, put the potatoes in a pot with water to cover, bring to a boil, then simmer over medium heat for 20 to 25 minutes, until very tender. Drain the potatoes, peel, and mash them well into a bowl with a potato masher, or pass them through a ricer or sieve.",
        "Add the cod to the bowl with the potatoes, along with the onion, minced garlic, parsley, cilantro, and eggs. Beat the mixture vigorously with a wooden spoon until it's really well combined and stiff; a spoon should stand up in it. (if it's too dry, add 1 or 2 tablespoons of milk.) Season with a pinch of pepper and taste for salt — you probably won't need to add any, as the cod itself is still salty in spit of having been soaked and boiled.",
        "With lightly moistened hands or using two tablespoons, shape the cod mixture into egg-shaped balls — you should get about 25. (The cod balls can be covered and refrigerated for up to 1 day before cooking, or frozen in a tightly covered container for several weeks.)",
        "Heat about 1 inch of oil in a deep, heavy skillet or pot to 370°F on a deep-fry thermometer. Add a few of the fritters to the oil and cook, turning them three or four times to get them nicely browned all over. Carefully lift them our of the pan with a slotted spoon and drain on a platter lined with paper towels. Keep going to cook all of the fritters. Taste one and, if needed, sprinkle with salt while the fritters are still hot. Serve hot or at room temperature with a pile of olives and lemon wedges."
    ],
    "ingredients": [
        "1 pound dried, boneless salt cod",
        "2 cups milk",
        "3 garlic cloves",
        "2 bay leaves",
        "1/2 small bunch fresh thyme",
        "4 starchy potatoes, such as Idaho",
        "1 large onion, finely chopped",
        "2 garlic cloves, minced",
        "1 handful fresh flat-leaf parsley, chopped",
        "1 handful fresh cilantro, chopped",
        "2 large eggs",
        "1 to 2 tablespoons milk, as needed",
        "Freshly ground black pepper",
        "Kosher salt, if needed",
        "Peanut oil, for frying",
        "1 cup oil-cured black olives",
        "Lemon wedges, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Citrus",
        "Fish",
        "Garlic",
        "Olive",
        "Potato",
        "Fry",
        "Super Bowl",
        "Cod",
        "Poker/Game Night",
        "Pan-Fry",
        "Thyme",
        "Cilantro",
        "Boil"
    ],
    "title": "Portuguese-Style Salt Cod Fritters with Lemon and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/portuguese-style-salt-cod-fritters-with-lemon-and-olives-233768"
}
