{
    "directions": [
        "Cook all potatoes, garlic, and bay leaf in large saucepan of boiling salted water until very tender, about 12 minutes. Drain; discard bay leaf. Return potatoes to pot. Mash until smooth; cool slightly. Mix in 3 tablespoons cheese. Season with salt and pepper. Whisk in eggs.",
        "Remove mushroom stems and chop finely. Heat 2 teaspoons oil in large nonstick skillet over medium-high heat. Add mushroom stems and onion; sauté 5 minutes. Stir in parsley and rosemary. Season with salt and pepper.",
        "Preheat oven to 400°F. Brush rounded sides of mushrooms with 3 teaspoons oil. Place on baking sheet, gill sides up. Bake 10 minutes. Reduce oven temperature to 350°F. Divide onion mixture among mushroom caps. Mound potato mixture in caps. Sprinkle with 1 tablespoon cheese. Bake until heated through, about 25 minutes.",
        "Heat 1 teaspoon oil in large pot over medium heat. Add spinach; sauté 2 minutes. Season with salt and pepper. Divide among 4 plates. Top each serving with 1 stuffed mushroom."
    ],
    "ingredients": [
        "8 ounces red-skinned sweet potatoes (yams), peeled, chopped",
        "8 ounces white-skinned potatoes, peeled, chopped",
        "6 garlic cloves, peeled, left whole",
        "1 bay leaf",
        "4 tablespoons freshly grated Parmesan cheese",
        "2 large eggs, beaten to blend",
        "4 4- to 5-inch-diameter portobello mushrooms",
        "6 teaspoons olive oil",
        "1/2 cup chopped onion",
        "2 tablespoons chopped fresh parsley",
        "1 teaspoon minced fresh rosemary",
        "2 6-ounce bags fresh baby spinach"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Potato",
        "Side",
        "Bake",
        "Vegetarian",
        "Spinach",
        "Sweet Potato/Yam",
        "Fall",
        "Healthy",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Portobello Mushrooms Stuffed with Parmesan Whipped Potatoes",
    "url": "http://www.epicurious.com/recipes/food/views/portobello-mushrooms-stuffed-with-parmesan-whipped-potatoes-105791"
}
