{
    "directions": [
        "Heat the oil in a heavy pot (wide enough to hold the artichokes with room to spare) over medium-high heat until it just begins to smoke. Stand the artichokes cut sides down in the oil, wait a minute, then reduce the heat to medium-low, sprinkle in the garlic and salt, and cook, without stirring, just until the garlic turns golden and smells toasty, about 3 minutes.",
        "Slowly pour in the wine, cover the pot, and cook, without stirring, at a vigorous simmer until you can insert a sharp knife into the thick artichoke bottoms with barely any resistance, about 25 minutes. Five minutes or so before they're fully tender, remove the lid and scatter on the capers.",
        "Raise the heat to medium-high, and bring the liquid to a boil. Cook until all the wine has evaporated (the bubbling sound will become a sizzle), about 3 minutes. Add the mint and parsley and keep cooking the artichokes in the oil (it's OK if a few of them tip over), until the cut sides of the artichokes are deep golden brown, 3 to 5 minutes. Lower the heat if necessary to prevent the artichokes from getting too dark.",
        "Arrange the artichokes prettily on a plate, and scoop the capers, oil, and slightly crispy herbs over top. Serve straightaway or at room temperature."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil",
        "3 1/2 pounds baby artichokes (about 18), turned (see below)",
        "2 medium garlic cloves, thinly sliced",
        "1 1/2 teaspoons Maldon or another flaky sea salt",
        "1 1/2 cups dry white wine, such as Sauvignon Blanc",
        "1 heaping tablespoon drained capers",
        "A five-finger pinch of mint leaves (preferably black mint), torn at the last minute",
        "A pinch of delicate flat-leaf parsley sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Side",
        "Kid-Friendly",
        "Artichoke",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pot-Roasted Artichokes With White Wine and Capers",
    "url": "http://www.epicurious.com/recipes/food/views/pot-roasted-artichokes-with-white-wine-and-capers-56389515"
}
