{
    "directions": [
        "Bring first 5 ingredients and 8 cups water to a simmer in a medium saucepan over medium heat, stirring until sugar and salt dissolve. Remove from heat; let cool to room temperature. Place brisket and short ribs in a large baking dish. Pour brine over to cover completely. Cover and chill for at least 8 hours or overnight. Remove meat; rinse and set aside.",
        "Place first 6 ingredients in center of a triple layer of cheesecloth. Gather up edges; tie with kitchen twine to form a bundle for bouquet garni. Wrap marrow bones in cheesecloth; tie into a bundle with twine. If desired, tie oxtails with twine around circumference to keep meat from falling off bones.",
        "Place brisket, short ribs, bouquet garni, marrow bones, oxtails, beef bones, veal bones, veal breast, 2 chopped carrots, celery, and onion in a very large heavy pot. Add water to cover meat (about 7 quarts). Bring to a boil, skimming off any scum and fat that rise to the surface. Reduce heat and simmer, skimming occasionally, until short ribs are tender, 2-2 1/2 hours.",
        "Transfer short ribs to a 13x9x2\" baking dish; add 4 cups broth from pot and tent with foil to keep meat warm and moist. Add sausage to pot; continue simmering until sausage is cooked through and remaining meats are tender, about 30 minutes longer. Transfer sausage, brisket, oxtails, and marrow bones to dish with short ribs.",
        "Place a large strainer over another large pot; strain broth, discarding remaining meats, bones, and other solids in strainer. (You should have about 10 cups broth.) Return broth to a boil; add rutabagas, cabbage, potatoes, and 2\" pieces of carrots. Simmer until vegetables are tender but not mushy, about 30 minutes.",
        "Mix first 5 ingredients in a small bowl to make salsa verde. Season with salt and pepper; set aside. Stir crème fraîche and horseradish in another small bowl; season with salt.",
        "Transfer vegetables to a platter. Thinly slice brisket against the grain; cut sausage into 2\" pieces. Return meats to baking dish.",
        "Season broth in pot to taste with salt and pepper; divide among bowls. (Reserve broth from meats for another use.) Serve meats and vegetables with salsa verde, horseradish crème fraîche, and both mustards in small bowls alongside. Serve with toasted country bread."
    ],
    "ingredients": [
        "1/2 cup kosher salt",
        "1/4 cup sugar",
        "1 head of garlic, halved crosswise",
        "1 teaspoon whole black peppercorns",
        "2 fresh bay leaves (or 1 dried)",
        "2 pound beef brisket",
        "3 4\" pieces bone-in beef short ribs",
        "1 head of garlic, halved crosswise",
        "10 sprigs flat-leaf parsley",
        "10 sprigs thyme",
        "3 fresh bay leaves (or 1 dried)",
        "3 whole cloves",
        "1 teaspoon whole black peppercorns",
        "3 2\"-3\" long marrow bones",
        "2 pounds oxtails",
        "2 pounds beef bones",
        "1 pound veal bones",
        "1 pound veal breast",
        "5 large carrots (about 1 pound), peeled (2 chopped, 3 cut into 2\" pieces)",
        "2 celery stalks, chopped",
        "1 onion, quartered",
        "1 1-pound piece garlic sausage",
        "2 rutabagas (about 1 pound), peeled, cut into wedges",
        "1 small head of savoy cabbage (about 1 pound), halved",
        "1 pound baby potatoes",
        "1/2 cup extra-virgin olive oil",
        "1/4 cup finely chopped flat-leaf parsley",
        "1/4 cup finely chopped fresh chives",
        "1/4 cup finely chopped fresh tarragon",
        "2 garlic cloves, minced",
        "Kosher salt and freshly ground black pepper",
        "1/4 cup crème fraîche",
        "2 tablespoons prepared white horseradish, drained",
        "Whole grain mustard",
        "Dijon mustard",
        "Toasted sliced country bread",
        "Special equipment: Cheesecloth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Herb",
        "Potato",
        "Bastille Day",
        "Dinner",
        "Beef Rib",
        "Brisket",
        "Carrot",
        "Fall",
        "Winter",
        "Potluck",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pot-Au-Feu",
    "url": "http://www.epicurious.com/recipes/food/views/pot-au-feu-367768"
}
