{
    "directions": [
        "To make the bouquet garni, place the parsley, peppercorns, bay leaf and thyme in the center of a large piece of cheesecloth. Fold the cheesecloth over several times to enclose the contents and tie the ends together in a knot.",
        "Place the beef, broth, 4 cups water, onion and bouquet garni in a 4-quart Dutch oven. Set over medium-high heat and bring to a boil. Reduce the heat to medium-low and simmer, uncovered, for 30 minutes, skimming off the foam as needed. Then cover and simmer for 2 hours more.",
        "Add the carrots, potatoes and salt and cook, covered, for 30 minutes. Add the turnips and cook, covered, for 15 minutes. Transfer the beef to a cutting board and cover loosely with aluminum foil. Add the cabbage to the pot and cook, covered, stirring occasionally, for 15 minutes. Remove the bouquet garni and discard. Taste the broth and adjust the seasoning with salt.",
        "Cut the beef into large chunks and divide among warmed bowls. Divide the vegetables and broth evenly among the bowls. Serve the pot-au-feu with horseradish, mustard and kosher salt alongside. Serves 6."
    ],
    "ingredients": [
        "10 fresh flat-leaf parsley sprigs",
        "20 peppercorns",
        "1 bay leaf",
        "5 fresh thyme sprigs",
        "3 lb. beef chuck roast, trimmed of excess fat, cut into 6 pieces",
        "2 cups beef broth",
        "1 yellow onion, quartered",
        "3 large carrots, about 3/4 lb. total, peeled and each cut into 4 pieces",
        "3 small Yukon Gold potatoes, about 3/4 lb. total, peeled and quartered",
        "Kosher salt, to taste",
        "2 turnips, about 3/4 lb. total, peeled and each cut into 6 wedges",
        "8 oz. savoy cabbage leaves, coarsely chopped",
        "Prepared horseradish for serving",
        "Dijon mustard for serving"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pot-au-Feu",
    "url": "http://www.williams-sonoma.com/recipe/pot-au-feu.html"
}
