{
    "directions": [
        "1. To make the filling, first water blanch the bok choy. In a pot, bring the water to a boil over high heat. Add the 1 tablespoon salt and the baking soda (if using). When the water returns to a boil, add the bok choy stalks and allow the water to return to a boil. Add the bok choy leaves and blanch for 1 minute, or until the leaves turn bright green. Immediately turn off the heat. Run cold water into the pot, then drain off the water. Repeat.",
        "2. In a large bowl, place the bok choy, the 1 teaspoon salt, and all of the remaining filling ingredients. Using a wooden spoon or 2 pairs of wooden chopsticks, mix the ingredients together, stirring them in one direction. Stirring in this way ensures the mixture will become a cohesive filling. Cover and refrigerate for at least 6 hours or up to overnight. The longer it rests, the easier it will be to work with.",
        "3. To make the dough: In a large bowl, place the flour and make a well in the center. Gradually add the water to the well, and use your fingers to combine it with the flour until it is absorbed and a firm dough forms. If the dough is too dry, add a little more water. Knead the dough in the bowl for about 15 minutes, or until smooth and elastic. Cover the dough with a damp cloth and allow to rest for 1 1/2 hours.",
        "4. Dust a work surface with flour. Divide the dough into 3 equal pieces. Work with 1 piece at a time, and keep the others covered with the damp cloth. Using your palms, roll into a log 12 inches long. Cut crosswise into 12 equal pieces. Using a small rolling pin, roll out each piece into a 3-inch round. Keep the work surface well dusted with flour as you work.",
        "5. Place 1 round on the palm of one hand, place 1 tablespoon of the filling on the center, and fold the round into a half-moon. Using the thumb and forefinger of the other hand pleat the seam closed, making from 5 to 7 pleats. Repeat to form more dumplings until all of the rounds are used. Cover the dumplings with plastic wrap to prevent them from drying out, then repeat with the remaining two pieces of dough in two batches to make a total of 36 dumplings.",
        "6. In a cast-iron frying pan, heat 3 tablespoons of the peanut oil over high heat. When a wisp of white smoke appears, turn off the heat and place 18 of the dumplings in the pan. Turn on the heat to medium and allow the dumplings to cook for 3 minutes. Pour 1/2 cup of the water into the pan and allow the dumplings to cook for 7 to 10 minutes, or until the water evaporates. Reduce the heat to low and allow the dumplings to cook for about 2 minutes, or until they are golden brown on the bottom and the skins are translucent on top. To ensure the dumplings cook evenly, move the pan back and forth on the burner to distribute the heat evenly and prevent sticking.",
        "7. Remove to a heated dish and serve. Because these dumplings are best eaten hot, serve in batches."
    ],
    "ingredients": [
        "4 cups water",
        "1 tablespoon salt plus 1 teaspoon",
        "1/2 teaspoon baking soda (optional)",
        "3/4 cup sliced bok choy stalks (1/4-inch-wide pieces)",
        "1 1/2 cups firmly packed sliced bok choy leaves (1/4-inch-wide pieces)",
        "14 ounces ground pork",
        "1/3 cup finely sliced scallions",
        "2 teaspoons peeled and grated ginger",
        "2 teaspoons white rice wine",
        "1 medium egg, lightly beaten",
        "1 1/2 teaspoons light soy sauce",
        "2 teaspoons sesame oil",
        "2 teaspoons sugar",
        "Pinch of white pepper",
        "2 tablespoons cornstarch",
        "2 cups Pillsbury Best All-Purpose Flour",
        "3/4 cup plus 2 tablespoons water",
        "6 tablespoons peanut oil",
        "1 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Pork",
        "Vegetable",
        "Appetizer",
        "Side",
        "Fry",
        "Dinner",
        "Lunar New Year",
        "Meat",
        "Bok Choy",
        "Party",
        "Sugar Conscious",
        "Dairy Free",
        "Tree Nut Free"
    ],
    "title": "Pot Stickers",
    "url": "http://www.epicurious.com/recipes/food/views/pot-stickers-357550"
}
