{
    "directions": [
        "Preheat convection oven to 425°F or regular oven to 450°F with rack in middle.",
        "Pat meats dry, then rub with 2 1/2 teaspoons salt (total) and arrange in 1 layer in a large shallow baking pan with quartered onions and halved carrots. Roast, turning occasionally, until meats and vegetables are well browned, 35 to 45 minutes in convection oven; 45 minutes to 1 hour in regular oven.",
        "Transfer meats and vegetables to pot with any juices from pan. Deglaze pan with a little water, scraping up brown bits, then add to pot with water (6 quarts) and 1 teaspoon salt. Bring to a simmer, skimming foam and fat from surface.",
        "Tie celery, parsley, thyme, bay leaves, peppercorns, and clove in a cheesecloth bundle and add to pot.",
        "Cut off dark green part from leeks, reserving remainder, and wash . Fold greens and tie in 2 bunches, then add to pot. Gently simmer, uncovered, skimming as necessary, until meats are very tender, about 3 hours.",
        "Trim roots from leeks, keeping ends intact, then, starting 1 1/2 inches from root end, slit each leek lengthwise and wash between layers. Tie leeks together in 2 bunches, tying each bunch in 2 places.",
        "Blanch boiling onions in a medium pot of boiling water 1 minute, then drain and peel.",
        "Preheat oven to 200°F with rack in lower third.",
        "Transfer meats to a shallow baking pan, discarding bones from short ribs, and keep warm, covered with foil, in oven. Discard cheesecloth bundle, leek greens, and cooked onions and carrots from broth, then skim off fat from broth with a skimmer or large spoon and keep broth warm over low heat.",
        "Arrange marrowbones (if using) upright in 1 layer in a medium saucepan and add enough broth from pot (about 1 quart) to cover bones. Add 1 teaspoon salt and simmer gently, uncovered, until marrow is soft, 15 to 20 minutes.",
        "While marrowbones cook, simmer boiling onions and leeks with 1 teaspoon salt and 1/2 teaspoon pepper in remaining broth in large pot, uncovered, 15 minutes.",
        "Add small carrots and turnips and simmer, uncovered, until all vegetables are tender, about 15 minutes.",
        "Transfer marrowbones with tongs to a platter (discard liquid) and serve with baguette slices and coarse salt.",
        "Discard bone from chuck roast and slice chuck 1/2 inch thick, then arrange, along with meat from short ribs, on a large platter.",
        "Transfer vegetables to platter with a slotted spoon and cut string off leeks.",
        "Season broth with salt and pepper, then spoon some over meats and vegetables to moisten and serve remainder in a soup tureen.",
        "To eat, ladle broth over meats and vegetables in soup plates, then stir in horseradish and mustard to taste."
    ],
    "ingredients": [
        "4 pound tied bone-in beef chuck roast",
        "4 pound (2- to 3-inch) bone-in short ribs",
        "2 onions, quartered",
        "2 medium carrots, halved lengthwise",
        "6 quarts water",
        "2 (3-inch) pieces celery",
        "6 parsley sprigs",
        "6 thyme sprigs",
        "2 Turkish bay leaves or 1 California",
        "1/4 teaspoon black peppercorns",
        "1 whole clove",
        "8 small or 4 medium leeks (2 1/2 pounds)",
        "1 pound small boiling onions (about 20), left unpeeled",
        "8 (2-inch-long) veal marrowbones (optional)",
        "8 small carrots (1 pound), peeled and trimmed, leaving 1/2 inch of stems",
        "1 pound small turnips, peeled and cut into 1-inch wedges",
        "Equipment: a 12-quart pot; cheesecloth; kitchen string",
        "Accompaniments: toasted baguette slices for marrow; coarse salt; Dijon mustard; finely grated fresh or bottled horseradish; cornichons",
        "Garnish: chopped parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Roast",
        "Dinner",
        "Fall",
        "Winter",
        "Gourmet",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Pot-au-Feu",
    "url": "http://www.epicurious.com/recipes/food/views/pot-au-feu-241767"
}
