{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C).",
        "Heat vegetable oil in a large, heavy pot or cast-iron Dutch oven over medium heat. Brown chuck roast in the hot oil completely, 5 to 8 minutes per side; season with salt and black pepper and transfer to a platter. Reserve oil in pot.",
        "Cook and stir onion and garlic in the oil until onions are golden, about 15 minutes. Stir beef stock, tomatoes, red wine vinegar, brown sugar, and bay leaves into onions and garlic; bring to a boil and place chuck roast into the mixture. Cover pot.",
        "Cook in the preheated oven until meat is very tender, 4 to 4 1/2 hours. Scatter carrot slices around the beef and bring to a boil over medium heat; return to oven for 30 more minutes. Distribute potatoes around the beef and vegetables, bring to a boil again over medium heat, and bake until potatoes are tender, about 30 more minutes.",
        "Transfer beef to a serving platter, cover loosely with a tent of aluminum foil, and set aside to rest for 10 minutes.",
        "Stir mushrooms into pan drippings; bring to a simmer over low heat. Whisk cornstarch into cold water in a small bowl and stir into the drippings. Season with celery salt, basil, and thyme. Simmer until thickened, about 5 minutes. Remove and discard bay leaves. Slice beef; serve on a platter surrounded by vegetables. Pour gravy over beef."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "1 (3 1/2) pound boneless beef chuck roast",
        "salt and ground black pepper to taste",
        "1 large onion, finely chopped",
        "1 clove garlic, chopped, or to taste",
        "2 1/2 cups beef stock",
        "1 (16 ounce) can diced tomatoes",
        "1/4 cup red wine vinegar",
        "1 tablespoon brown sugar",
        "2 bay leaves",
        "3/4 pound carrots, cut diagonally into 1-inch-thick slices",
        "1 pound small red potatoes, quartered lengthwise",
        "1 (6 ounce) jar mushrooms, or more to taste",
        "1 1/2 tablespoons cornstarch",
        "1 1/2 tablespoons cold water",
        "1 pinch celery salt, or to taste",
        "1 pinch dried basil, or to taste",
        "1 pinch dried thyme, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pot Roast with Vegetables",
    "url": "http://allrecipes.com/recipe/229953/pot-roast-with-vegetables/"
}
