{
    "directions": [
        "Mix 1 tablespoon flour, salt, and pepper together in a shallow bowl. Coat entire beef roast with flour mixture.",
        "Heat olive oil in a large pot over medium heat; cook beef roast in the hot oil until browned on all sides, about 5 minutes. Add 1/4 cup water, vinegar, and 1 teaspoon dill to the pot. Cover pot and simmer until pot roast is tender, about 2 hours.",
        "Arrange potatoes and carrots around roast; cover pot and cook until potatoes are tender, about 40 minutes. Add zucchini to roast mixture; cook until zucchini is tender, about 20 minutes.",
        "Transfer roast and vegetables to a warm serving platter; cover loosely with aluminum foil. Pour the remaining drippings into a bowl.",
        "Whisk 1 tablespoon drippings and 1 tablespoon flour together in the same pot; cook and stir over low heat until smooth and bubbly, 1 to 2 minutes. Remove pot from heat. Pour remaining drippings into a measuring cup, adding enough water for total liquid to equal 1 cup.",
        "Return pot to stove and stir drippings-water mixture into flour mixture; bring to a boil and cook gravy for 1 minute. Remove pot from heat and season gravy with salt and pepper. Stir sour cream and 1 teaspoon dill into gravy until smooth. Heat gravy over low heat until warmed, 2 to 3 minutes; serve alongside roast and vegetables."
    ],
    "ingredients": [
        "2 tablespoons all-purpose flour, divided",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1 (2 1/2 pound) beef chuck roast",
        "1 tablespoon olive oil",
        "1/4 cup water",
        "1 tablespoon vinegar",
        "2 teaspoons dried dill weed, divided",
        "5 small potatoes",
        "5 carrots, quartered",
        "1 pound zucchini, cut into chunks",
        "water as needed",
        "1 cup sour cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pot Roast with Sour Cream Gravy",
    "url": "http://allrecipes.com/recipe/238008/pot-roast-with-sour-cream-gravy/"
}
