{
    "directions": [
        "Position racks in upper and lower thirds of oven and preheat to 350°F. Season beef liberally with salt and pepper. In large Dutch oven or heavy ovenproof pot over moderately high heat, heat oil until hot but not smoking. Add beef and sear until dark brown and crisp on both sides, about 10 minutes total. Transfer beef to large plate. Pour off oil in pan and discard. Add sherry and simmer uncovered, scraping up browned bits on bottom of pan, until reduced by half, about 5 minutes. Pour reduced sherry into heatproof liquid measuring cup.",
        "In same pan, combine carrots, onions, celery, garlic, and bay leaf. Lay beef on top of vegetable mixture and pour reduced sherry over. Add enough chicken stock to cover 3/4 of meat. Cover and transfer to lower rack in oven. Roast until fork-tender, about 3 hours.",
        "During final hour of roasting, in large bowl, toss carrots with olive oil until well coated. Season generously with kosher salt and freshly ground black pepper. Spread on baking sheet and transfer to upper rack in oven. Roast until slightly tender and browned, about 45 minutes. Transfer to large bowl and keep warm.",
        "During final 30 minutes of roasting, in heavy 12-inch skillet over moderately high heat, heat canola oil until hot but not smoking. Add onions and sauté, stirring constantly, until caramelized, about 20 to 25 minutes. Season to taste with kosher salt, add to roasted carrots in large bowl, and keep warm.",
        "When beef is tender, transfer to serving platter; tent with foil. Skim fat from liquid in pot. Strain liquid through fine-mesh sieve, pressing on solids with back of spoon to extract all juices, then discarding solids. Return liquid to pot, set over high heat, and bring to boil. Reduce heat to moderate and simmer, uncovered, until reduced slightly, about 5 minutes. Season juices to taste with salt and freshly ground black pepper.",
        "Pour half of juices into bowl with carrots and onions; toss to combine. Pour other half of juices into gravy dish. Arrange carrots and onions around beef on serving platter and serve immediately, with extra juices on side."
    ],
    "ingredients": [
        "1/2 cup canola oil",
        "Kosher salt and freshly ground black pepper",
        "5 pounds boneless short ribs, denuded (all surface fat removed; have your butcher do this)",
        "1 cup dry sherry",
        "4 carrots, peeled and roughly chopped",
        "2 large onions, peeled and roughly chopped",
        "8 stalks celery, peeled and roughly chopped",
        "8 cloves garlic, unpeeled",
        "1 bay leaf",
        "About 8 cups (2 quarts) chicken stock or low-sodium chicken broth",
        "6 medium carrots (about 2 pounds) peeled, halved lengthwise, then halved horizontally",
        "1/4 cup extra-virgin olive oil",
        "Kosher salt and freshly ground black pepper",
        "2 tablespoons canola oil",
        "3 medium Spanish onions, sliced crosswise into 1/4-inch-thick slices (about 6 to 7 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Vegetable",
        "Braise",
        "Roast",
        "Dinner",
        "Meat",
        "Beef Rib",
        "Carrot",
        "Winter"
    ],
    "title": "Pot Roast with Caramelized Onions and Roasted Carrots",
    "url": "http://www.epicurious.com/recipes/food/views/pot-roast-with-caramelized-onions-and-roasted-carrots-236745"
}
