{
    "directions": [
        "Generously season the brisket on all sides with salt and pepper. In the stovetop-safe insert of a slow cooker over medium-high heat, warm the olive oil until just smoking. Add the brisket and sear on all sides and ends, 12 to 15 minutes total. Transfer to a platter.",
        "Add the onions to the insert and cook, turning once, 2 to 3 minutes per side. Add the garlic and stir until fragrant, about 1 minute. Sprinkle with the flour and stir until fragrant, 1 to 2 minutes. Slowly add the wine, stirring constantly. Add the demi-glace, tomato paste, broth and herb bundle and bring to a simmer, then continue to simmer until the liquid is slightly thickened, 3 to 4 minutes.",
        "Return the brisket, seam side down, to the insert and transfer to the slow-cooker base. Cover and cook on high according to the manufacturer’s instructions for 4 hours. Add the carrots, re-cover and cook until the carrots and brisket are fork-tender, 1 to 1 1/2 hours more. Carefully transfer the brisket to a carving board, cover loosely with aluminum foil and let rest for 20 to 30 minutes.",
        "Meanwhile, skim the excess fat off the cooking liquid and set the insert on the stovetop over medium-high heat. Bring to a simmer, then add the chard and simmer until the sauce is slightly thickened, 5 to 8 minutes. Adjust the seasonings with salt and pepper.",
        "Cut the brisket into slices and spoon the sauce and vegetables on top. Serves 6 to 8."
    ],
    "ingredients": [
        "1 flat-cut beef brisket, 4 1/2 to 5 lb., rolled and tied",
        "Salt and freshly ground pepper, to taste",
        "1 Tbs. olive oil",
        "1 1/2 lb. cipollini onions, peeled",
        "4 garlic cloves, smashed",
        "1/4 cup all-purpose flour",
        "1/2 cup dry red wine, such as Zinfandel",
        "2 Tbs. mushroom demi-glace",
        "1/4 cup tomato paste",
        "1 3/4 cups beef broth",
        "3 each fresh rosemary and thyme sprigs, tied in a cheesecloth",
        "5 carrots, peeled and cut into 1 1/2-inch pieces",
        "2 bunches Swiss chard, stems and large ribs removed, leaves cut into 1-inch strips, blanched and squeezed of excess moisture"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pot Roast Brisket",
    "url": "http://www.williams-sonoma.com/recipe/pot-roast-brisket.html"
}
