{
    "directions": [
        "Pulse cabbage, in batches if necessary, in a food processor until finely chopped, then transfer to a bowl and add 3/4 teaspoon salt and liquid from pickled beets. Finely chop beets (with a knife) and stir into cabbage mixture along with vinegar. Let stand, stirring occasionally, 30 minutes to allow flavors to develop.",
        "Remove skin and fat from duck leg and finely chop them (reserve meat), then cook in a 10-inch heavy skillet over moderately low heat, stirring occasionally, until fat is rendered and skin is golden and crisp, about 10 minutes. Transfer duck skin with a slotted spoon to paper towels to drain, reserving fat in skillet. Meanwhile, remove duck meat from bone, discarding bone, and cut into 1/4-inch dice. Add onion to skillet and cook over moderate heat, stirring occasionally, until browned, 7 to 9 minutes. Combine onion, duck meat, and reserved skin in a large bowl.",
        "Peel potatoes and shred using large holes of a box grater. Squeeze potatoes by handfuls to eliminate excess moisture, then add to duck mixture along with egg, pepper, and remaining 3/4 teaspoon salt, stirring until combined.",
        "Spread 1/2 cup bread crumbs on a sheet of wax paper. Using a scant 1/4 cup potato mixture for each pancake, make 12 mounds on crumbs. Coat mounds with remaining 1/2 cup crumbs and flatten into 3-inch patties.",
        "Heat oil in a 12-inch heavy skillet over moderate heat until hot but not smoking. Using a slotted spatula, gently shake off excess crumbs from each potato pancake, then fry in 2 batches, turning over once, until golden, about 6 minutes per batch. Transfer to paper towels to drain. Serve immediately, with slaw."
    ],
    "ingredients": [
        "1 1/4 lb red cabbage (1/2 head), cored and cut into 2-inch chunks",
        "1 1/2 teaspoons salt",
        "1 (16-oz) jar pickled beets",
        "3 tablespoons cider vinegar",
        "1 (6-oz) confit duck leg*",
        "1 medium onion, cut into 1/4-inch dice",
        "2 russet (baking) potatoes (about 1 lb total)",
        "1 large egg, lightly beaten",
        "1/4 teaspoon black pepper",
        "1 cup fine dry bread crumbs",
        "1/2 cup vegetable oil for frying",
        "Garnish: chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Duck",
        "Potato",
        "Vegetable",
        "Fry",
        "Beet",
        "Fall",
        "Winter",
        "Cabbage",
        "Gourmet"
    ],
    "title": "Potato Pancakes with Confit Duck and Red-Cabbage Beet Slaw",
    "url": "http://www.epicurious.com/recipes/food/views/potato-pancakes-with-confit-duck-and-red-cabbage-beet-slaw-232974"
}
