{
    "directions": [
        "Melt butter in small saucepan over medium heat. Whisk in flour. Cook 30 seconds, whisking constantly. Whisk in milk and nutmeg. Simmer until sauce thickens and comes to boil, 1 to 2 minutes. Season to taste with salt. DO AHEAD: Can be made 1 day ahead. Press plastic wrap onto surface and chill.",
        "Preheat oven to 350°F. Heat chicken fat in large ovenproof skillet over medium-high heat. Add onions; sprinkle with salt. Sauté until onions are light golden, about 14 minutes. Stir in bay leaves and thyme sprig; dot with butter. Place skillet in oven; bake until onions are dark golden, stirring often, about 30 minutes. Transfer onions to bowl; discard bay leaves and thyme sprig. DO AHEAD: Can be made 1 day ahead. Cover; chill.",
        "Preheat oven to 375°F. Line large baking sheet with parchment paper. Soak potato slices in large bowl of cold water 15 minutes. Drain well; pat dry.",
        "Add enough oil to heavy medium skillet to reach depth of 3/4 inch. Place over medium heat; attach deep-fry thermometer and heat oil to 325°F. Working in batches, add potato slices to oil and cook just until softened but not brown, about 2 minutes per batch. Using slotted spoon, transfer potato slices to prepared baking sheet in single layer and sprinkle with salt and pepper.",
        "Brush inside of four 4-inch-diameter tart pans with melted butter. Line each pan with overlapping potato slices. Cover bottom of each potato crust with 1/4 of onions; sprinkle with chopped thyme. Spread 1 generous tablespoon béchamel over. Sprinkle each with 1 tablespoon goat cheese.",
        "Place tarts on small baking sheet. Bake until filling is heated through and potato crust browns, 18 to 20 minutes. Sprinkle each with remaining goat cheese.",
        "Push up pan bottoms, releasing tarts. Arrange tarts on plates. Spoon Heirloom Tomato Salad alongside and serve."
    ],
    "ingredients": [
        "1 1/2 teaspoons butter",
        "1 1/2 teaspoons all purpose flour",
        "1/2 cup goat's milk",
        "Pinch of ground nutmeg",
        "1 tablespoon chicken fat or olive oil",
        "1 1/2 pounds sweet onions (such as Vidalia or Maui), halved, thinly sliced",
        "2 bay leaves (preferably fresh)",
        "1 large fresh thyme sprig",
        "1 1/2 teaspoons butter",
        "1 1-pound russet potato, peeled, sliced into 1/8-inch-thick rounds",
        "Vegetable oil (for deep-frying)",
        "Melted butter",
        "Chopped fresh thyme",
        "4 ounces coarsely crumbled semiaged goat cheese (such as Midnight Moon from Cypress Grove or Onetik Chabrin; about 1/2 cup), divided",
        "Heirloom Tomato Salad",
        "Special equipment: 4 4-inch-diameter tart pans with removable bottoms"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Tomato",
        "Bake",
        "Sauté",
        "High Fiber",
        "Lunch",
        "Goat Cheese",
        "Summer",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Potato-Crusted Goat Cheese Tart with Heirloom Tomato Salad",
    "url": "http://www.epicurious.com/recipes/food/views/potato-crusted-goat-cheese-tart-with-heirloom-tomato-salad-354891"
}
