{
    "directions": [
        "Heat annatto seeds and oil in a very small saucepan over low heat, swirling pan frequently, until oil is bright red-orange and starts to simmer, 1 to 2 minutes. Remove from heat and let stand 10 minutes.",
        "Meanwhile, peel potatoes and cut into 3/4-inch pieces.",
        "Pour annatto oil through a fine-mesh sieve into a wide 7- to 8-quart heavy pot, discarding solids. Cook onion and half of potatoes (reserve remaining potatoes in a bowl of cold water) in annatto oil over moderately high heat, stirring, until onion is softened, 3 to 5 minutes. Add cumin, salt, and pepper and cook, stirring, 1 minute. Add water (7 cups) and bring to a boil, scraping up any brown bits. Reduce heat and simmer, partially covered, until potatoes are very tender, 25 to 30 minutes, then mash into broth. Drain remaining potatoes and add to stew, then simmer, partially covered, until tender, about 20 minutes. Stir in milk and cheese and increase heat to high, then bring to a simmer, stirring. Remove from heat and season with salt and pepper.",
        "Meanwhile, quarter avocados lengthwise, then pit, peel, and cut into 1/2-inch cubes.",
        "Serve stew in large soup bowls, topped with avocado."
    ],
    "ingredients": [
        "2 teaspoons annatto (achiote) seeds",
        "2 tablespoons vegetable oil",
        "3 1/2 lb russet (baking) potatoes",
        "1 cup chopped white onion",
        "Rounded 1/2 teaspoon ground cumin",
        "2 1/4 teaspoons salt",
        "3/4 teaspoon black pepper",
        "7 cups water",
        "1 cup whole milk",
        "5 1/2 oz queso fresco (Mexican fresh cheese) or ricotta salata, coarsely grated (1 1/4 cups)",
        "2 (6- to 7-oz) firm-ripe avocados"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Dairy",
        "Potato",
        "Vegetable",
        "Vegetarian",
        "Gourmet"
    ],
    "title": "Potato Stew",
    "url": "http://www.epicurious.com/recipes/food/views/potato-stew-237192"
}
