{
    "directions": [
        "Peel potatoes and cut into 1/2-inch cubes. Put in a medium saucepan with 1 teaspoon salt and enough water to cover by 1 inch. Simmer until tender, about 15 minutes, then drain in a colander.",
        "Cook onion, spices, and 3/4 teaspoon salt in oil in a 12-inch nonstick skillet over medium-high heat, stirring occasionally, until golden brown, 8 to 10 minutes. Add potatoes and peas and cook, stirring, 3 minutes, then remove from heat and cool slightly.",
        "Preheat oven to 375°F with racks in upper and lower thirds.",
        "Cover stack of phyllo sheets with plastic wrap and a damp kitchen towel. Keeping remaining phyllo covered and working quickly, place 1 sheet on work surface. Gently brush with some butter, then lay a second sheet on top and brush with butter. Cut crosswise into 4 strips. Put 2 tablespoons filling near one corner of 1 strip and fold corner of phyllo over to enclose filling and form a triangle. Continue folding strip, maintaining triangle shape. Put samosa, seam side down, on baking sheet. Make 3 more triangles in same manner. Repeat with remaining phyllo and filling. Generously brush both sides of each samosa with butter and bake, turning samosas over halfway through and switching position of sheets, until golden and crisp all over, about 25 minutes total. Cool slightly. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 1/2 pound Yukon Gold or boiling potatoes",
        "1 large onion, chopped (2 3/4 cups)",
        "1 teaspoon garam masala (Indian spice blend)",
        "1 teaspoon cumin seeds",
        "1 teaspoon coriander seeds",
        "1/4 cup vegetable oil",
        "1/2 cup frozen peas, thawed",
        "12 (17- by 12-inch) phyllo sheets, thawed if frozen",
        "3/4 stick unsalted butter, melted and cooled",
        "Indian chutney"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Appetizer",
        "Side",
        "Bake",
        "Cocktail Party",
        "Vegan",
        "Party",
        "Potluck",
        "Phyllo/Puff Pastry Dough",
        "Cumin",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Potato Samosa Phyllo Triangles",
    "url": "http://www.epicurious.com/recipes/food/views/potato-samosa-phyllo-triangles-358132"
}
