{
    "directions": [
        "Steam potatoes, covered, in a metal steamer basket set in a large pot over boiling water until tender, 20–30 minutes, depending on size. Transfer to a plate and let cool.",
        "Meanwhile, cook eggs in a large saucepan of boiling water until whites are set and yolks are still slightly soft, 7 minutes. Drain; transfer eggs to a bowl of ice water and chill until cold. Drain and peel; set eggs aside.",
        "Toast mustard seeds in a dry small skillet over medium-low heat, tossing constantly, until seeds start to pop, about 1 minute. Transfer to a small bowl (be ready with bowl; once seeds get going, it's chaos).",
        "Whisk vinegar, mustard, and honey in a large bowl. Whisking constantly, gradually add oil; whisk until emulsified. Season with salt and pepper. Set 3 tablespoons vinaigrette aside for drizzling.",
        "Halve potatoes and add to bowl with vinaigrette. Add parsley and toss to coat; season with salt and pepper. Transfer to a platter. Halve reserved eggs and tuck in between potatoes. Drizzle with reserved vinaigrette. Top with pickles, chives, and toasted mustard seeds.",
        "Eggs can be boiled 1 day ahead; drain, cover, and chill. Peel just before using. Vinaigrette can be made 3 days ahead; cover and chill."
    ],
    "ingredients": [
        "2 1/2 pounds new or baby Yukon Gold potatoes, scrubbed",
        "4 large eggs, room temperature",
        "1 teaspoon mustard seeds",
        "3 tablespoons apple cider vinegar",
        "2 tablespoons whole grain mustard",
        "1 teaspoon honey",
        "1/3 cup olive oil",
        "Kosher salt, freshly ground pepper",
        "1 cup parsley leaves with tender stems",
        "3 tablespoons coarsely chopped dill pickles",
        "2 tablespoons chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Egg",
        "Potato",
        "Side",
        "Kid-Friendly",
        "Spring",
        "Summer",
        "Healthy",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Potato Salad with 7-Minute Eggs and Mustard Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/potato-salad-with-7-minute-eggs-and-mustard-vinaigrette-56389652"
}
