{
    "directions": [
        "Prepare barbecue (high heat). Grill corn until husks are blackened on all sides, turning occasionally, about 15 minutes. Cool 15 minutes. Remove husks and silk. Cut kernels from cobs.",
        "Cut 1/2 inch from top and bottom of each pepper. Quarter each pepper lengthwise. Trim ribs and seeds from peppers. Flatten pieces, breaking slightly, if necessary. Place peppers on grill, skin side down. Grill without turning until skins are blackened and blistered, about 10 minutes. Cool 10 minutes. Peel peppers; cut into 1/2-inch squares.",
        "Cook potatoes in large pot of boiling salted water until tender, about 12 minutes. Drain; let cool 5 minutes in strainer. Transfer to large bowl.",
        "Sauté bacon in medium skillet over medium heat until crisp. Using slotted spoon, transfer bacon to paper towels.",
        "Whisk oil and vinegar in small bowl to blend. Season dressing with salt and pepper. Drizzle 1/4 cup dressing over potatoes; toss to coat. Add corn, bell peppers, bacon, cheese, onions, oregano, and 3 tablespoons additional dressing; toss to coat. Season salad with salt and pepper. Add remaining dressing by tablespoonfuls to moisten, if desired. Serve warm or at room temperature."
    ],
    "ingredients": [
        "3 ears fresh corn, unhusked",
        "2 large red bell peppers",
        "2 pounds 1 1/2- to 2-inch-diameter unpeeled red-skinned potatoes (about 24), quartered",
        "4 thick bacon slices, cut into 1/2-inch pieces",
        "1/2 cup extra-virgin olive oil",
        "3 tablespoons Sherry wine vinegar",
        "1/3 cup crumbled blue cheese",
        "1 cup chopped green onions",
        "3 tablespoons chopped fresh oregano"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Pepper",
        "Potato",
        "Picnic",
        "Blue Cheese",
        "Bacon",
        "Corn",
        "Sherry",
        "Summer",
        "Grill/Barbecue",
        "Oregano"
    ],
    "title": "Potato and Corn Salad with Bacon, Blue Cheese, and Sherry Vinaigrette",
    "url": "http://www.epicurious.com/recipes/food/views/potato-and-corn-salad-with-bacon-blue-cheese-and-sherry-vinaigrette-109782"
}
