{
    "directions": [
        "In a kettle combine the potatoes, peeled and quartered, with enough water to cover them by 2 inches, bring the water to a boil, and boil the potatoes for 15 minutes, or until they are tender. Transfer the potatoes with a slotted spoon to a colander, reserving the cooking liquid, and force them through a ricer into a bowl. Add the butter, 1/2 cup of the broth, the vinegar, and salt and pepper to taste and combine the mixture well. Bring the reserved cooking liquid to a boil, add the kale, and boil it for 20 minutes, or until it is crisp-tender. Drain the kale in the colander, refresh it under cold water, and press out the excess water. Stir the kale and 1 cup of the MÜnster into the potato mixture and spread the mixture in a buttered 13- by 9-inch baking dish.",
        "In a large skillet brown the kielbasa over moderate heat and transfer it to a bowl with the slotted spoon. In the fat remaining in the skillet cook the onions over moderate heat, stirring, until they are golden and stir them into the kielbasa. Scatter the kielbasa mixture on top of the potato mixture, sprinkle it with the remaining MÜnster, and pour the remaining 1/4 cup broth on top. The casserole may be prepared up to this point 1 day in advance and kept covered and chilled. Bake the casserole in the middle of a preheated 400°F. oven for 20 minutes, or until it is heated through."
    ],
    "ingredients": [
        "3 pounds russet (baking) potatoes (about 6)",
        "1/2 stick (1/4 cup) unsalted butter",
        "3/4 cup chicken broth",
        "2 tablespoons cider vinegar",
        "2 1/2 pounds kale, coarse stems discarded and the leaves washed well",
        "1/2 pound MÜnster, grated coarse (about 2 cups)",
        "1 pound smoked kielbasa, cut crosswise into 1/4-inch-thick pieces",
        "2 large onions, halved lengthwise and sliced thing crosswise"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Onion",
        "Potato",
        "Bake",
        "Casserole/Gratin",
        "Sausage",
        "Kale",
        "Winter",
        "Gourmet"
    ],
    "title": "Potato, Kale, and Kielbasa Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/potato-kale-and-kielbasa-casserole-11645"
}
