{
    "directions": [
        "In a kettle cover potatoes with salted cold water by 2 inches and simmer until just tender, about 25 minutes. Drain potatoes in a colander. When potatoes are just cool enough to handle, halve larger ones and in a large bowl toss potatoes with 2 tablespoons vinegar.",
        "In a small bowl whisk together mustard, remaining 3 tablespoons vinegar, and salt and pepper to taste. Add oil in a slow stream, whisking until emulsified. Dressing may be made 1 day ahead and chilled, covered. Bring dressing to room temperature before using.",
        "Trim beans and, working over a bowl, cut corn kernels from cobs. Have ready a bowl of ice and cold water. In a large saucepan of boiling salted water cook beans until crisp-tender, about 1 minute for haricots verts or about 5 minutes for regular green beans, and transfer with a slotted spoon to ice water to stop cooking. Drain beans well and add to potatoes. Return water in pan to a boil and blanch corn 30 seconds, or until crisp-tender. Drain corn in a sieve and rinse under cold water to stop cooking. Drain corn well and add to salad. Salad may be prepared up to this point 1 day ahead and chilled, covered. Bring salad to room temperature before proceeding. Gently toss salad with dressing and salt and pepper to taste until combined well."
    ],
    "ingredients": [
        "4 pounds small white boiling potatoes (about 2 inches in diameter)",
        "5 tablespoons cider vinegar",
        "3 tablespoons coarse-grained mustard",
        "cup plus 2 tablespoons olive oil, or to taste",
        "1 pound haricots verts (thin French green beans) or regular green beans",
        "6 ears corn"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Bean",
        "Mustard",
        "Potato",
        "Vegetable",
        "Side",
        "Fourth of July",
        "Picnic",
        "Vinegar",
        "Corn",
        "Green Bean",
        "Summer",
        "Boil",
        "Gourmet",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Potato, Green Bean, and Corn Salad",
    "url": "http://www.epicurious.com/recipes/food/views/potato-green-bean-and-corn-salad-15282"
}
