{
    "directions": [
        "Place dried porcini mushrooms in medium bowl; pour 1 1/2 cups boiling water over. Let stand until mushrooms are soft, about 45 minutes. Using slotted spoon, transfer mushrooms to cutting board and chop coarsely. Reserve soaking liquid.",
        "Meanwhile, heat 1 tablespoon oil in heavy large skillet over medium-high heat. Add crimini mushrooms and garlic; sprinkle with coarse salt and pepper and sauté until beginning to soften, 2 to 3 minutes. Add 1/2 cup wine and simmer until crimini mushrooms are soft, about 4 minutes. Set aside (there may still be liquid in skillet).",
        "Heat remaining 2 tablespoons oil in heavy large pot over medium-high heat. Sprinkle pork with coarse salt and pepper. Add pork to pot and sauté until browned in spots, about 6 minutes. Using slotted spoon, transfer pork to medium bowl. Pour off all but 1 tablespoon fat from pot. Reduce heat to medium. Add coppa and stir 1 minute. Add sausages and cook until brown, breaking up into small pieces with back of spoon, about 3 minutes. Add onion, carrot, and celery. Cover pot and cook vegetables until soft, stirring occasionally, about 8 minutes. Add remaining 2 cups wine; bring to boil, scraping up any browned bits. Simmer until almost all liquid is absorbed. Add tomatoes, 1 cup broth, bay leaves, reserved pork, and porcini mushrooms. Pour in reserved porcini soaking liquid, leaving any sediment behind in bowl. Bring to boil; reduce heat to medium-low and simmer uncovered until pork is tender, adding more broth by 1/4 cupfuls if dry, about 1 hour.",
        "Stir crimini mushroom mixture in skillet into ragù. Season with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cool slightly. Chill uncovered until cool. Cover; keep chilled. Rewarm before continuing.",
        "Spoon off fat from surface of ragù stir in basil. Add Potato Gnocchi; toss gently to coat. Simmer over medium heat until gnocchi are heated through, 3 to 5 minutes.",
        "Divide gnocchi and ragù among bowls. Sprinkle with some of cheese and serve, passing remaining cheese alongside.",
        "Available in the produce section of many supermarkets and at specialty foods stores and Italian markets.",
        "Pair this rich dish with a medium-bodied red with good acidity, like the 2007 Danzante Chianti ($11, Italy)."
    ],
    "ingredients": [
        "1 ounce dried porcini mushrooms*",
        "1 1/2 cups boiling water",
        "3 tablespoons olive oil, divided",
        "8 ounces sliced crimini (baby bella) mushrooms",
        "2 garlic cloves, minced",
        "Coarse kosher salt",
        "2 1/2 cups dry white wine, divided",
        "1 pound boneless country-style pork ribs, cut into 1/2-inch cubes",
        "2 ounces 1/4-inch-thick slices coppa or prosciutto, chopped",
        "6 ounces fresh mild Italian sausages, casings removed (about 2 links)",
        "1 medium onion, finely chopped",
        "1 carrot, peeled, finely chopped",
        "1 celery stalk, finely chopped",
        "2 cups crushed tomatoes or crushed tomatoes with added puree (from one 28-ounce can; preferably San Marzano or Muir Glen)",
        "1 cup (or more) low-salt chicken broth",
        "2 bay leaves",
        "1 tablespoon chopped fresh basil",
        "Potato Gnocchi",
        "1 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Pork",
        "Tomato",
        "Sauté",
        "Low Cal",
        "High Fiber",
        "Dinner",
        "Parmesan",
        "Sausage",
        "Celery",
        "White Wine",
        "Winter",
        "Prosciutto",
        "Simmer",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Potato Gnocchi with Pork and Wild Mushroom Ragù",
    "url": "http://www.epicurious.com/recipes/food/views/potato-gnocchi-with-pork-and-wild-mushroom-ragu-357273"
}
