{
    "directions": [
        "Mix olive oil, white wine vinegar, minced shallots and minced anchovies in medium glass bowl. Whisk in 1 teaspoon each of parsley, basil and marjoram. Season dressing to taste with salt and pepper. Cook all beans in large saucepan of boiling salted water until crisp-tender, about 5 minutes. Drain. Rinse under cold water; pat dry. (Dressing and beans can be prepared 1 day ahead. Cover separately and refrigerate. Let beans stand 2 hours at room temperature before continuing.) Steam potatoes until just tender, about 12 minutes. Transfer to large bowl. Heat dressing in microwave just until warm, about 30 seconds. Pour half of warm dressing over potatoes and toss to coat. Mound warm potatoes in center of platter. Toss beans and remaining dressing in same bowl. Arrange beans around potatoes. Sprinkle with onion, all olives, capers and remaining herbs. Serve warm or at room temperature.",
        "*Small brine-cured black olives, available at Italian markets, specialty foods stores and some supermarkets."
    ],
    "ingredients": [
        "1/8 cup olive oil",
        "1/4 cup white wine vinegar",
        "2 tablespoons minced shallots",
        "4 anchovies, minced",
        "2 teaspoons chopped fresh parsley",
        "2 teaspoons chopped fresh basil",
        "2 teaspoons chopped fresh marjoram",
        "8 ounces green beans, trimmed",
        "8 ounces yellow wax beans, trimmed",
        "2 pounds Yukon Gold potatoes, unpeeled, cut into 1/2-inch cubes",
        "1/2 cup chopped red onion",
        "1/2 cup green olives, pitted, halved",
        "1/2 cup Niçois olives,* pitted, halved",
        "1/4 cup drained capers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Herb",
        "Olive",
        "Onion",
        "Potato",
        "Side",
        "Steam",
        "Picnic",
        "Green Bean",
        "Summer",
        "Capers",
        "Boil",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Potato Salad with Olives, Green Beans and Red Onion",
    "url": "http://www.epicurious.com/recipes/food/views/potato-salad-with-olives-green-beans-and-red-onion-103491"
}
