{
    "directions": [
        "In the bowl of an electric mixer fitted with the paddle attachment proof the yeast with the sugar in the water for 5 minutes, or until the mixture is foamy. In a large bowl combine 4 cups of the flour, the mashed potatoes, and the table salt until the mixture resembles coarse meal, add it with 2 tablespoons of the oil to the yeast mixture, and combine the dough well. With the dough hook knead the dough, scraping down the dough hook occasionally and incorporating as much of the remaining 1/2 cup flour as necessary to prevent it from sticking, for 2 minutes, or until it is smooth and elastic. Form the dough into a ball, transfer it to an oiled bowl, and turn it to coat it with the oil. Let the dough rise, covered with plastic wrap, in a warm place for 1 1/2 hours, or until it is double in bulk. The dough may be made up to this point, punched down, and kept, covered and chilled, overnight. Let the dough return to room temperature before proceeding with the recipe.",
        "In a small bowl stir together the garlic, the rosemary, the anchovy paste, and the remaining 4 tablespoons oil and let the mixture stand, covered. Press the dough evenly into an oiled jelly-roll pan, 15 1/2 by 10 1/2 by 1 inches, and let it rise, covered loosely, in a warm place for 1 hour, or until it is almost double in bulk. Cut the red potatoes into paper-thin slices with a mandoline or handheld slicer, arrange the slices on the dough, overlapping them, and brush them with the oil mixture, discarding the garlic. Sprinkle the focaccia with the Parmesan, the coarse salt, and pepper to taste. Bake the focaccia in the bottom third of a preheated 400°F. oven for 40 to 50 minutes, or until it is golden brown, let it cool in the pan on a rack, and serve it warm or at room temperature."
    ],
    "ingredients": [
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "1/2 teaspoon sugar",
        "1 cup lukewarm water",
        "4 to 4 1/2 cups all-purpose flour",
        "2 cups mashed cooked peeled russet (baking) potatoes (about 1 1/4 pounds)",
        "2 teaspoons table salt",
        "6 tablespoons olive oil",
        "2 garlic cloves, sliced thin",
        "1 tablespoon fresh rosemary leaves, chopped fine, or 1 teaspoon  crumbled dried",
        "1/4 teaspoon anchovy paste, or to taste",
        "1 1/2 pounds small red potatoes, scrubbed",
        "1/4 cup freshly grated Parmesan",
        "1 tablespoon coarse salt, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Cheese",
        "Fish",
        "Potato",
        "Bake",
        "Parmesan",
        "Winter",
        "Gourmet"
    ],
    "title": "Potato, Parmesan, and Anchovy Focaccia",
    "url": "http://www.epicurious.com/recipes/food/views/potato-parmesan-and-anchovy-focaccia-13554"
}
