{
    "directions": [
        "Blanch whole basil leaves in boiling water for 1 minute; drain. Run under cold water; drain and squeeze out any excess water. Place basil in kitchen towel and squeeze out water. Transfer basil to processor. Add 1/2 cup oil; process until basil is very finely chopped. Transfer to small bowl and season with salt. DO AHEAD Basil oil can be made 2 days ahead. Cover and chill. Bring to room temperature before using.",
        "Whisk vinegar and mustard in small bowl to blend. Gradually whisk in remaining 2 tablespoons olive oil. Stir in red onion and 3 tablespoons thinly sliced basil. Season dressing to taste with salt and pepper.",
        "Place potatoes in large saucepan. Add enough water to cover potatoes by 1 inch. Bring to boil, reduce heat to medium, and simmer until tender, about 17 minutes. Drain. Let potatoes stand until just cool enough to handle. Cut into 3/4-inch cubes and place in large bowl. Drizzle dressing over warm potatoes and toss gently to coat. Pour basil oil over potatoes; toss gently to coat. Serve potato salad warm or at room temperature."
    ],
    "ingredients": [
        "1 cup (packed) whole fresh basil leaves plus 3 tablespoons thinly sliced fresh basil",
        "1/2 cup plus 2 tablespoons extra-virgin olive oil",
        "2 1/2 tablespoons unseasoned rice vinegar",
        "2 tablespoons Dijon mustard",
        "1/4 cup chopped red onion",
        "2 pounds medium Yukon Gold potatoes, peeled"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Herb",
        "Potato",
        "Side",
        "Vegetarian",
        "Summer",
        "Vegan",
        "Sugar Conscious",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Potato Salad with Basil Oil",
    "url": "http://www.epicurious.com/recipes/food/views/potato-salad-with-basil-oil-239077"
}
