{
    "directions": [
        "Preheat oven to 400°F. and lightly oil a shallow baking pan.",
        "In a heavy saucepan boil wine with shallot until reduced to about 1/2 cup. Remove pan from heat and whisk in lemon juice, Worcestershire sauce, and parsley. Add oil in a stream, whisking until combined well, and season with salt and pepper. Keep sauce warm.",
        "In a small bowl stir together mayonnaise, capers, anchovies, and salt and pepper to taste.",
        "Pat halibut steaks dry and season with salt and pepper. Spread mayonnaise mixture evenly on top of steaks.",
        "Peel potatoes and quarter lengthwise. Grate potatoes coarse, preferably using a food processor. Pat a heaping 1/4 cup potato evenly on mayonnaise mixture on each steak.",
        "In a 12-inch non-stick skillet heat 2 tablespoons oil over moderate heat until hot but not smoking. Carefully arrange 2 steaks, potato sides down, in oil and cook, pressing down occasionally with a slotted spatula, about 5 minutes, or until potato is golden brown and cooked through. Carefully invert steaks as browned into oiled pan (potato sides should be up) and season with salt and pepper. Repeat procedure with remaining steaks, adding more oil to skillet if necessary.",
        "Bake steaks in pan in middle of oven 10 to 15 minutes, or until just cooked through.",
        "Serve steaks with sauce and garnish with parsley."
    ],
    "ingredients": [
        "1 cup dry white wine",
        "1 large shallot, chopped (about 1/4 cup)",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon Worcestershire sauce",
        "1/2 cup chopped flat-leafed parsley leaves",
        "1/4 cup extra-virgin olive oil",
        "1/4 cup mayonnaise",
        "1 tablespoon chopped drained capers",
        "4 flat anchovies, rinsed, patted dry, and chopped fine",
        "six 1-inch-thick boneless halibut steaks (each about 7 ounces)",
        "3/4 pound russet (baking) potatoes (about 1 1/2)",
        "2 tablespoons olive oil plus additional if necessary",
        "Garnish: flat-leafed-parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Potato",
        "Bake",
        "Mayonnaise",
        "Halibut",
        "Winter",
        "Parsley",
        "Capers",
        "Gourmet"
    ],
    "title": "Potato-Crusted Halibut Steaks",
    "url": "http://www.epicurious.com/recipes/food/views/potato-crusted-halibut-steaks-10043"
}
