{
    "directions": [
        "Preheat the broiler on your oven.",
        "In a frying pan with an ovenproof handle heat the oil and saute onion, garlic and green bell pepper over a low heat. Saute until vegetables are just tender but not browned. Add the zucchini and continue cooking, stirring occasionally, until crisp-tender. Add the potatoes, stir well to combine, and continue cooking, stirring frequently, until the potatoes are heated through and starting to stick to the pan.",
        "Then add the tomatoes and black olives, stirring well to combine with the other ingredients, and cook just until the tomatoes have begun giving up their juice.",
        "Beat the eggs with the salt, pepper, oregano, and cayenne. When all the vegetables are cooked, pour the eggs over them",
        "Arrange the tomato slices over the top of the eggs, and sprinkle the mozzarella and Parmesan cheeses over the tomato slices. Cook gently over low heat until the eggs are almost set (they'll be firm around the edges and a bit runny in the middle).",
        "Slip the pan under the broiler for a minute or two, until the eggs are fully set and the cheese has melted and begun to brown. Cut into wedges and serve."
    ],
    "ingredients": [
        "1 teaspoon olive oil",
        "1/2 cup chopped onion",
        "1 clove garlic, minced",
        "1/2 cup diced green bell pepper",
        "1 zucchini, halved lengthwise and cut in 1/4 inch slices",
        "2 cups cooked and diced potatoes",
        "1 cup chopped fresh tomato",
        "2 tablespoons black olives",
        "4 eggs",
        "salt and pepper to taste",
        "1/4 teaspoon dried oregano",
        "1 pinch cayenne pepper",
        "1/2 small tomato, sliced",
        "1/4 cup shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Potato and Vegetable Frittata",
    "url": "http://allrecipes.com/recipe/16517/potato-and-vegetable-frittata/"
}
