{
    "directions": [
        "Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Add mushrooms and sauté until almost tender, about 5 minutes. Add garlic and sauté until mushrooms are tender and golden, about 3 minutes longer. Transfer mushroom mixture to bowl. Melt remaining 2 tablespoons butter in same skillet over medium-high heat. Add leeks and thyme and sauté until leeks are tender and beginning to brown, about 8 minutes. Add leek mixture to bowl with mushrooms. (Can be made 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 400°F. Butter 13 x 9 x 2-inch baking dish. Whisk broth, cream, wine, 1 teaspoon salt and 1/2 teaspoon pepper in large bowl to blend. Layer 1/3 of potatoes on bottom of prepared dish. Top with half of mushroom-leek mixture, then 3/4 cup cheese. Top with half of remaining potatoes. Pour half of cream mixture over. Top with remaining mushroom-leek mixture and 3/4 cup cheese. Cover with remaining potatoes. Pour remaining cream mixture over; sprinkle with remaining cheese.",
        "Bake gratin uncovered until potatoes are tender and sauce bubbles thickly, about 1 hour 20 minutes. Let gratin stand 30 minutes before serving."
    ],
    "ingredients": [
        "4 tablespoons (1/2 stick) butter",
        "1 pound oyster mushrooms, halved if large",
        "1 tablespoon minced garlic",
        "4 cups thinly sliced leeks (white and pale green parts only; about 4 large)",
        "1 tablespoon minced fresh thyme",
        "1 3/4 cups canned low-salt chicken broth",
        "1 3/4 cups whipping cream",
        "1/4 cup dry white wine",
        "1 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "3 3/4 pounds russet potatoes, peeled, thinly sliced into rounds (about 8 cups)",
        "2 1/2 cups grated Gruyère cheese (about 10 ounces)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Potato",
        "Side",
        "Bake",
        "Casserole/Gratin",
        "Leek",
        "White Wine",
        "Winter",
        "Swiss Cheese"
    ],
    "title": "Potato, Leek, Gruyère and Oyster Mushroom Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/potato-leek-gruyere-and-oyster-mushroom-gratin-15641"
}
