{
    "directions": [
        "Peel the potatoes, transferring them as they are peeled to a bowl of cold water, and grate them coarse, returning them as they are grated to the bowl of water. Drain the potatoes well and pat them dry thoroughly with paper towels. In a deep-fat fryer or deep kettle heat 4 inches of the oil until it registers 375°F. on a deep-fat thermometer. Dip the larger basket of the potato nest fryer into the oil, remove it, and line the bottom and side with some of the potatoes, being careful not burn your fingers. Dip the smaller basket into the oil, press it into the potato-lined larger basket, and clamp the basket handles together firmly. Plunge the fryer into the oil and fry the potato nest for 1 to 3 minutes, or until it is crisp, golden, and cooked through at the bottom. Remove the fryer from the oil, detach the larger basket, and let the potato nest cool on the smaller basket for 3 minutes. Using a small sharp knife, pry off the potato nest carefully from the smaller basket, inserting the knife tip between the wires to loosen the nest. Make 5 more nests in the same manner with the remaining potatoes, sprinkle all the nests with the salt, and keep them warm. The nests may be made 3 hours in advance and reheated in a 350°F. oven.",
        "In a large skillet heat the butter over moderately high heat until the foam subsides and in it sauté the mushrooms, stirring, until they are tender. Stir in the Sherry, boil the mixture for 1 minute, or until the liquid is evaporated, and stir in the cream, the parsley, and salt and pepper to taste.",
        "Divide the mushroom mixture among the potato nests."
    ],
    "ingredients": [
        "3 large russet (baking) potatoes",
        "vegetable oil for deep-frying the nests",
        "a 3 3/4-inch potato nest fryer",
        "coarse salt for sprinkling the nest",
        "1/2 stick (1/4 cup) unsalted butter",
        "1 pound fresh shiitake mushrooms, stems discarded and the caps sliced thin",
        "1/4 cup medium-dry Sherry",
        "2 tablespoons heavy cream",
        "2 tablespoons finely chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Herb",
        "Mushroom",
        "Potato",
        "Side",
        "Fry",
        "Vegetarian",
        "Sherry",
        "Gourmet"
    ],
    "title": "Potato Nests with Sauteed Shiitake Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/potato-nests-with-sauteed-shiitake-mushrooms-11581"
}
