{
    "directions": [
        "Cook onion in oil in a 10-inch heavy skillet over moderate heat, stirring occasionally, until soft and golden, 6 to 8 minutes.",
        "Bring a 6- to 8-quart pot of salted water to a boil. Discard any discolored or damaged tough outer leaves from cabbage, then core cabbage and carefully lower into boiling water using a slotted spoon.",
        "Boil cabbage, pulling off 6 large leaves (to be used as decorative wrappers and eaten if desired) with tongs as they soften and leaving them with remaining cabbage, 5 minutes. Transfer large leaves to a bowl of ice water to stop cooking. Transfer remaining cabbage to a colander to drain. Transfer large leaves to paper towels to drain, then pat dry.",
        "Lightly butter muffin cups, then put 2 parchment strips in a crisscross pattern in each cup. (You will have a 2-inch overhang.) Line each cup with a large cabbage leaf. Coarsely chop enough remaining cabbage to measure 3 cups, then add to onion along with garlic, 1/4 teaspoon salt, 1/8 teaspoon pepper, and water and cook over moderate heat, stirring occasionally, until cabbage is tender and browned, about 10 minutes.",
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Peel potatoes and cut into 1-inch cubes, then cover with cold salted water by 1 inch in a 2- to 3-quart saucepan and bring to a boil. Cook potatoes until tender, about 15 minutes. Drain in a colander, then set potatoes in colander over saucepan to steam-dry, uncovered, 5 minutes. Mash potatoes in a large bowl, then stir in buttermilk, cheese, horseradish, 1/2 stick butter, and remaining 1/2 teaspoon salt and 1/8 teaspoon pepper until combined well.",
        "Melt remaining 2 tablespoons butter in a 10-inch heavy skillet over moderate heat until foam subsides, then cook bread crumbs, stirring frequently, until golden, 5 to 7 minutes.",
        "Fill each cabbage leaf with about 1/2 cup potato mixture, then divide cabbage mixture among leaves. Top with remaining potato mixture, then sprinkle evenly with bread crumbs. Fold edges of cabbage in toward filling (do not completely cover).",
        "Bake until heated through and edges of cabbage are well browned, 25 to 30 minutes.",
        "Transfer stuffed leaves to plates using parchment overhangs."
    ],
    "ingredients": [
        "1 medium onion, halved lengthwise, then sliced crosswise (1 cup)",
        "1 tablespoon vegetable oil",
        "1 large head leafy green cabbage (3 pounds)",
        "1 teaspoon minced garlic",
        "3/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2/3 cup water",
        "2 lb large boiling potatoes",
        "1 cup well-shaken buttermilk",
        "3 oz extra-sharp white Cheddar, coarsely grated (1 cup)",
        "2 tablespoons drained bottled horseradish",
        "3/4 stick (6 tablespoons) unsalted butter",
        "3/4 cup coarse fresh bread crumbs from a country-style loaf",
        "Special equipment: a nonstick muffin tin with 6 (1-cup) muffin cups; 12 (10- by 2-inch) strips of parchment paper",
        "Accompaniment: Irish bacon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Potato",
        "Vegetable",
        "Bake",
        "Sauté",
        "St. Patrick's Day",
        "Horseradish",
        "Cheddar",
        "Spring",
        "Family Reunion",
        "Cabbage",
        "Boil",
        "Gourmet"
    ],
    "title": "Potato and Cabbage Bundles",
    "url": "http://www.epicurious.com/recipes/food/views/potato-and-cabbage-bundles-109209"
}
