{
    "directions": [
        "Place the potatoes and 1 cup of the stock in the slow cooker. Cover and cook on high for 2 hours, or until the potatoes are just tender.",
        "Transfer two-thirds of the potatoes to a food processor or blender, along with the cooking liquid. Add the garlic. Blend to the desired consistency: a blender will yield a smooth texture, a food processor a rough, rustic consistency.",
        "Return the potato purée to the slow cooker and stir in the shredded cheese, the remaining 2/3 cup stock, and the chives. Cover and cook on low for 30 minutes, or until the soup is well heated. Add extra stock or water if the soup is too thick. Break up the whole potato slices with a fork to achieve a texture that suits you. Season with salt and pepper. Stir in the cream just before serving.",
        "Ladle into soup bowls, sprinkle with the crumbled cheese, and serve immediately.",
        "For a Southwestern version of this soup, use cilantro instead of chives, and add 1 (4-ounce) can chopped roasted green chiles and 1 teaspoon each ground cumin and coriander."
    ],
    "ingredients": [
        "4 large potatoes, peeled and sliced",
        "4 cups chicken stock, plus more as needed",
        "1 large clove garlic",
        "1 cup shredded sharp Cheddar cheese, or a mixture of sharp Cheddar and smoked Gouda",
        "1/4 cup chopped fresh chives",
        "Salt and freshly ground black pepper",
        "1 cup heavy cream, half-and-half, or sour cream (optional)",
        "1/4 cup crumbled sharp Cheddar cheese, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Food Processor",
        "Slow Cooker",
        "Chicken",
        "Garlic",
        "Herb",
        "Potato",
        "Kid-Friendly",
        "Back to School",
        "Cheddar",
        "Winter",
        "Chive"
    ],
    "title": "Potato, Cheddar, and Chive Soup",
    "url": "http://www.epicurious.com/recipes/food/views/potato-cheddar-and-chive-soup-237290"
}
