{
    "directions": [
        "Preheat oven to 400°F.",
        "On a flat surface smash garlic heads, root ends up, with palm of hand to break up cloves, leaving peels intact. Put garlic on a sheet of foil and drizzle with 1 tablespoon oil. Sprinkle garlic with salt and pepper to taste and wrap tightly in foil. Bake garlic in middle of oven 40 minutes, or until very tender. Unwrap garlic carefully and let stand until cool enough to handle. In a bowl squeeze roasted garlic out of cloves by squeezing one end, discarding skin.",
        "In a kettle cook onions in remaining tablespoon oil over moderate heat until softened. Peel and cut potatoes into 1/2-inch pieces and add to kettle with water. Bring water to a simmer and cook potatoes, covered, stirring occasionally, until very tender, about 20 minutes.",
        "Transfer half of potatoes with cooking liquid to a bowl and in a blender, in batches, purée with garlic until smooth. Transfer mixture as puréed to kettle, stirring, and season soup with salt and pepper. Soup may be made 1 day ahead, cooled completely, and chilled, covered.",
        "In a large bowl whisk together vinegar, scallion purée, and salt and pepper to taste.",
        "In a saucepan bring water with wheat berries and salt to a gentle boil. Cook wheat berries, uncovered, adding more water if necessary, 1 1/4 hours, or until just tender. Drain wheat berries in a sieve and add to vinegar mixture, tossing to combine well. Let mixture cool. Wheat berry mixture may be made 1 day ahead and chilled, covered. Bring wheat berry mixture to room temperature before proceeding.",
        "In a kettle heat soup over moderate heat, stirring, until hot. In a large bowl toss watercress and endives with wheat berry mixture and season with salt and pepper. Pour soup into 8 serving bowls and garnish each with 1/2 tablespoon scallion purée. Serve soup and salad with bread.",
        "In a saucepan heat 1/4 cup oil over moderate heat and cook scallions just until tender and bright green in color (do not let brown). In a blender purée scallion mixture with remaining 1/4 cup oil until smooth. Season scallion purée with salt and pepper and let cool. Makes about 3/4 cup."
    ],
    "ingredients": [
        "2 large heads garlic, unpeeled",
        "2 tablespoons olive oil",
        "2 medium onions, chopped",
        "4 pounds boiling potatoes (preferably yellow-fleshed, such as Yukon Gold)",
        "8 cups water",
        "2 tablespoons Sherry vinegar*",
        "1/2 cup scallion purée (recipe to follow)",
        "6 cups water",
        "1 cup wheat berries**",
        "1 teaspoon salt",
        "1 bunch watercress, coarse stems discarded, washed well and spun dry (about 3 cups)",
        "4 Belgian endives, leaves separated and cut crosswise into 1/2-inch-thick slices",
        "Garnish: 1/4 cup scallion purée",
        "1/2 cup olive oil",
        "2 cups chopped scallion greens (about 1 bunch), patted dry",
        "Accompaniment:crusty bread",
        "*available at specialty foods shops and some supermarkets",
        "**available at natural foods stores"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Soup/Stew",
        "Garlic",
        "Onion",
        "Potato",
        "Vegetarian",
        "Endive",
        "Watercress",
        "Gourmet"
    ],
    "title": "Potato and Roasted Garlic Soup with Wheat Berry, Watercress, and Endive Salad",
    "url": "http://www.epicurious.com/recipes/food/views/potato-and-roasted-garlic-soup-with-wheat-berry-watercress-and-endive-salad-11437"
}
