{
    "directions": [
        "Place potatoes, whole eggs (do not crack), and 1 teaspoon salt in heavy large pot. Add enough cold water to cover. Partially cover pot. Bring to simmer over medium heat. Simmer 10 minutes. Remove eggs. Continue simmering until potatoes are tender, about 15 minutes longer. Drain. Transfer potatoes to large bow. Crack eggs; remove shells. Add eggs to bowl with potatoes. Using fork, coarsely mash potatoes and eggs. Mix in tuna, reserved tuna oil, green onions, capers, 1/4 teaspoon pepper, and remaining 3/4 teaspoon salt; set aside.",
        "Line 2 baking sheets with plastic wrap. Stack phyllo sheets on work surface. Using shears and a 9-inch plate as a guide, cut phyllo into 18 rounds. Working quickly, stack 3 phyllo rounds on work surface. (Cover remaining phyllo sheets with plastic, then damp kitchen towel to prevent drying.) Place generous 1/4 cup filling in center of phyllo. Sprinkle with 1/6 of parsley. Brush edge with oil. Fold phyllo to form half-moon, pressing slightly. Fold edge over, pressing to seal. Transfer turnover to baking sheet. Repeat with remaining phyllo, filling, parsley, and oil.",
        "Line baking sheet with 3 paper towels. Pour oil into large skillet to depth of 1/2 inch. Heat oil to 350°F. Slide 1 turnover into oil. Fry until bottom is golden, about 1 minute. Using slotted spatula, transfer turnover onto plate; tuno over. Slide back into oil. Fry until bottom is golden, about 1 minute. Drain on baking sheet. Repeat with remaining turnovers."
    ],
    "ingredients": [
        "12 ounces potatoes, peeled, quartered",
        "2 large eggs",
        "1 3/4 teaspoons salt",
        "1 6-ounce can tuna packed in oil, drained, 2 tablespoons oil reserved",
        "3/4 cup chopped green onions",
        "1 tablespoon drained capers",
        "18 sheets frozen phyllo pastry, thawed",
        "1/4 cup chopped fresh Italian parsley",
        "1/4 cup vegetable oil plus additional vegetable oil (for frying)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Appetizer",
        "Fry",
        "Tuna",
        "Spring",
        "Phyllo/Puff Pastry Dough"
    ],
    "title": "Potato and Tuna Turnovers",
    "url": "http://www.epicurious.com/recipes/food/views/potato-and-tuna-turnovers-106454"
}
