{
    "directions": [
        "Preheat oven to 350°.",
        "Peel potatoes and place in cold water.",
        "In a small bowl, combine flour, baking powder, cinnamon, and pepper to taste. Set aside.",
        "Pat potatoes dry and grate on the large holes of a grater. (Long grated shreds are best.)",
        "Place grated potatoes in a large bowl, add onion, and toss. Add flour mixture and toss, breaking up clumps. (This may take a bit of time, as the dry ingredients must be well distributed.) Add eggs and combine well.",
        "In a large nonstick skillet, heat about 1\" oil over high heat. Test heat by carefully dropping a little piece of potato in the oil. If it bubbles violently, the oil is ready.",
        "Using a slotted spoon, place spoonfuls of potato mixture (drained of excess liquid) into oil. Fry until just golden, about 2 minutes on each side. (They will not be cooked through.) Drain on paper towels. Continue until all potato mixture is used. Note: As you get toward the bottom of the bowl, the potatoes will be wetter. They will need to be pressed and will take a bit longer to cook. Arrange latkes on a baking sheet; transfer to oven and bake for about 10 minutes on each side. They will turn a rich golden brown. Season with salt to taste. Serve with applesauce and sour cream, if desired."
    ],
    "ingredients": [
        "4 large baking potatoes (about 4 lb)",
        "3 tbsp all-purpose flour",
        "1/2 tsp baking powder",
        "dash of ground cinnamon",
        "freshly ground black pepper",
        "1/4 cup minced onion",
        "2 large eggs, beaten",
        "neutral oil (such as safflower), for frying",
        "Kosher salt",
        "1 cup applesauce",
        "1 cup sour cream (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Bake",
        "Fall",
        "Winter",
        "Pan-Fry"
    ],
    "title": "Potato Pancakes",
    "url": "http://www.epicurious.com/recipes/food/views/potato-pancakes-51256700"
}
