{
    "directions": [
        "Steam potatoes until very tender, about 15 minutes. Transfer potatoes to large bowl and mash well.",
        "Combine 2 cups leeks and broth in heavy medium saucepan; bring to boil over medium-high heat. Cover and cook until leeks are tender, about 5 minutes. Uncover and boil until mixture is reduced to scant 1 1/4 cups, about 7 minutes. Transfer to processor and blend until smooth. Add to mashed potatoes. Add matzo meal, oil, and pepper and blend very well. Using electric mixer, beat eggs, and salt in medium bowl until thick, about 8 minutes. Fold egg mixture into potato mixture in 3 additions; fold in remaining 2 cups leeks.",
        "Brush 15x10x2-inch glass baking dish generously with olive oil. Bring large pot of salted water to boil. Using wet hands, form 1 rounded tablespoon potato mixture into ball; place on sheet of moistened foil. Make about 17 more and drop into water. Cover tightly, reduce heat to medium and boil until matzo balls are cooked through and tender, about 35 minutes. Using slotted spoon, transfer matzo balls to prepared dish. Refill water in pot if necessary, add more salt and return to boil. Repeat with remaining potato mixture. (Can be made 2 days ahead. Cool slightly, cover with foil and chill. Steam 10 minutes or bake covered in 350°F oven 25 minutes to rewarm.)"
    ],
    "ingredients": [
        "1 1/2 pounds russet potatoes, peeled, cut into 1/2-inch pieces",
        "4 cups chopped leeks (white and pale green parts only; from 4 large)",
        "1 1/2 cups canned low-salt chicken broth",
        "2 cups matzo meal",
        "1/3 cup olive oil",
        "3/4 teaspoon ground black pepper",
        "6 large eggs",
        "1 tablespoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Side",
        "Passover",
        "Leek",
        "Spring",
        "Kosher"
    ],
    "title": "Potato-Leek Matzo Balls",
    "url": "http://www.epicurious.com/recipes/food/views/potato-leek-matzo-balls-106428"
}
