{
    "directions": [
        "Position a rack in top third of oven; preheat to 350°F. Whisk eggs, cream, 1 1/2 teaspoon salt, and 3/4 teaspoon pepper in a large bowl; set aside.",
        "Melt 1 tablespoon butter in a 12\" cast-iron or nonstick ovenproof skillet over medium heat. Add sausages and cook, turning often, until browned all over, about 10 minutes. Transfer to a plate. Add leeks to skillet. Season with salt; cook until wilted, about 5 minutes. Transfer to a small bowl.",
        "Melt 3 tablespoons butter in same skillet over medium heat. Add potatoes, spreading out in an even layer. Cook without stirring until bottom and edges are crisp and golden brown, about 10 minutes. Slide potato pancake onto a large plate. Invert onto another large plate. Melt 1 tablespoon butter in skillet. Slide potato pancake into skillet, browned side up; cook until bottom is golden brown, about 10 minutes.",
        "Scatter spinach, leeks, and sausages over potato pancake, each in an even layer. Season with salt and pepper, then pour in egg mixture. Sprinkle both cheeses over.",
        "Bake until casserole is puffed and golden brown, 35-40 minutes. Serve warm or at room temperature."
    ],
    "ingredients": [
        "16 large eggs",
        "1 1/4 cups heavy cream",
        "1 1/2 teaspoons kosher salt plus more",
        "3/4 teaspoon freshly ground black pepper plus more",
        "5 tablespoons unsalted butter, divided",
        "12 ounces fresh breakfast sausage links",
        "2 cups sliced leeks, white and pale-green parts only",
        "2 russet potatoes (1 1/2 pounds), peeled, shredded, lightly squeezed",
        "1 pound frozen spinach, thawed, squeezed dry, roughly chopped",
        "1 1/2 cups (4 ounces) grated Gruyère",
        "1/2 cup (1 1/2 ounces) grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Potato",
        "Breakfast",
        "Brunch",
        "Bake",
        "Quick & Easy",
        "Sausage",
        "Leek",
        "Spinach",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Potato, Sausage, and Spinach Breakfast Casserole",
    "url": "http://www.epicurious.com/recipes/food/views/potato-sausage-and-spinach-breakfast-casserole-368302"
}
