{
    "directions": [
        "Whisk all ingredients in medium bowl. Season rouille to taste with salt and freshly ground black pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Cook potatoes in large saucepan of boiling salted water until tender, about 25 minutes. Drain; return potatoes to same saucepan. Add milk and butter. Mash potatoes (with peel) until smooth. Season with 1/2 teaspoon coarse salt and 1/2 teaspoon pepper. Transfer 3 cups mashed potatoes to large bowl and cool (reserve remaining potatoes for another use).",
        "Heat 1 1/2 tablespoons oil in large deep skillet over medium heat. Add onion and garlic. Sauté until onion softens, about 5 minutes. Increase heat to medium-high. Add kale and thyme. Toss until kale wilts, about 5 minutes. Add kale mixture, 1/2 teaspoon coarse salt, 1/2 teaspoon pepper, and nutmeg to potatoes; blend. Cool potato mixture 30 minutes.",
        "Shape potato mixture by 1/4 cupfuls into 1/2-inch-thick patties. Arrange on rimmed baking sheet. DO AHEAD: Can be made up to 2 hours ahead. Let stand at room temperature.",
        "Heat 2 tablespoons oil in large nonstick skillet over medium-high heat. Add cakes and cook, without moving, until cakes are brown and crispy on bottom, 3 to 4 minutes. Carefully turn cakes over. Cook until brown on bottom, 2 to 3 minutes longer. Transfer to plates. Top each cake with dollop of rouille."
    ],
    "ingredients": [
        "1/2 cup mayonnaise",
        "1 tablespoon extra-virgin Olive oil",
        "2 garlic cloves, pressed",
        "2 teaspoons tomato paste",
        "1/8 teaspoon smoked paprika",
        "Pinch of cayenne pepper",
        "1 1/2 pounds unpeeled russet potatoes, scrubbed, cut into 1-inch cubes",
        "1/4 cup whole milk",
        "2 tablespoons (1/4 stick) unsalted butter",
        "1 teaspoon coarse kosher salt, divided",
        "3 1/2 tablespoons extra-virgin olive oil, divided",
        "1 cup chopped onion",
        "1 large garlic clove, finely chopped",
        "1/2 pound kale, center rib and stem cut from each leaf, leaves coarsely chopped",
        "1 tablespoon chopped fresh thyme",
        "1/8 teaspoon ground nutmeg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Low Cal",
        "New Year's Eve",
        "Lunch",
        "Mayonnaise",
        "Kale",
        "Winter",
        "Healthy",
        "Party",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Potato and Kale Cakes with Rouille",
    "url": "http://www.epicurious.com/recipes/food/views/potato-and-kale-cakes-with-rouille-362941"
}
