{
    "directions": [
        "In bowl of a large (5-quart) standing electric mixer fitted with paddle attachment stir together water, milk, sugar, and yeast and let mixture stand until creamy, about 5 minutes. While yeast is proofing, in a small saucepan melt butter over moderate heat and cool slightly. Stir salt, garlic powder, 3 tablespoons melted butter, and 2 cups Cheddar into yeast mixture. Leaving skins on potatoes, coarsely shred enough potatoes on large holes of a 4-sided grater to measure 2 cups and immediately stir shredded potatoes into yeast mixture.",
        "Add 2 cups flour, 1 cup at a time, to yeast mixture, beating after each addition until incorporated. Attach dough hook to mixer and butter hook. Beat in 2 more cups flour, 1 cup at a time, and enough remaining flour, a little at a time, for dough to begin to clean side of bowl and beat dough on medium speed 8 minutes. Turn dough out onto a lightly floured surface and if necessary knead in enough of the remaining flour to form a soft but not sticky dough. Oil a large bowl and add dough, turning it to coat. Let dough rise, covered with plastic wrap, at room temperature until doubled in bulk, about 1 hour.",
        "Butter a 13 x 9 x 2-inch metal baking pan. Punch down dough and turn out onto a work surface. Cut dough into 24 pieces and roll each piece into a ball. Arrange balls in pan, touching each other. Heat remaining 2 tablespoons melted butter until warm and brush over tops of rolls. Sprinkle rolls evenly with cornmeal. Let rolls rise, loosely covered with plastic wrap, at room temperature until almost doubled in bulk, about 45 minutes.",
        "While rolls are rising, preheat oven to 400°F. With a razor blade or sharp knife make a shallow slash in top of each roll and bake in middle of oven 10 minutes. Reduce temperature to 375°F. and sprinkle rolls evenly with remaining cup Cheddar. Continue to bake rolls until tops are golden brown and crisp and rolls are cooked through, 25 to 30 minutes. If necessary, loosely cover rolls with foil during last 5 minutes of baking to keep from becoming too dark. Rolls may be made 1 day ahead and cooled completely before being wrapped in foil and kept at room temperature. Serve rolls warm or at room temperature."
    ],
    "ingredients": [
        "1/2 cup warm (105°–115°F.) water",
        "1 cup canned evaporated milk",
        "2 tablespoons sugar",
        "two 1/4-ounce packages active dry yeast (5 teaspoons)",
        "5 tablespoons unsalted butter",
        "1 tablespoon salt",
        "1/2 teaspoon garlic powder",
        "3/4 pound coarsely grated sharp Cheddar (about 3 cups)",
        "1 pound potatoes",
        "5 to 6 cups bread flour",
        "3 tablespoons cornmeal"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Potato",
        "Bake",
        "Vegetarian",
        "Cheddar",
        "Gourmet",
        "Vermont"
    ],
    "title": "Potato Cheddar Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/potato-cheddar-rolls-101158"
}
