{
    "directions": [
        "To make the dough, in a stand mixer fitted with the dough hook, combine both flours, the yeast, sugar and salt. Add the water and olive oil and stir until blended. Mix on medium speed until the dough is smooth and elastic, 4 to 8 minutes. Cover and let the dough rest for 10 to 30 minutes.",
        "While the dough is resting, make the kale pesto: Bring a small saucepan of water to a boil. Add the kale and cook until tender, 2 minutes. Drain in a colander, rinse with cold water and press the greens to remove as much water as possible. Place the kale, cheese, garlic and lemon juice in a mini food processor or blender. With the machine running, slowly add the olive oil and blend until smooth. Season with salt and pepper. Set aside.",
        "Place a pizza stone in the lower third of an oven and preheat to 450°F (230°C).",
        "Cut the potatoes in half, then place the cut sides down on a cutting board and cut into 1/8-inch (3-mm) slices. (Alternatively, thinly slice the potatoes using a mandoline.)",
        "Divide the dough in half and roll it out on a lightly floured surface into two 10- to 12-inch (25- to 30-cm) rounds. Place the rounds on separate pieces of parchment paper. Spread the kale pesto evenly on the dough rounds. Top with the potatoes, blue cheese, mozzarella, and rosemary, dividing evenly. Slide one of the pizzas (still on the parchment) onto the baking stone and bake until the crust is golden brown and the cheese is bubbly, 15 minutes.",
        "Cut the pizza into wedges and serve. Bake the second pizza while enjoying the first one. Serves 4.",
        "Adapted from Williams Sonoma",
        "Weeknight Vegetarian",
        ", by Kristine Kidd (Weldon Owen 2014)"
    ],
    "ingredients": [
        "1 cup (5 oz./155 g) all-purpose flour, plus more for rolling",
        "1 cup (5 oz./155 g) whole-wheat flour",
        "2 1/4 tsp. (1 package) active dry yeast",
        "1 tsp. sugar",
        "1/2 tsp. sea salt",
        "1 cup (8 fl. oz./250 ml) warm water (about 120°F/52°C)",
        "2 Tbs. extra-virgin olive oil, plus more for brushing",
        "2 cups (2 oz./60 g) packed chopped Tuscan kale",
        "2 Tbs. grated Parmesan cheese",
        "2 tsp. finely chopped garlic",
        "2 tsp. fresh lemon juice",
        "1/4 cup (2 fl. oz./60 ml) olive oil",
        "Sea salt and freshly ground pepper",
        "2 small Yukon Gold potatoes",
        "1/2 cup (2 1/2 oz./75 g) crumbled blue cheese",
        "1 cup (4 oz./125 g) shredded mozzarella cheese",
        "2 tsp. finely chopped fresh rosemary"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Potato and Blue Cheese Pizza with Kale Pesto",
    "url": "http://www.williams-sonoma.com/recipe/potato-and-blue-cheese-pizza-with-kale-pesto.html"
}
