{
    "directions": [
        "Place bacon in a large, heavy saucepan and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Pour bacon drippings into bowl and reserve.",
        "Melt 1 tablespoon butter in the same saucepan over medium-high heat. Cook and stir onions in hot butter until soft, 5 to 8 minutes. Add potatoes, 1/2 the bottle of clam juice, celery, carrots, mushrooms, 1 1/2 teaspoons pepper, and 1 teaspoon salt. Bring to a simmer, reduce heat to medium-low, cover the saucepan, and cook until vegetables are just tender, about 15 minutes.",
        "Melt 1/2 cup butter in a large pot over medium heat. Whisk flour into melted butter until smooth. Whisk milk, half-and-half, and cream into flour mixture until smooth and slightly thickened, about 10 minutes. Stir vegetable mixture, bay leaves, thyme, and dill into cream mixture. Bring to a simmer, reduce heat to medium-low, and simmer until vegetables are tender and chowder is hot, 15 minutes.",
        "Stir minced clams, spinach leaves, and reserved bacon drippings into chowder. Cook until clams are heated through, 3 to 5 minutes. Season with salt and pepper to taste."
    ],
    "ingredients": [
        "4 slices bacon, diced",
        "1 tablespoon butter, or as needed",
        "1/4 cup diced onion",
        "2 cups cubed, red skin-on potatoes",
        "1 (8 ounce) bottle clam juice, divided",
        "1/4 cup diced celery",
        "1/4 cup diced carrots",
        "1/4 cup diced mushrooms",
        "1 1/2 teaspoons ground black pepper",
        "1 teaspoon salt",
        "1/2 cup butter",
        "1 cup all-purpose flour",
        "2 cups whole milk",
        "1 pint half-and-half",
        "1 cup heavy whipping cream, or to taste",
        "2 bay leaves",
        "1 teaspoon dried thyme",
        "1 teaspoon dried dill weed",
        "2 (6.5 ounce) cans minced clams",
        "6 leaves spinach, or more to taste",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Potato Bacon Clam Chowder",
    "url": "http://allrecipes.com/recipe/235744/potato-bacon-clam-chowder/"
}
