{
    "directions": [
        "Melt butter in large pot over high heat. Add all mushrooms and sauté until liquid evaporates, about 10 minutes. Add garlic, thyme and rosemary; sauté 1 minute. Add chicken broth and simmer until liquid evaporates, stirring often, about 18 minutes. Season with salt and pepper. Cool.",
        "Position 1 rack in middle of oven and another rack in bottom third of oven; preheat to 375°F. Butter 13 x 9 x 2-inch glass baking dish. Arrange 1/3 of potatoes in dish, overlapping slightly. Top with half of mushroom mixture. Sprinkle 1/3 of cheese over. Repeat layering 1/3 of potatoes, remaining mushroom mixture and 1/3 of cheese. Arrange remaining potatoes atop cheese. Whisk half and half, cream, salt and pepper in large bowl to blend; pour over potatoes. Cover loosely with foil.",
        "Place baking sheet on bottom rack in oven. Place baking dish on middle rack in oven and bake until potatoes are tender and liquid thickens, about 1 hour 15 minutes. Uncover. Using metal spatula, press on potatoes to submerge. Sprinkle remaining cheese over potatoes; bake until cheese melts and gratin is golden at edges, about 15 minutes longer. Let stand 10 minutes."
    ],
    "ingredients": [
        "6 tablespoons (3/4 stick) butter",
        "1 1/2 pounds button mushrooms, coarsely chopped",
        "1 1/2 pounds fresh shiitake mushrooms, stemmed, caps coarsely chopped",
        "3 tablespoons minced garlic",
        "2 teaspoons dried thyme",
        "1 teaspoon dried rosemary leaves, finely crushed",
        "2 cups canned low-salt chicken broth",
        "3 pounds Yukon Gold or russet potatoes, peeled, cut into 1/8-inch-thick slices",
        "2 cups freshly grated Parmesan cheese (about 5 1/2 ounces)",
        "2 cups half and half",
        "2 cups whipping cream",
        "1 1/4 teaspoons salt",
        "1 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Potato",
        "Side",
        "Bake",
        "Christmas",
        "Casserole/Gratin",
        "Winter",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Potato and Shiitake Mushroom Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/potato-and-shiitake-mushroom-gratin-4543"
}
