{
    "directions": [
        "Preheat oven to 375°F.",
        "Cook onions in butter in a 12-inch heavy skillet over moderate heat, stirring occasionally, until softened and just beginning to brown, 7 to 8 minutes. Remove skillet from heat and stir in haddock, 1 tablespoon parsley, and salt and pepper to taste.",
        "Halve or quarter celery root to fit slicer. Thinly slice potatoes and celery root (about 1/8-inch thick) with slicer. Layer one third of potatoes and celery root in buttered baking dish. Spread half of haddock mixture on top, then repeat layering with half of remaining vegetables, all of remaining haddock mixture, and then remaining vegetables. Stir together cream, milk, salt, and pepper and pour on top of gratin, then cover dish tightly with buttered foil.",
        "Bake gratin in middle of oven until vegetables are just tender, about 1 hour. Uncover and bake, basting 2 or 3 times with pan juices, until top is golden, about 30 minutes more. Let stand 10 minutes, then sprinkle with remaining tablespoon parsley.",
        "Available at Asian cookware shops."
    ],
    "ingredients": [
        "2 medium onions, halved lengthwise, thenthinly sliced lengthwise",
        "2 tablespoons unsalted butter",
        "1/2 lb smoked haddock fillet (finnan haddie), thawed if frozen, shredded with your fingers into 1/2-inch pieces, discarding any tough parts",
        "2 tablespoons chopped fresh parsley",
        "1 1/2 lb celery root (sometimes called celeriac), peeled with a knife",
        "2 lb large potatoes (preferably russet or Yukon Gold), peeled",
        "2 cups heavy cream",
        "1/2 cup whole milk",
        "1 teaspoon salt",
        "1/4 teaspoon black pepper",
        "Special equipment: a Japanese Benriner* or other adjustable-blade slicer; a 13- by 9- by 2-inch or other shallow (2 1/2- to 3-quart) glass or ceramic baking dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Fish",
        "Onion",
        "Potato",
        "Bake",
        "Casserole/Gratin",
        "Winter",
        "Gourmet"
    ],
    "title": "Potato and Celery-Root Gratin with Smoked Haddock",
    "url": "http://www.epicurious.com/recipes/food/views/potato-and-celery-root-gratin-with-smoked-haddock-107594"
}
