{
    "directions": [
        "Preheat oven to 400°F. Arrange pancetta slices on rimmed baking sheet, spacing apart. Bake until golden brown and crisp, about 20 minutes (do not turn). Drain on paper towels. Cool. Coarsely chop pancetta.",
        "Meanwhile, whisk lemon juice, rosemary, lemon peel, and garlic in small bowl. Gradually whisk in oil. Season dressing to taste with salt and pepper.",
        "Place potatoes in large pot. Add enough cold water to cover by 1 inch. Bring to boil; reduce heat to medium. Simmer with lid ajar until tender, 18 to 25 minutes, depending on size of potatoes. Drain; let stand until cool enough to handle, about 20 minutes.",
        "Cut potatoes into 1/4-inch-thick slices (remove skin, if desired). Place in large bowl; add celery. Drizzle dressing over; toss gently to coat. Season with salt and pepper. Cover and chill until cold, at least 2 hours. DO AHEAD: Pancetta and potato salad can be made 1 day ahead. Cover pancetta; chill. Keep potato salad chilled. Bring pancetta to room temperature before continuing.",
        "Sprinkle pancetta and chopped parsley over potato salad."
    ],
    "ingredients": [
        "5 ounces 1/8-inch-thick slices pancetta (Italian bacon; about 5 slices)",
        "1/4 cup fresh lemon juice",
        "1 tablespoon minced fresh rosemary",
        "2 teaspoons finely grated lemon peel",
        "1 garlic clove, pressed",
        "2/3 cup olive oil",
        "3 pounds Yukon Gold potatoes",
        "3 large celery stalks, thinly sliced",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Potato",
        "Side",
        "Bake",
        "High Fiber",
        "Backyard BBQ",
        "Dinner",
        "Lunch",
        "Lemon",
        "Rosemary",
        "Bacon",
        "Celery",
        "Summer",
        "Family Reunion",
        "Potluck",
        "Simmer",
        "Sugar Conscious",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Potato Salad with Pancetta, Rosemary, and Lemon",
    "url": "http://www.epicurious.com/recipes/food/views/potato-salad-with-pancetta-rosemary-and-lemon-359731"
}
