{
    "directions": [
        "Boil russet potato in salted water until just tender when pierced with sharp knife, about 25 minutes. Drain potato. Cool, peel and dice.",
        "Heat 1 tablespoon olive oil in heavy medium saucepan over medium-high heat. Add onion and bell pepper and sauté until onion is golden brown and pepper is tender, about 10 minutes. Mix in potato, Spanish olives and oregano and cook until mixture is heated through, stirring occasionally, about 5 minutes. Remove from heat. Gently mix in cheese. Season to taste with salt and pepper and cover to keep warm.",
        "Heat remaining 1 tablespoon olive oil in heavy 10-inch nonstick skillet over medium-high heat. Beat eggs to blend in large bowl. Season with salt and pepper. Add eggs to skillet. Stir with back of fork and lift edges, allowing uncooked portion of eggs to flow under cooked portion. Cook until eggs are just set, 3 minutes. Spoon filling over half of eggs. Using spatula, fold unfilled portion of eggs over filling. Transfer to platter."
    ],
    "ingredients": [
        "1 8-ounce russet potato",
        "2 tablespoons olive oil",
        "1/2 small onion, chopped",
        "1/4 small green bell pepper, diced",
        "1/4 cup sliced pimiento-stuffed green Spanish olives",
        "1 tablespoon minced fresh oregano or 1 teaspoon dried, crumbled",
        "3/4 cup shredded manchego or white cheddar cheese (about 2 1/2 ounces)",
        "6 eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Olive",
        "Potato",
        "Brunch",
        "Vegetarian",
        "Quick & Easy",
        "Lunch",
        "Bell Pepper",
        "Spring",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Potato Omelet with Olives",
    "url": "http://www.epicurious.com/recipes/food/views/potato-omelet-with-olives-1884"
}
