{
    "directions": [
        "Melt butter or margarine in a large pot over high heat.  Add all mushrooms, and saute; until liquid evaporates, about 10 minutes.  Add garlic, thyme, and rosemary; saute; 1 minute.  Add chicken broth.  Simmer until liquid evaporates, stirring often, about 18 minutes.  Season with salt and pepper. Cool.",
        "Position 1 rack in middle of the oven, and another rack in bottom third of oven.  Preheat to 375 degrees F (190 degrees C).  Butter a 13x9x2 inch baking dish.",
        "Peel potatoes, and cut into 1/8 inch slices.  Arrange 1/3 of the potatoes in prepared dish, overlapping slightly.  Top potatoes with half of the mushroom mixture.  Sprinkle 1/3 of the cheese over mushrooms.  Repeat layering 1/3 of the potatoes, remaining mushroom mixture, and 1/3 of the cheese.  Arrange remaining potatoes atop cheese.",
        "Whisk half and half, cream, 1 1/4 teaspoon salt, and 1 teaspoon pepper in a large bowl to blend.  Pour mixture over potatoes.  Cover loosely with foil.",
        "Place baking dish on middle rack in oven, and a baking sheet on the bottom rack.  Bake until potatoes are tender and liquid thickens, about 1 hour and 15 minutes.  Uncover.  Using metal spatula, press on potatoes to submerge.  Sprinkle remaining cheese over potatoes.  Bake until cheese melts and gratin is golden at edges, about 15 minutes longer.  Let stand 10 minutes."
    ],
    "ingredients": [
        "6 tablespoons butter",
        "1 1/2 pounds mushrooms, chopped",
        "1 1/2 pounds fresh shiitake mushrooms, stemmed and coarsely chopped",
        "3 tablespoons minced garlic",
        "2 teaspoons dried thyme",
        "1 teaspoon dried rosemary, crushed",
        "salt to taste",
        "ground black pepper to taste",
        "2 cups chicken broth",
        "3 pounds baking potatoes, scrubbed",
        "2 cups Parmesan cheese",
        "2 cups heavy cream",
        "1 1/4 teaspoons salt",
        "1 teaspoon ground black pepper",
        "2 cups half-and-half cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Potato and Shiitake Mushroom Gratin",
    "url": "http://allrecipes.com/recipe/9179/potato-and-shiitake-mushroom-gratin/"
}
