{
    "directions": [
        "Put the potatoes in a pot with the water. Bring the water to a boil and cook the potatoes at a strong simmer for 20 minutes or until tender. Drain the water and let the potatoes cool for only a few minutes before you begin to pull the skins off. Discard the potato skins and, while still hot, pass the potatoes through a ricer into a bowl.",
        "Add the eggs, one at a time, to the riced potatoes and incorporate well. Add the flour in two stages, so you use just enough to bind the potato. Add the second half of the flour (and have some additional flour available, in case it's necessary) and mix well to form a dough.",
        "Divide the dough in half, and on a floured work surface, roll the first half of dough into a 1-inch-thick log. Cut the log into 1/2-inch-thick round pieces. Lay the pieces out, and with the back of a fork or your thumb, make an indentation on one side.",
        "Set aside and refrigerate until needed.",
        "Cook them in several quarts of boiling, salted water for 10 to15 seconds. They cook very quickly and are done when they float to the surface. Heat the cream in a saucepan, add the peas, and allow to simmer for several minutes. Add the butter to the cream, whisking in to incorporate well before adding the prosciutto. Pour the sauce over the drained gnocchi, stir gently in a large serving bowl, and serve immediately."
    ],
    "ingredients": [
        "1 pound Yukon Gold potatoes, unpeeled",
        "2 quarts water",
        "2 eggs",
        "1 cup flour",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1/2 cup fresh peas, shelled and blanched in boiling water for 2 minutes",
        "1/4 pound prosciutto, julienned",
        "1/2 cup heavy cream",
        "3 tablespoons butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Pea",
        "Spring",
        "Prosciutto"
    ],
    "title": "Potato Gnocchi with Spring Peas and Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/potato-gnocchi-with-spring-peas-and-prosciutto-105101"
}
