{
    "directions": [
        "Bring stock to simmer in medium saucepan. Add mushrooms; remove from heat. Let mushrooms soak 30 minutes to soften. Squeeze mushrooms, reserving stock. Strain stock. Chop mushrooms, discarding hard stems.",
        "Preheat oven to 350°F. Butter 9 x 13-inch baking dish. Melt butter in heavy large skillet over medium heat. Add onions and leeks and sauté until tender but not brown, about 20 minutes. Add mushroom soaking liquid, mushrooms, wine and rosemary and bring to boil. Season with salt and pepper.",
        "Arrange half of potatoes in prepared dish. Using slotted spoon, top potatoes with onions, leeks and mushrooms. Pour half of liquid over. Top with remaining potatoes, overlapping slices. Pour remaining liquid over. Cover with foil. Bake until potatoes are almost tender, about 1 hour 15 minutes. Uncover and bake until potatoes are tender, most of liquid is absorbed and top is beginning to brown, about 45 minutes.",
        "Preheat broiler. Brush potatoes with 2 tablespoons goose fat or butter. Broil until golden. Sprinkle with chives."
    ],
    "ingredients": [
        "2 cups chicken stock or canned broth",
        "2 ounces dried porcini or shiitake mushrooms",
        "6 tablespoons (3/4 stick) butter",
        "2 medium onions, chopped",
        "3 leeks (white and pale green parts only), chopped",
        "2 cups dry white wine",
        "1 teaspoon dried rosemary, crumbled",
        "4 pounds russet potatoes, peeled, thinly sliced (1/8 inch thick)",
        "2 tablespoons goose fat, or 2 tablespoons (1/4 stick) unsalted butter, melted",
        "Minced fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Potato",
        "Side",
        "Bake",
        "Casserole/Gratin",
        "Leek",
        "Winter"
    ],
    "title": "Potato and Wild Mushroom Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/potato-and-wild-mushroom-gratin-1087"
}
