{
    "directions": [
        "Preheat oven to 325°F. Place baking sheet in oven. Place colander in large bowl. Line colander with kitchen towel. Using processor fitted with shredding blade, coarsely grate potatoes, onion, celery root and apple at the same time. Transfer potato mixture to towel. Gather towel tightly around potato mixture and squeeze out as much liquid as possible into bowl; discard liquid. Place potato mixture, egg, green onion, marjoram, salt and pepper in same bowl; toss to blend. Mix in flour.",
        "Pour enough vegetable oil into heavy large skillet to cover bottom. Heat oil over medium-high heat. Working in batches, drop 1/4 cup pancake mixture into skillet for each pancake. Using bottom of metal spatula, flatten each mound to 3-inch round. Fry until cooked through and crisp, about 3 minutes per side. Transfer pancakes to baking sheet in oven to keep warm. Repeat with remaining pancake mixture, leaving behind any liquid that collects in bottom of bowl.",
        "Mix crème fraîche and horseradish in small bowl. Arrange 2 pancakes on each plate. Garnish pancakes with dollop of horseradish cream and smoked salmon. Sprinkle with chives and serve."
    ],
    "ingredients": [
        "1 pound russet potatoes, peeled, cut into 1 1/2-inch pieces",
        "1 medium onion, peeled, quartered",
        "1 2-inch cube peeled celery root (celeriac)",
        "1 medium Granny Smith apple (unpeeled), quartered, cored",
        "1 large egg",
        "1 green onion, finely chopped",
        "1 tablespoon chopped fresh marjoram",
        "3/4 teaspoon salt",
        "1/2 teaspoon ground black pepper",
        "1/4 cup all purpose flour",
        "Vegetable oil (for frying)",
        "1 8-ounce container crème fraîche or sour cream",
        "2 tablespoons drained prepared white horseradish",
        "8 ounces thinly sliced smoked salmon",
        "Chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Appetizer",
        "Fry",
        "Hanukkah",
        "Horseradish",
        "Apple",
        "Salmon",
        "Winter",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Potato-Apple Pancakes with Smoked Salmon and Horseradish",
    "url": "http://www.epicurious.com/recipes/food/views/potato-apple-pancakes-with-smoked-salmon-and-horseradish-102616"
}
