{
    "directions": [
        "Peel potatoes and cut into 1-inch pieces. Cover with salted cold water by 1 inch in a 2-quart saucepan, then boil until tender, about 8 minutes. Drain in a colander. Force potatoes through ricer into a medium bowl and cool.",
        "Lightly beat 1 egg in a small bowl with a fork. Add to cooled potatoes along with herbs, butter, salt, and pepper and stir just until combined.",
        "Spoon tablespoons of potato mixture onto a tray, then lightly roll each into a ball between palms of your hands and return to tray.",
        "Lightly beat remaining 2 eggs in a small bowl and set aside. Spread flour in a shallow bowl, then spread bread crumbs in another shallow bowl.",
        "Working in 4 batches (of 6 or 7), roll balls in flour to coat, gently shaking off excess flour. Dip balls in egg, turning to coat and letting excess drip off, then roll in bread crumbs and return to tray. Chill, covered, 30 minutes.",
        "Preheat oven to 200°F.",
        "Heat 1 1/2 inches oil in a 3-quart pot until it registers 360°F on thermometer. Working in 4 batches, fry croquetas, turning if necessary, until browned, about 1 1/2 minutes per batch. Transfer with a slotted spoon to paper towels to drain, then transfer to a baking pan and keep warm in oven while frying remaining croquetas. (Return oil to 360°F between batches.)"
    ],
    "ingredients": [
        "1 pound large boiling potatoes (about 2)",
        "3 large eggs",
        "1 tablespoon chopped fresh flat-leaf parsley",
        "1 tablespoon finely chopped fresh chives",
        "1/4 teaspoon chopped fresh tarragon",
        "2 tablespoons unsalted butter, softened",
        "1/2 teaspoon salt",
        "1/8 teaspoon black pepper",
        "3/4 cup all-purpose flour",
        "3/4 cup fine dry bread crumbs",
        "About 4 cups olive oil (not extra-virgin) for frying",
        "Special equipment: a potato ricer; a deep-fat thermometer",
        "Accompaniment: saffron alioli"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Potato",
        "Fry",
        "Cocktail Party",
        "Vegetarian",
        "Gourmet"
    ],
    "title": "Potato Croquetas with Saffron Alioli",
    "url": "http://www.epicurious.com/recipes/food/views/potato-croquetas-with-saffron-alioli-230736"
}
