{
    "directions": [
        "Place baking sheet in oven and preheat to 275°F. Steam potatoes until tender, about 8 minutes. Place in large bowl; sprinkle with salt, pepper, and chili powder. Toss to coat. Cool potatoes 15 minutes. Mix in Jack cheese. Meanwhile, blend salsa and 2/3 cup (packed) greens in mini processor until greens are finely chopped.",
        "Arrange tortillas on work surface. Divide remaining greens between bottom half of each. Top greens with potato mixture, then goat cheese and 2 tablespoons salsa mixture for each. Fold plain tortilla halves over filling, pressing to compact. Brush with oil.",
        "Heat large nonstick skillet over medium heat. Place 2 quesadillas, oiled side down, in skillet. Brush tops with oil. Cook until quesadillas are brown, about 3 minutes per side. Transfer to sheet in oven to keep warm. Repeat with remaining 2 quesadillas.",
        "Cut each quesadilla into 3 or 4 wedges. Serve with remaining salsa."
    ],
    "ingredients": [
        "1 1/3 cups 1/2-inch cubes peeled Yukon Gold potatoes (about 2 medium)",
        "2 teaspoons chili powder",
        "1 1/3 cups (packed) coarsely grated hot pepper Monterey Jack cheese (5 to 6 ounces)",
        "1 1/3 cups jarred salsa verde (tomatillo salsa)",
        "4 2/3 cups coarsely chopped stemmed mustard greens (from 1 bunch), divided",
        "4 8-inch-diameter flour tortillas",
        "3 ounces chilled fresh goat cheese, coarsely crumbled",
        "Olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Potato",
        "Super Bowl",
        "Vegetarian",
        "Quick & Easy",
        "High Fiber",
        "Mother's Day",
        "Goat Cheese",
        "Pan-Fry",
        "Tomatillo",
        "Mustard Greens",
        "Tortillas",
        "Monterey Jack"
    ],
    "title": "Potato, Greens, and Goat Cheese Quesadillas",
    "url": "http://www.epicurious.com/recipes/food/views/potato-greens-and-goat-cheese-quesadillas-241607"
}
