{
    "directions": [
        "Cook potatoes in large saucepan of boiling salted water until very tender, about 20 minutes. Drain. Return potatoes to pan and mash. Cool potatoes. Stir in 1 cup cheese and mint. Season filling to taste with salt and pepper.",
        "Line 2 baking sheets with plastic wrap; sprinkle with flour. Stack 6 wonton wrappers on work surface. Trim edges of wonton stack to form 2 3/4-inch square, preferably using scallop-edged pastry wheel cutter. Repeat stacking and trimming with remaining wrappers. Place half of wrappers on work surface. Place 1 tablespoon filling in center of each. Brush edges of wrappers lightly with water. Top each with another wrapper; press on edges to seal well. Place ravioli on prepared baking sheets. (Can be made 4 hours ahead. Sprinkle lightly with flour. Cover with plastic wrap and chill.)",
        "Heat oil in large nonstick skillet over medium heat. Add garlic and stir 30 seconds. Add tomatoes and sauté until heated through, about 5 minutes. Season sauce to taste with salt and pepper. Transfer 1/2 cup sauce to large shallow serving bowl.",
        "Working in batches, cook ravioli in large pot of boiling salted water until just tender but still firm to bite, about 3 minutes. Using slotted spoon, transfer ravioli to bowl with sauce. Spoon remaining sauce over. Sprinkle with remaining 1/4 cup cheese and serve."
    ],
    "ingredients": [
        "1 1/4 pounds russet potatoes, peeled, quartered",
        "1 1/4 cups freshly grated pecorino Sardo or pecorino Romano cheese",
        "2 tablespoons chopped fresh mint",
        "All purpose flour",
        "1 12-ounce package wonton wrappers",
        "2 tablespoons extra-virgin olive oil",
        "1 large garlic clove, minced",
        "2 pounds tomatoes, chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pasta",
        "Potato",
        "Tomato",
        "Appetizer",
        "Vegetarian",
        "Summer",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Potato and Cheese Ravioli with Fresh Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/potato-and-cheese-ravioli-with-fresh-tomato-sauce-106473"
}
