{
    "directions": [
        "Place a large strainer over a large bowl. Using the large holes of a box grater, grate some of the potatoes, followed by some of the onion, into the strainer. Repeat until all of the potatoes and onion are used up. (Alternating the potatoes and onion prevents the potatoes from discoloring.) Squeeze or press out as much of the liquid as possible. Allow the accumulated liquid to stand in another bowl for 2 to 3 minutes. Pour off the watery part but reserve the thick, starchy paste at the bottom.",
        "Transfer the potato-onion mixture to a clean large bowl. Add the starchy paste, egg yolks, scallions, potato fl our or matzo meal, butter, salt, pepper, and baking powder and mix well. In a separate medium bowl, beat the egg whites with an electric mixer until they hold stiff, shiny peaks. Fold the egg whites into the potato mixture.",
        "Heat a thin layer of oil in a large frying pan over medium-high heat. Working in batches, scoop 1/4 cup of the potato mixture into the pan for each pancake. Flatten gently with a spatula. Fry until the pancakes are crisp and golden brown, about 4 minutes per side.",
        "Serve immediately or reheat in a 350°F oven for about 6 minutes. Serve with sour cream and applesauce."
    ],
    "ingredients": [
        "2 1/2 pounds Idaho russet potatoes",
        "1 medium onion",
        "2 large eggs, separated",
        "1/2 cup finely chopped scallions (white and green parts)",
        "1/4 cup potato flour or matzo meal",
        "3 tablespoons unsalted butter, melted",
        "2 teaspoons kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1/4 teaspoon baking powder",
        "Canola or vegetable oil, for frying",
        "Sour cream, for serving",
        "Applesauce, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Appetizer",
        "Side",
        "Fry",
        "Hanukkah",
        "Kid-Friendly",
        "Quick & Easy",
        "Pan-Fry",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Potato Latkes",
    "url": "http://www.epicurious.com/recipes/food/views/potato-latkes-51186660"
}
