{
    "directions": [
        "Place potatoes in heavy large saucepan. Add water to cover. Season generously with salt. Bring to boil. Cover and cook until potatoes are tender, about 25 minutes. Drain. Cool slightly. Peel potatoes. Cut potatoes in half lengthwise, then cut crosswise into 1/2-inch-thick pieces. Place half of potatoes in large bowl. Drizzle with 1 tablespoon vinegar. Season with salt and pepper. Add remaining potatoes. Drizzle with 1 tablespoon vinegar. Season with salt and pepper.",
        "Melt butter in heavy large skillet over high heat. Add shrimp and scallops and sauté until cooked through, about 5 minutes. Transfer shrimp, scallops and any juices to bowl with potatoes; add crabmeat. Toss gently to blend. Cover and refrigerate until well chilled, about 2 hours.(Can be prepared 1 day ahead. Keep refrigerated.)",
        "Stir sour cream, mayonnaise, green onions, minced tarragon and remaining 1 tablespoon vinegar in small bowl to blend. Pour dressing over potato mixture. Toss gently to blend. Season to taste with salt and pepper. Garnish with tarragon sprigs and serve."
    ],
    "ingredients": [
        "3 pounds white-skinned potatoes",
        "3 tablespoons white wine vinegar",
        "1 tablespoon butter",
        "10 ounces uncooked medium shrimp, peeled, halved lengthwise",
        "10 ounces bay scallops",
        "10 ounces crabmeat, drained, picked over",
        "1/2 cup plus 2 tablespoons sour cream",
        "5 tablespoons mayonnaise",
        "5 green onions, minced",
        "5 tablespoons minced fresh tarragon",
        "Fresh tarragon sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Dairy",
        "Herb",
        "Potato",
        "Shellfish",
        "Crab",
        "Scallop",
        "Shrimp",
        "Summer",
        "Tarragon"
    ],
    "title": "Potato and Seafood Salad with Tarragon",
    "url": "http://www.epicurious.com/recipes/food/views/potato-and-seafood-salad-with-tarragon-259"
}
