{
    "directions": [
        "Preheat oven to 250°F. Line rimmed baking sheet with parchment paper. Arrange tomato halves, cut side up, on prepared sheet. Drizzle 1/2 cup olive oil over tomatoes; sprinkle with salt. Roast in oven until soft, about 1 hour. Cool slightly. Using fingertips, slip skins off tomato halves. Set tomatoes aside. Increase oven temperature to 375°F.",
        "Line another rimmed baking sheet with parchment paper. Combine potato slices and 1/4 cup olive oil in medium bowl; sprinkle with salt and pepper and toss to coat. Arrange potatoes in single layer on prepared sheet; drizzle any oil from bowl over. Roast until soft and beginning to brown, about 25 minutes. Cool.",
        "Heat 2 tablespoons oil in large nonstick skillet over medium-high heat. Sprinkle zucchini with salt and pepper. Working in batches, add zucchini to skillet; sauté until lightly browned, about 1 minute per side. Transfer to paper towels to drain. Cool.",
        "Lightly oil 13x9x2-inch ceramic or glass baking dish. Starting at outer edges of baking dish and working toward center, alternate potato slices, zucchini slices, and tomato halves, overlapping slightly. Sprinkle with salt and pepper, then thyme leaves and Parmesan. DO AHEAD: Can be made 1 day ahead. Cover and chill.",
        "Preheat oven to 350°F. Bake gratin uncovered until cheese melts and juices bubble at edges, about 35 minutes."
    ],
    "ingredients": [
        "2 3/4 pounds medium tomatoes (about 10), halved, cored, seeded",
        "3/4 cup olive oil, divided, plus 2 tablespoons",
        "1 pound medium Yukon Gold potatoes, peeled, cut into 1/4-inch-thick rounds",
        "1 pound large zucchini, trimmed, cut diagonally into 1/4-inch-thick slices",
        "2 teaspoons fresh thyme leaves",
        "1/2 cup finely grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Potato",
        "Tomato",
        "Side",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Oscars",
        "Dinner",
        "Casserole/Gratin",
        "Parmesan",
        "Zucchini",
        "Family Reunion",
        "Low Cholesterol",
        "Potluck",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Potato, Zucchini, and Tomato Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/potato-zucchini-and-tomato-gratin-350454"
}
