{
    "directions": [
        "In a 5- to 6-quart kettle bring split peas and 5 cups water with salt to a boil, and simmer, covered, stirring occasionally, 40 minutes, or until most of water is absorbed.",
        "In a large heavy skillet sauté salt pork in 1 tablespoon butter over moderately high heat, stirring occasionally, until golden. Add onion and sautéF, stirring occasionally, until softened. Add carrots, leeks, lettuce, bay leaf, and thyme and sauté, stirring occasionally, 3 minutes. Stir vegetable mixture into split peas with fresh or frozen peas and remaining 2 cups water and cook, covered, over moderate heat, stirring occasionally, 1 hour.",
        "Strain soup through a sieve into a large saucepan, pressing hard on solids before discarding them. Add broth, half-and-half, remaining 2 tablespoons butter, sugar, white pepper, and salt to taste and bring soup to a boil over moderately high heat, stirring."
    ],
    "ingredients": [
        "2 cups dried split green peas (about 1 pound), picked over and rinsed",
        "7 cups water",
        "1 teaspoon salt",
        "1/2 cup finely chopped salt pork (about 2 1/2 ounces)",
        "3 tablespoons unsalted butter",
        "1 onion chopped fine",
        "1 carrot chopped fine",
        "2 leeks, trimmed, split lengthwise, washed well, drained, and chopped fine (about 1 cup)",
        "1 cup shredded soft-leafed lettuce such as Boston",
        "1 small bay leaf",
        "1/4 teaspoon dried thyme, crumbled",
        "1 cup fresh or frozen peas",
        "1 1/2 cup chicken broth",
        "1/2 cup half-and-half",
        "1 teaspoon sugar",
        "freshly ground white pepper to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Leafy Green",
        "Onion",
        "Pork",
        "Appetizer",
        "Leek",
        "Pea",
        "Fall",
        "Gourmet",
        "Germany",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Potage Saint-Germain Gerhard",
    "url": "http://www.epicurious.com/recipes/food/views/potage-saint-germain-gerhard-10857"
}
