{
    "directions": [
        "Heat the bacon lardons in a 10-inch/25-cm frying pan over medium heat until the fat runs, 2 to 3 minutes. Do not let them brown. Remove them with a draining spoon and set aside. Melt the lard in the pan, add the potatoes, and sprinkle them with pepper. The bacon may contribute enough salt. Reduce the heat to low, cover, and cook for 5 minutes. Stir in the lardons and continue to cook, uncovered, over low heat, tossing or stirring often, until the potatoes are tender and some are browned, 20 to 25 minutes. Don't worry if some of them are crushed, as they will help hold the mixture in a cake.",
        "Stir in the cheese, taste, and adjust the seasoning. Press down on the potatoes to level them in the pan. Turn the heat to high and let them cook without stirring until the bottom is browned, 3 to 5 minutes. Press on the cake occasionally to hold it together. When done, it should be brown around the edges and starting to pull from the sides of the pan. Take the pan off the heat, run a knife around the edge to loosen the cake, and turn it out onto a warmed platter. Serve hot."
    ],
    "ingredients": [
        "5-ounce/140-grams piece lean bacon, cut into lardons",
        "2 tablespoons/30 grams lard or vegetable oil",
        "2 pounds/900 grams baking potatoes, thinly sliced",
        "Salt and pepper",
        "8 ounces/100 grams Cantal or Gruyère cheese, diced or cut into thin, narrow strips",
        "10-inch/25-cm nonstick frying pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Potato",
        "Side",
        "Sauté",
        "Quick & Easy",
        "Bacon",
        "Fall",
        "Winter",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Potato Cake with Cheese and Bacon",
    "url": "http://www.epicurious.com/recipes/food/views/potato-cake-with-cheese-and-bacon-240906"
}
