{
    "directions": [
        "Preheat oven to 375° F.",
        "In a small saucepan bring Port with prunes to a boil and remove pan from heat. Cover mixture and macerate 1 hour. Drain prunes in a sieve set over a bowl, pressing on solids, and reserve Port for gravy and prunes for stuffing.",
        "In a shallow baking pan spread bread pieces in one layer and bake in middle of oven, stirring occasionally, until golden, 10 to 15 minutes. Transfer bread to a large bowl.",
        "Increase oven temperature to 425° F. Peel potatoes and cut into 1/2-inch cubes. In shallow baking pan toss potatoes with oil and roast in bottom third of oven, turning occasionally, until browned and crisp, about 20 minutes. Add potatoes to bread.",
        "Peel apples and cut into 1/2-inch pieces. In a large heavy skillet melt butter over moderate heat and cook celery, onions, thyme, and apples, stirring, until vegetables are softened, about 15 minutes. Remove skillet from heat and stir in reserved prunes, combining well. Stir vegetable mixture into bread mixture with parsley and salt and pepper to taste and cool completely. Stuffing may be made 1 day ahead and chilled, covered. (To prevent bacterial growth do not stuff turkey cavities ahead.)"
    ],
    "ingredients": [
        "2 cups Tawny Port",
        "1 1/2 cups pitted prunes (about 9 ounces), chopped",
        "enough homemade-type white bread (about 7 slices), cut into 1/2-inch pieces, to measure 4 1/2 cups",
        "3 large russet potatoes (about 2 pounds)",
        "2 tablespoons olive oil",
        "2 Granny Smith apples",
        "8 tablspoons unsalted butter",
        "4 large celery ribs, chopped (about 1/2 cup)",
        "2 small onions, chopped (about 2 cups)",
        "2 tablespoons finely chopped fresh thyme leaves",
        "3/4 cup chopped fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Stuffing/Dressing",
        "Prune",
        "Apple",
        "Port",
        "Fall",
        "Chill",
        "Gourmet"
    ],
    "title": "Potato, Apple, and Prune Stuffing",
    "url": "http://www.epicurious.com/recipes/food/views/potato-apple-and-prune-stuffing-13439"
}
