{
    "directions": [
        "Preheat oven to 450°F. Pierce potato in several places with fork. Bake until tender, about 1 hour. Let stand until just cool enough to handle, about 15 minutes. Peel potato. Press potato through ricer or food mill or mash in large bowl. Add flour, egg, Parmesan cheese, olive oil, lemon peel, salt, and pepper and stir just until blended. Turn dough out onto lightly floured surface; divide into 8 pieces. Roll 1 dough piece between hands and surface to 15-inch-long rope. Cut into 1/2-inch pieces. Place gnocchi on lightly floured baking sheet. Repeat with remaining dough. (Can be made 6 hours ahead. Cover and chill.)",
        "Bring 1/2 cup water to boil in small saucepan. Remove from heat. Add porcini; let soak until soft, about 20 minutes. Melt 1 tablespoon butter in heavy large skillet over medium-high heat. Add crimini mushrooms; sauté until soft, about 5 minutes. Add porcini mushrooms and their soaking liquid, leaving behind any sediment in bowl. Cook until almost all liquid evaporates, about 1 minute. Add broth and vinegar. Reduce heat to medium; simmer until reduced to 1 cup liquid, about 4 minutes. Whisk in 3 tablespoons butter.",
        "Heat heavy large skillet over medium heat. Add pancetta; sauté until pancetta is crisp, about 2 minutes. Add shallots, parsley, sage, and rosemary. Sauté until shallots are soft, about 5 minutes. Add liver and sauté just until cooked through, about 5 minutes. Add mushroom mixture. Season sauce to taste with salt and pepper.",
        "Meanwhile, bring large pot of salted water to boil. Add gnocchi and cook until rising to surface, about 2 minutes. Continue cooking 1 minute longer. Drain. Divide gnocchi among 4 plates. Spoon sauce over and serve.",
        "*Dried porcini mushrooms are available at Italian markets, specialty foods stores, and many supermarkets.",
        "**Pancetta, Italian bacon cured in salt, is available at Italian markets, some specialty foods stores, and some supermarkets."
    ],
    "ingredients": [
        "1 1-pound russet potato",
        "1/2 cup plus 2 tablespoons all purpose flour",
        "1 large egg",
        "1 teaspoon freshly grated Parmesan cheese",
        "1 teaspoon extra-virgin olive oil",
        "1/2 teaspoon grated lemon peel",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "1/2 cup water",
        "1/2 ounce dried porcini mushrooms*",
        "4 tablespoons (1/2 stick) butter",
        "2 cups sliced crimini mushrooms (about 4 ounces)",
        "1 1/2 cups low-salt chicken broth",
        "4 teaspoons Sherry wine vinegar",
        "2 ounces sliced pancetta,** chopped",
        "1/2 cup finely chopped shallots",
        "1 tablespoon minced fresh Italian parsley",
        "1 teaspoon minced fresh sage",
        "1 teaspoon minced fresh rosemary",
        "5 ounces chicken livers, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Mushroom",
        "Potato",
        "Bake",
        "Sauté",
        "Vinegar",
        "Bacon",
        "Fall",
        "Simmer",
        "Boil"
    ],
    "title": "Potato Gnocchi with Chicken Livers and Pancetta",
    "url": "http://www.epicurious.com/recipes/food/views/potato-gnocchi-with-chicken-livers-and-pancetta-108573"
}
