{
    "directions": [
        "Boil stocks and shallots in saucepan until reduced to 3/4 cup, 20 minutes. Set aside. Cook asparagus in boiling salted water until crisp-tender, 3 minutes. Transfer to bowl of ice water to cool. Drain.",
        "Line microwave-safe plate with plastic wrap. Overlap enough potato rounds (about 12) on plastic to form 4-inch round. Microwave on high until almost tender, about 3 minutes. Transfer potato galette to baking sheet. Drizzle with 1 teaspoon oil. Sprinkle with salt and pepper. Repeat with remaining potatoes and 3 teaspoons oil to form total of 4 galettes. (Reduced stock, asparagus, and galettes can be made 6 hours ahead. Cover and chill.) Melt 1 tablespoon butter in medium skillet over medium heat. Add leek. Cover and cook until just tender, stirring occasionally, 5 minutes. Add crab, cream, and chives; simmer to heat through. Season with salt and pepper. Remove from heat. Cover to keep warm. Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Add shrimp; sauté until just opaque in center, 3 minutes. Add asparagus; toss to heat through. Season with salt and pepper.",
        "Meanwhile, heat remaining 2 tablespoons oil in another large skillet over medium-high heat. Add galettes and cook until crisp and brown, 1 1/2 minutes per side; transfer 1 galette to each of 4 plates. Bring reduced stock to simmer. Remove from heat. Add remaining 2 tablespoons butter; whisk just until melted.",
        "Top potato galettes with crab mixture. Arrange shrimp atop crab. Surround with asparagus. Spoon stock over."
    ],
    "ingredients": [
        "1 cup chicken stock or canned low-salt chicken broth",
        "1 cup beef stock or canned unsalted beef broth",
        "1/4 cup chopped shallots (2 medium)",
        "24 asparagus spears, trimmed to 3 inches",
        "2 medium russet potatoes, peeled, cut into 1/8-inch-thick rounds",
        "4 teaspoons plus 2 tablespoons vegetable oil",
        "5 tablespoons unsalted butter",
        "1 leek (white and pale green parts only), thinly sliced",
        "1 cup crabmeat (about 5 ounces)",
        "2 tablespoons whipping cream",
        "2 tablespoons minced fresh chives",
        "12 uncooked large shrimp, peeled, deveined, tails left intact"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Potato",
        "Side",
        "Crab",
        "Shrimp",
        "Asparagus",
        "Spring",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Potato Galettes with Crab, Shrimp, and Asparagus",
    "url": "http://www.epicurious.com/recipes/food/views/potato-galettes-with-crab-shrimp-and-asparagus-105064"
}
