{
    "directions": [
        "Preheat oven to 375°F. Brush 13x9x2-inch glass or oval ceramic baking dish with 2 tablespoons oil. Arrange 1/3 of potatoes, slightly overlapping, in dish. Sprinkle with 1/2 teaspoon coarse salt and 1/4 teaspoon pepper. Pour 1/3 cup cream over; sprinkle with 1/4 cup cheese. Repeat layering 1/3 of potatoes, 1/2 teaspoon salt, 1/4 teaspoon pepper, 1/3 cup cream, and 1/4 cup cheese 2 more times. Bake uncovered until potatoes are tender, adding cream by tablespoonfuls if dry, about 45 minutes. Remove from oven; maintain oven temperature.",
        "Sprinkle thyme and garlic slices over gratin. Toss mushrooms in medium bowl with 3 tablespoons oil; sprinkle with coarse salt and pepper. Arrange mushroom slices atop gratin around edge of dish. Drizzle with 1/4 cup cream; sprinkle with 1/4 cup cheese. Continue to bake uncovered until mushrooms are tender and potato edges are golden brown, about 20 minutes longer. DO AHEAD: Can be made 1 day ahead. Cool 1 hour in dish; cover and chill. Before serving, cut gratin into 10 pieces. Transfer to rimmed baking sheet. Cover with foil and rewarm in 350°F oven, 10 to 15 minutes."
    ],
    "ingredients": [
        "5 tablespoons olive oil, divided",
        "2 1/2 pounds medium Yukon Gold potatoes, peeled, cut lengthwise into 1/8-inch-thick slices",
        "1 1/2 teaspoons coarse kosher salt plus additional for mushrooms",
        "3/4 teaspoon freshly ground black pepper plus additional for mushrooms",
        "1 1/4 cups (or more) heavy whipping cream, divided",
        "1 cup freshly grated Parmesan cheese (about 3 ounces), divided",
        "2 tablespoons chopped fresh thyme",
        "6 garlic cloves, thinly sliced",
        "12 ounces fresh crimini (baby bella) mushrooms, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Potato",
        "Side",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "Dinner",
        "Casserole/Gratin",
        "Parmesan",
        "Fall",
        "Family Reunion",
        "Christmas Eve",
        "Potluck",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Potato-Mushroom Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/potato-mushroom-gratin-350809"
}
