{
    "directions": [
        "Preheat the oven to 350°F. Oil an 8-inch-square (2-quart) baking dish lightly, line it with wax paper, and oil the paper lightly. Peel the potatoes and food processor fitted with a 2-mm. slicing disk slice the potatoes crosswise. (Alternatively, the potatoes may be sliced thin with a hand-held slicing device.) In a kettle of salted boiling water boil the potatoes for 7 minutes, or until they are just tender, drain them in a colander, and rinse them briefly under cold water. In the kettle cook the spinach in the water clinging to the leaves, covered, over high heat, stirring occasionally, for 2 minutes, or until it is wilted, drain it, and refresh it under cold water. Squeeze the water from the spinach by wringing it by handfuls in a kitchen towel, transfer it to the food processor fitted with the metal blade, and add the Feta. In a bowl whisk together well the half-and-half, the eggs, the salt, and the pepper, add half the custard to the spinach mixture, and pulse the motor of the processor until the mixture is coarse.",
        "Transfer the potatoes to the prepared baking dish and spread them in an evenly layer. Pour the remaining custard over the potatoes, shaking the dish slightly to distribute the custard evenly, and top the potatoes with the spinach mixture, smoothing the top. bake the gratin in the middle of the oven for 45 to 50 minutes, or until it is set in the middle, and let cool on a rack for 30 minutes. Run a knife around the side of the dish, invert the gratin onto a flameproof plate, and peel off the wax paper. Broil the gratin under a preheated broiler about 4 inches from the heat for 10 to 15 minutes, or until top is golden brown, and serve it cut into squares."
    ],
    "ingredients": [
        "2 pounds russet (baking) potatoes (about 3 large)",
        "2 pounds fresh spinach, washed well and the coarse stems discarded",
        "1/2 pound Feta cheese",
        "1 1/2 cups half-and-half",
        "3 large eggs",
        "1 1/2 teaspoons salt",
        "3/4 teaspoon black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Potato",
        "Side",
        "Bake",
        "Vegetarian",
        "Casserole/Gratin",
        "Feta",
        "Spinach",
        "Gourmet"
    ],
    "title": "Potato, Spinach, and Feta Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/potato-spinach-and-feta-gratin-11698"
}
