{
    "directions": [
        "Place porcini and 1 cup boiling water in medium bowl. Place small bowl atop mushrooms to keep submerged. Let soak 20 minutes. Drain and coarsely chop mushrooms.",
        "Melt butter with oil in medium skillet over medium heat. Add mushrooms and sauté until beginning to brown, about 3 minutes. Sprinkle with salt and pepper. Remove from heat. Whisk 1/4 cup Parmesan and next 4 ingredients in small bowl; season with salt and pepper. DO AHEAD: Mushrooms and cheese mixture can be prepared 1 day ahead. Cover separately and chill.",
        "Preheat oven to 325°F. Butter wide shallow 2-quart baking dish. Arrange 1/4 of potato slices in bottom of dish. Sprinkle lightly with salt and pepper. Scatter 1/4 of mushrooms over. Repeat. Spread half of cheese mixture over, shaking dish to settle. Repeat with remaining potatoes and mushrooms in 2 layers each; spread remaining cheese mixture over. Sprinkle 2 tablespoons Parmesan over. Place gratin dish on rimmed baking sheet.",
        "Bake gratin until top is brown and sauce is bubbling at edges, about 1 hour 15 minutes. Let gratin rest 15 minutes before serving. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Tent loosely with foil and rewarm in 300°F oven 20 minutes.",
        "*Available in the produce section of many supermarkets and at specialty foods stores and Italian markets.",
        "**Italian cream cheese; sold at many supermarkets and at Italian markets."
    ],
    "ingredients": [
        "4 ounces dried porcini mushrooms*",
        "1 cup boiling water",
        "2 tablespoons (1/4 stick) butter",
        "2 tablespoons extra-virgin olive oil",
        "1/4 cup plus 2 tablespoons grated Parmesan cheese",
        "1 1/2 cups mascarpone cheese** (from about 1 1/2 seven-ounce containers)",
        "1 cup whipping cream",
        "3 garlic cloves, chopped",
        "Pinch of freshly grated nutmeg",
        "2 1/2 pounds russet potatoes (about 5 large), peeled, cut crosswise into 1/8-inch-thick slices"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Potato",
        "Side",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Vegetarian",
        "High Fiber",
        "Casserole/Gratin",
        "Cream Cheese",
        "Parmesan",
        "Christmas Eve",
        "Sugar Conscious",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Potato Gratin with Porcini Mushrooms and Mascarpone Cheese",
    "url": "http://www.epicurious.com/recipes/food/views/potato-gratin-with-porcini-mushrooms-and-mascarpone-cheese-240408"
}
