{
    "directions": [
        "To make the raita, in a small bowl, stir together the yogurt, cucumber, mint, cumin and cayenne. Cover and refrigerate until ready to serve.",
        "To make the dough, in a bowl, whisk together the flour, salt and nigella seeds. Add the oil and, using your fingers, rub the oil into the flour until it is completely combined. Add 3 Tbs. of the water and stir to combine. Add more water, 1 Tbs. at a time, until the dough is just moistened and comes together in a ball.",
        "Turn the dough out onto a lightly floured work surface and knead for 2 minutes. Form the dough into a ball and wrap in plastic wrap. Let rest at room temperature for 30 minutes.",
        "While the dough rests, make the filling: Place the potatoes in a saucepan and cover with cold water. Bring to a boil, then reduce the heat to a simmer and cook until the potatoes are very tender, about 15 minutes. Drain the potatoes, transfer to a bowl and mash. Set aside.",
        "In a sauté pan over medium heat, warm the oil. Add the onion and cook, stirring occasionally, until softened, about 3 minutes. Add the garlic, garam masala, coriander, cayenne and salt to the pan and cook, stirring constantly, until fragrant, about 1 minute. Transfer the onion mixture to the bowl with the potatoes and stir to combine. Stir in the peas and cilantro. Set aside.",
        "In a small mixing bowl, stir together the cornstarch with 1/2 cup (4 fl. oz./125 ml) water. Set aside.",
        "To assemble the samosas, transfer the dough to a floured work surface. Divide into 6 pieces of equal size. Working with one piece of dough at a time, using a floured rolling pin, roll the dough into a very thin round about 8 inches (20 cm) in diameter. Cut the round into quarters to make 4 wedges. Brush the edges of each wedge with the cornstarch mixture. Place 1 Tbs. of the filling in the center of the wedge. Bring two of the corners together and press the sides together to form a seam. Spoon more filling into the center of the cone if needed. Bring the third corner to join the other two, then press the seams together. Let sit for at least 5 minutes before frying.",
        "To fry, fill a large, deep saucepan two-thirds full of canola oil and heat to 400°F (200°C) on a deep-frying thermometer. Line a baking sheet with paper towels and set aside.",
        "Working in batches, drop the samosas into the oil, being sure not to crowd them in the pan. Fry, turning occasionally, until deep golden brown on all sides, about 5 minutes total. Transfer to the prepared baking sheet and let cool slightly.",
        "To serve, garnish the raita with the nigella seeds. Serve the warm samosas with the raita alongside. Makes 24 samosas.",
        "Williams Sonoma Test Kitchen"
    ],
    "ingredients": [
        "For the cucumber raita:",
        "1/2 cup (4 oz./125 g) plain whole-milk yogurt",
        "1/4 cup (1 1/2 oz./45 g) finely chopped cucumber",
        "1/4 cup (1/3 oz./10 g) finely chopped fresh mint",
        "1/4 tsp. ground cumin",
        "Pinch of cayenne pepper",
        "Nigella seeds for garnish (optional)",
        "2 cups (10 oz./315 g) all-purpose flour",
        "1/2 tsp. kosher salt",
        "2 Tbs. nigella seeds (optional)",
        "4 Tbs. (2 oz./60 g) vegetable oil, or 4 Tbs. ghee, melted and cooled",
        "5 Tbs. (3 fl. oz./80 ml) water, plus more as needed",
        "1 lb. (500 g) Yukon Gold potatoes, peeled and quartered",
        "2 Tbs. vegetable oil",
        "1 yellow onion, minced",
        "2 garlic cloves, minced",
        "1 tsp. garam masala",
        "1 tsp. ground coriander",
        "1/4 tsp. cayenne pepper",
        "1 tsp. kosher salt",
        "1 cup (5 oz./155 g) frozen peas, thawed",
        "3 Tbs. finely chopped fresh cilantro",
        "For finishing:",
        "1/4 cup (1 oz./30 g) cornstarch",
        "Canola oil for frying"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Potato and Pea Samosas with Cucumber Raita",
    "url": "http://www.williams-sonoma.com/recipe/potato-and-pea-samosas-with-cucumber-raita.html"
}
