{
    "directions": [
        "Combine the yeast, sugar, and milk in the bowl of a heavy-duty mixer fitted with a dough hook. Add 1/2 cup of the flour. Stir well, cover with a towel, and let rest in a warm place for 25 minutes.",
        "Mix in the olive oil, salt, and 1 cup of flour, until well incorporated. Add the remaining flour, 1/4 cup at a time, until the dough adheres to the hook. It should remain soft and slightly sticky. Continue mixing for about 6 minutes, or until the dough is smooth and elastic.",
        "Remove from the bowl, shape the dough into a ball, flatten slightly, and put into an oiled bowl. Turn to coat. Cover the bowl with a towel and put in a warm place for about 1 hour, to let the dough rise until doubled.",
        "Heat the olive oil in a skillet over medium heat. Add the pancetta and cook slowly until very crisp. Remove to paper towels to drain. Reserve the pancetta and fat separately.",
        "Put the potatoes in cold salted water, cover, and bring to a boil. Cook about 8 minutes, or until tender. Drain well and place in a bowl.",
        "Pour the pancetta fat over the warm potatoes, add the crisped pancetta, 1 teaspoon of the rosemary, salt and pepper to taste, and the lemon zest. Toss well and set aside.",
        "Preheat the oven to 375 degrees F. Oil a baking sheet.",
        "Lightly flour the dough and punch it down. Turn it out onto a lightly floured surface and knead lightly until smooth. Roll out the dough into a rectangle about 12 by 10 inches. Brush off any excess flour and transfer to the oiled baking sheet. Brush the dough with olive oil and leave to rise for 30 minutes.",
        "Sprinkle the potato mixture onto the dough and press it in with the flat of your hand. Press your fingers into the dough to make evenly spaced indentations all over the surface, being careful not to puncture or tear the dough. Scatter the remaining rosemary over the dough.",
        "Bake for about 25 minutes, until the potatoes are golden brown and the bread is crisp on the bottom. Let cool in the pan to room temperature. Cut into squares, \"fingers,\" or triangles to serve."
    ],
    "ingredients": [
        "1 envelope active dry yeast",
        "1 1/2 teaspoons sugar",
        "1 cup lukewarm whole milk",
        "2 1/4 cups all-purpose flour, plus more for dusting work surface",
        "1 tablespoon extra-virgin olive oil",
        "3/4 teaspoon salt, preferably gray salt",
        "1 tablespoon extra virgin olive oil",
        "3/4 cup diced pancetta or bacon (about 1/4 pound, cut in 1/2-inch dice)",
        "1 1/2 cups peeled and diced, new or russet potatoes (about 1/2 pound, cut in 1/2-inch dice)",
        "2 teaspoons finely chopped fresh rosemary leaves",
        "Gray salt and freshly ground black pepper",
        "1 teaspoon freshly grated lemon zest",
        "2 tablespoons extra-virgin olive oil, to coat the baking sheet and the dough"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "European Recipes",
        "Italian",
        "Focaccia Recipes",
        "Vegetable",
        "Potato",
        "Meat",
        "Appetizer"
    ],
    "title": "Potato Focaccia",
    "url": "http://www.foodnetwork.com/recipes/michael-chiarello/potato-focaccia-recipe"
}
