{
    "directions": [
        "Heat oil in heavy large pot over medium heat. Add onions, pancetta, prosciutto, and garlic and sauté until mixture begins to brown, about 10 minutes. Add ground chuck and cook until no longer pink, breaking up with fork, about 5 minutes. Add 1 cup stock, mushrooms, and sage. Simmer until liquid is almost absorbed, about 4 minutes. Add remaining 3 cups stock, 1 cup at a time, simmering until liquid is almost absorbed before adding more. Mix in tomato paste, then tomatoes with juices. Simmer until meat is very tender, stirring occasionally and thinning with about 1 cup water every 30 minutes, about 1 1/2 hours (sauce will be medium-thick consistency). (Can be prepared up to 4 days ahead.Refrigerate uncovered until cold. Cover; keep refrigerated.)",
        "Steam potatoes over boiling water until tender, about 12 minutes. Working in batches, press warm potatoes through ricer into large bowl (or place warm potatoes in large bowl and mash finely with potato masher). Cool until lukewarm, about 10 minutes. Add egg, cream, salt, and nutmeg and blend well. Add 1 1/2 cups flour and mix until soft and slightly sticky dough forms, adding more flour by tablespoonfuls if too moist.",
        "Turn dough out onto lightly floured work surface. Divide into 6 equal portions. Gently roll 1 dough portion between hands and work surface to 3/4-inch-thick rope about 20 inches long. Cut into 3/4-inch-long pieces.",
        "Roll each piece over wires of slender whisk or dinner fork to make grooves in gnocchi. Arrange gnocchi in single layer on floured baking sheet. Repeat with remaining 5 dough portions.",
        "Cook 1/3 of gnocchi in large pot of boiling generously salted water until gnocchi rise to top and are cooked through and tender, about 5 minutes (check at 4 minutes). Using large strainer or slotted spoon, transfer gnocchi to large baking pan; arrange gnocchi in single layer. Cook remaining gnocchi in 2 batches. (Gnocchi can be prepared ahead. Let stand 1 hour at room temperature, or cover and refrigerate up to 2 days.)",
        "Melt butter in large skillet over medium heat. Add gnocchi and cook until heated through, tossing often, about 8 minutes.",
        "Meanwhile, rewarm ragù over medium-low heat, stirring occasionally. Season to taste with salt and pepper.",
        "Ladle ragù into large shallow bowls. Spoon gnocchi over. Using vegetable peeler, shave Parmesan cheese over gnocchi.",
        "Garnish with fresh sage, if desired."
    ],
    "ingredients": [
        "1/2 cup olive oil",
        "1 3/4 cups chopped onions",
        "3 ounces pancetta or bacon, finely chopped",
        "2 ounces prosciutto, finely chopped",
        "3 tablespoons chopped garlic",
        "2 pounds ground chuck",
        "4 cups beef stock or canned beef broth",
        "1 ounce dried porcini mushrooms, broken into small pieces",
        "1 tablespoon dried sage leaves",
        "1 6-ounce can tomato paste",
        "1 28-ounce can diced tomatoes in juice",
        "4 small russet potatoes (22 to 24 ounces total), peeled, cut into 1/2-inch pieces",
        "1 large egg",
        "2 tablespoons whipping cream",
        "1 1/4 teaspoons salt",
        "1/8 teaspoon ground nutmeg",
        "1 1/2 cups (about) all purpose flour",
        "1/2 cup (1 stick) butter",
        "Wedge of Parmesan cheese",
        "Fresh sage sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Potato",
        "Tomato",
        "Sauté",
        "Ground Beef",
        "Bacon",
        "Winter",
        "Prosciutto",
        "Boil"
    ],
    "title": "Potato Gnocchi with Beef Ragù",
    "url": "http://www.epicurious.com/recipes/food/views/potato-gnocchi-with-beef-ragu-103230"
}
