{
    "directions": [
        "Combine 1 1/2 cups hot water and porcini in small bowl. Let stand until mushrooms soften, about 30 minutes. Drain, reserving 2/3 cup soaking liquid. Chop porcini; set aside. Remove and chop stems from portobellos; place in large bowl. Using small spoon, scrape away dark gills from portobellos and discard. Cut portobello caps into 1/2-inch pieces; add to bowl.",
        "Heat 3 tablespoons olive oil in heavy large skillet over medium-high heat. Add chopped portobello stems and caps and sauté 4 minutes. Stir in garlic and reserved porcini and sauté until mushrooms are tender, about 10 minutes. Season with salt and pepper. Remove from heat.",
        "Preheat oven to 375°F. Coat each of two 13x9x2-inch glass baking dishes with 1 tablespoon oil. Combine remaining 7 tablespoons oil, potatoes, parsley, thyme, rosemary, salt and pepper in large bowl; toss to coat. Layer 1/6 of potato mixture in each prepared dish (there will not be enough to overlap slices). Top potatoes in each with 1/4 of mushroom mixture. Repeat layering. Top with remaining potatoes. Pour 1/3 cup reserved porcini soaking liquid over potatoes in each dish. Cover dishes with foil.",
        "Bake gratins 45 minutes. Uncover and bake until tops are brown and potatoes are tender, about 40 minutes longer. (Can be prepared 2 hours ahead. Let stand at room temperature. Cover with foil and rewarm in 350°F oven about 20 minutes.)",
        "*Dried porcini mushrooms are available at Italian markets, specialty foods stores and many supermarkets."
    ],
    "ingredients": [
        "1 1/2 cups hot water",
        "1 1/2-ounce package dried porcini mushrooms*",
        "1 1/2 pounds portobello mushrooms",
        "12 tablespoons olive oil",
        "4 garlic cloves, minced",
        "4 pounds Yukon Gold potatoes or white-skinned potatoes, peeled, cut into 1/8-inch-thick slices",
        "1/4 cup chopped fresh parsley",
        "1 tablespoon chopped fresh thyme",
        "1 tablespoon chopped fresh rosemary",
        "2 teaspoons salt",
        "1 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Mushroom",
        "Potato",
        "Side",
        "Bake",
        "Christmas",
        "Easter",
        "Thanksgiving",
        "Casserole/Gratin",
        "Rosemary",
        "Fall",
        "Winter",
        "Thyme",
        "Christmas Eve",
        "Party",
        "Parsley",
        "Sugar Conscious",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Potato and Portobello Mushroom Gratin",
    "url": "http://www.epicurious.com/recipes/food/views/potato-and-portobello-mushroom-gratin-104503"
}
