{
    "directions": [
        "Preheat oven to 375°F. Coat bottom and sides of an 11- by 8-inch (6-cup) gratin dish or other shallow baking dish with 1 tablespoon oil.",
        "In a heavy skillet cook onion in 2 tablespoons oil over moderately low heat, stirring, until softened. Add garlic and cook, stirring, 1 minute. Add herbes de Provence, sugar, tomatoes, bouillon cube, and salt and pepper to taste. Cook mixture, covered, stirring occasionally, 20 minutes and stir in olives.",
        "Cut potatoes crosswise into 3/4-inch-thick slices and arrange one third in baking dish. Spread half of tomato mixture over potatoes and top with half of goat cheese. Continue layering potatoes, tomato mixture, and goat cheese in same manner, ending with potatoes. Drizzle remaining tablespoon oil over gratin and bake, covered with foil, in middle of oven 40 minutes. Remove foil and bake gratin 20 to 30 minutes more, or until potatoes are very tender. Sprinkle gratin with parsley."
    ],
    "ingredients": [
        "4 tablespoons olive oil",
        "1 medium onion, chopped fine",
        "1 garlic clove, minced",
        "1 tablespoon dried herbes de Provence*, crumbled",
        "1/4 teaspoon sugar",
        "6 plum tomatoes, chopped",
        "1 beef bouillon cube if desired",
        "1/3 cup Niçoise or other brine-cured black olives, pitted and chopped",
        "2 russet (baking) potatoes (about 1 pound total), scrubbed",
        "3 ounces fresh mild goat cheese, crumbled (about 3/4 cup)",
        "2 tablespoons finely chopped fresh parsley leaves (wash and dry before chopping)",
        "*available at specialty foods shops"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Potato",
        "Tomato",
        "Side",
        "Bake",
        "Casserole/Gratin",
        "Goat Cheese",
        "Winter",
        "Gourmet",
        "Maryland",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Potato Gratin with Goat Cheese, Tomatoes, and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/potato-gratin-with-goat-cheese-tomatoes-and-olives-13598"
}
