{
    "directions": [
        "Cook bacon in heavy 8-quart Dutch oven over high heat until fat is rendered, about 4 minutes. Using slotted spoon, transfer bacon to medium bowl. Pour off all but 2 tablespoons fat from pot and reserve. Heat fat in pot over high heat. Working in batches, add pork, sprinkle with salt and pepper and brown lightly on all sides. Transfer each batch to bowl with bacon. Add onions to pot. Reduce heat to medium; cook until tender, about 8 minutes. Return pork and bacon to pot. Add broth, wine and bay leaves. Cover; simmer 1 hour.",
        "Cut cabbage, carrots, turnips and potatoes into 3/4- to 1-inch pieces. Heat reserved bacon fat in heavy large skillet over medium-high heat. Add cabbage and cook until wilted, stirring often, about 5 minutes. Add carrots, turnips and potatoes and stir 5 minutes. Add vegetables to pork. Cover and simmer until pork is tender, about 45 minutes.",
        "Add cannellini to stew. Simmer uncovered until stew thickens, stirring occasionally, about 15 minutes. Add cloves. Season to taste with salt and pepper. (Can be prepared 1 day ahead. Cover and refrigerate. Rewarm over medium heat, stirring frequently.) Cook green beans in large pot of boiling salted water until crisp-tender, about 5 minutes. Drain and mix into stew. Ladle into shallow bowls and serve."
    ],
    "ingredients": [
        "6 bacon slices, chopped",
        "3 pounds boneless pork shoulder, cut into 1 1/2-inch cubes",
        "2 medium onions, chopped",
        "2 14 1/2-ounce cans chicken broth",
        "1 14 1/2-ounce can beef broth",
        "1 cup dry white wine",
        "2 bay leaves",
        "1 1 1/2-pound cabbage",
        "3 large carrots, peeled",
        "2 turnips, peeled",
        "2 russet potatoes, peeled",
        "3 15-ounce cans cannellini (white kidney beans), rinsed, drained",
        "1/4 teaspoon ground cloves",
        "1 pound green beans, trimmed, cut into 1 1/2-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Potato",
        "Vegetable",
        "Bacon",
        "Fall"
    ],
    "title": "Potee Lorraine",
    "url": "http://www.epicurious.com/recipes/food/views/potee-lorraine-2523"
}
