{
    "directions": [
        "In a heavy skillet heat 1 tablespoon oil over moderately high heat until hot but not smoking and brown onion, cut sides down. In a 7- to 8-quart heavy kettle combine onion, smoked pork, water, bay leaf, peppercorns, thyme, and parsley sprigs and simmer, covered, 1 hour.",
        "Prick each sausage in several places to prevent skins from bursting when browning. In skillet heat remaining 1/2 tablespoon oil over moderately high heat until hot but not smoking and brown sausages. Transfer sausages to paper towels to drain. Stir celery into soup and put cabbage leaves on top. Simmer soup, covered, 15 minutes.",
        "Lifting cabbage leaves, stir sausages, leeks, turnips, and carrots into soup and simmer, covered, until carrots are tender, about 10 minutes. Soup may be prepared up to this point 1 day ahead. Cool soup, uncovered, and chill, covered. Reheat soup before proceeding with recipe.",
        "Transfer smoked pork to a cutting board and slice.",
        "Arrange cabbage leaves in bottoms of 6 large soup bowls and stir chopped parsley and salt and pepper to taste into soup. Arrange vegetables, smoked pork, and sausages in bowls and ladle desired amount of broth over mixture."
    ],
    "ingredients": [
        "1 1/2 tablespoons vegetable oil",
        "1 onion with skin, halved",
        "3 pounds boneless smoked pork such as ham or pork butt",
        "5 quarts cold water",
        "1 bay leaf",
        "1/2 teaspoon whole black peppercorns",
        "1 fresh thyme sprig or 1/2 teaspoon dried thyme",
        "3 fresh parsley sprigs plus 1/2 cup finely chopped leaves",
        "6 fresh pork sausage links (not breakfast links)",
        "3 celery ribs, cut crosswise into 3 sections and each section cut lengthwise into 3 sticks",
        "6 Savoy cabbage leaves, halved along center rib, discarding rib",
        "4 leeks, white and pale green parts cut crosswise 1/4 inch thick, washed well, and drained",
        "6 white turnips, trimmed and cut into 1/2-inch wedges",
        "6 carrots, halved and cut lengthwise into 1/2-inch-wide sticks"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Pork",
        "Vegetable",
        "Sausage",
        "Leek",
        "Carrot",
        "Turnip",
        "Winter",
        "Cabbage",
        "Simmer",
        "Gourmet"
    ],
    "title": "Potee",
    "url": "http://www.epicurious.com/recipes/food/views/potee-10054"
}
