{
    "directions": [
        "Heat oil in a large saucepan over medium-high heat. Add ham hock and cook, turning occasionally, until browned, about 8 minutes. Reduce heat to medium. Add onion, garlic, and bay leaves; cook, stirring occasionally, until onion is beginning to brown, about 5 minutes. Add vinegar and stir, scraping up any browned bits. Stir in hot sauce and sugar. Add broth and reserved mustard green stems and bring to a boil. Reduce heat and simmer until liquid is reduced to 2 cups, 1-2 hours. Set a sieve over a large bowl or measuring cup. Strain potlikker into bowl. Pick and reserve the meat from the ham hock to add to the noodles later, if desired. Discard skin, bone, and remaining solids in sieve. Set potlikker aside. DO AHEAD: Potlikker and ham can be made 2 days ahead. Chill separately until cold; cover and keep chilled.",
        "Cook noodles in a large pot of boiling salted water, stirring occasionally, until al dente. Drain and set aside.",
        "Meanwhile, heat a large pot over medium heat. Add bacon and cook, stirring occasionally, until crispy. Add shallots and reserved picked meat, if using; cook, stirring occasionally, until shallots are soft, 4-5 minutes. Pour off any excess fat in pan. Increase heat to medium-high; add greens and cook, stirring constantly, until wilted. Add potlikker, scraping up browned bits with a wooden spoon, and bring to a boil. Add noodles; toss to coat, and heat through. Season to taste with salt and pepper.",
        "Transfer noodle mixture to serving bowls and sprinkle with Pecorino."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "1 10-12-ounce smoked ham hock or smoked turkey wing",
        "1/2 onion, coarsely chopped",
        "8 garlic cloves, lightly crushed",
        "2 bay leaves",
        "1/4 cup red wine vinegar",
        "2 tablespoons hot pepper sauce (preferably Texas Pete or Frank's)",
        "2 tablespoons sugar",
        "5 cups low-salt chicken broth or water",
        "2 bunches mustard greens or kale, tough stems trimmed, chopped, and reserved, leaves chopped",
        "3/4 pound egg noodles",
        "Kosher salt",
        "6 slices bacon (about 7 ounces), cut crosswise into 1/4\"-wide pieces",
        "2 large shallots, thinly sliced",
        "Freshly ground black pepper",
        "1/4 cup finely grated Pecorino"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Dinner",
        "Ham",
        "Winter",
        "Mustard Greens",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Potlikker Noodles with Mustard Greens",
    "url": "http://www.epicurious.com/recipes/food/views/potlikker-noodles-with-mustard-greens-388666"
}
