{
    "directions": [
        "In a saucepan of boiling salted water boil the onions for 10 minutes, or until they are just tender, and drain them well. In a heavy kettle heat the oil and the butter over moderately high heat until the mixture is hot but not smoking and in the fat brown well the chicken, patted dry and seasoned with salt and pepper, in batches, transferring it as it is browned with tongs to a platter. Pour the fat from the kettle, add the onions, and sauté them, stirring, for 1 minute. Add the vinegar and the wine and boil the liquid, scraping up the brown bits, until it is reduced by half. Add the broth, the tomatoes, the dried tarragon, if using, and the chicken, bring the mixture to a boil, and simmer it, covered, for 20 to 25 minutes, or until the chicken is cooked through. The chicken may be prepared up to this point 1 day in advance: Let the mixture cool, uncovered, and chill it, covered. Reheat the mixture before proceeding.",
        "Transfer the chicken and the onions with a slotted spoon to a heated platter and keep them warm, covered with foil. Stir the arrowroot or cornstarch mixture, add it to the simmering cooking liquid with half the chopped fresh tarragon, if using, and simmer the sauce, stirring, for 1 minute. Spoon the sauce over the chicken, sprinkle the chicken with the remaining chopped fresh tarragon, if using, and garnish it with the tarragon sprigs."
    ],
    "ingredients": [
        "a 10-ounce container fresh pearl onions (about 2 1/2 cups), blanched in boiling water for 1 minute, drained, and peeled",
        "2 tablespoons vegetable oil",
        "1 tablespoon unsalted butter",
        "3 1/2 pounds chicken pieces",
        "1 cup tarragon white-wine vinegar",
        "1/2 cup dry white wine",
        "1 1/2 cups chicken broth",
        "1 cup chopped and drained canned whole tomatoes",
        "2 tablespoons finely chopped fresh tarragon or 1 teaspoon dried, crumbled, plus, if desired, fresh tarragon sprigs for garnish",
        "4 teaspoons arrowroot or 1 1/2 tablespoons cornstarch, either dissolved in 2 tablespoons cold water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Sauté",
        "Vinegar",
        "Tarragon",
        "Gourmet"
    ],
    "title": "Poulet au Vinaigre a l'Estragon",
    "url": "http://www.epicurious.com/recipes/food/views/poulet-au-vinaigre-a-lestragon-11974"
}
