{
    "directions": [
        "Bring a large pot of salted water to a boil and set a bowl of ice water on the side. Score an X on the bottoms of the tomatoes. Boil them for 5 seconds, or until the skins loosen on the bottoms. Strain and peel under cold running water; set aside.",
        "In a 5-quart braising pan over medium-high heat, melt the butter with the oil. Season the chicken on all sides with salt and pepper.",
        "Add the chicken to the pan skin side down and sear until golden brown on both sides, about 10 minutes total. Transfer the chicken to a platter, set aside, and strain all but 1 tablespoon fat from the pan.",
        "Reduce the heat to medium and add the shallots and onions to the pan. Cook, stirring, until the shallots are soft. Add the tomato paste and flour and cook, stirring, for another minute. Add the vinegar, bring to a simmer, then stir in the chicken stock. Bring to a simmer, making sure to scrape the bottom of the pan. Return the chicken to the pan with half of the tomatoes and the tarragon. Cover and simmer for 10 minutes, stirring occasionally. Add the remaining tomatoes, cover, and simmer for another 20 minutes, or until the chicken is cooked through.",
        "Rinse the rice with cold water until it runs clear. Heat the olive oil in a medium saucepan over medium heat. Add the shallot and cook, stirring, until translucent. Add the rice and stir to coat. Add the butter, chicken stock, salt, bay leaf, thyme, and tarragon and bring to a simmer. Cover and cook undisturbed over low heat for 10 to 15 minutes. Turn off the heat and rest, covered, for 5 minutes. Remove the lid and fluff the rice with a fork.",
        "Bring a large saucepan of salted water to a boil. Add the beans and boil for 4 minutes, or until tender. Strain, return the beans to the pan over medium-low heat, and toss with the butter. Season with salt and pepper and toss in the tarragon leaves just before serving."
    ],
    "ingredients": [
        "Salt",
        "15 golf ball-size tomatoes",
        "1 tablespoon butter",
        "2 tablespoons olive oil",
        "2 (2- to 3-pound) farm-raised chickens, each cut into 8 pieces",
        "Freshly ground white pepper",
        "4 large shallots, sliced",
        "10 ounces pearl onions",
        "2 tablespoons tomato paste",
        "3 tablespoons flour",
        "1/2 cup tarragon vinegar",
        "2 cups chicken stock",
        "1/2 bunch tarragon",
        "1 1/2 cups basmati rice",
        "2 tablespoons olive oil",
        "1 shallot, minced",
        "2 tablespoons butter",
        "2 1/2 cups chicken stock",
        "1 teaspoon salt",
        "1 bay leaf",
        "2 sprigs thyme",
        "2 sprigs tarragon",
        "Salt",
        "1 pound yellow wax beans, trimmed",
        "2 tablespoons butter",
        "Freshly ground white pepper",
        "1/2 bunch tarragon, leaves chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Rice",
        "Tomato",
        "Braise",
        "Dinner",
        "Legume",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Poulet à l'Estragon",
    "url": "http://www.epicurious.com/recipes/food/views/poulet-a-lestragon-51199010"
}
