{
    "directions": [
        "In a large ovenproof kettle stir together the onion, the garlic, the gingerroot, the cinnamon stick, 3 tablespoons of the coriander, the parsley, the lemon juice, the saffron, the oil, and 1 cup water, put the chicken on top of the mixture, and season it with salt and pepper.",
        "Bake the chicken, covered, in the middle of a preheated 375°F. oven for 45 minutes, transfer it to a cutting board, and let it stand, covered loosely, for 5 minutes. Cut the chicken into quarters.",
        "To the onion mixture add the olives and the preserved lemon, bring the sauce to a boil, and simmer it, for 3 to 5 minutes, or until it is thickened. Return the chicken to the kettle and simmer the mixture for 2 to 3 minutes, or until the chicken is just heated through. Discard the cinnamon stick and serve the chicken with the rice pilaf, sprinkled with the additional coriander."
    ],
    "ingredients": [
        "1 1/2 cups chopped onion",
        "5 garlic cloves minced",
        "1 tablespoon minced peeled fresh gingerroot",
        "a 3-inch cinnamon stick",
        "3 tablespoons minced fresh coriander plus additional for garnish if desired",
        "3 tablespoons minced fresh parsley leaves",
        "1 tablespoon fresh lemon juice, or to taste",
        "a pinch of saffron threads, crumbled",
        "1/2 cup olive oil",
        "a 3 1/2- to 4-pound chicken, trussed",
        "1/4 cup Niçoise or other brine-cured black olives, pitted and chopped",
        "1 preserved lemon (small), chopped fine",
        "rice pilaf as an accompaniment"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Citrus",
        "Garlic",
        "Ginger",
        "Herb",
        "Bake",
        "Lemon",
        "Spice",
        "Saffron",
        "Fall",
        "Gourmet"
    ],
    "title": "Poulet aux Citrons Confits et Olives",
    "url": "http://www.epicurious.com/recipes/food/views/poulet-aux-citrons-confits-et-olives-15176"
}
