{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.",
        "Mix brown sugar, sour cream, 2 tablespoons butter, and cornstarch in a heavy saucepan over medium heat. Cook, stirring constantly, until the mixture comes to a boil. Remove sauce from heat and stir in 1/2 teaspoon vanilla extract; set praline sauce aside.",
        "Place 1/2 cup melted butter into a large mixing bowl; stir in vanilla ice cream. With an electric mixer, beat eggs into ice cream mixture one at a time, adding the second egg after the first has been incorporated. Stir in 1/2 teaspoon vanilla extract.",
        "Whisk flour, graham cracker crumbs, white sugar, baking powder, and salt in a separate bowl until thoroughly combined. Stir flour mixture into ice cream mixture by thirds until batter is smooth.",
        "Pour batter into prepared baking pan and drizzle top of batter with half the praline sauce.",
        "Bake in preheated oven until cake is lightly browned and a toothpick inserted into the center comes out clean, 25 to 30 minutes. Cool cake in pan on a wire rack.",
        "Place remaining praline sauce over low heat to warm; stir in pecans. Drizzle warm praline-pecan sauce over cake. Serve with dollops of whipped cream."
    ],
    "image": "https://images.media-allrecipes.com/images/79591.png",
    "ingredients": [
        "1 cup brown sugar",
        "1/2 cup sour cream",
        "2 tablespoons butter",
        "2 teaspoons cornstarch",
        "1/2 teaspoon vanilla extract",
        "1/2 cup butter, melted",
        "2 cups vanilla ice cream, softened",
        "2 eggs",
        "1/2 teaspoon vanilla extract",
        "1 1/2 cups all-purpose flour",
        "1 cup graham cracker crumbs",
        "2/3 cup white sugar",
        "2 1/2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 cup chopped toasted pecans",
        "1 cup whipped cream (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Praline Ice Cream Cake",
    "url": "http://allrecipes.com/recipe/221203/praline-ice-cream-cake/"
}