{
    "directions": [
        "Lightly butter cookie sheet. Stir chopped hazelnuts, corn syrup and brown sugar in heavy small saucepan over low heat until sugar dissolves. Increase heat and boil mixture until candy thermometer registers 300°F., tilting pan if necessary to submerge end of thermometer, about 10 minutes. Pour praline mixture onto prepared cookie sheet. Let cool. Break praline into 1-inch pieces. Grind finely in food processor. (Praline can be prepared up to 1 week ahead. Wrap tightly in aluminum foil and refrigerate.)",
        "Preheat oven to 350°F. Lightly butter 9-inch-diameter springform pan with 2 3/4-inch-high sides. Finely grind graham crackers, hazelnuts and brown sugar in processor. Add butter and Frangelico and process until crumbs are evenly moistened. Press crumb mixture onto bottom of prepared pan. Bake 10 minutes. Cool on rack. Maintain oven temperature.",
        "Using electric mixer, beat cream cheese with 1/2 cup sugar until light and fluffy. Add yolks 1 at a time, beating after each addition until just blended. Add sour cream, flour, Frangelico and vanilla and beat just until mixture is smooth. Stir in ground praline. Using clean dry beaters, beat egg whites until soft peaks form. Gradually add 1/3 cup sugar and beat until stiff but not dry. Fold egg whites into cream cheese mixture in two additions. Pour filling into prepared crust.",
        "Bake cake until center is just set, about 50 minutes. Turn off oven and leave cake in oven 40 minutes longer.",
        "Transfer cheesecake to rack and cool to room temperature. Cut around pan sides with small sharp knife to loosen cheesecake. Cover and refrigerate overnight. Release pan sides. Beat whipping cream and 2 tablespoons sugar to firm peaks. Transfer to pastry bag fitted with medium star tip. Pipe rosettes of cream decoratively around edge of cake. Arrange 1 hazelnut atop each rosette. Dust top of cheesecake with cocoa powder. (Can be prepared 4 hours ahead; refrigerate.)"
    ],
    "ingredients": [
        "1/2 cup coarsely chopped hazelnuts",
        "1/2 cup light corn syrup",
        "1/2 cup firmly packed brown sugar",
        "6 whole graham crackers, broken into pieces",
        "1/2 cup hazelnuts (about 2 ounces)",
        "2 tablespoons dark brown sugar",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "2 tablespoons Frangelico (hazelnut liqueur)",
        "2 8-ounce packages cream cheese, room temperature",
        "1/2 cup plus 1/3 cup sugar",
        "4 eggs separated",
        "1 cup sour cream",
        "1/2 cup all purpose flour",
        "3 tablespoons Frangelico",
        "1 teaspoon vanilla extract",
        "3/4 cup chilled whipping cream",
        "2 tablespoons sugar",
        "Roasted hazelnuts",
        "Cocoa powder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Milk/Cream",
        "Food Processor",
        "Mixer",
        "Cheese",
        "Dairy",
        "Nut",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Frangelico",
        "Chill",
        "Hazelnut",
        "Canada",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Praline Cheesecake with Hazelnut Crust",
    "url": "http://www.epicurious.com/recipes/food/views/praline-cheesecake-with-hazelnut-crust-2685"
}
