{
    "directions": [
        "Heat 1 tablespoon vegetable oil in a skillet over medium-high heat. Season beef generously with salt and black pepper; place meat in the skillet and cook until brown on all sides, 5 to 10 minutes. Transfer to plate and set aside.",
        "Heat 1 tablespoon vegetable oil over medium-low heat in the pot of a pressure cooker. Stir onion and garlic into pot; cook until almost translucent, 4 to 6 minutes. Stir in ancho chile powder, paprika, cumin, black pepper, chipotle chile powder, cayenne pepper, and oregano; cook until fragrant, 2 minutes. Add diced tomatoes, beef, and water; stir to combine.",
        "Lock the lid of your pressure cooker. Increase heat to high and bring to full pressure. Reduce heat to low to maintain pressure; cook for 15 minutes. Remove from heat and let rest 10 minutes. Ensure that pressure is fully released and remove the lid.",
        "Return uncovered pressure cooker to burner over high heat. Stir in corn chips and bring to a boil; cook for 5 minutes. Garnish with cilantro and green onion."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "2 1/2 pounds beef chuck, cut into 1-inch cubes",
        "salt and ground black pepper to taste",
        "1 tablespoon vegetable oil",
        "1 onion, diced",
        "3 cloves garlic, chopped",
        "2 tablespoons ancho chile powder",
        "2 teaspoons Spanish paprika",
        "1 teaspoon ground cumin",
        "1/2 teaspoon ground black pepper",
        "1/2 teaspoon chipotle chile powder",
        "1/4 teaspoon cayenne pepper",
        "1/2 teaspoon dried oregano",
        "1 (10 ounce) can diced tomatoes with green chile peppers",
        "1 1/4 cups water",
        "1/8 cup ground corn chips (optional)",
        "1/8 cup chopped fresh cilantro",
        "1/8 cup chopped green onions"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pressure Cooker Beef Chili",
    "url": "http://allrecipes.com/recipe/221960/pressure-cooker-beef-chili/"
}
