{
    "directions": [
        "Mix the beef, basil, marjoram, and thyme in a medium bowl until the spices are evenly distributed throughout. Form the mixture into twenty 1- inch meatballs.",
        "Heat the oil in a 6-quart stovetop pressure cooker set over medium heat or in a 6- quart electric pressure cooker turned to the browning function. Add the fennel, onion, and bell pepper; cook, stirring often, until the onion turns translucent, about 5 minutes.",
        "Stir in the pasta, tomatoes, broth, wine, oregano, rosemary, nutmeg, and salt. Submerge the meatballs in the sauce.",
        "Lock the lid onto the pot.",
        "STOVETOP: Raise the heat to high and bring the pot to high pressure (15 psi). Once this pressure has been reached, reduce the heat as much as possible while maintaining this pressure. Cook for 5 minutes.",
        "ELECTRIC: Set the machine to cook at high pressure (9–11 psi). Set the machine’s timer to cook at high pressure for 8 minutes.",
        "Use the quick-release method to bring the pot’s pressure back to normal.",
        "Unlock and open the lid. Stir gently before serving."
    ],
    "ingredients": [
        "1 pound lean ground beef (preferably 93% lean)",
        "1 tablespoon dried basil",
        "1 teaspoon dried marjoram",
        "1/2 teaspoon dried thyme",
        "2 tablespoons olive oil",
        "1 large fennel bulb, trimmed and chopped",
        "1 medium yellow onion, chopped",
        "1 medium red bell pepper, stemmed, cored, and chopped",
        "8 ounces dried radiatori",
        "1 (28-ounce) can diced tomatoes (about 3 1/2 cups)",
        "1 cup chicken broth",
        "1/2 cup dry white wine, such as Chardonnay",
        "1 tablespoon dried oregano",
        "1/2 teaspoon dried rosemary",
        "1/2 teaspoon grated nutmeg",
        "1/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Instant Pot",
        "Pressure Cooker",
        "Meatball",
        "Pasta",
        "Quick & Easy",
        "Tomato",
        "Dinner",
        "Kid-Friendly",
        "Fennel",
        "Bell Pepper"
    ],
    "title": "Pressure-Cooker Mini Meatballs With Radiatori",
    "url": "http://www.epicurious.com/recipes/food/views/pressure-cooker-mini-meatballs-with-radiatori"
}
