{
    "directions": [
        "Heat vegetable oil in pressure cooker over medium heat; cook and stir onions until slightly softened, 5 to 8 minutes. Add red peppers, jalapeno peppers, garlic, black pepper, and salt; cook until garlic is fragrant and onions are softened, about 5 more minutes. Stir tomatoes into onion mixture and cook until warmed, about 1 minute.",
        "Transfer tomato mixture to a blender. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth. Transfer tomato puree back to pressure cooker.",
        "Stir chicken stock into tomato puree; cook and stir over high heat until just boiling, about 5 minutes. Cover and lock pressure cooker. Cook over high heat until steam begins to build and steadily escapes. Lower heat to medium-low; cook for 20 more minutes. Remove from heat; allow all the steam to naturally release. Remove lid.",
        "Bring soup to a boil; stir in cream and cilantro. Remove from heat. Let cool for 5 minutes.",
        "Crush tortilla chips into serving bowls; pour soup over tortilla chips. Top with sour cream and queso quesadilla."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "2 large onions, chopped",
        "1 (12 ounce) jar roasted red peppers, drained and chopped",
        "1 (4 ounce) can roasted jalapeno peppers, diced",
        "1 clove garlic, minced",
        "1 tablespoon ground black pepper",
        "salt to taste",
        "4 cups diced tomatoes",
        "1 (32 fluid ounce) container chicken stock",
        "1 cup heavy whipping cream",
        "1 cup chopped fresh cilantro",
        "1 (14.5 ounce) package tortilla chips",
        "1 cup sour cream (optional)",
        "1 (8 ounce) package shredded queso quesadilla (white Mexican cheese)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pressure Cooker Tortilla Soup",
    "url": "http://allrecipes.com/recipe/228385/pressure-cooker-tortilla-soup/"
}
