{
    "directions": [
        "Rinse and pat dry the short ribs. Season with the salt, pepper, cumin and ancho chile powder. Heat the olive oil over high for the stovetop pressure cooker or use the browning setting for the electric pressure cooker.",
        "Add the short ribs and brown on all sides, about 4 minutes. While the ribs are browning, make the sauce: Add the garlic, cilantro, jalapeño, vegetable broth, sugar and four-peppercorn blend to a food processor and blend for 1 minute, or until the cilantro has liquefied. Cover the ribs with the mixture, using a rubber spatula to scrape the processor. Pour in the beef stock and wine and stir. Cancel cooking for the electric cooker, and close the lid.",
        "Stovetop Pressure Cooker: Set to high pressure (15 PSI) and set the timer for 35 minutes. Cook over high heat for 25 minutes, then reduce the heat to medium and continue to cook for the last 10 minutes.",
        "Electric Pressure Cooker: Set to high pressure (10–12 PSI) and 40 minutes.",
        "When done, remove from the heat or turn off the cooker and allow the pressure to release on its own (natural-release), about 12 minutes.",
        "When all of the pressure is out, adjust for salt and remove the short ribs from the pot. Transfer to a serving platter. Cross-cut across several bones and into three parts or however many bones your ribs have."
    ],
    "ingredients": [
        "3 lb (1.4 kg) bone-in beef short ribs",
        "1 tsp (6 g) kosher salt",
        "Freshly ground black pepper",
        "1/2 tsp ground cumin",
        "1 tbsp (7.5 g) ancho chile powder",
        "2 tbsp (28 ml) basil garlic olive oil (see tip)",
        "3 cloves garlic, chopped",
        "1/2 cup (8 g) chopped fresh cilantro",
        "1 tsp (3 g) seeded and minced jalapeño pepper",
        "1 cup (235 ml) vegetable broth",
        "1/4 cup (60 g) dark brown sugar",
        "1 tbsp (5 g) four-peppercorn blend, crushed",
        "1/2 cup (120 ml) beef stock",
        "1 cup (235 ml) red wine (I recommend a good Chilean variety)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pressure Cooker",
        "Instant Pot",
        "Beef Rib",
        "Beef",
        "Chile Pepper",
        "Cilantro",
        "Red Wine",
        "Jalapeño",
        "Dinner"
    ],
    "title": "Pressure-Cooker Spicy Ancho Chile and Cilantro Short Ribs",
    "url": "http://www.epicurious.com/recipes/food/views/pressure-cooker-spicy-ancho-chile-and-cilantro-short-ribs"
}
