{
    "directions": [
        "1. If you wish to soften the peel, soak the lemons in lukewarm water for 3 days, changing the water daily.",
        "2. Quarter the lemons from the top to within 1/2 inch of the bottom, sprinkle salt on the exposed flesh, then reshape the fruit.",
        "3. Place 1 tablespoon salt on the bottom of the mason jar. Pack in the lemons and push them down, adding more salt, and the optional spices between layers. Press the lemons down to release their juices and to make room for the remaining lemons. (If the juice released from the squashed fruit does not cover them, add freshly squeezed lemon juice — not chemically produced lemon juice and not water.*) Leave some air space before sealing the jar.",
        "4. Let the lemons ripen in a warm place, shaking the jar each day to distribute the salt and juice. Let ripen for 30 days. To use, rinse the lemons, as needed, under running water, removing and discarding the pulp, if desired — and there is no need to refrigerate after opening. Preserved lemons will keep up to a year, and the pickling juice can be used two or three times over the course of a year.",
        "According to the late Michael Field, the best way to extract the maximum amount of juice from a lemon is to boil it in water for 2 or 3 minutes and allow it to cool before squeezing.",
        "•Located on Morocco's Atlantic coast, south of Casablanca and north of Essaouira, the city of Safi is known for its seafood specialties.\n•To most closely approximate the flavor of Moroccan lemons, Wolfert recommends Meyer lemons for this recipe. This lemon/mandarin orange hybrid, in season in January and February, has yellow-orange flesh, a smooth rind, and a sweeter flavor than other lemons.\n•To sterilize a mason jar for the lemons, place it upside down in a steamer and steam for 10 minutes. Using tongs (wrap the ends in rubber bands for a better grip), remove the hot jar and dry it upside down on a paper towel-lined baking sheet in a warm oven. To sterilize the jar's top, boil it in water for 5 minutes, then remove with tongs. For more information on home canning, click here.\n•When you're ready to use a lemon, remove it with clean utensils to avoid contaminating the inside of the jar with bacteria. This way, the remaining contents of the jar will not need to be refrigerated."
    ],
    "ingredients": [
        "5 lemons",
        "1/4 cup salt, more if desired",
        "1 cinnamon stick",
        "3 cloves",
        "5 to 6 coriander seeds",
        "3 to 4 black peppercorns",
        "1 bay leaf",
        "Freshly squeezed lemon juice, if necessary",
        "Shallow bowl",
        "Sterile 1-pint mason jar",
        "Sharp knife"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Condiment",
        "Lemon",
        "Spice"
    ],
    "title": "Preserved Lemons",
    "url": "http://www.epicurious.com/recipes/food/views/preserved-lemons-231570"
}
