{
    "directions": [
        "Mix the coriander, dry mustard, salt, pepper, and garlic powder in a small bowl; rub the mixture over the thighs, coating them evenly and thoroughly.",
        "Pour the beer into a 6-quart stovetop or electric pressure cooker; nestle the thighs into the beer.",
        "Lock the lid onto the pot.",
        "STOVETOP: Set the pot over high heat and bring it to high pressure (15 psi). Once this pressure has been reached, reduce the heat as much as possible while maintaining this pressure. Cook for 30 minutes.",
        "ELECTRIC: Set the machine to cook at high pressure (9–11 psi). Set the machine’s timer to cook at high pressure for 45 minutes.",
        "Use the quick-release method to drop the pot’s pressure to normal.",
        "Unlock and open the cooker. Transfer the thighs to a carving board; cool for a few minutes. Debone the meat and chop it into small bits.",
        "Set the stovetop cooker over medium heat or turn the electric cooker to its browning function; bring the liquid inside to a simmer. Cook until reduced to about half its volume when you opened the pot in the previous step, about 4 minutes.",
        "Stir in the brown sugar, vinegar, mustard, and tomato paste until smooth. Cook for 1 minute, stirring all the while. Add the chopped turkey, stir well, and set aside off the heat or unplugged for a couple of minutes to heat through."
    ],
    "ingredients": [
        "2 teaspoons ground coriander",
        "1 teaspoon dry mustard",
        "1 teaspoon salt",
        "1 teaspoon ground black pepper",
        "1/2 teaspoon garlic powder",
        "2 (1 1/4-to 1 1/2-pound) bone-in turkey thighs, skin removed",
        "1 (12-ounce) bottle dark beer, preferably a porter",
        "2 tablespoons packed dark brown sugar",
        "2 tablespoons apple cider vinegar",
        "1 tablespoon whole-grain mustard",
        "1 tablespoon canned tomato paste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Instant Pot",
        "Pressure Cooker",
        "turkey",
        "Taco",
        "Beer",
        "Coriander",
        "Mustard",
        "Dinner"
    ],
    "title": "Pressure-Cooker Beer-and-Mustard Pulled Turkey",
    "url": "http://www.epicurious.com/recipes/food/views/pressure-cooker-beer-and-mustard-pulled-turkey"
}
