{
    "directions": [
        "In a medium mixing bowl, stir the eggs, using a wire whisk. Whisk in the sweetened condensed milk, followed by the whole milk, 3/4 cup (175 ml) of the brewed espresso, the extracts and the espresso salt. Whisk until all of the ingredients are well-blended, without creating bubbles, about 1 minute. Set aside.",
        "To a round 1-quart (946-ml) aluminum flan mold or pan, add the sugar and the remaining tablespoon (15 ml) of brewed espresso and place on the burner. Turn the heat to high and begin caramelizing the sugar, stirring constantly. Reduce the heat to medium-high as soon as it starts to melt, using a wooden spoon or medium silicone spatula, 2 to 5 minutes, until the sugar is completely melted and a beautiful golden Cognac color.",
        "Turn off and remove the mold immediately from the heat. Working fast, coat the entire mold with the melted sugar, rotating it in a controlled circular motion. If you are not experienced in handling extremely hot caramel, leave the mold on your counter and quickly coat with a pastry brush or a small silicone spatula. It is about 330°F (165°C) at this point. Set aside and let sit until the caramel sets, about 1 minute. Pour the custard mixture into the flan mold or pan, using a medium-mesh hand strainer to collect the egg embryo. This last step here is not entirely necessary.",
        "Add enough water to the cooker to cover the mold halfway. Close the mold or cover your pan with aluminum foil and gently place in the middle of the cooker. Close the lid.",
        "Stovetop Pressure Cooker: Set to high pressure (15 PSI) and set the timer for 16 minutes. Cook over high heat until the pressure point is reached, about 11 minutes, then turn off the heat but do not remove the cooker from the stove. The residual heat will finish cooking it. Allow the pressure to release on its own for the remaining 5 to 6 minutes.",
        "Electric Pressure Cooker: Set to high pressure (10–12 PSI) and 16 minutes. When done, cancel cooking. Allow the pressure to release on its own (natural-release).",
        "When all of the pressure is out, open the cooker and gently remove the mold, using silicone gloves. Do not unmold. Chill the flan for at least 5 hours, giving it enough time to set.",
        "Remove the flan from the fridge 30 minutes prior to serving. To unmold, open the flan mold and loosen the sides, using a butter knife. Place a large plate on top of the mold and gently but quickly flip upside down. Allow all of the liquid caramel to drizzle all over the flan. Garnish with almonds and ground espresso."
    ],
    "ingredients": [
        "4 large eggs, at room temperature",
        "1 (14-oz [425-ml]) can sweetened condensed milk",
        "14 oz (425 ml) whole milk",
        "3/4 cup (175 ml) plus 1 tbsp (180 ml) unsweetened brewed espresso",
        "1 tsp (5 ml) pure vanilla extract",
        "1 tsp (5 ml) almond extract",
        "1/2 tsp espresso salt",
        "1/2 cup (100 g) cane sugar",
        "1/2 cup (73 g) toasted almonds, sliced, for garnish",
        "Ground espresso, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Instant Pot",
        "Pressure Cooker",
        "Custard",
        "Coffee",
        "Almond",
        "Dessert",
        "Butterscotch/Caramel"
    ],
    "title": "Pressure-Cooker Espresso and Toasted Almond Flan",
    "url": "http://www.epicurious.com/recipes/food/views/pressure-cooker-espresso-and-toasted-almond-flan"
}
