{
    "directions": [
        "In a small saucepan, heat the milk, 1/2 cup water, sugar and honey to 105 to 110 degrees F. Add to the bowl of a stand mixer. Sprinkle the yeast over the water mixture and wait for at least 10 to 15 minutes until the yeast blooms.",
        "In a separate saucepan over medium heat, add the butter and garlic and cook until the butter is melted and the garlic is fragrant, 2 to 3 minutes.",
        "Combine the all-purpose flour and bread flour in a mixing bowl.",
        "Add the flour mixture to the bowl with the blooming yeast, and then add in the melted butter and garlic mixture. Mix on medium speed until the dough has come together and is smooth and elastic in texture and pulling away from the sides of the bowl, 5 to 7 minutes.",
        "Line 2 baking sheets with silicone mats. Turn the dough out onto a lightly floured cutting board and form into a ball. Cut into 4 equal pieces, and then cut those in half to form 8 equal pieces. Using your hands, roll each piece into a ball and place onto a prepared baking sheet. Cover with a dish cloth and let them rest in a warm place for 12 to 15 minutes.",
        "Once rested, lightly dust your work surface again and roll the balls into 7-inch logs. Place onto the other prepared baking sheet, cover, place back in the warm spot and let rest for an additional 30 minutes.",
        "Preheat the oven to 425 degrees F. Place one oven rack high and one low. Line 2 more baking sheets with silicone mats or parchment paper.",
        "In a large pot, bring 8 cups water to a boil, and then add the baking soda. In batches, place the dough in the water and cook for 30 seconds on each side.",
        "Using a slotted spatula, remove the logs and place onto the prepared baking sheets. Sprinkle the logs with pretzel salt as they come out of the water, to ensure the salt sticks. Then cut 3 diagonal slits on top of the bread, not too deep.",
        "Bake for 10 to 13 minutes, rotating between the top and bottom racks of the oven halfway through the cooking."
    ],
    "ingredients": [
        "1 cup milk",
        "1/4 cup light brown sugar",
        "2 tablespoons honey",
        "1 packet active dry yeast",
        "2 tablespoons unsalted butter",
        "2 small cloves garlic, grated",
        "3 cups all-purpose flour, plus more for dusting",
        "1 cup bread flour",
        "1/2 cup baking soda",
        "Pretzel salt or coarse ground sea salt, for sprinkling"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Bread"
    ],
    "title": "Pretzel Hot Dog Buns",
    "url": "http://www.foodnetwork.com/recipes/jeff-mauro/pretzel-hot-dog-buns-recipe"
}
