{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease bottom of a 9x13-inch baking pan. Line a baking sheet with parchment paper.",
        "Beat cake mix, water, eggs, and vegetable oil in a large bowl with an electric mixer on low speed until cake mix is moistened, 30 seconds. Increase speed to medium and beat until batter is thoroughly combined, 2 minutes. Pour into prepared baking pan.",
        "Bake cake in the preheated oven until the top is lightly browned and a toothpick inserted into the middle of the cake comes out clean, about 30 minutes. Cool in pan for 10 minutes before removing from pan to finish cooling.",
        "Crumble cake into a large bowl and mix crumbs with vanilla frosting. Pinch off about 2 tablespoons of cake crumb mixture and roll into a ball about 1 inch in diameter. Repeat with remaining cake mixture. Place cake balls onto parchment paper-lined baking sheet and freeze for 15 minutes.",
        "Pour candy sprinkles into a bowl.",
        "Melt 4 blocks of vanilla almond bark in a small saucepan over low heat and stir until coating is melted and smooth. Insert a lollipop stick into a cake ball and slowly and carefully dip the cake ball into the melted coating, spinning the cake ball slightly to get an even, smooth coat. Cover the entire ball and about 1/4 inch of the lollipop stick where it meets the ball. Repeat dipping remaining cake balls, melting additional coating as you work.",
        "Decorate each cake ball with candy sprinkles by dipping or applying as desired; place lollipop handles into styrofoam block and let coating harden. Work quickly; coating will set in a minute or so."
    ],
    "ingredients": [
        "1 (15.25 ounce) package yellow cake mix",
        "1 cup water",
        "3 eggs",
        "1/2 cup vegetable oil",
        "1 (16 ounce) container prepared vanilla frosting",
        "1/4 cup multicolored candy sprinkles, or as needed (optional)",
        "1 (24 ounce) package vanilla almond bark, or as needed",
        "1 package paper lollipop sticks",
        "1 12x12-inch block of styrofoam"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pretty Cake Pops",
    "url": "http://allrecipes.com/recipe/231660/pretty-cake-pops/"
}
