{
    "directions": [
        "In a food processor, process the pretzels into fine crumbs and transfer to a shallow dish.",
        "In a separate shallow dish, whisk together 3 eggs and 1/4 teaspoon salt to create a smooth egg wash.",
        "Line a cookie sheet with parchment. Dip the mozzarella cheese chunks into the egg wash, coating completely, and then into the pretzel crumbs, coating the cheese completely on all sides. Transfer to the prepared cookie sheet. Let the cheese stand for 5 minutes to set the coating, and then repeat the process, adding more eggs to the egg wash if necessary. When all the cheese is coated again, return to the cookie sheet and transfer to the freezer. Freeze the cheese for at least 2 hours and up to overnight. The longer the cubes freeze, the better they will fry.",
        "In a large bowl, blend the mayonnaise with the milk, chili sauce, vinegar, dill, parsley, garlic powder, garlic salt, onion powder, 1 teaspoon salt and 1/2 teaspoon black pepper until smooth, about 2 minutes. Refrigerate the dip until ready to serve.",
        "Heat the oil in a Dutch oven on the stovetop or in an electric fryer to 350 degrees F. Remove the cheese from the freezer. Fry a few pieces at a time until crispy brown, and place them onto a paper towel-lined cookie sheet to drain. Serve immediately with the spicy ranch dip."
    ],
    "ingredients": [
        "One 12-ounce bag pretzels rods, broken in half",
        "3 to 5 large eggs",
        "Kosher salt and black pepper",
        "1 pound whole milk mozzarella, cut into 1-by-2-inch chunks",
        "1 cup mayonnaise",
        "1/4 cup milk",
        "4 teaspoons hot chili sauce, such as sriracha",
        "1 1/2 teaspoons apple cider vinegar",
        "1 teaspoon chopped fresh dill",
        "1 tablespoon chopped fresh parsley",
        "1/2 teaspoon garlic powder",
        "1/2 teaspoon garlic salt",
        "1/2 teaspoon onion powder",
        "Vegetable oil, for frying"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Cheese",
        "Appetizer",
        "Snack"
    ],
    "title": "Pretzel-Crusted Fried Cheese with Spicy Ranch",
    "url": "http://www.foodnetwork.com/recipes/trisha-yearwood/pretzel-crusted-fried-cheese-with-spicy-ranch"
}
