{
    "directions": [
        "In a small sauté pan, heat 1 tablespoon oil over medium-high heat. Cook the onion and pancetta until the onion is softened, about 5 minutes. Add the peas and a few tablespoons of water, and cook until the peas are tender, about 5 minutes. Season with salt and pepper; set aside in a bowl.",
        "In the same pan, heat 2 more tablespoons oil over high heat. Cook the mushrooms and garlic for a minute or two, until tender. Season with salt and pepper; set aside.",
        "Preheat the oven to 350°F (175°C). Butter an 8- to 9-inch (20- to 23-cm) nonstick springform pan and dust it with breadcrumbs.",
        "In another small pot, make béchamel: Melt 4 tablespoons of the butter over medium heat, stir in the flour, and cook, stirring constantly with a wooden spoon, until smooth. Add the milk and bring it to a boil, stirring until thick, about 2 minutes. Season with salt and pepper. Set aside.",
        "Boil the pasta in salted water for 3 minutes less than the package directs. Drain and toss with the stock.",
        "Layer the bottom of the prepared baking pan with one third of the pasta. Dot with one third of the béchamel, sprinkle it with 2 to 3 heaping tablespoons Parmesan, scatter on all of the pea mixture, then scatter on one third of the diced cheese. Spread out a second level layer of pasta, dot with one third of the béchamel, sprinkle with 2 to 3 heaping tablespoons Parmesan, and scatter on all the mushrooms, ham, and remaining diced cheese. Top with the remaining pasta and any unabsorbed remaining stock, pressing down to compact the layers. Dot the top with the remaining béchamel, Parmesan, breadcrumbs, and remaining butter, very thinly sliced.",
        "Bake for about 25 minutes, until the pie is set and golden. Let it rest until it comes to room temperature before slicing."
    ],
    "ingredients": [
        "olive oil",
        "1 small onion, minced",
        "2 ounces pancetta or prosciutto, minced",
        "8 ounces baby peas",
        "salt",
        "12 ounces fresh mushrooms, any type, thinly sliced",
        "1 garlic clove, minced",
        "1/4 cup homemade breadcrumbs, toasted",
        "7 tablespoons butter",
        "1/4 cup all-purpose or \"0\" flour",
        "2 cups milk, warmed",
        "1 pound tagliolini, or other fresh thin egg noodles",
        "1/2 cup chicken or beef stock",
        "1/2 cup grated Parmesan cheese",
        "12 ounces burrata or mozzarella cheese, diced",
        "8 ounces thinly sliced ham, cut into strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Easter",
        "Mozzarella",
        "Prosciutto"
    ],
    "title": "Pretty Easter Pasta Pie (Crostata di tagliolini )",
    "url": "http://www.epicurious.com/recipes/food/views/pretty-easter-pasta-pie-crostata-di-tagliolini-51234010"
}
