{
    "directions": [
        "Set a wire rack over a rimmed baking sheet and set aside. Fill a medium saucepan with 1/4 inch of water; add cauliflower and garlic and cover the pot. Bring to a boil over high heat and cook until florets are easily pierced with a paring knife, about 8 minutes. Drain and reserve.",
        "Meanwhile, in a large, deep skillet, heat 1/2 inch of oil over medium-high heat until it registers 350°F on a deep-fat thermometer, or until a pinch of flour sizzles when sprinkled into the oil.",
        "While oil is heating, add pretzels to the bowl of a food processor and pulse until some crumbs are ground fine but some are still coarse pea-sized pieces. Spread pretzel crumbs on a large plate or another rimmed baking sheet. Wipe out bowl of food processor and reserve for cauliflower pureé.",
        "Place flour on another large plate or rimmed baking sheet and use a whisk to gently blend in 1 teaspoon salt and 1/2 teaspoon pepper. In a shallow bowl, beat eggs, mustard, 1/2 teaspoon salt, and 1/2 teaspoon pepper until blended. Working with one cutlet at a time, coat with flour on both sides, then dip in egg (allowing excess to drip off), then dredge in pretzel crumbs, pressing them to adhere.",
        "Working in batches if necessary, fry cutlets until golden brown and fully cooked, 2 to 3 minutes per side. Transfer cutlets to wire rack to drain, and season them with salt.",
        "Once cauliflower and garlic are cooked and drained, add them to the bowl of the food processor along with the butter, milk, 1 teaspoon salt, and 1/2 teaspoon pepper. Purée until smooth, adding more milk if necessary. Season to taste.",
        "To serve, divide arugula among four plates. Season with salt and pepper, a squeeze of lemon, and a drizzle of olive oil. Divide cauliflower purée among the plates, and top with chicken cutlets."
    ],
    "ingredients": [
        "Vegetable oil, for frying (about 3 cups)",
        "3 cups lightly crushed salted pretzel rods (about 6 ounces)",
        "3/4 cup all-purpose flour",
        "2 1/2 teaspoons kosher salt, plus more for seasoning",
        "1 1/2 teaspoon freshly ground pepper, plus more for seasoning",
        "2 large eggs",
        "1/4 cup plus 2 tablespoons Dijon mustard",
        "4 (6-ounce) chicken cutlets, 1/4-inch thick, pounded if necessary (1 1/2 pounds total)",
        "1 1/2 pounds cauliflower, chopped (1 small head cauliflower)",
        "3 garlic cloves, peeled",
        "2 tablespoons unsalted butter",
        "1/4 cup whole milk, or more to taste",
        "4 cups arugula or baby spinach",
        "1 lemon, halved",
        "Extra-virgin olive oil, for serving"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Leafy Green",
        "Quick & Easy",
        "Dinner",
        "Cauliflower",
        "22-Minute Meals",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pretzel-Crusted Chicken Cutlets With Cauliflower Purée and Arugula",
    "url": "http://www.epicurious.com/recipes/food/views/pretzel-crusted-chicken-cutlets-with-cauliflower-puree-and-arugula-51261210"
}
