{
    "directions": [
        "Simmer balsamic vinegar in small saucepan over medium heat until reduced to 2/3 cup, about 10 minutes. Transfer to small pitcher. DO AHEAD: Balsamic reduction can be made 3 days ahead. Cover and let stand at room temperature.",
        "Using vegetable peeler, remove peel from oranges (orange part only) in long strips. Slice peel lengthwise into very thin strips. Place peel in heavy small saucepan and add enough cold water to cover peel by 1 inch. Bring to boil; strain. Repeat 2 more times. Return peel to same saucepan. Add 3/4 cup water and sugar. Boil until almost all liquid is absorbed, stirring occasionally, about 10 minutes. Drain. DO AHEAD: Candied orange peel can be made 2 days ahead. Place in small bowl, cover, and refrigerate.",
        "Mix cream, mustard, and 2 tablespoons candied orange peel in heavy small saucepan. Bring to boil; reduce heat to medium and cook until sauce is reduced to 1 cups, about 12 minutes. Season to taste with salt and pepper. DO AHEAD: Can be made 8 hours ahead. Cover and chill.",
        "Place flour in shallow bowl. Whisk eggs to blend in another shallow bowl. Spread crushed pretzels on rimmed baking sheet. Sprinkle pork chops on both sides with salt and pepper. Working with 1 pork chop at a time, press 1 side of chop into flour, dip floured side only into eggs, then press into pretzels, coating 1 side only. Transfer to baking sheet, coated side up. Repeat with remaining pork chops, flour, eggs, and pretzels. DO AHEAD: Can be made 2 hours ahead. Cover and refrigerate.",
        "Preheat oven to 450°F. Melt 3 tablespoons butter in each of 2 large ovenproof skillets over medium-high heat. Add 4 pork chops to each skillet, coated side down, and cook until brown, about 2 minutes. Turn chops over and transfer both skillets to oven. Roast until pork is cooked through and thermometer inserted horizontally into chop registers 140°F, about 10 minutes. Let chops stand 5 minutes.",
        "Rewarm sauce. Spoon 2 tablespoons sauce onto each plate and place chop atop sauce. Drizzle with balsamic reduction and garnish with remaining candied orange peel."
    ],
    "ingredients": [
        "1 1/2 cups balsamic vinegar",
        "2 oranges",
        "3/4 cup water",
        "1/4 cup sugar",
        "2 cups whipping cream",
        "1/4 cup Dijon mustard",
        "1/2 cup all purpose flour",
        "3 large eggs",
        "2 cups crushed pretzel sticks (about 5 ounces)",
        "8 1-inch-thick center-cut pork rib chops",
        "6 tablespoons (3/4 stick) butter, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Dairy",
        "Egg",
        "Mustard",
        "Pork",
        "Dinner",
        "Vinegar",
        "Orange",
        "Fall",
        "Oktoberfest",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pretzel-Crusted Pork Chops with Orange-Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pretzel-crusted-pork-chops-with-orange-mustard-sauce-235847"
}
