{
    "directions": [
        "Sprinkle the yeast and sugar over 2 cups of warm water in a small bowl. The water should be no more than 100 degrees F (40 degrees C). Let stand for 20 minutes until the yeast softens and begins to form a creamy foam.",
        "Combine the yeast mixture with the warm milk, oil, and salt in a large mixing bowl; stir well to combine. Stir in half of the flour mixture until no dry spots remain. Stir in the remaining flour, 1 cup at a time, mixing well after each addition. The dough should be moderately stiff and slightly sticky. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.",
        "Spray a large bowl with cooking spray, then place the dough in the bowl and turn to coat. Cover with plastic wrap or a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 45 minutes.",
        "After the dough has risen, fill a large pot with about 8 cups water, 1 1/2 teaspoons salt, and the baking soda and bring to a rolling boil over high heat. While the water is coming to a boil cut the the dough into 20 pieces, about the size of a golf ball. Roll each piece into a 12 inch long rope about 1 1/2 inches thick.",
        "Preheat an oven to 375 degrees F (190 degrees C). Lightly grease 2 baking sheets.",
        "Dip a strip of dough into the boiling water using a pair of tongs, count to 5, remove it from the water, and place it on a paper towel for a few seconds. Wrap the strip around a hot dog, place on a baking sheet, and sprinkle with coarse salt. Repeat with the remaining strips of dough and hot dogs.",
        "Bake in a preheated oven until they are golden brown, about 15 to 20 minutes."
    ],
    "ingredients": [
        "2 (.25 ounce) packages active dry yeast",
        "2 1/2 teaspoons white sugar",
        "2 cups warm water",
        "2 cups warm milk",
        "1/2 cup vegetable oil",
        "1 1/2 teaspoons salt",
        "10 cups all-purpose flour",
        "2 teaspoons baking soda",
        "2 (16 ounce) packages hot dogs",
        "1/4 cup coarse kosher salt, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pretzel Dogs",
    "url": "http://allrecipes.com/recipe/217282/pretzel-dogs/"
}
