{
    "directions": [
        "Melt 1 tablespoon butter in medium skillet over medium-high heat. Add mushrooms; sauté until tender, about 5 minutes. Season mushrooms with salt and pepper. Set aside.",
        "Melt 3 tablespoons butter in large pot over medium heat. Add onion; sauté until beginning to soften, 5 minutes. Add garlic; stir 1 minute. Add rice and stir until translucent at edges, 5 minutes. Add wine. Stir until liquid is absorbed, 1 minute. Add 1 cup broth. Simmer until broth is absorbed, stirring often, 3 to 4 minutes. Add carrots, asparagus, and 1 cup broth. Simmer until liquid is absorbed, stirring often, 5 to 6 minutes. Continue to add remaining broth, then water, 1 cup at a time, until rice is just tender and mixture is creamy, stirring often and letting almost all liquid be absorbed after each addition, about 25 minutes total.",
        "Stir 1 cup cheese, peas, parsley, and mushrooms into risotto. Season to taste with salt and pepper.",
        "Heat 1 tablespoon oil in large skillet over medium-high heat. Cook eggs, without turning, until whites are cooked through and yolks are cooked to desired doneness.",
        "Mound 1 cup risotto on each of 4 plates. Using back of spoon, make hollow in top of each mound. Top each with egg; drizzle with oil. Serve, passing additional cheese. Tamra Davis is the author of the cookbook Make Me Something Good to Eat. Visit her on the Web at tamradaviscookingshow.com."
    ],
    "ingredients": [
        "4 tablespoons (1/2 stick) butter, divided",
        "2 cups chopped button mushrooms (about 5 ounces)",
        "3/4 cup chopped onion",
        "3 garlic cloves, minced",
        "2 cups arborio rice",
        "1/2 cup dry white wine",
        "3 cups vegetable broth, divided",
        "3/4 cup 1/3-inch cubes carrots",
        "2 cups diced trimmed asparagus (about 9 ounces)",
        "3 cups (or more) water",
        "1 cup freshly grated Parmesan cheese plus additional for serving",
        "1/2 cup shelled fresh peas or thawed frozen peas",
        "1/4 cup chopped fresh Italian parsley",
        "1 tablespoon olive oil plus additional for drizzling",
        "4 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Mushroom",
        "Easter",
        "Vegetarian",
        "High Fiber",
        "Dinner",
        "Parmesan",
        "Asparagus",
        "Pea",
        "Spring",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Primavera Risotto Nests with Fried Eggs",
    "url": "http://www.epicurious.com/recipes/food/views/primavera-risotto-nests-with-fried-eggs-357390"
}
