{
    "directions": [
        "Place the roast bone-side down in a roasting pan, and use a sharp paring knife to poke 24 small holes 1 inch deep all over the roast. Stuff each hole with a sliver of garlic. Sprinkle with 3/4 teaspoon salt, and LOTS of black pepper. Allow the roast to stand at room temperature for 2 hours. This will take the chill off and allow the meat to cook more evenly.",
        "Meanwhile, beat together the eggs and milk with a pinch of salt until smooth. Stir in flour until smooth. Cover the Yorkshire pudding batter, and place in the refrigerator.",
        "Preheat oven to 450 degrees F (230 degrees C).",
        "Cook the roast in the preheated oven for 30 minutes, then lower the heat to 350 degrees F (175 degrees C), and continue roasting until a meat thermometer inserted in the center of the meat reaches 140 degrees F (60 degrees C), about 1 hour.",
        "When the roast is done, remove it from the roasting pan, cover with aluminum foil, and let rest in a warm spot while you make the Yorkshire pudding. Measure out 1/2 cup of the beef fat, and divide among 12 muffin tins; pour off the remaining fat, but save the roasting pan to make the jus.",
        "Place the grease-filled muffin tins into the oven, and turn the temperature up to 425 degrees F (220 degrees C). Let the muffin tins preheat for 10 minutes, then fill 3/4 full with the refrigerated batter, and return to the oven. Bake 20 to 25 minutes until the puddings have risen tall and are golden brown.",
        "While the Yorkshire puddings are baking, place the roasting pan on the stove over medium-high heat. Stir in the wine, and bring to a simmer while scraping to dissolve the pan drippings; pour in the beef stock and return to a simmer. Cook 10 minutes, then strain and serve with the roast and puddings."
    ],
    "ingredients": [
        "1 (5 pound) bone-in beef rib roast",
        "8 cloves garlic, quartered",
        "3/4 teaspoon salt",
        "1 teaspoon freshly ground black pepper",
        "2 cups eggs",
        "2 cups milk",
        "1 pinch salt",
        "2 cups all-purpose flour",
        "1/2 cup pan drippings from prime rib",
        "1/2 cup white wine",
        "2 cups beef stock"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Prime Rib Au Jus with Yorkshire Pudding",
    "url": "http://allrecipes.com/recipe/160399/prime-rib-au-jus-with-yorkshire-puddi/"
}
