{
    "directions": [
        "In a small bowl, stir together the salt, five-pepper blend, onion powder, garlic powder, paprika and thyme. Set aside.",
        "Pat the rib roast dry with paper towels. Rub the roast all over with the olive oil and then with the seasoning mixture. Wrap in plastic wrap and refrigerate for 12 to 24 hours.",
        "To make the horseradish cream, in bowl, whisk together the heavy cream and sour cream until smooth. Add the horseradish, lemon juice, salt and pepper and whisk until blended. Cover and refrigerate until ready to serve.",
        "Remove the plastic wrap from the roast and let stand at room temperature for 1 hour.",
        "Position a rack in the lower third of an oven and preheat to 450°F (230°C).",
        "Place the roast, fat side up, on a rack in a large roasting pan. Transfer to the oven and roast for 20 minutes. Reduce the oven temperature to 350°F (180°C) and continue roasting until an instant-read thermometer inserted into the center of the meat, away from the bone, registers 125° to 130°F (52° to 54°C) for very rare to medium-rare, 1 to 1 1/2 hours more.",
        "Transfer the roast to a carving board, cover loosely with aluminum foil and let rest for 15 minutes before carving. Carve the roast and arrange on a warmed platter. Pass the horseradish cream at the table. Serves 6 to 10.",
        "Williams-Sonoma Test Kitchen"
    ],
    "ingredients": [
        "3 Tbs. kosher salt",
        "3 Tbs. freshly ground five-pepper blend",
        "1 1/2 Tbs. toasted onion powder",
        "1 1/2 Tbs. roasted garlic powder",
        "1 Tbs. Hungarian paprika",
        "1 Tbs. dried whole thyme leaves",
        "3-rib standing beef rib roast, about 5 lb. (2.5 kg), tied with kitchen string",
        "2 Tbs. olive oil",
        "3/4 cup (6 fl. oz./180 ml) heavy cream",
        "1 cup (8 fl. oz./250 ml) sour cream",
        "1/2 cup (3 oz./90 g) freshly grated or prepared horseradish",
        "Juice of 1 lemon",
        "Kosher salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Herb-Crusted Prime Rib with Horseradish Cream",
    "url": "http://www.williams-sonoma.com/recipe/prime-rib-with-horseradish-cream.html"
}
