{
    "directions": [
        "Move the oven rack to the bottom and preheat the oven to 500 degrees F, then start with the seasoning: Grab the peppercorns and throw them in a big plastic bag and pound them with a rolling pin to break them open. Pull the leaves off the rosemary and thyme sprigs. Throw the crushed peppercorns into a bowl with the salt and herb leaves and add the minced garlic. Use your fingers to toss it all together, then set it aside.",
        "Place the beef, fat-side up, on a rack in a roasting pan. Drizzle the olive oil all over the surface and rub it in with your hands. Sprinkle the peppercorn-herb-salt mixture all over the surface of the beef, pressing it lightly with your hands.",
        "Roast the beef 45 minutes for the first stage. Reduce the oven temperature to 300 degrees F and insert a meat thermometer sideways into the roast. Roast the beef an additional 1 hour 15 minutes to 1 hour 30 minutes, or until the thermometer registers 120 degrees F to 135 degrees F in the center for medium rare. (The meat will continue to cook for a bit after you remove it from the oven.)",
        "Remove the beef from the rack and let it rest about 15 minutes to allow the juices to redistribute throughout the meat. When you're ready to serve, carve it into slices of your preferred width.",
        "Make the batter before removing the prime rib from the oven: Combine the eggs and half-and-half in a bowl and whisk until they're totally combined. Throw the flour and 2 teaspoons salt into a sifter and sift them straight into the bowl. Whisk until it's nice and smooth, then refrigerate until the prime rib is ready.",
        "After the beef is removed from the pan, increase the oven temperature to 450 degrees F. Use a slotted spoon to remove the peppercorns, herbs and excess salt from the drippings. Pour the remaining drippings into a separate container. They should be speckled and lovely!",
        "Pour a small amount (about 1/2 teaspoon or so) of the drippings into each cup of a standard muffin pan and place the pan in the hot oven for a couple of minutes, or until just before the drippings begin to smoke.",
        "Carefully remove the pan from the oven and immediately fill the muffin cups about 1/2 to 2/3 full. Bake 13 to 14 minutes, or until they've \"popped\" about as much as they can pop. Serve them in a basket with a pretty napkin right next to the prime rib.",
        "Photograph by Con Poulos"
    ],
    "ingredients": [
        "4 tablespoons tricolor peppercorns (or any peppercorns)",
        "3 sprigs rosemary",
        "3 sprigs thyme",
        "1/3 cup kosher salt",
        "8 cloves garlic, minced",
        "1 10-to-14-pound boneless rib-eye roast",
        "1/4 cup olive oil",
        "Yorkshire Pudding, for serving, recipe follows",
        "5 large eggs",
        "1 cup half-and-half",
        "1 cup all-purpose flour",
        "Kosher salt",
        "Drippings from the prime rib"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Prime Rib",
        "Beef",
        "Meat",
        "Main Dish Recipes",
        "Holiday"
    ],
    "title": "Prime Rib",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/prime-rib"
}
