{
    "directions": [
        "Liberally season the prime rib with the salt and some pepper and refrigerate overnight.",
        "An hour before cooking, remove the roast from the refrigerator to allow it to come to room temperature.",
        "Meanwhile, preheat the oven to 400 degrees F.",
        "Put the reserved ribs in a roasting pan bowed-side up (the ribs will be acting as the roasting rack). Scatter any fat and meat trimmings in the pan around the bones. Roast the bones and trimmings for about 30 minutes, or until the fat starts to render.",
        "Remove the pan from the oven, put the rosemary sprigs on top of the bones, then top with the prime rib. Put the smashed garlic in the bottom of the pan with the trimmings. Baste the beef with the fat drippings and return the pan to the oven.",
        "Cook for 30 minutes and then baste the roast again.",
        "Reduce the heat to 350 degrees F and cook until the meat is medium rare (an internal temperature of 125 degrees F to 130 degrees F), about 1 hour, 15 minutes, basting the roast every 30 minutes until it is done. Keep in mind that the roast will continue to cook while resting.",
        "Remove the roast from the oven and put it on a cutting board to rest, uncovered, for 20 minutes. Slice the prime rib to the desired thickness and garnish with the arugula and olive oil.",
        "Photograph by Yunhee Kim"
    ],
    "ingredients": [
        "1 4-bone prime rib, bones and excess fat removed and reserved",
        "4 teaspoons kosher salt",
        "Freshly ground black pepper",
        "4 sprigs fresh rosemary",
        "4 cloves garlic, unpeeled, smashed",
        "4 ounces arugula (optional)",
        "2 teaspoons extra-virgin olive oil (optional)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Roast Recipes",
        "Prime Rib",
        "Meat",
        "Main Dish Recipes"
    ],
    "title": "Prime Rib",
    "url": "http://www.foodnetwork.com/recipes/michael-symon/prime-rib-recipe"
}
