{
    "directions": [
        "Preheat an oven to 400 degrees F (200 degrees C).",
        "To make the chocolate crust, combine the flour, hot cocoa mix, and 1/4 teaspoon salt in a mixing bowl. Cut in the shortening with a knife or pastry blender until the mixture resembles coarse crumbs. Add the milk, vanilla, and food coloring and toss with a fork until the flour mixture is moistened. Roll the crust out between two sheets of waxed paper and transfer it to a 9-inch pie pan. Trim or crimp the edges. Prick the bottom and sides of the crust with a fork and sprinkle with chopped pecans.",
        "Bake the crust in the preheated oven until the crust is set and the edges have darkened slightly, 10 to 12 minutes. Cool on a rack. Meanwhile, sprinkle the gelatin over the cold water and set aside.",
        "To make the filling, mix the cornstarch, 1/2 teaspoon salt, and 1 cup sugar together in a saucepan. Gradually whisk in the boiling water. Heat the mixture over high heat until the mixture boils. Reduce the heat and simmer until the filling is thick and clear, 8 to 10 minutes. Gradually whisk a portion of the hot filling into the beaten egg yolks. Return the yolk mixture to the saucepan and cook for 1 minute more, stirring constantly.",
        "Stir in the rehydrated gelatin mixture and mix until dissolved. Blend in the butter, lemon zest, and lemon juice; remove from heat.",
        "Beat egg whites until foamy in a large glass or metal mixing bowl. Gradually add the 3 tablespoons sugar, continuing to beat until medium-stiff peaks form. Lift your beater or whisk straight up: the tip of the peak formed by the egg whites should curl over slightly.",
        "Use a rubber spatula or wire whisk to fold 1/3 of the beaten egg whites (meringue) into the hot filling mixture. Gently run the spatula through the center of the bowl, then around the sides of the bowl, repeating until fully incorporated. Add the remaining meringue, folding just until incorporated. Allow the mixture to cool for 25 minutes; the filling should mound from a spoon when dropped back into the bowl.",
        "Whip the cream until stiff. Fold the whipped cream into the filling and gently spread the filling in the cooled baked pie shell. Sprinkle the pie with the chocolate shavings and refrigerate until serving."
    ],
    "ingredients": [
        "Chocolate Crust:",
        "1 cup all-purpose flour",
        "1/4 cup hot cocoa mix",
        "1/4 teaspoon salt",
        "1/3 cup shortening, chilled",
        "3 tablespoons milk",
        "1/2 teaspoon vanilla extract",
        "1 drop red food coloring (optional)",
        "1/4 cup finely chopped pecans",
        "Lemon Filling:",
        "3 tablespoons cornstarch",
        "1/2 teaspoon salt",
        "1 cup white sugar",
        "3/4 cup boiling water",
        "3 egg yolks, beaten",
        "1 tablespoon unflavored gelatin",
        "1/4 cup cold water",
        "2 tablespoons butter, room temperature",
        "2 tablespoons lemon zest",
        "6 tablespoons fresh lemon juice",
        "3 egg whites",
        "3 tablespoons white sugar",
        "1 cup heavy cream, chilled",
        "1/4 cup shaved sweet chocolate"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Prize Winning Lemon Fluff Pie",
    "url": "http://allrecipes.com/recipe/213751/prize-winning-lemon-fluff-pie/"
}
