{
    "directions": [
        "Bring cream, half-and-half, and lavender just to a boil in a heavy saucepan. Pour through a fine sieve into a measuring cup. Whisk together yolks, honey, and Benedictine in a bowl, then add hot cream mixture in a slow stream, whisking. Pour custard into pan and cook over moderately low heat, stirring constantly, until slightly thickened and a thermometer registers 175°F (do not let boil).",
        "Pour custard through a fine sieve into a clean bowl and cool. Chill, covered, until cold, at least 2 hours.",
        "Freeze custard in an ice-cream maker. Transfer to an airtight container and put in freezer to harden.",
        "Preheat oven to 400°F.",
        "Bring butter, water, sugar, and salt to a boil in a 3-quart heavy saucepan over high heat, stirring, until butter is melted. Reduce heat to moderate and add flour all at once, stirring. Cook, beating with a wooden spoon, until mixture pulls away from side of pan, forming a ball, about 1 minute. Transfer to a bowl and add eggs, 1 at a time, beating well with wooden spoon after each addition.",
        "Transfer mixture to pastry bag and pipe 20 mounds (about 1 1/4 inches in diameter) about 1 inch apart on a parchment-lined large baking sheet. Bake profiteroles in upper third of oven 10 minutes.",
        "Reduce temperature to 300°F and continue to bake until outside of puffs are crisp and golden, about 15 minutes. Transfer profiteroles on baking sheet to a rack to cool. Increase oven temperature to 400°F and make another batch in same manner.",
        "Halve each profiterole horizontally with a serrated knife and sandwich a small scoop (about 1 1/2 teaspoons) ice cream between halves (or pipe it with pastry bag). Sprinkle with confectioners sugar and drizzle with chocolate sauce or honey."
    ],
    "ingredients": [
        "1 1/2 cups heavy cream",
        "1/2 cup half-and-half",
        "1 tablespoon dried lavender leaves (pesticide-free)",
        "5 large egg yolks",
        "5 tablespoons honey",
        "1 tablespoon Benedictine liqueur",
        "3/4 stick unsalted butter, cut into pieces",
        "1 cup water",
        "1 tablespoon sugar",
        "1/8 teaspoon salt",
        "3/4 cup all-purpose flour",
        "4 large eggs",
        "Special equipment: parchment paper and large pastry bag fitted with a plain 1/2-inch tip",
        "confectioners sugar",
        "chocolate sauce or warm honey"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Frozen Dessert",
        "Summer",
        "Winter",
        "Honey",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Profiteroles with Honey Lavender Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/profiteroles-with-honey-lavender-ice-cream-103082"
}
