{
    "directions": [
        "Line six 2/3-cup ramekins with plastic wrap, leaving overhang. Line each ramekin with 2 slices prosciutto, overlapping in center and patching any holes with extra prosciutto. Stir goat cheese, cream cheese and 1/4 cup green onions in bowl until well blended. Season generously with pepper. Spoon into prepared ramekins, dividing equally. Fold prosciutto over to enclose. Fold plastic over to cover; press to compact. Chill overnight.",
        "Cook beans in medium pot of boiling salted water until just crisp-tender, about 4 minutes. Drain; rinse with cold water and drain well. Pat dry. (Can be prepared 1 day ahead. Cover and chill.)",
        "Invert ramekins to release timbales. Peel off plastic. Heat 1 tablespoon oil in large skillet over medium heat. Add timbales, bottom side down. Cover; cook until cheese is just soft when top of timbale is pressed, about 5 minutes. Transfer to plate; let stand 1 hour to set up.",
        "Meanwhile, combine vinegar and shallots in small bowl. Slowly whisk in 1/2 cup oil. Season with salt and pepper.",
        "Combine greens, beans, 1/4 cup green onions and 2/3 cup dressing in large bowl; toss to coat. Divide salad among 6 plates. Top each with timbale. Drizzle some of remaining dressing over each."
    ],
    "ingredients": [
        "12 to 16 thin slices prosciutto",
        "10 ounces soft fresh goat cheese (such as Montrachet), room temperature",
        "2 ounces cream cheese, room temperature",
        "1/2 cup chopped green onions",
        "8 ounces haricots verts or slender green beans, trimmed, cut crosswise in half",
        "1 tablespoon plus 1/2 cup olive oil",
        "1/4 cup Champagne vinegar or white wine vinegar",
        "3 tablespoons chopped shallots",
        "12 cups mixed baby greens"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Salad",
        "Leafy Green",
        "Brunch",
        "Easter",
        "Lunch",
        "Goat Cheese",
        "Green Bean",
        "Spring",
        "Summer",
        "Prosciutto",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Prosciutto and Goat Cheese Timbales with Mixed Greens",
    "url": "http://www.epicurious.com/recipes/food/views/prosciutto-and-goat-cheese-timbales-with-mixed-greens-402"
}
