{
    "directions": [
        "At least 45 minutes before baking pizza, put a pizza stone or 4 to 6 unglazed \"quarry\" tiles arranged close together on oven rack in lowest position in oven and preheat oven to highest setting (500°-550°F).",
        "Trim any tough stems from arugula and thinly slice cheese. On a lightly floured surface pat out dough evenly with your fingers, keeping hands flat and lifting and turning dough over several times, into a 9-inch round. (Do not handle dough more than necessary. If dough is sticky, dust it lightly with flour.)",
        "Dust a baker's peel or rimless baking sheet with flour and carefully transfer dough to it. Jerk peel or baking sheet once or twice and, if dough is sticking, lift dough and sprinkle flour underneath it, reshaping dough if necessary. Working quickly, top dough with sauce, spreading with back of a spoon to within 1/2 inch of edge. Arrange mozzarella slices evenly over sauce.",
        "Line up far edge of peel or baking sheet with far edge of stone or tiles and tilt peel or baking sheet, jerking it gently to start pizza moving. Once edge of pizza touches stone or tiles, carefully pull back peel or baking sheet, completely transferring pizza to stone or tiles (do not move pizza). Bake pizza 6 to 7 minutes, or until dough is crisp and browned, and transfer with a metal spatula to a cutting board. Scatter arugula over pizza and arrange prosciutto slices on top.",
        "Cut pizza into wedges and serve immediately."
    ],
    "ingredients": [
        "1/2 cup small to medium arugula leaves",
        "2 ounces mozzarella (preferably fresh)",
        "all-purpose flour for dusting",
        "Pizza Dough for one 9-inch pizza",
        "1/2 cup Pizza Sauce",
        "3 very thin slices prosciutto"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Appetizer",
        "Bake",
        "Mozzarella",
        "Arugula",
        "Prosciutto",
        "Gourmet"
    ],
    "title": "Prosciutto and Arugula Pizza",
    "url": "http://www.epicurious.com/recipes/food/views/prosciutto-and-arugula-pizza-14648"
}
