{
    "directions": [
        "Halve chicken breasts horizontally, keeping 1 long side attached; open halves like a book. Pound breasts until 1/4\" thick. Season on all sides with salt and pepper.",
        "Place 1 chicken breast on a work surface, cut side up. Overlap 2 slices prosciutto on top of chicken, leaving a 1/2\" border. Top prosciutto with 2 slices provolone; layer 8 basil leaves over cheese, maintaining 1/2\" border. Roll up chicken lengthwise and tie with kitchen twine. Repeat with remaining chicken breasts.",
        "Preheat oven to 450°F. Heat 1 tablespoon butter and oil in a large heavy ovenproof skillet. Add roulades and cook until browned on all sides, 8-10 minutes. Transfer skillet to oven and bake until an instant-read thermometer inserted into center of roulades registers 165°F, 7-8 minutes. (The chicken will be cooked through but still juicy.) Transfer chicken to plates and let rest for 10 minutes.",
        "Scrape drippings and any melted cheese from skillet; discard. Set skillet over medium-high heat and melt 1 tablespoon butter. Add mushrooms. Cook, turning once, until mushrooms are golden brown, about 5 minutes. Season with salt and pepper; add broth and vinegar. Simmer until liquid is thickened and reduced, 10-12 minutes. Stir in remaining 1 tablespoon butter and herbs; season with salt and pepper.",
        "Cut off and discard twine. Cut chicken into 1/2\" slices. Drizzle mushroom sauce over."
    ],
    "ingredients": [
        "4 skinless, boneless chicken breasts (about 2 pounds)",
        "Kosher salt, freshly ground pepper",
        "8 thin slices prosciutto",
        "8 thin slices provolone cheese",
        "32 fresh basil leaves",
        "3 tablespoons unsalted butter, divided",
        "1 tablespoon vegetable oil",
        "4 cups mixed mushrooms (such as crimini, chanterelle, and maitake), torn or chopped into small pieces",
        "2 cups low-sodium chicken broth",
        "1 teaspoon red wine vinegar",
        "2 tablespoons mixed chopped fresh herbs (such as basil, parsley, and chives)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Mushroom",
        "Quick & Easy",
        "Dinner",
        "Prosciutto"
    ],
    "title": "Prosciutto-Stuffed Chicken with Mushroom Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/prosciutto-stuffed-chicken-with-mushroom-sauce-51122430"
}
