{
    "directions": [
        "Preheat the oven to 400 degrees F (200 degrees C).",
        "Brush the inside of an oven-proof skillet with vegetable oil. Set aside.",
        "Mix cherries, bread crumbs, egg yolk, Parmigiano-Reggiano cheese, olive oil, thyme, oregano, garlic, salt, black pepper, and cayenne pepper until combined.",
        "Cut a 1-inch slit in each chicken breast by slicing at an angle from the thick end of the breast toward the thinner end.",
        "Open flap and place one butterflied chicken breast between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. Repeat with the other breast.",
        "Place half the stuffing on each chicken breast, place each breast on a piece of plastic wrap and roll into a tight roll, twisting the ends of the plastic wrap to hold create a tight package.",
        "On a piece of plastic wrap, slightly overlap 2 slices of prosciutto so they are as wide as the rolled chicken breast. Unwrap rolled chicken breast and place the breast at one end of the prosciutto. Roll prosciutto around the stuffed breast using the plastic to make a tight roll. Repeat with the second stuffed breast and remaining 2 slices of prosciutto.",
        "Lay 4 pieces of string on the cutting board, about 1-inch apart. Place chicken roll across the strings, and tie each into a knot to keep the chicken from unrolling. Repeat for the second stuffed breast.",
        "Place stuffed, rolled chicken breasts in the prepared skillet and bake in the preheated oven until the prosciutto is browned and crispy and chicken is no longer pink, about 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken to a plate and loosely cover with aluminum foil.",
        "Drain grease from the pan as desired, leaving juice and browned bits. Pour in chicken stock and balsamic vinegar, and bring to a boil over high heat. Cook, while scraping the browned bits from the bottom of the pan, until liquid has reduced by half, 5 to 6 minutes. Remove from heat, add butter and stir until melted. Season with salt and black pepper to taste.",
        "Remove twine from chicken breasts; slice into bite-sized pieces. Serve drizzled with pan sauce."
    ],
    "ingredients": [
        "1 tablespoon vegetable oil",
        "1/3 cup dried cherries, chopped",
        "1/4 cup plain bread crumbs",
        "1 egg yolk",
        "1 1/2 tablespoons finely grated Parmigiano-Reggiano cheese",
        "2 teaspoons olive oil",
        "1 teaspoon fresh thyme",
        "1 teaspoon fresh oregano, minced",
        "2 cloves garlic, minced",
        "salt and pepper to taste",
        "1 pinch cayenne pepper",
        "2 (6 ounce) skinless, boneless chicken breast halves",
        "4 thin slices prosciutto",
        "3/4 cup chicken broth",
        "1 1/2 tablespoons balsamic vinegar",
        "1 tablespoon butter",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Prosciutto-Wrapped Cherry-Stuffed Chicken Breasts",
    "url": "http://allrecipes.com/recipe/221054/prosciutto-wrapped-cherry-stuffed-chi/"
}
