{
    "directions": [
        "Arrange tenderloins side by side on work surface with thick end of one next to thin end of other. Slightly overlap prosciutto strips crosswise down length of pork (prosciutto will hang over pork on both sides). Mix breadcrumbs, 1 teaspoon rosemary, and 1 teaspoon thyme in small bowl. Add 1 tablespoon oil; toss to blend. Sprinkle crumb mixture atop prosciutto on 1 pork tenderloin. Fold prosciutto over to cover stuffing and roll second tenderloin over prosciutto and stuffing on first. Using kitchen string, tie tenderloins and stuffing together in 4 or 5 places to make cylinder-shaped roast. Mix salt, pepper, 1 teaspoon rosemary, and 1 teaspoon thyme in small bowl. Rub herb mixture over outside of roast. Let stand 30 minutes.",
        "Preheat oven to 350°F. Heat remaining 1 tablespoon oil in heavy large ovenproof skillet over medium-high heat. Add roast and sauté until brown, turning with tongs, about 7 minutes. Place skillet with roast in oven. Roast pork until thermometer inserted into thickest part of pork registers 145°F, about 35 minutes. Transfer roast to platter; tent loosely with foil to keep warm (temperature will rise 5 to 10 degrees as pork stands).",
        "Place same skillet over medium heat. Add mushrooms and garlic; sauté until mushrooms begin to brown, about 6 minutes. Add wine and broth. Boil until sauce thickens enough to coat spoon, scraping up browned bits, about 12 minutes. Season with salt and pepper.",
        "Cut roast crosswise into 1/2-inch-thick slices; serve with mushroom sauce."
    ],
    "ingredients": [
        "2 1-pound pork tenderloins",
        "8 thin slices prosciutto (each about 8x2 inches)",
        "1/2 cup fresh breadcrumbs made from crustless French bread",
        "2 teaspoons chopped fresh rosemary",
        "2 teaspoons chopped fresh thyme",
        "2 tablespoons olive oil",
        "1 teaspoon salt",
        "1 teaspoon freshly ground black pepper",
        "3/4 pound mushrooms, sliced",
        "1 garlic clove, minced",
        "1 cup dry white wine",
        "1 cup low-salt chicken broth"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pork",
        "Roast",
        "Rosemary",
        "Pork Tenderloin",
        "Winter",
        "Prosciutto",
        "Thyme"
    ],
    "title": "Prosciutto-Stuffed Pork Tenderloin with Mushroom Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/prosciutto-stuffed-pork-tenderloin-with-mushroom-sauce-107649"
}
