{
    "directions": [
        "Preheat broiler, with the tray set at the lowest position. Broil the bread on one side until toasted, 1 to 2 minutes. Remove and divide the cheese and prosciutto evenly on the untoasted sides. Return to broiler and cook, open-faced, until the prosciutto is crispy and the cheese has begun to melt, about 1 minute. Turn off broiler, leaving the sandwiches inside to stay warm. In a frying pan, melt 1 tablespoon of the butter, then fry the eggs to the desired doneness. Remove the sandwiches and top each with an egg. Add the remaining butter to the pan and sauté the anchovies and garlic over medium-high heat, stirring constantly, until the garlic begins to soften. Add the spinach and cook until it wilts, then add the lemon juice, salt, and pepper. Spoon over the sandwiches and serve.",
        "Omit the anchovies, garlic, spinach, and lemon juice. Top with another slice of toast before serving. And if the prosciutto and Parmesan are too sharp, replace them with honey-baked ham and white cheddar."
    ],
    "ingredients": [
        "2 slices Tuscan, ciabatta, or other crusty bread",
        "4 to 6 thin slices Parmesan",
        "2 thin slices prosciutto",
        "2 tablespoons unsalted butter",
        "2 eggs (preferably organic)",
        "4 salted anchovy fillets, finely chopped",
        "1 garlic clove, peeled and thinly sliced",
        "1 handful fresh baby spinach",
        "1 squeeze fresh lemon juice",
        "Salt and freshly ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Egg",
        "Fish",
        "Pork",
        "Breakfast",
        "Brunch",
        "Broil",
        "Fry",
        "Sauté",
        "Kid-Friendly",
        "Parmesan",
        "Prosciutto",
        "Cookie",
        "Sugar Conscious",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Prosciutto, Fried Egg, and Parmesan on Country Bread",
    "url": "http://www.epicurious.com/recipes/food/views/prosciutto-fried-egg-and-parmesan-on-country-bread-239166"
}
