{
    "directions": [
        "Preheat a pizza stone or clean baking sheet in an oven to 475 degrees F.",
        "Add the cauliflower to a food processor and pulse until finely ground and the consistency of couscous; you should have about 4 cups.",
        "Transfer the cauliflower to a large bowl. Add the Asiago, egg, Italian seasoning, garlic, 1/2 teaspoon salt and a few turns of black pepper and combine until the mixture holds together when pinched. Pour onto a clean kitchen towel and wring out as much moisture as you can.",
        "Line a pizza peel, flat cutting board or cookie sheet with parchment and brush with some oil. Spread the cauliflower mixture into a 12-inch circle. Slide the parchment onto the preheated pizza stone and bake until barely golden and darker at the edges, about 15 minutes.",
        "Remove the crust from the oven, sprinkle with the mozzarella and spread the marinara over the top (this keeps the crust from becoming soggy and the cheese from sliding). Scatter the prosciutto across the top and sprinkle with a good pinch of crushed red pepper. Slide back onto the pizza stone and bake until bubbly with browned spots, about 4 minutes.",
        "Sprinkle with the basil just before serving."
    ],
    "ingredients": [
        "1 small head cauliflower, chopped (about 5 cups)",
        "2 ounces shredded Asiago (1 cup)",
        "1 large egg",
        "1/2 teaspoon dried Italian seasoning or oregano",
        "1 clove garlic, minced",
        "Kosher salt and freshly ground black pepper",
        "Olive oil, for brushing",
        "1 1/2 cups shredded mozzarella (6 ounces)",
        "1/2 cup marinara sauce",
        "4 slices prosciutto (1 ounce), sliced into ribbons",
        "Crushed red pepper flakes, for sprinkling",
        "1/4 cup fresh basil leaves, torn"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pizza Recipes",
        "Cheese",
        "Meat",
        "Cauliflower",
        "Vegetable"
    ],
    "title": "Prosciutto Pizza with Cauliflower Crust",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/prosciutto-pizza-with-cauliflower-crust"
}
