{
    "directions": [
        "Bring 1 cup water, Port, figs, and rosemary to boil in small saucepan. Reduce heat to medium-low; simmer until mixture is reduced to generous 1 1/4 cups, stirring occasionally, about 20 minutes. Cool slightly. Puree in processor until smooth. do ahead Fig jam can be made 3 days ahead. Cover and chill.",
        "Preheat oven to 400°F. Place onion rounds on rimmed baking sheet. Dot with butter. Sprinkle with salt and pepper. Roast until tender and golden, about 45 minutes. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Spread about 1 1/2 tablespoons fig jam on bottom of each ciabatta roll. Top with onions, prosciutto, and cheese. Place roll top on each. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature.",
        "Cook panini in panini press according to manufacturer's instructions. Alternatively, heat heavy large skillet over medium heat. Working in batches, place panini in skillet. Place large cast-iron or other heavy skillet atop panini. Fill skillet with bricks or large cans to weigh down. Cook until bottoms of rolls are golden, about 4 minutes. Remove top skillet and turn panini over, then place skillet atop panini. Cook until golden and cheese melts, about 4 minutes longer. Cut in half and serve."
    ],
    "ingredients": [
        "1 cup water",
        "1 cup Port",
        "1 cup (lightly packed) dried black Mission figs (about 7 ounces), stemmed, halved",
        "1 tablespoon dried rosemary",
        "2 medium red onions, cut crosswise into 1/4-inch-thick rounds",
        "2 tablespoons chilled butter, diced",
        "8 ciabatta rolls, halved horizontally",
        "8 thin slices prosciutto (3 to 4 ounces)",
        "7 ounces shaved Asiago cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Sandwich",
        "Cheese",
        "Onion",
        "Roast",
        "High Fiber",
        "Oscars",
        "Lunch",
        "Dried Fruit",
        "Fig",
        "Port",
        "Poker/Game Night",
        "Prosciutto",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Prosciutto and Fig Panini",
    "url": "http://www.epicurious.com/recipes/food/views/prosciutto-and-fig-panini-350417"
}
