{
    "directions": [
        "Preheat oven to 170 degrees (or put your oven on it's lowest setting and adjust the cooking time).",
        "Place the nuts in a bowl and cover with COOL water and soak for 1 hour.",
        "Cover the dates with HOT water and soak for 30 minutes. After soaking, drain off the water and pit the dates.",
        "Place the oats in a food processor and grind to a powder. Place in a separate large bowl.",
        "Drain the water off the nuts, place on a towel to remove excess water. Place the nuts in a food processor with the dried cranberries (chocolate chips) and pulse until nuts are in small pieces (the nuts will be uneven pieces which is fine. Just make sure they are all chopped.",
        "Place the nuts in the bowl with the oats.",
        "Place the dates, vanilla and honey (agave) in food processor and pulse until it makes a puree. Place the date mixture with the oat mixture and thoroughly combine all the ingredients (mixture will be thick and sticky).",
        "Place the date nut mixture on a silpat on a cookie sheet. Spread out using a spatula or even your hands.",
        "Shape into a long rectangle about 1/2 inch thick and measuring about 10X13 inches. Make sure the rectangle is flat and even.*",
        "Bake for 4.5-5 hours or until the log is firm, but not hard (If the lowest setting on your oven is 200 degrees, cook for 4 hours).",
        "Cool, cut into bars and wrap individually.",
        "Note: If using a dehydrator, heat at 135 degrees and dehydrate for 6-8 hours"
    ],
    "ingredients": [
        "1 cup cashews, raw and unsalted",
        "1 cup almonds, raw and unsalted",
        "1/2 cup dried cranberries or chocolate chips",
        "2 1/4 cup dates (about 20)",
        "3/4 cup rolled oats",
        "1 tablespoon vanilla",
        "1 tablespoon honey or agave"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Breakfast",
        "Dessert",
        "Kid-Friendly",
        "High Fiber",
        "Low/No Sugar",
        "Wheat/Gluten-Free",
        "Date",
        "Almond",
        "Cashew",
        "Healthy",
        "Low Cholesterol",
        "Vegan",
        "Weelicious",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Protein Bars",
    "url": "http://www.epicurious.com/recipes/food/views/protein-bars-51262650"
}
