{
    "directions": [
        "Char peppers over gas flame or in broiler until blackened on all sides. Place in bag and let stand 10 minutes. Peel and seed peppers. Cut into 1/2-inch pieces.",
        "Preheat broiler. Brush both sides of eggplant with oil. Season with salt and pepper. Broil until cooked through and golden, about 3 minutes per side. Drain on paper towels. Brush both sides of zucchini with oil. Season with salt and pepper. Broil until cooked through, about 3 minutes per side. Drain on paper towels.",
        "Puree cheese in processor until smooth. With machine running, add 3 tablespoons oil through feed tube. Add bell peppers; process using on/off turns until peppers are coarsely chopped and cheese mixture begins to color. Add thyme. Season with salt and pepper.",
        "Line 9x5-inch glass loaf pan with plastic, leaving 4-inch overhang. Place single layer of zucchini in bottom of pan, covering completely and trimming to fit. Spread 1/3 of cheese mixture over. Top with 1/3 of chopped arugula and 1/3 of olives. Cover with single layer of eggplant, trimming to fit. Spread 1/3 of cheese over, top with 1/3 of chopped arugula and 1/3 of olives. Repeat with remaining zucchini, cheese, chopped arugula and olives. Finish with layer of eggplant. Fold plastic over to cover; press down gently on eggplant. Cover; chill until firm, at least 6 hours. (Can be made 2 days ahead. Keep chilled. Let stand at room temperature 30 minutes before serving.)",
        "Line platter with arugula leaves. Open plastic wrap on top of terrine. Unmold terrine onto platter, lift off pan and peel off plastic. Serve with bread."
    ],
    "ingredients": [
        "2 red bell peppers",
        "1 large eggplant, cut lengthwise into 3/8-inch-thick slices",
        "Olive oil",
        "2 large zucchini, cut lengthwise into 1/4-inch-thick slices",
        "1 11-ounce package soft mild goat cheese (such as Montrachet), room temperature",
        "3 tablespoons olive oil",
        "2 tablespoons chopped fresh thyme",
        "1 large bunch fresh arugula, chopped",
        "1/2 cup chopped pitted brine-cured olives (such as Niçoise or Kalamata)",
        "Fresh arugula leaves",
        "French bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Appetizer",
        "Broil",
        "Vegetarian",
        "Cream Cheese",
        "Eggplant",
        "Zucchini",
        "Chill",
        "Thyme",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Provencal Vegetable and Goat Cheese Terrine",
    "url": "http://www.epicurious.com/recipes/food/views/provencal-vegetable-and-goat-cheese-terrine-1778"
}
