{
    "directions": [
        "Position rack in center of oven and preheat to 400°F. Generously butter one 10-cup soufflé dish or six 1 1/4-cup soufflé dishes; sprinkle with minced thyme to coat. (If using 1 1/4-cup dishes, place all 6 on rimmed baking sheet.) Heat olive oil in heavy large saucepan over medium heat. Add flour and minced garlic. Cook without browning until mixture begins to bubble, whisking constantly, about 1 minute. Gradually whisk in whole milk, then white wine. Cook until smooth, thick and beginning to boil, whisking constantly, about 2 minutes. Remove from heat. Mix egg yolks and salt in small bowl. Add egg yolk mixture all at once to sauce; whisk quickly to blend. Mix in 1 tablespoon basil, 1 tablespoon thyme and 1 teaspoon rosemary. Fold in cold goat cheese and Gruyère cheese (cheeses do not need to melt).",
        "Using electric mixer, beat whites in large bowl until stiff but not dry. Fold 1/4 of whites into lukewarm soufflé base to lighten. Fold in remaining whites. Transfer soufflé mixture to prepared dish. Sprinkle with ground black pepper.",
        "Place soufflé in oven; reduce heat to 375°F. Bake soufflé until puffed, golden and gently set in center, about 35 minutes for large soufflé (or 25 minutes for small soufflé). Using oven mitts, transfer soufflé to platter and serve immediately."
    ],
    "ingredients": [
        "Minced fresh thyme",
        "1/4 cup extra-virgin olive oil",
        "5 tablespoons all purpose flour",
        "1 large garlic clove, minced",
        "1 1/4 cups whole milk",
        "1/4 cup dry white wine",
        "6 large egg yolks",
        "1 teaspoon salt",
        "1 tablespoon minced fresh basil",
        "1 tablespoon minced fresh thyme",
        "1 teaspoon minced fresh rosemary",
        "1 cup crumbled chilled soft fresh goat cheese (such as Montrachet)",
        "1/2 cup (packed) grated Gruyère cheese (about 2 ounces)",
        "8 large egg whites"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mixer",
        "Cheese",
        "Egg",
        "Herb",
        "Bake",
        "Vegetarian",
        "Goat Cheese",
        "Basil",
        "Swiss Cheese",
        "Thyme"
    ],
    "title": "Provencal Goat Cheese and Herb Soufflé",
    "url": "http://www.epicurious.com/recipes/food/views/provencal-goat-cheese-and-herb-souffle-103224"
}
