{
    "directions": [
        "Preheat oven to 450°F. and lightly brush 2 shallow baking pans with oil.",
        "Separate garlic head into cloves, discarding loose papery outer skin but keeping skin intact on cloves, and wrap in foil, crimping seams to seal tightly. Cut tomatoes into 1/2-inch-thick slices and arrange in one layer in baking pans. Sprinkle 2 teaspoons each of rosemary and thyme evenly over tomatoes and season with salt and pepper.",
        "Put foil-wrapped garlic in one of baking pans with tomatoes and roast garlic and tomatoes in upper and lower thirds of oven, switching position of pans halfway through roasting, about 35 minutes total, or until garlic is tender and tomatoes are slightly charred. Unwrap garlic and cool slightly. Peel skins from each clove and force pulp with warm tomatoes and herbs through a food mill fitted with small disk into a bowl.",
        "Finely chop remaining teaspoon rosemary and remaining teaspoon thyme and stir into sauce with orange juice. Season sauce with salt and pepper and reheat if necessary. Sauce keeps, covered and chilled, 4 days or, frozen, 4 months. Reheat sauce over low heat and reseason with orange juice, salt, and pepper."
    ],
    "ingredients": [
        "olive oil for brushing pans",
        "1 head garlic",
        "4 pounds vine-ripened red tomatoes (about 10 medium)",
        "1 tablespoon fresh rosemary leaves",
        "1 tablespoon fresh thyme leaves",
        "3 tablespoons fresh orange juice, or to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Fruit Juice",
        "Garlic",
        "Tomato",
        "Roast",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Orange",
        "Rosemary",
        "Summer",
        "Healthy",
        "Vegan",
        "Thyme",
        "Gourmet"
    ],
    "title": "Provencal Oven-Roasted Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/provencal-oven-roasted-tomato-sauce-15235"
}
