{
    "directions": [
        "Preheat oven to 400°F with rack in middle.",
        "Mince and mash garlic to a paste with 1/2 teaspoon salt and 1/2 teaspoon pepper. Stir together with herbs and 1 tablespoon oil.",
        "Put tomatoes cut sides up in an oiled small baking dish and drizzle with a third of garlic mixture. Roast until tender, 30 to 40 minutes.",
        "Meanwhile, pat lamb dry and season with 1/4 teaspoon salt and 1/4 teaspoon pepper.",
        "Heat 1 tablespoon oil in a 10-inch ovenproof skillet over medium-high heat until it shimmers. Brown lamb on all sides, 4 to 6 minutes total. Transfer lamb to a cutting board and discard oil from skillet.",
        "Heat remaining tablespoon oil in skillet over medium heat and cook shallots and potatoes, stirring occasionally, until edges are browned, 3 to 5 minutes. Stir in water and half of remaining garlic mixture and remove from heat.",
        "Rub remaining garlic mixture on fat side of lamb racks. Arrange lamb over potatoes and roast in oven until an instant-read thermometer inserted into center of meat (do not touch bone) registers 130°F for medium-rare, 20 to 25 minutes.",
        "Let stand, loosely covered, 5 to 10 minutes. Serve with tomatoes."
    ],
    "ingredients": [
        "2 garlic cloves",
        "2 teaspoons chopped thyme",
        "1 teaspoon chopped rosemary",
        "3 tablespoons olive oil, divided",
        "2 medium tomatoes, halved",
        "1 (1-pound) frenched rack of lamb (4 to 8 chops, depending on size), cut in half",
        "2 medium shallots, thinly sliced (1/3 cup)",
        "2 medium boiling potatoes, peeled and sliced crosswise 1/4 inch thick",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Potato",
        "Tomato",
        "Quick & Easy",
        "Dinner",
        "Rack of Lamb",
        "Spice",
        "Fall",
        "Pan-Fry",
        "Gourmet",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Provençal Rack of Lamb",
    "url": "http://www.epicurious.com/recipes/food/views/provencal-rack-of-lamb-350228"
}
