{
    "directions": [
        "Lightly spray four 6-ounce (2/3-cup) soufflé molds or ramekins with vegetable-oil cooking spray.",
        "In a small bowl stir together prunes, hot tea, lemon juice, and zest and let stand, covered, 15 minutes. Remove 3 prunes from mixture and coarsely chop. In a food processor purée remaining prune mixture (including soaking liquid) until very smooth. Cool purée and stir in chopped prunes. Purée may be made 2 days ahead and chilled, covered. Bring purée to room temperature before proceeding.",
        "Preheat oven to 350° F.",
        "In a large bowl with an electric mixer beat whites with a pinch salt until foamy. Beat in cream of tartar and beat whites until they just hold soft peaks. Gradually beat in granulated sugar and beat meringue until it just holds stiff peaks. Whisk about one fourth meringue into purée to lighten and fold in remaining meringue gently but thoroughly. Spoon mixture into molds or ramekins and arrange on a baking sheet. Bake soufflés in middle of oven until puffed and golden brown, about 16 minutes.",
        "Dust soufflés with confectioners' sugar and serve immediately. At table, with 2 forks pull open top of each soufflé and spoon 1 tablespoon frozen yogurt into each opening."
    ],
    "ingredients": [
        "vegetable-oil cooking spray",
        "5 1/2 ounces pitted prunes (as soft as possible; about 3/4 cup)",
        "1/2 cup hot, freshly brewed Earl Grey tea",
        "1 teaspoon fresh lemon juice",
        "1/4 teaspoon finely grated fresh orange zest",
        "2 large egg whites",
        "1/4 teaspoon cream of tartar",
        "2 tablespoons granulated sugar",
        "confectioners' sugar for dusting",
        "1/4 cup vanilla frozen yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tea",
        "Mixer",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Yogurt",
        "Orange",
        "Prune",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Prune Souffles",
    "url": "http://www.epicurious.com/recipes/food/views/prune-souffles-14984"
}
