{
    "directions": [
        "Preheat oven to 350°F and generously butter an 11-cup Kugelhopf pan (see note, above) or 11-cup bundt pan.",
        "Halve prunes and in a small saucepan simmer with Armagnac and 3/4 cup water, uncovered, 5 minutes. With a slotted spoon transfer prunes to a shallow dish to cool. Boil Armagnac mixture until reduced to about 1/2 cup and add to prunes.",
        "Halve kumquats lengthwise and thinly slice crosswise. In a small saucepan bring remaining 1/2 cup water with 1/4 cup granulated sugar to a simmer, stirring until sugar is dissolved. Add kumquats and simmer 10 minutes. In a fine sieve drain kumquats and add to prunes.",
        "Into a bowl sift together flour, baking soda, ginger, allspice, and salt. Resift mixture into another bowl.",
        "In a large bowl with an electric mixer beat together butter, remaining 1 1/4 cups granulated sugar, and brown sugar until light and fluffy. Add eggs 1 at a time, beating well after each addition, and beat in vanilla. Add flour mixture and prune mixture alternately in batches, beginning and ending with flour mixture and beating until just combined.",
        "Spoon batter into pan (pan will be almost full) and bake in middle of oven 1 hour and 10 minutes, or until a tester comes out clean. Cool cake in pan on a rack 10 minutes and turn out onto rack to cool completely. Cake keeps, wrapped in plastic wrap, at room temperature 1 week.",
        "Garnish cake with kumquats and serve with warm toffee sauce and ice cream."
    ],
    "ingredients": [
        "1 3/4 cups packed pitted prunes (about 14 ounces)",
        "1/2 cup Armagnac",
        "1 1/4 cups water",
        "6 kumquats",
        "1 1/2 cups granulated sugar",
        "3 cups all-purpose flour",
        "1 1/4 teaspoons baking soda",
        "1 teaspoon ground ginger",
        "1/2 teaspoon ground allspice",
        "3/4 teaspoon salt",
        "2 sticks (1 cup) unsalted butter, softened",
        "1 1/4 cups packed light brown sugar",
        "4 large eggs",
        "1 teaspoon vanilla",
        "Garnish: kumquats (preferably with leaves)",
        "Armagnac toffee sauce",
        "Armagnac ice cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Fruit",
        "Ginger",
        "Dessert",
        "Bake",
        "Christmas",
        "Vegetarian",
        "Prune",
        "Cognac/Armagnac",
        "Winter",
        "Kumquat",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Prune Kumquat Sticky Pudding with Armagnac Toffee Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/prune-kumquat-sticky-pudding-with-armagnac-toffee-sauce-15828"
}
