{
    "directions": [
        "To Make Filling:  Boil prunes until plump.  Put raisins in pan, cover with water and heat until water steams.  Strain and add 1/2 cup of sugar to raisins, mix well and heat again until almost dry. Remove from heat and set aside.  Pit the cooked prunes, if not already pitted, chop and add to raisins.  Add chopped nuts, if desired.  Set fruit mix aside overnight.",
        "The next day make the dough.  In large bowl, mix together the flour, baking soda, sugar and salt.  Make a well in the center.  Add the eggs, milk, grated lemon rind and oil and mix to form dough.  Knead the dough to the consistency for rolling.",
        "Divide the dough into 6 parts.  Roll each part into a rectangle of 1/8 inch thickness.  Put 1/6 of the fruit mix onto the dough rectangle and spread evenly.",
        "Fold the dough lengthwise into the center.  Fold the other side in slightly past center, and press seam lightly.  Pinch ends to close.  Lift the loaf with a spatula and place on lightly greased cookie sheet with seam under.",
        "Bake in 400 degree F (205 degrees C) oven for 18 - 20 minutes (top should be lightly brown).  Allow to cool then cut crosswise slices about 1 inch thick.",
        "To Make Glaze:  Use juice of 1 lemon and enough confectioners' sugar to obtain consistency for brushing top of cookie. Drop sprinkles onto glaze and allow glaze to set.   Enjoy!"
    ],
    "ingredients": [
        "2 1/4 cups pitted prunes",
        "3 cups raisins",
        "1/2 cup white sugar",
        "6 cups all-purpose flour",
        "3 teaspoons baking soda",
        "1 cup white sugar",
        "1 teaspoon salt",
        "1 tablespoon lemon zest",
        "3 eggs",
        "1 cup milk",
        "1 cup vegetable oil",
        "1 lemon",
        "1/3 cup confectioners' sugar for decoration"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Prune and Raisin Filled Cookies",
    "url": "http://allrecipes.com/recipe/10760/prune-and-raisin-filled-cookies/"
}
