{
    "directions": [
        "Bring chicken, water, 2 onion quarters, and 1 teaspoon salt to a boil, covered, in a 4- to 5-quart pot over moderately high heat. Boil 10 minutes, then remove from heat and let stand, covered, until chicken is just cooked through, about 10 minutes. Transfer chicken to a plate, reserving broth with onion. When cool enough to handle, coarsely shred chicken, discarding skin and bones.",
        "While chicken is cooking, heat a dry well-seasoned small cast-iron skillet over moderate heat until hot, then brown garlic and remaining 2 onion quarters on all sides, turning with tongs, about 5 minutes. Peel garlic and transfer with onion to a blender. Add tomatoes with juice, chiles, and oregano, then purée until smooth.",
        "Cook chorizo in oil in a 12-inch heavy skillet over moderately high heat, stirring, until fat is rendered, about 2 minutes. Carefully add purée (it will splatter and steam) and cook, stirring frequently, until thick, about 10 minutes.",
        "Peel potatoes and cut into 3/4-inch pieces, then add to reserved broth with remaining teaspoon salt. Simmer, covered, stirring occasionally, until potatoes are almost tender, about 10 minutes.",
        "Add potatoes and onions to chorizo mixture along with 2 cups broth (save remainder for another use). Stir in chicken and simmer 10 minutes. Serve sprinkled with cheese.",
        "*Available at Latino markets and some specialty foods shops."
    ],
    "ingredients": [
        "2 lb chicken thighs (with skin and bone)",
        "6 cups water",
        "1 large white onion, quartered",
        "2 teaspoons salt",
        "2 garlic cloves (not peeled)",
        "1 (14-oz) can whole tomatoes in juice",
        "4 teaspoons chopped canned chipotle chiles in adobo*",
        "1 teaspoon dried oregano (preferably Mexican)",
        "1 (1 1/2-oz) link dried Spanish chorizo* (spicy cured pork sausage), finely chopped",
        "1 tablespoon vegetable oil",
        "1 lb boiling potatoes",
        "2 oz crumbled queso fresco*, ricotta salata, or farmer cheese (1/2 cup)",
        "Accompaniments: avocado slices; warm corn tortillas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Potato",
        "Poultry",
        "Sauté",
        "Stew",
        "Cinco de Mayo",
        "Winter",
        "Simmer",
        "Gourmet"
    ],
    "title": "Puebla Chicken and Potato Stew",
    "url": "http://www.epicurious.com/recipes/food/views/puebla-chicken-and-potato-stew-109026"
}
