{
    "directions": [
        "Preheat oven to 375°F.",
        "Squeeze enough juice from limes to measure 1 cup. Mince garlic. In a bowl stir together 3 tablespoons lime juice, garlic, 2 1/2 tablespoons salt, oregano, and cumin. Pat pork dry and with a sharp small knife make 1-inch-long by 3/4-inch-deep incisions 2 inches apart in pork skin. Push about 1 teaspoon garlic mixture into each incision and rub remainder on meaty ends not covered by skin.",
        "Transfer pork to a large roasting pan (about 18 by 12 by 2 inches) and pour remaining lime juice around pork. Roast pork, uncovered, in middle of oven until most of juice is evaporated and brown bits begin to form on bottom of pan, about 30 minutes.",
        "In a bowl stir together water and vinegar and pour mixture around pork. Cover pan tightly with foil and roast 1 hour. With a small ladle baste meat only (not skin) with pan juices and roast pork, covered, 1 hour.",
        "With cleaned sharp small knife gently loosen skin from meat (without cutting through skin) and with a spoon baste meat under skin with pan juices. Sprinkle remaining 1/2 tablespoon salt over skin and roast pork, uncovered, basting meat (not skin) every 20 minutes, 1 1/2 hours more, or until skin is crisp. Transfer pork to a cutting board, reserving pan juices, and let stand 20 minutes. Skim fat from reserved pan juices.",
        "Cut pork into 1/4-inch-thick slices and serve with pan juices."
    ],
    "ingredients": [
        "6 limes",
        "8 garlic cloves",
        "3 tablespoons salt",
        "1 tablespoon dried oregano",
        "1 tablespoon ground cumin",
        "an 8-pound bone-in fresh pork picnic shoulder with skin",
        "3 cups water",
        "6 tablespoons vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pork",
        "Roast",
        "Buffet",
        "Vinegar",
        "Lime",
        "Fall",
        "Gourmet"
    ],
    "title": "Puerco Asado",
    "url": "http://www.epicurious.com/recipes/food/views/puerco-asado-15768"
}
