{
    "directions": [
        "In a bowl combine 2 cups of the flour, 4 tablespoons of the butter, cut into bits, and the salt and blend the mixture until it resembles meal. Stir in 1/3 cup ice water and, if necessary, continue to add water, 1 tablespoon at a time, until the mixture forms a soft dough. Gather the dough into a ball, form it into a 5-inch square, and dust it lightly with flour. Chill the dough, wrapped in wax paper, for 30 minutes, or until it is firm but not hard.",
        "In a bowl combine the remaining 2 1/4 sticks butter, cut into bits, with the remaining 1/4 cup flour and toss the mixture to coat the butter with the flour. Knead the butter and the flour together and form the mixture into a rough square. Put the square between sheets of wax paper and with a rolling pin press it into a 5-inch square. Remove the paper, dust the square well with flour, and wrap it in another sheet of wax paper. Chill the butter mixture until it is firm but not hard. (The dough and the butter should be of equal firmness.)",
        "Roll the dough into an 8-inch square on a floured surface. Lay the butter diagonally in the center of the square and roll the 4 visible corners of the dough into 6-inch strips. (The dough will form an X around the butter.) Fold each strip of dough over the butter to enclose the butter completely and turn the dough over, sprinkling the work surface and the dough with flour. With the rolling pin flatten the dough with uniform impressions and roll it into a 12-by 6-inch rectangle. Turn the dough over, brush off any excess flour, and fold the top third of the rectangle over the center and the bottom third over the top, forming a rectangle about 6 by 4 inches.",
        "Turn the folded dough seam side down so that an open end faces you. With the rolling pin flatten the dough with uniform impressions. Roll the dough from the center away from you to within 1/2 inch of the end. Flatten the ends gently with uniform impressions but do not roll the pin over the ends or the air and butter will be expelled. Reverse the strip on the surface, flouring the surface as necessary, and again roll the dough from the center away from you to make a rectangle about 12 inches long. Turn the dough seam side up, brush any excess flour from it, and fold the rectangle in thirds as before. This completes 2 \"turns.\" Chill the dough, wrapped in wax paper, for 30 minutes, or until it is firm but not hard. Make 4 more turns, always starting with the seam side down and an open end facing you. Chill the dough, wrapped in plastic, for at least 3 hours and up to 3 days. The dough may be frozen."
    ],
    "ingredients": [
        "2 1/4 cups all-purpose flour",
        "2 3/4 sticks (1 cup plus 6 tablespoons) cold unsalted butter",
        "1 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Chill",
        "Gourmet"
    ],
    "title": "Puff Pastry",
    "url": "http://www.epicurious.com/recipes/food/views/puff-pastry-10444"
}
