{
    "directions": [
        "Puree 2 mangoes and 2 tablespoons honey in processor. Cover and refrigerate until well chilled, about 1 hour. Add mango nectar as needed to thin to sauce consistency. (Sauce can be made 1 day ahead. Keep refrigerated.)",
        "Place 1 tablespoon water in 1/4-cup measuring cup. Sprinkle gelatin over. Let soften 10 minutes. Whisk honey and yolks in small metal bowl. Set bowl over large saucepan halfway filled with boiling water. Cook until mixture registers 160°F. on candy thermometer, whisking constantly, about 3 minutes. Remove bowl from over water. Add gelatin mixture and whisk until honey mixture is cool.",
        "Beat whipping cream and crème fraîche in large bowl to medium-stiff peaks. Add honey mixture and fold together gently. Cover and refrigerate mousse until set, at least 2 hours and up to 8 hours.",
        "Preheat oven to 375°F. Combine sugar and ground all-spice in small bowl. Sprinkle 1 tablespoon sugar mixture over 1 puff pastry sheet. Roll out on lightly floured surface to 13x12-inch rectangle. Trim to 10-inch square. Cut puff pastry sheet into quarters, forming four 5-inch squares. Fold 1 dough square diagonally in half to form triangle. Starting at folded side, cut 1/2-inch border strip on both unfolded sides of triangle, leaving 1/2 inch of dough uncut at triangle point so that strips remain attached. Unfold triangle. Brush 1/2-inch-wide border strips with water. Lift up both loose corner tips, slip one under the other and place border strips atop edges of base, gently pulling to match corners on base. Press border onto base to adhere. Sprinkle more sugar mixture over border. Transfer pastry to cookie sheet. Pierce center all over with fork. Repeat with remaining pastry squares and pastry sheet and sugar mixture. Bake pastries until golden brown, piercing centers with knife if puffy, about 20 minutes. Transfer pastries to rack and cool completely. (Can be prepared 4 hours ahead. Store in air-tight container at room temperature.)",
        "Spoon sauce onto plates. Spoon honey mousse into pastry baskets and arrange atop sauce. Top mousse with slices of pineapple, mango and kiwi fruit. Garnish each dessert with fresh mint leaves and serve."
    ],
    "ingredients": [
        "2 large ripe mangoes, peeled, pitted, sliced",
        "2 tablespoons honey",
        "1/3 cup (about) mango nectar",
        "1 tablespoon water",
        "1 teaspoon unflavored gelatin",
        "1/4 cup honey",
        "4 egg yolks",
        "2/3 cup chilled whipping cream",
        "1/3 cup chilled crème fraîche or sour cream",
        "3 tablespoons sugar",
        "1/4 teaspoon (generous) ground allspice",
        "1 17 1/4-ounce package (2 sheets) frozen puff pastry, thawed",
        "1/2 pineapple, peeled, cored, sliced",
        "1 mango, halved, peeled, sliced",
        "2 kiwi fruits, peeled, sliced",
        "Fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Fruit",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Spring",
        "Chill",
        "Honey"
    ],
    "title": "Puff Pastry Baskets with Honey Mousse and Assorted Fruit",
    "url": "http://www.epicurious.com/recipes/food/views/puff-pastry-baskets-with-honey-mousse-and-assorted-fruit-1904"
}
