{
    "directions": [
        "Melt butter in heavy large skillet over medium heat. Add sugar, 1 tablespoon rum, water and cinnamon and stir until syrupy. Add bananas and cook 2 minutes, turning occasionally and basting with syrup. Using slotted spoon, transfer bananas to plate. Boil syrup until reduced to 2 tablespoons, about 2 minutes. Pour syrup over bananas; let cool.",
        "Combine chocolate, cream and corn syrup in heavy small saucepan; stir over low heat until chocolate melts and mixture is smooth. Remove from heat. Transfer 2 tablespoons chocolate mixture to small bowl (Mixture will be thick). Add 2 tablespoons rum to mixture in saucepan; stir sauce to blend.",
        "Position rack in center of oven; preheat to 400°F. Place 1 pastry sheet on floured work surface. Set 9-inch-diameter tart pan upside down on pastry. Using knife, cut pastry into 9-inch-diameter scalloped round. Repeat with remaining pastry sheet. Place 1 pastry round on ungreased heavy large baking sheet; arrange 3 whole bananas on pastry, forming circle and leaving 1/2-inch pastry border. Fill in center with remaining bananas, cutting to fit. Pour any syrup from bananas and reserved 2 tablespoons chocolate mixture over bananas. Brush pastry edges with beaten egg. Top with second pastry round. Press edges to seal. Brush top with egg. Using small sharp knife, cut 8 vents in top of pastry to allow steam to escape. Freeze 10 minutes.",
        "Bake until pastry is golden and puffed, about 30 minutes. Run long knife under pastry to loosen. Cool on baking sheet on rack until just lukewarm, about 1 1/2 hours. (Can be made 6 hours ahead. Let stand at room temperature.) Rewarm sauce over low heat. Serve pie with sauce."
    ],
    "ingredients": [
        "2 tablespoons (1/4 stick) unsalted butter",
        "1/3 cup sugar",
        "3 tablespoons dark rum",
        "1 tablespoon water",
        "1/4 teaspoon (generous) ground cinnamon",
        "1 3/4 pounds ripe small bananas (about 5), peeled, left whole",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "1/4 cup whipping cream",
        "2 tablespoons light corn syrup",
        "1 17 1/4-ounce package frozen puff pastry (2 sheets), thawed",
        "1 egg, beaten to blend (glaze)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Rum",
        "Chocolate",
        "Fruit",
        "Dessert",
        "Bake",
        "Banana",
        "Winter"
    ],
    "title": "Puff Pastry Banana Pie with Chocolate Rum Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/puff-pastry-banana-pie-with-chocolate-rum-sauce-547"
}
