{
    "directions": [
        "In a small bowl, combine the salt, black pepper, cayenne, paprika and mustard powder. Rub the mixture evenly over the pork and let stand at room temperature for 1 hour.",
        "Oven method:",
        "Preheat an oven to 300°F. In a 6-quart Dutch oven over medium-high heat, warm the oil until almost smoking. Add the pork and brown on all sides, 5 to 6 minutes total. Transfer to a platter. Add the onion, garlic and tomato paste to the pan and cook, stirring constantly, for 1 minute. Add 1/2 cup of the vinegar and the broth and bring to a simmer, stirring occasionally. Add the pork, cover and transfer to the oven. Cook, turning the pork every hour, until it is tender and a fork inserted into the meat yields little resistance, about 3 hours total.",
        "Slow-cooker method:",
        "In the stovetop-safe insert of a slow cooker over medium-high heat, warm the oil until almost smoking. Add the pork and brown on all sides, 5 to 6 minutes total. Transfer to a platter. Add the onion, garlic and tomato paste to the insert and cook, stirring constantly, for 1 minute. Add 1/2 cup of the vinegar and the broth and bring to a simmer, stirring occasionally. Add the pork and transfer the insert to the slow-cooker base. Cover and cook on high according to the manufacturer’s instructions until the pork is fork-tender, about 4 hours.",
        "Meanwhile, make the coleslaw: Put the cabbage in a large bowl, sprinkle with the 1 1/2 Tbs. salt and toss well. Transfer to a colander and let drain for 30 minutes. In a large bowl, whisk together the mayonnaise, granulated sugar, lemon juice, celery seed and vinegar, and season with salt and black pepper. Add the drained cabbage and carrots and toss to coat evenly with the dressing. Cover and refrigerate for 2 to 3 hours before serving.",
        "Transfer the pork to a large platter or baking sheet and cover loosely with aluminum foil. Skim the fat off the cooking liquid. Set the braiser or insert over medium-high heat, bring the liquid to a simmer and cook until reduced to 1 3/4 cups, 8 to 10 minutes. Whisk in the remaining 1/4 cup vinegar, the Worcestershire sauce, ketchup and brown sugar and simmer until the sugar dissolves.",
        "Shred the meat, discarding any fat, and transfer to a large bowl. Stir in the sauce. Place 2 Tbs. pork and 1 Tbs. coleslaw on the bottom of each roll, then cover with the tops of the rolls. Serve immediately. Serves 12."
    ],
    "ingredients": [
        "1 Tbs. kosher salt",
        "1 tsp. freshly ground black pepper",
        "1/4 tsp. cayenne pepper",
        "1 Tbs. paprika",
        "1 tsp. mustard powder",
        "3 1/2 lb. boneless pork shoulder",
        "1 Tbs. vegetable oil",
        "1 large yellow onion, halved and sliced 1/4 inch thick",
        "4 garlic cloves, peeled and lightly smashed",
        "1/4 cup tomato paste",
        "3/4 cup cider vinegar",
        "2 cups chicken broth",
        "1 head green cabbage, cored, quartered and thinly sliced",
        "1 1/2 Tbs. kosher salt, plus more, to taste",
        "1/2 cup mayonnaise",
        "1 1/2 Tbs. granulated sugar",
        "1 Tbs. fresh lemon juice",
        "1 tsp. celery seed",
        "2 Tbs. cider vinegar",
        "Freshly ground black pepper, to taste",
        "2 carrots, peeled and julienned",
        "3 tsp. Worcestershire sauce",
        "1/2 cup ketchup",
        "1/4 cup firmly packed light brown sugar",
        "36 Parker House rolls, halved"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Pulled Pork Sliders",
    "url": "http://www.williams-sonoma.com/recipe/pulled-pork-sliders.html"
}
