{
    "directions": [
        "Mix flour, pumpkin, milk, sugar, yeast, nutmeg, 2 Tbsp. butter, and 1 tsp. kosher salt in a large bowl or the bowl of a stand mixer fitted with the dough hook until dough comes together. Knead with your hands or dough hook until dough is soft and smooth, about 10 minutes. Form into a ball.",
        "Lightly grease a large clean bowl with oil; transfer dough to bowl. Cover tightly with plastic wrap and let rise in a warm place until doubled in size, about 1 hour.",
        "Meanwhile, purée cheese, spinach, pepper, garlic powder, 5 Tbsp. butter, and remaining 1/4 tsp. kosher salt in a food processor until smooth. Add egg and pulse to combine.",
        "Arrange racks in upper and lower thirds of oven; preheat to 375°F. Divide dough into 2 equal pieces. Roll each piece to a 14x8\" oval.",
        "Transfer 1 oval to a parchment-lined baking sheet. Spread half of spinach mixture in a thin layer over. Starting at long side, tightly roll dough around filling into a long tube (like a cinnamon roll).",
        "Arrange tube diagonally on sheet. Starting 1\" from end closest to you, use sharp kitchen shears to make a deep incision at a 45-degree angle away from you, cutting almost to the bottom without cutting through. Carefully shift small cut piece to the left, keeping the bottom connected. Make another 45-degree incision 1\" from first. Carefully shift piece to the right. Continue cutting and shifting to alternate sides for a total of 12-14 pieces. Repeat rolling, filling, and cutting with second piece of dough on another parchment-lined rimmed baking sheet.",
        "Brush dough with 2 Tbsp. butter; sprinkle edges with sea salt. Bake, rotating sheets halfway through, until golden brown, 25-30 minutes.",
        "Brush bread with remaining 1 Tbsp. butter and let cool slightly before serving.",
        "Dough and filling can be made 1 day ahead; cover and chill. Bring to room temperature before rolling and filling."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "3/4 cup pumpkin purée (fresh or canned)",
        "2/3 cup lukewarm whole milk",
        "1/4 cup sugar",
        "1 teaspoon active dry yeast",
        "1 teaspoon ground nutmeg",
        "10 tablespoons unsalted butter, melted, divided",
        "1 1/4 teaspoons kosher salt, divided",
        "Vegetable oil (for greasing)",
        "1/2 cup (packed) finely grated Pecorino cheese (about 1 1/4 ounces)",
        "1/2 cup (packed) thawed, drained frozen spinach",
        "1/4 teaspoon freshly ground black pepper",
        "1/4 teaspoon garlic powder",
        "1 large egg",
        "Flaky sea salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fall",
        "Bread",
        "Pumpkin",
        "Nutmeg",
        "Spinach",
        "Cheese",
        "Bake"
    ],
    "title": "Pull-Apart Bread With Pumpkin and Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/pull-apart-bread-with-pumpkin-and-spinach"
}
