{
    "directions": [
        "Mix the paprika, garlic power, brown sugar, dry mustard, and salt together in a small bowl. Rub the spice blend all over the pork. Cover and refrigerate for at least 1 hour, or up to overnight.",
        "Preheat the oven to 300 degrees F. Put the pork in a roasting pan and roast it for about 6 hours. An instant-read thermometer stuck into the thickest part of the pork should register 170 degrees F, but basically, what you want to do is to roast it until it's falling apart.",
        "While the pork is roasting, make the barbecue sauce. Combine the vinegar, mustard, ketchup, brown sugar, garlic, salt, cayenne, and black pepper in a saucepan over medium heat. Simmer gently, stirring, for 10 minutes until the sugar dissolves. Take it off the heat and let it sit until you're ready for it.",
        "When the pork is done, take it out of the oven and put it on a large platter. Allow the meat to rest for about 10 minutes. While it's resting, deglaze the pan over medium heat with 3/4 cup water, scraping with a wooden spoon to pick up all of the browned bits. Reduce by about half. Pour that into the saucepan with the sauce and cook 5 minutes.",
        "While the pork is still warm, you want to \"pull\" the meat: Grab 2 forks. Using 1 to steady the meat, use the other to \"pull\" shreds of meat off the roast. Put the shredded pork in a bowl and pour half of the sauce over. Stir it all up well so that the pork is coated with the sauce.",
        "To serve, spoon the pulled pork mixture onto the bottom half of each hamburger bun, and top with some slaw. Serve with pickle spears and the remaining sauce on the side.",
        "1 head green cabbage, shredded",
        "2 carrots, grated",
        "1 red onion, thinly sliced",
        "2 green onions (white and green parts), chopped",
        "1 fresh red chile, sliced",
        "1 1/2 cups mayonnaise",
        "1/4 cup Dijon mustard",
        "1 tablespoon cider vinegar",
        "1 lemon, juiced",
        "Pinch sugar",
        "1/2 teaspoon celery seed",
        "Several dashes hot sauce",
        "Kosher salt and freshly ground black pepper",
        "Combine the cabbage, carrots, red onion, green onions, and chile in a large bowl. In another bowl, stir together the mayonnaise, mustard, vinegar, lemon juice, and sugar. Pour the dressing over the cabbage mixture and toss gently to mix. Season the cole slaw with the celery seed, hot sauce, salt, and black pepper. Chill for 2 hours in the refrigerator before serving."
    ],
    "ingredients": [
        "3 tablespoons paprika",
        "1 tablespoon garlic powder",
        "1 tablespoon brown sugar",
        "1 tablespoon dry mustard",
        "3 tablespoons coarse sea salt",
        "1 (5 to 7 pound) pork roast, preferably shoulder or Boston butt",
        "1 1/2 cups cider vinegar",
        "1 cup yellow or brown mustard",
        "1/2 cup ketchup",
        "1/3 cup packed brown sugar",
        "2 garlic cloves, smashed",
        "1 teaspoon kosher salt",
        "1 teaspoon cayenne",
        "1/2 teaspoon freshly ground black pepper",
        "Pan drippings from the pork",
        "12 hamburger buns",
        "1 recipe Cole Slaw, recipe follows",
        "Pickle spears, for serving"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pulled Pork",
        "Meat",
        "Pork"
    ],
    "title": "Pulled Pork Barbecue",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/pulled-pork-barbecue-recipe"
}
