{
    "directions": [
        "Place the pork, fat side up, in a roasting pan fitted with a rack insert. Place the salt, pepper, brown sugar, paprika, thyme leaves, garlic, vinegar, and cayenne in a food processor and pulse until well combined. Add extra-virgin olive oil until you have a nice paste. Rub all over the pork, being sure to get into the nooks so the salt can penetrate the meat and pull out the moisture - this will help form a crust on the outside when cooked. Cover the pork with plastic wrap and marinate in the refrigerator for at least 3 hours or up to overnight.",
        "Allow the meat to sit at room temperature for 30 minutes before cooking. Preheat the oven to 325 degrees F.",
        "Roast the pork for 3 1/2 hours, uncovered, until the outside is crispy-brown (it should look like mahogany). Let the meat rest on a cutting board for 10 minutes before slicing.",
        "While the pork is cooking, prepare the slaw. Combine the mustard, mayonnaise, sour cream, lemon juice, vinegar and sugar. Mix well and add finely sliced savoy cabbage, purple cabbage, green onions and carrots. Season with salt and pepper, to taste, cover with plastic wrap and set aside in the refrigerator until you are ready to serve.",
        "To serve, cut the brioche buns in half and pile up some sliced pork. Top with a large spoonful of coleslaw and place the top half of the bun on top. Garnish with parsley."
    ],
    "ingredients": [
        "1 boneless pork shoulder (about 4 to 41/2 pounds)",
        "4 tablespoons kosher salt",
        "1 tablespoon freshly ground black pepper",
        "1 1/2 cups light brown sugar",
        "1/4 cup paprika",
        "2 to 3 sprigs thyme, leaves only",
        "4 cloves garlic",
        "1/4 cup red wine vinegar",
        "Scant 1 tablespoon cayenne",
        "3 tablespoons extra-virgin olive oil",
        "1 tablespoon whole-grain mustard",
        "1 cup mayonnaise",
        "1/4 cup sour cream",
        "1/2 lemon, juiced",
        "2 tablespoons red wine vinegar",
        "2 teaspoons sugar",
        "1/2 head savoy cabbage finely sliced",
        "1/2 head purple cabbage, finely sliced",
        "2 green onions, chopped",
        "2 carrots, sliced on mandoline",
        "Kosher salt and freshly ground black pepper",
        "6 brioche hamburger buns",
        "1/4 bunch flat-leaf parsley, for garnish"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Easy Lunch Recipes",
        "Lunch",
        "American",
        "Sandwich",
        "Pulled Pork",
        "Cabbage Recipes",
        "Vegetable",
        "Meat",
        "Pork",
        "Roasting"
    ],
    "title": "Pulled Pork Sandwich",
    "url": "http://www.foodnetwork.com/recipes/tyler-florence/pulled-pork-sandwich-recipe"
}
