{
    "directions": [
        "Preheat an oven to 350 degrees F (175 degrees C).",
        "Cut off about 1/4 inch the top of the head of garlic to expose the cloves. Brush the cut cloves with a small amount of olive oil and nestle the head into a piece of aluminum foil; place on a baking sheet.",
        "Bake in preheated oven until cloves are tender and browned, about 45 minutes. Remove garlic from the oven and cool until easily handled, about 15 minutes. Squeeze out cloves and chop.",
        "Preheat the oven's broiler. Line a baking sheet with aluminum foil.",
        "Place tomatillos, green bell peppers, Anaheim chile peppers, jalapeno peppers, and sweet banana peppers, cut-sides down, onto the lined baking sheet.",
        "Cook under the preheated broiler until the skin of the tomatillos and peppers has blackened and blistered, 5 to 8 minutes. Transfer to a bowl and cover tightly with plastic wrap. Allow tomatillos and peppers to steam as they cool, about 10 minutes. Remove and discard skins.",
        "Transfer peeled tomatillos and peppers to a blender or food processor; blend into a smooth green sauce.",
        "Heat olive oil in a large pot over medium heat. Add onions and celery; cook and stir until onions are glistening, about 5 minutes. Add chopped roasted garlic, shredded pork, cilantro, oregano, coriander, cumin, cinnamon, nutmeg, salt, and black pepper. Pour in 1 cup chicken stock; bring to a simmer.",
        "Stir green sauce mixture into the pot. Add coconut milk. Bring to a boil; reduce heat and simmer. Cook until chili thickens, about 30 minutes. Stir in chicken stock and continue cooking until chili reaches desired consistency, 30 to 90 minutes."
    ],
    "ingredients": [
        "1 head garlic",
        "1/4 cup olive oil, divided, or as needed",
        "2 1/2 pounds fresh tomatillos, husks removed",
        "4 large green bell peppers, halved and seeded, or more to taste",
        "4 Anaheim chile peppers, halved and seeded, or more to taste",
        "3 jalapeno peppers, halved and seeded",
        "3 sweet banana peppers, halved and seeded",
        "2 onions, chopped",
        "3 ribs celery, chopped, or more to taste",
        "3 pounds shredded, fully cooked pork shoulder",
        "1 bunch cilantro, chopped",
        "1 tablespoon dried oregano",
        "2 teaspoons ground coriander",
        "2 teaspoons ground cumin",
        "1 dash ground cinnamon",
        "1 dash ground nutmeg",
        "1 pinch salt and ground black pepper to taste",
        "2 cups chicken stock, divided, or more to taste",
        "1 (14 ounce) can coconut milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pulled Pork Chili Verde",
    "url": "http://allrecipes.com/recipe/246956/pulled-pork-chili-verde/"
}
