{
    "directions": [
        "With a stovetop burner set to high, use tongs to hold each chile about 3 inches from the flame and toast until slightly puffed and aromatic, about 1 minute. Repeat with the remaining chiles, transferring them to a large bowl as toasted. Cover the chiles with about 1 quart boiling water. (If the chiles float, puncture each with a small knife to let the water inside.) Steep the chiles until soft and pliable, about 30 minutes. Drain and let cool. Once the chiles are cool enough to handle, remove the stems and most of the seeds and transfer to a blender or the bowl of a food processor.",
        "While the chiles are soaking, arrange a rack about 6 inches from the flame and preheat the broiler. Arrange the tomatoes on the broiler pan or a baking sheet and broil, flipping several times to expose all sides, until the entire surface is charred, 5 to 6 minutes. Let the tomatoes cool slightly then remove and discard the charred skin. Add the tomato flesh to the chiles in the blender or food processor. Add the garlic, oregano, cumin, cloves, and 1 cup water and process until smooth.",
        "Arrange a rack in the middle of the oven and preheat to 300°F. Cut a piece of parchment into a round the same size as a large Dutch oven.",
        "Season the meat with salt and pepper. In a large Dutch oven over moderate heat, heat the oil until hot but not smoking. Working in batches, sear the meat until brown on all sides, about 4 minutes per side. As browned, transfer the meat to a plate.",
        "Once all of the meat is seared, return it all to the pot and add the reserved chile-tomato purée. Bring to a boil and then place the parchment round over the meat. Cover the pot with a lid and transfer to the oven. Cook until the meat is very tender and falling apart, about 3 hours. Discard the parchment then transfer the meat to a cutting board and use two forks to shred it into small pieces, discarding any excess fat. Skim any excess fat from the braising liquid then return the meat to the pot and stir to combine. Season with salt and pepper. DO AHEAD: The brisket can be made ahead and stored with its braising liquid, in an airtight container in the refrigerator, up to 3 days. To reheat, place the desired portion in an appropriate-size skillet over moderate heat and cook until warmed through.",
        "Divide the pulled brisket evenly among the buns (about 2 tablespoons per bun) and serve immediately."
    ],
    "ingredients": [
        "3 dried ancho chiles*",
        "3 dried guajillo chiles",
        "3 medium tomatoes (about 1 1/2 pounds total)",
        "6 cloves garlic, peeled",
        "1 tablespoon dried oregano",
        "1 tablespoon ground cumin",
        "1 teaspoon ground cloves",
        "4 pounds beef brisket, cut into 3-inch pieces, or boneless short ribs",
        "2 tablespoons canola oil",
        "24 mini buns or dinner rolls, split",
        "*Dried chiles are often quite spicy and can leave their heat on your hands so some cooks like to wear rubber gloves when working with them.",
        "Special equipment: Blender or food processor; parchment paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Hanukkah",
        "Kid-Friendly",
        "Brisket",
        "Party",
        "Chile Pepper",
        "Tailgating",
        "Super Bowl"
    ],
    "title": "Pulled Brisket Sliders",
    "url": "http://www.epicurious.com/recipes/food/views/pulled-brisket-sliders-368731"
}
