{
    "directions": [
        "Add the water, flank steak and bay leaves to the cooker. Season with 1 tablespoon (18 g) of the salt. Close the lid.",
        "Stovetop Pressure Cooker: Set to high pressure (15 PSI) and set the timer for 30 minutes. Cook over high heat until the pressure point is reached, then lower the heat to medium and",
        "Electric Pressure Cooker: Use the meat setting and adjust the time to 35 minutes, or set to high pressure (10–12 PSI) and 35 minutes.",
        "When done, remove the stovetop cooker from the heat and apply quick-release, or cancel cooking for the electric cooker and apply auto-release. When all the pressure is out, open the cooker and transfer the flank steak to a carving board, using tongs. Allow the beef to rest, about 5 minutes. Reserve 1 cup (235 ml) of the beef stock for later use and discard the rest. Do not discard the bay leaves. When ready, manually shred the beef, pulling it apart into 1/2-inch (1.3-cm) wide pieces. Heat the oil in the stovetop pressure cooker over medium-high or use the sauté setting for the electric pressure cooker. Sauté all of the vegetables and garlic, adding the oregano and cumin, until the onion begins to soften and the mixture is fragrant, about 2 to 5 minutes. Stir in the tomato sauce, red wine\nand reserved beef stock. Add the shredded beef, vinegar and black pepper, and adjust for salt. Stir well, cancel cooking for the electric cooker and close the lid.",
        "Stovetop Pressure Cooker: Set to high pressure (15 PSI) and cook over high heat for 10 minutes total.",
        "Electric Pressure Cooker: Use the meat setting and adjust the time to 15 minutes, or set to high pressure (10–12 PSI) and 15 minutes.",
        "When done, remove from the heat or turn off the cooker and allow the pressure to release on its own (natural-release), about 7 to 10 minutes. If the pressure is not fully released after 10 minutes, apply auto-release. Serve immediately."
    ],
    "ingredients": [
        "3 cups (710 ml) water",
        "1 1/2 lb (680 g) flank steak",
        "2 bay leaves",
        "1 tbsp (18 g) plus 2 tsp (12 g) kosher salt",
        "1/3 cup (80 ml) canola oil",
        "1 medium Spanish onion, cut into 1/2\" (1.3-cm) julienne",
        "1 medium green bell pepper, cut into 1/2\" (1.3-cm) julienne",
        "1 medium red bell pepper, cut into 1/2\" (1.3-cm) julienne",
        "4 cloves garlic, minced",
        "1 tsp (1 g) dried oregano",
        "1/2 tsp ground cumin",
        "1 cup (245 g) tomato sauce",
        "1 cup (235 ml) dry red wine",
        "1 tbsp (15 ml) white distilled vinegar",
        "1/8 tsp freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pressure Cooker",
        "Instant Pot",
        "Dinner",
        "Olive",
        "Beef",
        "Bell Pepper",
        "Garlic",
        "Stew"
    ],
    "title": "Pulled Flank Steak in Red Wine Sauce (*Ropa Vieja o Carne Ripiada*)",
    "url": "http://www.epicurious.com/recipes/food/views/pulled-flank-steak-in-red-wine-sauce-ropa-vieja-o-carne-ripiada"
}
