{
    "directions": [
        "Preheat oven to 350°F with rack in middle.",
        "Roll out dough into a 15-inch round on a lightly floured surface with a lightly floured rolling pin, then fit into tart pan. Trim any excess dough, leaving a 1/2-inch overhang. Fold overhang inward and press against edge of pan so pastry stands slightly above rim. Chill until firm, about 30 minutes.",
        "Lightly prick bottom of shell all over with a fork, then line with foil and fill with pie weights. Bake tart shell until side is set and edge is pale golden, 25 to 30 minutes. 3Carefully remove weights and foil and bake shell until bottom and side are golden, about 15 minutes more. Cool completely in pan on a rack, about 30 minutes.",
        "Whisk together cream, pumpkin purée, brown sugar, eggs, cinnamon, ginger, and salt until smooth.",
        "Put tart shell in pan on a baking sheet. Spread preserves evenly over bottom of tart shell, then pour pumpkin mixture over preserves.",
        "Bake tart until filling is just set a few inches from edge but still slightly wobbly in center, 50 minutes to 1 hour. Cool in pan on a rack, about 1 hour. (Tart will continue to set as it cools.) Remove side of pan before serving."
    ],
    "ingredients": [
        "Pastry dough",
        "1 cup heavy cream",
        "1 1/2 cups canned solid-pack pumpkin (not pie filling)",
        "2/3 cup packed light brown sugar",
        "2 large eggs",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon salt",
        "3/4 cup damson plum preserves",
        "Equipment: an 11-inch fluted tart pan (1 inch deep) with removable bottom; pie weights or dried beans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Plum",
        "Pumpkin",
        "Winter",
        "Chill",
        "Jam or Jelly",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pumpkin Plum Tart",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-plum-tart-240578"
}
