{
    "directions": [
        "Preheat oven to 375°F.",
        "Heat a 2-quart souffl&é dish or round ceramic casserole in middle of oven.",
        "Cook 1 cup sugar in a dry 2-quart heavy saucepan over moderately low heat, stirring slowly with a fork, until melted and pale golden. Cook caramel without stirring, swirling pan, until deep golden, about 5 minutes. Quickly and carefully remove hot dish from oven and immediately pour caramel into dish, tilting it to cover bottom and sides. (Leave oven on.) Keep tilting as caramel cools and thickens enough to stay in place.",
        "Scald whole milk with evaporated milk in a saucepan and remove from heat. Beat eggs and remaining cup sugar with an electric mixer until smooth and creamy. Beat in salt, pumpkin, tequila, and spices. Pour milk mixture through a sieve into a bowl and beat into pumpkin mixture in a slow stream until combined well.",
        "Pour custard over caramel in dish and set in a water bath of 1 inch hot water. Put pan in middle of oven and lower temperature to 350°F. Bake until golden brown on top and a knife inserted in center comes out clean, about 1 1/4 hours, possibly longer. Remove dish from water bath and transfer to a rack to cool. Chill flan, covered, until cold, at least 6 hours.",
        "To unmold flan, run a thin knife around flan to loosen from sides of dish. Wiggle dish from side to side and, when flan moves freely in dish, invert a large serving platter with a lip over dish. Holding dish and platter securely together, quickly invert and turn out flan onto platter. Caramel will pour out over and around it. Cut flan into wedges and serve with caramel spooned over and with shards of praline."
    ],
    "ingredients": [
        "2 cups sugar",
        "1 cup whole milk",
        "2 (5-oz) cans evaporated milk (1 1/3 cups)",
        "5 large eggs",
        "1/4 teaspoon salt",
        "15-oz can solid-pack pumpkin (1 3/4 cups)",
        "2 tablespoons premium golden agave tequila such as Herradura Reposado, or bourbon",
        "2 teaspoons ground cinnamon",
        "1 teaspoon ground ginger",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon ground nutmeg",
        "Accompaniment:pumpkin-seed praline"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Candy",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pumpkin",
        "Fall",
        "Seed",
        "Gourmet"
    ],
    "title": "Pumpkin Flan with Pumpkin Seed Praline",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-flan-with-pumpkin-seed-praline-102600"
}
