{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Heat soufflé dish in oven while making caramel.",
        "Cook 1 cup sugar in a dry 2-quart heavy saucepan over moderate heat, undisturbed, until it begins to melt. Continue to cook, stirring occasionally with a fork, until sugar melts into a deep golden caramel. Wearing oven mitts, remove hot dish from oven and immediately pour caramel into dish, tilting it to cover bottom and side. (Leave oven on.) Keep tilting as caramel cools and thickens enough to coat, then let harden.",
        "Bring cream and milk to a bare simmer in a 2-quart heavy saucepan over moderate heat, then remove from heat. Whisk together whole eggs, yolk, and remaining cup sugar in a large bowl until combined well, then whisk in pumpkin, vanilla, spices, and salt until combined well. Add hot cream mixture in a slow stream, whisking.",
        "Pour custard through a fine-mesh sieve into a bowl, scraping with a rubber spatula to force through, and stir to combine well. Pour custard over caramel in dish, then bake in a water bath until flan is golden brown on top and a knife inserted in center comes out clean, about 1 1/4 hours. Remove dish from water bath and transfer to a rack to cool. Chill flan, covered, until cold, at least 6 hours.",
        "Toast pumpkin seeds in oil in a 10- to 12-inch heavy skillet (preferably cast-iron) over moderately low heat, stirring constantly, until puffed and golden, 8 to 10 minutes. Toss with salt and cayenne until coated.",
        "Run a thin knife between flan and side of dish to loosen. Shake dish gently from side to side and, when flan moves freely in dish, invert a large platter with a lip over dish. Holding dish and platter securely together, quickly invert and turn out flan onto platter. (Caramel will pour out over and around flan.) Sprinkle flan with spiced pumpkin seeds just before serving."
    ],
    "ingredients": [
        "2 cups sugar",
        "1 1/2 cups heavy cream",
        "1 cup whole milk",
        "5 whole large eggs plus 1 large egg yolk",
        "1 (15-ounce) can solid-pack pumpkin (1 3/4 cups; not pie filling)",
        "1 teaspoon vanilla",
        "1 1/2 teaspoons ground cinnamon",
        "1 teaspoon ground ginger",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon salt",
        "1 cup green (hulled) pumpkin seeds (1/4 pound; not toasted)",
        "1 teaspoon vegetable oil",
        "1/2 teaspoon salt",
        "1/8 teaspoon cayenne",
        "Special equipment: a 2-quart soufflé dish or round ceramic casserole dish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Squash",
        "Pumpkin",
        "Fall",
        "Chill",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pumpkin Flan with Spiced Pumpkin Seeds",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-flan-with-spiced-pumpkin-seeds-233017"
}
