{
    "directions": [
        "Whisk both flours and salt in bowl. Using electric mixer, beat butter and sugar in another bowl until well blended. Beat in yolk and vanilla. Add flour mixture; beat until moist clumps form. Gather dough into ball; flatten into disk. Wrap in plastic; chill 30 minutes.",
        "Position rack in bottom third of oven and preheat to 375°F. Roll out dough disk between 2 sheets of parchment paper or waxed paper to 12-inch round. Remove top sheet of parchment. Invert dough into 9-inch-diameter tart pan with removable bottom; gently remove remaining parchment. Press dough evenly into pan, patching any tears in crust if necessary. Trim dough, leaving 3/4-inch overhang. Press overhang in, forming double-thick sides. Pierce bottom of dough all over with fork. Place tart pan on baking sheet. Gather dough scraps into ball. Roll out on floured surface to 1/4-inch thickness. Using small leaf-shaped cookie cutter or knife, cut out leaf shapes. Place leaves on baking sheet with tart crust.",
        "Bake leaves until light golden, about 10 minutes; transfer leaves to rack. Continue to bake crust until edges begin to brown, about 20 minutes longer. Keep tart pan on baking sheet.",
        "Whisk eggs, brown sugar and molasses in medium bowl until smooth. Whisk in whipping cream, cinnamon, ginger, cloves and salt. Add pumpkin and whisk until well blended. Pour into warm crust. Bake tart on baking sheet until filling is set in center and edges of filling are firm and beginning to puff, about 45 minutes. Transfer tart to rack; cool completely in pan on rack. (Can be made 1 day ahead. Chill until cold, then cover. Keep refrigerated.) Arrange pastry leaves atop tart.",
        "Beat whipping cream, sugar and vanilla in large bowl until peaks form.",
        "Cut tart into wedges. Top with whipped cream and serve."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "1/2 cup cake flour",
        "1/4 teaspoon salt",
        "1/2 cup plus 2 tablespoons (1 1/4 sticks) unsalted butter, room temperature",
        "1/4 cup sugar",
        "1 large egg yolk",
        "1/2 teaspoon vanilla extract",
        "2 large eggs",
        "1/2 cup (packed) dark brown sugar",
        "2 tablespoons mild-flavored (light) molasses",
        "2/3 cup whipping cream",
        "1 teaspoon ground cinnamon",
        "1/2 teaspoon ground ginger",
        "1/8 teaspoon ground cloves",
        "1/8 teaspoon salt",
        "1 1/2 cups canned pure pumpkin",
        "1 cup chilled whipping cream",
        "2 tablespoons powdered sugar",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pumpkin",
        "Fall",
        "Molasses",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pumpkin, Ginger and Molasses Tart",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-ginger-and-molasses-tart-104323"
}
