{
    "directions": [
        "On a lightly floured surface with a floured rolling pin roll out dough 3/4 inch thick (about a 12-inch round). Fit dough into an 8-inch glass pie plate (measure pie plate across top from inside edge of rim) with a 3-cup capacity and trim edge. Pinch edge up all around to form a continuous ridge and with a fork prick bottom of shell in several places. Chill shell 30 minutes, or until firm.",
        "Preheat oven to 375° F.Line shell with foil and fill with pie weights or raw rice. Bake shell in middle of oven 25 minutes. Carefully remove weights or rice and foil and bake shell until just pale golden, about 10 minutes more.",
        "Reduce temperature to 350° F.",
        "In a bowl whisk together pumpkin, heavy cream, eggs, brown sugar, and spices and pour into pie shell.",
        "Bake pie in middle of oven 1 hour, or until filling is set but center still trembles slightly. (Filling will continue to set as pie cools.) Transfer pie to a rack and cool completely. Chill pie, loosely covered, at least 2 hours, or until cold, and up to 1 day. Keep pie chilled until ready to assemble dessert.",
        "In a chilled bowl with an electric mixer beat heavy cream with 2 tablespoons sugar until it just holds stiff peaks.",
        "In a large bowl lightly whisk sour cream. In a small saucepan sprinkle gelatin over cold water to soften 1 minute. Heat mixture over low heat, stirring, until gelatin is dissolved completely (do not let mixture boil) and whisk into sour cream. Fold one third whipped cream into sour cream mixture until well incorporated and fold in remaining whipped cream.",
        "In a bowl with cleaned beaters beat whites on medium speed until they just hold soft peaks. Gradually add remaining 1/3 cup sugar, beating on high speed, until whites just hold stiff, slightly glossy peaks. Fold meringue into cream mixture gently but thoroughly.",
        "Mound topping on chilled pie and, using a cake spatula, smooth into a dome shape that dips in the center to resemble a pumpkin. Make 8 evenly spaced indented ridges from center of dome to edges of pie using pointed end of a church key can opener or tip of a knife to shape pumpkin and with a small offset spatula smooth edges of ridges. Chill dessert, uncovered, at least 2 hours and up to 1 day.",
        "Dust dessert with cinnamon and insert cinnamon stick into center for \"stem.\""
    ],
    "ingredients": [
        "Pastry Dough",
        "Pie weights or raw rice for weighting shell",
        "1 3/4 cups canned solid-pack pumpkin (about a 15-ounce can)",
        "1/2 cup heavy cream",
        "3 large eggs",
        "1/2 cup packed light brown sugar",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon freshly grated nutmeg",
        "1 1/4 cups well-chilled heavy cream",
        "1/3 cup plus 2 tablespoons superfine granulated sugar",
        "1 cup sour cream",
        "1 tablespoon unflavored gelatin (about 1 1/2 envelopes)",
        "1/4 cup cold water",
        "4 large egg whites (if egg safety is a problem in your area, substitute 2 tablespoons plus 2 teaspoons powdered egg whites)",
        "Garnish: ground cinnamon and a 3-inch cinnamon stick"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pumpkin",
        "Cinnamon",
        "Sour Cream",
        "Gourmet",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Pumpkin Pie \"pumpkin\"",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-pie-pumpkin-14467"
}
