{
    "directions": [
        "Stir half and half and 3/4 cup sugar in medium saucepan over medium heat until sugar dissolves. Remove saucepan from heat; cool mixture to lukewarm.",
        "Spread butter over 1 side of each bread slice. Cut bread into 3/4-inch pieces. Divide among six 1 1/4-cup soufflé dishes or custard cups.",
        "Whisk pumpkin, yolks, egg, liqueur, vanilla, nutmeg and salt in medium bowl until blended. Add half and half mixture; whisk until smooth. Pour pumpkin custard over bread in dishes, dividing equally. Let stand 30 minutes, occasionally pressing on bread to submerge.",
        "Preheat oven to 350°F. Place soufflé dishes in large roasting pan. Pour enough hot water into roasting pan to come halfway up sides of soufflé dishes; tent loosely with foil. Place roasting pan in oven. Bake puddings until knife inserted into center comes out clean, about 45 minutes. Transfer puddings to rack and cool completely. Cover and refrigerate at least 4 hours or overnight.",
        "Preheat broiler. Spoon 1 tablespoon whipping cream over top of each pudding. Sprinkle 1 tablespoon brown sugar over each. Broil puddings until tops are bubbly and golden brown, watching closely to avoid burning, about 2 minutes. Serve immediately."
    ],
    "ingredients": [
        "1 3/4 cups half and half",
        "3/4 cup sugar",
        "2 tablespoons (1/4 stick) unsalted butter, room temperature",
        "6 slices cinnamon raisin bread (each about 3 1/2 by 3 1/2 inches)",
        "3/4 cup canned pure pumpkin",
        "4 large egg yolks",
        "1 large egg",
        "1 tablespoon amaretto or Frangelico (hazelnut liqueur)",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon ground nutmeg",
        "Pinch of salt",
        "6 tablespoons whipping cream",
        "6 tablespoons (packed) golden brown sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bread",
        "Milk/Cream",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Amaretto",
        "Frangelico",
        "Pumpkin",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pumpkin Bread Puddings Brûlée",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-bread-puddings-brulee-102417"
}
