{
    "directions": [
        "Heat butter in a 12-inch heavy skillet over moderately high heat until foam subsides, then sauté squash and fennel with salt and pepper, stirring occasionally, until golden, about 4 minutes. Add shallot and water and simmer, covered, until vegetables are tender, about 10 minutes. Cool vegetables, then purée in a food processor until smooth and season with salt and pepper.",
        "Preheat oven to 400°F.",
        "Cook pasta sheets in a 4- to 6-quart pot of boiling salted water until al dente, 1 to 2 minutes, then immediately transfer with a slotted spoon to a bowl of ice and cold water to cool. Drain well, then pat sheets dry on paper towels and arrange in 1 layer in a well-oiled large shallow baking pan. Spoon 1/4 cup filling along 1 short end of a rectangle, then roll up filling in pasta. Make 3 more rolls in same manner and arrange, seam sides down, in baking pan. Drizzle cannelloni with oil.",
        "Cook bacon in a 12-inch heavy skillet over moderate heat, stirring, until fat is rendered but bacon is not yet crisp, about 5 minutes. Add shallot and cook, stirring, until softened, about 4 minutes. Add garlic and cook, stirring, until fragrant, about 1 minute. Add clams, wine, fennel seeds, and sage and cook, covered, until clams are fully open, 6 to 10 minutes, checking every minute after 6 minutes and removing clams as they fully open. (Discard any clams that have not opened after 10 minutes.)",
        "While clams are cooking, bake cannelloni in middle of oven until heated through, 6 to 8 minutes.",
        "Heat butter in a 1 1/2-quart heavy saucepan over moderately high heat until foam subsides, then fry sage leaves until crisp, about 3 minutes. Transfer leaves with slotted spoon to paper towels to drain. Season with salt. Add shallot to butter and cook, stirring, until shallot is golden and butter is deep golden, 1 to 2 minutes. Add lemon juice (butter will foam), then remove from heat. Stir in parsley and season brown butter with salt and pepper.",
        "To serve, put a cannelloni in center of each of 4 warm large plates. Divide clams with juices among plates and drizzle with brown butter. Top with fried sage leaves."
    ],
    "ingredients": [
        "2 tablespoons unsalted butter",
        "1 pound sugar pumpkin or other sweet winter squash such as butternut, peeled, seeded, and cut into 1-inch cubes (3 cups)",
        "3/4 cup diced (1/4 inch) fennel bulb (sometimes called anise)",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "2 tablespoons chopped shallot",
        "1/4 cup water",
        "4 (6- by 4-inch) fresh pasta rectangles",
        "1 tablespoon olive oil",
        "2 bacon slices, cut crosswise into 1/4-inch-wide strips",
        "1/3 cup thinly sliced shallot",
        "1 garlic clove, minced",
        "20 small hard-shelled clams (2 pounds) such as littlenecks (less than 2 inches wide), scrubbed well",
        "1/2 cup dry white wine",
        "1/4 teaspoon fennel seeds",
        "1 tablespoon chopped fresh sage",
        "1/2 stick (1/4 cup) unsalted butter",
        "8 fresh sage leaves",
        "2 tablespoons minced shallot",
        "1 teaspoon fresh lemon juice",
        "1/4 cup chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Pasta",
        "Sauté",
        "Bacon",
        "Clam",
        "Fennel",
        "Pumpkin",
        "White Wine",
        "Fall",
        "Sage",
        "Gourmet"
    ],
    "title": "Pumpkin Cannelloni with Clams and Sage Brown Butter",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-cannelloni-with-clams-and-sage-brown-butter-106999"
}
