{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Spray a 15x10 inch baking sheet with vegetable oil spray. Sift flour, cinnamon, ginger and allspice into small bowl. Set aside.",
        "In a large bowl, beat egg yolks, 1/3 cup white sugar and 1/3 cup brown sugar until very thick, about 3 minutes with an electric mixer. On low speed, beat in pumpkin, then flour mixture. Using clean, dry beaters, in a large bowl, beat egg whites and salt until stiff but not dry. Fold egg whites into batter in 3 additions.",
        "Spread into prepared pan. Bake at 375 degrees F (190 degrees C) for 15 minutes, or until a toothpick inserted into cake comes out clean.",
        "Place smooth (not terry cloth) kitchen towel on work surface; dust generously with powdered sugar. Cut around pan edges to loosen cake. Turn cake out onto kitchen towel. Fold towel over 1 long side of cake. Starting at 1 long side, roll cake up in towel. Arrange cake seam side down and cool completely, about 1 hour.",
        "To make the filling:  Pour 2 tablespoons rum into small heavy saucepan and sprinkle gelatin over. Let stand until gelatin softens, about 10 minutes. Stir over low heat just until gelatin dissolves, then remove from heat. In a large bowl, beat chilled whipping cream and 3 tablespoons powdered sugar until stiff peaks form. Beat in gelatin mixture. Fold in 6 tablespoons English toffee pieces.",
        "Unroll cake, sprinkle with 4 tablespoons English toffee pieces. Spread filling over. Starting at 1 long side and using kitchen towel as aid, roll up cake to enclose filling. Place cake seam side down on platter. (Can be prepared 1 day ahead.) Cover with foil and refrigerate.",
        "Trim ends of cake on slight diagonal. Dust cake with powdered sugar. Spoon some of the warm caramel sauce over top of cake. Sprinkle with 1/2 cup toffee. To serve, cut cake crosswise into 1 inch thick slices. Serve with remaining sauce."
    ],
    "ingredients": [
        "3/4 cup cake flour",
        "1 1/2 teaspoons ground cinnamon",
        "1 1/4 teaspoons ground ginger",
        "3/4 teaspoon ground allspice",
        "6 egg yolks",
        "6 egg whites",
        "1/3 cup white sugar",
        "1/3 cup packed light brown sugar",
        "2/3 cup solid pack pumpkin puree",
        "1/8 teaspoon salt",
        "1/4 cup confectioners' sugar for dusting",
        "2 tablespoons dark rum",
        "1 teaspoon unflavored gelatin",
        "1 cup heavy whipping cream",
        "3 tablespoons confectioners' sugar",
        "10 tablespoons crushed toffee candy",
        "1 (16 ounce) jar caramel ice cream topping, warmed",
        "1/2 cup crushed toffee candy"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Roll with Toffee Cream Filling and Caramel Sauce",
    "url": "http://allrecipes.com/recipe/8433/pumpkin-roll-with-toffee-cream-fillin/"
}
