{
    "directions": [
        "Chop 1/2 cup fennel fronds and reserve, then remove stalks and tough outer layer from bulb. Halve bulb and grate on large holes of a 4-sided grater.",
        "Heat 1/3 cup olive oil in a 12-inch heavy skillet over high heat until hot but not smoking and sauté onion, stirring, until softened, 2 to 3 minutes. Add pumpkin and grated fennel and cook, stirring frequently and scraping up any brown bits, until vegetables are soft, about 12 minutes. Stir in bulgur and chile flakes and cook 2 minutes. Add fennel fronds and mint, then remove from heat and cover. Let stand 15 minutes. Stir in cheeses and season with salt and black pepper.",
        "Keeping remaining sheets covered, brush 1 spring-roll sheet lightly with some safflower oil and place a scant 2 tablespoons filling 1 inch from edge closest to you. Form filling into a log, leaving a 1/2-inch border on each side. Fold bottom of sheet over filling, then fold in sides. Loosely roll away from you to form a cylinder, brush top edge with egg white, and press to seal. Bend cylinder into a horseshoe shape. Make more pastries in same manner.",
        "Heat enough safflower and olive oils to measure 3/4 inch in a deep 12-inch heavy skillet over moderately high heat until a deep-fat thermometer registers 350°F. Fry pastries 2 or 3 at a time, turning once, until golden brown, 3 to 4 minutes.",
        "Transfer with a slotted spoon to paper towels to drain and return oils to 350°F between batches. Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 fennel bulb (sometimes called anise)",
        "About 2 1/3 cups olive oil plus additional for brushing",
        "1 medium onion, chopped",
        "1 small pumpkin or winter squash (1 pound), peeled and cut into 1/4-inch dice",
        "1/3 cup coarse (#3) bulgur",
        "1/2 teaspoon dried Aleppo chile flakes or other dried hot red pepper flakes, or ground black pepper",
        "1/2 cup chopped fresh mint",
        "1 1/2 cups crumbled feta (8 ounces)",
        "1/2 cup grated myzíthra cheese or ricotta salata",
        "25 (8-inch) squares spring-roll pastry sheets, thawed if frozen",
        "About 2 cups safflower oil",
        "1 large egg white, lightly beaten"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Fry",
        "Cocktail Party",
        "Buffet",
        "Feta",
        "Ricotta",
        "Mint",
        "Fennel",
        "Pumpkin",
        "Bulgur",
        "Pastry",
        "Gourmet"
    ],
    "title": "Pumpkin and Fennel Pastries",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-and-fennel-pastries-103308"
}
