{
    "directions": [
        "Preheat an oven to 425 degrees F (220 degrees C).",
        "Whisk the flour, oats, baking powder, salt, 1 teaspoon cinnamon, nutmeg, 1/2 teaspoon ground ginger, and cloves together in a mixing bowl. Cut the cold butter into the mixture with a pastry blender or fork until the mixture resembles coarse crumbs the size of peas or smaller. Whisk the pumpkin puree, 2 tablespoons cold milk, the egg, and vanilla together in a small bowl; fold into the flour mixture until just blended.",
        "Divide dough into two sections on a lightly floured surface. Gather each into a ball and knead about 10-12 times. Flatten balls to 1/2-inch thickness on a non-stick baking sheet. Leave about 2 inches between the rounds. Cut rounds into sixths with a butter knife, but do not separate the wedges.",
        "Bake in the preheated oven until the bottoms and edges are just golden brown, 12 to 16 minutes. Set aside to cool.",
        "While the scones cool, mix the confectioners' sugar, 1 tablespoon milk, remaining pinch of ginger, and dash of cinnamon together in a small bowl. Add more milk to thin the frosting as needed. Pour the frosting into a sealable plastic bag. Snip off a corner of the bag and drizzle icing over the cooled scones in a zigzag fashion. The icing will harden as it cools."
    ],
    "ingredients": [
        "2 cups all-purpose flour",
        "1 cup old-fashioned rolled oats",
        "1 tablespoon baking powder",
        "1/2 teaspoon salt",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground nutmeg",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground cloves",
        "6 tablespoons cold butter",
        "3/4 cup pumpkin puree",
        "2 tablespoons cold milk",
        "1 large egg",
        "1/2 teaspoon vanilla extract",
        "1 cup confectioners' sugar",
        "1 tablespoon milk, or as needed",
        "1 pinch ground ginger",
        "1 dash ground cinnamon, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin-Oat Scones",
    "url": "http://allrecipes.com/recipe/210066/pumpkin-oat-scones/"
}
