{
    "directions": [
        "Preheat oven to 375 degrees F. Combine the whole wheat and all-purpose flours, sugar, baking powder, and salt in a bowl. Using a pastry blender cut in butter to resemble coarse crumbs. Whisk together the pumpkin and egg; add to flour mixture and stir until dough comes together.",
        "On a floured surface knead dough by gently folding and pressing until it just holds together. Pat dough out to 3/4-inch thickness. Using a floured 2-inch biscuit cutter cut out shortcakes; reroll scraps as necessary. Place shortcakes 1 inch apart on an ungreased baking sheet. Bake for 12 to 15 minutes or until golden. Cool on baking sheet for 5 minutes. Serve warm shortcakes split and filled with Blueberry Filling and Blueberry Sauce (see Steps 3 and 4 below).",
        "Blueberry Filling: Combine whipping cream and sugar in a chilled mixing bowl. Beat with an electric mixer on medium speed until soft peaks form (tips curl). Fold together whipped cream and VOSKOS(R) Nonfat Blueberry Greek Yogurt. Serve immediately or chill up to 5 hours.",
        "Fresh Blueberry Sauce: Combine blueberries and sugar in a food processor and pulse until a chunky sauce forms. Transfer blueberry mixture to a small pan. Simmer for 2 minutes. Serve warm."
    ],
    "ingredients": [
        "1 cup whole wheat flour",
        "1 cup all-purpose flour",
        "1/3 cup sugar",
        "2 teaspoons baking powder",
        "1/2 teaspoon salt",
        "1/2 cup butter",
        "3/4 cup canned pumpkin",
        "1 egg",
        "Blueberry Filling:",
        "1/2 cup whipping cream",
        "2 tablespoons sugar",
        "2 (5.3 ounce) containers VOSKOS® Nonfat Blueberry Greek Yogurt",
        "Fresh Blueberry Sauce:",
        "2 cups fresh blueberries",
        "1/4 cup sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Shortcakes with Blueberry Cream Filling",
    "url": "http://allrecipes.com/recipe/237942/pumpkin-shortcakes-with-blueberry-cre/"
}
