{
    "directions": [
        "1. Preheat the oven to 325°F. Butter a 10-inch glass baking dish.",
        "2. Spread the bread cubes on a large baking sheet and bake in the oven, turning once, until lightly toasted, about 15 minutes. Let cool.",
        "3. Combine the cream, milk, and vanilla bean and seeds in a small saucepan over medium heat and bring to a simmer.",
        "4. Whisk together the yolks, sugar, maple syrup, and pumpkin puree in a large bowl. Slowly whisk in the hot cream mixture until combined. Discard the vanilla bean and whisk in the bourbon.",
        "5. Scatter the pumpkin bread cubes in the prepared baking dish. Pour the custard over the bread, pressing down on the bread to totally submerge it in the custard. Let sit for 15 minutes to allow the bread to soak up some of the custard.",
        "6. Place the dish in a larger roasting pan and pour hot water into the roasting pan until it comes halfway up the sides of the glass dish. Bake until the sides are slightly puffed and the center jiggles slightly, about 1 hour. Remove from the oven and the water bath and cool on a wire rack for at least 30 minutes before serving.",
        "7. Serve the warm bread pudding topped with whipped cream and drizzled with spicy caramel apple sauce . Sprinkle with pumpkin seeds if desired."
    ],
    "ingredients": [
        "Unsalted butter, for the pan",
        "8 cups 1/2-inch cubed Pumpkin Bread or other bread",
        "2 cups heavy cream",
        "1 cup whole milk",
        "1 vanilla bean, split and seeds scraped",
        "6 large egg yolks",
        "1/2 cup sugar",
        "3 tablespoons pure maple syrup",
        "1 cup canned pumpkin puree, not flavored pie filling",
        "2 tablespoons bourbon",
        "Freshly whipped cream, for serving",
        "Spicy Caramel Apple Sauce",
        "Shelled pumpkin seeds (optional), for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Vanilla",
        "Pumpkin",
        "Fall",
        "Winter",
        "Party",
        "Potluck",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pumpkin Bread Pudding with Spicy Caramel Apple Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-bread-pudding-with-spicy-caramel-apple-sauce-367511"
}
