{
    "directions": [
        "Preheat oven to 325°F. Line baking sheet with foil. Stir sugar and butter in heavy medium saucepan over medium heat until sugar melts and mixture comes to boil; boil 1 minute without stirring. Mix in pecans. Spread mixture on prepared baking sheet. Bake until sugar syrup bubbles vigorously, about 8 minutes. Cool praline completely. Break into pieces. (Can be made 1 day ahead. Store airtight.)",
        "Preheat oven to 325°F. Stir cookie crumbs and cinnamon in medium bowl to blend. Add butter; stir until crumbs are moistened. Press onto bottom and 1 inch up sides of 9-inch-diameter springform pan with 2 3/4-inch-high sides. Bake crust until set, about 8 minutes. Cool. Double-wrap outside of pan with heavy-duty foil. Place in large roasting pan.",
        "Using electric mixer, beat cream cheese and sugar in large bowl until smooth. Beat in flour and spices. Beat in eggs 1 at a time. Beat in pumpkin, bourbon and vanilla. Transfer to crust.",
        "Pour enough hot water into roasting pan to reach 1 inch up sides of springform pan. Bake cake in water bath until center is just set, adding more water to roasting pan as needed, about 1 hour 45 minutes. Remove cheesecake from water. Cool in pan on rack. Remove foil. Run small sharp knife between cake and pan sides. Chill until cold; then cover and chill overnight.",
        "Release pan sides. Place cake on platter. Sprinkle praline over, leaving 1-inch plain border at edge. Cut cake into wedges."
    ],
    "ingredients": [
        "1/2 cup (packed) golden brown sugar",
        "3 tablespoons unsalted butter",
        "3/4 cup coarsely chopped pecans",
        "2 cups gingersnap cookie crumbs (about 9 ounces)",
        "1 teaspoon ground cinnamon",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "4 8-ounce packages cream cheese, room temperature",
        "1 1/2 cups sugar",
        "3 tablespoons all purpose flour",
        "1 1/2 teaspoons ground cinnamon",
        "1 teaspoon ground ginger",
        "4 large eggs",
        "1 15-ounce can solid pack pumpkin",
        "3 tablespoons bourbon",
        "2 teaspoons vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Cheese",
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cream Cheese",
        "Pecan",
        "Pumpkin",
        "Fall",
        "Chill",
        "Party"
    ],
    "title": "Pumpkin-Pecan Cheesecake",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-pecan-cheesecake-4662"
}
