{
    "directions": [
        "Preheat oven to 350°F. Butter baking pan, line with parchment paper, then butter parchment. Dust pan with flour, tapping out excess.",
        "Whisk baking powder, cinnamon, nutmeg, ginger, salt, baking soda, and 3 cups flour in a large bowl. Whisk pumpkin, sour cream, cookie butter, and vanilla in a medium bowl. Using an electric mixer on medium-high speed, beat brown sugar and 1 cup butter in another large bowl until lightened in color and fluffy, about 3 minutes. Add eggs one at a time, beating on medium speed after each addition, until combined. Add dry ingredients in 3 additions, alternating with pumpkin mixture in 2 additions, beginning and ending with dry ingredients. Scrape batter into prepared pan; smooth surface.",
        "Bake cake until golden brown and a tester inserted into the center comes out clean, 50–60 minutes. Transfer pan to a wire rack and let cool, about 2 hours.",
        "Pour enough water into a small saucepan to come 1\" up sides; bring to a simmer. Whisk egg whites, granulated sugar, vanilla, nutmeg, cinnamon, and salt in a large bowl. Place bowl over simmering water, making sure bottom of bowl does not touch water, and cook, stirring constantly, until whites are hot to the touch and sugar is dissolved, 1–2 minutes. Remove bowl from water. Using electric mixer on high speed, beat egg white mixture until cooled, fluffy, and holds stiff peaks, about 5 minutes.",
        "Spread meringue evenly over cake, creating peaks and valleys with a spatula. Sprinkle pepitas over meringue. If desired, heat with a kitchen torch or broiler, watching carefully and checking every minute, to lightly brown top, about 5 minutes total. Slice into pieces and serve.",
        "Cake, without meringue, can be made 1 day ahead; cover and store at room temperature."
    ],
    "ingredients": [
        "1 cup (2 sticks) unsalted butter, room temperature, plus more for pan",
        "3 cups all-purpose flour, plus more for pan",
        "1 tablespoon baking powder",
        "1 1/2 teaspoons ground cinnamon",
        "1 teaspoon freshly grated nutmeg",
        "1 teaspoon ground ginger",
        "1 teaspoon kosher salt",
        "1/2 teaspoon baking soda",
        "1 1/3 cups canned pumpkin purée",
        "1 cup sour cream",
        "3/4 cup speculoos cookie butter (preferably Biscoff)",
        "2 teaspoons vanilla extract",
        "2 cups (packed) light brown sugar",
        "4 large eggs",
        "4 large egg whites",
        "1 cup granulated sugar",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon freshly grated nutmeg",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon kosher salt",
        "2 tablespoons pepitas (pumpkin seeds)",
        "A 13x9\" baking pan, preferably light metal"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dessert",
        "Pumpkin",
        "Spice",
        "Soufflé/Meringue",
        "Bake",
        "Fall",
        "Thanksgiving"
    ],
    "title": "Pumpkin and Cookie-Butter Sheet Cake With Toasted Meringue",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-and-cookie-butter-sheet-cake-with-toasted-meringue"
}
