{
    "directions": [
        "Preheat oven to 350°F. Butter and flour two 9-inch cake pans with 1 1/2-inch-high sides, tapping out any excess flour. Whisk first 9 ingredients in large bowl. Using electric mixer, beat pumpkin, sugar, and oil in another large bowl. Add eggs 1 at a time, beating to incorporate between additions. Mix in orange peel. Add flour mixture; beat on low speed just to blend. Divide batter between prepared pans.",
        "Bake cakes until tester inserted into center comes out clean, about 33 minutes. Cool in pans 10 minutes. Invert onto rack, then turn top side up and cool completely.",
        "Sprinkle 1/2 cup powdered sugar over bottom of small nonstick skillet. Cook over medium heat until sugar melts (do not stir). Continue cooking until sugar turns deep amber, stirring occasionally, about 2 minutes. Carefully stir in 1/2 cup cream, vanilla, and salt (mixture will bubble vigorously). Stir until any caramel bits dissolve. Stir in remaining 1 tablespoon cream. Strain into small bowl. Cool caramel to room temperature.",
        "Sift remaining powdered sugar into medium bowl. Using electric mixer, beat cream cheese and butter in large bowl. Gradually beat in powdered sugar. Beat in cooled caramel. Cover and chill frosting until firm enough to spread, about 2 hours.",
        "Using long serrated knife, trim rounded tops from cakes. Place 1 cake layer on cake plate, cut side up. Spread 3/4 cup frosting over. Place second cake layer, cut side down, atop frosting. Cover top and sides of cake with remaining frosting, creating smooth surface. DO AHEAD: Can be made 2 days ahead. Cover with cake dome or large bowl and chill. Let stand at room temperature 2 hours before serving.",
        "Sprinkle candied orange peel over top of cake. Cut into wedges and serve.",
        "Available seasonally at most supermarkets and year-round at specialty foods stores and from chefshop.com."
    ],
    "ingredients": [
        "3 cups all purpose flour",
        "2 teaspoons baking soda",
        "2 teaspoons baking powder",
        "1 teaspoon cinnamon",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon freshly grated nutmeg",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon ground cardamom",
        "1 15-ounce can pure pumpkin",
        "1 1/2 cups sugar",
        "1 1/4 cups vegetable oil",
        "4 large eggs",
        "2 teaspoons finely grated orange peel",
        "1 1-pound box powdered sugar, divided",
        "1/2 cup plus 1 tablespoon heavy whipping cream",
        "1 teaspoon vanilla extract",
        "1/4 teaspoon salt",
        "1 8-ounce package cream cheese, room temperature",
        "1/4 cup (1/2 stick) unsalted butter, room temperature",
        "Candied orange peel*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Cream Cheese",
        "Orange",
        "Spice",
        "Pumpkin",
        "Fall",
        "Family Reunion",
        "Cinnamon",
        "Potluck",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pumpkin Spice Layer Cake with Caramel and Cream Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-spice-layer-cake-with-caramel-and-cream-cheese-frosting-350492"
}
