{
    "directions": [
        "Combine all ingredients. Using on/ off turns, blend to fine crumbs. DO AHEAD: Can be made 1 day ahead. Store in airtight container at room temperature.",
        "Position oven rack in bottom third of oven; preheat to 350°F. Transfer crust to 9-inch-diameter glass pie dish. Fold edges under and crimp decoratively. Freeze crust 20 minutes.",
        "Line crust with nonstick foil and fill with dried beans or pie weights. Bake until crust is set, about 20 minutes. Gently remove foil and beans. Return crust to oven and bake until partially cooked and golden brown around edges, pressing down on crust with back of spoon if bubbles form, about 15 minutes. Cool crust on rack. Maintain oven temperature.",
        "Whisk brown sugar, eggs, sea salt, cinnamon, ginger, and cloves in medium bowl. Add pumpkin and cream and whisk until well blended and smooth.",
        "Pour filling into crust. Bake pie until filling is firm, covering crust with foil collar if browning too quickly, about 30 minutes.",
        "Sprinkle topping evenly over top of pie. Reduce oven temperature to 325°F; continue to bake pie until filling is set and slightly puffed in center, about 15 minutes longer. Transfer pie to rack and cool completely. DO AHEAD: Can be made 1 day ahead. Tent with foil and chill. Let stand at room temperature 1 hour before serving."
    ],
    "ingredients": [
        "1/2 cup walnut pieces",
        "1/4 cup (packed) golden brown sugar",
        "1/2 teaspoon ground cinnamon",
        "Pinch of fine sea salt",
        "1 12-inch round Pie Crust",
        "1 cup (packed) golden brown sugar",
        "2 large eggs",
        "1/2 teaspoon fine sea salt",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon ground cloves",
        "1 cup canned pure pumpkin",
        "1 cup heavy whipping cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ginger",
        "Dessert",
        "Christmas",
        "Thanksgiving",
        "High Fiber",
        "Walnut",
        "Pumpkin",
        "Fall",
        "Family Reunion",
        "Cinnamon",
        "Clove",
        "Christmas Eve",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pumpkin Pie with Brown Sugar-Walnut Topping",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-pie-with-brown-sugar-walnut-topping-355849"
}
