{
    "directions": [
        "Set rack in the middle of the oven, and preheat oven to 375 degrees F (190 degrees C). Lightly oil a 9 inch pie plate. Set aside.",
        "Spread nuts over a baking pan.  Toast for 7 to 10 minutes, or until the smell of nuts fills the kitchen. Set aside 16 pecan halves for garnish.",
        "Combine oats, flour, remaining pecans, 1/2 teaspoon cinnamon, and a pinch of salt in a food processor bowl. Pulse until mixture becomes a coarse meal. Transfer to a mixing bowl.  Whisk together oil and 3 tablespoons maple syrup, and mix into dry ingredients to form a soft dough. Press mixture into prepared pie plate. Crimp edges. Bake for 10 minutes, and set aside to cool.",
        "Blend soymilk and arrowroot in the food processor until the arrowroot is completely dissolved and the mixture is smooth, about 15 seconds. Add pumpkin, 1/2 cup maple syrup, ginger, 1 1/2 teaspoons cinnamon, 1/2 teaspoon salt, nutmeg, and cloves; process until thoroughly blended. Pour filling into baked crust, and smooth the top with a spatula.",
        "Bake for about 35 minutes, or until the crust is lightly browned and the outside inch of the filling is set. Don't worry if the center is still soft; it firms up as the pie cools.  Transfer pie to a wire the rack. Gently press toasted pecan halves into hot filling in 2 concentric circles. Cool to room temperature, and then chill until set, about 3 hours.  Serve chilled or at room temperature."
    ],
    "ingredients": [
        "3/4 cup pecan halves",
        "3/4 cup rolled oats",
        "3/4 cup whole wheat pastry flour",
        "1/2 teaspoon ground cinnamon",
        "1 pinch salt",
        "1/4 cup vegetable oil",
        "3 tablespoons real maple syrup",
        "1 cup soy milk",
        "1/4 cup arrowroot powder",
        "1 (15 ounce) can pumpkin puree",
        "1/2 cup real maple syrup",
        "1 tablespoon grated fresh ginger",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon salt",
        "1/4 teaspoon freshly grated nutmeg",
        "1/8 teaspoon ground cloves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Tart With Pecan Crust",
    "url": "http://allrecipes.com/recipe/13976/pumpkin-tart-with-pecan-crust/"
}
