{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C). Line a 9-inch springform pan with aluminum foil, pulling the edges of the foil up the inside of the pan and folding over the edge of the pan halfway down the outside.",
        "Mix graham cracker crumbs, brown sugar, and 1/2 teaspoon cinnamon together in a bowl. Add butter and stir until mixture is evenly coated with butter and crumbly. Press crumb mixture into the bottom and 2/3 of the way up the sides of the prepared springform pan.",
        "Bake in the preheated oven until lightly browned, about 5 minutes. Remove crust from oven, keeping the oven at 325 degrees F (165 degrees C).",
        "Beat cream cheese, white sugar, 1 tablespoon flour, and vanilla extract together in a bowl using an electric mixer until smooth. Beat eggs into cream cheese mixture, 1 egg at a time, beating until each egg is incorporated before adding the next. Fold sour cream into cream cheese mixture until batter is smooth.",
        "Remove 1 1/2 cups batter from bowl and spread onto the crust.",
        "Stir pumpkin puree, 1 tablespoon flour, 1/2 teaspoon cinnamon, nutmeg, and cloves into the remaining batter until smooth; gently spread over the batter on the crust. Wrap the bottom of the springform pan with aluminum foil and place in a 9x13-inch baking dish. Pour water into the baking dish to about a 1-inch depth.",
        "Bake in the preheated oven until cheesecake is set in the middle, about 1 hour. Turn off oven, prop the oven door open, and let cheesecake sit in the oven for 1 hour more. Refrigerate cheesecake until completely cooled, at least 4 hours."
    ],
    "ingredients": [
        "Crust:",
        "1 1/2 cups graham cracker crumbs",
        "3 tablespoons light brown sugar",
        "1/2 teaspoon ground cinnamon",
        "5 tablespoons butter, melted",
        "Filling:",
        "3 (8 ounce) packages cream cheese, at room temperature",
        "1 cup white sugar",
        "2 tablespoons all-purpose flour, divided (optional)",
        "1 teaspoon vanilla extract",
        "3 eggs, at room temperature",
        "1/4 cup sour cream",
        "1 cup pumpkin puree",
        "1/2 teaspoon ground cinnamon",
        "1/8 teaspoon nutmeg",
        "1/8 teaspoon ground cloves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Cheesecake (Double-Layer)",
    "url": "http://allrecipes.com/recipe/238111/pumpkin-cheesecake-double-layer/"
}
