{
    "directions": [
        "Preheat the oven to 325 degrees F.",
        "For the crust: Here's a super-easy no-fuss way to make this crust. Break the graham crackers into a food processor with the sugar. Pulse until the crumbs resemble fine meal. Pour the crumbs into a 9-inch springform pan. Pour the melted butter over the mixture, bring together with your fingers and press into the bottom of the pan.",
        "Cook's Note: Feel free to experiment with other graham crackers or cookies. Swap cinnamon or chocolate graham crackers for the original graham crackers for a tasty twist.",
        "For the cheesecake: In a stand mixer with the paddle attachment, beat the cream cheese on high speed until fluffy. Reduce the speed and, with the mixer running, add the eggs. Increase the speed to incorporate the eggs. Add in the pumpkin puree, sweetened condensed milk and maple syrup. Next, add in the cinnamon, nutmeg and salt. Beat the mixture for awhile; this will make the cheesecake light and fluffy. Pour the pumpkin mixture into the prepared crust. Tap the pan lightly on the work surface to remove any air pockets.",
        "Bake until the center appears nearly set, but jiggles a little when shaken, 1 hour and 15 minutes. Cool for 1 hour. Cover and chill at least 4 hours, or overnight.",
        "For the glaze: In a medium saucepan, combine the cream and maple syrup and bring to a boil. Boil until slightly thickened, 25 minutes, stirring occasionally. Stir in the pecan pieces. Cover and chill. Stir together before serving.",
        "To serve: Spoon the maple pecan glaze over the cheesecake."
    ],
    "ingredients": [
        "10 graham crackers, finely ground (1 1/3 cups crumbs)",
        "1/4 cup sugar",
        "5 tablespoons butter, melted",
        "3 (8-ounce) packages cream cheese, at room temperature",
        "3 large eggs, at room temperature for 30 minutes",
        "1 (15-ounce) can pure pumpkin puree (not pumpkin pie filling)",
        "1 (14-ounce) can sweetened condensed milk",
        "3 tablespoons pure grade B maple syrup",
        "2 teaspoons ground cinnamon",
        "1 teaspoon ground nutmeg",
        "1/2 teaspoon fine sea salt",
        "1 cup heavy cream",
        "2/3 cup pure grade B maple syrup",
        "3/4 cup pecan pieces"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pumpkin Cheesecake",
        "Pumpkin",
        "Vegetable",
        "Thanksgiving Desserts",
        "Dessert",
        "Holiday",
        "Thanksgiving",
        "Baking",
        "Nut Recipes"
    ],
    "title": "Pumpkin Maple Pecan Cheesecake",
    "url": "http://www.foodnetwork.com/recipes/anne-thornton/pumpkin-maple-pecan-cheesecake-recipe2"
}
