{
    "directions": [
        "Finely chop cilantro. In a sealable plastic bag lightly crush pumpkin seeds with a rolling pin. In a shallow dish lightly beat eggs. Have flour and pumpkin seeds ready in 2 other separate shallow dishes. With tweezers remove fine bones from fillets and season trout with salt and pepper. Dredge flesh side of 1 fillet in flour, shaking off excess, and dip flesh side in eggs, letting excess drip off. Coat fillet with pumpkin seeds and transfer, seed side up, to a plate. Coat remaining fillets in same manner.",
        "In a 12-inch nonstick skillet heat oil over moderate heat until hot but not smoking and cook fillets, seed sides down, until golden, about 3 minutes. Turn fillets carefully with a spatula and cook over low heat until just cooked through, about 3 minutes more. Transfer fillets with a spatula to a heated platter and keep warm while making sauce.",
        "In a small heavy saucepan boil lime juice and wine until reduced by half, about 2 minutes. Cut butter into pieces and add, 1 piece at a time, whisking until incorporated and sauce is smooth (it should not get hot enough to separate). Remove pan from heat. Add cilantro and season with salt.",
        "Spoon sauce over trout fillets."
    ],
    "ingredients": [
        "1 cup loosely packed fresh cilantro sprigs",
        "3/4 cup hulled green pumpkin seeds* (about 1/4 pound)",
        "2 large eggs",
        "1/2 cup all-purpose flour",
        "four 3- to 4-ounce trout fillets with skin",
        "2 tablespoons olive oil",
        "2 tablespoons fresh lime juice",
        "1/2 cup dry white wine",
        "3/4 stick (6 tablespoons) cold unsalted butter",
        "*available at natural foods stores"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Lime",
        "Trout",
        "White Wine",
        "Winter",
        "Pan-Fry",
        "Healthy",
        "Cilantro",
        "Seed",
        "Gourmet"
    ],
    "title": "Pumpkin-Seed-Crusted Trout",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-seed-crusted-trout-15820"
}
