{
    "directions": [
        "Preheat oven to 350°F. Finely grind graham crackers in processor. Mix in sugar. Add butter; mix to blend. Press onto bottom and up sides of 10-inch-diameter glass pie dish. Bake until light brown around edges, about 12 minutes. Cool completely.",
        "Whisk first 9 ingredients in medium bowl. Slightly soften ice cream in microwave in 10-second intervals. Measure 1 cup ice cream; cover and freeze (reserve for another use). Spoon remaining ice cream into large bowl. Working quickly, add pumpkin mixture and fold just until swirled into ice cream (do not blend completely). If ice cream begins to melt, freeze until almost firm. Spoon ice cream filling into cooled crust, cover with plastic, and freeze until firm, at least 6 hours. DO AHEAD: Can be made 2 days ahead. Keep frozen.",
        "Line baking sheet with parchment paper; spray with nonstick spray. Stir chocolate in bowl set over saucepan of simmering water until melted and smooth. Pour onto baking sheet. Using offset spatula, spread chocolate in even layer into 12x9-inch rectangle. Sprinkle with nuts. Place in freezer until hard, at least 30 minutes. Invert onto work surface. Peel off paper. Coarsely chop. Place DO AHEAD: Chocolate-almond bark can be made 2 days ahead. Keep frozen.",
        "Bring brown sugar, corn syrup, 3 tablespoons water, and butter to boil in heavy medium saucepan, stirring until butter melts and sugar dissolves. Reduce heat to medium and boil until dark brown, stirring occasionally, about 5 minutes. Carefully stir in 1/2 cup cream, vanilla, and salt (mixture will bubble vigorously). Boil 1 minute longer. Cool slightly. DO AHEAD: Sauce can be made 2 days ahead. Cover and chill. Rewarm before serving.",
        "Using electric mixer, beat 1 1/2 cups cream and 2 tablespoons sugar in medium bowl until peaks form. Spoon decoratively over pie. Sprinkle chocolate-almond bark over. Cut pie into wedges and serve, passing warm sauce alongside."
    ],
    "ingredients": [
        "12 whole graham crackers (about 7 ounces)",
        "1/4 cup sugar",
        "7 tablespoons unsalted butter, melted",
        "1 cup canned pure pumpkin",
        "3/4 cup (packed) golden brown sugar",
        "1/4 cup heavy whipping cream",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon salt",
        "2 quarts premium vanilla ice cream",
        "Nonstick vegetable oil spray",
        "6 ounces bittersweet or semisweet chocolate, chopped",
        "1/2 cup slivered almonds, toasted, coarsely chopped",
        "1 cup (packed) golden brown sugar",
        "1/4 cup dark corn syrup",
        "3 tablespoons water",
        "3 tablespoons unsalted butter",
        "2 cups chilled heavy whipping cream, divided",
        "1 teaspoon vanilla extract",
        "1/8 teaspoon salt",
        "2 tablespoons sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Food Processor",
        "Microwave",
        "Chocolate",
        "Dessert",
        "Bake",
        "Christmas",
        "Thanksgiving",
        "Kid-Friendly",
        "Frozen Dessert",
        "Almond",
        "Spice",
        "Pumpkin",
        "Fall",
        "Family Reunion",
        "Cinnamon",
        "Christmas Eve",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pumpkin Ice Cream Pie with Chocolate-Almond Bark and Toffee Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-ice-cream-pie-with-chocolate-almond-bark-and-toffee-sauce-350477"
}
