{
    "directions": [
        "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil.  Cut the poblano pepper in half from top to bottom; remove the stem and seeds, and place the pepper, cut side down, onto the prepared baking sheet.  Cook under the preheated broiler until the skin of the pepper has blackened and blistered, about 5 minutes. Place the blackened pepper into a bowl, and tightly seal with plastic wrap. Allow the pepper to steam as it cools, about 10 minutes. Once cool, peel the skin from the pepper.",
        "Melt the butter in a large sauce pan over medium-low heat, and cook and stir the onions until translucent, 3 to 5 minutes. Stir in the garlic, cook and stir for another 2 to 3 minutes until cooked but not browned, and add the zucchini, corn, and carrots. Cook and stir the vegetables until tender, about 15 minutes. Pour in the tomato puree and water, and add the epazote, chicken bouillon cubes, and peeled poblano pepper. Bring the mixture to a boil, reduce heat, and simmer for about 10 minutes.",
        "Working in batches if necessary, pour the soup into a blender and blend until smooth. Pour the blended soup into a large saucepan, and bring to a simmer over medium-low heat. Stir in the chopped pumpkin flowers, and simmer until cooked and tender, 5 to 10 minutes. Stir in the cream, mix well, and add salt and pepper to taste."
    ],
    "ingredients": [
        "1 poblano chile, or more to taste",
        "1 cup butter",
        "2 large onions, minced",
        "1 head garlic, minced, or to taste",
        "4 cups diced zucchini",
        "2 cups fresh corn kernels",
        "1 cup diced carrots",
        "2 cups tomato puree",
        "6 cups water",
        "1 sprig epazote (found in Hispanic markets)",
        "4 cubes chicken bouillon",
        "4 cups fresh pumpkin flowers, washed and coarsely chopped",
        "1 1/2 cups heavy cream",
        "salt and pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Flower Soup (Sopa de Flor de Calabaza)",
    "url": "http://allrecipes.com/recipe/206411/pumpkin-flower-soup-sopa-de-flor-de/"
}
