{
    "directions": [
        "Place ginger in processor and process ;until minced. Add flour, sugar, cloves and salt; process to combine. Using on/off turns, cut in butter and shortening until mixture resembles coarse meal. Mix yolk and 2 tablespoons water in small bowl. Add yolk mixture to flour and butter mixture; process just until mixture forms moist clumps. If dough is too dry, blend in more water by teaspoonfuls. Gather dough into ball; flatten into disk. Wrap in plastic; chill 1 hour. (Can be made 1 day ahead. Keep chilled. Soften dough slightly at room temperature before rolling.)",
        "Preheat oven to 350°F. Roll out dough on floured surface to 12-inch-diameter round. Transfer dough to 9-inch-diameter glass pie dish. Trim overhang to 1 inch. Fold edges under crust. Crimp decoratively, forming high-standing rim (about 1/2 inch above rim of dish). Freeze crust for 15 minutes. Line crust with foil and then fill with dried beans or pie weights. Bake crust 10 minutes. Remove foil and beans and bake until crust is set and pale golden, about 10 minutes. Transfer crust to rack; cool completely.",
        "Whisk all ingredients in large bowl until combined. Pour into pie crust. Bake until skin begins to form on filling and filling begins to set, about 50 minutes. Remove from oven. Let pie stand 10 minutes to set slightly. Maintain oven temperature.",
        "Mix first 5 ingredients in medium bowl. Rub in butter with fingertips until mixture begins to form small clumps. Sprinkle topping over pie. Bake until pie is set and streusel is golden brown, about 25 minutes. Transfer to rack and cool completely."
    ],
    "ingredients": [
        "2 tablespoons chopped peeled fresh ginger",
        "1 1/3 cups all purpose flour",
        "2 tablespoons sugar",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon salt",
        "1/4 cup (1/2 stick) chilled unsalted butter, cut into small pieces",
        "1/4 cup chilled solid vegetable shortening, cut into small pieces",
        "1 large egg yolk",
        "2 tablespoons (or more) ice water",
        "1 16-ounce can solid pack pumpkin",
        "1 1/2 cups whipping cream",
        "3 large eggs",
        "1/2 cup sugar",
        "1/4 cup packed golden brown sugar",
        "1 1/2 teaspoons ground cinnamon",
        "1/4 teaspoons ground allspice",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon salt",
        "1 cup all purpose flour",
        "1/2 cup packed golden brown sugar",
        "1/2 cup coarsely chopped walnuts (about 2 1/2 ounces)",
        "1/4 cup finely chipped crystallized ginger",
        "1 1/2 teaspoons ground ginger",
        "1/2 cup (1 stick) unsalted butter, cut into small pieces, room temperature"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Fruit",
        "Ginger",
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Walnut",
        "Spice",
        "Pumpkin",
        "Fall",
        "Clove",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pumpkin Pie with Ginger Streusel",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-pie-with-ginger-streusel-818"
}
