{
    "directions": [
        "Line a 9x13 inch pan with plastic wrap and spray it lightly and uniformly with cooking spray. Set aside. Pour the 1/2 cup cold water into the bowl of a stand mixer and sprinkle the gelatin on top; set aside for 10 minutes.",
        "Combine the white sugar, corn syrup, and 1/4 cup water in a saucepan. Bring to a boil over medium-high heat. Do not stir once the sugar syrup begins to boil. Heat to 250 degrees F (120 degrees C), or until a small amount of syrup dropped into cold water forms a rigid ball. Meanwhile, combine the pumpkin puree, cinnamon, ginger, nutmeg, and allspice. Mix well.",
        "Attach the mixing bowl to the stand mixer with the wire whip attachment and start the mixer on low speed. Carefully pour the boiling sugar syrup in a steady stream down the side of the mixing bowl. Increase the mixer to medium-high speed and add the salt. Mix until stiff, shiny, and white in color, about 5 to 12 minutes. Scrape down the sides of the bowl occasionally using a rubber spatula.",
        "Remove the bowl from the mixer and fold in the pumpkin mixture until combined. Add food coloring, if desired, for a deeper orange color. Return the bowl to the mixer and beat on medium-high speed about 3 minutes longer. Dip a spatula into the marshmallow mixture: the mixture should form a more-or-less continuous ribbon off the spatula into the bowl.",
        "Pour the mixture into the prepared pan so that it is an even depth. Let the mixture set at room temperature for at least 8 hours or overnight.",
        "Sift the cocoa powder, cornstarch, and confectioners' sugar into a pie plate. When the marshmallows have set, turn them onto a work surface and cut them into squares or shapes as desired. Roll each marshmallow in the cocoa mixture to coat all sides (reserve the cocoa mixture for re-dredging if needed). Marshmallows are best served fresh, but they can be stored in an airtight container (unrefrigerated) for about a week or in the freezer for a month. If you store the marshmallows, re-roll them in the cocoa mixture before serving."
    ],
    "ingredients": [
        "3 (.25 ounce) envelopes unflavored gelatin",
        "1/2 cup cold water",
        "2 cups white sugar",
        "2/3 cup light corn syrup",
        "1/4 cup water",
        "1/2 cup pumpkin puree",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground ginger",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground allspice",
        "1/4 teaspoon salt",
        "orange food coloring (optional)",
        "1/4 cup unsweetened cocoa powder",
        "1/4 cup cornstarch",
        "1/4 cup confectioners' sugar (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Marshmallows",
    "url": "http://allrecipes.com/recipe/180711/pumpkin-marshmallows/"
}
