{
    "directions": [
        "Preheat the oven to 350 degrees F. Lightly butter a 12-by-8-inch baking pan.",
        "In a large bowl, combine the pumpkin puree, condensed milk, regular milk, cinnamon, vanilla, eggs and 1 tablespoon of the melted butter and whisk until combined. Grab a slice of bread and submerge it in the pumpkin custard. Soak with enough custard to cover both sides of the bread, then transfer it to the prepared baking pan. Repeat the process until the bottom of the pan is covered.",
        "In a stand mixer with the whisk attachment, mix the cream cheese and powdered sugar until combined and the cream cheese is clump free; the mixture should be soft and spreadable.",
        "Spread enough of the cream cheese mixture on top of the bread in the pan to cover all the slices. Soak the remaining bread slices in the remaining custard. Layer them on top of the cream cheese mixture. Combine the pecans, brown sugar and remaining 4 tablespoons melted butter in a bowl. Add a pinch of salt. Top the casserole with the pecan mixture.",
        "Bake until the top is golden, 40 to 45 minutes. Serve with a drizzle of maple syrup."
    ],
    "ingredients": [
        "5 tablespoons unsalted butter, melted, plus more for buttering the pan",
        "One and one-half 15-ounce cans pumpkin puree",
        "One 14-ounce can sweetened condensed milk",
        "1 cup milk",
        "1 teaspoon ground cinnamon",
        "1 teaspoon vanilla extract",
        "4 large eggs",
        "1 loaf brioche bread, sliced",
        "Two 8-ounce packages cream cheese, at room temperature",
        "1 cup powdered sugar",
        "1 cup chopped pecans",
        "1/2 cup packed brown sugar",
        "Pinch of salt",
        "Maple syrup, for drizzling"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Casserole",
        "French Toast Recipes",
        "Pumpkin",
        "Vegetable",
        "Main Dish Recipes",
        "Brunch"
    ],
    "title": "Pumpkin French Toast Casserole",
    "url": "http://www.foodnetwork.com/recipes/marcela-valladolid/pumpkin-french-toast-casserole"
}
