{
    "directions": [
        "Preheat oven to 400 degrees F. Unroll piecrust on parchment paper-lined baking sheet. Sprinkle with some granulated sugar and pumpkin pie spice. Bake about 12 minutes or until crust is browned. Cool on wire rack; break into bite-size pieces.",
        "Combine the VOSKOS(R) Nonfat Honey Greek Yogurt, the 1/2 cup granulated sugar, the 1/2 cup brown sugar, the pumpkin, vanilla, and the 1/2 teaspoon pumpkin pie spice in a large bowl.",
        "Freeze the yogurt mixture in a 1 1/2- to 2-quart ice cream maker according to the manufacturers directions, stirring in broken piecrust pieces at end to just mix through. Transfer to an airtight container and freeze for 2 to 4 hours before serving. Let stand at room temperature for 5 to 15 minutes before serving (if freezing longer, it may need to stand as long as 30 minutes at room temperature). Serve topped with warm Caramel-Pecan Sauce (see below) and additional piecrust (if desired).",
        "Caramel-Pecan Sauce: Combine butter, the 3/4 cup brown sugar, and whipping cream in a large saucepan over medium heat, stirring until smooth. Bring to a boil. Boil at a moderately steady rate for 3 minutes without stirring. Remove from heat and transfer to a heat-proof bowl. Let caramel cool. Stir in pecans. Serve warm or refrigerate for up to 1 week. Reheat before serving."
    ],
    "ingredients": [
        "1 (9 inch) ready-to-use refrigerated pie crust",
        "Granulated sugar",
        "Pumpkin pie spice (optional)",
        "5 (5.3 ounce) containers VOSKOS® Nonfat Honey Greek Yogurt",
        "1/2 cup granulated sugar",
        "1/2 cup packed brown sugar",
        "1/2 cup canned pumpkin",
        "2 teaspoons vanilla",
        "1/2 teaspoon pumpkin pie spice",
        "Caramel-Pecan Sauce:",
        "3/4 cup butter",
        "3/4 cup packed brown sugar",
        "1/2 cup whipping cream",
        "1 cup coarsely chopped pecans, toasted*"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Pie Frozen Yogurt",
    "url": "http://allrecipes.com/recipe/237941/pumpkin-pie-frozen-yogurt/"
}
