{
    "directions": [
        "In a food processor grind gingersnaps, pecans, and sugar fine and add butter, blending until combined well. Press mixture onto bottom and up side of a 9-inch (1-quart) glass pie plate. Bake crust in middle of oven 15 minutes, or until crisp and golden around edge, and cool on rack.",
        "In a small bowl sprinkle gelatin over brandy, rum, or water and let stand.",
        "In a heavy saucepan whisk together milk, brown sugar, yolks, pumpkin, spices, and salt and cook over moderately low heat, whisking, until mixture registers 160°F. on a candy thermometer. Remove pan from heat and immediately add gelatin mixture, whisking until gelatin is completely dissolved.",
        "Transfer filling to a metal bowl set in a larger bowl of ice and cold water and cool, stirring constantly, just until the consistency of raw egg white. Remove bowl from ice water.",
        "In a bowl with an electric mixer beat cream until it holds stiff peaks and whisk about one fourth into filling to lighten. Fold in remaining cream gently but thoroughly and pour filling into crust. Chill pie until set, at least 3 hours and up to 24, covered with plastic wrap after 1 hour.",
        "Top each serving with whipped cream and garnish with nuts."
    ],
    "ingredients": [
        "fourteen 2-inch gingersnaps (about 4 ounces)",
        "1 cup pecans (about 4 ounces)",
        "1/4 cup granulated sugar",
        "1/2 stick (1/4 cup) unsalted butter melted and cooled",
        "1 envelope (about 1 tablespoon) unflavored gelatin",
        "2 tablespoons brandy rum or water",
        "1 cup milk",
        "3/4 cup firmly packed light brown sugar",
        "4 large egg yolks",
        "1 1/4 cups canned solid-pack pumpkin",
        "1 teaspoon cinnamon",
        "1/2 teaspoon ground ginger",
        "1/4 teaspoon freshly grated nutmeg",
        "1/4 teaspoon salt",
        "3/4 cup heavy cream",
        "Accompaniment: whipped cream",
        "Garnish: chopped toasted pecans",
        "Preheat oven to 350°F."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Ginger",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Pecan",
        "Brandy",
        "Pumpkin",
        "Gourmet",
        "Kidney Friendly",
        "Peanut Free"
    ],
    "title": "Pumpkin Chiffon Pie with Gingersnap Pecan Crust",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-chiffon-pie-with-gingersnap-pecan-crust-10807"
}
