{
    "directions": [
        "Place butter in the mixing bowl of a stand mixer. Pour hot milk over butter; stir occasionally until butter melts. Whisk pumpkin puree, 3/4 cup white sugar, eggs, and egg yolk into milk mixture.",
        "In separate bowl, combine flour, yeast, salt, ginger, cinnamon, and allspice. Using the paddle attachment, mix in about 4 cups of flour mixture on low speed. Scrape down sides of bowl and underneath paddle. Add remaining flour and mix, scraping down sides, on low speed until fully combined. Dough will be very wet, almost cookie-dough consistency; don't worry, it will absorb moisture as it sits.",
        "Transfer dough to a greased bowl. Cover bowl with plastic wrap lightly coated with cooking spray. Refrigerate for at least 5 hours or overnight.",
        "Combine canned cranberry sauce with 1/3 cup water in a small saucepan. Break the sauce up slightly with a spoon. Heat, covered, over medium-low heat, stirring occasionally, until cranberry sauce melts, about 25 minutes. Pour into a bowl and refrigerate.",
        "Place chilled dough on well-floured work surface. Shape it into a ball, divide the dough in half, and return half the dough to the greased bowl. Cover with greased plastic wrap and refrigerate. Roll out remaining dough half, flouring surface as needed, to 1/4-inch thickness. Cut out dough rounds with a 3-inch cutter.",
        "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper or a silicone liner. This will prevent the dough from sticking and tearing.",
        "Transfer dough rounds to prepared baking sheet in pairs (one will be the top half, the other the bottom half of the doughnut). Gather up remaining dough scraps and add them to the dough stored in the refrigerator.",
        "Whisk egg white with 1 teaspoon water. Brush the rounds that will be the bottom halves of the doughnuts with the beaten egg white.",
        "Spoon 1 teaspoon cranberry jelly into center of each bottom round; arrange second round on top and press edges to seal. Let doughnuts rest 20 minutes.",
        "Working in batches, fry doughnuts until well browned, about 1 1/2 minutes per side. Drain doughnuts on paper towels. Pour 1/2 cup white sugar into a bag or large bowl; toss doughnuts in sugar to coat. Dust doughnuts with confectioners' sugar before serving. Repeat with remaining dough."
    ],
    "ingredients": [
        "Doughnut Dough:",
        "1/2 cup unsalted butter",
        "3/4 cup boiling milk",
        "1 cup canned pumpkin puree",
        "3/4 cup white sugar",
        "2 eggs",
        "1 egg yolk",
        "5 cups unbleached all-purpose flour",
        "1 (.25 ounce) package instant yeast",
        "1 1/4 teaspoons salt",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/8 teaspoon ground allspice",
        "Filling:",
        "1 (14 ounce) can jellied cranberry sauce",
        "1/3 cup water",
        "1 quart vegetable oil for frying",
        "1 egg white",
        "1 teaspoon water",
        "1/2 cup white sugar, or as needed",
        "1/4 cup confectioners' sugar, for dusting"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Sufganiot with Cranberry Jelly",
    "url": "http://allrecipes.com/recipe/235467/pumpkin-sufganiot-with-cranberry-jell/"
}
