{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Mix flour, brown sugar, baking powder, cinnamon, baking soda, salt, ground ginger, and ground cloves together in a bowl. Cut unsalted butter chunks into flour mixture with a pastry blender until mixture resembles coarse crumbs; make a well in the center.",
        "Pour pumpkin puree, yogurt, and 1 teaspoon vanilla extract into the well in flour mixture; stir with a wooden spoon until a soft dough forms. Mix pecans into dough.",
        "Turn dough out onto a lightly floured surface and pat into two equal-size circles. Cut each circle into 8 wedges; transfer to a baking stone or baking sheet lined with parchment paper.",
        "Bake scones in the preheated oven until firm to the touch and lightly browned, 12 to 15 minutes.",
        "Heat butter in a skillet over medium heat until butter is foaming and nut-brown in color, 3 to 5 minutes.",
        "Beat brown butter, confectioners' sugar, milk, and 1/2 teaspoon vanilla with an electric mixer on medium-high speed until sugar is dissolved and glaze is shiny, 3 to 4 minutes, adding more milk as necessary. Drizzle glaze over cooled scones."
    ],
    "ingredients": [
        "3 1/4 cups all-purpose flour",
        "1/3 cup brown sugar",
        "2 1/2 teaspoons baking powder",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "1/2 teaspoon ground ginger",
        "1/8 pinch ground cloves",
        "3/4 cup cold unsalted butter, cut into chunks",
        "1 (15 ounce) can pumpkin puree",
        "2/3 cup plain yogurt",
        "1 teaspoon vanilla extract",
        "3/4 cup chopped pecans",
        "1/2 cup butter",
        "3/4 cup confectioners' sugar",
        "1 1/2 tablespoons milk, or more as needed",
        "1/2 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Scones with Brown Butter Glaze",
    "url": "http://allrecipes.com/recipe/234458/pumpkin-scones-with-brown-butter-glaz/"
}
