{
    "directions": [
        "To make the Apple-Cranberry Relish: Peel, core, and chop the apples into 1/4-inch pieces. Combine the chopped apples, 3 tablespoons butter, 1/2 teaspoon cinnamon, vanilla, orange juice, and 1/2 cup maple syrup in a saucepan. Cook over medium heat for about 3 minutes. Add the cranberries and cook 5-10 minutes until apples are tender and cranberries have softened.",
        "Remove apples and cranberries using a slotted spoon and set aside in a bowl. Simmer the apple syrup mixture until thick, about 8 minutes, stirring frequently. Remove from heat and stir in the remaining 1/4 cup maple syrup. Add the pecans and orange zest (if desired) to the apple-cranberry mixture.",
        "Preheat waffle iron according to manufacturer's instructions.",
        "Mix the eggs, buttermilk, canola oil, and pumpkin puree in a bowl, beating well. Combine the pastry flour, sugar, baking powder, baking soda, cinnamon, nutmeg, cloves, and ginger. Stir the flour mixture into the pumpkin mixture and mix until thoroughly combined. The batter should be pourable; add a tablespoon more buttermilk if necessary.",
        "Cook waffles according to manufacturer's instructions. Serve hot, topped with butter and apple-cranberry relish, with spiced apple syrup on the side."
    ],
    "image": "https://images.media-allrecipes.com/userphotos/250x250/505614.jpg",
    "ingredients": [
        "APPLE-CRANBERRY RELISH",
        "3 large Granny Smith apples",
        "3 tablespoons butter",
        "1/4 teaspoon ground ginger",
        "1/2 teaspoon ground cinnamon",
        "1 teaspoon vanilla extract",
        "1/4 cup orange juice",
        "1 teaspoon grated orange zest (optional)",
        "3/4 cup maple syrup, divided",
        "1/2 cup dried cranberries",
        "1/2 cup chopped pecans",
        "butter (optional)",
        "PUMPKIN WAFFLES",
        "3 eggs",
        "1 1/2 cups low-fat buttermilk",
        "1/2 cup canola oil",
        "1/2 cup pumpkin puree",
        "1 1/2 cups whole wheat pastry flour",
        "2 tablespoons white sugar",
        "2 teaspoons baking powder",
        "3/4 teaspoon baking soda",
        "1 teaspoon ground cinnamon",
        "1/4 teaspoon ground nutmeg",
        "1/4 teaspoon ground cloves",
        "1/2 cup butter, for serving"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Waffles with Apple-Cranberry Relish",
    "url": "http://allrecipes.com/recipe/130741/pumpkin-waffles-with-apple-cranberry/"
}