{
    "directions": [
        "Whisk milk and 2 eggs together in the bowl of a stand mixer; add pumpkin puree and honey and continue to stir until smooth.",
        "Add white whole wheat flour, bread flour, yeast, salt, and white pepper to the pumpkin mixture. Attach the dough hook to the stand mixture and mix on low speed with the dough hook for 5 minutes, using a bowl scraper or stiff spatula to scrape down the sides of the bowl once or twice. Increase speed to medium-low. Add butter one piece at a time, mixing until each piece is completely incorporated before adding the next.",
        "Transfer the dough to a greased bowl. Cover bowl with plastic wrap and let the dough rise at room temperature until dough has doubled, 1 to 1 1/2 hours.",
        "While the dough rises, draw designs with permanent marker onto a flexible plastic lid. Cut shapes with a sharp paring knife or X-ACTO® knife. Wash the lids with warm soapy water to remove any remaining ink.",
        "Punch the dough down and fold it over to expel air bubbles. Cover the bowl with plastic wrap and refrigerate until approximately 2 hours before you wish to serve the rolls.",
        "Remove dough from the refrigerator and scrape from bowl onto a flour-dusted work surface. Divide the dough into 12 evenly sized pieces and shape into tight balls. Line 2 baking sheets with baking parchment; arrange balls seam-side down onto prepared sheets. (You can also freeze the dough at this point. Refer to footnotes for tips for freezing.)",
        "Cover rolls with greased plastic wrap and let sit at room temperature for 30 minutes.",
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Beat 1 egg and water together in a small bowl using a whisk.",
        "Grease your hands and use them to gently flatten the dough balls into flat rounds, about 1/2 inch thick. Brush egg wash over the top of each round.",
        "Set a fine mesh strainer on a plate. Pour rye flour into the strainer. Place a stencil over one of the rounds. Sift rye flour onto the stencil. Carefully lift the stencil off the roll. Knock extra flour off stencil and onto the plate. Repeat with remaining rolls.",
        "Let dough rounds stand at room temperature until risen fully, about 10 minutes. Test for readiness by dabbing your index finger in flour and pressing it gently into the side of a roll, if the indentation springs back, let the dough rise until risen enough so another such indentation stays, about 5 minutes more.",
        "Bake rolls in preheated oven until tops are golden and bottoms are browned, 15 to 20 minutes."
    ],
    "ingredients": [
        "1 cup milk, room temperature",
        "2 eggs, room temperature",
        "1 cup pumpkin puree",
        "1 tablespoon honey",
        "1 1/2 cups white whole wheat flour (such as King Arthur®)",
        "3 1/2 cups bread flour",
        "1 (.25 ounce) package instant yeast",
        "1 1/2 teaspoons salt",
        "1/4 teaspoon freshly ground white pepper (optional)",
        "1/4 cup butter, room temperature",
        "1 egg",
        "1 tablespoon water",
        "Flexible plastic lids, for stencils",
        "1/4 cup light rye flour, or as needed (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Sandwich Rolls",
    "url": "http://allrecipes.com/recipe/240006/pumpkin-sandwich-rolls/"
}
