{
    "directions": [
        "In a medium metal bowl sprinkle gelatin over cold water to soften 1 minute. Whisk in yolks and sugar and set bowl over a saucepan of simmering water. Cook egg mixture, whisking constantly, until an instant-read thermometer inserted 2 inches into mixture registers 160°F. (Tilt bowl to facilitate measuring temperature.) Remove bowl from pan and with an electric mixer beat egg mixture until cool and thickened, about 5 minutes (mixture will be very sticky). Beat in pumpkin and spices. Chill pumpkin mixture, covered, until thickened and cool but not set, about 1 hour.",
        "In a bowl with cleaned beaters beat cream with vanilla until it just holds stiff peaks and fold into pumpkin mixture gently but thoroughly. Coarsely crumble 2 gingersnaps into each of 6 Martini glasses (or other 6- to 8-ounce stemmed glasses). Transfer mousse to a large pastry bag fitted with a large plain tip and pipe decoratively over cookies in glasses (or simply spoon mousse into glasses). Chill mousses, uncovered, until firm, about 3 hours, and up to 1 day (loosely cover after 3 hours).",
        "Just before serving, garnish mousses with remaining 6 whole gingersnaps."
    ],
    "ingredients": [
        "1 1/2 teaspoons unflavored gelatin (less than 1 envelope)",
        "1 1/2 tablespoons cold water",
        "3 large egg yolks",
        "3/4 cup sugar",
        "1 1/2 cups canned solid-pack pumpkin (slightly less than a 15-ounce can)",
        "3/4 teaspoon ground cinnamon",
        "1/4 teaspoon ground ginger",
        "1/8 teaspoon ground cloves",
        "1 1/2 cups well-chilled heavy cream",
        "1 1/2 teaspoons vanilla",
        "18 gingersnaps"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Dairy",
        "Fruit",
        "Dessert",
        "Thanksgiving",
        "Pumpkin",
        "Fall",
        "Chill",
        "Gourmet"
    ],
    "title": "Pumpkin Spice Mousse",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-spice-mousse-15746"
}
