{
    "directions": [
        "Roll out dough disk on lightly floured surface to 13-inch round. Transfer crust to 9-inch-diameter glass pie dish. Press crust evenly onto bottom and up sides of dish. Trim dough overhang to 1 inch. Fold overhang under, forming high-standing rim 3/4 inch above sides of dish. Crimp edges decoratively. Freeze crust until firm, about 1 hour. DO AHEAD: Can be made 3 days ahead. Keep frozen. Cover with plastic wrap after crust is firm.",
        "Melt butter in large nonstick skillet over medium heat. Add almonds, pecans, and pepitas; sauté until nuts brown slightly and pepitas begin to pop, about 2 minutes. Sprinkle brown sugar and salt over; stir until sugar melts and nuts are coated with glaze, 1 to 2 minutes. Remove skillet from heat. Stir in crystallized ginger. Cool topping in skillet. DO AHEAD: Can be made 1 day ahead. Cover and store airtight at room temperature.",
        "Position rack in center of oven and preheat to 375°F. Line frozen pie crust with foil; fill with dried beans or pie weights. Bake crust until sides are set, 20 to 25 minutes. Remove foil and beans. Bake just until crust is set and sides are pale golden, 5 to 7 minutes longer. Remove crust from oven. Maintain oven temperature.",
        "Combine pumpkin, both sugars, molasses, flour, cinnamon, ginger, cloves, and salt in medium bowl. Whisk until well blended. Whisk in eggs and egg yolk, then cream. Pour filling into warm crust. Sprinkle topping evenly around edge of filling, forming 11/2-inch border (some of topping may sink into filling). Bake pie 20 minutes. Remove pie from oven and wrap foil collar around edge of crust and topping to prevent pie from browning too quickly. Return pie to oven and continue to bake until crust is golden and filling is set in center (center may move very slightly when dish is gently shaken), 40 to 45 minutes. Transfer pie to rack and cool completely. DO AHEAD: Can be made 1 day ahead. Cover and chill."
    ],
    "ingredients": [
        "1 tablespoon unsalted butter",
        "1/4 cup sliced almonds",
        "1/4 cup chopped pecans",
        "2 tablespoons unsalted raw pepitas (pumpkin seeds)",
        "2 tablespoons (packed) golden brown sugar",
        "Large pinch of salt",
        "2 tablespoons slivered crystallized ginger",
        "1 15-ounce can pure pumpkin",
        "1/2 cup (packed) golden brown sugar",
        "1/2 cup sugar",
        "1 tablespoon mild-flavored (light) molasses",
        "1 tablespoon all purpose flour",
        "1 1/2 teaspoons ground cinnamon",
        "3/4 teaspoon ground ginger",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon salt",
        "2 large eggs",
        "1 large egg yolk",
        "1 1/4 cups heavy whipping cream",
        "Ingredient info: Pepitas can be found at many supermarkets, at specialty foods stores, and at Latin markets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ginger",
        "Dessert",
        "Bake",
        "Sauté",
        "Christmas",
        "Thanksgiving",
        "High Fiber",
        "Almond",
        "Pecan",
        "Pumpkin",
        "Fall",
        "Seed",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pumpkin Pie with Pepita Nut, and Ginger Topping",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-pie-with-pepita-nut-and-ginger-topping-361816"
}
