{
    "directions": [
        "Finely grind pumpkin seeds with 1/2 cup flour in processor. Add 1 1/2 cups flour and 1 teaspoon salt; process just to blend. Whisk 3/4 cup plus 2 tablespoons water, eggs, egg yolk, and 1 tablespoon pumpkin seed oil in large bowl. Stir in flour mixture.",
        "Bring large pot of salted water to boil. Working in batches, spoon batter into potato ricer or spaetzle maker. Slowly press batter into boiling water, shaking ricer occasionally to release spaetzle. Stir to prevent sticking, then simmer until cooked through and tender, 2 to 3 minutes. Using skimmer or large slotted spoon, transfer spaetzle to colander; rinse with cold water. Transfer to large bowl. do ahead Can be made 2 hours ahead. Let stand at room temperature. Bring large pot of salted water to boil. Working in batches, spoon batter into potato ricer or spaetzle maker. Slowly press batter into boiling water, shaking ricer occasionally to release spaetzle. Stir to prevent sticking, then simmer until cooked through and tender, 2 to 3 minutes. Using skimmer or large slotted spoon, transfer spaetzle to colander; rinse with cold water. Transfer to large bowl. do ahead Can be made 2 hours ahead. Let stand at room temperature.",
        "Melt butter in large skillet over medium heat. Add spaetzle; sprinkle lightly with nutmeg and stir until heated through, 2 to 3 minutes. Season with salt and pepper.",
        "Transfer spaetzle to large bowl. Drizzle pumpkin seed oil over and serve.",
        "Also known as pepitas; available at many supermarkets and at natural foods stores and Latin markets.",
        "** Available at specialty foods stores and from culinarydistrict.com."
    ],
    "ingredients": [
        "1/2 cup shelled raw pumpkin seeds*",
        "2 cups all purpose flour, divided",
        "1 teaspoon salt",
        "3/4 cup plus 2 tablespoons water",
        "2 large eggs",
        "1 large egg yolk",
        "1 tablespoon pumpkin seed oil** plus additional for drizzling",
        "1/4 cup (1/2 stick) butter",
        "Ground nutmeg",
        "Special Equipment: Potato ricer or spaetzle maker"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Egg",
        "Side",
        "Dinner",
        "Seed",
        "Boil",
        "Butter",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Pumpkin Seed Spaetzle",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-seed-spaetzle-356794"
}
