{
    "directions": [
        "In a bowl combine the cracker crumbs, the pecans, and the sugars, stir in the butter, and press the mixture into the bottom and 1/2 inch up the side of a buttered 9-inch springform pan. Chill the crust for 1 hour.",
        "In a bowl whisk together the pumpkin, the egg, the cinnamon, the nutmeg, the ginger, the salt, and the brown sugar. In a large bowl with an electric mixer cream together the cream cheese and the granulated sugar, beat in the cream, the cornstarch, the vanilla, the bourbon liqueur, and the pumpkin mixture, and beat the filling until it is smooth.",
        "Pour the filling into the crust, bake the cheesecake in the middle of a preheated 350°F. oven for 50 to 55 minutes, or until the center is just set, and let it cool in the pan on a rack for 5 minutes.",
        "In a bowl whisk together the sour cream, the sugar, and the bourbon liqueur.",
        "Spread the sour cream mixture over the top of the cheesecake and bake the cheesecake for 5 minutes more. Let the cheesecake cool in the pan on a rack and chill it, covered, overnight. Remove the side of the pan and garnish the top of the cheesecake with the pecans."
    ],
    "ingredients": [
        "3/4 cup graham cracker crumbs",
        "1/2 cup finely chopped pecans",
        "1/4 cup firmly packed light brown sugar",
        "1/4 cup granulated sugar",
        "4 tablespoons unsalted butter, melted and cooled",
        "1 1/2 cups solid pack pumpkin",
        "3 large eggs",
        "1 1/2 teaspoons cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "1/2 teaspoon ground ginger",
        "1/2 teaspoon salt",
        "1/2 cup firmly packed light brown sugar",
        "three 8-ounce packages cream cheese, cut into bits and softened",
        "1/2 cup granulated sugar",
        "2 tablespoons heavy cream",
        "1 tablespoon cornstarch",
        "1 teaspoon vanilla",
        "1 tablespoon bourbon liqueur or bourbon if desired",
        "2 cups sour cream",
        "2 tablespoons granulated sugar",
        "1 tablespoon bourbon liqueur or bourbon, or to taste",
        "16 pecan halves for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Mixer",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Kid-Friendly",
        "Cream Cheese",
        "Pumpkin",
        "Fall",
        "Potluck",
        "Gourmet"
    ],
    "title": "Pumpkin Cheesecake with Bourbon Sour Cream Topping",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-cheesecake-with-bourbon-sour-cream-topping-13386"
}
