{
    "directions": [
        "Mix the cheese, pumpkin, 1/2 teaspoon salt, and the nutmeg.  Set filling aside.",
        "Mix the flour, and 1/2 teaspoon salt in a large bowl; make a well in the center of the flour. Beat the tomato paste, oil, and eggs until well blended, and pour into the well in the flour.  Stir with a fork,   gradually bring the flour mixture to the center of the bow until the dough makes a ball. If the dough is too dry, mix in up to 2 tablespoons water.",
        "Knead lightly on a floured cloth-covered surface, adding flour if dough is sticky, until smooth and elastic, about 5 minutes.  Cover, and let rest for another 5 minutes.  Divide the dough into 4 equal parts.  Roll the dough, one part at a time, into a rectangle about 12 x 10 inches.  Keep the rest of the dough covered while working.",
        "Drop 2 level teaspoons filling onto half of the rectangle, about 1 1/2 inches apart in 2 rows of 4 mounds each.  Moisten the edges of the dough, and the dough between the rows of pumpkin mixture with water.  Fold the other half of the dough up over the pumpkin mixture, pressing the dough down around the pumpkin.  Cut between the rows of filling to make ravioli; press the edges together with a fork, or cut with a pastry wheel.  Seal edges well.  Repeat with the remaining dough and pumpkin filling.  Place ravioli on towel.  Let stand, turning once, until dry, about 30 minutes.",
        "Cook ravioli in 4 quarts of boiling salted water until tender; drain carefully."
    ],
    "ingredients": [
        "1 cup ricotta cheese",
        "1/2 cup pumpkin puree",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground nutmeg",
        "2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "1/4 cup tomato paste",
        "1 tablespoon olive oil",
        "2 eggs",
        "2 tablespoons water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Ravioli",
    "url": "http://allrecipes.com/recipe/11827/pumpkin-ravioli/"
}
