{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F. Butter bundt pan generously, then dust with flour, knocking out excess.",
        "Whisk together flour (2 1/4 cups), baking powder, baking soda, cinnamon, allspice, and salt in a bowl. Whisk together pumpkin, 3/4 cup buttermilk, and vanilla in another bowl.",
        "Beat butter (1 1/2 sticks) and granulated sugar in a large bowl with an electric mixer at medium-high speed until pale and fluffy, 3 to 5 minutes, then add eggs and beat 1 minute. Reduce speed to low and add flour and pumpkin mixtures alternately in batches, beginning and ending with flour mixture and mixing until batter is just smooth.",
        "Spoon batter into pan, smoothing top, then bake until a wooden pick or skewer inserted in center of cake comes out clean, 45 to 50 minutes. Cool cake in pan on a rack 15 minutes, then invert rack over cake and reinvert cake onto rack. Cool 10 minutes more.",
        "While cake is cooling, whisk together buttermilk and confectioners sugar until smooth. Drizzle icing over warm cake, then cool cake completely. Icing will harden slightly."
    ],
    "ingredients": [
        "1 1/2 sticks (3/4 cup) unsalted butter, softened, plus additional for greasing bundt pan",
        "1 additional butter for greasing bundt pan",
        "2 1/4 cups all-purpose flour plus additional for dusting pan",
        "1 additional flour for dusting pan",
        "2 teaspoons baking powder",
        "1 teaspoon baking soda",
        "1 teaspoon cinnamon",
        "3/4 teaspoon ground allspice",
        "1/2 teaspoon salt",
        "1 1/4 cups canned solid-pack pumpkin (from a 15-ounce can; not pie filling)",
        "3/4 cup well-shaken buttermilk",
        "1 teaspoon vanilla",
        "1 1/4 cups granulated sugar",
        "3 large eggs",
        "2 tablespoons plus 2 teaspoons well-shaken buttermilk",
        "1 1/2 cups confectioners sugar",
        "Special equipment: a 10-inch nonstick bundt pan (3 quart)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Dairy",
        "Egg",
        "Vegetable",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Squash",
        "Pumpkin",
        "Fall",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pumpkin Spice Bundt Cake with Buttermilk Icing",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-spice-bundt-cake-with-buttermilk-icing-233011"
}
