{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Make the pastry dough by creaming together 12 ounces of cream cheese with 1 pound of butter and the sugar in a large bowl until thoroughly blended. Mix in the flour, a little at a time, until the dough is workable. Cut the dough into 4 equal-sized pieces, roll the pieces into balls, and refrigerate until needed.",
        "To make the filling, mash 12 ounces of cream cheese with brown sugar, pumpkin pie spice, cinnamon, and salt in a bowl until smooth and well combined; beat in eggs, one at a time, incorporating each egg before adding the next one. Mix in the pumpkin, evaporated milk, and vanilla extract until the filling is smooth.",
        "Cut each dough ball in half, and cut each half into 12 pieces (96 total pieces). Working in batches, press each small piece of dough into the bottom and up the sides of mini muffin cups. Fill the little crusts almost to the top with the pumpkin filling. Refrigerate unused dough until you need it to make the next batch.",
        "Bake in the preheated oven until the filling is set and the crusts are lightly golden brown, 25 to 30 minutes. Allow to cool completely before frosting.",
        "Mash 1/2 cup of butter, the shortening, and 8 ounces of cream cheese together in a bowl until thoroughly combined, and mix in the confectioners' sugar and marshmallow creme until smooth and creamy. Spread or pipe the frosting onto the cooled tarts. Sprinkle each tart with a few chopped pecans. Refrigerate until serving."
    ],
    "ingredients": [
        "Tart Pastry:",
        "12 ounces cream cheese, softened",
        "1 pound butter, softened",
        "1/4 cup white sugar",
        "4 cups all-purpose flour",
        "Filling:",
        "12 ounces cream cheese, softened",
        "1 cup brown sugar",
        "1 teaspoon pumpkin pie spice",
        "1 1/2 teaspoons ground cinnamon",
        "1/2 teaspoon salt",
        "3 eggs",
        "2 cups solid pack pumpkin",
        "1 (12 fluid ounce) can evaporated milk",
        "1 teaspoon vanilla extract",
        "Topping:",
        "1/2 cup butter",
        "1/2 cup vegetable shortening",
        "8 ounces cream cheese, softened",
        "1 (16 ounce) package confectioners' sugar",
        "1 (7 ounce) jar marshmallow creme",
        "1 cup finely chopped pecans, divided"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Tarts",
    "url": "http://allrecipes.com/recipe/217130/pumpkin-tarts/"
}
