{
    "directions": [
        "Preheat oven to 350°F. Generously butter 9x9x2-inch metal baking pan. Line rimmed baking sheet with parchment. Using on/off turns, blend first 4 ingredients in processor until coarse meal forms. Add pecans; using on/off turns, process until nuts are chopped. Add oats; process using on/off turns until mixture is moistened but not clumping. Press 3 1/2 cups crumbs onto bottom of prepared square pan (do not clean processor). Transfer remaining crumbs to lined baking sheet. Bake crumbs on sheet until golden, stirring once, about 12 minutes. Cool crumbs. Bake crust until golden, about 30 minutes. Remove from oven while preparing filling. Maintain oven temperature.",
        "Blend all ingredients in same processor until smooth. Spread filling over warm crust; bake until set, dry in center, and beginning to rise at edges, about 20 minutes. Maintain oven temperature.",
        "Mix all ingredients in small bowl. Spread evenly over hot filling. Bake until topping sets and bubbles at edges, about 5 minutes. Cool completely in pan on rack. Sprinkle crumbs over topping; gently press into topping. Cover; chill until cold, about 2 hours. Do ahead Can be made 2 days ahead. Keep chilled. Cut into squares."
    ],
    "ingredients": [
        "1 cup all purpose flour",
        "3/4 cup (packed) golden brown sugar",
        "1/2 teaspoon salt",
        "1/2 cup (1 stick) chilled unsalted butter, diced",
        "1 cup pecan halves (about 4 ounces)",
        "3/4 cup old-fashioned oats",
        "1 (8-ounce) package cream cheese, room temperature",
        "3/4 cup canned pure pumpkin",
        "1/2 cup sugar",
        "1 large egg",
        "1 1/2 teaspoons ground cinnamon",
        "1 teaspoon ground ginger",
        "1 cup sour cream",
        "2 tablespoons sugar",
        "1/4 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Dairy",
        "Egg",
        "Nut",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Vegetarian",
        "Halloween",
        "Cream Cheese",
        "Pecan",
        "Oat",
        "Pumpkin",
        "Fall",
        "Chill",
        "Kidney Friendly",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Pumpkin Cheesecake Crumble Squares",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-cheesecake-crumble-squares-236213"
}
