{
    "directions": [
        "Preheat oven to 350°F.",
        "In a shallow baking pan arrange squash, cut sides up, and bake 45 minutes, or until soft. Spoon out pulp (there should be 6 to 8 cups) and purée in a food processor.",
        "In a large heavy kettle heat butter over moderate heat until foam subsides and cook remaining vegetables, stirring occasionally, until they begin to soften, 10 to 12 minutes. Add broth or water, squash purée, cinnamon, and nutmeg and simmer, covered 40 minutes. Stir in syrup and cream and simmer, uncovered, 5 minutes. Season soup with salt and pepper.",
        "Cool soup slightly and in a food processor or blender purée in small batches until smooth, transferring to a large bowl. Return soup to kettle and reheat if necessary. Serve soup garnished with croutons.",
        "Preheat oven to 300°F.",
        "Peel and core apple and halve lengthwise. In a food processor fitted with 2-millimeter slicing disk or with a mandoline or other hand-held slicing device cut apple into paper-thin slices. On a large non-stick baking sheet or a large baking sheet lined with parchment paper spread slices in one layer and sprinkle evenly with brown sugar. Bake slices in middle of oven 20 minutes, or until crisp and golden, and transfer immediately to racks to cool. Makes about 12 \"croutons.\""
    ],
    "ingredients": [
        "4 pounds pumpkin or other winter squash such as butternut or  Hubbard, halved and strings and seeds discarded",
        "2 tablespoons unsalted butter",
        "3 large carrots, chopped",
        "4 celery ribs, chopped",
        "2 large onions, chopped",
        "1 leek (white and pale green part only), halved lengthwise, washed  well, and chopped",
        "12 cups chicken broth or water",
        "2 teaspoons cinnamon",
        "1/2 teaspoon freshly grated nutmeg",
        "1/4 cup pure maple syrup",
        "1 cup heavy cream",
        "1 tart apple such as Granny Smith",
        "1/4 cup firmly packed light brown sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Food Processor",
        "Onion",
        "Thanksgiving",
        "Halloween",
        "Apple",
        "Celery",
        "Leek",
        "Carrot",
        "Pumpkin",
        "Gourmet"
    ],
    "title": "Pumpkin Soup with Apple Schnitz \"Croutons\" '21' Club",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-soup-with-apple-schnitz-croutons-21-club-13281"
}
