{
    "directions": [
        "Saute the onions, garlic, and spices in butter or margarine until the onions are soft.  Stir together with the pureed vegetables.  Add cheese, maple syrup, egg, salt, and black pepper.  Adjust seasoning.  Set the filling aside.",
        "Preheat the oven to 400 degrees F (205 degrees C).  Toast the hazelnuts in a shallow pan on  the middle rack for 10 to 12 minutes, or until brown and fragrant.   When they are cool enough to handle, wrap the nuts tightly in a lint-free towel, and vigorously rub nuts against the towel.  Continue rubbing until the nuts are almost blond.",
        "Cook the cream, garlic, cayenne, and white pepper over high heat; stir often, and adjust heat to keep the cream from boiling over.  When the cream is thick enough to coat the back of a spoon, add a pinch salt.  Adjust seasoning.  Remove sauce from heat until you're ready to use it.",
        "Lay one sheet of Fresh Pasta out on a flat surface.  Spray with water to prevent drying, and to make it more flexible.  Place half tablespoons of filling along the bottom edge of the pasta about 1/2 inch apart. For larger ravioli, use 1 tablespoon of filling, and leave 1 inch between dollops. Fold the pasta sheet over the filling, and cut apart with a ravioli cutter. Set the finished ravioli aside, and cover with a damp cloth.  Repeat until filling and/or pasta is completely used.",
        "Cook the ravioli in salted boiling water until al dente.  Drain.",
        "Meanwhile, reheat the sauce.  Add the shredded sorrel to the sauce; cook just until it wilts -- about 30 seconds.  Add half the hazelnuts, turn the heat off, and add the cooked ravioli.  Stir gently, and serve immediately. Garnish with remaining hazelnuts."
    ],
    "ingredients": [
        "2 1/2 cups pumpkin puree",
        "2 large carrots, cooked and pureed",
        "2 onions, diced",
        "1 clove garlic, minced",
        "2 teaspoons ground coriander seed",
        "1/2 teaspoon ground mace",
        "1/2 teaspoon ground allspice",
        "1 pinch ground cardamom",
        "1 cup unsalted butter",
        "1/3 pound grated Parmesan cheese",
        "2 tablespoons real maple syrup",
        "1 egg, beaten",
        "2 1/2 pounds fresh pasta sheets",
        "salt to taste",
        "ground black pepper to taste",
        "1 cup hazelnuts",
        "3 cups heavy whipping cream",
        "3 cloves garlic, minced",
        "1 pinch cayenne pepper",
        "1 pinch white pepper",
        "salt to taste",
        "2 cups shredded sorrel, stems removed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Pumpkin Ravioli with Hazelnut Cream Sauce",
    "url": "http://allrecipes.com/recipe/11826/pumpkin-ravioli-with-hazelnut-cream-s/"
}
