{
    "directions": [
        "Preheat oven to 350° F. and butter a 9- by 2-inch round cake pan. Line cake pan with a round of wax paper and butter wax paper.",
        "Cut enough 1/4-inch-thick slices from loaf to line side of cake pan, trimming slices so that tops are flush with rim of pan. Gently press slices against side of cake pan to make them adhere.",
        "Cut enough of remaining loaf, including scraps, into 1/2-inch pieces to measure 5 cups and put in bottom of cake pan.",
        "In a heavy saucepan bring ginger, sugar, and water to a boil, stirring until sugar is dissolved, and simmer 5 minutes. Add milk and cream and bring just to a simmer. Remove pan from heat.",
        "In a heatproof bowl whisk together whole eggs and yolks and add hot milk mixture in a stream, whisking. Pour custard through a fine sieve onto bread pieces in bottom of cake pan, pressing hard on ginger, and coat pieces well (bread pieces will float to surface of custard).",
        "Put cake pan in a larger pan and add enough water to larger pan to reach half-way up side of cake pan. Bake pudding in middle of oven 45 to 50 minutes, or until custard is set and a skewer inserted in center comes out clean. Remove cake pan from larger pan and cool pudding on a rack. Chill pudding, covered, until cold, at least 4 hours and up to 1 day.",
        "To unmold pudding, run a thin knife around edge of cake pan and dip pan into a bowl of hot water 15 seconds. Invert a large plate over cake pan and invert pudding onto plate. Peel off wax paper and invert pudding right side up onto another large plate. Bring pudding to room temperature and cut into wedges. (If serving pudding warm, transfer wedges to a baking sheet and reheat in a 325° F. oven.)",
        "Serve pudding at room temperature or warm with caramel sauce."
    ],
    "ingredients": [
        "1 loaf pumpkin cranberry bread",
        "1/3 cup minced peeled fresh ginger",
        "3/4 cup sugar",
        "2 tablespoons water",
        "2 cups milk",
        "1 cup heavy cream",
        "3 large whole eggs",
        "3 large egg yolks",
        "cranberry caramel sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Dessert",
        "Bake",
        "Thanksgiving",
        "Cranberry",
        "Pumpkin",
        "Fall",
        "Gourmet"
    ],
    "title": "Pumpkin Bread Pudding with Cranberry Caramel Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/pumpkin-bread-pudding-with-cranberry-caramel-sauce-13434"
}
