{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "Place butter and softened cream cheese in a small microwave safe bowl. Melt in microwave on medium setting stirring every 15 seconds until melted. Set aside.",
        "In a large mixing bowl, add cookie mix, melted butter and cream cheese mixture, egg, vanilla extract, cocoa powder and cake flour. Stir until dough forms. Sift together 2 tablespoons each of cocoa powder and cake flour to use for dusting board and rolling pin. Roll out dough 1/8-inch thick. Using cutters slightly bigger than petits fours molds, stamp out cookies. Fit cookies into molds and cut off excess. Bake in batches for 8 to 10 minutes. Let cool for 5 minutes before removing from molds. Cool completely on wire racks.",
        "To make the filling, scoop out into separate bowls the pie fillings of the thawed cheesecake and baked pumpkin pie. Be careful not to get any of the crusts. Discard the crusts. Add heavy cream and beat each filling with a wire whisk to smooth out consistency.",
        "To assemble, using pastry bags or zip-top bag with a star tip, hold the bag on its side and spoon in half of the cheesecake filling. Then spoon half of the pumpkin filling on the other side. Test the frosting by squeezing the bag until both fillings come out. Fill 2 more pastry bags or zip-top bags, 1 with the remaining cheesecake filling and the other with the pumpkin filling. Add fillings to petits fours.",
        "To make the chocolate icing, remove lid and foil seal from chocolate icing. Heat in microwave for 30 seconds and stir. Pour into small zip-top bag. Snip off tiny opening in corner of bag. Drizzle over petits fours. Garnish with an espresso bean."
    ],
    "ingredients": [
        "2 tablespoons butter",
        "4 ounces cream cheese",
        "1 package sugar cookie mix",
        "1 egg",
        "1/2 teaspoon vanilla extract",
        "1/3 cup cocoa powder, plus 2 tablespoons for dusting board",
        "1/2 cup cake flour, plus 2 tablespoons for dusting board",
        "1 cream cheesecake, thawed",
        "1 pumpkin pie, baked",
        "3/4 cup heavy cream (1/4 cup for cheesecake filling; 1/2 cup for pumpkin filling)",
        "1 can pour and frost chocolate icing",
        "Espresso coffee beans"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Fruit Dessert Recipes",
        "Dessert",
        "Fruit",
        "Halloween Dessert Recipes",
        "Halloween",
        "Holiday",
        "Vegetable",
        "Pumpkin",
        "Sugar",
        "Cheese",
        "Cream Cheese Recipes",
        "Tomato",
        "Dairy Recipes",
        "Fall"
    ],
    "title": "Pumpkin-Cheesecake Petits Fours",
    "url": "http://www.foodnetwork.com/recipes/sandra-lee/pumpkin-cheesecake-petits-fours-recipe"
}
