{
    "directions": [
        "Bring the quinoa and 1 1/3 cups water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the quinoa is tender, and the water has been absorbed, about 15 to 20 minutes.",
        "Meanwhile, heat 2 tablespoons of extra virgin olive oil in a large soup pot over medium heat. Stir in the onion, parsnips, and celery; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the broccoli, season with salt, and cook a few minutes until the broccoli darkens and begins to soften. Pour in 1/4 cup of water, and continue cooking until the broccoli is just cooked through. Once tender, stir in the green onions, lettuce, spinach, garlic, and chicken broth. Bring to a boil over high heat, then reduce heat to medium-low, and simmer until all of the vegetables are soft, about 15 minutes.",
        "While the soup is simmering, prepare the garnish by heating a cast iron grill pan over medium-high heat. Toss the bell peppers and shallot halves with 2 teaspoons of olive oil, and sprinkle with salt. Place into the hot grill pan, and cook until slightly blackened and tender, turning once. Remove from the pan, and chop. Stir the chopped pepper mixture together with the lime juice in a small bowl. Season to taste with black pepper, and set aside.",
        "Pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot.",
        "To serve: ladle soup into bowl. Top with a small scoop of quinoa and the red pepper relish."
    ],
    "ingredients": [
        "For the Soup:",
        "2/3 cup quinoa",
        "1 1/3 cups water",
        "2 tablespoons extra virgin olive oil",
        "1 yellow onion, diced",
        "2 parsnips, peeled and cubed",
        "3 stalks celery, chopped",
        "2 pounds broccoli florets",
        "salt to taste",
        "1/4 cup water",
        "5 green onions, sliced",
        "1/2 head romaine lettuce, washed and chopped",
        "12 ounces baby spinach leaves",
        "4 cloves garlic, minced",
        "4 cups chicken broth",
        "For the Garnish:",
        "2 red bell peppers, seeded and cut into quarters",
        "2 shallots, halved lengthwise",
        "2 teaspoons olive oil",
        "1 lime, juiced",
        "ground black pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Puree of Green Things Soup with Quinoa and Pepper Relish",
    "url": "http://allrecipes.com/recipe/217047/puree-of-green-things-soup-with-quino/"
}
