{
    "directions": [
        "Preheat the oven to 400ºF. Line two baking sheets with foil. In a large bowl, combine the mushrooms, vinegar, 2 tablespoons of the oil, and 1 tablespoon salt and stir to combine. Spread the mixture evenly on one of the lined baking sheets. Arrange the sweet potatoes on the second baking sheet. Place the mushrooms on the bottom rack and the sweet potatoes on the rack above. Bake the mushrooms for 30 minutes, until firm and dry, not crisp. Bake the sweet potatoes for 45 minutes, or until the natural sugars start to caramelize and they are soft when poked with a knife in the center.",
        "In a medium skillet, warm the remaining 2 tablespoons oil over medium heat. Add the onion, 1 teaspoon salt, the cinnamon, cumin, chili powder, and pepper to taste and sauté for 5 minutes, or until the onion is fragrant and translucent.",
        "Transfer the onion and baked sweet potatoes to a high-speed blender and add the coconut milk, water, the 1/4 cup thyme, the lemon juice, maple syrup, and salt and pepper to taste. Blend until the soup is thick and creamy. Be sure to have the blender lid on securely before blending. (Alternatively, add the remaining ingredients to a soup pot and blend with an immersion blender.) If you find that it’s too thick (not all potatoes will have the same starch content), thin the soup with water. Adjust seasonings to taste.",
        "Serve the soup in bowls, topped with 2 to 3 tablespoons of the mushrooms, a sprinkling of thyme, and a drizzle of olive oil. Serve hot/warm. Store in an airtight glass container in the refrigerator for up to 1 week."
    ],
    "ingredients": [
        "4 cups chopped button mushrooms",
        "1/4 cup balsamic vinegar",
        "4 tablespoons olive oil",
        "Sea salt",
        "1 pound purple sweet potatoes (about 4 medium)",
        "1/2 sweet onion, chopped",
        "1/2 teaspoon ground cinnamon",
        "1/2 teaspoon ground cumin",
        "1/4 teaspoon chili powder",
        "Freshly ground black pepper",
        "2 cups light coconut milk",
        "2 cups filtered water",
        "1/4 cup fresh thyme leaves, reserve 1 tablespoon total for garnishing all servings",
        "Juice of 1 lemon",
        "1 tablespoon pure maple syrup",
        "Olive oil, to garnish",
        "Seek out purple sweet potatoes at your local natural foods store or Asian market, or use regular sweet potatoes."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Soup/Stew",
        "Dinner",
        "Sweet Potato/Yam",
        "Mushroom",
        "Coconut",
        "Vegetarian",
        "Vegan",
        "Wheat/Gluten-Free",
        "Thyme",
        "Vinegar"
    ],
    "title": "Purple Sweet Potato Soup With Salted Mushrooms",
    "url": "http://www.epicurious.com/recipes/food/views/purple-sweet-potato-soup-with-salted-mushrooms"
}
