{
    "directions": [
        "Make the dough: Mix the yeast with 1 1/4 cups warm water and let it sit for 5 minutes. Then add 2 tablespoons olive oil, the raw sugar and sea salt. Whisk and set aside. In a large bowl, sift together the all-purpose and whole-wheat flour. Make a well in the center of the flour and pour in the yeast mixture. Using your hands, mix in the flour until all the liquid is absorbed. Now sprinkle a clean surface with flour and knead the dough until it's smooth. If the dough is too sticky, add some more flour as needed. Once it's smooth, shape the dough into a ball.",
        "Coat a large ceramic bowl with a tablespoon of olive oil. Place the dough in the ceramic bowl and flip it over a few times to lightly coat the dough with oil. Loosely cover the top of the dough with plastic wrap and completely cover the top of the ceramic bowl with a dish towel. Let it rise for 2 hours, until the dough has doubled in size. Then punch down the dough and let it rise for another hour.",
        "Meanwhile, make the sauce: In a large bowl, hand crush the tomatoes. Add the olive oil, garlic, fresh basil, parsley, dried basil, dried oregano, chile flakes, Parmigiano, sea salt and lots of cracked pepper. Mix. Cover and let sit in the fridge for 3 hours, or overnight.",
        "Use a fine wire-mesh sieve to drain all the liquid from the tomato sauce. Roughly chop the drained tomato chunks into little pieces and set aside.",
        "Dust a clean surface with flour. Roll out the dough 1/8 inch thick. If the dough is too sticky, dust with more flour. Once the dough is rolled out, use a 5-inch-round cookie cutter to cut about 10 to 12 circles of dough. On one half of each circle, place 1 tablespoon mozzarella, 1 tablespoon of drained tomato pieces, 1/4 teaspoon capers and 1 chopped anchovy and sprinkle with about 1 teaspoon Romano cheese. Fold the circles over and completely seal the edges with a fork.",
        "In a heavy pot, heat 6 inches of vegetable oil to 350 degrees F on a deep-fry thermometer. Deep-fry the panzarotti until golden, crispy and cooked through, 5 to 7 minutes. Place them on paper towels to drain the excess oil.",
        "Photograph by David Malosh"
    ],
    "ingredients": [
        "1 teaspoon active dry yeast",
        "3 tablespoons extra-virgin olive oil",
        "1 teaspoon raw sugar",
        "1 teaspoon sea salt",
        "1 cup all-purpose flour, plus extra for kneading",
        "1 cup whole-wheat flour",
        "1 1/2 cups canned San Marzano plum tomatoes, drained",
        "3 tablespoons extra-virgin olive oil",
        "2 cloves garlic, minced",
        "4 fresh basil leaves, torn",
        "1/4 cup flat-leaf parsley, minced",
        "1/2 teaspoon dried basil",
        "1/2 teaspoon dried Greek oregano",
        "1/4 teaspoon hot chile flakes",
        "1 tablespoon finely grated Parmigiano",
        "1/4 teaspoon sea salt",
        "Freshly cracked pepper, to taste",
        "3/4 cup diced mozzarella cheese",
        "2 tablespoons capers",
        "10 canned anchovies, drained and chopped",
        "1/3 cup grated Romano cheese",
        "Vegetable oil, for deep-frying"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Christmas",
        "Holiday",
        "Tomato",
        "Vegetable",
        "Cheese",
        "Mozzarella Recipes",
        "Anchovy",
        "Fish"
    ],
    "title": "Puttanesca Panzarotti",
    "url": "http://www.foodnetwork.com/recipes/puttanesca-panzarotti-recipe"
}
