{
    "directions": [
        "With scissors carefully cut through rims of cups and cut evenly around each cup to create a 2 3/4-inch-deep cup.",
        "In a double boiler or a metal bowl set over a saucepan of barely simmering water melt chocolate, stirring until smooth, and remove double boiler or pan from heat. With a small pastry brush, lightly coat insides of cups with chocolate just to cover and on a tray freeze cups, right side up, until chocolate is firm, about 3 minutes. Add more coats of chocolate in same manner until an 1/8-inch-thick chocolate coating is formed inside each cup.",
        "Spoon about 2 heaping tablespoons ice cream into bottom of each cup, smoothing surface with the back of a long-handled small metal spoon. Freeze cups until firm, about 30 minutes. Top ice cream in each cup evenly with 1 heaping tablespoon caramel sauce and sprinkle evenly with 1 tablespoon ground praline. Freeze cups 15 minutes. Top praline in each cup with a scant 1/4 cup ice cream, filling just to rim and smoothing with a spatula. Freeze cups until ice cream is frozen hard, about 1 hour. Ice-cream bombes may be prepared up to this point 5 days ahead and kept frozen, covered, in plastic cups.",
        "To unmold bombes, carefully tear rim of each cup and continue tearing to remove cup. Ice-cream bombes may be unmolded 4 hours ahead and kept frozen, wrapped in plastic wrap.",
        "Arrange bombes, ice-cream sides down, on each of 6 dessert plates. Spoon brandied dried fruit over and around bombes and garnish with praline shards."
    ],
    "ingredients": [
        "six 7-ounce disposable translucent soft plastic cups*",
        "6 ounces fine-quality bittersweet chocolate (not unsweetened), chopped",
        "about 2 1/4 cups super-premium vanilla ice cream, softened",
        "about 1/2 cup creamy caramel sauce",
        "6 tablespoons ground pecan praline",
        "Accompaniment: brandied dried cranberries and cherries",
        "Garnish: 12 pecan praline shards (reserved from praline recipe )",
        "*available at supermarkets under store brand name"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chocolate",
        "Fruit",
        "Nut",
        "Dessert",
        "Frozen Dessert",
        "Cranberry",
        "Cherry",
        "Vanilla",
        "Gourmet"
    ],
    "title": "Ice-Cream Bombes with Brandied Dried Cranberries and Cherries",
    "url": "http://www.epicurious.com/recipes/food/views/ice-cream-bombes-with-brandied-dried-cranberries-and-cherries-13611"
}
