{
    "directions": [
        "In a bowl combine well the crumbs, the almonds, the butter, and the sugar, press the mixture onto the bottom and about 1 inch up the side of an 8 1/2-inch springform pan, and bake the crust in the middle of a preheated 350°F. oven for 10 to 12 minutes, or until it is just set. Let the crust cool in the pan on a rack.",
        "In a large bowl combine the coffee grounds with 4 cups cold water and let them soak overnight. Pour the mixture into a sieve, lined with a paper towel or a paper coffee filter and set over a bowl, and let it drain, pressing hard on the grounds, for 2 hours. (There should be about 3/4 cup coffee concentrate.) Add enough water to measure 1 1/4 cups total.",
        "In a saucepan sprinkle the gelatin over the coffee mixture, let it soften for 1 minute, and heat the mixture over low heat, stirring, until the gelatin is dissolved. In a bowl beat the yolks with 1/2 cup of the sugar until the mixture is thick and pale, add half the coffee mixture in a stream, whisking, and whisk the mixture into the remaining coffee mixture. Cook the mixture over moderate heat, whisking, until it is thickened and registers 175°F. on a candy thermometer. Transfer the mixture to a metal bowl set in a larger bowl of ice and cold water, whisk in the cream and the vanilla, and let the mixture cool, stirring frequently, until it is just cool to the touch and is the consistency of raw egg whites. Remove the metal bowl from the larger bowl. In another bowl beat the egg whites until they hold soft peaks, add 1/4 cup of the remaining sugar, 1 tablespoon at a time, beating, and beat the meringue until it holds stiff peaks. Stir one fourth of the meringue into the coffee mixture and fold in the remaining meringue gently but thoroughly. Pour the filling into the crust. In a small bowl combine the remaining 1 teaspoon sugar and the cinnamon, sprinkle the mixture over the filling, and chill the filling for at least 6 hours or overnight.",
        "In a chilled bowl with chilled beaters beat the cream until it holds soft peaks, add the Kahlúa and the sugar, a little at a time, beating, and beat the topping until it holds stiff peaks.",
        "Transfer the topping to a pastry bag fitted with a decorative tip, pipe it decoratively over the coffee mixture, and sprinkle it with the cinnamon. Chill the cake for 2 hours. Run a thin knife around the edge of the pan, remove the side carefully, and transfer the cake to a serving plate."
    ],
    "ingredients": [
        "1 cup chocolate wafer crumbs",
        "1/4 cup blanched almonds, toasted lightly, cooled completely, and ground fine",
        "1/2 stick (1/4 cup) unsalted butter, melted and cooled",
        "1/4 cup sugar",
        "1 pound ground fresh coffee",
        "1 envelope of unflavored gelatin",
        "4 large eggs, separated, the whites at room temperature",
        "3/4 cup plus 1 teaspoon sugar",
        "1/4 cup heavy cream",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground cinnamon",
        "1 cup heavy cream",
        "1 tablespoon kahlúa",
        "3 tablespoons sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Coffee",
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Almond",
        "Kahlúa",
        "Chill",
        "Gourmet"
    ],
    "title": "Iced Cappuccino Cream Cake",
    "url": "http://www.epicurious.com/recipes/food/views/iced-cappuccino-cream-cake-10401"
}
