{
    "directions": [
        "Preheat oven to 375 degrees .",
        "For the mashed potato crust:",
        "Make Buttery Homestyle Flavored Mashed Potatoes to package directions substituting boiling milk for the water.",
        "When the milk is incorporated, add the mayonnaise and the Parmesan. Season with the salt and pepper to taste. Cool for 5 minutes.",
        "Once cooled, add the eggs, and the flour. Mix until blended - the potatoes should appear thick and dry.",
        "For the crispy outer potato crust:",
        "Combine the 3 ingredients and set aside.",
        "For the Roast:",
        "Season the rib roast generously with salt and black pepper. Dust the outside with the all-purpose flour.",
        "Heat a cast iron or a large heavy saute pan over med-high heat. Add the canola oil and allow it to heat until simmering.",
        "Add the rib roast carefully bone-side up or fat side down. Sear until golden in color.",
        "Remove the roast and place on a sheet tray. Allow it to cool for 10 minutes.",
        "Once cooled, brush the mustard onto the fat side of the roast and the under side. Coat the roast with the potato and egg mixture. Then coat the potato mixture with the crispy crust mix.",
        "Place the roast in the preheated oven and roast for 1 hour.",
        "Turn off the oven and making sure to keep the oven door closed, leave the roast in the oven for 3 hours.",
        "After 3 hours, turn the oven back on to 375 degrees to reheat the roast - about 10 minutes.",
        "Remove the roast and let it rest for 15 minutes. Slice and serve."
    ],
    "ingredients": [
        "For the Mashed Potato Crust:",
        "1 (4 ounce) package Idahoan® Buttery Homestyle Flavored Mashed Potatoes",
        "1 tablespoon mayonnaise",
        "3 tablespoons Parmesan cheese, grated",
        "1 teaspoon kosher salt",
        "Black pepper",
        "2 eggs, beaten",
        "1/2 cup all-purpose flour",
        "For the Crispy Outer Potato Crust:",
        "1 (4 ounce) package Idahoan® Buttery Homestyle Flavored Mashed Potatoes",
        "1 cup panko bread crumbs",
        "1 cup potato chips, crushed",
        "For the Roast:",
        "1 (5 pound) bone-in standing rib roast",
        "Salt and pepper",
        "1/4 cup all-purpose flour",
        "3 tablespoons canola oil",
        "1/4 cup whole-grain mustard"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Idahoan Potato Crusted Rib Roast",
    "url": "http://allrecipes.com/recipe/239331/idahoan-potato-crusted-rib-roast/"
}
