{
    "directions": [
        "Combine raspberries and their juices and sugar in blender. Puree until sugar dissolves. Strain sauce into bowl. Cover and refrigerate.",
        "Combine sugar and potato starch in heavy large saucepan; whisk to blend. Gradually add nondairy creamer, whisking until well blended. Whisk in egg yolks, lemon peel and lemon juice. Add margarine. Whisk over medium-high heat until custard is thick and smooth and just begins to bubble, about 9 minutes. Transfer to bowl. Refrigerate uncovered until cold, about 4 hours; then cover and keep chilled.",
        "Preheat oven to 350°F. Combine orange juice concentrate, lemon juice and both peels in small bowl; whisk to blend. Combine cake meal and potato starch in medium bowl; whisk to blend.",
        "Using handheld electric mixer, beat egg yolks and 3/4 cup sugar in large bowl until thick about 1 minute. Beat in orange concentrate mixture, then dry ingredients. Using clean dry beaters, beat whites and salt in another large bowl until soft peaks form. Gradually add remaining 3/4 cup sugar, beating until stiff but not dry. Fold whites into yolk mixture in 3 additions.",
        "Transfer batter to ungreased 10-inch-diameter angel food cake pan with 4-inch-high sides. Bake cake until golden brown and tester inserted near center comes out clean, about 40 minutes. Immediately invert center tube of cake pan onto narrow-neck bottle. Cool cake completely. (Sauce, custard and cake can be made 1 day ahead. Keep sauce and custard chilled. Cover cake in pan; store at room temperature.)",
        "Cut cake from pan. Cut cake into twelve 1-inch-thick slices (reserve remaining for another use.) Trim crusts. Cut each slice into 6 squares. Place 3 banana slices in each of twelve 1- to 1 1/4-cup stemmed glasses. Spoon 1 tablespoon sauce over. Top with 3 cake pieces, 2 tablespoons custard, 4 banana slices and 1 1/2 tablespoons sauce. Repeat layering with cake, custard, banana and sauce. Garnish with mint, lemon and additional banana slices, if desired. Chill up to 6 hours."
    ],
    "ingredients": [
        "2 12-ounce bags frozen unsweetened raspberries, thawed",
        "3/4 cup sugar",
        "3/4 cup sugar",
        "3 tablespoons potato starch",
        "2 3/4 cups liquid nondairy creamer",
        "6 large egg yolks",
        "1 tablespoon grated lemon peel",
        "1 teaspoon fresh lemon juice",
        "6 tablespoons (3/4 stick) unsalted pareve margarine, diced",
        "3 tablespoons frozen orange juice concentrate, thawed",
        "1 tablespoon fresh lemon juice",
        "1 tablespoon grated orange peel",
        "1 tablespoon grated lemon peel",
        "1/2 cup matzo cake meal",
        "1/2 cup potato starch",
        "8 large eggs, separated",
        "1 1/2 cups sugar",
        "1/2 teaspoon coarse salt",
        "6 ripe bananas, peeled, thinly sliced",
        "Fresh mint sprigs (optional)",
        "Lemon twists (optional)",
        "Additional banana slices (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Blender",
        "Mixer",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Passover",
        "Raspberry",
        "Banana",
        "Kosher"
    ],
    "title": "Individual Raspberry and Banana Trifles",
    "url": "http://www.epicurious.com/recipes/food/views/individual-raspberry-and-banana-trifles-1687"
}
