{
    "directions": [
        "Preheat oven to 250°F with rack in middle.",
        "Trim end from cucumber, then halve lengthwise. Scrape out and discard any seeds with a small spoon, then cut into 2- by 1/2-inch sticks.",
        "Cook cauliflower and carrots together in a large pot of boiling salted water (1 1/2 tablespoons salt for 3 quarts water), stirring occasionally, 1 minute. Drain in a colander, then put colander in an ice bath. Drain again in colander, then pat vegetables very dry.",
        "Arrange cauliflower, carrots, and cucumber in 1 layer in a 17- by 12-inch shallow baking pan and bake, stirring occasionally, until vegetables are dry and slightly limp, about 30 minutes.",
        "Pulse garlic and ginger with 1 teaspoon salt in a food processor until finely ground, then transfer to a bowl. Pulse mustard seeds in spice grinder until coarsely ground, then stir together with remaining spices. Heat wok over high heat until a drop of water evaporates instantly. Pour oil down side of wok, then tilt wok to swirl, coating side. When oil just begins to smoke, add chiles and spice mixture and cook, stirring, 10 seconds. Add garlic mixture and cook, stirring, until golden, about 15 seconds. Add vegetables, vinegar, and brown sugar and bring to a boil, stirring until sugar has dissolved. Transfer to a shallow dish and cool to room temperature, stirring occasionally, about 1 hour.",
        "Transfer to an airtight container and chill, shaking once or twice a day, 1 week (to allow flavors to develop)."
    ],
    "ingredients": [
        "1/2 seedless cucumber",
        "1/2 large head cauliflower, cut into 1 1/2-inch-wide florets (4 cups)",
        "1/2 lb carrots (4 medium), cut into 2 1/2- by 1/2-inch sticks (2 cups)",
        "3 tablespoons coarsely chopped garlic (6 cloves)",
        "3 tablespoons coarsely chopped peeled ginger",
        "1 tablespoon mustard seeds (preferably black or brown)",
        "1 teaspoon coriander seeds",
        "1 teaspoon ground turmeric",
        "1/2 teaspoon cumin seeds",
        "1/2 teaspoon fennel seeds",
        "1/3 cup vegetable oil",
        "5 (2-inch) dried hot red chiles, wiped clean",
        "1/2 cup distilled white vinegar",
        "3 tablespoons packed dark brown sugar",
        "Equipment: an electric coffee/spice grinder; a well-seasoned 14-inch flat-bottomed wok"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Garlic",
        "Ginger",
        "Vegetable",
        "Side",
        "Thanksgiving",
        "Vegetarian",
        "Spice",
        "Cauliflower",
        "Hot Pepper",
        "Root Vegetable",
        "Carrot",
        "Fall",
        "Winter",
        "Vegan",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Indian-Spiced Pickled Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/indian-spiced-pickled-vegetables-240543"
}
