{
    "directions": [
        "Finely grind fennel seeds in grinder. Whisk together fennel and 1 cup yogurt with garlic, ginger, cumin, coriander, black pepper, turmeric, cayenne, and 1/2 teaspoon salt. Coat fish with yogurt mixture and marinate in a shallow baking dish, covered and chilled, 1 hour.",
        "While fish is marinating, whisk together remaining cup yogurt, mint, zest, and remaining 1/2 teaspoon salt to make sauce.",
        "Prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderate.",
        "Lift fish out of marinade, letting excess drip off (discard marinade), and grill fish, covered only if using a gas grill, on lightly oiled grill rack, turning over once, until just cooked through, about 12 minutes total. (If using halibut, grill skin sides down first and grill, turning once, 8 to 9 minutes total.) Serve fish with sauce."
    ],
    "ingredients": [
        "1 teaspoon fennel seeds, toasted",
        "2 cups plain yogurt (16 oz)",
        "1 garlic clove, minced",
        "1 teaspoon minced peeled fresh ginger",
        "1/2 teaspoon ground cumin",
        "1/2 teaspoon ground coriander",
        "1/4 teaspoon black pepper",
        "1/4 teaspoon turmeric",
        "1/8 teaspoon cayenne, or to taste",
        "1 teaspoon salt",
        "6 (1-inch-thick) pieces skinless sturgeon fillet or halibut fillet with skin (6 oz each)",
        "3 tablespoons finely chopped fresh mint",
        "1/2 teaspoon finely grated fresh lemon zest",
        "Special equipment: an electric coffee/spice grinder"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fish",
        "Ginger",
        "Marinate",
        "Yogurt",
        "Mint",
        "Summer",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Indian-Spiced Sturgeon with Mint Yogurt Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/indian-spiced-sturgeon-with-mint-yogurt-sauce-109536"
}
