{
    "directions": [
        "Mix yeast, sugar, and 1/4 cup warm water in a large mixing bowl and set aside until the yeast mixture forms a creamy foam layer on top, about 5 minutes. Whisk flour, 1 teaspoon salt, and baking powder in a bowl. Stir flour mixture into yeast mixture by thirds, alternating with 1 cup warm water in thirds, and beat to make a firm dough.",
        "Cut the dough into 6 pieces and roll each piece into a ball on a floured work surface. Roll out the dough balls into flat round tortillas.",
        "Heat vegetable oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).",
        "Gently place tortillas, one at a time, into the hot oil and fry until golden brown on both sides, turning once, 2 to 3 minutes per side. Drain on paper towels and set aside.",
        "Cook and stir ground beef with 1 large minced onion in a skillet over medium heat until the meat is browned and crumbly, about 10 minutes. Drain excess grease and stir in diced tomatoes with their juice, tomato paste, basil, oregano, salt, black pepper, and chili powder. Bring the chili to a boil and reduce heat to low; simmer until thickened, 30 to 40 minutes.",
        "Place a piece of fry bread onto a plate and ladle a generous portion of chili onto the bread. Transfer Cheddar cheese, lettuce, 1 cup finely chopped onion, and mild green chilies into separate bowls and top each portion with about 1 tablespoon of Cheddar cheese and desired amounts of lettuce, onion, and chilies."
    ],
    "ingredients": [
        "1 (.25 ounce) package active dry yeast",
        "1 tablespoon white sugar",
        "1/4 cup warm water",
        "3 cups all-purpose flour",
        "1 teaspoon salt",
        "1 tablespoon baking powder",
        "1 cup warm water",
        "6 cups vegetable oil for frying",
        "1 pound ground beef",
        "1 large onion, minced",
        "1 (28 ounce) can diced tomatoes, undrained",
        "2 (6 ounce) cans tomato paste",
        "1 teaspoon dried basil",
        "1/2 teaspoon dried oregano",
        "salt and ground black pepper to taste",
        "1 pinch chili powder, or to taste",
        "1/2 pound Cheddar cheese, coarsely shredded",
        "1 head iceberg lettuce, cored and shredded",
        "1 cup finely chopped onion, or as desired",
        "1 cup finely chopped mild green chiles, or as desired"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Indian Tacos with Yeast Fry Bread",
    "url": "http://allrecipes.com/recipe/222993/indian-tacos-with-yeast-fry-bread/"
}
