{
    "directions": [
        "Heat a pot over medium to medium high heat. Add extra-virgin olive oil, 3 turns of the pan, and the turkey meat. Season the meat with: chili powder, grill seasoning, cumin, Worcestershire and hot sauce. Break up the meat with the back of a wooden spoon into small crumbles.",
        "Chop the onion, reserving 1/4 of it for topping the chili. Brown meat 5 minutes, then add onions and chopped bell peppers and cook 10 minutes more. Add beer and deglaze the pan, scraping up the drippings and cooking off the alcohol. Add tomato sauce and barbecue sauce and bring to a bubble. It using corn kernels add them now. Let chili simmer 10 minutes. Adjust seasonings and heat level to your taste. Remove from heat and serve.",
        "Tidbit:",
        "To make a double batch, heat 2 pots and make 1 batch in each pot, rather than using 1 massive pot that is hard to control.",
        "Choose from any or all of the following for dipping and scooping into your chili:",
        "All of the above can be found on either snack aisle or natural foods snack section in your market.",
        "Choose from any or all of the following for topping your chili:",
        "Defrosted frozen corn or leftover corn on the cob, scraped from cob"
    ],
    "ingredients": [
        "3 tablespoons extra-virgin olive oil, 2 turns of the pan",
        "2 1/2 pounds ground turkey (85 percent lean) or ground turkey breast (99 percent lean), 2 packages",
        "4 tablespoons dark chili powder, 2 palm fulls",
        "2 tablespoons grill seasoning blend, any brand, 1 palm full",
        "1 tablespoon cumin, 1/2 palm full",
        "2 tablespoons Worcestershire sauce",
        "1 to 3 tablespoons hot sauce, medium to extra-spicy",
        "1 large onion, quartered",
        "2 large peppers, any color combination, red, green, purple, yellow or orange, chopped",
        "1/2 bottle beer (the alcohol cooks out), about 1 cup",
        "1 (14-ounce) can tomato sauce",
        "1/2 cup smoky barbecue sauce",
        "2 cups corn kernels, optional",
        "Choose from any or all of the following for dipping and scooping into your chili:",
        "Pretzel Rods",
        "Yellow, Red or Blue Corn Tortilla Chips, any flavor",
        "Black Bean Tortilla Chips",
        "Polenta Chips, Plain or Guacamole flavor",
        "Pita Chips, Plain or Spicy flavors",
        "Yukon Gold, Red Bliss or Blue Potato Chips, any flavor",
        "Choose from any or all of the following for topping your chili:",
        "Shredded Cheeses: smoked white sharp cheddar, such as Cabot brand, pepper jack, chipotle Cheddar, 5 peppercorn Cheddar, Monterey jack",
        "Sliced canned jalapenos, drained",
        "Salsas",
        "Sour cream",
        "Chopped raw onion",
        "Chopped green olives and pimentos",
        "Chopped cilantro leaves",
        "Diced tomatoes"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Main Dish Recipes",
        "Easy Recipes",
        "Main Dish Recipes",
        "Turkey Chili",
        "Chili",
        "Poultry Recipes",
        "Turkey Recipes",
        "Healthy",
        "Cheese",
        "Tomato",
        "Vegetable",
        "Jalapeno Recipes",
        "Olive Recipes",
        "Corn Recipes",
        "Monterey Jack Recipes",
        "Dairy Recipes",
        "Cheddar",
        "Low Calorie",
        "Diabetes-Friendly",
        "Recipes for Parties",
        "Super Bowl",
        "Tailgate Party"
    ],
    "title": "Indian Summer Turkey Chili",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/indian-summer-turkey-chili-recipe"
}
