{
    "directions": [
        "Preheat oven to 350°F. Coat 8-inch springform pan with nonstick spray. Line outside of pan with foil to prevent batter from leaking and place on cookie sheet (see tip, below).",
        "Place tortillas directly on oven rack and toast, turning halfway through, until crisp and dry, about 5 minutes. Let cool, then grind finely in clean spice grinder or small food processor. Set aside.",
        "Using tongs, hold poblano over stovetop burner on high heat, turning frequently, until blackened all over, 5 to 10 minutes. (Alternatively, roast under broiler, turning and watching carefully.) Place in medium bowl, cover with plate, and let steam until cool enough to handle, 10 to 15 minutes. Using paper towels, wipe away charred skin. Cut out and discard stem and core. Halve pepper lengthwise, scrape out seeds, and dice half pepper, reserving remainder for another use. Set aside diced pepper.",
        "In food processor, purée 2 1/2 cups corn and 1/2 cup milk until smooth. Set aside.",
        "In medium skillet over medium heat, warm oil. Add onion and 1/4 teaspoon salt and cook, stirring occasionally, until softened, about 3 to 4 minutes. Add garlic and cook, stirring constantly, until fragrant and slightly softened, about 30 seconds.",
        "Transfer onions and garlic to large bowl. Add ground tortillas, diced poblano, puréed corn, remaining 1/2 cup corn, remaining 1 cup milk, remaining 3/4 teaspoon salt, eggs, cheese, sour cream, masa harina, and sugar. Whisk to combine.",
        "Scrape mixture into pan and bake until center is just set, 40 to 50 minutes. Cool 5 minutes in pan on rack. Carefully invert pan onto serving platter and release sides. Remove bottom of pan (now on top) and serve."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "Two 6-inch corn tortillas",
        "1 poblano chile",
        "3 cups corn kernels, thawed if frozen",
        "1 1/2 cups 2-percent milk",
        "1/2 teaspoon canola oil",
        "1 cup diced onion",
        "1 teaspoon salt",
        "2 garlic cloves, minced",
        "2 large eggs plus 2 large egg whites, lightly beaten",
        "3/4 cup grated reduced-fat Cheddar (about 3 ounces)",
        "1/2 cup fat-free sour cream",
        "3 tablespoons masa harina de maiz (see tip, below)",
        "1 teaspoon sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Cheese",
        "Egg",
        "Garlic",
        "Onion",
        "Side",
        "Bake",
        "Vegetarian",
        "Corn",
        "Hot Pepper",
        "Healthy",
        "Sour Cream",
        "Tortillas"
    ],
    "title": "Indian Corn Pudding",
    "url": "http://www.epicurious.com/recipes/food/views/indian-corn-pudding-234920"
}
