{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Whisk all-purpose flour, pastry flour, and salt together in a bowl. Drizzle 2 tablespoons vegetable oil into the flour mixture while stirring until clumps form. Stir cold water, 1 tablespoon at a time, into the dough until it holds together; shape into ball, cover with damp towel, and set aside.",
        "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 15 minutes; drain. Transfer drained potatoes to a large bowl and mash until only small chunks remain.",
        "Stir mustard seeds, curry powder, ground ginger, cumin, and red pepper flakes together in a bowl.",
        "Heat 1 1/2 teaspoons vegetable oil in a skillet over medium heat. Cook and stir onion, carrot, and garlic in the hot oil until carrot is tender, about 5 minutes.",
        "Move onion mixture to one side of the skillet. Pour seasoning mixture to the skillet and cook until the spices are toasted and fragrant, about 30 seconds. Stir onion mixture and spice mixture together; add vegetable broth and peas to the skillet and stir.",
        "Fold the carrot mixture into the mashed potatoes; add sugar, stir, and season with salt and pepper. Spread the filling into a 9-inch pie plate.",
        "Turn dough out onto a lightly floured work surface; roll out to an 11-inch disc. Place dough atop the pie filling, pressing down on the dough in several spots to remove any pockets of air. Trim excess dough from edges. Crimp edges of dough with your fingers. Cut a large 'X' in the center of the dough to vent steam. Brush milk over the dough.",
        "Bake in preheated oven until crust is golden brown, 40 to 50 minutes. Cool pie 5 minutes before serving."
    ],
    "ingredients": [
        "Crust:",
        "1/2 cup all-purpose flour",
        "1/2 cup whole-wheat pastry flour",
        "1/4 teaspoon salt",
        "2 tablespoons vegetable oil",
        "6 tablespoons ice-cold water, or more as needed",
        "Filling:",
        "1 1/4 pounds potatoes, peeled and quartered",
        "1 tablespoon black or yellow mustard seeds",
        "1 teaspoon curry powder, or more to taste",
        "1 teaspoon ground ginger",
        "1/2 teaspoon ground cumin",
        "1/8 teaspoon red pepper flakes (optional)",
        "1 1/2 teaspoons vegetable oil",
        "1 cup diced onion",
        "1/2 cup diced carrot",
        "1 tablespoon minced garlic",
        "1 cup low-sodium vegetable broth",
        "1 cup frozen peas",
        "2 teaspoons white sugar",
        "salt and ground black pepper to taste",
        "2 tablespoons milk"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Indian Samosa Pie",
    "url": "http://allrecipes.com/recipe/237072/indian-samosa-pie/"
}
