{
    "directions": [
        "Whisk flour and salt in medium bowl. Using fingertips, rub butter into flour mixture until coarse meal forms. Add 4 tablespoons ice water, 1 tablespoonful at a time, stirring until dough forms moist clumps, and adding more water by teaspoonfuls as needed if dough is too dry. Form dough into 2 balls; flatten each into disk. Wrap in plastic wrap and chill at least 30 minutes. DO AHEAD: Can be made 2 days ahead. Keep chilled. Let stand at room temperature 15 minutes before rolling out.",
        "Place zucchini in colander set over large bowl. Sprinkle with 3/4 teaspoon salt and toss to coat. Let drain 30 minutes. Working in batches, squeeze zucchini in kitchen towel to remove as much liquid as possible.",
        "Melt 2 tablespoons butter with oil in heavy large skillet over medium heat. Add onion and sauté until soft and translucent, about 7 minutes. Add garlic and sauté until fragrant, about 30 seconds. Add zucchini and lemon juice; reduce heat to medium-low and cook until zucchini is tender, stirring occasionally, about 12 minutes. Cool to room temperature.",
        "Whisk ricotta cheese, 1/3 cup Parmesan, egg, lemon peel, 1/2 teaspoon pepper, and remaining 1/2 teaspoon salt in medium bowl. Stir in cooled zucchini mixture.",
        "Preheat oven to 425°F. Line 2 large baking sheets with parchment paper. Roll out 1 dough disk to 1/8-inch thickness. Using 6-inch-diameter plate, cut out 3 dough rounds. Repeat with remaining dough. Place 3 dough rounds on each baking sheet.",
        "Melt remaining 2 tablespoons butter. Spoon 1/2 cup filling into center of 1 dough round, leaving 1 1/4- to 1 1/2-inch border. Carefully fold up border, pleating dough edges to create round pastry with about 2 to 21/2 inches of exposed filling in center. Repeat with remaining filling and dough rounds. Brush crusts with melted butter. Drizzle any remaining melted butter over filling in centers. Sprinkle galettes with remaining 1/4 cup Parmesan cheese. Sprinkle lightly with fleur de sel.",
        "Bake galettes 15 minutes. Reduce oven temperature to 375°F. Bake until crust is golden and filling is set and begins to brown, about 25 minutes longer. Run spatula under galettes to loosen. Let rest 5 minutes. do ahead Can be made 4 hours ahead. Let stand at room temperature.",
        "Serve individual galettes hot or at room temperature.",
        "A type of sea salt; available at some supermarkets and at specialty foods stores."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "1/2 teaspoon salt",
        "3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
        "4 tablespoons (or more) ice water",
        "5 2/3 cups coarsely grated zucchini (about 1 1/3 pounds)",
        "1 1/4 teaspoons salt, divided",
        "4 tablespoons butter, divided",
        "4 teaspoons extra-virgin olive oil",
        "1 cup finely chopped onion",
        "1 small garlic clove, minced",
        "2 teaspoons fresh lemon juice",
        "1 1/4 cups ricotta cheese",
        "1/3 cup plus 1/4 cup grated Parmesan cheese",
        "1 large egg",
        "2 teaspoons finely grated lemon peel",
        "1/2 teaspoon ground black pepper",
        "Fleur de sel*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Side",
        "Bake",
        "Picnic",
        "Vegetarian",
        "High Fiber",
        "Mother's Day",
        "Bastille Day",
        "Dinner",
        "Lunch",
        "Parmesan",
        "Ricotta",
        "Lemon",
        "Zucchini",
        "Shower",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Individual Zucchini, Lemon, and Ricotta Galettes",
    "url": "http://www.epicurious.com/recipes/food/views/individual-zucchini-lemon-and-ricotta-galettes-350127"
}
