{
    "directions": [
        "Put oven rack in middle positionand preheat oven to 400°F. Line a shallow baking pan with foil.",
        "Cook onion and garlic in oil in a 10-inch skillet over moderate heat, stirring frequently, until just softened, about 4 minutes.",
        "Stir together bread crumbs,milk, eggs, parsley, Worcestershire sauce, Tabasco, salt, and pepper in a large bowl. Gently combine meat if necessary, then add to bread-crumb mixture along with onion mixture and gently knead with your hands until just combined. (Mixture will be moist. Wipe out skillet and reserve.)",
        "Using a 1-cup measure, drop slightly rounded cups of mixture into baking pan and lightly pat to form 4 domes.",
        "Stir together ketchup and vinegar and spoon over mounds. Bake meatloaves until center of each loaf registers 155°F on thermometer, about 25 minutes.",
        "While meatloaves bake, cook bacon in skillet over moderate heat, stirring occasionally, until crisp, about 7 minutes. Transfer with a slotted spoon to paper towels to drain.",
        "Turn on broiler and broil meatloaves 2 to 3 inches from heat until glaze is slightly caramelized, 1 to 2 minutes.",
        "Serve meatloaves topped with bacon."
    ],
    "ingredients": [
        "1 medium onion, finely chopped (1 cup)",
        "2 garlic cloves, finely chopped",
        "1 tablespoon olive oil",
        "1 cup fresh bread crumbs (from 2 slices firm white sandwich bread)",
        "3/4 cup whole milk",
        "2 large eggs, lightly beaten",
        "3 tablespoons finely chopped fresh flat-leaf parsley",
        "1 1/2 tablespoons Worcestershire sauce",
        "1/2 teaspoon Tabasco",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon black pepper",
        "1 1/2 lb meatloaf mix or equal parts ground beef chuck, pork, and veal",
        "1/4 cup ketchup",
        "2 tablespoons distilled white or cider vinegar",
        "4 bacon slices, cut into 1 1/2-inch pieces",
        "Special equipment: an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Beef",
        "Pork",
        "Bake",
        "Sauté",
        "Super Bowl",
        "Vinegar",
        "Ground Beef",
        "Bacon",
        "Winter",
        "Gourmet"
    ],
    "title": "Individual Meatloaves with Bacon Crisps",
    "url": "http://www.epicurious.com/recipes/food/views/individual-meatloaves-with-bacon-crisps-109113"
}
