{
    "directions": [
        "Stir ice cream and nutmeg in medium bowl to blend. Cover with foil and freeze. (Can be prepared 3 days ahead. Keep frozen.)",
        "Preheat oven to 300°F. Butter 8x8x2-inch glass baking dish. Combine cornmeal and salt in heavy medium saucepan. Gradually whisk in 21/2 cups milk. Whisk over medium heat until mixture boils. Reduce heat to medium-low and simmer until mixture is thick and creamy, stirring often, about 10 minutes. Whisk in butter. Remove from heat.",
        "Whisk eggs, molasses, brown sugar, sugar, ground ginger and cinnamon in large bowl. Gradually whisk in hot cornmeal mixture. Stir in raisins. Pour pudding into prepared baking dish. Pour remaining 1/2 cup milk over pudding (do not mix into pudding). Place pudding dish in large roasting pan. Pour enough hot water into roasting pan to come halfway up sides of pudding dish.",
        "Bake pudding until just set, about 1 hour 30 minutes. Remove pudding from roasting pan. Cool until lukewarm, about 20 minutes. (Can be made 8 hours ahead. Cool; cover with plastic and let stand at room temperature. Rewarm covered pudding in microwave oven on low about 8 minutes.)",
        "Spoon warm pudding into shallow bowls. Top with scoop of ice cream."
    ],
    "ingredients": [
        "1 quart vanilla ice cream or frozen vanilla yogurt, slightly softened",
        "1 1/2 teaspoons ground nutmeg",
        "1/4 cup yellow cornmeal",
        "1/4 teaspoon salt",
        "3 cups whole milk",
        "2 tablespoons (1/4 stick) unsalted butter",
        "2 large eggs",
        "1/2 cup mild-flavored (light) molasses",
        "2 tablespoons (packed) golden brown sugar",
        "2 tablespoons sugar",
        "1 teaspoon ground ginger",
        "1/2 teaspoon ground cinnamon",
        "1/3 cup dark or golden raisins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Ginger",
        "Dessert",
        "Thanksgiving",
        "Raisin",
        "Spice",
        "Fall",
        "Molasses"
    ],
    "title": "Indian Pudding with Nutmeg Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/indian-pudding-with-nutmeg-ice-cream-2761"
}
