{
    "directions": [
        "Melt butter in a skillet over medium heat and cook and stir 1 chopped onion in the melted butter until onion is translucent, about 5 minutes.",
        "Place a large saucepan over medium-high heat and pour in pinto beans, kidney beans, pork and beans, tomato sauce, cooked onion, and 1/4 cup water, stirring to combine. Bring the mixture to a boil, reduce heat to low, and stir in 3 tablespoons sugar, chili seasoning mix, chili powder, and seasoned salt. Let the chili simmer while you finish the remaining steps, 10 to 20 minutes. Stir chili occasionally.",
        "Mix 3 cups flour with baking powder, 6 tablespoons sugar, and salt in a large mixing bowl; stir in 2 cups of water or amount needed to make a workable dough. Spread 1 cup flour onto a work surface and scoop up about 1/4 cup of dough; drop it onto the flour and sprinkle surface with flour. Roll the dough into a flat round tortilla.",
        "Heat oil in a deep-fryer or large skillet to 375 degrees F (190 degrees C).",
        "Gently lay tortilla into the hot oil and deep fry until golden brown on both sides, 2 to 3 minutes per side. Dough will expand as it fries. Remove fry bread and drain on paper towels; continue to make and fry pieces of dough until all dough has been used.",
        "Place lettuce, tomatoes, Cheddar cheese, 1 chopped onion, and sour cream into separate bowls. To serve, spoon a ladle of chili onto each fry bread and sprinkle with desired garnishes; top each serving with a dollop of sour cream."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "1 onion, chopped",
        "2 (15 ounce) cans pinto beans, undrained",
        "1 (15 ounce) can kidney beans, undrained",
        "1 (15 ounce) can pork and beans",
        "1 (16 ounce) can tomato sauce",
        "1/4 cup water",
        "3 tablespoons sugar",
        "1/2 (1.25 ounce) package chili seasoning mix",
        "1 teaspoon chili powder",
        "1/2 teaspoon seasoned salt",
        "3 cups all-purpose flour",
        "2 tablespoons baking powder",
        "6 tablespoons white sugar",
        "1/2 teaspoon salt",
        "2 cups water, or as needed",
        "1 cup all-purpose flour",
        "3 cups vegetable oil for frying",
        "2 cups shredded lettuce",
        "2 tomatoes, chopped",
        "1 cup shredded Cheddar cheese",
        "1 onion, chopped",
        "1/2 cup sour cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Indian Tacos Deluxe",
    "url": "http://allrecipes.com/recipe/222992/indian-tacos-deluxe/"
}
