{
    "directions": [
        "On a lightly floured surface with a lightly floured rolling pin roll out each puff pastry sheet into a 14- by 13-inch-rectangle. With 1 or more star-shaped cutters cut out 24 pastry stars. Divide pastry stars between 2 baking sheets, arranging in one layer, and freeze 5 minutes.",
        "Remove baking sheets from freezer. Brush top of each pastry star lightly with some egg wash (be careful not to drip down edges of pastry) and bake in middle and lower thirds of oven about 5 minutes. Alternate baking sheets and bake 5 to 10 minutes more, or until pastry stars are puffed and golden brown. Transfer pastry stars to a rack and cool completely. Pastry stars may be made 2 days ahead and kept in a sealed plastic bag at room temperature. Makes 24 stars.",
        "In a large bowl whisk together water, lemon juice, and cornstarch until combined well. Add berries and sugar, tossing gently to combine well. Divide berry mixture evenly among eight 1 1/2-cup shallow ramekins or baking dishes and put in 2 shallow baking pans. Bake berries in middle and lower thirds of oven 25 minutes and cool slightly.",
        "Top each serving decoratively with pastry stars and a scoop of ice cream. Serve cobblers hot or warm.",
        "In a small heavy saucepan whisk together yolks, lemon juice, and sugar and cook over moderate heat, whisking constantly, about 15 minutes, or until a candy thermometer registers 175°F. (do not boil). Strain mixture through a sieve into a bowl and cool, surface covered with plastic wrap.",
        "Whisk buttermilk and zest into cooled lemon curd until combined well and freeze in an ice-cream maker. Makes about 4 cups."
    ],
    "ingredients": [
        "2 sheets frozen puff pastry (about 1 pound), thawed",
        "an egg wash made by whisking 1 large egg yolk with 1 tablespoon water",
        "1/3 cup water",
        "3 tablespoons fresh lemon juice",
        "3 1/2 tablespoons cornstarch",
        "5 cups fresh blackberries (about 5 half-pints)",
        "5 cups fresh raspberries (about 4 half-pints)",
        "2 1/2 to 2 3/4 cups sugar, or to taste",
        "lemon buttermilk ice cream",
        "6 large egg yolks",
        "1/3 cup fresh lemon juice",
        "3/4 cup sugar",
        "2 cups buttermilk",
        "zest of 1 large lemon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Ice Cream Machine",
        "Dairy",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Kid-Friendly",
        "Frozen Dessert",
        "Blackberry",
        "Raspberry",
        "Lemon",
        "Summer",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Individual Berry Cobblers with Lemon Buttermilk Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/individual-berry-cobblers-with-lemon-buttermilk-ice-cream-10135"
}
