{
    "directions": [
        "To make the pizza dough, in a food processor, combine the 2 3/4 cups bread flour, the semolina flour, yeast and salt and pulse briefly to mix. With the motor running, drizzle in the warm water and then the 3 Tbs. olive oil. Process just until a ball of dough forms.",
        "Turn the dough out onto a lightly floured work surface and knead until smooth and elastic, 2 to 3 minutes. Pat back into a ball.",
        "Lightly oil a large bowl. Put the ball of dough in the bowl and turn to coat with the oil. Cover the bowl with plastic wrap and let the dough rise in a warm spot until doubled in bulk, about 1 1/2 hours.",
        "Prepare a hot fire in a charcoal grill or preheat a gas grill to high. If using charcoal, spread the hot coals across one half of the bottom of the grill and leave the other half clear to create a cool zone. If using gas, turn one of the burners to low. Lightly oil the grill grate.",
        "Punch the dough down and knead briefly to remove any air bubbles. On a lightly floured work surface, cut the dough into 4 equal pieces. Wrap 3 pieces in plastic wrap and set aside. Using your hands or a rolling pin, roll and stretch the remaining dough piece into a round about 10 inches in diameter and 1/4 inch thick. Carefully transfer the dough disk to a baking sheet lightly dusted with semolina flour or all-purpose flour and cover with a piece of parchment paper. Roll and stretch the remaining pieces of dough in the same way, stacking them between sheets of parchment.",
        "Brush one side of a dough disk with olive oil and place it, oiled side down, on the hot part of the grill. Repeat with a second dough disk if you have room on the grill. Grill just until slightly charred on the bottom and the crust has begun to puff and turn crispy, about 2 minutes. Using tongs and a wide spatula or pizza peel, flip the pizza and move it to the cool area of the grill. Top with 3/4 cup cheese and a few tomato slices. Scatter some of the onion and olives over the tomatoes. Cover and grill until the pizza is browned and crisped underneath and the cheese has melted, 3 to 5 minutes. Transfer to a warm oven while grilling the remaining pizzas.",
        "Carefully transfer the pizzas to a cutting board and top each with some of the arugula and basil. Drizzle with a little olive oil and sprinkle with salt. Cut into wedges and serve immediately. Serves 4.",
        "Adapted from Williams-Sonoma",
        "Rustic Italian",
        ", by Domenica Marchetti (Weldon Owen, 2011)."
    ],
    "ingredients": [
        "For the pizza dough;",
        "2 3/4 cups bread flour, plus more for dusting",
        "1/4 cup semolina flour",
        "2 tsp. rapid-rise yeast",
        "1 1/2 tsp. fine sea salt",
        "1 cup warm water (100° to 110°F)",
        "3 Tbs. extra-virgin olive oil, plus more for greasing",
        "Vegetable oil for greasing",
        "Semolina flour or unbleached all-purpose flour for dusting",
        "Extra-virgin olive oil for brushing and drizzling",
        "3 cups shredded Fontina Val d’Aosta, Cacio di Roma, goat’s milk Gouda or other melting cheese",
        "2 ripe summer tomatoes, thinly sliced",
        "1 small red onion, halved and cut into paper-thin slices",
        "1 cup pitted Gaeta or Kalamata olives, halved",
        "2 cups wild or baby arugula",
        "1/2 cup finely shredded fresh basil",
        "Fine sea salt, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Individual Grilled Pizzas (Pizzette alla Griglia)",
    "url": "http://www.williams-sonoma.com/recipe/individual-grilled-pizzas.html"
}
