{
    "directions": [
        "1. Lay the paneer, farmer's cheese, or tofu pieces in a single layer on a cookie sheet lined with paper towels and let dry for 10 minutes (this will enable them to hold their shape better during cooking).",
        "2. Puree the spinach and green pepper together in a food processor or blender. The puree should be as fine and velvety as you can make it.",
        "3. Heat 4 tablespoons of the oil in a large, heavy, nonstick pan over medium heat. Dust the paneer pieces lightly with flour and add them to the pan. Fry them in batches, turning and tossing them until they turn light golden (about 2 or 3 minutes per batch). Watch carefully to ensure that they do not burn. Take them out and put on a dish and set aside.",
        "4. Add 2 more tablespoons of oil to the same pan, along with the onion. Fry the onion, stirring constantly, until brown (about 20 minutes). Add the ginger and fry for an additional 2 minutes. Add the turneric and green chilies, stir for a few seconds, then add the spinach puree along with 1/2 cup water, salt, and sweet red peppers. Mix well and bring to a boil. Lower heat and cook, covered, for 2 minutes. Add the fried paneer pieces, mix again thoroughly, and continue cooking for 2 more minutes. Stir in the garam masala.",
        "When ready to serve, heat thoroughly and, if desired, fold in the remaining 2 tablespoons of oil to glaze and mellow the sauce."
    ],
    "ingredients": [
        "Indian cheese (paneer) made with 8 cups milk (see tips, below) or 8 ounces farmer's cheese or 2 cakes tofu, sliced as paneer",
        "2 cups cooked spinach",
        "1 sweet green pepper, cored and seeded",
        "6-8 tablespoons light vegetable oil",
        "1/3 cup all-purpose flour for dusting",
        "1 1/2 cups finely chopped onion",
        "2 tablespoons grated or crushed fresh ginger",
        "1/2 teaspoon turmeric",
        "4 hot green chilies, minced",
        "1/2 cup water",
        "1 teaspoon coarse salt, or to taste",
        "2 medium-size sweet red peppers, cored, seeded, and cut into 1-inch-wide strips",
        "2 teaspoons garam masala (see tips, below)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Food Processor",
        "Cheese",
        "Ginger",
        "Sauté",
        "Diwali",
        "Spice",
        "Spinach",
        "Bell Pepper",
        "Hot Pepper"
    ],
    "title": "Indian Cheese and Red Peppers in Fragrant Spinach Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/indian-cheese-and-red-peppers-in-fragrant-spinach-sauce-230902"
}
