{
    "directions": [
        "Butter 2 shallow 3/4-cup gratin dishes and dust them with the additional granulated sugar, shaking out the excess. In a bowl blend together 2 tablespoons of the remaining granulated sugar, the flour, the cocoa powder, the butter, and a pinch of salt until the mixture resembles meal. In a saucepan bring the milk to a boil. Whisk the cocoa mixture into the milk with the chocolate, cook the mixture over moderate heat, whisking, for 1 minute, or until it is thickened, and let it cool. In a bowl beat the egg yolk slightly and beat in the chocolate mixture. In another bowl beat the egg whites with a pinch of salt until they hold soft peaks, add the remaining 2 tablespoons granulated sugar, a little at a time, beating, and beat the meringue until it holds stiff glossy peaks. Stir one fourth of the meringue into the chocolate pastry cream to lighten it and fold in the remaining meringue gently but thoroughly. Divide the mixture between the prepared dishes and bake the soufflés in a shallow baking pan in the middle of a preheated 400°F. oven for 15 minutes, or until they are puffed. Dust the soufflés decoratively with the confectioners' sugar and serve them immediately."
    ],
    "ingredients": [
        "1/4 cup granulated sugar plus additional for dusting the dishes",
        "2 tablespoons all-purpose flour",
        "2 tablespoons Dutch-process cocoa powder",
        "1 tablespoon cold unsalted butter",
        "1/2 cup milk",
        "1/2 ounce unsweetened chocolate, chopped fine",
        "1 large egg yolk",
        "2 large egg whites",
        "confectioners' sugar for dusting the soufflés"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Chocolate",
        "Egg",
        "Dessert",
        "Bake",
        "Valentine's Day",
        "Winter",
        "Gourmet",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Individual Chocolate Souffles",
    "url": "http://www.epicurious.com/recipes/food/views/individual-chocolate-souffles-11330"
}
