{
    "directions": [
        "Heat ghee in a large Dutch oven over medium heat. Season chicken with salt and pepper. Working in batches, cook chicken, skin side down, until golden brown (do not turn), 8–10 minutes. Transfer to a plate.",
        "Add onion, garlic, and ginger to pot and cook, stirring occasionally, until onion is very soft and golden brown, 8–10 minutes. Add tomato paste, garam masala, cumin, turmeric, coriander, cayenne, and cardamom and cook, stirring often, until tomato paste is beginning to darken, about 4 minutes.",
        "Add chicken, broth, tomato purée, and cream to pot; season with salt and pepper. Bring to a boil, reduce heat, and simmer, partially covered, skimming occasionally, until chicken is almost falling off the bone and liquid is slightly thickened, 1 1/2–2 hours.",
        "Add potatoes to pot and cook, partially covered, until potatoes are fork-tender, chicken is falling off the bone, and liquid is thick enough to coat a spoon, 30–45 minutes. Remove skin and bones from chicken, if desired, and return meat to pot; season stew with salt and pepper.",
        "Divide stew among bowls, top with yogurt and mint, and serve with naan, flatbread, or rice.",
        "DO AHEAD: Stew can be made 3 days ahead. Let cool; cover and chill."
    ],
    "ingredients": [
        "3 tablespoons ghee (clarified butter) or vegetable oil",
        "6 chicken legs (drumsticks with thighs; about 3 pounds)",
        "Kosher salt",
        "freshly ground pepper",
        "1 medium onion, finely chopped",
        "4 garlic cloves, finely grated",
        "2 tablespoons finely grated peeled ginger",
        "2 tablespoons tomato paste",
        "2 teaspoons garam masala",
        "2 teaspoons ground cumin",
        "2 teaspoons ground turmeric",
        "1 1/2 teaspoons ground coriander",
        "3/4 teaspoon cayenne pepper",
        "3/4 teaspoon ground cardamom",
        "8 cups low-sodium chicken broth",
        "3/4 cup canned tomato purée",
        "1/2 cup heavy cream",
        "1 pound small Yukon Gold potatoes, sliced 1/4\" thick",
        "Plain yogurt, torn fresh mint, and naan, flatbread, or cooked rice (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Chicken",
        "Poultry",
        "Tomato",
        "Dinner",
        "Lunch",
        "Fall",
        "Winter",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Indian-Spiced Chicken With Tomato and Cream",
    "url": "http://www.epicurious.com/recipes/food/views/indian-spiced-chicken-with-tomato-and-cream-51214470"
}
