{
    "directions": [
        "In the large bowl of an electric mixer proof the yeast with the sugar in 1/3 cup of the water for 5 minutes, or until the mixture is foamy, stir in the remaining 1/3 cup water, the oil, 2 cups of the flour, and the salt, and blend the mixture until it forms a dough. Fit the mixer with the dough hook and knead the dough, incorporating as much of the remaining 1/4 cup flour as necessary to prevent the dough from sticking, for 3 minutes, or until it is smooth and elastic. Transfer the dough to an oiled bowl and turn it to coat it with the oil. Let the dough rise, covered with plastic wrap, in a warm place for 1 hour, or until it is double in bulk, and punch it down.",
        "Divide the dough into 6 pieces and on a floured surface roll out each piece into a 6-inch round. Transfer the rounds to baking sheets (preferably black steel, for a crisper crust), oiled and sprinkled with the cornmeal, and spread each of the rounds with a scant 1 tablespoon of the tomato sauce. Sprinkle the rounds evenly with the mozzarella and the Parmesan and top them with the pepperoni. Add salt and pepper to taste and drizzle the rounds with the oil. Bake the pizzas on the bottom rack of a preheated 500°F. electric oven or on the floor of a preheated 500°F. gas oven for 10 minutes, or until the pizza crusts are golden brown. Let the pizzas cool slightly before serving."
    ],
    "ingredients": [
        "a 1/4-ounce package (2 1/2 teaspoons) active dry yeast",
        "1/2 teaspoon sugar",
        "2/3 cup lukewarm water",
        "2 tablespoons olive oil",
        "2 to 2 1/4 cups unbleached all-purpose flour",
        "1/2 tablespoon salt",
        "cornmeal for sprinkling the baking sheets",
        "1/3 cup tomato sauce",
        "1/2 pound whole-milk mozzarella, grated (about 2/3 cup)",
        "freshly grated Parmesan for sprinkling the pizzas if desired",
        "36 thin slices of pepperoni",
        "2 teaspoons olive oil"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Tomato",
        "Bake",
        "Kid-Friendly",
        "Mozzarella",
        "Parmesan",
        "Gourmet"
    ],
    "title": "Individual Cheese and Pepperoni Pizzas",
    "url": "http://www.epicurious.com/recipes/food/views/individual-cheese-and-pepperoni-pizzas-11584"
}
