{
    "directions": [
        "Combine flour, 1/2 cup whole almonds and both sugars in processor. Blend mixture until almonds are finely ground. Add butter and process until moist clumps form, using on/off turns. Transfer to bowl. Mix in chopped toasted almonds. (Can be prepared 1 day ahead. Cover and refrigerate.)",
        "Preheat oven to 400°F. Combine rhubarb, orange juice, 5 tablespoons sugar and orange peel in heavy large saucepan. Bring to simmer over medium heat. Cook until rhubarb is tender but intact, stirring occasionally, about 10 minutes. Using slotted spoon, divide warm rhubarb among six 1 1/4-cup custard cups, leaving excess juices behind. Blend 1 tablespoon flour and 1 tablespoon sugar in small bowl. Whisk into juices in saucepan. Stir over medium-low heat until mixture boils and thickens, about 1 minute. Divide juice mixture equally among custard cups and stir into rhubarb.",
        "Sprinkle topping over filling, dividing equally. Bake until topping is deep golden brown, about 20 minutes. Cool crumbles on rack 15 minutes. Serve warm with ice cream or sweetened whipped cream."
    ],
    "ingredients": [
        "2/3 cup whole wheat flour",
        "1/2 cup whole almonds",
        "5 tablespoons sugar",
        "5 tablespoons (packed) golden brown sugar",
        "7 tablespoons chilled unsalted butter, cut into pieces",
        "2/3 cup chopped toasted almonds",
        "2 pounds fresh rhubarb, trimmed, cut into 1/2-inch lengths",
        "1/2 cup orange juice",
        "6 tablespoons sugar",
        "1 tablespoon grated orange peel",
        "1 tablespoon all purpose flour",
        "Vanilla ice cream or sweetened whipped cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Orange",
        "Almond",
        "Spring",
        "Rhubarb"
    ],
    "title": "Individual Rhubarb and Orange Crumbles",
    "url": "http://www.epicurious.com/recipes/food/views/individual-rhubarb-and-orange-crumbles-1951"
}
