{
    "directions": [
        "Squeeze 2 Tbs. juice from 1 of the lemons. Cut the remaining lemon into 8 wedges and set aside to serve with the chicken.",
        "Place the chicken in a large nonreactive baking dish and sprinkle evenly with the lemon juice and the 3/4 tsp. salt. Cover and refrigerate for 1 hour.",
        "Turn on a food processor and drop the garlic cloves through the feed tube to chop them. Stop the motor, add the onion and pulse until pureed. Add 1 cup of the yogurt, the curry powder, paprika, cinnamon and cayenne and pulse to combine. Pour the marinade over the chicken and mix well. Cover and refrigerate for at least 4 hours or up to 12 hours.",
        "Prepare a grill for indirect grilling over high heat. Lightly oil the grill grate.",
        "Remove the chicken from the marinade, gently shaking off the excess. Place the chicken, skin side down, on the cool side of the grill. Cover the grill and cook, without disturbing, until an instant-read thermometer inserted into the thickest part of the thigh, away from the bone, registers 170°F, 30 to 35 minutes.",
        "Meanwhile, in a small bowl, stir together the remaining 1 cup yogurt, the cucumber and chopped mint until blended. Season with salt and black pepper. Cover the raita and refrigerate until ready to serve.",
        "Transfer the chicken to a warmed platter and let rest for 5 minutes. Sprinkle with mint leaves and serve immediately. Pass the raita and lemon wedges at the table. Serves 4.",
        "Adapted from Williams-Sonoma",
        "New Flavors for Chicken",
        ", by Rick Rodgers (Oxmoor House, 2008)."
    ],
    "ingredients": [
        "2 lemons",
        "4 bone-in, skin-on whole chicken legs (each about 3/4 lb.)",
        "3/4 tsp. kosher salt, plus more, to taste",
        "2 garlic cloves",
        "1 small yellow onion, chopped",
        "2 cups plain yogurt",
        "1 Tbs. curry powder",
        "1 tsp. sweet paprika",
        "1/4 tsp. ground cinnamon",
        "1/8 tsp. cayenne pepper",
        "Canola oil for grilling",
        "1 cucumber, peeled, seeded and coarsely grated",
        "1 Tbs. chopped fresh mint, plus leaves for garnish",
        "Freshly ground black pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Indian-Spiced Grilled Chicken Legs with Raita",
    "url": "http://www.williams-sonoma.com/recipe/indian-spiced-grilled-chicken-legs-with-raita.html"
}
