{
    "directions": [
        "For the lemon curd: In a medium saucepan over low heat, combine the sugar, lemon juice, lemon zest, egg yolks and whole eggs, and whisk to combine. Cook, stirring frequently, until the temperature reaches about 168 degrees F on an instant-read thermometer, 6 to 10 minutes; the curd should be thick enough to coat the back of a spoon. Remove from the heat and whisk in the butter, a piece at a time, whisking each addition until fully combined.",
        "Transfer the curd to a bowl and place a piece of plastic wrap directly on the curd to prevent a skin from forming. Let cool to room temperature, then refrigerate until chilled, at least 1 hour and up to overnight.",
        "For the Bundt cakes: Preheat the oven to 350 degrees F.",
        "Grind the pistachios to a powder in a small food processor or grinder.",
        "Brush two 6-cavity mini Bundt pans with butter and dust with the pistachio powder.",
        "In a medium bowl, whisk together the flour, baking powder and salt. Set aside.",
        "In a stand mixer with the paddle attachment, beat the butter and sugar together on medium-high speed until light and fluffy, 2 to 3 minutes. Add the eggs, one at a time, beating until completely combined. Beat in the pistachio cream and sour cream.",
        "Reduce the mixer speed to low and add the flour mixture in two additions. Spoon about 1/4 cup of the batter into each Bundt mold and smooth batter on top.",
        "Bake until a toothpick inserted in the center comes out clean, 20 minutes. Invert the cakes onto a wire rack and let cool.",
        "Fill each cake center with 2 tablespoons of the chilled lemon curd."
    ],
    "ingredients": [
        "1 1/4 cups sugar",
        "1/2 cup lemon juice",
        "1 tablespoon grated lemon zest",
        "4 large egg yolks",
        "3 large whole eggs",
        "8 tablespoons (1 stick) cold butter, cut into pieces",
        "1 cup pistachios",
        "2 cups all-purpose flour",
        "3/4 teaspoon baking powder",
        "1/4 teaspoon salt",
        "8 tablespoons (1 stick) unsalted butter, room temperature, plus for buttering pans",
        "1 1/2 cups sugar",
        "4 large whole eggs",
        "3 tablespoons pistachio cream or 2 tablespoons pistachio paste",
        "3/4 cup sour cream"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Bundt Cake",
        "Cake",
        "Fruit",
        "Lemon Recipes",
        "Nut Recipes"
    ],
    "title": "Individual Pistachio Bundt Cakes with Lemon Curd Filling",
    "url": "http://www.foodnetwork.com/recipes/nancy-fuller/individual-pistachio-bundt-cakes-with-lemon-curd-filling"
}
