{
    "directions": [
        "Preheat oven to 200°F. Place 2 nonstick baking sheets in oven.",
        "In small saucepan, bring salted water to boil. Add peas and cook, uncovered, until heated through, about 2 to 3 minutes. Drain, then rinse in colander under cool, running water. Set aside in colander to drain completely.",
        "Using box grater or food processor fitted with grating disc, coarsely grate onion and place in colander set in sink. Coarsely grate potatoes, add to colander, and set aside to drain.",
        "In large mixing bowl, lightly beat eggs. Whisk in flour, coriander, turmeric, and cumin. Mix in ginger, cilantro, and peas.",
        "Press potatoes and onion to extract as much liquid as possible, then add to bowl. Season mixture with salt and freshly ground black pepper. Using wooden spoon or hands, mix well, but do not overwork.",
        "In heavy-bottomed, 12-inch skillet over moderately high heat, heat 1 tablespoon oil and 1 tablespoon butter until hot but not smoking. Drop 4 scant 1/4-cup portions of potato mixture into pan and flatten with spatula to form four 3-inch pancakes.",
        "Fry until bottoms are golden-brown, 4 to 5 minutes, then turn over and fry until golden-brown and crisp, an additional 4 to 5 minutes. Transfer to paper towels to drain; season immediately with salt and pepper. Keep warm on baking sheets in oven while making remaining pancakes.",
        "Using paper towels, carefully wipe out pan. And 1 tablespoon oil and 1 tablespoon butter and fry 4 more pancakes. Repeat with remaining batter, wiping out pan and adding 1 tablespoon oil and 1 tablespoon butter before each batch.",
        "Serve pancakes hot with Curry-Lime Yogurt."
    ],
    "ingredients": [
        "1/2 cup frozen peas",
        "1 medium onion, peeled",
        "4 large russet or Idaho potatoes (about 3 1/2 pounds), peeled",
        "2 large eggs",
        "2 tablespoons all-purpose flour",
        "1/4 teaspoon ground coriander",
        "1/4 teaspoon ground turmeric",
        "1/4 teaspoon ground cumin",
        "2 tablespoons minced peeled fresh ginger",
        "2 tablespoons minced fresh cilantro",
        "6 tablespoons vegetable oil",
        "6 tablespoons unsalted butter",
        "Curry-Lime Yogurt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Onion",
        "Potato",
        "Appetizer",
        "Fry",
        "Hanukkah",
        "Yogurt",
        "Pea",
        "Kosher",
        "Sugar Conscious",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Indian Potato Pancakes with Curry-Lime Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/indian-potato-pancakes-with-curry-lime-yogurt-233369"
}
