{
    "directions": [
        "In a food processor combine 1/2 cup of the flour and the yeast, with the motor running add the water, and turn the motor off. Add the oil, the sugar, the salt, and the remaining 1 cup flour, blend the mixture until it forms a ball, and turn it out onto a lightly floured surface. Knead the dough 8 to 10 times, form it into a ball, and let it rest while making the sausage mixture.",
        "In a small heavy skillet cook the sausage over moderate heat, stirring, until it is cooked through, transfer it with a slotted spoon to a bowl, and discard all but 1 tablespoons of the fat remaining in the skillet. In the fat cook the onion, the garlic, the orégano, the basil, and salt and pepper to taste over moderately low heat, stirring, until the onion is soft and transfer the onion mixture to the bowl.",
        "Halve the dough, form each half into a ball, and stretch each ball into 7-inch round, making the rounds slightly thicker around the edges. Transfer the rounds to a baking sheet (preferably black steel, for a crisper crust), oiled and sprinkled lightly with the cornmeal, top the rounds evenly with the sausage mixture, the tomatoes, the artichoke hearts, the mozzarella, the Parmesan, and salt and pepper to taste, and bake the pizzas on the bottom rack of a preheated 500°F. oven for 10 to 12 minutes, or until the crusts are golden brown."
    ],
    "ingredients": [
        "1 1/2 cups unbleached all-purpose flour",
        "1 1/4 teaspoon (half of a 1/4-ounce package) fast-acting yeast",
        "1/2 cup hot water (130°F.)",
        "1 tablespoon olive oil",
        "1 teaspoon sugar",
        "1/2 teaspoon salt",
        "1/2 pound hot Italian sausage, casing discarded and the sausage chopped",
        "1/2 cup finely chopped onion",
        "1 large garlic clove, or to taste, minced",
        "1/2 teaspoon dried orégano, crumbled",
        "1/2 teaspoon dried basil, crumbled",
        "yellow cornmeal for sprinkling the baking sheet",
        "a 14-ounce can Italian tomatoes, drained, chopped fine, and drained well again in a colander",
        "a 6-ounce jar marinated artichoke hearts, drained, rinsed, and patted dry",
        "1/2 cup coarsely grated mozzarella",
        "1/3 cup freshly grated Parmesan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Pork",
        "Tomato",
        "Vegetable",
        "Appetizer",
        "Bake",
        "Mozzarella",
        "Parmesan",
        "Sausage",
        "Artichoke",
        "Winter",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Individual Sausage, Tomato, and Artichoke-Heart Pizzas",
    "url": "http://www.epicurious.com/recipes/food/views/individual-sausage-tomato-and-artichoke-heart-pizzas-13529"
}
