{
    "directions": [
        "Cut shallots crosswise into very thin slices (less than 1/8 inch thick) with slicer.",
        "Heat oil in wok over moderate heat until hot but not smoking. Add shallots and reduce heat to moderately low, then fry, stirring frequently, until golden brown, 8 to 12 minutes. Carefully pour shallot mixture through a fine-mesh sieve set over a heatproof bowl. Transfer shallots to paper towels to drain, reserving shallot oil. (Shallots will crisp as they cool.) Wipe wok clean with paper towels.",
        "Cook noodles in a 6- to 8-quart pot of boiling unsalted water , stirring to separate, until just tender, 15 seconds to 1 minute. Drain in a colander and rinse under cold water to stop cooking. Shake colander briskly to drain excess water, then drizzle noodles with 2 teaspoons reserved shallot oil and toss to coat.",
        "Stir together broth, ketjap manis, fish sauce, sambal oelek, pepper, and 1/2 teaspoon salt in a small bowl for sauce.",
        "Cut tofu into 1-inch cubes and pat dry.",
        "Beat together eggs and a pinch of salt. Heat 1 tablespoon reserved shallot oil in wok over moderately high heat until hot but not smoking, then add eggs, swirling in wok, and cook until barely set in center, about 2 minutes. Gently slide egg crêpe out onto a cutting board, then roll into a loose cylinder and cut crosswise into 1/2-inch strips (do not unroll). Keep warm, loosely covered with foil.",
        "Heat 3 tablespoons reserved shallot oil in wok over high heat until hot but not smoking, then stir-fry onions with remaining 1/4 teaspoon salt until deep golden, 8 to 10 minutes. Add garlic and chile and stir-fry 1 minute, then add tofu and stir-fry 3 minutes. Add snow peas and long beans and stir-fry until vegetables are crisp-tender, about 5 minutes. Add sauce and bring to a boil, then add noodles and stir-fry (use 2 spatulas to stir if necessary) until noodles are hot. Transfer to a large platter and arrange egg over noodles. Sprinkle with scallions and half of shallots. Serve remaining shallots on the side."
    ],
    "ingredients": [
        "3 large shallots (6 ounces)",
        "1/2 cup peanut or vegetable oil",
        "1 pound fresh flat Chinese stir-fry egg noodles (not cooked)",
        "1/2 cup reduced-sodium chicken broth or water",
        "3 tablespoons ketjap manis (Indonesian sweet soy sauce)",
        "1 1/2 tablespoons Asian fish sauce",
        "1 tablespoon sambal oelek or Sriracha (Southeast Asian chile sauce), or to taste",
        "1/2 teaspoon black pepper",
        "3/4 teaspoon salt",
        "1 (14- to 16-ounce) package firm tofu",
        "4 large eggs",
        "2 large onions, halved lengthwise, then cut crosswise into 1/2-inch slices (4 cups)",
        "2 teaspoons finely chopped garlic",
        "1/4 teaspoon minced fresh red or green Thai or serrano chile, including seeds",
        "6 ounce snow peas, cut diagonally into 1-inch pieces (2 cups)",
        "6 ounce Chinese long beans or haricots verts, cut crosswise into 2-inch pieces (1 1/2 cups)",
        "2 scallions, cut diagonally into very thin slices",
        "Special equipment : an adjustable-blade slicer; a well-seasoned 14-inch flat-bottomed wok",
        "Garnish: sliced cucumber; sliced tomatoes; lime wedges; sambal oelek or Sriracha (Southeast Asian chile sauce)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Egg",
        "Garlic",
        "Onion",
        "Pasta",
        "Pepper",
        "Soy",
        "Vegetable",
        "Stir-Fry",
        "Gourmet"
    ],
    "title": "Indonesian Fried Noodles",
    "url": "http://www.epicurious.com/recipes/food/views/indonesian-fried-noodles-238437"
}
