{
    "directions": [
        "Rinse rice in a large sieve and drain well. Bring rice, water, and 1 1/2 cups chicken broth to a full rolling boil in a 4-quart heavy saucepan. Cover pan, then reduce heat to very low and cook until liquid is absorbed and rice is tender, about 15 minutes. Remove pan from heat and let rice stand, covered, 5 minutes. Gently fluff with a fork, then transfer to a large shallow bowl or a large shallow baking pan and cool to room temperature, about 30 minutes. Chill rice, covered, 8 to 12 hours.",
        "Heat 1 quart of oil in a 4-quart pot over high heat until thermometer registers 375°F. Gently drop 2 krupuk into oil, then fry until they float to the surface, curl up, and expand, about 20 seconds. Turn krupuk over and fry until pale golden, about 10 seconds, then transfer with a slotted spoon to paper towels to drain. Fry remaining krupuk in 3 batches in same manner, transferring to paper towels to drain, then cool and break into pieces.",
        "Break up rice into individual grains with your fingers.",
        "Heat remaining 3 tablespoons oil in wok over high heat until hot but not smoking, then add shallots and stir-fry 1 minute. Add garlic and stir-fry 30 seconds. Add chicken and stir-fry until outside is no longer pink, about 2 minutes. Add shrimp, chiles, and salt and stir-fry until shrimp are just cooked through, 2 to 3 minutes. Add remaining 1/4 cup broth with ketjap manis and rice and stir-fry until rice is heated through, about 2 minutes. Remove wok from heat and stir in fish sauce and scallions until combined well.",
        "Serve nasi goreng on a platter with krupuk, cucumber slices, and hard-boiled eggs.",
        "*Available at adrianascaravan.com."
    ],
    "ingredients": [
        "1 1/2 cups long-grain white rice (10 oz)",
        "3/4 cup water",
        "1 3/4 cups reduced-sodium chicken broth (14 fl oz)",
        "1 qt plus 3 tablespoons vegetable oil",
        "8 krupuk* (Indonesian shrimp crackers; optional)",
        "2 cups thinly sliced shallots (3/4 lb)",
        "2 large garlic cloves, finely chopped",
        "1 lb skinless boneless chicken breast, cut into 3/4-inch pieces",
        "1 lb medium shrimp in shell (31 to 35 per pound), peeled and deveined",
        "2 to 3 (2 1/2-inch) fresh hot red chiles, such as Thai or serrano, minced, including seeds",
        "1 1/4 teaspoons salt",
        "2 tablespoons ketjap manis* (Indonesian sweet soy sauce)",
        "1 tablespoon Asian fish sauce",
        "4 scallions, thinly sliced",
        "Special equipment: a deep-fat thermometer; a large wok",
        "Accompaniments: sliced cucumber; wedges of hard-boiled egg"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wok",
        "Chicken",
        "Egg",
        "Rice",
        "Side",
        "Stir-Fry",
        "Shrimp",
        "Hot Pepper",
        "Shallot",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "No Sugar Added"
    ],
    "title": "Indonesian Fried Rice",
    "url": "http://www.epicurious.com/recipes/food/views/indonesian-fried-rice-233562"
}
