{
    "directions": [
        "1. Preheat your oven to 325 degrees Fahrenheit. Grease and lightly flour a 9 x 3-1/2-inch tube cake pan (or — my preference — use a nonstick pan of that size, and don't grease and flour it).",
        "2. In a medium bowl, resift the sifted flour along with the baking powder, nutmeg, clove, cinnamon, and salt. Resift the flour mixture one more time, then set it aside.",
        "3. In another bowl, beat the softened butter until it is soft and very pliant, about 1 minute (or about 4 to 6 minutes by hand with a wooden spoon). Gradually add the sugar, and beat on high speed until it is pale and fluffy, about 3 to 5 minutes (or about 6 to 8 minutes by hand).",
        "4. Beat in the 4 whole eggs by hand, one at a time, until the butter and egg mixture is light and fluffy, about 2 minutes (or 5 minutes by hand).",
        "5. Add the flour mixture to the butter and egg mixture in 3 equal parts, beating on low speed or stirring with the wooden spoon until the batter is smooth and the flour is well combined with the butter and eggs. Add the lightly beaten egg yolks and the vanilla, and continue to beat or stir until they are well mixed into the batter.",
        "6. Pour the batter into the prepared pan, spreading it until the surface is even.",
        "7. Place the pan on the middle rack of the oven and bake until a toothpick inserted into the thickest part of the cake comes out clean, about 1 hour. This cake will nearly double in size as it cooks.",
        "8. Remove the pan from the oven and set the cake on a wire rack to cool in the pan for 10 minutes. If necessary, run a thin knife around the perimeter and the inner rim of the cake to help detach it from the pan. Invert the cake, turning it out upside down onto a wire rack to finish cooling.",
        "9. Transfer the cake to a serving platter and sprinkle the top with sifted confectioners' sugar, if desired."
    ],
    "ingredients": [
        "All ingredients should be at room temperature.",
        "2 cups sifted cake flour (don't use self-rising flour), plus more for dusting",
        "1/2 teaspoon baking powder",
        "1 teaspoon freshly grated nutmeg",
        "1/2 teaspoon ground clove",
        "4 teaspoons ground cinnamon",
        "Pinch of salt",
        "3/4 pound unsalted butter (3 sticks), plus more for greasing",
        "1 2/3 cup sugar",
        "4 large eggs",
        "3 large egg yolks, lightly beaten",
        "2 teaspoons vanilla extract",
        "1 tablespoon sifted confectioners' sugar (for garnish, optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Dessert",
        "Bake",
        "Ramadan",
        "Spice",
        "Vanilla",
        "Cinnamon",
        "Clove",
        "Nutmeg",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Indonesian Spice Cake",
    "url": "http://www.epicurious.com/recipes/food/views/indonesian-spice-cake-237071"
}
