{
    "directions": [
        "Place potatoes in large saucepan; cover with cold water and bring to boil. Reduce heat to medium and cook just until tender, 15 to 20 minutes. Drain well. Cool completely, then cover and refrigerate until well chilled, at least 2 hours and up to 2 days.",
        "Into each bag or cheesecloth pouch, put: 2 potatoes, l ear corn, 1/4 of steamers, 1/4 of mussels, 1 piece sausage, 1 lobster, and 1 egg. Gather bags or pouches together and tie closed with kitchen twine.",
        "Fill 5-gallon pot with 1 inch of water and add 1 tablespoon salt. Add steamer rack or enough rockweed to keep clambakes elevated. Cover and bring to rolling boil.",
        "Gently layer bags in pot. Nestle extra egg in a central position where it's easily retrievable. Cover tightly and steam 15 minutes, maintaining water at full rolling boil. Uncover pot, set aside extra egg, and gently rearrange bags from top to bottom to promote even cooking. Replace egg and re-cover pot.",
        "Steam additional 5 minutes, then retrieve extra egg and crack open. If it's hard-cooked, clambakes are done. If egg is not yet cooked, steam bags an additional 5 to 10 minutes. (If you're unsure, untie one bag and test with another egg). When done, lobsters will be completely red. Transfer each bag to large plate and serve immediately.",
        "To serve, divide melted butter among 4 small cups and season to taste with salt. Ladle some broth from pot into 4 small bowls. Cut open bags. Discard any steamers or mussels that have not opened and loosely arrange food on plates. Sprinkle with Old Bay seasoning. Place one cup of butter, one dish of broth, and one lemon wedge on each plate. Have bowls for shells and plenty of napkins at the ready."
    ],
    "ingredients": [
        "2 pounds medium new potatoes, red or white",
        "4 ears corn, husked",
        "2 pounds soft-shelled steamer clams, scrubbed",
        "1 1/2 pounds mussels, scrubbed and beards removed",
        "1 pound Spanish-style chorizo or linguiça, cut crosswise into 4 pieces (andouille or smoked kielbasa sausage can be substituted)",
        "4 (1 to 1 1/4 pound) live lobsters",
        "5 large eggs",
        "4 large mesh bags (such as onions or citrus fruit come in) or 4 pouches made from several wide layers cheesecloth",
        "Kitchen twine",
        "Large pot (5 or more gallons) with tightly-fitting lid",
        "Rockweed (see Chef's Notes, below) or steamer rack",
        "12 tablespoons (1 1/2 sticks) unsalted butter, melted",
        "Old Bay seasoning",
        "4 lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Egg",
        "Potato",
        "Steam",
        "Sausage",
        "Clam",
        "Lobster",
        "Mussel",
        "Corn",
        "Summer"
    ],
    "title": "Indoor Clambake",
    "url": "http://www.epicurious.com/recipes/food/views/indoor-clambake-232597"
}
