{
    "directions": [
        "Heat the olive oil and butter in a large skillet over medium heat. Add the onions and cook until softened, stirring occasionally, about 20 minutes. Reduce the heat to low, add 3 thyme sprigs, and continue to cook and stir until onions are completely soft and light brown in color, 30 to 40 minutes more. Remove from heat and discard thyme sprigs. Season with 1/2 teaspoon salt and 1/4 teaspoon pepper.",
        "In a medium pot over medium heat, cook the figs, orange zest and juice, vinegar, honey, 3 thyme sprigs, and 1/2 cup water. Stir occasionally until thickened and starting to break down, 12 to 15 minutes. Add additional water, 1 tablespoon at a time, if necessary to achieve a jammy consistency. Discard the orange zest and thyme sprigs, stir in the hazelnuts, and cook 2 minutes more. Remove from heat and season with 1/4 teaspoon salt and 1/4 teaspoon pepper.",
        "Heat a grill or grill pan over medium high heat. Brush the slices of Halloumi on one side with 1 tablespoon olive oil. Place the oiled side on the grill and cook until browned, 1 to 2 minutes. Place one slice Halloumi, grilled side down, on a plate and layer 1/4 cup arugula, 2 tablespoons caramelized onions, and 2 tablespoons fig chutney on top. Top with another slice of Halloumi, grilled side up, to form a sandwich. Repeat with remaining Halloumi to make a second sandwich.",
        "The leftover caramelized onions and fig chutney can be refrigerated for up to a week."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 tablespoon unsalted butter",
        "2 large yellow onions, halved and very thinly sliced",
        "3 thyme sprigs",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon black pepper",
        "1 1/2 cups chopped dried black mission figs",
        "2 (3-inch) strips orange zest",
        "2 tablespoons fresh orange juice",
        "1/4 cup apple cider vinegar",
        "2 tablespoons honey",
        "3 thyme sprigs",
        "1/4 cup chopped hazelnuts",
        "1/4 teaspoon kosher salt",
        "1/4 teaspoon black pepper",
        "8 ounces Halloumi cheese, sliced lengthwise into 4 (3/8-inch-thick) slices",
        "1 tablespoon olive oil",
        "1/2 cup baby arugula"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Cheese",
        "Kid-Friendly",
        "Fig",
        "Arugula",
        "Party"
    ],
    "title": "Inside-Out Grilled Cheese with Fig Chutney and Caramelized Onions",
    "url": "http://www.epicurious.com/recipes/food/views/inside-out-grilled-cheese-with-fig-chutney-and-caramelized-onions-51234920"
}
