{
    "directions": [
        "Combine the basil, oil, cheese, garlic, and pine nuts in a small food processor or blender. Pulse until a coarse paste forms, adding a tablespoon or two of water or more olive oil, if necessary to get a loose-enough consistency. Set aside 1/3 cup of pesto for this recipe; the remainder can be refrigerated in an airtight container for a week or so, or frozen for several months.",
        "In a large bowl, dissolve 1 tablespoon of kosher salt in the water. Add the chickpeas and soak at room temperature for 8 to 24 hours. Drain and rinse.",
        "Preheat the Instant Pot by selecting Sauté and adjust to More for high heat. Add the olive oil and heat until it shimmers. Add the onion and sprinkle with 1/4 teaspoon of salt. Cook, stirring frequently, until the onion pieces separate and soften, 2 to 3 minutes.",
        "Add the drained chickpeas, carrots, tomatoes with their juice, stock, and remaining 1/4 teaspoon of salt. Lock the lid into place. Select Manual; adjust the pressure to High and\nthe time to 10 minutes. After cooking, naturally release the pressure for 10 minutes, then quick release any remaining pressure. Unlock and remove the lid.",
        "Ladle the chickpeas into bowls and top each with a spoonful of pesto. Sprinkle with the cheese\nand serve."
    ],
    "ingredients": [
        "1 1/2 packed cups fresh basil leaves (about 3/4 ounce)",
        "1/4 cup extra-virgin olive oil, plus additional if needed",
        "1/4 cup grated Parmesan cheese (about 1 ounce)",
        "1 garlic clove, minced",
        "1 tablespoon toasted pine nuts",
        "1 tablespoon plus 1/2 teaspoon kosher salt, divided",
        "1 quart water",
        "12 ounces dried chickpeas",
        "2 tablespoons extra-virgin olive oil",
        "1 small onion, chopped (about 3/4 cup)",
        "2 medium carrots, peeled and chopped (about 3/4 cup)",
        "1 (14-ounce) can diced tomatoes, undrained",
        "4 cups chicken stock",
        "1/4 cup grated Parmesan or similar cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Instant Pot",
        "Pressure Cooker",
        "Chickpea",
        "Vegetarian",
        "Basil",
        "Pine Nut",
        "Parmesan",
        "Carrot",
        "Tomato"
    ],
    "title": "Instant-Pot Italian Chickpea Stew With Pesto",
    "url": "http://www.epicurious.com/recipes/food/views/instant-pot-italian-chickpea-stew-with-pesto"
}
