{
    "directions": [
        "Put the chicken thighs in the Instant Pot. Pour in the ancho chile sauce. Lock the lid into place. Select Manual; adjust the pressure to High and the time to 10 minutes. After cooking, naturally release the pressure for 10 minutes, then quick release any remaining pressure. Unlock and remove the lid. Transfer the chicken to a bowl and let it cool for a few minutes. Keep the sauce warm.",
        "When the chicken is just cool enough to handle, cut or pull it into bite-size chunks. Mix in about 2/3 cup of the warm sauce; the chicken should be well coated with sauce but not drowning. Put the onion in a small bowl.",
        "Preheat the oven to 350°F. Place 6 tortillas on a baking sheet in a single layer. Brush the tortillas lightly with the oil (or spray with cooking spray), then turn them over and repeat on the other side. Bake just until the tortillas are warm and pliable, about 3 minutes. Remove from the oven and place the tortillas in a stack on a plate. Cover with aluminum foil to keep warm. Repeat with the remaining 6 tortillas. (If you have two baking sheets, you can heat them all at once.) Leave the oven on.",
        "Spoon about 1/2 cup warm sauce into a 9-by-13-inch baking dish. Place one tortilla in the sauce and flip it so it’s lightly coated on both sides, then place a couple of tablespoons of chicken and a couple of teaspoons of chopped onion on the tortilla.",
        "For Mexican-American-style enchiladas: Sprinkle a tablespoon of shredded Monterey Jack cheese over the chicken and onion.",
        "Roll the tortilla up and place it at the end of the dish, seam-side down. Repeat with the remaining tortillas. When all the enchiladas are filled and rolled, pour enough sauce over them to just cover them (they should not be swimming in sauce).",
        "For Mexican-American-style enchiladas: Sprinkle the rest of the shredded Monterey Jack cheese over the enchiladas.",
        "Bake until warmed through, 8 to 10 minutes. Sprinkle the queso fresco over the enchiladas and serve."
    ],
    "ingredients": [
        "1 pound boneless, skinless chicken thighs",
        "2 cups Ancho Chile Sauce",
        "1/2 cup chopped onion",
        "12 corn tortillas",
        "3 tablespoons vegetable oil or nonstick cooking spray",
        "1/2 cup crumbled queso fresco",
        "2 cups shredded Monterey Jack cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Instant Pot",
        "Pressure Cooker",
        "Chicken",
        "Tortillas",
        "Bake",
        "Cheese",
        "Chile Pepper",
        "Monterey Jack",
        "Dinner"
    ],
    "title": "Instant-Pot Red Chicken Enchiladas",
    "url": "http://www.epicurious.com/recipes/food/views/instant-pot-red-chicken-enchiladas"
}
