{
    "directions": [
        "Chill one can of coconut milk in the fridge for at least an hour. Sterilize the heat-resistant and tempered glass bowls or yogurt cups with boiling water or by running them through the dishwasher. Set them aside.",
        "In a medium saucepan, combine one can of coconut milk, the coconut cream from the chilled can of coconut milk, vanilla and maple syrup over low heat. Stir or whisk until the cream is melted down and incorporated into the mix. Remove 1/4 cup (22 g) of the mixture from the pot and whisk in the tapioca starch. Reincorporate this slurry into the heated yogurt mixture. Stir once more and then remove the saucepan from heat.",
        "Once the yogurt mixture has cooled to around 100°F (38°C), stir in the probiotic powder. Doing so prematurely may result in killing the bacteria, destroying its ability to culture properly, so be sure to let the yogurt cool.",
        "Now pour the water into the stainless bowl of your Instant Pot. Fill your glass bowls with the yogurt mix and place them inside the Instant Pot bowl. If your bowls do not all fit at once, you may stack them on top of each other as long as they do not spill over. Secure the lid and select the Yogurt feature. Cook for 6 hours and then remove the lid, take out the yogurt bowls, cover them and transfer them to the refrigerator to firm up further. Top with fresh fruit, grain-free granola or any other desired topping."
    ],
    "ingredients": [
        "2 (13.5-oz [370-ml]) cans full-fat coconut milk",
        "1 tsp (5 ml) 100% vanilla extract",
        "3 tbsp (45 ml) 100% maple syrup",
        "2 tbsp (16 g) tapioca starch or arrowroot",
        "1 tsp (2 g) probiotic powder (I used 200 billion cfu)",
        "1 cup (240 ml) water",
        "Fruit, grain-free granola",
        "3 small heat-resistant and tempered glass bowls or yogurt cups"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Instant Pot",
        "Yogurt",
        "Dairy Free",
        "Paleo",
        "Vanilla",
        "Tapioca",
        "Coconut",
        "Breakfast",
        "Vegan",
        "Vegetarian",
        "Wheat/Gluten-Free",
        "Pressure Cooker"
    ],
    "title": "Instant-Pot Cultured Coconut Milk Yogurt",
    "url": "http://www.epicurious.com/recipes/food/views/instant-pot-cultured-coconut-milk-yogurt"
}
