{
    "directions": [
        "Combine all of the ingredients in a lidded container. Shake to mix.",
        "Use the mix within 3 months.",
        "Heat an electric griddle or frying pan to 350 degrees F. Heat oven to 200 degrees F.",
        "Whisk together the egg whites and the buttermilk in a small bowl. In another bowl, whisk the egg yolks with the melted butter.",
        "Combine the buttermilk mixture with the egg yolk mixture in a large mixing bowl and whisk together until thoroughly combined. Pour the liquid ingredients on top of the pancake mix. Using a whisk, mix the batter just enough to bring it together. Don't try to work all the lumps out.",
        "Check to see that the griddle is hot by placing a few drops of water onto to the griddle. The griddle is ready if the water dances across the surface.",
        "Lightly butter the griddle. Wipe off thoroughly with a paper towel. (No butter should be visible.)",
        "Gently ladle the pancake batter onto the griddle and sprinkle on fruit if desired. When bubbles begin to set around the edges of the pancake and the griddle-side of the cake is golden, gently flip the pancakes. Continue to cook 2 to 3 minutes or until the pancake is set.",
        "Serve immediately or remove to a towel-lined baking sheet and cover with a towel. Hold in a warm place for 20 to 30 minutes."
    ],
    "ingredients": [
        "6 cups all-purpose flour",
        "1 1/2 teaspoons baking soda (check expiration date first)",
        "3 teaspoons baking powder",
        "1 tablespoon kosher salt",
        "2 tablespoons sugar",
        "2 eggs, separated",
        "2 cups buttermilk",
        "4 tablespoons melted butter",
        "2 cups \"Instant\" Pancake Mix, recipe above",
        "1 stick butter, for greasing the pan",
        "2 cups fresh fruit such as blueberries, if desired"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pancake",
        "Buttermilk",
        "Dairy Recipes",
        "Brunch"
    ],
    "title": "\"Instant\" Pancake Mix",
    "url": "http://www.foodnetwork.com/recipes/alton-brown/instant-pancake-mix-recipe"
}
