{
    "directions": [
        "For the sauté, use the sauté setting over normal, or medium heat, and heat the oil or broth. Add the onion and sauté until transparent, 5 minutes. Then add the bell pepper and garlic. Sauté until the bell peppers soften, 5 minutes longer.",
        "For the pressure cooker, add the water, beans, bay leaves, thyme, smoked paprika, marjoram and cayenne to the onion mixture and stir to combine. Put the lid on and make sure the steam release handle is set to sealing, or closed; change to the manual setting (the pressure cooking one) and set the timer for 15 minutes.",
        "Carefully manually release the pressure. Remove the bay leaves.",
        "Before serving, mix in the crushed tomatoes, oregano, liquid smoke and ground bay leaf (if using). Then add salt and pepper to taste. Cook the stew for an additional 3 minutes on high pressure, then release the pressure naturally.",
        "Serve over steamed rice with a side of your favorite hot sauce. I love garlic Tabasco myself."
    ],
    "ingredients": [
        "1 tbsp (15 ml) mild oil (or dry sauté or add a little water/vegetable broth)",
        "1 cup (160 g) minced onion",
        "2 cups (300 g) minced bell pepper",
        "2 tsp (6 g) minced garlic",
        "1 cup (237 ml) water",
        "1 cup (184 g) dried kidney beans, soaked for 8–12 hours and drained",
        "3 bay leaves",
        "1 1/2 tsp (1.5 g) dried thyme",
        "2 tsp (4 g) smoked paprika",
        "2 tsp (2 g) dried marjoram",
        "1/2 tsp ground cayenne pepper (use more if you like things spicy)",
        "1 (14.5-oz [411-g]) can crushed or diced tomatoes",
        "1 tsp dried oregano",
        "1/2 tsp liquid smoke (optional)",
        "Pinch of ground bay leaf (optional)",
        "Salt and pepper, to taste (I used 1 1/2 tsp [9 g] salt and 1/2 tsp black pepper)",
        "Cooked rice of your choice",
        "Hot sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Instant Pot",
        "Pressure Cooker",
        "Bean",
        "Vegan",
        "Vegetarian",
        "Bell Pepper",
        "Onion",
        "Garlic",
        "Spice",
        "Oregano",
        "Dinner",
        "Wheat/Gluten-Free"
    ],
    "title": "Instant-Pot Kidney Bean Étouffée",
    "url": "http://www.epicurious.com/recipes/food/views/instant-pot-kidney-bean-etouffee"
}
