{
    "directions": [
        "Place the beef in a roasting pan and pour the beer over the meat. Cover the pan with plastic wrap, and marinate in the refrigerator overnight, turning once.",
        "Preheat an oven to 250 degrees F (120 degrees C).",
        "Remove the roast from the stout and pat dry. Heat the olive oil in a large frying pan over medium-high heat. Brown the roast on all sides. Set the browned roast on plate.",
        "Crush the rosemary, thyme, steak seasoning, and pepper in a mortar and pestle. Add the minced garlic and stir to make a paste. Spread the paste over the outside of the roast. Place the roast back into the roasting pan with the stout and cover loosely with foil. Bake in the preheated oven for 2 hours. Add the potatoes to the roasting pan and leave off the foil to let the roast get a crispy coating.",
        "Bake to your desired degree of doneness, or an internal temperature of 145 degrees F (65 degrees C) for medium, about another hour. Remove from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area 20 minutes before slicing.",
        "Pour the pan juices into a pot and bring to a boil over medium heat. Simmer until the juices have reduced and thickened, about 10 minutes. Season to taste with salt and pepper. Strain the juices and serve with the beef and roasted potatoes."
    ],
    "ingredients": [
        "2 pounds boneless beef chuck roast",
        "1 (12 fluid ounce) can or bottle Irish stout beer (e.g. Guinness®)",
        "1 tablespoon olive oil",
        "1/2 teaspoon dried rosemary",
        "1/2 teaspoon ground thyme",
        "1/2 teaspoon steak seasoning",
        "1/2 teaspoon ground black pepper",
        "4 cloves garlic, minced",
        "1 pound small round red potatoes",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Irish Roast Beef with Guinness Au Jus",
    "url": "http://allrecipes.com/recipe/213481/irish-roast-beef-with-guinness-au-jus/"
}
