{
    "directions": [
        "Preheat the oven to 325°F.",
        "Place a flameproof casserole (or large saucepan) on a medium-high heat. Trim the excess fat from the chops in half lengthways so as not to go through the bone. When some fat has melted into the pan, pick out the unmelted/unrendered bits (and eat them or give them to your dogs!), turn the heat up to high and place the chops in the pan. Cook on both sides, seasoning with salt and pepper, until brown, then transfer them to a plate.",
        "Add the carrots, celery, onions and garlic to the pan, season with salt and pepper and toss on the heat for a couple of minutes until starting to go slightly golden at the edges. Return the meat (and all the juices) to the pan with the barley and stock and stir to combine. Bring to a boil, cover and cook in the oven for 1 hour.",
        "Meanwhile, peel the potatoes and halve if large. Once the hour is up, take the pan out of the oven and place the potatoes on top. Cover and put back in the oven for 35–45 minutes until cooked. Scatter with parsley and serve from the pan."
    ],
    "ingredients": [
        "4 (12-oz., 1 1/4-inch–thick) bone-in lamb leg chops (3 lb. 2 oz. total)",
        "Salt and freshly ground black pepper",
        "9 ounces carrots (small carrots scrubbed and halved at an angle, or large carrots, peeled and cut at an angle into 1 ½-inch pieces)",
        "3 onions, peeled and each cut into 6 wedges",
        "8 large cloves of garlic, peeled and left whole",
        "2 ounces pearl barley",
        "1 pint lamb or chicken stock",
        "8–12 potatoes",
        "2 tablespoons chopped parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Lamb",
        "Stew",
        "Dinner",
        "Winter",
        "St. Patrick's Day",
        "Potato",
        "Barley",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Irish Stew With Pearl Barley",
    "url": "http://www.epicurious.com/recipes/food/views/irish-lamb-stew-with-pearl-barley"
}
