{
    "directions": [
        "1. Set a rack in the middle of the oven and preheat to 350°.",
        "2. Stir together the 2 1/4 cups flour, the baking powder, baking soda, and salt in a bowl.",
        "3. In the bowl of a heavy-duty mixer, beat the butter and sugar with the paddle on medium speed until soft and light, about 5 minutes. Add the egg, beating until smooth.",
        "4. Decrease the mixer speed to low and beat in half the flour mixture. Stop and scrape down the bowl and beater with a rubber spatula. Beat in the buttermilk, then the remaining flour mixture.",
        "5. Give the batter a final mix with the rubber spatula.",
        "6. Toss the currants and raisins with the remaining 1 tablespoon flour and fold them into the batter. Scrape the batter into the prepared pan and smooth the top.",
        "7. Bake for about 45-55 minutes, or until the cake is well risen and deep gold and a toothpick inserted in the center emerges clean.",
        "8. Cool in the pan on a rack for about 30 minutes, then invert the cake onto a rack and remove the pan and paper. Invert the cake onto another rack and cool completely.",
        "Storage: Wrap in plastic and keep at room temperature, or double-wrap and freeze for longer storage."
    ],
    "ingredients": [
        "2 1/4 cups unbleached all-purpose flour (spoon flour into dry-measure cups and level off) plus 1 tablespoon",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon salt",
        "8 tablespoons (1 stick) unsalted butter, softened",
        "3/4 cup sugar",
        "1 large egg, at room temperature",
        "1/2 cup currants",
        "1/2 cup golden raisins",
        "3/4 cup buttermilk or milk",
        "One 2-inch-deep 8-inch round cake pan, buttered and bottom lined with parchment or wax paper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit",
        "Dessert",
        "Bake",
        "St. Patrick's Day",
        "Currant",
        "Raisin",
        "Fall",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Irish Currant and Raisin Cake",
    "url": "http://www.epicurious.com/recipes/food/views/irish-currant-and-raisin-cake-107263"
}
