{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C). Place 6 ramekins on a towel set in a roasting pan at least 3 inches deep.",
        "Stir together cream and sugar in a saucepan over medium heat, and cook until very hot, stirring until the sugar dissolves. Whisk together egg yolks, vanilla, and Irish cream until combined. Slowly add 1/3 of the hot cream, whisking it in 2 tablespoons at a time until incorporated. Once you have incorporated 1/3 of the cream, you can stir in the remaining hot cream without fear of the mixture curdling.",
        "Pour custard into the ramekins, then fill roasting pan with boiling hot water to come halfway up the sides of the ramekins. Bake in preheated oven until set, 50 to 60 minutes.",
        "Once the custard has set, place ramekins on a wire rack, and allow to cool to room temperature, about 1 hour. Cover, and refrigerate until cold, about 4 hours. Custards may remain refrigerated until ready to serve.",
        "Unwrap the custards, and sprinkle about 1 teaspoon of superfine sugar onto each. Gently shake the custards so the sugar coats the entire top surface, then tip the custards to a 45 degree angle and shake off excess sugar.",
        "Using a small hand torch, melt the sugar by making short passes over top of the custards with the flame not quite touching. Continue melting the sugar until it turns deep brown. Once the sugar has melted and turned to caramel, the cold custard underneath will harden the sugar into a crispy crust. Serve immediately. Alternatively, the sugar-dusted custards may be browned underneath the broiler in the oven."
    ],
    "ingredients": [
        "2 cups heavy cream",
        "1/3 cup white sugar",
        "6 egg yolks",
        "1 teaspoon vanilla extract",
        "3 tablespoons Irish cream liqueur",
        "superfine sugar as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Irish Cream Creme Brulee",
    "url": "http://allrecipes.com/recipe/138086/irish-cream-creme-brulee/"
}
