{
    "directions": [
        "Whisk eggs and sugar in large metal bowl. Set bowl over saucepan of simmering water (do not allow bottom of bowl to touch water) and whisk constantly until candy thermometer registers 160°F., about 5 minutes. Remove bowl from over water. Using electric mixer, beat egg mixture until cool and very thick, about 10 minutes.",
        "Place chocolate in top of double boiler over simmering water; stir until melted and smooth. Remove chocolate from over water. Cool to luke warm.",
        "Combine cream and Irish cream liqueur in medium bowl; beat to stiff peaks. Pour luke warm melted chocolate over egg mixture and fold together. Fold in cream mixture. Cover and chill until set, at least 4 hours or overnight.",
        "Combine sugar and water in small saucepan. Stir over low heat until sugar dissolves. Increase heat and bring to boil. Remove from heat. Mix in whiskey. Cool. (Can be prepared 1 day ahead. Cover and let stand at room temperature.)",
        "Preheat oven to 350°F. Butter 9-inch-diameter springform pan with 2 3/4-inch-high sides. Line bottom with parchment paper. Using electric mixer, beat eggs, sugar, espresso powder and salt in large bowl until mixture thickens and slowly dissolving ribbon forms when beaters are lifted, about 8 minutes. Sift 1/3 of flour over and gently fold into egg mixture. Repeat 2 more times (do not overmix or batter may deflate.)",
        "Pour batter into prepared pan. Bake until tester inserted into center comes out clean, about 35 minutes. Cool cake completely in pan on rack.",
        "Run small sharp knife around pan sides to loosen cake. Release pan sides. Turn out cake. Remove pan bottom. Peel off parchment. (Can be prepared 1 day ahead. Wrap cake in plastic and chill.)",
        "Using serrated knife, cut cake horizontally into 3 layers. Place bottom cake layer on platter. Brush with 3 tablespoons syrup. Spread 2 cups mousse over. Top with second cake layer. Brush with 3 tablespoons syrup. Spread 2 cups mousse over. Top with third cake layer, cut side down. Brush with 3 tablespoons syrup. Spread remaining mousse over top and sides of cake. Refrigerate cake while preparing chocolate bands.",
        "Line large baking sheet with foil and set aside. Place another large sheet of foil on work surface; top with waxed paper strips, spacing apart. Stir chopped semisweet chocolate and vegetable shortening in heavy small saucepan over low heat until melted and smooth. Pour half of melted chocolate down center of each waxed paper strip. Using metal icing spatula, spread chocolate to cover strips evenly and completely, allowing some chocolate to extend beyond edges of paper strips. Using fingertips, lift strips and place on clean foil-lined baking sheet. Refrigerate just until chocolate begins to set but is still very flexible, about 2 minutes.",
        "Remove chocolate bands from refrigerator. Using fingertips, lift 1 band from foil. With chocolate side next to cake, place band around side of cake; press gently to adhere (band will be higher than cake). Repeat with second chocolate band, pressing onto uncovered side of cake so that ends of chocolate bands just meet (if ends overlap, use scissors to trim any excess paper and chocolate). Refrigerate until chocolate sets, about 5 minutes. Gently peel off paper. Refrigerate cake.",
        "Line baking sheet with foil. Unwrap 1 square of chocolate. Place chocolate on its paper wrapper in microwave. Cook on High just until chocolate begins to soften slightly, about 1 minute (time will vary depending on power of microwave). Turn chocolate square onto 1 side and hold in hand. Working over foil-lined sheet, pull vegetable peeler along sides of chocolate, allowing chocolate curls to fall gently onto foil. Form as many curls as possible. Repeat process with remaining chocolate squares. Place curls decoratively atop cake, mounding slightly. (Can be prepared 1 day ahead. Refrigerate cake.)",
        "Sift powdered sugar over chocolate curls before serving cake."
    ],
    "ingredients": [
        "4 large eggs",
        "1/3 cup sugar",
        "12 ounces semisweet chocolate, chopped",
        "1 1/2 cups chilled whipping cream",
        "1/4 cup Irish cream liqueur",
        "2/3 cup sugar",
        "5 tablespoons water",
        "5 tablespoons Irish whiskey",
        "6 large eggs",
        "3/4 cup plus 2 tablespoons sugar",
        "2 tablespoons instant espresso powder or coffee powder",
        "Pinch of salt",
        "1 cup all purpose flour",
        "2 14 1/2 x 3-inch waxed paper strips",
        "4 ounces semisweet chocolate, chopped",
        "1 tablespoon plus 1 teaspoon solid vegetable shortening",
        "12 1-ounce squares semisweet baking chocolate",
        "Powdered sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Chocolate",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "St. Patrick's Day",
        "Spring",
        "Chill"
    ],
    "title": "Irish Cream Chocolate Mousse Cake",
    "url": "http://www.epicurious.com/recipes/food/views/irish-cream-chocolate-mousse-cake-502"
}
