{
    "directions": [
        "Preheat oven to 250°F. Line 2 heavy baking sheets with parchment paper. Stir 3 tablespoons sugar, 1 tablespoon brown sugar and 1 teaspoon instant espresso powder in small bowl to blend well. Using hand-held electric mixer, beat egg whites in medium bowl until medium-stiff peaks form. Add remaining 4 tablespoons sugar and 2 tablespoons dark brown sugar to egg whites by tablespoonfuls and beat until stiff peaks form. Fold coffee-sugar mixture into meringue.",
        "Drop meringue by rounded tablespoonfuls onto prepared baking sheets, spacing evenly. Using knife, gently spread meringues 2 1/2- to 3-inch rounds. Bake until meringues are dry and can be easily be lifted from parchment, about 45 minutes. Transfer meringues to racks and cool completely. (Can be prepared 2 days ahead. Store in airtight containers at room temperature.)",
        "Beat 1 cup whipping cream in medium bowl to medium-firm peaks. Add sugar, Irish whiskey and instant espresso powder and beat until firm peaks form.",
        "Place 1 meringue on plate, flat side down. Spoon 1 generous tablespoon of espresso cream filling over. Top with another meringue, flat side down, and press gently until filling spreads to edge. Repeat with remaining meringues and filling. (Can be prepared 1 hour ahead. Cover with plastic wrap and refrigerate.)",
        "Beat remaining 1/4 cup whipping cream in small bowl until firm peaks form. Spoon small dollop of cream atop each meringue. Garnish each with chocolate-covered coffee beans, if desired."
    ],
    "ingredients": [
        "7 tablespoons sugar",
        "3 tablespoons (packed) dark brown sugar",
        "1 teaspoon instant espresso powder or instant coffee powder",
        "2 large egg whites",
        "1 1/4 cups chilled whipping cream",
        "2 tablespoons sugar",
        "2 tablespoons Irish whiskey",
        "2 teaspoons instant espresso powder or instant coffee powder",
        "Chocolate-covered coffee beans (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Milk/Cream",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "St. Patrick's Day",
        "Whiskey",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Irish Coffee Meringues",
    "url": "http://www.epicurious.com/recipes/food/views/irish-coffee-meringues-1959"
}
