{
    "directions": [
        "Put lamb in a 5-quart heavy pot with 5 cups water and simmer, uncovered, 5 minutes. Drain lamb in a colander, then rinse with cold water.",
        "Wash leeks in a bowl of cold water, then lift out and drain well in a sieve. Peel and coarsely chop large boiling potatoes, then add to pot with leeks, chopped onions, celery, garlic, salt, pepper, and 6 cups water. Bring to a boil and add lamb, then reduce heat and simmer, uncovered, stirring occasionally, 1 hour. (Vegetables will be very soft.)",
        "Transfer lamb with tongs to a small bowl. Force cooking liquid (with vegetables) through food mill into a large bowl. Discard any solids. Return cooking liquid to pot. Add lamb, small potatoes, and boiling onions. Bring to a boil, then reduce heat and simmer, partially covered and stirring occasionally, until meat and vegetables are tender, about 25 minutes. Add carrots and simmer, stirring occasionally, until carrots are tender, about 10 minutes. Stir in parsley and season with salt and pepper."
    ],
    "ingredients": [
        "2 1/2 lb lean boneless lamb shoulder, cut into 1 1/2-inch cubes",
        "3 medium leeks (white and pale green parts only), coarsely chopped",
        "1 1/2 lb large boiling potatoes (about 3)",
        "3 large onions, coarsely chopped",
        "3 celery ribs, coarsely chopped",
        "1 garlic clove, smashed",
        "2 teaspoons salt",
        "1/4 teaspoon black pepper",
        "6 cups water",
        "18 small boiling potatoes (about 1 1/4 lb total)",
        "18 boiling onions (1 1/4 to 1 1/2 inches wide, about 1 lb), trimmed and peeled",
        "24 baby carrots (about 4 bunches), trimmed and peeled",
        "1/4 cup finely chopped fresh parsley",
        "Special equipment: a food mill fitted with fine disk"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Lamb",
        "Onion",
        "Potato",
        "Stew",
        "St. Patrick's Day",
        "Carrot",
        "Winter",
        "Gourmet"
    ],
    "title": "Irish Stew",
    "url": "http://www.epicurious.com/recipes/food/views/irish-stew-109213"
}
