{
    "directions": [
        "Place beef and pork in large bowl; season with salt and pepper. Sprinkle 3 tablespoons flour over; toss to coat. Heat 3 tablespoons oil in large Dutch oven over medium-high heat. Working in batches, add beef and pork to pot; sauté until brown, about 4 minutes per batch. Using slotted spoon, transfer meats to plate. Place chicken in same large bowl; season with salt and pepper. Sprinkle 1 tablespoon flour over; toss to coat. Add chicken to pot; sauté until brown, about 4 minutes. Transfer chicken to small bowl.",
        "Add remaining 1 tablespoon oil and onions to same pot; sauté until brown, about 5 minutes. Return beef, pork and any collected juices to pot. Add broth, carrots, bay leaves and ground allspice. Bring to boil. Reduce heat to medium-low. Cover; simmer 30 minutes.",
        "Add chicken with any juices and potatoes to pot. Cover and simmer until all meats and vegetables are tender, about 45 minutes. Remove bay leaves. Season to taste with salt and pepper."
    ],
    "ingredients": [
        "1 pound boneless chuck, cut into 1-inch pieces",
        "1 pound boneless pork shoulder, cut into 1-inch pieces",
        "4 tablespoons all purpose flour",
        "4 tablespoons vegetable oil",
        "1 pound skinless boneless chicken thigh, cut into 1-inch pieces",
        "1 pound onions, cut into 1-inch pieces",
        "3 cups canned low-salt chicken broth",
        "3 large carrots, cut into 1-inch pieces",
        "6 bay leaves",
        "1/4 teaspoon ground allspice",
        "2 large russet potatoes, peeled, but into 1-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Beef",
        "Chicken",
        "Onion",
        "Pork",
        "Potato",
        "Stew",
        "Carrot",
        "Fall",
        "Winter"
    ],
    "title": "Iroquois Stew with Beef, Chicken and Pork",
    "url": "http://www.epicurious.com/recipes/food/views/iroquois-stew-with-beef-chicken-and-pork-865"
}
