{
    "directions": [
        "1. Preheat the oven to 400°F (200 °C). Have ready a 6-cup (1 1/2 l) soufflé dish or charlotte mold.",
        "2. Make the caramel: Place the 6 tablespoons sugar in a small heavy saucepan over medium heat. It will gradually dissolve, and as it does so, swirl it around in the pan. When it is a pale caramel color, after 4 to 5 minutes, quickly pour it into the mold, swirling the mold so the caramel completely covers the bottom. Use the pastry brush to brush the sides of the mold with the melted butter.",
        "3. Whisk the eggs in a small bowl until they are blended and set aside.",
        "4. Place the milk, 3/4 cup (150 g) sugar, and vanilla bean in a medium-size heavy saucepan. Stir, and heat over medium heat until the milk is steaming and small bubbles have formed around the edges. Immediately remove from the heat, cover and let infuse for 10 minutes. Then remove the vanilla bean, rinse it well, and reserve it for another use.",
        "5. Return the milk to medium heat, and when small bubbles have formed around the edges, add the salt and the semolina, lightly sprinkling the semolina over the milk and stirring constantly. Continue to stir constantly as the semolina cooks (it will thicken dramatically), until it has become like a paste, at least 10 minutes.",
        "6. Remove the semolina from the heat and whisk in the eggs until they are thoroughly combined. Then whisk in the nutmeg and stir in the raisins.",
        "7. Pour the mixture into the prepared mold and bake in the center of the oven until the cake is puffed and golden, 45 minutes.",
        "8. Remove the mold from the oven and let it cool for 10 minutes. Then unmold the cake onto a serving platter."
    ],
    "ingredients": [
        "3/4 cup (150 grams) plus 6 tablespoons sugar",
        "1 teaspoon unsalted butter, melted",
        "3 large eggs",
        "4 cups (1 liter) milk",
        "1 vanilla bean, split down its length",
        "Pinch of sea salt",
        "3/4 cup plus 1 tablespoon (120 grams) semolina",
        "1/4 teaspoon freshly grated nutmeg",
        "1/2 cup (75 grams) raisins"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Dairy",
        "Egg",
        "Dessert",
        "Bake",
        "Raisin",
        "Semolina",
        "Fall",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Isabelle's Semolina Cake",
    "url": "http://www.epicurious.com/recipes/food/views/isabelles-semolina-cake-102223"
}
