{
    "directions": [
        "For the dressing: Whisk the oil, vinegar, paprika, salt and pepper in a small bowl until smooth.",
        "For the couscous: Heat the oil over medium-high heat in a large saucepan. Cook the couscous, stirring frequently, until golden, 4 to 5 minutes. Add 2 cups water and the salt and bring to a boil. Reduce the heat to medium-low. Cover and simmer until the couscous is just tender and the liquid is absorbed, 9 to 10 minutes. Set aside to cool slightly.",
        "Mix together the spinach, tomatoes, cheese, peppers, parsley, almonds and mint in a large bowl. Add the couscous and the dressing. Toss until all the ingredients are coated. Transfer to a large serving bowl and serve."
    ],
    "ingredients": [
        "1/3 cup extra-virgin olive oil",
        "2 tablespoons white balsamic vinegar",
        "1 1/2 teaspoons smoked paprika",
        "1 teaspoon kosher salt",
        "1/2 teaspoon freshly ground black pepper",
        "1 tablespoon extra-virgin olive oil",
        "1 1/3 cups (8 ounces) Israeli couscous, sometimes called pearl couscous or maftoul",
        "1/2 teaspoon kosher salt",
        "2 cups packed baby spinach leaves, coarsely chopped",
        "12 ounces grape tomatoes, cherry tomatoes, or baby heirloom tomatoes of assorted colors, halved (about 2 cups)",
        "4 ounces (about 1 cup) feta, coarsely crumbled or chopped into 1/2-inch pieces",
        "1 cup jarred red bell peppers, drained and coarsely chopped",
        "1/2 cup chopped fresh flat-leaf parsley",
        "1/3 cup slivered almonds, toasted",
        "1/4 cup chopped fresh mint",
        "Kosher salt and freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Couscous Salad",
        "Couscous",
        "Salad Recipes"
    ],
    "title": "Israeli Couscous Salad with Smoked Paprika",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/israeli-couscous-salad-with-smoked-paprika-recipe"
}
