{
    "directions": [
        "Preheat oven to 475°F.",
        "Halve lemons and scoop out flesh, keeping both flesh and peel. Cut enough peel into 1/4-inch dice to measure 1/4 cup. Put lemon flesh in a sieve set over a bowl and press with back of a spoon to extract juice.",
        "Toss squash with 1 tablespoon oil and salt to taste in a large shallow baking pan and spread in 1 layer. Roast in upper third of oven 15 minutes, or until squash is just tender, and transfer to a large bowl.",
        "Cook onion in 1 tablespoon oil in a 10-inch heavy skillet over moderately high heat, stirring occasionally, until just beginning to turn golden. Add to squash.",
        "Cook couscous with cinnamon stick in a large pot of boiling salted water 10 minutes, or until just tender, and drain in a colander (do not rinse). Add couscous to vegetables and toss with 2 tablespoon oil to coat.",
        "Add lemon peel and juice, parsley, nuts, raisins, ground cinnamon, and salt to taste. Toss to mix well.",
        "4 to 5 preserved lemons",
        "5 lb. butternut squash, peeled and seeded",
        "3/4 to 1 cup olive oil",
        "3 cups chopped onion",
        "7 cups Israeli couscous or acini di pepe (tiny peppercorn-shaped pasta), about 3 lb.",
        "4 (3-inch) cinnamon sticks",
        "3 cups chopped fresh flat-leaf parsley",
        "2 cups pine nuts, toasted",
        "2 cups golden raisins",
        "1 teaspoon ground cinnamon",
        "Preheat oven to 475°F.",
        "Halve lemons and scoop out flesh, keeping both flesh and peel. Cut enough peel into 1/4-inch dice to measure 1 cup. Put lemon flesh in a sieve set over a bowl and press with back of a spoon to extract juice.",
        "Cut enough squash into 1/4-inch dice to measure about 12 cups and toss with 1/3 cup oil and salt to taste. Roast in single layers in batches in your largest shallow baking pan in upper third of oven 15 minutes, or until just tender.",
        "Cook 1/2 of onion in 3 tablespoons oil in a 12-inch heavy skillet over moderately high heat, stirring occasionally, until just beginning to turn golden. Add to squash. Repeat with remaining onion and more oil.",
        "Cook couscous with cinnamon sticks in an 8-qt. pot of boiling salted water 10 minutes, or until just tender, and drain in a colander (do not rinse). Toss couscous with 3 tablespoons oil in a large bowl. Add squash, onion, lemon peel and juice, and remaining ingredients. Season with salt (you'll need a lot) and toss to mix well."
    ],
    "ingredients": [
        "1 preserved lemon",
        "1 1/2 pound butternut squash, peeled and seeded, and cut into 1/4-inch dice",
        "3 tablespoons olive oil",
        "1 large onion, chopped",
        "1 3/4 cups Israeli couscous or acini di pepe (tiny peppercorn-shaped pasta), about 1 pound",
        "1 (3-inch) cinnamon stick",
        "1 cup chopped fresh flat-leaf parsley",
        "1/2 cup pine nuts, toasted",
        "1/2 cup golden raisins",
        "1/4 teaspoon ground cinnamon"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Citrus",
        "Nut",
        "Pasta",
        "Vegetable",
        "Side",
        "Roast",
        "Vegetarian",
        "Wedding",
        "Rosh Hashanah/Yom Kippur",
        "Dinner",
        "Lemon",
        "Raisin",
        "Pine Nut",
        "Squash",
        "Butternut Squash",
        "Healthy",
        "Couscous",
        "Gourmet",
        "Vegan",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Israeli Couscous with Roasted Butternut Squash and Preserved Lemon",
    "url": "http://www.epicurious.com/recipes/food/views/israeli-couscous-with-roasted-butternut-squash-and-preserved-lemon-102250"
}
