{
    "directions": [
        "Put the porcini in a small heatproof bowl. In a small saucepan over high heat, bring the water to a boil. Pour the boiling water over the mushrooms. Set aside and let steep until the mushrooms are soft and plump, about 20 minutes.",
        "Meanwhile, in a large saucepan over medium-high heat, warm 1 Tbs. of the olive oil. Add the couscous and toast, stirring constantly, until lightly golden, about 5 minutes. Pour in the stock. If necessary, add hot water to cover the couscous by 1/2 inch. Bring to a boil, reduce the heat to medium and cook until the couscous is al dente (tender but firm to the bite), about 10 minutes. Drain thoroughly in a fine-mesh sieve and transfer to a large salad bowl.",
        "Cut the kernels off the ears of corn and add to the bowl with the couscous. Drain the mushrooms, chop into bite-size pieces and add to the bowl. Add the arugula, mozzarella and corn.",
        "In a small bowl, whisk together the remaining 2 Tbs. olive oil and the vinegar. Pour over the salad and toss until the ingredients are well distributed and coated with the dressing. Season generously with salt and pepper, toss again gently and serve immediately. Serves 4 to 6.",
        "Double for a crowd:",
        "This recipe doubles or triples easily for a big brunch or barbecue. When bringing the salad to a party, keep the arugula in a separate container and stir it in just before serving so the tender leaves don’t wilt.",
        "Fresh take:",
        "For a more nutritious dish, replace the couscous with farro, barley or quinoa, or a mixture. The earthiness of the farro pairs especially well with the rich, meaty porcini.",
        "Adapted from Williams-Sonoma",
        "Good Food to Share",
        ", by Sara Kate Gillingham-Ryan (Weldon Owen, Inc., 2010)."
    ],
    "ingredients": [
        "1/2 cup dried porcini mushrooms",
        "1/2 cup water",
        "3 Tbs. olive oil",
        "1 cup Israeli couscous",
        "2 cups chicken stock or low-sodium broth, warmed",
        "2 ears of corn, husks and silks removed",
        "2 handfuls of baby arugula, tough stems removed",
        "1/4 lb. smoked mozzarella cheese, cut into 1/4-inch dice",
        "1 Tbs. Champagne vinegar",
        "Sea salt and freshly ground pepper, to taste"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Israeli Couscous with Porcini and Arugula",
    "url": "http://www.williams-sonoma.com/recipe/israeli-couscous-with-porcini-and-arugula.html"
}
