{
    "directions": [
        "Preheat oven to 400°F.",
        "Combine beef, 1 garlic clove, parsley, and 1 tsp. paprika in a large bowl. Divide into 4 equal-sized, loosely packed patties 4\"-wide, 3/4\"-thick. Make a small indentation in the center with your thumb to help keep it flat as it grills. Chill until ready to use.",
        "Meanwhile, melt 4 Tbsp. butter and remaining 1 garlic clove in a medium saucepan over medium heat, swirling pan occasionally, until butter turns caramel-brown and smells nutty, about 5 minutes. Add tomato paste and remaining 1/2 tsp. paprika, whisk to combine, and cook until paste begins to caramelize, about 30 seconds. Add in 3/4 cup water and whisk until smooth; simmer until mixture thickens slightly, about 5 minutes. Remove from heat and set aside.",
        "Heat a large cast-iron skillet over medium-high heat. Melt remaining 1 Tbsp. butter and place buns, cut-side down, in pan. Cook until cut sides are golden-brown, about 2 minutes (you may need to do this in two batches, using additional butter if needed). Use a pastry brush to generously brush buns with reserved tomato sauce, then place buns in a 9x13 glass baking pan.",
        "Add oil to the skillet and increase heat to high; heat until oil begins to smoke. Season patties on both sides with salt and pepper. Reduce heat to medium and cook burgers until lightly charred on bottom, 2-3 minutes; flip and cook to desired doneness, 2-3 minutes for medium-rare.\nTransfer burgers to pan with sauce and flip to coat burgers in sauce. Transfer burgers to bun bottoms and top with top bun. Brush top of bun with sauce. Cover pan with aluminum foil, transfer pan to oven, and bake for 5 minutes. Carefully remove foil and serve immediately.",
        "Raw burger patties and sauce can be made 3 days ahead; cover separately and chill. To use, heat sauce over medium in a medium saucepan, whisking until smooth."
    ],
    "ingredients": [
        "1 1/2 pounds ground beef chuck (20% fat)",
        "2 large garlic cloves, minced, divided",
        "2 tablespoons chopped parsley",
        "1 1/2 teaspoons paprika, divided",
        "5 tablespoons unsalted butter, divided, plus more if needed",
        "1/4 cup tomato paste",
        "4 hamburger or brioche buns",
        "1 tablespoons vegetable oil",
        "2 teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cooking After Dark",
        "Hamburger",
        "Turkey",
        "Beef",
        "Ground Beef",
        "Tomato",
        "Paprika"
    ],
    "title": "Istanbul-Style Wet Burger (Islak Burger)",
    "url": "http://www.epicurious.com/recipes/food/views/istanbul-style-wet-burger-islak-burger"
}
