{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Whisk flour, white sugar, cocoa powder, baking powder, cinnamon, cloves, allspice, and salt in a large bowl. Stir orange zest into flour mixture. Mix vegetable shortening and margarine into dry ingredients, using your hands, until mixture is crumbly.",
        "Beat eggs and vanilla extract in a bowl with an electric mixer until foamy; add egg mixture, 1/4 cup orange juice, and 1/4 cup milk to flour mixture and knead dough in the bowl until thoroughly combined and dough doesn't stick to your hands, about 8 minutes. Dough will be stiff. Knead cream cheese thoroughly into dough, followed by  walnuts.",
        "Form dough into balls about 1 1/2 inches in diameter and place onto ungreased baking sheets.",
        "Bake cookies in the preheated oven until lightly browned, 12 to 14 minutes. Cool cookies on racks.",
        "Beat 3 tablespoons milk, 1 teaspoon orange juice, and 1 cup confectioners' sugar in a bowl until smooth; gradually beat in remaining confectioners' sugar until frosting is thick and drizzles slowly from a spoon.",
        "Dip tops of cookies into frosting and place frosted cookies on racks with waxed paper underneath to catch drips. Let cookies dry overnight."
    ],
    "ingredients": [
        "7 cups all-purpose flour",
        "2 cups white sugar",
        "1 cup unsweetened cocoa powder (such as Hershey's®)",
        "1/4 cup baking powder",
        "1 1/2 teaspoons ground cinnamon",
        "1 1/2 teaspoons ground cloves",
        "1 1/2 teaspoons ground allspice",
        "1 teaspoon salt",
        "1 large orange, zested",
        "1/2 cup vegetable shortening (such as Crisco®)",
        "1/2 cup margarine (such as Parkay®)",
        "5 eggs",
        "1 teaspoon vanilla extract, or to taste",
        "1/4 cup orange juice",
        "1/4 cup whole milk",
        "1/2 (8 ounce) package cream cheese, softened",
        "1/2 cup chopped walnuts",
        "3 tablespoons whole milk, or more as needed",
        "1 teaspoon orange juice, or as needed",
        "3 cups confectioners' sugar, or more as needed"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Frosted Chocolate Cookies",
    "url": "http://allrecipes.com/recipe/230257/italian-frosted-chocolate-cookies/"
}
