{
    "directions": [
        "Make the dough first. In a large bowl, stir together the flour, salt, sugar and baking powder. Combine the oil, milk and 3 eggs, pour into the dry ingredients and stir until the dough holds together well. If you have a stand mixer, use the dough hook attachment to mix until smooth.",
        "Preheat the oven to 350 degrees F (175 degrees C). Divide the dough in half.  Roll out one half of the dough to fit a 14x18 inch baking sheet with sides that come up at least 1/2 inch. If the dough is too stiff to roll out to that size, let it rest for a few minutes and come back to it. Fit the dough into the baking sheet. Set aside.",
        "Place the sausage into a large skillet over medium heat. Cook, stirring to crumble, until no longer pink. Drain off the grease and set aside to cool. Mix together the ricotta cheese, 5 eggs, salt, pepper and hard-cooked eggs in a large bowl. When the sausage is cool, stir it into the cheese and eggs. Spread this mixture evenly over the crust in the pan. Roll out the remaining dough and place on top. Roll the edges and pinch together to seal. Brush the top crust with the beaten egg.",
        "Bake in the preheated oven until the crust is golden brown and the filling is bubbly, about 1 hour. Cool for at least 10 minutes before cutting into servings. This can be served warm or cold."
    ],
    "ingredients": [
        "5 cups all-purpose flour",
        "1 teaspoon salt",
        "1 teaspoon white sugar",
        "1 tablespoon baking powder",
        "1/2 cup vegetable oil",
        "1 cup milk",
        "3 eggs",
        "3 pounds mild Italian sausage",
        "3 (16 ounce) containers ricotta cheese",
        "5 eggs",
        "2 teaspoons salt",
        "2 teaspoons ground black pepper",
        "9 hard-cooked eggs, sliced",
        "1 egg, beaten"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Easter Pizza",
    "url": "http://allrecipes.com/recipe/95663/italian-easter-pizza/"
}
