{
    "directions": [
        "Prepare the cake mix according to package instructions. Bake in a 9x5 inch loaf pan. Cool completely.",
        "With a sharp, serrated knife, cut a thin slice from both ends of cooled cake. Cut cake horizontally into 4 even layers. Brush each layer with 1 tablespoon orange liqueur.",
        "In medium bowl, beat ricotta cheese with electric mixer until smooth. Beat in cream, sugar, remaining liqueur. With rubber scraper, fold in chocolate pieces and candied fruits.",
        "Place bottom layer of cake on flat plate and spread with one-third of ricotta mix. Place second layer of cake evenly on top of first layer and spread with one-third filling. Repeat with third layer of cake and filling. Top with remaining cake layer.",
        "Gently press loaf into shape. Refrigerate at least 2 hours or until ricotta is firm.",
        "To make the frosting: Melt chocolate and butter in top of double boiler, over hot, not boiling, water. Remove from water. Add confectioners sugar, hot coffee, and vanilla. Beat until smooth. If too soft to spread, refrigerate until of spreading consistency  - about 30 minutes. Spread frosting over side and top of cake. Refrigerate until serving time.",
        "To serve, decorate top with candied fruits, if desired. Or use a pastry tube to decorate the cake with flowers and vines. Makes 10 servings."
    ],
    "ingredients": [
        "1 (18.25 ounce) package pound cake mix",
        "6 tablespoons orange liqueur",
        "1 pint part-skim ricotta cheese",
        "2 tablespoons heavy whipping cream",
        "1/4 cup white sugar",
        "3 tablespoons chopped semisweet chocolate",
        "3 tablespoons candied mixed fruit",
        "4 (1 ounce) squares unsweetened chocolate",
        "1/4 cup butter",
        "3 cups confectioners' sugar",
        "1/2 cup hot, strong brewed coffee",
        "1 1/2 teaspoons vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Cassata",
    "url": "http://allrecipes.com/recipe/8305/italian-cassata/"
}
