{
    "directions": [
        "Preheat oven to 250°F. Butter a 13x9x2\" baking dish; set aside. Soak raisins in 1 cup broth in a small bowl for 30 minutes.",
        "Scatter bread in a single layer on a rimmed baking sheet. Bake, stirring occasionally, until dried out, about 1 hour. Let cool and transfer to a very large bowl.",
        "Heat 2 tablespoons oil in a large skillet over medium-high heat; add Swiss chard leaves and stir constantly until just wilted. Transfer to bowl with bread. Heat 2 tablespoons oil in same skillet; add stems and cook, stirring often, until crisp-tender, 3-5 minutes. Add to bowl.",
        "Heat 4 tablespoons oil and 1/4 cup butter in same skillet; add onions and garlic. Stir often until just beginning to brown, about 10 minutes. Stir in vinegar and sugar; cook until vinegar is almost evaporated, about 5 minutes.",
        "Add onion mixture to chard in bowl. Add raisins with broth, olives, and next 5 ingredients; gently fold into bread mixture until thoroughly combined. Drizzle in 1 cup broth and toss gently. Let cool completely.",
        "Preheat oven to 350°F. Whisk remaining 1 cup broth and eggs in a small bowl. Gently fold into dressing until thoroughly combined. Transfer to prepared dish, cover with foil, and bake until an instant-read thermometer inserted into the center of dressing registers 160°F, about 40 minutes. DO AHEAD: Dressing can be made 1 day ahead. Uncover; let cool. Cover; chill.",
        "Bake dressing, uncovered, until set and top is browned and crisp, 40-45 minutes longer (if chilled, add 10-15 minutes)."
    ],
    "ingredients": [
        "1/4 cup (1/2 stick) unsalted butter plus more for baking dish",
        "1/4 cup golden raisins",
        "3 cups low-sodium chicken broth, divided",
        "1 pound good-quality day-old country bread, torn into 1/2\" pieces (about 10 cups)",
        "8 tablespoons olive oil, divided",
        "1 bunch red Swiss chard, center ribs and stems removed and cut into 1/2\" pieces, leaves torn",
        "2 1/2 cups chopped yellow onions",
        "5 garlic cloves, chopped",
        "1/4 cup red wine vinegar",
        "1 tablespoon sugar",
        "1 cup pitted green olives, 3 coarsely chopped",
        "4 ounces pine nuts (about 1/2 cup), toasted",
        "1 tablespoon chopped fresh oregano",
        "1 tablespoon chopped fresh rosemary",
        "2 teaspoons kosher salt",
        "1/2 teaspoon crushed red pepper flakes",
        "2 large eggs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Olive",
        "Side",
        "Bake",
        "Thanksgiving",
        "Stuffing/Dressing",
        "Raisin",
        "Pine Nut",
        "Chard",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Italian Mother-In-Law Dressing",
    "url": "http://www.epicurious.com/recipes/food/views/italian-mother-in-law-dressing-51124220"
}
