{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 8 inch pans.  Combine the buttermilk, baking soda and salt.  Set aside.",
        "In a large bowl, cream together the shortening, margarine and sugar until light and fluffy. Beat in the egg yolks one at a time, then stir in 1 teaspoon vanilla and almond extract.  Beat in the buttermilk mixture alternately with the flour, mixing just until incorporated.  In a separate bowl, beat the egg whites until they form stiff peaks.  Gently fold the egg whites into the batter.  Stir in pineapple, coconut and 1 cup pecans.",
        "Pour batter evenly into prepared pans. Bake in the preheated oven for 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow cake layers to cool 10 minutes in pans, then turn out onto wire racks to cool completely.",
        "To make the frosting:  Cream together the butter, cream cheese and confectioners' sugar until blended.  Stir in 2 teaspoons vanilla and 1 cup pecans.  If frosting is too stiff to spread, stir in milk a teaspoon at a time until it reaches desired consistency."
    ],
    "ingredients": [
        "1/2 cup buttermilk",
        "1 teaspoon baking soda",
        "1 teaspoon salt",
        "1/2 cup shortening",
        "1/2 cup margarine",
        "2 cups white sugar",
        "5 egg yolks",
        "1/4 teaspoon almond extract",
        "1 teaspoon vanilla extract",
        "2 cups all-purpose flour",
        "5 egg whites",
        "1/2 cup drained crushed pineapple",
        "1/2 cup flaked coconut",
        "1 cup chopped pecans",
        "3/4 cup butter, softened",
        "1 (8 ounce) package cream cheese, softened",
        "4 cups confectioners' sugar",
        "2 teaspoons vanilla extract",
        "1 cup chopped pecans"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Wedding Cake",
    "url": "http://allrecipes.com/recipe/23072/italian-wedding-cake/"
}
