{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "For the meatballs, place the ground chicken, sausage, bread crumbs, garlic, parsley, Pecorino, Parmesan, milk, egg, 1 teaspoon salt, and 1/2 teaspoon pepper in a bowl and combine gently with a fork. With a teaspoon, drop 1 to 1 1/4-inch meatballs onto a sheet pan lined with parchment paper. (You should have about 40 meatballs. They don't have to be perfectly round.) Bake for 30 minutes, until cooked through and lightly browned. Set aside.",
        "In the meantime, for the soup, heat the olive oil over medium-low heat in a large heavy-bottomed soup pot. Add the onion, carrots, and celery and saute until softened, 5 to 6 minutes, stirring occasionally. Add the chicken stock and wine and bring to a boil. Add the pasta to the simmering broth and cook for 6 to 8 minutes, until the pasta is tender. Add the fresh dill and then the meatballs to the soup and simmer for 1 minute. Taste for salt and pepper. Stir in the fresh spinach and cook for 1 minute, until the spinach is just wilted. Ladle into soup bowls and sprinkle each serving with extra grated Parmesan."
    ],
    "ingredients": [
        "3/4 pound ground chicken",
        "1/2 pound chicken sausage, casings removed",
        "2/3 cup fresh white bread crumbs",
        "2 teaspoons minced garlic (2 cloves)",
        "3 tablespoons chopped fresh parsley leaves",
        "1/4 cup freshly grated Pecorino Romano",
        "1/4 cup freshly grated Parmesan, plus extra for serving",
        "3 tablespoons milk",
        "1 extra-large egg, lightly beaten",
        "Kosher salt and freshly ground black pepper",
        "2 tablespoons good olive oil",
        "1 cup minced yellow onion",
        "1 cup diced carrots (3 carrots), cut into 1/4 inch pieces",
        "3/4 cup diced celery (2 stalks), cut into 1/4 inch pieces",
        "10 cups homemade chicken stock",
        "1/2 cup dry white wine",
        "1 cup small pasta such as tubetini or stars",
        "1/4 cup minced fresh dill",
        "12 ounces baby spinach, washed and trimmed"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Chicken Recipes",
        "Chicken",
        "Easy Recipes",
        "Poultry Recipes",
        "Easy Appetizer",
        "Appetizer",
        "European Recipes",
        "Italian",
        "Soup",
        "Pasta Recipes",
        "Celery",
        "Vegetable",
        "Spinach",
        "Main Dish Recipes",
        "Lunch"
    ],
    "title": "Italian Wedding Soup",
    "url": "http://www.foodnetwork.com/recipes/ina-garten/italian-wedding-soup-recipe"
}
