{
    "directions": [
        "Melt butter in a large skillet over medium heat. Add onions, mushrooms, green peppers, and pinch of salt. Saute until vegetables begin to soften, 2 to 3 minutes; add minced garlic and cook another minute.",
        "Push vegetables to one side of skillet. Add the sliced meat to the open area and saute until no longer pink, 2 to 3 minutes.",
        "In a separate saucepan, heat Ragu(R) Old World Style(R) Traditional Sauce, Italian seasoning, and crushed red pepper over medium heat.",
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Slice rolls lengthwise and place, opened, on a baking sheet. Toast for 30 seconds under a broiler on low heat, watching them carefully so they don't burn; remove from oven. Rub toasted sides of rolls with cut side of whole garlic clove; brush lightly with olive oil.",
        "Fold cheese slices into meat and onion/pepper mix and stir until cheese begins to melt; distribute among the toasted roll bottoms. Top with a generous spoonful of Ragu(R) sauce; save the rest for dipping if desired.",
        "Sprinkle with fresh basil. Serve immediately."
    ],
    "ingredients": [
        "1 tablespoon butter",
        "1 medium onion, thinly sliced",
        "1 cup sliced fresh mushrooms",
        "1 green bell pepper, thinly sliced",
        "1 pinch salt",
        "1 clove garlic, minced",
        "1/2 pound very thinly sliced or shaved steak",
        "1 (24 ounce) jar Ragu® Old World Style® Traditional Sauce",
        "1 teaspoon dried Italian seasoning",
        "1/2 teaspoon crushed red pepper flakes",
        "4 Italian bread rolls",
        "1 clove garlic",
        "1 tablespoon extra-virgin olive oil",
        "1/3 pound provolone or fresh mozzarella cheese, sliced",
        "1/2 cup fresh basil leaves, torn"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Cheesesteak Sandwich",
    "url": "http://allrecipes.com/recipe/236788/italian-cheesesteak-sandwich/"
}
