{
    "directions": [
        "Pulse figs and raisins in a food processor until finely chopped, then stir together with remaining filling ingredients in a bowl. Chill, covered, at least 8 hours.",
        "Whisk together flour, sugar, baking powder, and salt in a large bowl. Add butter and blend with your fingertips or a pastry blender (or pulse in a food processor) just until most of mixture resembles coarse meal with some small (roughly pea-size) butter lumps. Add eggs, milk, vanilla, and zest and stir with a fork until a soft dough forms. Halve dough and gather each half into a ball, then flatten each half into a rough 6- by 4-inch rectangle between sheets of plastic wrap. Chill until firm, at least 8 hours.",
        "Preheat oven to 350°F.",
        "Roll out 1 rectangle of dough (keep remaining dough chilled) into a 15- by 14-inch rectangle on a well-floured surface with a floured rolling pin. Trim to a 13- by 10-inch rectangle (chill trimmings), then cut into 4 (10- by 3 1/4-inch) strips. Arrange 1/3 cup filling in a 1-inch-wide log lengthwise down center of each strip, then fold sides of each strip up over filling to enclose it, pinching edges together to seal. Turn rolls seam-sides down and press gently to flatten seams. Cut logs crosswise with a floured knife into 1 1/2-inch-wide slices and arrange 1/2 inch apart on buttered large baking sheets. Make more cookies in same manner with remaining chilled dough, trimmings (reroll once), and filling.",
        "Bake cookies in batches in middle of oven until golden around edges, 16 to 20 minutes. Transfer cookies to racks and cool until warm, about 10 minutes.",
        "Whisk together confectioners sugar, vanilla, and enough orange juice to make a pourable icing.",
        "Brush icing on warm cookies and decorate with nonpareils (if using), then cool completely.",
        "Available at some specialty bakeware shops and Sweet Celebrations (800-328-6722)."
    ],
    "ingredients": [
        "1 cup packed soft dried Mission figs (8 oz), hard tips discarded",
        "3/4 cup raisins (3 3/4 oz)",
        "3/4 cup mild honey",
        "1/4 cup brandy",
        "1 1/2 teaspoons finely grated fresh orange zest",
        "1 teaspoon finely grated fresh lemon zest",
        "1 tablespoon ground cinnamon",
        "1/4 teaspoon ground cloves",
        "1/4 teaspoon freshly grated nutmeg",
        "3/4 cup whole almonds (4 oz), toasted and coarsely chopped",
        "3/4 cup walnuts (3 oz), toasted and coarsely chopped",
        "4 cups all-purpose flour",
        "1 cup plus 2 tablespoons sugar",
        "1 tablespoon baking powder",
        "1 teaspoon salt",
        "2 sticks (1 cup) cold unsalted butter, cut into 1/2-inch cubes",
        "2 large eggs, lightly beaten",
        "1/2 cup whole milk",
        "1 1/2 teaspoons vanilla",
        "1 teaspoon finely grated fresh orange or lemon zest",
        "1 cup confectioners sugar",
        "1/2 teaspoon vanilla",
        "1 1/2 to 2 tablespoons fresh orange juice",
        "Garnish: multicolored nonpareils*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Fruit",
        "Dessert",
        "Bake",
        "Christmas",
        "Raisin",
        "Fig",
        "Almond",
        "Walnut",
        "Brandy",
        "Winter",
        "Honey",
        "Gourmet",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Italian Fig Cookies",
    "url": "http://www.epicurious.com/recipes/food/views/italian-fig-cookies-107444"
}
