{
    "directions": [
        "Preheat the broiler. Line a rimmed baking sheet with foil. Combine the ground turkey, ricotta, pesto, parmesan, 1/2 teaspoon salt and a few grinds of pepper in a large bowl. Mix with your hands until just combined. Form into 24 small meatballs (about 1 tablespoon each); transfer to the prepared baking sheet. Broil until lightly browned, 5 to 7 minutes.",
        "Meanwhile, heat the olive oil in a medium Dutch oven or pot over medium-high heat. Add the onion, garlic, Italian seasoning and 1/2 teaspoon salt. Cook, stirring, until the onion is softened, about 3 minutes. Stir in the chicken broth, 2 cups water, the escarole and ditalini. Cover and bring to a boil, then partially uncover and reduce the heat to maintain a gentle simmer. Cook until the pasta is al dente, about 10 minutes.",
        "Add the meatballs and simmer, uncovered, until warmed through, about 3 minutes. Season with salt and pepper. Drizzle each serving with olive oil and sprinkle with parmesan and parsley.",
        "Photograph by Antonis Achilleos"
    ],
    "ingredients": [
        "1 pound ground turkey",
        "1/4 cup part-skim ricotta cheese",
        "1/4 cup pesto",
        "1/4 cup grated parmesan cheese, plus more for topping",
        "Kosher salt and freshly ground pepper",
        "2 tablespoons extra-virgin olive oil, plus more for drizzling",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "1 teaspoon dried Italian seasoning",
        "4 cups low-sodium chicken broth",
        "1 head escarole (about 1 pound), tough outer leaves removed, roughly chopped",
        "4 ounces ditalini pasta (about 3/4 cup)",
        "Chopped fresh parsley, for topping"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Soup",
        "Meatballs",
        "Poultry Recipes",
        "Turkey Recipes"
    ],
    "title": "Italian Wedding Soup",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/italian-wedding-soup"
}
