{
    "directions": [
        "Heat oil in a 7-to 8-quart heavy pot over medium-high heat until it shimmers. Add onions, celery, carrots, and garlic and cook, stirring occasionally, until pale golden, about 10 minutes. Add eggplant and water and cook, covered, stirring occasionally, until eggplant is slightly softened, about 10 minutes.",
        "Stir in tomatoes with juice and bell peppers, then reduce heat to low and cook, uncovered, stirring occasionally, 15 minutes.",
        "Meanwhile, cook green beans in a 3- to 4-quart saucepan of well-salted boiling water until crisp-tender, about 5 minutes. Transfer with a slotted spoon to a large bowl. Add zucchini to boiling water and cook until crisp-tender, about 5 minutes. Transfer with slotted spoon to bowl with green beans. Add potatoes to boiling water and cook until just tender, about 10 minutes. Drain and add to beans and zucchini.",
        "Add boiled vegetables to stew and simmer, stirring, until all vegetables are very soft, about 15 minutes. Season with 1 1/2 teaspoons salt and 1/2 teaspoon pepper."
    ],
    "ingredients": [
        "1/3 cup olive oil",
        "2 medium onions, chopped",
        "2 celery ribs, halved lengthwise and cut into 1/4-inch-thick slices",
        "3 carrots, halved lengthwise and cut into 1/4-inch-thick slices",
        "4 garlic cloves, finely chopped",
        "1 1/4 pounds eggplant, cut into 1-inch pieces",
        "1/2 cup water",
        "1 (28-ounces) can whole tomatoes in juice, drained, juice reserved and tomatoes chopped, or 1 3/4 pounds fresh tomatoes, chopped",
        "2 red bell peppers, cut into 3/4-inch pieces",
        "3/4 pound green beans, trimmed and cut into 2-inch pieces",
        "1 1/4 pounds zucchini, halved lengthwise and cut into 1/4-inch-thick slices",
        "3/4 pound boiling potatoes (about 2 medium), peeled and cut into 1-inch pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Onion",
        "Tomato",
        "Vegetarian",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Celery",
        "Green Bean",
        "Bell Pepper",
        "Carrot",
        "Zucchini",
        "Family Reunion",
        "Healthy",
        "Vegan",
        "Potluck",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Italian Vegetable Stew (_Ciambotta_)",
    "url": "http://www.epicurious.com/recipes/food/views/italian-vegetable-stew-em-ciambotta-em-355473"
}
