{
    "directions": [
        "Preheat oven to 300°F. Butter and flour 12 miniature Bundt molds or 12 oversize muffin cups (each about 1-cup capacity). Toss nuts, figs, chocolate and ginger in medium bowl to blend.",
        "Using electric mixer, beat butter and sugar in large bowl until smooth and fluffy. Beat in eggs, 1/4 cup Frangelico and orange peel (mixture may look curdled). Sift both flours and salt over batter; mix in. Stir in nut and fruit mixture.",
        "Divide batter among molds. Bake cakes until tester inserted near center comes out clean, about 45 minutes (about 55 minutes if using muffin cups). Turn cakes out onto racks; brush with 1/4 cup liqueur. Cool cakes completely.",
        "Cut out twelve 10-inch cheesecloth squares. Pour 1 1/2 cups liqueur into small bowl. Dip 1 square into liqueur; squeeze out some but not all liqueur. Wrap 1 cake in liqueur-soaked cheesecloth, then in foil. Repeat dipping and wrapping with remaining cakes, adding more liqueur if needed. Chill at least 1 week and up to 2 weeks. Bring cakes to room temperature before serving.",
        "Stir chocolate, 2/3 cup cream and liqueur in heavy medium saucepan over low heat until chocolate melts and sauce is smooth.",
        "Arrange 1 cake on each plate. Drizzle with sauce. Pipe or spoon whipped cream alongside, if desired, and serve."
    ],
    "ingredients": [
        "3 cups hazelnuts, toasted, husked, coarsely chopped",
        "12 ounces diced Calimyrna figs",
        "8 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped",
        "1/3 cup minced crystallized ginger",
        "1 1/4 cups (2 1/2 sticks) unsalted butter, room temperature",
        "1 cup sugar",
        "5 large eggs",
        "2 cups (or more) Frangelico (hazelnut liqueur)",
        "2 tablespoons grated orange peel",
        "2 cups all purpose flour",
        "1/2 cup cake flour",
        "1/2 teaspoon salt",
        "12 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "2/3 cup whipping cream",
        "1/3 cup Frangelico",
        "Whipped cream (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Chocolate",
        "Egg",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Christmas",
        "Frangelico",
        "Winter",
        "Chill",
        "Hazelnut"
    ],
    "title": "Italian Fruitcakes with Frangelico Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/italian-fruitcakes-with-frangelico-chocolate-sauce-102700"
}
