{
    "directions": [
        "Pulse flour, sugar, baking powder, and salt in a food processor until combined. Add butter and pulse until mixture resembles coarse meal with some roughly pea-size butter lumps. Add eggs and pulse until just incorporated and dough begins to form large clumps.",
        "Turn out dough onto a work surface and divide into 6 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather dough together, using a pastry scraper if you have one, and form into a thick log. Cut off 2/3 of the log and form into a large rectangle for the bottom of the pie. Form the remaining piece into a smaller rectangle for the top of the pie. Chill each, wrapped in plastic wrap, until firm, at least 30 minutes.",
        "Bring rice and well-salted water to a boil in a 2-quart saucepan, then reduce heat and simmer, covered, until rice is tender, about 20 minutes. Drain in a sieve and rinse under cold water until cool. Drain well.",
        "Whisk together 3 yolks and sugar in a heatproof bowl, then whisk in cornstarch and flour until smooth (mixture will be very thick). Bring milk just to a boil in a small heavy saucepan, then gradually add hot milk to yolk mixture, whisking.",
        "Pour custard back into saucepan and bring to a boil over medium-low heat, whisking constantly (custard will become very thick), then boil, whisking, 1 minute. Remove from heat and whisk in butter and vanilla. Transfer to a bowl and chill, its surface covered with wax paper, until cold, about 2 hours.",
        "Stir together ricotta, custard, and remaining 2 yolks, then stir in zests, cinnamon, salt, and cooked rice.",
        "Preheat oven to 350°F with rack in middle. Generously butter a 13- by 9-inch metal baking pan and line the bottom with an overlapping double layer of foil, leaving 2 inches of overhang on both ends, then generously butter foil.",
        "Roll out 1 piece of dough between 2 sheets of wax paper into a 15- by 11-inch rectangle (about 1/8 inch thick). If dough becomes soft, chill or freeze until firm. Remove top sheet of wax paper and invert into baking pan, fitting it into pan. Chill shell. Roll out remaining piece of dough between sheets of wax paper in same manner. Cut 12 (3/4-inch-wide) crosswise strips (you will have a little dough left over).",
        "Spread filling in pan and arrange 6 strips, 1 1/4 inches apart, diagonally across filling, trimming ends to fit. Arrange remaining 6 strips, 1 1/4 inches apart, diagonally across first strips to form a lattice with diamond-shaped spaces. Trim lattice to fit in pan, then fold outside crust down over filling to make a border. Brush pastry with beaten egg.",
        "Bake pie until pastry is golden and filling is puffed and set, about 1 1/2 hours, loosely covering top of pie with foil after 50 minutes to prevent over-browning. Transfer to a rack to cool. When completely cool, lift pie out of pan using foil overhang and transfer to a platter."
    ],
    "ingredients": [
        "3 1/4 cups all-purpose flour",
        "6 tablespoons sugar",
        "1 1/2 teaspoons baking powder",
        "3/4 teaspoon salt",
        "2 sticks (1 cup) cold unsalted butter, cut into tablespoon pieces",
        "3 large eggs, lightly beaten",
        "3/4 cup Arborio rice",
        "4 cups water",
        "5 large egg yolks, divided",
        "2/3 cup sugar",
        "1 1/2 tablespoons cornstarch",
        "1/4 cup all-purpose flour",
        "2 cups whole milk",
        "3 tablespoons unsalted butter",
        "1 teaspoon pure vanilla extract",
        "1 pound ricotta (preferably fresh or homemade ; 2 cups)",
        "1 1/2 teaspoons grated orange zest",
        "1 1/2 teaspoons grated lemon zest",
        "1/4 teaspoon cinnamon",
        "1/4 teaspoon salt",
        "1 large egg, lightly beaten",
        "Strawberries in Sambuca"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Easter",
        "Ricotta",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Italian Rice Pie (Pastiera di Riso)",
    "url": "http://www.epicurious.com/recipes/food/views/italian-rice-pie-pastiera-di-riso-51233420"
}
