{
    "directions": [
        "Combine dried currants and 2 tablespoons Marsala in small bowl. Let soak for 15 minutes. Drain cherries and cut into eighths; drain on paper towels. Drain currants.",
        "In a food processor, puree ricotta cheese, sugar, 3 tablespoons Marsala and whipping cream until smooth. Transfer to medium bowl. Gently mix in currants and cherries.",
        "Peel any loose crust from pound cake and discard. Cut pound cake lengthwise into 3 horizontal layers. Place bottom layer on serving platter. Spread half of filling over. Place second pound cake layer on top of filling. Spread remaining filling over. Arrange third pound cake layer on top of filling. Smooth sides with rubber spatula. Refrigerate cassata until filling is firm, about 2 hours.",
        "To make the chocolate frosting:  Combine 1/2 cup reserved cherry syrup, semisweet chocolate and 1/4 cup Marsala in heavy medium saucepan. Stir over low heat until chocolate melts and mixture is smooth. Remove from heat. Add unsalted butter a few pieces at a time and whisk until melted. Refrigerate frosting until thickened to spreading consistency, stirring occasionally, about 20 minutes.",
        "Slide sheets of waxed paper under edges of cassata to protect the serving dish. Put 1 cup chocolate frosting to pastry bag fitted with medium star tip. Spread remaining chocolate frosting over sides and top of cassata. Pipe frosting in pastry bag in swirls on long sides and in rosettes along upper edges of cassata. Refrigerate for several hours until set. Let cassata stand at room temperature 20 minutes before serving."
    ],
    "ingredients": [
        "1/3 cup dried currants",
        "5 tablespoons Marsala wine",
        "1 (16.5 ounce) can pitted dark sweet cherries, drained with syrup reserved",
        "1 pint ricotta cheese",
        "1/4 cup white sugar",
        "2 tablespoons heavy cream",
        "1 (12 ounce) package prepared pound cake",
        "12 (1 ounce) squares semisweet chocolate, chopped",
        "1/4 cup Marsala wine",
        "1 cup unsalted butter"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Cassata Cake",
    "url": "http://allrecipes.com/recipe/17536/italian-cassata-cake/"
}
