{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Bring a large pot of water and 1 teaspoon salt to a boil. Cook lasagna noodles in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 8 minutes. Drain and rinse under cold water.",
        "Heat a large skillet over medium-high heat and stir in Italian sausage. Cook and stir until sausage is crumbly, evenly browned, and no longer pink, about 10 minutes. Drain and discard any excess grease. Add diced tomatoes, tomato sauce, 1 tablespoon Italian seasoning, 1 tablespoon Greek seasoning, 1 tablespoon oregano, 1 tablespoon basil, 1 tablespoon parsley, 1 tablespoon thyme, 1 teaspoon rosemary, 1 tablespoon garlic powder, and 1 teaspoon salt; stir well. Simmer until flavors have blended, about 20 minutes.",
        "Set aside 1/2 cup mozzarella cheese. Mix remaining mozzarella cheese with 1 teaspoon Italian seasoning, 1 teaspoon Greek seasoning, 1 teaspoon oregano, 1 teaspoon basil, 1 teaspoon parsley, 1 teaspoon thyme, and 1 teaspoon rosemary in a large bowl.",
        "Spoon a layer of meat sauce into the bottom of a 9x13-inch glass baking dish; place 3 to 4 lasagna noodles atop meat sauce layer. Spread another layer of meat sauce over lasagna noodles; sprinkle a layer of the seasoned mozzarella cheese. Repeat layering with remaining ingredients and top casserole with the reserved 1/2 cup plain mozzarella cheese.",
        "Bake in the preheated oven until sauce is bubbling and cheese is melted, 30 to 40 minutes. Let stand 10 minutes before serving."
    ],
    "ingredients": [
        "1 teaspoon salt",
        "1 (16 ounce) package lasagna noodles",
        "1 pound ground Italian sausage",
        "1 (14.5 ounce) can diced tomatoes",
        "3 (8 ounce) cans tomato sauce",
        "1 tablespoon Italian seasoning",
        "1 tablespoon Greek seasoning",
        "1 tablespoon dried oregano",
        "1 tablespoon dried basil",
        "1 tablespoon dried parsley",
        "1 tablespoon ground thyme",
        "1 teaspoon dried rosemary",
        "1 tablespoon garlic powder",
        "1 teaspoon salt",
        "1 (16 ounce) package shredded mozzarella cheese",
        "1 teaspoon Italian seasoning",
        "1 teaspoon Greek seasoning",
        "1 teaspoon dried oregano",
        "1 teaspoon dried basil",
        "1 teaspoon dried parsley",
        "1 teaspoon ground thyme",
        "1 teaspoon dried rosemary"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Sausage Lasagna",
    "url": "http://allrecipes.com/recipe/229101/italian-sausage-lasagna/"
}
