{
    "directions": [
        "Heat the oil in a large nonstick skillet over medium-high heat for 2 to 3 minutes, until the oil's almost smoking (you will begin to smell the oil at that point).",
        "Add the sausages and cook, turning them often for even browning, for about 10 minutes, until they're browned all over but not cooked through.",
        "Move the sausages to the side of the skillet to continue to cook while you sear the radicchio.",
        "Put a couple of radicchio leaves in the skillet in a single layer and cook them for about 45 seconds on each side, until they're seared and wilted slightly.",
        "Remove the leaves to a plate and cook the remaining leaves in the same way, adding a bit more oil to the pan if it's dry.",
        "While you sear the radicchio leaves, continue to cook and turn the sausages for another 10 minutes, until they're cooked through, and transfer them to a plate when they're done.",
        "Add a bit more olive oil if necessary to coat the skillet.",
        "Add the onions, garlic, and a pinch of kosher salt and sauté for about 1 1/2 minutes, until the onions are soft and the garlic is soft and fragrant, stirring constantly so the garlic doesn't brown. Reduce the heat to medium, add the beans and broth, and simmer them until the liquid is reduced by half, about 5 minutes.",
        "Stir in the oregano and season with kosher salt.",
        "Arrange four radicchio leaves in a clover pattern on each of four plates.",
        "Spoon the beans over the radicchio, dividing them evenly, and drizzle them with the sauce left in the skillet.",
        "Cut the sausages in half at an angle and place the two pieces of each sausage side by side on each plate.",
        "Top with a dollop of Garlic Mayonnaise, if you are using it, and drizzle the sausage and beans with the high-quality olive oil."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil, plus extra as needed",
        "4 sweet or spicy Italian pork sausages (preferably flavored with fennel; about 3/4 pound)",
        "16 large whole radicchio leaves",
        "16 small jarred onions, quartered (about 4 ounces or 1 cup)",
        "2 large garlic cloves, grated or minced (about 2 teaspoons)",
        "Kosher salt",
        "2 15-ounce cans giant white beans, rinsed and drained (about 3 cups)",
        "1 cup vegetable or chicken broth",
        "1 heaping tablespoon finely chopped fresh oregano leaves",
        "High-quality extra-virgin olive oil, for drizzling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Sausage",
        "Radicchio"
    ],
    "title": "Italian Sausage with Giant White Beans and Radicchio",
    "url": "http://www.epicurious.com/recipes/food/views/italian-sausage-with-giant-white-beans-and-radicchio-355897"
}
