{
    "directions": [
        "Prepare the ingredients for grilling",
        "Prepare a hot fire in a grill.",
        "In a bowl, combine the onion, bell pepper and olive oil and stir to coat. Season with salt and pepper. Place the vegetables in the center of a 12-inch-long sheet of heavy-duty aluminum foil. Fold the sheet and pleat tightly at the top and sides to enclose the vegetables.",
        "In a bowl, combine the ground beef, 2 Tbs. of the pesto, the garlic, the 1 tsp. salt and the 1/2 tsp. pepper and mix well. Form into 4 equal patties.",
        "In a small bowl, stir together the mayonnaise and the remaining 2 Tbs. pesto. Set aside.",
        "Grill the vegetables and burgers",
        "Lightly oil the grill rack. Place the vegetable packet on the rack and cover the grill. Cook, turning occasionally, for 14 minutes. Add the patties to the rack, cover the grill and cook, turning once, until nicely browned on both sides, about 3 minutes per side for medium-rare, or until done to your liking. At this point, the vegetables should be tender as well (open the packet to check).",
        "During the last minute, place the rolls, cut sides down, on the grill and toast lightly. Serve the burgers on the rolls with the peppers, onions and pesto mayonnaise. Serves 4.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Grilling,",
        "by Rick Rodgers (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "1 large yellow onion, cut into half-moons 1/4 inch thick",
        "1 red bell pepper, seeded and cut lengthwise into strips 1/4 inch wide",
        "2 Tbs. olive oil",
        "Salt, to taste, plus 1 tsp.",
        "Freshly ground pepper, to taste, plus 1/2 tsp.",
        "1 1/2 lb. ground beef",
        "4 Tbs. pesto, purchased",
        "2 garlic cloves, minced",
        "1/2 cup mayonnaise",
        "4 round Italian rolls, split horizontally"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Italian Burgers with Peppers and Onions",
    "url": "http://www.williams-sonoma.com/recipe/italian-burgers-with-peppers-and-onions.html"
}
