{
    "directions": [
        "Preheat the oven to 325°F",
        "Individually wrap the 4 sections of baguette in aluminum foil and set in the oven to warm, about 10 minutes. Trim the fennel bulb of any fronds or stalks and remove a slice or two from the root end. Using a mandoline, a sharp knife, or a food processor, shave the fennel as thin as possible —the shavings should be nearly transparent. Toss the fennel with the lemon juice, olive oil, a pinch of salt, and some pepper. Set aside.",
        "Remove one of the baguette sections from the oven. Spread the bottom half with a tablespoon or so of the olive paste. Lay on top 2 to 4 slices of preserved lemon, if using. Arrange one fourth of the tuna on the sandwich. Dot with some of the harissa, and top with a scattering of the fennel salad. Close the sandwich and wrap up again with foil. Set aside. Repeat with the remaining bread to form 4 sandwiches. Cut each in half through the foil and serve.",
        "Leftovers: Assembled sandwiches will keep for eight hours or so, but no more. As they sit, the bread gets a little soggy, but that isn't such a bad thing."
    ],
    "ingredients": [
        "1 baguette, split in half and cut into 4 sections",
        "1 small fennel bulb",
        "Juice of 1 lemon (about 1/4 cup)",
        "2 tablespoons extra-virgin olive oil",
        "Kosher salt and freshly ground black pepper",
        "1/4 cup black or green olive paste or tapenade",
        "Peel of 1/4 preserved lemon, very thinly sliced (optional)",
        "10 to 12 ounces finest imported Italian tuna packed in olive oil, drained",
        "1 tablespoon harissa or other hot pepper sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Fish",
        "Olive",
        "Picnic",
        "Lunch",
        "Tuna",
        "Fennel",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Italian Tuna and Shaved Fennel Sandwich with Black Olive Paste",
    "url": "http://www.epicurious.com/recipes/food/views/italian-tuna-and-shaved-fennel-sandwich-with-black-olive-paste-235663"
}
