{
    "directions": [
        "Preheat the oven to 350 degrees F.",
        "For the meatloaf: Pour the milk over the bread and allow it to soak in for several minutes. Place the ground beef, milk-soaked bread, Parmesan, parsley, Italian seasoning, salt, seasoned salt and some pepper in a large mixing bowl. Add the eggs. With clean hands, mix the ingredients until well combined.",
        "Form the mixture into a loaf shape on a foil-lined broiler pan, which will allow the fat from the meat to drain. Lay the pancetta slices over the top, tucking them underneath the meatloaf to give the meatloaf some support.",
        "For the tomato sauce: Put the diced tomatoes into a bowl. Add the brown sugar, dry mustard and cayenne pepper and splash in the Worcestershire sauce. Stir the mixture until well combined. Pour one-third of the sauce over the top of the meatloaf.",
        "Bake for 45 minutes, and then pour another third of the remaining tomato sauce over the meatloaf. Bake until no longer pink in the middle, for an additional 20 to 25 minutes. Allow to sit 10 minutes before serving.",
        "Serve with the remaining tomato sauce on the side as a dipping sauce."
    ],
    "ingredients": [
        "1 cup milk",
        "6 slices crusty Italian bread",
        "2 pounds ground beef",
        "1 cup grated Parmesan",
        "1/4 to 1/2 cup minced fresh flat-leaf parsley",
        "1 tablespoon Italian seasoning",
        "1 teaspoon salt",
        "1/4 teaspoon seasoned salt, such as Lawry's",
        "Freshly ground black pepper",
        "4 eggs",
        "8 to 12 thin pancetta slices",
        "2 cans diced tomatoes, drained",
        "1/4 cup brown sugar",
        "1 teaspoon dry mustard",
        "1 pinch of cayenne pepper",
        "1 to 2 dashes Worcestershire sauce"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Meatloaf",
        "Meat",
        "Tomato",
        "Vegetable",
        "Main Dish Recipes"
    ],
    "title": "Italian Meatloaf",
    "url": "http://www.foodnetwork.com/recipes/ree-drummond/italian-meatloaf"
}
