{
    "directions": [
        "Line 5 1/2- to 6-cup metal loaf pan with plastic wrap, overlapping sides. Melt chocolate and butter with corn syrup in heavy large saucepan over medium-low heat, stirring until smooth. Cool to lukewarm, whisking occasionally.",
        "Whisk 1/4 cup cream, 4 tablespoons Frangelico, yolks, sugar and 2 tablespoons water in small metal bowl. Set bowl over saucepan of simmering water and whisk constantly until candy thermometer registers 160°F., about 3 minutes. Remove from over water. Add yolk mixture and remaining 2 tablespoons Frangelico to chocolate mixture in pan; whisk until smooth. Mix in nuts. Chill until cool, about 10 minutes. Using electric mixer, beat remaining 1/4 cup cream with sour cream in large bowl to stiff peaks. Add chocolate mixture and fold together. Pour filling into prepared pan; smooth top. Cover and chill overnight.",
        "Combine all ingredients in heavy medium saucepan. Stir over low heat until melted. Cool to lukewarm. Pour 1/2 cup glaze over filling in pan; shake pan gently to smooth top. Freeze until glaze sets, about 20 minutes.",
        "Line cookie sheet with foil. Lift loaf from pan. Turn loaf out onto foil; peel off plastic. Whisk remaining glaze over low heat until just spreadable. Pour all but 1/4 cup glaze over loaf. Spread over top and sides with icing spatula, spreading glaze that runs onto foil up sides of loaf to cover completely. Chill 1 hour. (Can be prepared 2 days ahead. Cover and chill loaf and reserved 1/4 cup glaze separately.)",
        "Bring half and half to simmer in heavy medium saucepan. Scrape in seeds from vanilla bean; add bean. Whisk yolks and sugar in medium bowl to blend. Whisk in hot half and half mixture. Return mixture to saucepan and stir over medium-low heat until custard thickens and leaves path on back of spoon when finger is drawn across, about 5 minutes; do not boil. Strain into bowl. Mix in cream and Frangelico. Cover and chill until cold. (Can be prepared 2 days ahead.)",
        "Melt milk chocolate in top of double boiler over simmering water, stirring until smooth. Spoon all but 2 tablespoons melted chocolate into parchment cone. Remove loaf from foil and transfer to platter. Pipe chocolate lines crosswise atop loaf, spacing 1/8 inch apart. Dip 1 hazelnut halfway into chocolate in pan; place atop center of loaf. Repeat with remaining nuts, spacing evenly and forming line down center. (Can be prepared 3 days ahead; refrigerate.)",
        "Using long thin knife, cut loaf into 1/2-inch-thick slices, wiping knife clean between cuts. Place slices on plate; surround with sauce. Whisk reserved glaze over low heat until melted. Spoon into parchment cone. Pipe Zs atop sauce."
    ],
    "ingredients": [
        "12 ounces imported milk chocolate (such as Lindt), chopped",
        "1 cup (2 sticks) unsalted butter",
        "1/3 cup light corn syrup",
        "1/2 cup chilled whipping cream",
        "6 tablespoons Frangelico (hazelnut liqueur)",
        "4 large egg yolks",
        "2 tablespoons sugar",
        "2 tablespoons water",
        "1 cup very finely chopped toasted hazelnuts (about 4 ounces)",
        "1/2 cup sour cream",
        "9 ounces bittersweet (not unsweetened) or semisweet chocolate,chopped",
        "10 tablespoons unsalted butter",
        "3 tablespoons light corn syrup",
        "2 cups half and half",
        "1 vanilla bean, split lengthwise",
        "6 egg yolks",
        "6 tablespoons sugar",
        "1 cup chilled whipping cream",
        "1/4 cup Frangelico",
        "3 ounces imported milk chocolate (such as Lindt), finely chopped",
        "12 husked toasted hazelnuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mixer",
        "Chocolate",
        "Dairy",
        "Nut",
        "Dessert",
        "Freeze/Chill",
        "Frangelico",
        "Anniversary",
        "Hazelnut"
    ],
    "title": "Italian Gianduia Loaf with Custard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/italian-gianduia-loaf-with-custard-sauce-2829"
}
