{
    "directions": [
        "Scatter bread on a rimmed baking sheet in a single layer. Let stand at room temperature to slightly dry out, about 2 hours.",
        "Working in batches, cook collards and kale separately in a large pot of boiling salted water until slightly softened, about 3 minutes per batch. Rinse to cool. Squeeze out excess water; roughly chop. Set aside.",
        "Heat 1/4 cup oil in a large heavy pot over medium heat. Add carrots, celery, and leek; stir often until softened, 8-10 minutes.",
        "Add garlic and red pepper flakes. Cook, stirring until fragrant, about 1 minute. Add tomatoes, crushing with your hands as you add them. Cook, stirring frequently, until liquid is evaporated and tomatoes begin to stick to the bottom of the pot, 10-15 minutes.",
        "Add broth, beans, thyme, marjoram, bay leaf, and reserved greens; season with salt and pepper. Bring to a boil, reduce heat, and simmer until flavors meld and soup thickens slightly, 40-50 minutes. DO AHEAD: Soup can be made 2 days ahead. Let cool slightly; chill until cold. Cover and keep chilled. Reheat before continuing. Store bread airtight at room temperature.",
        "Just before serving, gently stir bread and 1/4 cup oil into soup. Divide among bowls, top with Parmesan, and drizzle with oil."
    ],
    "ingredients": [
        "1/2 1-pound loaf sourdough bread, torn into 2\" pieces (about 6 cups)",
        "1 bunch collard greens, center ribs and stems removed",
        "1 bunch Tuscan or other kale, center ribs and stems removed",
        "Kosher salt",
        "1/2 cup olive oil, divided, plus more for serving",
        "2 medium carrots, peeled, finely chopped",
        "2 celery stalks, finely chopped",
        "1 leek, white and pale-green parts only, chopped",
        "4 garlic cloves, chopped",
        "1/2 teaspoons crushed red pepper flakes",
        "1 28-ounce can whole peeled tomatoes, drained",
        "8 cups low-sodium vegetable broth",
        "3 15-ounce cans cannellini (white kidney) beans, rinsed",
        "4 sprigs thyme",
        "1 sprig marjoram or oregano",
        "1 bay leaf",
        "Freshly ground black pepper",
        "Shaved Parmesan (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Leafy Green",
        "Tomato",
        "Vegetable",
        "Dinner",
        "Kale",
        "Collard Greens",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Italian Vegetable Stew",
    "url": "http://www.epicurious.com/recipes/food/views/italian-vegetable-stew-51149120"
}
