{
    "directions": [
        "Rinse squid under cold running water and pat dry. If squid are large, halve ring of tentacles, then cut longer tentacles crosswise into 2-inch pieces. Pull off flaps from squid bodies and cut into 1/4-inch-thick slices. Cut bodies crosswise into 1/4-inch-thick rings.",
        "Pat shrimp dry and sprinkle with pepper and 1/4 teaspoon salt. Heat oil in a wide 6- to 8-quart heavy pot over moderately high heat until hot but not smoking, then sear shrimp in 2 batches, turning over once, until golden but not cooked through, about 2 minutes per batch. Transfer shrimp with a slotted spoon to a bowl.",
        "Add garlic, red pepper flakes, and oregano to pot and sauté, stirring, until golden, about 30 seconds. Add wine and 1/2 cup water and bring to a boil. Stir in clams and cook, covered, over moderately high heat until shells open wide, checking frequently after 6 minutes and transferring as opened with a slotted spoon to bowl with shrimp. (Discard any unopened clams after 8 minutes.) Stir in mussels and cook, covered, over moderately high heat until shells open wide, checking frequently after 3 minutes and transferring as opened with a slotted spoon to bowl with shrimp. (Discard any unopened mussels after 6 minutes.)",
        "Put oven rack in middle position and preheat oven to 425°F.",
        "Add stock to pot along with remaining 4 cups water, tomatoes with juice, sugar, and remaining 1/2 teaspoon salt and simmer, uncovered, 15 minutes.",
        "Arrange bread slices in 1 layer on a baking sheet, then drizzle with oil and season with salt. Bake, turning over once, until golden, about 10 minutes total. Transfer toasts to a rack to cool slightly, then rub lightly with cut sides of garlic and sprinkle with parsley.",
        "Add halibut to stock and cook at a bare simmer, covered, until just cooked through, about 2 minutes. Stir in squid and reserved shellfish, then remove from heat and let stand, covered, 1 minute. Stir in basil and parsley and serve immediately, with toasts alongside for dipping."
    ],
    "ingredients": [
        "1 lb cleaned squid, bodies and tentacles separated but kept intact",
        "1/2 lb large shrimp in shell (21 to 25 per lb), peeled, leaving tail and first segment of shell intact, and deveined",
        "1/8 teaspoon black pepper",
        "3/4 teaspoon salt",
        "1/4 cup olive oil",
        "3 garlic cloves, finely chopped",
        "1/2 teaspoon dried hot red pepper flakes",
        "1/4 teaspoon dried oregano, crumbled",
        "1 cup dry white wine",
        "4 1/2 cups water",
        "12 small hard-shelled clams such as littlenecks (less than 2 inches in diameter), scrubbed",
        "12 mussels (preferably cultivated), scrubbed and beards removed",
        "4 cups fish stock or bottled clam juice (32 fl oz)",
        "2 (14-oz) cans diced tomatoes in juice",
        "1 teaspoon sugar",
        "1 lb skinless halibut fillet, cut into 1-inch pieces",
        "1/4 cup chopped fresh basil",
        "1/4 cup chopped fresh flat-leaf parsley",
        "1 (12-inch) Italian loaf, cut into 1/2-inch-thick slices",
        "2 tablespoons olive oil",
        "1 garlic clove, halved crosswise",
        "2 tablespoons finely chopped fresh flat-leaf parsley",
        "Accompaniment: extra-virgin olive oil for drizzling"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Fish",
        "Garlic",
        "Shellfish",
        "Sauté",
        "Stew",
        "Christmas",
        "Dinner",
        "Lunch",
        "Shrimp",
        "Squid",
        "White Wine",
        "Winter",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Italian Fish Soup",
    "url": "http://www.epicurious.com/recipes/food/views/italian-fish-soup-109020"
}
