{
    "directions": [
        "On a plate, stir together the flour, 1 tsp. salt and 1/2 tsp. pepper. Turn the ribs in the seasoned flour, shaking off any excess. In a large, heavy pot, over medium-high heat, warm the olive oil. Working in batches, sear the ribs, turning occasionally, until evenly browned, about 10 minutes per batch. Transfer to a plate.",
        "Add the pancetta to the pot and sauté until mostly crisp, 4 to 5 minutes. Add the onions and sauté until beginning to soften, about 3 minutes. Stir in the garlic and red pepper flakes and sauté until fragrant, about 30 seconds. Add the carrots, tomato paste and sugar and cook, stirring often, until well blended, about 1 minute. Add the wine, bring to a boil and stir to scrape up any browned bits on the pan bottom. Stir in the tomatoes and their juices, the broth and vinegar and bring to a boil.",
        "Preheat an oven to 350°F (180°C).",
        "Return the ribs to the pot with the tomato mixture. Add the bay leaves, rosemary and thyme sprigs, and oregano. Cover, transfer to the oven and cook until the ribs are very tender, about 2 hours.",
        "Skim as much fat as possible from the cooking liquid and discard the bay leaves. Season with salt and pepper and serve. Serves 6 to 8.",
        "Adapted from Williams-Sonoma",
        "One Pot of the Day",
        ", by Kate McMillan (Weldon Owen, 2012)"
    ],
    "ingredients": [
        "3 Tbs. all-purpose flour",
        "Salt and freshly ground pepper",
        "5 1/2 to 6 lb. (2.75 to 3 kg) bone-in beef short ribs",
        "1/4 cup (2 fl. oz./60 ml) olive oil",
        "2 oz. (60 g) pancetta, chopped",
        "2 yellow onions, finely chopped",
        "4 garlic cloves, minced",
        "1 tsp. red pepper flakes",
        "2 carrots, finely chopped",
        "2 Tbs. tomato paste",
        "1 Tbs. sugar",
        "1 cup (8 fl. oz./250 ml) dry red wine",
        "1 can (14 1/2 oz./455 g) diced tomatoes",
        "1 cup (8 fl. oz./250 ml) beef broth",
        "1/4 cup (2 fl. oz./60 ml) balsamic vinegar",
        "2 bay leaves",
        "2 fresh rosemary sprigs",
        "2 fresh thyme sprigs",
        "1 Tbs. dried oregano"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Italian Braised Short Ribs",
    "url": "http://www.williams-sonoma.com/recipe/italian-braised-short-ribs.html"
}
