{
    "directions": [
        "Heat the olive oil in a large skillet over medium heat and saute the garlic and onions until softened, about 2 minutes. Add the meat and cook until browned, breaking up large pieces as it cooks. Strain off excess fat from the skillet. Add the parsley and cook, about 3 minutes. Add the thyme, oregano, 2 teaspoons salt, 1 teaspoon black pepper, cayenne and red pepper flakes. Taste and add more seasoning if needed. Keep in mind that rice and cheese contain salt so be careful not to over salt the meat mixture. Let the meat mixture cool a bit. Add the tomato sauce. Combine the rice with the cheese but be careful not to mash the rice. Add the rice mixture to the meat mixture and stir gently to combine. Check the seasonings. Add additional salt and pepper if necessary.",
        "Line a baking sheet with parchment paper. Use a small to medium ice cream scoop (number 10) to shape the balls so they are a consistent size, and then hand roll the balls as tightly as you can.",
        "Pour enough canola oil into a deep skillet or Dutch oven to reach 5 inches. Heat the oil over medium heat to 350 degrees F; use a deep-fry thermometer to check the oil temperature.",
        "Whisk the eggs in a small baking dish. Place the breadcrumbs in another baking dish. Roll the rice balls lightly in the eggs and then immediately roll in the breadcrumbs to form a coating. Shake off the excess breadcrumbs. Place them on the prepared baking sheet and refrigerate or freeze until you are ready to fry.",
        "To fry, carefully drop the rice balls into the hot oil, a few at a time, taking care not to overcrowd and lower the oil temperature. Cook until golden brown, 2 to 4 minutes per batch. Bring the oil back up to 350 degrees F before cooking each batch. Drain the rice balls on paper towels before serving.",
        "Serve with Marinara Sauce for dipping. Garnish with the basil.",
        "This recipe was created by a contestant during a cooking competition. The Food Network Kitchens have not tested it for home use, therefore, we cannot make any representation as to the results.",
        "Heat the olive oil in the bottom of a large pot. Add the onions and cook until translucent and softened, about 5 minutes. Add the garlic and cook for 1 minute. Use some of the liquid from the tomatoes to deglaze the pan, and then add the tomatoes, basil, oregano, thyme, salt and pepper. Use an immersion blender to puree, taking care to leave the tomatoes slightly chunky. (If you don't have an immersion blender, you can add everything to a blender or food processor.)",
        "Bring to a boil and cook for 5 minutes, stirring frequently to keep from burning on the bottom. Reduce the heat to low and cook for 1 hour or longer so that the marinara thickens as some of the liquid cooks out. Check seasoning prior to serving. Add salt as necessary."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "5 cloves garlic, minced",
        "1 medium onion, diced small",
        "1 pound ground beef",
        "1 pound ground veal",
        "1 cup Italian flat-leaf parsley leaves, minced",
        "2 tablespoons minced fresh thyme",
        "1 tablespoon dried oregano",
        "Kosher salt and ground black pepper",
        "1/2 teaspoon cayenne pepper",
        "1/2 teaspoon red pepper flakes",
        "1 1/2 cups tomato sauce",
        "2 cups cooked and cooled Arborio rice (cooked until just done, not overcooked)",
        "2 cups grated Parmesan",
        "Canola oil, for frying",
        "5 eggs",
        "3 cups breadcrumbs with Italian seasoning",
        "Marinara Sauce, recipe follows, or store-bought",
        "3 tablespoons minced fresh basil",
        "1 tablespoon olive oil",
        "1 onion, chopped",
        "4 cloves garlic, minced",
        "Three 28-ounce cans whole peeled tomatoes, including liquid",
        "1 cup fresh basil leaves",
        "1/2 cup fresh oregano leaves",
        "1/2 cup fresh thyme leaves",
        "2 teaspoons kosher salt",
        "1/2 teaspoon ground black pepper"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sauce Recipes",
        "Rice Recipes",
        "Tomato",
        "Vegetable",
        "Appetizer"
    ],
    "title": "Italian Rice Balls",
    "url": "http://www.foodnetwork.com/recipes/martie-duncan/italian-rice-balls-recipe"
}
