{
    "directions": [
        "For the beef: Combine the chuck, bell peppers, onions, garlic, tomatoes, Italian seasoning, fennel seeds, 2 1/2 teaspoons salt, and some pepper in a slow cooker. Cook on the low setting for 8 hours. Use a ladle to remove some of the excess fat from the surface, then coarsely shred the beef with two forks. Season with salt and pepper.",
        "For the aioli: Place the egg, garlic and Dijon in a food processor and pulse to combine. With the motor running, add the olive oil and vegetable oil in a very slow steady stream until it is all incorporated. Add the in the giardiniera to the food processor and pulse until chopped. Season with salt and pepper.",
        "Spread about 2 tablespoons of the aioli on both sides of the bread and then make sandwiches with the shredded beef. Serve immediately.",
        "In a small bowl, mix together the basil, marjoram, oregano, parsley, granulated garlic, rosemary, thyme and red pepper flakes. Store in a jar with a tight-fitting lid."
    ],
    "ingredients": [
        "4 pounds boneless beef chuck roast, quartered",
        "2 red, orange or yellow bell peppers, seeded and sliced",
        "1 small onion, halved and thinly sliced",
        "2 cloves garlic, chopped",
        "One 15-ounce can diced tomatoes with basil and oregano",
        "2 teaspoons Italian Seasoning, recipe follows",
        "1/2 teaspoon whole fennel seeds",
        "Kosher salt and freshly ground black pepper",
        "1 large egg",
        "2 cloves garlic, finely grated",
        "1 teaspoon Dijon mustard",
        "1/2 cup extra-virgin olive oil",
        "1/2 cup vegetable oil",
        "One 16-ounce jar giardiniera, drained",
        "Kosher salt and freshly ground black pepper",
        "Four 12- to 14-inch loaves French bread, halved crosswise, split and lightly toasted",
        "3 tablespoons dried basil",
        "3 tablespoons dried marjoram",
        "3 tablespoons dried oregano",
        "3 tablespoons dried parsley",
        "1 tablespoon granulated garlic",
        "1 teaspoon dried rosemary",
        "1 teaspoon dried thyme",
        "1/4 teaspoon red pepper flakes"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Sandwich",
        "Beef",
        "Meat",
        "Main Dish Recipes",
        "Slow-Cooker"
    ],
    "title": "Italian Slow Cooker Beef Sandwiches with Giardiniera Aioli",
    "url": "http://www.foodnetwork.com/recipes/valerie-bertinelli/italian-slow-cooker-beef-sandwiches-with-giardiniera-aioli"
}
