{
    "directions": [
        "Sift flour, 3/4 cup confectioners' sugar, baking powder, and pinch of salt in a large bowl.",
        "Mash the unsalted butter with a fork until thoroughly worked into the flour mixture; stir in 1 tablespoon vanilla extract and 1 tablespoon anise liqueur.",
        "Stir 3 eggs into the flour mixture to make a workable dough. Turn dough out onto a floured work surface and knead a few times; roll the dough into a ball.",
        "Chill dough in refrigerator at least 20 minutes or up to 1 hour.",
        "Place ricotta cheese, mascarpone cheese, and 12 eggs in a large bowl. Beat mixture with an electric mixer on high speed until smooth. (If you prefer, process the mixture in a large food processor until smooth, working in batches if necessary.)",
        "Mix 1 1/2 cup confectioners' sugar, heavy cream, 1/4 cup anise liqueur, 1 tablespoon vanilla extract, 1/4 teaspoon salt, and lemon zest into the ricotta cheese mixture until thoroughly combined.",
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Grease the inside of a 9-inch springform pan with butter and sprinkle with flour.",
        "Remove chilled dough from refrigerator and roll into a large circle on a floured work surface. Fit the dough into the prepared springform pan.",
        "Pour cheesecake filling into the dough. Place a large roasting pan into oven; place the cheesecake into the roasting pan. Pour enough hot water into the outer pan to reach several inches up the side of the springform pan.",
        "Bake in the preheated oven until the top is golden brown and a toothpick inserted into the middle of the cheesecake comes out clean, about 2 hours."
    ],
    "ingredients": [
        "2 1/2 cups all-purpose flour",
        "3/4 cup confectioners' sugar",
        "1 1/2 teaspoons baking powder",
        "1 pinch salt",
        "1/2 cup unsalted butter at room temperature",
        "1 tablespoon vanilla extract",
        "1 tablespoon anise flavored liqueur",
        "3 large eggs",
        "3 pounds ricotta cheese",
        "1 (17.5 ounce) package mascarpone cheese",
        "12 large eggs",
        "1 1/2 cups confectioners' sugar",
        "1 cup heavy whipping cream",
        "1/4 cup anise flavored liqueur",
        "1 tablespoon vanilla extract",
        "1/4 teaspoon salt",
        "2 lemons (zest only)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Easter Cheesecake",
    "url": "http://allrecipes.com/recipe/220934/italian-easter-cheesecake/"
}
