{
    "directions": [
        "Heat 2 tablespoons olive oil in a large saucepan over medium heat. Saute onion and garlic until onion is soft and translucent. Pour in crushed tomatoes and whole tomatoes. As you are adding the whole tomatoes, let them slowly slide through your fingers and crush them coarsely on the way into the pot. Season with 1/4 cup of the parsley and 1 teaspoon garlic powder. Cover, and reduce heat to low.",
        "In a large bowl, mix the ground beef chuck, breadcrumbs, 1 teaspoon garlic powder, 1/8 cup parsley, egg, milk, and salt and pepper to taste. Mix ingredients with your hands until well blended. Form into small, golf ball-size meatballs. Slice all of the sausage links but one hot and one mild link into 1/2 inch chunks.",
        "Heat 2 tablespoons in a large skillet over medium heat. The oil should be slightly smoking. Slice open the remaining links of hot and mild sausage, and crumble into the pan. Saute, continually breaking up the pieces, until they are all golden brown. Transfer to the sauce. Brown the meatballs, chopped sausage links, and pork bones on all sides until they are a deep golden brown. You may need to do this in stages, and continually transfer into the sauce when browned. Drain excess fat.",
        "Pour the red wine into the skillet and deglaze all of the brown chunks on the bottom of the pan. Let the wine reduce to about half, then transfer into the sauce. Frequently stir, and season with salt and pepper to taste for about another hour after the last meat has been transferred into the pan. Finish by stirring the remaining fresh parsley into the sauce. Spoon sauce over your favorite pasta and serve the meat on a separate plate."
    ],
    "ingredients": [
        "4 tablespoons extra virgin olive oil, divided",
        "1 white onion, diced",
        "3 cloves garlic, crushed",
        "2 (28 ounce) cans crushed tomatoes",
        "2 (28 ounce) cans whole peeled tomatoes",
        "3/4 cup chopped Italian flat leaf parsley, divided",
        "2 teaspoons garlic powder, divided",
        "1 pound ground beef chuck",
        "1 cup bread crumbs",
        "1 egg",
        "3 tablespoons milk",
        "salt and pepper to taste",
        "1/2 pound hot Italian sausage",
        "1/2 pound mild Italian sausage",
        "1/2 pound pork neck bones",
        "1/4 cup red wine (optional)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Meat Sauce II",
    "url": "http://allrecipes.com/recipe/45710/italian-meat-sauce-ii/"
}
