{
    "directions": [
        "Line a 9-inch pie pan with the pastry and press the edges of the crust with a fork to seal it to the pie dish. Cover loosely with plastic wrap and refrigerate while you prepare the sauce.",
        "Heat a large skillet over medium-high heat and stir in the ground beef, turkey sausage, and 1 clove of minced garlic. Cook and stir until the meat is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Add the onion, red bell pepper, and mushrooms and cook, stirring frequently, until the onion is soft and translucent and the mushrooms have given off their liquid, about 5 minutes. Add the remaining garlic and cook for 30 seconds.",
        "Stir in the tomato paste, water, salt, basil, and oregano and bring the sauce to a boil. Reduce the heat to low, cover, and simmer for 10 minutes. Remove from heat and set aside.",
        "Preheat an oven to 450 degrees F (230 degrees C).",
        "Line the chilled pie crust with a double thickness of aluminum foil. Bake for 9 minutes. Remove the foil and continue baking until the bottom of the crust is set, about 7 more minutes (see Editor's Note for tips). Remove from the oven and set aside. Reduce the oven temperature to 350 degrees F (175 degrees C).",
        "Combine the spinach, ricotta, and 1/2 cup mozzarella cheese. Spoon the filling into the baked crust. Top with the meat mixture. Cover the edges of the pie crust with foil to prevent over-browning, place the pie on a baking sheet, and bake for 45 minutes.",
        "Remove the pie from the oven. Top the meat mixture with 1 cup of mozzarella cheese, chopped tomatoes, and sliced olives. Return it to the oven and bake until the cheese is melted, about 10 minutes. Let stand for 10 minutes before serving."
    ],
    "ingredients": [
        "1 recipe pastry for a 9-inch pie crust",
        "1/2 pound ground beef",
        "1/2 pound mild or hot turkey Italian sausage, casings removed",
        "1 clove garlic, minced",
        "1 onion, chopped",
        "3/4 cup chopped red bell pepper",
        "10 ounces sliced fresh mushrooms",
        "1 clove garlic, minced",
        "1 (6 ounce) can tomato paste",
        "1 1/4 cups water",
        "1/2 teaspoon salt",
        "1 teaspoon dried basil",
        "1/2 teaspoon dried oregano",
        "1 (10 ounce) package frozen chopped spinach, thawed and well drained",
        "1 cup part-skim ricotta cheese",
        "1 1/2 cups shredded mozzarella cheese, divided",
        "1 cup chopped, seeded plum tomatoes",
        "1 (6 ounce) can sliced black olives, drained"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Meat and Spinach Pie",
    "url": "http://allrecipes.com/recipe/216875/italian-meat-and-spinach-pie/"
}
