{
    "directions": [
        "Mix 1 cup of flour with sugar, salt, and yeast in a bowl, stir well. Place milk and anise extract into a small saucepan over low heat, and warm to about 110 degrees F (43 degrees C). Make a well in the center of the flour mixture with your hand, and pour in the milk mixture; swirl with your hand in a circular motion to combine the flour mixture with the milk mixture. Mix in butter and eggs, one at a time, then mix in remaining flour until dough begins to pull together.",
        "Turn the dough out onto a floured work surface, and knead until soft but elastic, about 8 minutes. Cover with a damp cloth, and let dough rest for 10 minutes; cut dough into halves.",
        "On floured work surface, roll each half into a ball, then shape the balls into 2 long pieces, about 1 1/2 inches thick and 18 to 20 inches long. Pinch the 2 top ends together, and loosely twist the pieces to form a twisted loaf; pinch the bottom ends together, and tuck the two ends underneath the loaf. (Alternately, form the twist into a ring, and pinch the ends together.)",
        "Grease a baking sheet, lay the loaf onto the prepared sheet, and cover with a damp towel; let rise until doubled, about 1 hour. Brush loaf with beaten egg, and sprinkle with colored decorating dragees.",
        "Preheat oven to 350 degrees F (175 degrees C). Bake the decorated loaf in the preheated oven until golden, 20 to 25 minutes. Watch closely towards the end of the baking time that the bread does not begin to burn. Transfer to wire rack immediately after baking to cool."
    ],
    "ingredients": [
        "3 cups all-purpose flour, divided",
        "1/4 cup white sugar",
        "1 teaspoon salt",
        "1 (.25 ounce) package rapid rise yeast",
        "2/3 cup milk",
        "1 teaspoon anise extract",
        "2 tablespoons butter at room temperature",
        "2 eggs",
        "1 egg, beaten",
        "1/2 tablespoon colored candy decorating dragees, or as desired"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Easter Bread (Anise Flavored)",
    "url": "http://allrecipes.com/recipe/217179/italian-easter-bread-anise-flavored/"
}
