{
    "directions": [
        "Heat oil in large nonstick skillet over medium-high heat. Add sausage and sauté until beginning to brown, about 3 minutes. Add all mushrooms, thyme, and oregano and sauté until mushrooms are tender, about 10 minutes. Add 1/2 cup Madeira; boil until almost absorbed, about 1 minute. Set aside.",
        "Bring stock to simmer in large saucepan; remove from heat and cover to keep hot. Melt butter in heavy large pot over medium-high heat. Add onion and garlic and sauté until onion is translucent, about 5 minutes. Add rice; stir 2 minutes. Add remaining 1 cup Madeira; simmer until absorbed, about 2 minutes. Add 1 cup hot stock; simmer until almost absorbed, stirring often, about 3 minutes. Continue to cook until rice is just tender and mixture is creamy, adding more stock by cupfuls, stirring often and allowing most stock to be absorbed before adding more, about 25 minutes. Stir in sausage mixture. Season to taste with salt and pepper. Transfer to serving bowl. Pass cheese separately."
    ],
    "ingredients": [
        "2 tablespoons olive oil",
        "1 pound Italian sweet sausage, casings removed, crumbled into 1/2-inch pieces",
        "8 ounces portobello mushrooms, stemmed, dark gills scraped out, caps diced",
        "10 ounces fresh shiitake mushrooms, stemmed, diced",
        "1 teaspoon chopped fresh thyme",
        "1 teaspoon chopped fresh oregano",
        "1 1/2 cups Madeira",
        "6 cups chicken stock or canned low-salt chicken broth",
        "1/2 cup (1 stick) butter",
        "1 large onion, chopped",
        "4 garlic cloves, minced",
        "2 cups arborio rice or other medium-grain rice (about 13 ounces)",
        "1 cup freshly grated Asiago cheese*"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Wine",
        "Garlic",
        "Mushroom",
        "Onion",
        "Rice",
        "Side",
        "Sauté",
        "Dinner",
        "Sausage",
        "Fall",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Italian Sausage and Wild Mushroom Risotto",
    "url": "http://www.epicurious.com/recipes/food/views/italian-sausage-and-wild-mushroom-risotto-105531"
}
