{
    "directions": [
        "In large pot heat 2 tablespoons olive oil over low heat.  Add chopped onion and two-thirds of sliced garlic.  Saute 5 minutes.  Add tomato sauce, diced tomatoes, water and tomato paste.  Simmer.",
        "Meanwhile, in large skillet, heat remaining 2 tablespoons of olive oil over medium heat.  Saute remaining garlic 1 to 2 minutes.  Add sausage and brown, about three minutes on each side.  After browning, cover and reduce heat.  Cook for 10 minutes, remove from heat, and cut sausages into halves.  Add to tomato mixture.",
        "Cook pork over medium heat in sausage skillet until brown.  Add to tomato mixture.   Add 3 tablespoons parsley, Romano, oregano, salt and pepper to tomato sauce.  Continue to simmer over low heat.",
        "Preheat oven to 375  degrees F (190 degrees C).  Cover a cookie sheet with aluminum foil.  In large bowl combine ground sirloin, bread crumbs, garlic powder, remaining parsley, parmesan and eggs.  Form 1 inch balls and place on cookie sheet.  Cook until golden brown, about 20 minutes.  Add meatballs to sauce.  Continue to cook sauce for 5 hours.  Serve over fusilli or ravioli."
    ],
    "ingredients": [
        "4 tablespoons olive oil",
        "1 onion, chopped",
        "6 cloves garlic, sliced",
        "3 (15 ounce) cans seasoned tomato sauce",
        "3 (14.5 ounce) cans diced tomatoes with juice",
        "6 cups water",
        "8 (6 ounce) cans tomato paste",
        "2 pounds sweet Italian sausage",
        "2 pounds ground sirloin",
        "4 tablespoons chopped fresh parsley, divided",
        "1 cup grated Romano cheese",
        "2 tablespoons dried oregano",
        "salt and pepper to taste",
        "1 pound pork meat, cubed",
        "1 cup dry bread crumbs",
        "3 tablespoons garlic powder",
        "1/3 cup grated Parmesan cheese",
        "2 eggs"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Meat Sauce I",
    "url": "http://allrecipes.com/recipe/19378/italian-meat-sauce-i/"
}
