{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Scoop out and discard zucchini seeds, leaving the hollowed-out shells. Sprinkle the garlic salt into the hollowed-out zucchini, and set aside. Heat olive oil in a skillet over medium heat, and cook the onion and garlic until the onion is translucent, about 5 minutes. Remove from heat and allow to cool.",
        "In a mixing bowl, mix the ground beef, eggs, bread crumbs, basil, carrot, and Parmesan cheese together with the onion mixture. Stuff the zucchini halves with the meat mixture, and place them into a baking dish. Spoon about half the spaghetti sauce over the zucchini, covering all the meat and allowing sauce to drip down the sides of the zucchini boats.",
        "Bake in the preheated oven until the meat is no longer pink in the center and the zucchini are tender, about 45 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Sprinkle the mozzarella cheese over the zucchini, and return to oven until the cheese melts, about 5 more minutes. Heat the remaining spaghetti sauce in a small saucepan over medium heat while the zucchini boats are cooking. Serve the zucchini boats with the additional sauce on the side."
    ],
    "ingredients": [
        "1 large zucchini, cut in half lengthwise",
        "1 teaspoon garlic salt",
        "1/4 cup olive oil",
        "1 onion, chopped",
        "1 teaspoon minced garlic",
        "1 1/2 pounds ground beef sirloin",
        "2 eggs",
        "1 1/2 cups Italian seasoned bread crumbs",
        "1 tablespoon dried basil",
        "1/4 cup grated carrot",
        "1/3 cup grated Parmesan cheese",
        "1 (26.5 ounce) can spaghetti sauce, divided",
        "1 cup shredded mozzarella cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Italian Meatloaf in Zucchini Boats",
    "url": "http://allrecipes.com/recipe/215414/italian-meatloaf-in-zucchini-boats/"
}
