{
    "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Pour the olive oil into a roasting pan. Place the turkey legs into the oil; turn the legs over several times to coat with oil. Sprinkle each leg with salt, black pepper, and thyme; pull the leaves from 3 sprigs of rosemary and sprinkle onto the turkey legs. Place the remaining 3 sprigs of rosemary around the legs in the oil. Place butter pieces on the legs; sprinkle each leg with garlic and scatter the onion in the pan.",
        "Roast the legs in the preheated oven until the turkey skin is browned and the juices run clear, 1 1/2 to 2 hours, basting every 20 minutes. Reduce heat to 300 degrees F (150 degrees C) and turn the legs over in the pan. Roast for 1 hour, basting every 20 minutes. Reduce oven heat to 200 degrees F (95 degrees C) and roast until the skin is golden brown, about 1 more hour. Remove the turkey legs to a serving platter.",
        "To make gravy, move the roasting pan with the oil and drippings to a burner set on medium heat; whisk in the cooking wine and brown sugar, stirring until the sugar has dissolved. Use the whisk to scrape up and dissolve any brown flavor bits left in the bottom of the pan. Whisk in the flour, a little at a time, and stir until the flour is smoothly incorporated into the mixture; pour in the chicken stock and whisk constantly until the gravy comes to a simmer and thickens, about 5 minutes. Stir in the gravy browning sauce; allow the gravy to simmer for 3 to 5 minutes and serve with the roasted turkey legs."
    ],
    "ingredients": [
        "1/2 cup extra-virgin olive oil",
        "3 turkey legs, rinsed and patted dry",
        "salt and ground black pepper to taste",
        "2 teaspoons dried thyme",
        "6 sprigs fresh rosemary",
        "3 tablespoons butter, cut into small chunks",
        "1 1/2 tablespoons minced garlic",
        "1/2 cup diced onion",
        "1/2 tablespoon red cooking wine, or to taste",
        "1/2 tablespoon brown sugar",
        "2 tablespoons all-purpose flour",
        "1 1/2 cups chicken stock",
        "4 dashes browning sauce (such as Gravy Master®)"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "It's Way Better Than Thanksgiving Turkey Turkey",
    "url": "http://allrecipes.com/recipe/216099/its-way-better-than-thanksgiving-tur/"
}
