{
    "directions": [
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.",
        "Heat a large skillet covered with about 1/4-inch of olive oil over low heat. Add garlic, 1 teaspoon Italian seasoning, and anchovies; cook and stir until the anchovies melt into the oil, 7 to 10 minutes. Stir in the crushed tomatoes; increase the heat to medium, and bring to a simmer. Stir in the clams. Once they begin to open, arrange the shrimp in a single layer and allow to simmer. Flip the shrimp when they become pink on one side, about 2 minutes, then drop in the scallops and squid.  Continue cooking until the shrimp are bright pink on the outside and the meat is no longer transparent in the center, about 2 more minutes. Season with salt, pepper, and remaining 1 teaspoon Italian seasoning.",
        "Toss the cooked pasta into the sauce. Garnish with a lemon wedge, Manchego cheese, and basil before serving."
    ],
    "ingredients": [
        "1 1/2 (16 ounce) packages linguine pasta",
        "1 cup olive oil, or as needed",
        "1 teaspoon Italian seasoning",
        "1 clove garlic, minced, or more to taste",
        "1 (2 ounce) can anchovy fillets packed in olive oil, drained",
        "1 (14.5 ounce) can crushed tomatoes",
        "1 1/2 pounds clams in shell, scrubbed",
        "1/3 pound medium shrimp, peeled and deveined, tails left on",
        "1/3 pound bay scallops",
        "1/2 pound squid - tentacles and tubes, cleaned and cut into rings",
        "salt to taste",
        "ground black pepper",
        "1 teaspoon Italian seasoning",
        "1 lemon, cut into wedges",
        "1 tablespoon grated Manchego cheese",
        "1 tablespoon julienned fresh basil leaves"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Ivan's Mega Frutti Di Mare",
    "url": "http://allrecipes.com/recipe/216475/ivans-mega-frutti-di-mare/"
}
