{
    "directions": [
        "Position 1 rack in bottom third and 1 rack in top third of oven; preheat to 200°F. Line 2 large baking sheets with parchment paper. Using 3 1/4- to 3 1/2-inch-diameter cookie cutter as template, heavily trace 4 circles on each parchment sheet. Turn parchment over so that marked side faces down (circles will show through).",
        "Whisk sugar and cornstarch in medium bowl to blend. Using heavy-duty or handheld electric mixer on medium-high speed, beat whites in large bowl until foamy, about 1 minute. Add cream of tartar; beat until soft peaks form, about 1 minute. Add sugar mixture, 1 tablespoon at a time, beating until whites are very stiff and glossy, at least 4 minutes with heavy-duty mixer and 6 to 8 minutes with handheld. Scoop enough meringue into pastry bag fitted with medium star tip to fill 1/3 full. Pipe small dot of meringue under parchment in each corner of baking sheets. Press parchment onto dots.",
        "Starting in center of 1 marked circle, pipe meringue in continuous spiral to fill circle completely. Pipe 1 meringue circle atop edge of base circle, forming standing rim. Repeat, piping 2 more circles atop first, forming meringue cup. Pipe 3 more cups on sheet, filling bag with meringue as needed. Pipe 4 cups on second sheet.",
        "Bake meringues 3 hours without opening oven door (sides of meringues may settle slightly). Turn off oven; let meringues stand in closed oven over-night to dry completely. (Can be made 1 week ahead. Store airtight in single layer.)",
        "Whisk jam, sugar and 1/3 cup water in heavy medium saucepan over medium-high heat until sugar dissolves and jam melts. Boil until sauce thickens and is reduced to generous 3/4 cup, whisking often, about 7 minutes. Add berries and cardamom; stir gently. Remove from heat; let stand 1 hour to thaw fruit. Cover; chill at least 2 hours and up to 1 day.",
        "Scoop sorbet into vacherins. (Can be made 2 days ahead. Wrap tightly; freeze. If you freeze the vacherins, the meringues will be tender and chewy rather than crisp.) Spoon sauce over. Garnish with berries and mint. Serve with remaining sauce."
    ],
    "ingredients": [
        "1 1/2 cups sugar",
        "2 tablespoons cornstarch",
        "6 large egg whites, room temperature",
        "1/4 teaspoon cream of tartar",
        "3/4 cup seedless raspberry jam",
        "1/2 cup sugar",
        "1/3 cup water",
        "1 16-ounce package frozen unsweetened mixed berries (do not thaw)",
        "1 teaspoon ground cardamom",
        "3 pints raspberry sorbet",
        "Fresh raspberries",
        "Fresh mint sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Egg",
        "Dessert",
        "Bake",
        "Hanukkah",
        "Valentine's Day",
        "Frozen Dessert",
        "Raspberry",
        "Summer",
        "Fat Free",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vacherins with Raspberry Sorbet and Mixed Berry-Cardamom Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/vacherins-with-raspberry-sorbet-and-mixed-berry-cardamom-sauce-102908"
}
