{
    "directions": [
        "Preheat oven to 350 degrees F.",
        "Line cookie sheets with Reynolds(R) Parchment Paper; set aside. No need to add extra grease or spray your cookie sheets. Knead flour into sugar cookie dough until well blended. Roll out half of cookie dough at a time to 1/4-inch thickness between lightly floured sheets of Parchment Paper. Using Valentine cookie cutters, cut out cookies; place on parchment-lined cookie sheets.",
        "Bake 7 to 12 minutes, depending on the size of the cookies or until the edges begin to brown. Let stand one minute on cookie sheets. Slide Parchment Paper with cookies onto a wire racks to cool completely.",
        "Icing and Decorating: Beat powdered sugar, meringue powder, water and extract in a large bowl, with an electric mixer, on high speed until smooth and thick, about 1 minute.",
        "Divide icing into 3 small bowls. Leave one bowl of icing white. Stir food coloring in remaining 2 bowls to make pink and red icing of desired color. Cover icing tightly when not in use, icing dries quickly.",
        "Pipe outlines of cookies with contrasting colors of icing using a decorating bag with tip. Or, place icing in plastic zipper bags. Snip off one corner with scissors and use to pipe icing."
    ],
    "ingredients": [
        "Cookies:",
        "1 (16.5 ounce) package refrigerated sugar cookie dough",
        "2/3 cup all-purpose flour",
        "Sugar Cookie Icing:",
        "1 (16 ounce) box confectioners' sugar",
        "3 tablespoons meringue powder (powdered egg whites)",
        "6 tablespoons water",
        "1 teaspoon flavoring extract (optional)",
        "Food coloring",
        "Decorations:",
        "Red food coloring",
        "Red and pink sugar crystals",
        "White nonpareils"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Valentine's Day Cookies from Reynolds® Kitchens",
    "url": "http://allrecipes.com/recipe/240979/valentines-day-cookies-from-reynolds/"
}
