{
    "directions": [
        "Cream 1 cup butter or margarine and 3/4 cup white sugar together.  Blend in egg, 1 teaspoon vanilla extract, and grated lemon peel.  Sift together 2 1/2 cups all-purpose flour and baking powder.  Add to creamed mixture and blend well. Cover and refrigerate dough for approximately 2 hours.",
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Roll dough to 1/4 inch thickness on a lightly floured surface.  Use a floured heart shaped 1 to 2 inch cookie cutter and cut dough into heart shapes.  Place the cut-out hearts on greased cookie sheets.",
        "Using the drinking straw, make a hole at the top center of each heart before baking.  Bake for 5 to 7 minutes until very lightly browned.  Cool the cookies on a wire rack.",
        "To Make Butter Frosting:  Mix 3 cups confectioners' sugar and 1/3 cup butter together.  Stir in 1 1/2 teaspoons vanilla extract and 2 tablespoons  milk.  Beat until smooth making sure frosting is of spreading consistency.  Stir in food coloring to create a pink or red colored frosting, if desired.",
        "After cookies have cooled, frost and decorate them with nonpareils, sprinkles, dragees, or colored sugar.  Use a toothpick to dislodge the hole, if necessary.  Let the frosting dry.",
        "To make a necklace, tie the ends off of two pieces of red colored licorice with a knot.  Thread it through the hole at the top center of the cookie.  Tie the other ends off with another knot to create a \"chain.\"  Makes approximately 30 heart necklaces."
    ],
    "ingredients": [
        "1 cup butter, softened",
        "3/4 cup white sugar",
        "1 egg",
        "1 teaspoon vanilla extract",
        "1 tablespoon lemon zest",
        "2 1/2 cups sifted all-purpose flour",
        "1 teaspoon baking powder",
        "3 cups confectioners' sugar",
        "1/3 cup butter, softened",
        "1 1/2 teaspoons vanilla extract",
        "2 tablespoons milk",
        "3 drops red food coloring",
        "2 1/4 ounces colored candy sprinkles",
        "60 long red vine licorice"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Valentine Heart Necklaces",
    "url": "http://allrecipes.com/recipe/10470/valentine-heart-necklaces/"
}
