{
    "directions": [
        "In a bowl macerate cherries in brandy, stirring occasionally, 2 hours, or until brandy is almost absorbed.",
        "Preheat oven to 350°F.. Line bottom of a buttered 10-by-2 inch round cake pan with wax paper or parchment paper and butter paper.",
        "In a double boiler or in a metal bowl set over a saucepan of barely simmering water melt chocolate and butter, stirring occasionally. Remove top of double boiler or bowl from heat and cool mixture.",
        "In a bowl with an electric mixer beat yolks and 1/2 cup sugar until light and fluffy. Add chocolate mixture and stir until combined. Fold in cocoa powder until combined well (be careful not to overmix).",
        "In another bowl with cleaned beaters beat whites until they hold soft peaks and beat in remaining sugar in a slow stream, beating until meringue just holds stiff peaks. Stir about one fourth meringue into chocolate mixture to lighten and fold in remaining meringue gently but thoroughly. Fold in cherries.",
        "Transfer batter to pan, smoothing top, and bake cake in middle of over 40 minutes, or until center is just set. Cool cake in pan on a rack 15 minutes. Run a thin knife around edge of pan an invert cake onto rack to cool completely."
    ],
    "ingredients": [
        "1 cup dried sour cherries (about 5 ounces)",
        "1/4 cup brandy",
        "12 ounces fine-quality semisweet chocolate (preferable Valrhona), chopped",
        "1 stick (1/2 cup) unsalted butter",
        "6 large eggs, separated",
        "3/4 cup plus 2 tablespoons sugar",
        "1/4 cup plus 2 tablespoons fine-quality unsweetened cocoa powder, sifted"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Chocolate",
        "Egg",
        "Dessert",
        "Kid-Friendly",
        "Cherry",
        "Brandy",
        "Double Boiler",
        "Gourmet"
    ],
    "title": "Valrhona Chocolate Cherry Cake",
    "url": "http://www.epicurious.com/recipes/food/views/valrhona-chocolate-cherry-cake-14304"
}
