{
    "directions": [
        "Fill a very large pot with water.  Place stainless steel stock pot, cheesecloth, a large stainless steel spoon, strainer, and tongs in the water. Bring water to a boil. Boil utensils for 10 minutes to sterilize. Transfer sterilized items to a clean surface, drain water.",
        "Pour 2% milk and buttermilk into the sterilized stock pot, and place over medium-low heat. Slowly heat the milk to 180 to 185 degrees F (80 to 85 degrees C), stirring constantly. Scrape bottom of pot as the milk heats to prevent scorching. When the milk has reached the correct temperature, remove from heat. Very gently stir in the lemon juice, and let the milk cool to 100 degrees F (38 degrees C). Whitish curds will separate from the greenish-yellow whey. Do not over mix or agitate to preserve the curds.",
        "With slotted spoon, gently transfer the curds to the cheesecloth-lined colander. Gather up 4 corners of the cheesecloth, and tie into a bundle. Hang the bundle up over the sink from the faucet or a kitchen cabinet handle; allow to drip several hours until cheese curds are cool and moist but not sopping wet.",
        "Place the curds into a mixing bowl, and mix with kosher salt, garlic powder, and cayenne pepper until thoroughly combined. Place a piece of plastic wrap about 12 by 18 inches onto a work surface. Spoon the cheese along a shorter side of the plastic, and pick up the edge of the wrap to roll the cheese into a tight cylinder. Twist the ends closed to enclose the cheese in the plastic; refrigerate until thoroughly chilled."
    ],
    "ingredients": [
        "7 cups 2% milk",
        "1 cup buttermilk",
        "1/2 cup freshly squeezed lemon juice",
        "kosher salt to taste",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon ground cayenne pepper"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Val's Home Made Cheese With Garlic and Cayenne",
    "url": "http://allrecipes.com/recipe/217120/vals-home-made-cheese-with-garlic-an/"
}
