{
    "directions": [
        "Place a rack in middle of oven; preheat to 350°F. Flour a 13x9\" pan, tapping out excess. Whisk baking powder, baking soda, salt, and remaining 2 cups flour in a medium bowl; set aside.",
        "Using an electric mixer on medium-high speed, beat butter and 1 1/2 cups granulated sugar in a large bowl, scraping down sides of bowl as needed, until light and creamy, about 5 minutes. Add egg yolks in 2 additions, scraping down bowl after each. Beat in vanilla.",
        "Reduce mixer speed to low, then add dry ingredients in 2 additions alternately with buttermilk in 2 additions, scraping down sides of bowl as needed.",
        "Using electric mixer on medium speed, beat egg whites in another large bowl until soft peaks form, 2–3 minutes. Slowly add remaining 1/4 cup granulated sugar and continue to beat until stiff, glossy peaks form, about 3 minutes more. Fold half of the egg whites into flour mixture, then gently fold in remaining egg whites.",
        "Scrape batter into prepared pan; smooth surface. Bake, rotating pan halfway through and covering with foil during the last 15 minutes of baking, until golden brown, firm to the touch, and a tester inserted into the center comes out clean, 35–40 minutes. Transfer pan to a wire rack and let cake cool.",
        "Combine granulated sugar and 1/4 cup water in a medium saucepan. Scrape in vanilla seeds, add pod, and stir to combine. Bring to a boil, cover, and steep at least 15 minutes. Set aside to cool. Discard pod before using.",
        "Using electric mixer on medium-high speed, beat cream cheese and butter in a large bowl until smooth, about 1 minute. Beat in orange zest, orange juice, and vanilla. Reduce mixer speed to low and beat in powdered sugar, scraping down bowl as needed, until light and fluffy, 2–3 minutes.",
        "Using a pastry brush, brush top of cooled cake with 2 Tbsp. vanilla syrup; reserve remaining syrup for another use. Spread frosting over top of cake, swirling decoratively. Top with raspberries and edible flowers, if using.",
        "Cake can be made 3 days ahead; wrap tightly in plastic and chill, or freeze up to 2 weeks. Syrup can be made 5 days ahead; store in an airtight container and chill. Frosting can be made 3 days ahead; cover with plastic wrap, pressing directly on surface, and chill. Bring to room temperature before using."
    ],
    "ingredients": [
        "2 cups cake flour, plus more for pan",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon kosher salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 3/4 cups granulated sugar, divided",
        "4 large eggs, separated",
        "1 teaspoon vanilla extract",
        "1 cup buttermilk",
        "1/4 cup granulated sugar",
        "1 vanilla bean, split lengthwise",
        "1 (8-ounce) package cream cheese, chilled",
        "5 tablespoons unsalted butter, room temperature",
        "1/2 teaspoon finely grated orange zest",
        "1 1/2 teaspoons fresh orange juice",
        "1/2 teaspoon vanilla extract",
        "6 Tbsp. powdered sugar, sifted",
        "4 ounces raspberries",
        "Edible flowers (for garnish; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Birthday",
        "Raspberry",
        "Orange",
        "Cream Cheese",
        "Vanilla",
        "Dessert",
        "Summer",
        "Potluck",
        "Buttermilk",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vanilla-Buttermilk Sheet Cake With Raspberries and Orange Cream-Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/vanilla-buttermilk-sheet-cake-with-raspberries-and-orange-cream-cheese-frosting"
}
