{
    "directions": [
        "Preheat the oven to 350 degrees F. Line a 12-cup muffin pan with paper liners. Whisk the flour, baking powder and salt in a bowl. Beat the butter and sugar in a stand mixer fitted with the paddle attachment on medium-high speed until fluffy, about 4 minutes. Beat in the eggs, one at a time, scraping down the bowl as needed. Beat in the vanilla. Reduce the mixer speed to medium low; beat in half of the flour mixture, then all of the milk, then the remaining flour mixture until just combined.",
        "Divide the batter among the muffin cups, filling each three-quarters full. Bake until a toothpick inserted into the center of a cupcake comes out clean, 18 to 20 minutes, rotating the pan halfway through. Transfer the pan to a rack and let cool 5 minutes, then remove the cupcakes to the rack to cool completely. Top with Frosting.",
        "Photograph by Levi Brown",
        "Whisk the egg whites, sugar and salt in a heatproof bowl set over a saucepan of simmering water (do not let the bowl touch the water) until the mixture is warm and the sugar dissolves. Remove the bowl from the pan; let cool slightly.",
        "Beat the egg white mixture in a stand mixer fitted with the whisk attachment (or with a hand mixer) on medium-high speed until stiff peaks form, 12 to 15 minutes. Beat in the butter a few pieces at a time, then continue beating until smooth. (Don't worry if the mixture looks separated at first-it will come together as you keep beating.)"
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour",
        "1 1/4 teaspoons baking powder",
        "1/4 teaspoon salt",
        "1 stick unsalted butter, softened",
        "1 cup sugar",
        "2 large eggs, at room temperature",
        "2 teaspoons vanilla extract",
        "2/3 cup whole milk, at room temperature",
        "Frosting, recipe follows, for topping",
        "4 large egg whites",
        "3/4 cup sugar",
        "Pinch of salt",
        "2 sticks unsalted butter, cut into pieces, softened (see Cook's Note)"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Baking",
        "Easy Recipes",
        "Cupcake"
    ],
    "title": "Vanilla Cupcakes",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/vanilla-cupcakes-recipe2"
}
