{
    "directions": [
        "Bring coconut milk to boil in large deep saucepan over medium-high heat (coconut milk will boil up high in pan). Reduce heat to mediumlow; boil until reduced to 1 1/2 cups, stirring occasionally, 25 to 30 minutes. Remove from heat; cool completely. Transfer to small bowl. Cover; chill (coconut milk will settle slightly as it cools). DO AHEAD: Can be made 2 days ahead. Keep chilled.",
        "Position rack in center of oven; preheat to 350°F. Line eighteen 1/3-cup muffin cups with paper liners. Whisk flour, baking powder, and salt in medium bowl. Using electric mixer, beat butter in large bowl until smooth. Add sugar; beat on medium-high speed until well blended, about 2 minutes. Add 2 eggs, 1 at a time, beating well after each addition and occasionally scraping down sides of bowl. Beat in seeds from vanilla bean and remaining egg. Add half of flour mixture; mix on low speed just until blended. Add 1 cup reduced coconut milk; mix just until blended. Add remaining flour mixture; mix on low speed just until blended. Divide batter among muffin cups. Bake cupcakes until tops spring back when gently touched and tester inserted into center comes out clean, about 20 minutes. Transfer cupcakes in pans to rack; cool 10 minutes. Carefully remove cupcakes from pans and cool completely on rack.",
        "Using electric mixer, beat butter in large bowl until smooth. Add sugar, 1/3 cup reduced coconut milk, seeds from vanilla bean, and salt. Beat on medium-low speed until blended, scraping down sides of bowl. Increase to mediumhigh and beat until light and fluffy.",
        "Using pastry bag fitted with large star tip, pipe frosting onto cooled cupcakes. (Alternatively, top each cupcake with 2 tablespoons frosting. Using small offset spatula, swirl frosting over top of cupcakes, leaving 1/2-inch plain border.) Sprinkle with coconut. DO AHEAD: Can be made 1 day ahead. Store in airtight containers; chill. Bring to room temperature before serving.",
        "Available at many supermarkets and at Indian, Southeast Asian, and Latin markets."
    ],
    "ingredients": [
        "2 13-to 14-ounce cans unsweetened coconut milk* (preferably organic)",
        "2 cups all purpose flour",
        "2 1/4 teaspoons baking powder",
        "1/2 teaspoon salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 1/3 cups sugar",
        "3 large eggs",
        "Seeds scraped from 1 split vanilla bean or 1 1/2 teaspoons vanilla extract",
        "1 cup reduced coconut milk (see above), room temperature",
        "1 cup (2 sticks) unsalted butter, room temperature",
        "2 1/2 cups powdered sugar",
        "1/3 cup reduced coconut milk (see above), room temperature",
        "Seeds scraped from 1 split vanilla bean or 1 1/2 teaspoons vanilla extract",
        "1/8 teaspoon salt",
        "1 1/2 cups sweetened flaked coconut, lightly toasted (for garnish)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Mixer",
        "Egg",
        "Dessert",
        "Bake",
        "Kid-Friendly",
        "Coconut",
        "Vanilla",
        "Birthday",
        "Party",
        "Butter",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vanilla Bean-Coconut Cupcakes with Coconut Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/vanilla-bean-coconut-cupcakes-with-coconut-frosting-352095"
}
