{
    "directions": [
        "Stir all-purpose flour, almond flour, and 1/2 cup plus 2 tablespoons white sugar together in a bowl. Add 1 cup plus 2 tablespoons butter and egg yolks; knead in bowl with your hands until a smooth dough forms.",
        "Divide dough into quarters and form each piece into a rectangle. Wrap each rectangle in plastic wrap. Chill dough in the refrigerator until firm, at least 1 hour or overnight.",
        "Place 1/2 cup plus 1 tablespoon white sugar in a food processor. Cut each vanilla bean in half lengthwise and scrape seeds from each half with the back of the knife; add to sugar. Pulse until seeds are evenly dispersed. Pour vanilla sugar into a shallow bowl.",
        "Preheat oven to 350 degrees F (175 degrees C). Line a large baking sheet with parchment paper.",
        "Cut 1 dough rectangle into 6 equal pieces, keeping remaining dough chilled. Roll each piece evenly into a 1/2-inch-thick log on a lightly floured surface. Cut each log crosswise into 2-inch pieces and gently roll or pinch ends of each piece into points. Curve each piece into a crescent and transfer to prepared baking sheet, arranging about 1-inch apart.",
        "Bake in the preheated oven until bottoms are lightly golden but tops are still pale, 10 to 12 minutes. Remove from oven and let stand 2 minutes.",
        "Roll warm cookies in the vanilla sugar, brushing off excess sugar. Transfer cookies to a wire rack to cool completely. Repeat with remaining dough, baking in batches."
    ],
    "ingredients": [
        "Cookies:",
        "2 1/3 cups all-purpose flour",
        "1 1/4 cups almond flour",
        "1/2 cup white sugar",
        "2 tablespoons white sugar",
        "1 cup butter, softened",
        "2 tablespoons butter, softened",
        "3 egg yolks",
        "Vanilla Sugar:",
        "1/2 cup white sugar",
        "1 tablespoon white sugar",
        "3 whole vanilla beans"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vanillekipferl",
    "url": "http://allrecipes.com/recipe/245402/vanillekipferl/"
}
