{
    "directions": [
        "Combine rhubarb, strawberries, bourbon, and sugar in a medium bowl. Scrape in seeds from vanilla bean. Cut bean into 4 pieces and add to bowl; stir mixture until sugar begins to dissolve.",
        "Place four 16x12\" sheets of parchment paper, or heavy-duty foil if grilling, on a work surface. Divide mixture evenly among sheets, arranging on one side of each sheet. Fold parchment over mixture and crimp edges tightly to form a sealed packet. DO AHEAD: Foil packets can be made 4 hours ahead; parchment packets should not be made ahead. Chill. Let stand at room temperature for 15 minutes before continuing.",
        "Preheat oven to 425°F. Place packets on a small rimmed baking sheet. Alternatively, build a medium fire in a charcoal grill, or heat a gas grill to medium-high. Bake or grill packets until rhubarb is tender but not mushy (carefully open 1 packet to check; steam will escape), 10-12 minutes for thinner rhubarb, 14-16 minutes for thicker. Carefully cut open packets. Transfer mixture to bowls. Top with yogurt, honey, and pistachios."
    ],
    "ingredients": [
        "4 rhubarb stalks (about 1 pound), trimmed, cut on a sharp diagonal into 2-inch pieces",
        "12 large strawberries (about 1/2 pound), hulled and halved",
        "1/4 cup bourbon or water",
        "1/4 cup sugar",
        "1 4-inch piece of vanilla bean, split lengthwise",
        "Greek yogurt, honey, chopped pistachios"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bourbon",
        "Fruit",
        "Dessert",
        "Roast",
        "Fourth of July",
        "Vegetarian",
        "Quick & Easy",
        "Low Cal",
        "High Fiber",
        "Low Sodium",
        "Backyard BBQ",
        "Strawberry",
        "Vanilla",
        "Summer",
        "Low Cholesterol",
        "Rhubarb",
        "Fat Free",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vanilla-Roasted Rhubarb and Strawberries",
    "url": "http://www.epicurious.com/recipes/food/views/vanilla-roasted-rhubarb-and-strawberries-395949"
}
