{
    "directions": [
        "In a saucepan, combine the milk, cream, and 2 tablespoons of the sugar and bring to a simmer.",
        "Meanwhile, in a mixer or other metal bowl, whisk the egg yolks and the remaining 2 tablespoons sugar until thickened and lightened in color. Gradually whisk in one third of the warm milk mixture to temper the egg yolks. Return the mixture to the saucepan and stir over medium heat until the custard has thickened and coats the back of a wooden spoon. Pour the custard into a bowl set in an ice-water bath and stir in the honey to combine. Let the mixture cool to room temperature, then strain it into a container and refrigerate at least 5 hours, or overnight (for the creamiest texture).",
        "Freeze the cold custard in an ice-cream machine. Remove to a covered container and freeze for several hours, or until hardened.",
        "Preheat the oven to 400º F.",
        "Wash and dry the figs. Slice off and discard the tops. Make a small slit in the center of the top of each fig and insert a section of vanilla bean.",
        "Melt the butter over medium heat in an ovenproof skillet large enough for all the figs to stand in one layer. Stir in the sugar to dissolve. Stand the figs in the butter and add any remaining vanilla beans to the pan. Place the pan in the oven for 10 minutes to heat the figs. The figs can be served warm or at room temperature.",
        "Place a scoop or quenelle of ice cream into each of six bowls. Arrange 3 of the figs (still with the vanilla beans) around each scoop. Drizzle the syrup remaining in the pan around the plates. Serve immediately."
    ],
    "ingredients": [
        "2 cups milk",
        "2 cups cream",
        "1/4 cup sugar",
        "10 large egg yolks",
        "1/2 cup wildflower honey",
        "18 ripe figs (Black Mission, Brown Turkey, Adriatic green, or a combination)",
        "4 vanilla beans, split and cut into 2-inch pieces",
        "3 tablespoons (1 1/2 ounces) unsalted butter",
        "1 1/2 teaspoons sugar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Ice Cream Machine",
        "Dairy",
        "Fruit",
        "Dessert",
        "Freeze/Chill",
        "Roast",
        "Frozen Dessert",
        "Fig",
        "Vanilla",
        "Summer",
        "Honey",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vanilla Bean-Roasted Figs with Wildflower Honey-Vanilla Ice Cream",
    "url": "http://www.epicurious.com/recipes/food/views/vanilla-bean-roasted-figs-with-wildflower-honey-vanilla-ice-cream-105862"
}
