{
    "directions": [
        "Preheat oven to 350°F. Spray 8-inch-diameter springform pan with nonstick spray. Mix graham cracker crumbs and sugar in processor. Add melted butter; process until crumbs are evenly moistened. Press crumb mixture onto bottom (not sides) of prepared pan. Bake until crust is set and deep golden, about 12 minutes. Cool crust while making filling. Maintain oven temperature.",
        "Using electric mixer, beat cream cheese in large bowl until smooth. Add sugar, then scrape in seeds from vanilla bean; beat until smooth. Add eggs 1 at a time, blending well after each addition. Beat in sour cream.",
        "Pour filling over crust. Bake cake until puffed, golden on top, and set around edges, and center moves slightly when pan is gently shaken, about 1 hour (top may crack). Cool 30 minutes. Refrigerate uncovered overnight. Using back of spoon, smooth any cracks on top of cake.",
        "Pour 2 tablespoons water into small bowl. Sprinkle gelatin over; let stand until gelatin softens, about 10 minutes. Bring sugar and remaining 1/2 cup water to boil in medium saucepan, stirring until sugar dissolves. Boil until reduced to 1/2 cup, about 3 minutes. Add guava nectar to sugar syrup; stir over medium-low heat just until mixture is hot. Add gelatin mixture and stir just until gelatin dissolves. Place in freezer until gelatin begins to thicken slightly but is still pourable, stirring occasionally, about 20 minutes. Spoon guava topping over cheesecake, spreading to edges of cake. Chill until topping sets, at least 8 hours or overnight.",
        "Using small sharp knife, cut around sides of cake to loosen. Remove pan sides. Cut cake into wedges and transfer to plates. Spoon Mango-Lime Salad alongside. Sprinkle with toasted coconut."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "1 1/4 cups graham cracker crumbs",
        "2 tablespoons sugar",
        "1/4 cup (1/2 stick) unsalted butter, melted",
        "3 8-ounce packages cream cheese, room temperature",
        "1 cup sugar",
        "2 vanilla beans, split lengthwise",
        "4 large eggs",
        "3/4 cup sour cream",
        "2 tablespoons plus 1/2 cup water",
        "1 envelope unflavored gelatin",
        "1/2 cup sugar",
        "2 cups guava nectar or guava juice",
        "Mango-Lime Salad",
        "Toasted sweetened flaked coconut"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cake",
        "Fruit Juice",
        "Egg",
        "Dessert",
        "Bake",
        "Cream Cheese",
        "Lime",
        "Mango",
        "Vanilla",
        "Guava",
        "Sour Cream",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Vanilla-Bean Cheesecake with Guava Topping and Mango-Lime Salad",
    "url": "http://www.epicurious.com/recipes/food/views/vanilla-bean-cheesecake-with-guava-topping-and-mango-lime-salad-108538"
}
