{
    "directions": [
        "Place a rack in middle of oven; preheat to 350°F. Lightly coat cake pan with nonstick spray and line bottom with parchment paper. Whisk flour, baking powder, baking soda, and salt in a medium bowl; set aside.",
        "Using an electric mixer on medium-high speed, beat butter and 1 1/2 cups granulated sugar in a large bowl, scraping down sides of bowl as needed, until light and creamy, about 5 minutes. Add egg yolks in 2 additions, scraping down bowl after each. Beat in vanilla.",
        "Reduce mixer speed to low, then add dry ingredients in 2 additions alternately with buttermilk in 2 additions, scraping down sides of bowl as needed.",
        "Using electric mixer on medium speed, beat egg whites in another large bowl until soft peaks form, 2–3 minutes. Slowly add remaining 1/4 cup granulated sugar and continue to beat until stiff, glossy peaks form, about 3 minutes more. Fold half of the egg whites into flour mixture, then gently fold in remaining egg whites.",
        "Scrape batter into prepared pan; smooth surface. Bake, rotating pan halfway through and covering with foil during the last 15 minutes of baking, until golden brown, firm to the touch, and a tester inserted into the center comes out clean, 45–50 minutes. Transfer pan to a wire rack and let cake cool.",
        "Combine granulated sugar and 1/4 cup water in a medium saucepan. Scrape in vanilla seeds, add pod, and stir to combine. Bring to a boil, cover, and steep at least 15 minutes. Set aside to cool. Discard pod before using.",
        "Using electric mixer on medium-high speed, beat cream cheese and butter in a large bowl until smooth, about 1 minute. Beat in orange zest, orange juice, and vanilla. Reduce mixer speed to medium and beat in powdered sugar, scraping down bowl as needed, until light and fluffy, 2–3 minutes.",
        "Run a knife around sides of cooled cake and invert onto a wire rack; remove parchment.",
        "Spread 1 Tbsp. frosting in the center of a platter. Place cake, top side down, in the center. Using a pastry brush, brush 3 Tbsp. vanilla syrup over top of cake; reserve remaining syrup for another use. Spread 1 cup frosting evenly over top and sides to create a crumb coat. Chill 30 minutes to let frosting set. Frost top and sides, swirling decoratively; reserve remaining frosting for another use.",
        "Chill at least 30 minutes or up to overnight to let frosting set. Before serving, top cake with 3 oz. raspberries and edible flowers, if using. Serve remaining 3 oz. raspberries alongside.",
        "Cake can be made 3 days ahead; wrap tightly in plastic and chill, or freeze up to 2 weeks. Syrup can be made 5 days ahead; store in an airtight container and chill. Frosting can be made 3 days ahead; cover with plastic wrap, pressing directly on surface, and chill. Bring to room temperature before using."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "2 cups cake flour",
        "1 teaspoon baking powder",
        "1/2 teaspoon baking soda",
        "1/4 teaspoon kosher salt",
        "3/4 cup (1 1/2 sticks) unsalted butter, room temperature",
        "1 3/4 cups granulated sugar, divided",
        "4 large eggs, separated",
        "1 teaspoon vanilla extract",
        "1 cup buttermilk",
        "1/4 cup granulated sugar",
        "1 vanilla bean, split lengthwise",
        "2 (8-ounce) packages cream cheese, chilled",
        "10 tablespoons unsalted butter, room temperature",
        "1 teaspoon finely grated orange zest",
        "1 tablespoon fresh orange juice",
        "1 teaspoon vanilla extract",
        "3/4 cup powdered sugar, sifted",
        "6 ounces raspberries, divided",
        "Edible flowers (for garnish; optional)",
        "A 10-inch round cake pan"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "#CAKEWEEK",
        "Cake",
        "Buttermilk",
        "Bake",
        "Wedding",
        "Raspberry",
        "Orange",
        "Cream Cheese",
        "Dessert",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vanilla-Buttermilk Cake With Raspberries and Orange Cream-Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/vanilla-buttermilk-cake-with-raspberries-and-orangecream-cheese-frosting"
}
