{
    "directions": [
        "Place a rack in middle of oven; preheat to 350°F. Lightly coat 10\" cake pans with nonstick spray and line bottoms with parchment paper. Whisk 2 cups flour, 1 tsp. baking powder, 1/2 tsp. baking soda, and 1/4 tsp. salt in a medium bowl; set aside.",
        "Using an electric mixer on medium-high speed, beat 3/4 cup (1 1/2 sticks) butter and 1 1/2 cups granulated sugar in a large bowl, scraping down sides of bowl as needed, until light and creamy, about 5 minutes. Add 4 egg yolks in 2 additions, scraping down bowl after each. Beat in 1 tsp. vanilla.",
        "Reduce mixer speed to low, then add dry ingredients in 2 additions alternately with 1 cup buttermilk in 2 additions, scraping down sides of bowl as needed.",
        "Using electric mixer on medium speed, beat 4 egg whites in another large bowl until soft peaks form, 2–3 minutes. Slowly add 1/4 cup granulated sugar and continue to beat until stiff, glossy peaks form, about 3 minutes more. Fold half of the egg whites into flour mixture, then gently fold in remaining egg whites.",
        "Scrape batter into prepared pan; smooth top. Bake cake, rotating pan halfway through and covering with foil during the last 15 minutes of baking, until golden brown, firm to the touch, and a tester inserted into the center comes out clean, 45–50 minutes. Transfer pan to a wire rack and let cake cool.",
        "Meanwhile, repeat steps to make a second 10\" cake.",
        "Lightly coat 6\" cake pans with nonstick spray and line bottoms with parchment paper. Repeat steps using remaining 2 cups flour, 1 tsp. baking powder, 1/2 tsp. baking soda, 1/4 tsp. salt, 3/4 cup butter, 1 3/4 cups granulated sugar, 4 eggs, 1 tsp. vanilla, and 1 cup buttermilk. Pour 1 1/2 cups batter into each pan; smooth tops. Discard remaining cake batter.",
        "Bake cakes, rotating pans halfway through and covering with foil during the last 15 minutes of baking, until golden brown, firm to the touch, and a tester inserted into the center comes out clean, 45–50 minutes. Transfer pans to a wire rack and let cakes cool.",
        "Combine granulated sugar and 1/2 cup water in a medium saucepan. Scrape in vanilla seeds, add pods, and stir to combine. Bring to a boil, cover, and steep at least 15 minutes. Set aside to cool. Discard pods before using.",
        "Using electric mixer on medium-high speed, beat 4 packages cream cheese and 1 1/4 cups (2 1/2 sticks) butter in a large bowl until smooth, about 1 minute. Beat in 2 tsp. orange zest, 2 Tbsp. orange juice, and 2 tsp. vanilla. Reduce mixer speed to medium and beat in 1 1/2 cups powdered sugar, scraping down sides of bowl as needed, until light and fluffy, 2–3 minutes. Transfer frosting to a large bowl.",
        "Repeat frosting steps with remaining 4 packages cream cheese, 1 1/4 cups (2 1/2 sticks) butter, 2 tsp. orange zest, 2 Tbsp. orange juice, and 2 tsp. vanilla. Transfer to bowl with frosting; cover with plastic wrap, pressing directly on surface, and chill until ready to use.",
        "Run a knife around edges of cooled cakes and invert onto wire racks; remove parchment.",
        "Spread 1 Tbsp. frosting in the center of a 10\" cake board or platter. Place 1 (10\") cake, top side down, in the center. Using a pastry brush, brush 3 Tbsp. vanilla syrup over top of cake. Using an offset spatula, spread 1 cup frosting evenly over top. Arrange 6 oz. raspberries in a ring around perimeter of cake, pressing to adhere. Fill interior of ring with 6 oz. raspberries. Spread 1 cup frosting over raspberries inside of ring; do not frost raspberries at the perimeter.",
        "Carefully place second 10\" cake, top side down, on frosted raspberries, gently pressing down to secure. Brush 3 Tbsp. syrup over top of cake with pastry brush. Spread 2 1/2 cups frosting evenly over top and sides, carefully covering raspberries. Chill at least 30 minutes to let frosting set.",
        "Meanwhile, spread 1 Tbsp. frosting in the center of a 6\" cake board or removable tart pan bottom. Place 1 (6\") cake, top side down, in the center. Brush 2 Tbsp. vanilla syrup over top of cake with pastry brush. Spread 3/4 cup frosting with offset spatula evenly over top. Arrange 3 oz. raspberries in a ring around perimeter of cake, pressing to adhere. Fill interior of ring with 3 oz. raspberries. Spread 3/4 cup frosting over all raspberries with offset spatula to cover.",
        "Carefully place second 6\" cake, top side down, on frosted raspberries, gently pressing down to secure. Brush 2 Tbsp. syrup over top of cake with pastry brush; reserve remaining syrup for another use. Spread 1 1/2 cups frosting evenly over top and sides of cakie, carefully covering raspberries. Chill at least 30 minutes to let frosting set.",
        "Cakes can now be transported for finishing. To assemble, carefully place 6\" layer cake (on the board) in the center of the 10\" cake. Spread 2 cups frosting over top and sides, swirling decoratively, making sure to cover seam between 10\" cake and bottom cake board; reserve remaining frosting for another use.",
        "Chill at least 30 minutes or up to overnight to let frosting set. Before serving, top cake with remaining 6 oz. raspberries and edible flowers, if using.",
        "Cake is easier to work with when chilled overnight. Cake can be made 3 days ahead; wrap tightly in plastic and chilled, or frozen up to 2 weeks. Syrup can be made 5 days ahead; store in an airtight container and chill. Frosting can be made 3 days ahead; cover with plastic wrap, pressing directly on surface, and chill. Bring to room temperature before using."
    ],
    "ingredients": [
        "Nonstick vegetable oil spray",
        "6 cups cake flour, divided",
        "1 tablespoon baking powder, divided",
        "1 1/2 teaspoons baking soda, divided",
        "3/4 teaspoon kosher salt, divided",
        "2 1/4 cups (4 1/2 sticks) unsalted butter, softened, divided",
        "5 1/4 cups granulated sugar, divided",
        "12 large eggs, separated",
        "1 tablespoon vanilla extract, divided",
        "3 cups buttermilk, divided",
        "1/2 cup granulated sugar",
        "2 vanilla beans, split lengthwise",
        "8 (8-ounce) packages cream cheese, chilled, divided",
        "2 1/2 cups (5 sticks) unsalted butter, room temperature, divided",
        "4 teaspoons finely grated orange zest, divided",
        "1/4 cup fresh orange juice, divided",
        "4 teaspoons vanilla extract, divided",
        "3 cups powdered sugar, sifted, divided",
        "4 (6-ounce) containers raspberries, divided",
        "Edible flowers (for garnish; optional)",
        "2 (10-inch) round cake pans; 2 (6-inch) round cake pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "#CAKEWEEK",
        "Wedding",
        "Cake",
        "Buttermilk",
        "Raspberry",
        "Orange",
        "Bake",
        "Dessert",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vanilla-Buttermilk Wedding Cake With Raspberries and Orange Cream-Cheese Frosting",
    "url": "http://www.epicurious.com/recipes/food/views/vanillabuttermilk-wedding-cake-with-raspberries-and-orangecream-cheese-frosting"
}
