{
    "directions": [
        "Preheat oven to 350°F. Butter pan and line bottom with parchment paper, leaving a 2-inch overhang on each end. Butter paper.",
        "Make brown butter: Line a fine-mesh strainer with cheesecloth. Melt 1/2 cup butter in a heavy-bottomed saucepan over medium-low heat. Watch carefully and do not stir. Eventually, bubbling noise will quiet and solids will drop to bottom of pan. When solids have turned dark brown, remove butter from heat and strain through cheesecloth into a medium bowl. Cool to lukewarm.",
        "In the metal bowl of standing mixer, whisk together eggs and sugar. Set bowl over a saucepan of simmering water and whisk constantly until sugar is dissolved and mixture is quite warm (about 3 minutes). Remove bowl from heat and lock back into mixer base. Using whisk attachment, beat at high speed until mixture has tripled in volume and cooled to room temperature, about 7 to 10 minutes.",
        "While eggs are being beaten, sift flour and salt into a medium bowl and set aside. Stir vanilla into brown butter and set aside.",
        "When eggs have tripled in volume, turn off mixer. Sift one third of flour mixture over eggs and fold in gently but thoroughly. Sift and fold in remaining flour mixture, half at a time.",
        "Stir 1 cup of batter into butter-vanilla mixture. Quickly fold butter mixture into remaining batter until just combined.",
        "Pour batter into prepared pan, spreading evenly with a rubber spatula. Bake in middle of oven until top is browned and cake shrinks away from sides of pan, about 15 to 20 minutes. Invert onto a rack, peel off parchment paper, and cool. Cake can be made and cooled 1 day ahead and kept, covered, at room temperature.",
        "In a small saucepan bring water and sugar to boil over moderately high heat, stirring occasionally until sugar is dissolved. Remove from heat and stir in cognac. Syrup may be made 1 week ahead and chilled, covered. Bring to room temperature before using.",
        "Stir jam in a small saucepan over moderately low heat until hot and thinned. Pass through a fine-mesh strainer to remove seeds.",
        "Using a long serrated knife, cut cake into quarters. Cut each quarter horizontally into 2 very thin layers, for a total of 8 layers. Place 1 layer cut-side up on work surface. Brush lightly with syrup.",
        "Spread with a thin layer of jam. Top with a second layer, cut-side down, and apply syrup and jam in same manner. Add 2 more layers, both cut-side down, in same manner. Repeat to create a separate stack of 4 layers.",
        "Knead marzipan (before unwrapping) for a few seconds to warm and soften. Unwrap, press into a disk, and dust with confectioner's sugar. Dust a board and rolling pin with confectioner's sugar. Roll out marzipan to an 8- by 20-inch rectangle and cut into 2 8- by 10-inch rectangles.",
        "Carefully lay 1 rectangle of marzipan over 1 cake stack, smoothing top. Use a paring knife to neatly trim edges of marzipan flush with edges of cake. If sides of cake are not even, trim them as well. Repeat with other marzipan rectangle and other cake stack. Chill cakes 1 hour.",
        "Using a long serrated knife warmed in hot water and dried, cut cakes into 1 1/2-inch squares. Use a gentle sawing motion to cut through marzipan layer, then press down to cut through cake. During cutting process, frequently wipe knife with a hot, damp cloth and dry thoroughly.",
        "Make simple syrup: In a small saucepan bring water and sugar to boil over moderately high heat, stirring occasionally until sugar is dissolved. Remove from heat and keep warm. Place fondant in a metal bowl and attach a candy thermometer to side of bowl. Set over a pan of barely simmering water and stir gently. Do not let fondant get over 105°F, or it will lose its shine. When fondant starts to warm, stir in simple syrup, 1 tablespoon at a time, until mixture is thin enough to pour easily. Turn off heat, but leave bowl over water.",
        "Place a petit four on a fork and hold above fondant. Use a large spoon to pour fondant over cake until completely covered. Scrape bottom of fork against rim of bowl to remove excess fondant, then use a second fork to gently slide petit four onto a wire rack.",
        "Repeat with remaining petits fours. (Stir bowl of fondant regularly to prevent a crust from forming. If fondant begins to thicken during dipping process, rewarm over pan of simmering water, taking care not to overheat.) Cool petits fours 20 minutes.",
        "While petits fours are drying, prepare royal icing according to package instructions. Transfer half of icing to a medium bowl. Add pink coloring, a very small amount at a time, and mix with a spoon until icing is evenly pink. Tint remaining icing pale green in same manner. Fit one pastry bag with #101 tip and fill with pink icing. Fit other bag with #1 tip and fill with green icing.",
        "When petits fours are dry, pipe a pink rosebud on each. To make first petal of rosebud: Position #101 tip with wide end touching surface of cake, thin end raised at a 45-degree angle and pointed slightly to the left (about 10 o'clock). Squeeze and pivot the tip (thin end should travel around thick end to about 2 o'clock) to form a fan. Continue squeezing as you raise tip slightly off surface of cake and move it toward you and to the left (ribbon of icing should fold over itself). Stop squeezing and pull away.",
        "To make second petal of rosebud, start with tip tucked to left of inside edge of first petal, wide end down. Squeeze as you lift tip and move it toward you and to the right (ribbon of icing will curve up and over first petal). When you've covered bottom of first petal, stop squeezing, touch surface of cake, and pull away. Pipe rosebuds on remaining petits fours in same manner.",
        "Add green sepals and calyx to each bud. To make sepals: Position #1 tip just below rosebud and pipe 3 short lines up onto bottom of bud (1 line in the middle and 1 on either side). Lines should start from same spot just below bud.",
        "To make calyx: Insert tip into point where sepals converge just below rosebud. Squeeze for a moment, letting icing build up, then pull away 1/8 inch and stop squeezing.",
        "Once assembled, petits fours can be kept, covered, at room temperature for 2 days. Keep dry — fondant will melt if exposed to moisture. Do not refrigerate.",
        "*Available at baking supply stores and from New York Cake, 800-942-2539."
    ],
    "ingredients": [
        "1/2 cup (1 stick) unsalted butter, plus more for buttering pan",
        "6 large eggs",
        "1 cup sugar",
        "1 cup cake flour",
        "3/4 teaspoon salt",
        "1 1/2 teaspoons high-quality pure vanilla extract (also called \"Madagascar bourbon vanilla\")",
        "1/4 cup water",
        "1/4 cup sugar",
        "1/4 cup cognac",
        "1 1/4 cups raspberry jam",
        "12 ounces marzipan",
        "Confectioner's sugar for rolling",
        "1/2 cup water",
        "1/2 cup sugar",
        "2 1/2 cups ready-to-use poured fondant (also called roll icing)*",
        "1 pound royal icing mix*",
        "Rose-pink and leaf-green gel food coloring*",
        "Special equipment: 12- by 18-inch sheet or jelly roll pan, 2 featherweight pastry bags with couplers*, #1 and #101 decorating tips*",
        "*Available at baking supply stores and from New York Cake, 800-942-2539."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Berry",
        "Egg",
        "Dessert",
        "Bake",
        "Vanilla",
        "Cognac/Armagnac",
        "Jam or Jelly",
        "Pastry",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vanilla Petits Fours with Raspberry Filling and Marzipan",
    "url": "http://www.epicurious.com/recipes/food/views/vanilla-petits-fours-with-raspberry-filling-and-marzipan-109603"
}
