{
    "directions": [
        "Sift first 6 ingredients into medium bowl. Combine butter, shortening and brown sugar in large bowl. Using electric mixer, beat butter mixture until fluffy. Add egg, molasses and peel; beat until blended. Add dry ingredients; mix just until incorporated. Cover; chill 1 hour.",
        "Preheat oven to 350°F. Butter 2 baking sheets. Place sugar in small bowl. Using wet hands, form dough into 12 equal pieces; shape pieces into balls. Roll in sugar to coat. Transfer to prepared sheets, spacing 2 1/2 inches apart. Bake until cookies are pale golden and cracked on top but still soft, about 15 minutes. Cool on sheets 1 minute. Transfer to racks; cool completely.",
        "Place ice cream in medium bowl. Stir in ginger. Freeze until almost firm, about 30 minutes.",
        "Place 6 cookies on work surface, flat side up. Top each with 1/3 cup ice cream. Spread to 1/4 inch from edge of cookies. Top each with second cookie. Press to adhere. Place in freezer. Freeze until firm, at least 2 hours. (Can be made 1 day ahead. Wrap tightly; keep frozen.)",
        "Arrange sandwiches on plates. Garnish with berries and serve."
    ],
    "ingredients": [
        "2 cups all purpose flour",
        "2 teaspoons baking soda",
        "2 1/2 teaspoons ground ginger",
        "1 teaspoon ground cinnamon",
        "1 teaspoon ground cloves",
        "1 teaspoon salt",
        "1/2 cup (1 stick) unsalted butter, room temperature",
        "1/4 cup vegetable shortening, room temperature",
        "1 cup (packed) dark brown sugar",
        "1 egg",
        "1/4 cup unsulfured (light) molasses",
        "1 tablespoon grated orange peel",
        "Sugar",
        "1 pint vanilla ice cream, softened slightly",
        "1/2 cup chopped drained stem ginger in syrup",
        "Fresh strawberries, hulled, sliced"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cookies",
        "Mixer",
        "Dairy",
        "Ginger",
        "Dessert",
        "Bake",
        "Freeze/Chill",
        "Frozen Dessert",
        "Vanilla",
        "Molasses",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vanilla Ice Cream and Ginger Molasses Cookie Sandwiches",
    "url": "http://www.epicurious.com/recipes/food/views/vanilla-ice-cream-and-ginger-molasses-cookie-sandwiches-1582"
}
