{
    "directions": [
        "Make the crust: Pulse the flour, granulated sugar and salt in a food processor to combine. Add about one-third of the butter and pulse until the mixture looks like cornmeal. Add the remaining butter and pulse until it is in pea-size pieces. Add the vanilla seeds, bourbon and 2 to 3 tablespoons ice water; pulse until the dough just comes together. Turn out onto a piece of plastic wrap; shape into a disk and wrap. Refrigerate until firm, at least 1 hour or overnight.",
        "Put a baking sheet on the middle oven rack and preheat to 425 degrees F for 30 minutes. Meanwhile, roll out the dough into a 12-inch round on a lightly floured surface. Ease into a 9-inch pie plate. Fold the overhanging dough under itself and crimp with your fingers or a fork. Refrigerate until firm, about 30 minutes.",
        "Meanwhile, make the filling: Combine the heavy cream, bourbon and cinnamon stick in a small saucepan over medium-low heat; bring to a simmer. Transfer the mixture to a large bowl and let cool slightly. Whisk in the pumpkin, eggs, granulated sugar, brown sugar and pumpkin pie spice. Set aside.",
        "Line the crust with foil, then fill with pie weights or dried beans. Transfer to the hot baking sheet in the oven and bake until lightly golden around the edge, about 15 minutes. Remove the foil and weights and continue baking until the crust is dry and golden all over, about 5 more minutes. Transfer to a rack and let cool completely; leave the baking sheet in the oven. Reduce the temperature to 375 degrees F.",
        "Discard the cinnamon stick from the filling; pour into the cooled crust and return the pie to the hot baking sheet. Bake until the crust is golden brown and the filling is set, 1 hour to 1 hour 10 minutes. (Tent the crust with foil if it browns too quickly.) Transfer to a rack and let cool completely.",
        "Photograph by Con Poulos"
    ],
    "ingredients": [
        "1 1/2 cups all-purpose flour, plus more for dusting",
        "3 tablespoons granulated sugar",
        "1/2 teaspoon salt",
        "10 tablespoons cold unsalted butter, cut into small pieces",
        "1 vanilla bean, split in half lengthwise, seeds scraped",
        "1 tablespoon cold bourbon",
        "1 1/2 cups heavy cream",
        "2 tablespoons bourbon",
        "1 cinnamon stick",
        "1 15-ounce can pure pumpkin puree",
        "3 large eggs",
        "1/2 cup granulated sugar",
        "1/2 cup packed light brown sugar",
        "1 1/2 teaspoons pumpkin pie spice"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pumpkin Pie",
        "Pie Recipes",
        "Pumpkin",
        "Vegetable",
        "Dessert"
    ],
    "title": "Vanilla-Bourbon Pumpkin Pie",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/vanilla-bourbon-pumpkin-pie"
}
