{
    "directions": [
        "Preheat oven to 300 degrees F (150 degrees C), and lightly butter a 10 inch springform pan.",
        "Place the sandwich cookies into a plastic bag, and crush with a rolling pin. Pour the crumbs into a bowl, and mix with the scraped seeds of 1 vanilla bean. Drizzle the crumbs with melted butter and stir to combine. Press the crumb mixture firmly into the bottom and up the sides of the springform pan, and set aside.",
        "Place the softened cream cheese and sugar into the work bowl of an electric mixer, and beat for about 3 minutes on Medium speed, until the mixture is smooth. Beat in the eggs one at a time, incorporating each egg before adding the next one. Add the scraped seeds of 2 vanilla beans, the vanilla extract, sour cream, and heavy cream, and beat on Medium-High speed for about 1 minute, until the mixture is blended and smooth.",
        "Pour the mixture into the cookie crumb crust, leaving about 2 inches of space from the top of the pan for the cake to expand as it bakes.",
        "Place a baking dish onto the bottom rack of the preheated oven, and fill it halfway with boiling water. Place the cheesecake onto the middle rack, above the pan of boiling water, and bake until a small knife inserted into the middle of the cheesecake comes out clean, about 1 hour and 20 minutes.",
        "Turn the oven off and let the cheesecake cool down inside the oven for 1 hour. Cover the cheesecake with plastic wrap, then aluminum foil, and refrigerate at least 4 hours or overnight before serving."
    ],
    "ingredients": [
        "1 (18 ounce) package vanilla sandwich cookies (such as Oreo Golden Original Sandwich Cookies®)",
        "1 vanilla bean, split lengthwise and seeds scraped",
        "1/4 cup butter, melted",
        "2 pounds cream cheese, softened",
        "1 1/2 cups white sugar",
        "5 eggs",
        "2 vanilla beans, split lengthwise and seeds scraped",
        "1 tablespoon pure vanilla extract",
        "3/4 cup sour cream",
        "1/2 cup heavy cream"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vanilla Bean Cheesecake",
    "url": "http://allrecipes.com/recipe/157201/vanilla-bean-cheesecake/"
}
