{
    "directions": [
        "Split vanilla bean lengthwise with the tip of a sharp knife. Holding the pod open, scrape seeds from each half using the flat side of your knife.",
        "Combine vanilla bean, scraped seeds, and olive oil in a small saucepan over very low heat. Warm the oil until fragrant, 2 to 5 minutes. Remove from heat and let cool, about 5 minutes. Strain into a small bowl and refrigerate, at least 1 day.",
        "Combine sugar, water, lemon juice, and lemon zest in a pot over medium-low heat; heat, stirring, until sugar is dissolved, about 5 minutes. Let granita mixture cool, about 10 minutes.",
        "Pour granita mixture into a freezer-safe baking dish and freeze until half-way frozen, 1 to 2 hours. Scrape thoroughly with a fork. Freeze, 8 hours to overnight, scraping granita again the following day.",
        "Place 6 large leaves of lettuce on 6 serving plates. Chop the remaining lettuce and divide among the lettuce leaves. Slice each strawberry and fan out on each plate.",
        "Season mahi mahi with salt and pepper and cook in a large nonstick pan over medium-high heat until opaque, 2 to 4 minutes per side. Divide mahi mahi among plates.",
        "Scrape out 1 tablespoon of granita, form into a ball, and place next to mahi mahi. Repeat for remaining plates. Drizzle vanilla-infused olive oil over each plate."
    ],
    "ingredients": [
        "1/3 vanilla bean",
        "1/4 cup extra-virgin olive oil",
        "2 cups white sugar",
        "1 cup water",
        "1 cup freshly squeezed lemon juice",
        "1 teaspoon lemon zest (optional)",
        "1 head butterhead lettuce",
        "6 large strawberries",
        "6 (3 ounce) fillets mahi mahi, patted dry",
        "salt and ground black pepper to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vanilla-Infused Olive Oil and Lemon Granita Salad",
    "url": "http://allrecipes.com/recipe/245561/vanilla-infused-olive-oil-and-lemon-g/"
}
