{
    "directions": [
        "Puree berries with their juices and preserves in processor until well blended. Press through sieve to remove seeds. Refrigerate sauce. (Can be prepared 4 days ahead. Cover and keep refrigerated.)",
        "Position 1 rack in bottom third and 1 rack in center of oven and preheat to 225°F. Using bottom of 2/3-cup soufflé dish (measuring about 3 1/2 inches in diameter with 1 3/4-inch-high sides) as template, trace 3 circles on each of 2 large sheets of parchment paper, spacing 5 to 6 inches apart. Place parchment, marked side down, on baking sheets (circles will show through).",
        "Turn 1 souffleé dish upside down on work surface. Center 1 foil square on dish; press foil to cover outside of dish completely. Cut overhang to 3/4-inch width so that foil resemble to hat with brim. Repeat with 5 more foil squares and sides, making 6 foil hats total.",
        "Whisk sugar and cornstarch in small bowl to blend. Using electric mixer, beat whites and cream of tartar in large bowl until soft peaks form. Gradually beat in sugar mixture. Beat until meringue is very thick and glossy, at least 5 minutes. Spoon meringue into pastry bag fitted with medium star tip (no.4). Pipe dot of meringue near corners of baking sheet; press corners of parchment to anchor.",
        "Staring in center of 1 marked circle on parchment, pipe meringue in concentric circles to fill marked circle completely. Repeat with remaining 5 marked circles, forming 6 meringue rounds total.",
        "Starting at base of foil hat, pipe meringue in columns up sides but not onto top of foil hat, each column touching the previous one so that sides are covered completely. Repeat with remaining meringue and foil hat. Slide spatula under each meringue cylinder with soufflé dish still inside; place on sheets between meringue rounds (there will be 3 meringue round and 3 meringue cylinders on each sheet).",
        "Bake meringues until firm and dry, about 2 hours. Turn off oven; let meringues stand in closed oven 1 hour. Transfer baking sheets to racks and cool meringues completely.",
        "Lift meringue rounds off parchment; place on work surface. Lift foil with meringue cylinders to detach foil. Place 1 cylinder over each meringue round, forming cup. Mix toffee bits and nuts in small bowl. Spoon 1/4 cup ice cream into each meringue cup. Sprinkle with 1 tablespoon nut mixture. Top with 1/4 cup ice cream and 1 tablespoon nut mixture. Wrap filled meringues in plastic and freeze until firm, at least 4 hours. (Can be made 2 days ahead.)",
        "Spoon sauce onto plates. Unwrap meringues; place on plates. Serve with berries."
    ],
    "ingredients": [
        "2 10-ounce packages frozen raspberries, in syrup, thawed",
        "3/4 cup seedless blackberry preserves",
        "6 10-inch squares of foil",
        "1 1/3 cups sugar",
        "2 tablespoons cornstarch",
        "1 cup egg whites (about 8 large)",
        "1/4 teaspoon cream of tartar",
        "6 tablespoons English toffee bits (such as Skor)",
        "6 tablespoons chopped toasted walnuts",
        "1 1/2 pints vanilla ice cream, slightly softened",
        "Fresh berries"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dairy",
        "Egg",
        "Fruit",
        "Dessert",
        "Bake",
        "Blackberry",
        "Raspberry",
        "Walnut",
        "Chill"
    ],
    "title": "Vanilla Praline Meringue Cups with Blackberry-Raspberry Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/vanilla-praline-meringue-cups-with-blackberry-raspberry-sauce-4583"
}
