{
    "directions": [
        "Combine sugar and vanilla in processor. Blend until beans are very finely chopped, about 1 minute. Sift vanilla sugar into bowl; discard contents of sieve. Transfer vanilla sugar into jar; cover. (Can be made 1 week ahead. Store at room temperature.)",
        "Combine cream, 1/4 cup water and 3 tablespoons vanilla sugar in medium saucepan. Stir over medium heat until sugar dissolves and mixture comes to a boil. Remove from heat. Add chocolate; whisk until smooth. Whisk in brandy. (Can be made 1 week ahead. Cover; chill. Rewarm before serving.)",
        "Mix 1/4 cup vanilla sugar and cornstarch in bowl. Melt butter in large nonstick skillet over medium heat. Add pears; sauté until tender and golden, about 20 minutes. Sprinkle cornstarch mixture over pears; stir to blend.",
        "Simmer until juices are very thick, stirring often, about 6 minutes (longer if pears are very juicy). Remove from heat. Mix in lemon juice. Cool.",
        "Finely grind nuts, cookies and 2 tablespoons vanilla sugar in processor. Transfer nut mixture to small bowl.",
        "Butter 1 baking sheet. Place kitchen towel on work surface. Place 1 phyllo sheet on towel (keep remaining phyllo sheets covered with plastic wrap and damp towel). Brush phyllo with butter. Top with second phyllo sheet; brush with butter.",
        "Sprinkle with 3 tablespoons nut mixture. Repeat layering with 6 more phyllo sheets, buttering and sprinkling each with 3 tablespoons nut mixture. Top with another phyllo sheet (for a total of 10 sheets); brush with butter.",
        "Starting 2 inches in from 1 long side and 2 1/2 inches in from 1 short side, spoon filling in 3-inch-wide by 12-inch-long log parallel to 1 long side.",
        "Fold short sides over filling; butter folded edges.",
        "Using towel as aid and starting at 1 long side, roll up strudel, enclosing filling.",
        "Using large spatula, transfer strudel to prepared baking sheet. Brush strudel all over with butter. (Can be made 4 hours ahead. Cover; chill.)",
        "Meanwhile, prepare triangles. Preheat oven to 375°F. Butter 1 baking sheet. Cut remaining 2 phyllo sheets in half crosswise, making 4 pieces, each about 12 by 8 inches. Place 1 phyllo piece on work surface. Brush phyllo with butter; sprinkle with 1 tablespoon nut mixture and 1 teaspoon vanilla sugar. Repeat layering with 2 more phyllo pieces, buttering and sprinkling each with 1 tablespoon nut mixture and 1 teaspoon vanilla sugar. Top with remaining phyllo piece; brush with butter. Using large knife, trim stack to 12 by 8 inches. Cut stack into six 4-inch squares. Cut squares diagonally in half.",
        "Transfer triangles to prepared baking sheet. Brush parchment with butter; place buttered side down on triangles. Press 1 baking sheet atop parchment, anchoring triangles.",
        "Bake triangles until golden, about 10 minutes. Lift off top baking sheet. Carefully remove parchment. Transfer triangles to rack; cool. (Can be made 4 hours ahead. Store airtight at room temperature.)",
        "Preheat oven to 375°F. Stack baking sheet with strudel atop another baking sheet. Bake strudel until golden brown, about 45 minutes. Let stand at least 15 minutes and up to 4 hours.",
        "Preheat oven to 375°F. Stack baking sheet with strudel atop another baking sheet. Bake strudel until golden brown, about 45 minutes. Let stand at least 15 minutes and up to 4 hours.",
        "Cut strudel crosswise into 6 to 8 sections. Spoon warm chocolate sauce onto each plate. Place strudel atop sauce. Place scoop of ice cream alongside. Stand triangle between strudel and ice cream. Garnish with mint, if desired, and serve."
    ],
    "ingredients": [
        "1 cup sugar",
        "2 vanilla beans",
        "1/4 cup whipping cream",
        "1/4 cup water",
        "6 ounces bittersweet (not unsweetened) or semisweet chocolate, chopped",
        "2 tablespoons, brandy",
        "2 tablespoons cornstarch",
        "2 tablespoons (1/4 stick) unsalted butter",
        "2 pounds Anjou pears (about 4 large), peeled, cored, cut into 3/4-inch pieces (about 5 cups)",
        "1 teaspoon fresh lemon juice",
        "parchment paper and three baking sheets",
        "3/4 cup hazelnuts, toasted, husked",
        "12 vanilla wafer cookies",
        "12 sheets fresh phyllo pastry or frozen, thawed (each sheet about 12 by 17 inches)",
        "1 cup (2 sticks) unsalted butter, melted, cooled",
        "vanilla ice cream",
        "fresh mint sprigs (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Chocolate",
        "Fruit",
        "Nut",
        "Dessert",
        "Bake",
        "Sauté",
        "Pear",
        "Vanilla",
        "Fall",
        "Hazelnut",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vanilla-Scented Pear Strudel with Hazelnuts and Chocolate Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/vanilla-scented-pear-strudel-with-hazelnuts-and-chocolate-sauce-105460"
}
