{
    "directions": [
        "To mix the dough, combine the milk, sunflower oil, egg yolk, flour, and 1/2 teaspoon salt in a bowl. You can use an electric mixer or knead the dough by hand until it forms a smooth, stiff dough. Shape the dough into a log, wrap it in plastic wrap, and set aside.",
        "Soak the dried porcini in 1/2 cup hot water for 45 minutes. Meanwhile, cook the potatoes in boiling salted water to cover until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.",
        "Chop the rehydrated mushrooms, reserving the soaking liquid. Mash the potatoes, adding the mushroom-soaking liquid to moisten.",
        "Heat the vegetable oil in a skillet over medium heat. Stir in the chopped onions; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the chopped mushrooms.",
        "Mix the mashed potatoes, onions, and mushrooms; season with salt and pepper to taste. Set the filling aside while you roll out the vareniky dough.",
        "Cut the dough into discs about 3/8 inch thick and 2 inches wide (1 cm thick and 5 cm in diameter). Flatten or roll each disc on a lightly floured surface to make a thin circle. Drop the filling by tablespoonfuls into the center of each vareniky; fold the dough in half and pinch the edge to seal. Repeat until all of the dumplings are filled.",
        "Bring the gallon of water and tablespoon of salt to a boil in a large pot. Add the vareniky to the boiling water and stir once, gently. Simmer until all of the dumplings have floated to the surface, about 10 to 15 minutes. Drain well before serving."
    ],
    "ingredients": [
        "For the Dough:",
        "1 1/2 cups milk",
        "2 tablespoons sunflower seed oil",
        "1 egg yolk",
        "3 1/2 cups all-purpose flour",
        "1/2 teaspoon salt",
        "For the Filling:",
        "3 1/2 ounces dried porcini mushrooms",
        "1/2 cup hot water",
        "1 pound potatoes, peeled",
        "2 onions, chopped",
        "3 tablespoons vegetable oil",
        "salt and pepper to taste",
        "To Cook Vareniky:",
        "1 gallon water",
        "1 tablespoon salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vareniky",
    "url": "http://allrecipes.com/recipe/213129/vareniky/"
}
