{
    "directions": [
        "Mix orange juice, water, and cinnamon in a microwave-safe bowl. Heat in the microwave until the mixture registers 110 degrees F (43 degrees C) on an instant-read thermometer, 1 to 2 minutes.",
        "Stir yeast into the orange juice mixture. Let stand until yeast is creamy and frothy, about 45 minutes.",
        "Combine sugar and margarine in the bowl of a stand mixer. Beat until creamy. Add eggs; beat on high speed for 30 seconds. Mix in yeast mixture and orange zest until well combined.",
        "Sift flour, salt, and baking powder together in a bowl. Add gradually to the mixture in the stand mixer, mixing with a bread hook until a soft, sticky dough forms, about 5 minutes.",
        "Transfer dough to a large glass bowl. Cover with plastic wrap; let rise in a warm place until doubled in size, 2 to 4 hours.",
        "Preheat oven to 350 degrees F (175 degrees C). Grease 2 round cake pans.",
        "Divide dough into 2 equal pieces. Put 1 wrapped coin in each piece; knead for 2 to 3 minutes and shape into a ball. Place 1 ball of dough in each cake pan. Cover with plastic wrap; let rise until puffy, 2 to 4 hours more.",
        "Whisk egg white and vanilla together in a small bowl. Brush over the top of dough.",
        "Bake in the preheated oven until a knife inserted into the center comes out with a few crumbs attached, 30 to 55 minutes."
    ],
    "ingredients": [
        "1/2 cup orange juice",
        "1/2 cup water",
        "1 tablespoon ground cinnamon",
        "3 (.25 ounce) packages rapid-rise yeast",
        "2 cups white sugar",
        "1 cup unsalted margarine (such as Fleischmann's®), melted",
        "4 eggs",
        "1 orange, zested",
        "7 cups bread flour, or more as needed",
        "1 tablespoon salt",
        "1 tablespoon baking powder",
        "2 coins wrapped in aluminum foil",
        "1 egg white",
        "1 teaspoon vanilla extract"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vasilopita (Orange Sweet Bread)",
    "url": "http://allrecipes.com/recipe/256943/vasilopita-orange-sweet-bread/"
}
