{
    "directions": [
        "Heat dutch oven over medium heat. Add onions and sprinkle with sugar and 1 teaspoon thyme. Season generously with salt and pepper. Stir to mix. Add 1/2 cup wine. Cover and cook until onions are very soft, about 25 minutes, stirring occasionally. Add vinegar and cook until liquid evaporates and onions are caramelized, about 14 minutes, stirring frequently. Transfer all but 1/2 cup onions to bowl. Season veal with salt and pepper and add to onions in pan. Add broth, tomatoes with liquid, garlic, red pepper, remaining 1 cup wine, and remaining 1 teaspoon thyme. Partially cover and simmer, turning occasionally, 1 hour 15 minutes. Uncover; cook until veal is very tender, about 45 minutes.",
        "Stir beans into veal. Season to taste with salt and pepper. Cook until heated through. (Can be prepared up to 2 days ahead. Cover stew and onions separately and refrigerate. Reheat stew and onions over low heat.)",
        "Mix basil into veal. Transfer veal shanks to bowls. Pour vegetables and juices over. Top each with reserved onion and serve."
    ],
    "ingredients": [
        "2 large onions, halved, sliced",
        "1 tablespoon sugar",
        "2 teaspoons dried thyme, crumbled",
        "1 1/2 cups dry white wine",
        "3 tablespoons balsamic vinegar*",
        "4 medium veal shanks (about 1 3/4 pounds), well trimmed",
        "2 cups canned unsalted chicken broth",
        "1 14 1/2-ounce can Italian stewed tomatoes",
        "4 large garlic cloves, pressed",
        "1 teaspoon dried crushed red pepper",
        "1 15-ounce can Great Northern white beans, undrained",
        "1/4 cup sliced fresh basil",
        "Balsamic vinegar is available at specialty foods stores, Italian markets and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Bean",
        "Beef",
        "Herb",
        "Onion",
        "Tomato",
        "Stew",
        "Low Fat"
    ],
    "title": "Veal Shank with Balsamic Onions and White Beans",
    "url": "http://www.epicurious.com/recipes/food/views/veal-shank-with-balsamic-onions-and-white-beans-206"
}
