{
    "directions": [
        "Bring chicken broth and fennel bulbs to simmer in heavy large saucepan over medium heat. Simmer until tender, about 10 minutes. Remove from heat; mix in figs and let stand 10 minutes. Strain; reserve liquid, fennel and figs separately.",
        "Melt 1 tablespoon butter in heavy large skillet over medium-low heat. Transfer fennel bulbs to skillet, cut side down. Sprinkle with 1/2 teaspoon sugar, salt and pepper. Cook until cut side is brown, about 2 minutes. Turn fennel over; sprinkle with remaining 1/2 teaspoon sugar, salt and pepper. Cook until brown and beginning to soften, about 4 minutes. Using slotted spoon, transfer fennel to 8x8x2-inch glass baking dish. Add 1/4 cup reserved liquid and pumpkin pie spice to skillet. Bring to boil, scraping up browned bits; pour liquid over fennel in baking dish. Place figs between fennel bulbs. Dot with 1 tablespoon butter. Cover baking dish with foil. Set aside.",
        "Combine beef broth, shallot and remaining reserved liquid in heavy small saucepan; bring to boil. Reduce heat to medium; simmer until liquid is reduced to 1/4 cup, about 20 minutes. Add Port and simmer until liquid is reduced to 1/4 cup, about 20 minutes. (Fennel-fig mixture and Port sauce can be made 2 hours ahead; let stand at room temperature.)",
        "Preheat oven to 350°F. Bake fennel until very tender, about 40 minutes. Remove from oven; keep covered. Maintain oven temperature.",
        "Sprinkle veal with salt and pepper. Melt 1 tablespoon butter in large ovenproof skillet over medium-high heat. Cook veal until brown, about 3 minutes per side. Transfer to oven. Roast until thermometer inserted into center of veal chop registers 150°F, about 8 minutes. Transfer veal to 2 plates. Top with baked fennel-fig mixture. Bring Port sauce to simmer; add remaining 3 tablespoons butter and whisk just until melted. Season sauce with salt and pepper; pour over veal. Garnish with fennel fronds."
    ],
    "ingredients": [
        "1 3/4 cups canned low-salt chicken broth",
        "2 medium fennel bulbs with fronds (about 12 ounces), trimmed, bulbs halved lengthwise, fronds chopped",
        "12 dried black Mission figs",
        "6 tablespoons unsalted butter",
        "1 teaspoon sugar",
        "1/4 teaspoon pumpkin pie spice",
        "1/2 cup canned beef broth",
        "2 tablespoons minced shallot",
        "1 cup tawny Port",
        "2 8-ounce veal rib chops (each about 1 1/4 inches thick)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Vegetable",
        "Roast",
        "Sauté",
        "Christmas",
        "Fig",
        "Veal",
        "Fennel",
        "Port",
        "Winter"
    ],
    "title": "Veal Rib Chops with Caramelized Fennel and Figs",
    "url": "http://www.epicurious.com/recipes/food/views/veal-rib-chops-with-caramelized-fennel-and-figs-104496"
}
