{
    "directions": [
        "Preheat broiler and lightly spray a baking sheet with vegetable oil.",
        "Cut tomatoes lengthwise into 1/4-inch-thick slices and arrange in one layer on baking sheet. Season tomatoes with salt and pepper and broil 3 to 4 inches from heat until edges are browned, about 15 minutes.",
        "While tomatoes are broiling, in a saucepan of boiling salted water cook squash until crisp-tender, about 4 minutes. Drain squash in a colander and season with salt and pepper. Keep tomatoes and squash warm.",
        "In a cup stir together lemon juice, mustard, and oil. If veal scallops are too thick, put each veal scallop between 2 sheets of plastic wrap and with a rolling pin or smooth side of a meat pounder, gently flatten veal to 1/8 inch thick. Pat veal scallops dry and brush one side of each with lemon mixture. Season veal with salt. In a well-seasoned ridged grill pan cook veal scallops in batches over moderately high heat about 1 minute on each side, or until cooked through.",
        "If scallops are large, cut in half diagonally. Serve veal with tomatoes, squash, and sauce."
    ],
    "ingredients": [
        "vegetable-oil cooking spray",
        "4 plum tomatoes",
        "3/4 pound baby pattypan squash",
        "2 tablespoons fresh lemon juice",
        "1 teaspoon Dijon mustard",
        "2 teaspoons extra-virgin olive oil",
        "1 pound veal scallops (each about 1/8 inch thick)",
        "Accompaniment: roasted-garlic basil sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Herb",
        "Tomato",
        "Vegetable",
        "Dinner",
        "Basil",
        "Meat",
        "Veal",
        "Squash",
        "Summer",
        "Grill",
        "Grill/Barbecue",
        "Healthy",
        "Gourmet"
    ],
    "title": "Veal Scallops with Squash, Tomatoes, and Roasted-Garlic Basil Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/veal-scallops-with-squash-tomatoes-and-roasted-garlic-basil-sauce-100737"
}
