{
    "directions": [
        "Preheat oven to 350°F.",
        "Toast bread with salt and pepper to taste in a shallow baking pan, shaking pan occasionally, 10 minutes, or until golden brown and crisp. Transfer bread to a large bowl and keep oven at 350°F.",
        "In a 10-inch non-stick skillet cook onion, celery, and rosemary in butter over moderate heat 5 minutes, or until onion is softened. Stir in apricots and 1/4 cup broth and cook until almost all liquid is evaporated, about 2 minutes. Add mixture to bread with salt and pepper to taste and toss until combined well. Let stuffing cool. Stuffing may be made 1 day ahead and chilled, covered.",
        "In a measuring cup whisk together apricot nectar, mustard, and remaining cup broth and reserve.",
        "Gently pound cutlets, 1 at a time, between 2 sheets of plastic wrap until about 1/4 inch thick, trying not to make any holes in them. Discard plastic wrap and season cutlets with salt and pepper. Spoon stuffing down a long side of each cutlet, leaving a 1/2-inch border along edge. Roll up cutlets tightly to enclose stuffing and secure top seams, openings at both ends, and any holes with wooden toothpicks.",
        "Put cornmeal with salt and pepper to taste in a shallow bowl and coat roulades evenly in mixture. In cleaned skillet heat oil over moderately high heat until hot but not smoking and brown roulades 3 minutes. Arrange roulades in one layer in an 8-inch square glass baking dish. Deglaze skillet with wine over moderate heat, scraping up any brown bits, and add to baking dish. Pour reserved nectar mixture around (not over) roulades in baking dish. Cover dish tightly with foil and braise roulades in middle of oven 30 minutes, or until just cooked through. Transfer roulades with tongs to a cutting board and carefully remove wooden picks.",
        "Transfer liquid in baking dish to a small saucepan and boil until reduced to about 1 cup. Remove pan from heat and whisk in arrowroot and salt and pepper to taste.",
        "Cut roulades diagonally into 1/4-inch-thick slices and spoon sauce over top."
    ],
    "ingredients": [
        "1 1/2 slices firm homemade-type sandwich bread, cut into 1/2-inch cubes",
        "1/2 cup chopped onion",
        "1/4 cup chopped celery",
        "1 teaspoon chopped fresh rosemary leaves or 1/2 teaspoon dried, crumbled",
        "1 teaspoon unsalted butter",
        "1 ounce dried apricots (about 1/4 cup), chopped",
        "1 1/4 cups chicken broth",
        "1/4 cup canned apricot nectar",
        "1 1/2 tablespoons Dijon mustard",
        "4 veal loin cutlets (4 ounces each), trimmed of fat, or 4 turkey cutlets (4 ounces each)",
        "wooden toothpicks for securing roulades",
        "2 tablespoons yellow cornmeal",
        "1 tablespoon olive oil",
        "1/4 cup dry white wine",
        "1/2 teaspoon arrowroot"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mustard",
        "turkey",
        "Bake",
        "Apricot",
        "Rosemary",
        "Gourmet"
    ],
    "title": "Veal or Turkey Roulades with Dried Apricot Rosemary Stuffing and Apricot Mustard Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/veal-or-turkey-roulades-with-dried-apricot-rosemary-stuffing-and-apricot-mustard-sauce-13288"
}
