{
    "directions": [
        "1. Lay the veal shanks in a shallow baking pan and sprinkle liberally on both sides with salt. Refrigerate for 2 hours.",
        "2. Rinse the veal shanks of their salt and pat dry with paper towels. Wrap each veal shank once around the circumference so that it holds the bone and meat together in the center. Tie the twine with a good knot. Season the veal shanks with pepper.",
        "3. Preheat the oven to 350°F.",
        "4. Heat a large, ovenproof casserole over high heat. Put the oil into the casserole and let it heat.",
        "5. Meanwhile, put the flour in a shallow bowl, dredge the veal shanks in it, and pat off the excess. Brown the veal shanks in the hot oil for about 5 minutes on each side, or until browned on all sides. Remove from the pan and set aside. If the oil turns dark during the process, discard it and heat a fresh cup of oil.",
        "6. Add the carrots, celery, onion, and garlic to the pan and cook over medium-high heat for 2 to 3 minutes, stirring constantly. Add the wine, bring to a boil, and cook for about 2 minutes, or until reduced by half.",
        "7. Add the stocks, tomatoes, thyme, rosemary, and bay leaf to the pan. Return the veal shanks to the pan and bring to a boil over high heat. Once the liquid boils, cover, transfer to the oven, and cook for 2 1/2 hours, until the meat is fork tender and falling off the bones.",
        "8. Remove the herbs from the braising liquid and discard. Let the veal shanks come to room temperature in the braising liquid. Remove the veal shanks and set aside. Strain the liquid through a fine-mesh sieve or chinois into a large saucepan. Bring to a boil over medium-high heat, reduce the heat, and simmer for 10 to 15 minutes, or until reduced by a quarter. Using a skimmer or large spoon, skim off any grease or foam that rises to the surface. Return the strained vegetables to the liquid and taste for seasoning.",
        "9. To serve, cut and discard the twine, put a single osso buco (veal shank) in a bowl, and ladle about 3/4 cup of the sauce and vegetables over it. (If the sauce and the meat are not still warm, heat them together very gently over low heat for 8 to 10 minutes.)",
        "10. Garnish each osso buco with the fresh horseradish, lemon zest, and chopped parsley and season with pepper."
    ],
    "ingredients": [
        "Four 12-ounce veal shanks",
        "Kosher salt",
        "Freshly ground black pepper",
        "1 cup vegetable oil",
        "1 cup all-purpose flour",
        "2 carrots, peeled and diced",
        "2 celery ribs, diced",
        "1 yellow onion, diced",
        "6 garlic cloves, sliced",
        "1 cup dry red wine",
        "4 cups veal stock or chicken stock",
        "3 cups chicken stock",
        "3 cups canned plum tomatoes, drained and crushed",
        "2 sprigs fresh thyme",
        "1 sprig fresh rosemary",
        "1 bay leaf",
        "1 tablespoon grated fresh horseradish (see Note)",
        "2 tablespoons grated lemon zest",
        "2 tablespoons chopped fresh flat-leaf parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Wine",
        "Tomato",
        "Braise",
        "Dinner",
        "Horseradish",
        "Rosemary",
        "Meat",
        "Veal",
        "Carrot",
        "Thyme",
        "Simmer",
        "Boil"
    ],
    "title": "Veal Osso Buco",
    "url": "http://www.epicurious.com/recipes/food/views/veal-osso-buco-358371"
}
