{
    "directions": [
        "1. Preheat the oven to 350°F. In a heavy pot over moderately high heat, warm the olive oil.",
        "2. Generously season the osso buco with salt and pepper, then dredge completely in the flour.",
        "3. Add the onion, leek, carrots, and celery to the oil in the skillet and sauté, stirring frequently, until softened, about 4 minutes. Push the vegetables to the outside of the pan and add the osso buco. Sear each side of the osso buco until deep golden brown, about 8 minutes total.",
        "4. Add the wine, sage, rosemary, bay leaf, 2 tablespoons of parsley, tomatoes, and stock, and bring to a boil. Cover the pot with a tight-fitting lid and transfer it to the oven. Braise until the meat is very tender and can be easily pulled apart with a fork, about 2 hours.",
        "5. Remove the osso buco from the pot and, if desired, reduce the sauce on the stovetop. Remove and discard the herb stems before serving. Prepare a gremolata by stirring together the lemon zest and the remaining chopped parsley. Serve the osso buco garnished with sauce and the gremolata."
    ],
    "ingredients": [
        "1/2 cup olive oil",
        "4 (1 1/2-inch-thick) pieces center cut veal osso buco",
        "Salt and freshly ground black pepper",
        "1/2 cup all-purpose flour",
        "1 medium onion, minced",
        "1 medium leek, white and light green parts only, washed and minced",
        "2 carrots, diced",
        "2 celery stalks, diced",
        "1 cup dry white wine",
        "4 whole fresh sage leaves",
        "2 sprigs fresh rosemary",
        "1 dry bay leaf",
        "3 tablespoons fresh flat leaf parsley, chopped",
        "2 cups peeled and crushed plum tomatoes",
        "1 cup veal or chicken stock or low-sodium broth",
        "1 teaspoon finely grated lemon zest"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Herb",
        "Onion",
        "Tomato",
        "Braise",
        "Dinner",
        "Veal",
        "Celery",
        "Carrot",
        "White Wine",
        "Fall",
        "Winter",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Veal Osso Buco (Ossobuco alla Milanese)",
    "url": "http://www.epicurious.com/recipes/food/views/veal-osso-buco-ossobuco-alla-milanese-51112230"
}
