{
    "directions": [
        "Heat 1/2 cup broth until warm, then add matzo meal and soak 10 minutes.",
        "While matzo soaks, chop enough olives to measure 1/3 cup, then quarter remainder and set aside. Pulse soaked matzo and chopped olives in a food processor along with garlic, egg, 1/4 teaspoon salt, and 1/4 teaspoon pepper until olives and garlic are finely chopped and egg is incorporated. Add 1/4 cup parsley and pulse until parsley is finely chopped.",
        "Transfer matzo mixture to a bowl and add veal, mixing gently with your hands until combined. Chill, covered, 30 minutes.",
        "Preheat broiler. Line a 15- by 10-inch shallow baking pan or baking sheet with foil, and brush foil with oil. Using wet hands, form veal mixture into 1 1/2-inch balls, arranging in 1 layer as formed in baking pan.",
        "Broil meatballs 4 to 6 inches from heat, turning once with a spatula and tongs, until browned, about 10 minutes total.",
        "While meatballs are broiling, heat 3 tablespoons oil in a 12-inch heavy skillet (2 to 3 inches deep) over moderately high heat until hot but not smoking. Brown fennel in 2 batches, turning occasionally, 5 to 7 minutes per batch. Transfer to a plate, then brown carrots in remaining 2 tablespoons oil in skillet, stirring occasionally, 5 to 7 minutes.",
        "Return fennel to skillet and add meatballs, remaining 2 cups chicken broth, and remaining 1/4 teaspoon each of salt and pepper. Simmer, covered, until vegetables are tender, about 20 minutes.",
        "Whisk together water and potato starch in a small bowl. Stir into meatball mixture and boil, uncovered, until sauce is thickened slightly, about 2 minutes (sauce will continue to thicken off the heat). Remove from heat and sprinkle with remaining 2 tablespoons parsley and quartered olives. Season with salt."
    ],
    "ingredients": [
        "2 1/2 cups reduced-sodium chicken broth (20 fl oz)",
        "1/3 cup matzo meal",
        "7 oz brine-cured green olives (1 cup medium), pitted",
        "2 garlic cloves, chopped",
        "1 large egg",
        "1/2 teaspoon salt",
        "1/2 teaspoon black pepper",
        "1/4 cup plus 2 tablespoons chopped fresh flat-leaf parsley",
        "1 lb ground veal",
        "5 tablespoons olive oil plus additional for greasing pan",
        "2 medium fennel bulbs (sometimes called anise; 2 lb total), stalks cut off and discarded and bulbs halved lengthwise, then cut lengthwise into 1/3-inch-thick slices",
        "1 lb carrots (6 medium), cut diagonally into 1-inch pieces",
        "1 tablespoon water",
        "2 1/4 teaspoons potato starch",
        "Accompaniment: lemon wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Beef",
        "Olive",
        "Vegetable",
        "Braise",
        "Broil",
        "Passover",
        "Quick & Easy",
        "Dinner",
        "Veal",
        "Kosher",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Veal Meatballs with Braised Vegetables",
    "url": "http://www.epicurious.com/recipes/food/views/veal-meatballs-with-braised-vegetables-234267"
}
