{
    "directions": [
        "Cut meat away from veal breastbone, reserving bone, and cut meat into 2-inch pieces.",
        "Bring veal breast and shoulder, veal bone, and water to a boil over moderate heat in a 7- to 8-quart heavy pot, skimming froth. While water is heating, wrap parsley, thyme, bay leaf, and peppercorns in a small square of cheesecloth and tie into a bundle to make a bouquet. Add bouquet garni and onions to pot and simmer, uncovered, until veal is tender, 1 1/4 to 1 1/2 hours.",
        "Preheat oven to 300°F.",
        "Transfer veal with a slotted spoon to a heatproof serving dish and keep warm in oven, covered with foil.",
        "Discard veal bone, onions, and bouquet garni, then pour stock through a fine sieve into a large bowl. Return stock to cleaned pot, add carrots and leek, and simmer until tender, 10 to 12 minutes. Transfer vegetables to serving dish. Boil stock until reduced to about 2 1/2 cups, about 10 minutes.",
        "While stock is reducing, heat butter in a 10-inch heavy skillet over moderate heat until foam subsides, then cook mushrooms, stirring, until just tender, 6 to 8 minutes. Transfer to serving dish and season veal and vegetables with salt and pepper. Keep warm in oven.",
        "Melt butter in a 2- to 3-quart heavy saucepan over moderately low heat, then stir in flour. Cook roux, stirring, 3 minutes (do not let brown). Whisk in reduced stock and simmer, uncovered, whisking occasionally, 15 minutes. Whisk together yolks and crème fraîche in a small bowl, then whisk in 1 cup sauce. Whisk yolk mixture into remaining sauce with lemon juice, then cook over moderately low heat (do not let boil), stirring constantly, until it reaches 160°F on an instant-read thermometer and coats back of a wooden spoon.",
        "Season sauce with salt and pepper and pour over veal and vegetables."
    ],
    "ingredients": [
        "2 3/4 pound veal breast (bone in)",
        "1 pound boneless veal shoulder, trimmed and cut into 2-inch pieces",
        "2 1/2 quarts water",
        "6 fresh parsley sprigs",
        "2 fresh thyme sprigs",
        "1 bay leaf (not California)",
        "4 black peppercorns",
        "2 onions, halved",
        "4 carrots, quartered crosswise",
        "1 leek (white and pale green parts only), halved lengthwise and cut crosswise into 1/2-inch pieces",
        "2 tablespoons unsalted butter",
        "1/2 pounds mushrooms, quartered",
        "3 tablespoons unsalted butter",
        "3 tablespoons all-purpose flour",
        "2 large egg yolks",
        "2 tablespoons crème fraîche",
        "1 1/2 tablespoons fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Dinner",
        "Veal",
        "Leek",
        "Carrot",
        "Winter",
        "Simmer",
        "Gourmet",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Veal Stew (Blanquette de Veau)",
    "url": "http://www.epicurious.com/recipes/food/views/veal-stew-blanquette-de-veau-104763"
}
