{
    "directions": [
        "To Make Crepes: In a medium bowl beat eggs thoroughly, then add milk and butter. Beat in flour and salt until smooth. (Note: Batter is best if left to set for 1/2 hour before using). Brown crepes in a medium hot skillet, making them 6 to 8 inches in circumference. Set aside.",
        "To Make Meat Filling: Brown veal, chicken and beef in butter in a large skillet over medium high heat. Stir in the parsley, cheese, salt, pepper and nutmeg. Let cool.",
        "Preheat oven to 375  degrees F (190 degrees C).",
        "To Make White Sauce:  In a small saucepan over medium heat, cook flour and butter together for 1 minute. Stir in salt, pepper and nutmeg, then stir in milk and continue to cook until thick.",
        "Spread 1/2 of the pasta sauce in the bottom of a 9x13 inch baking dish. Spoon meat mixture into prepared crepes, folding over all sides of crepe to form palm-sized bundles. Place filled crepes, seam side down, in baking dish. Cover with remaining pasta sauce and pour White Sauce over all. Cover with mozzarella cheese and top with Parmesan cheese.",
        "Bake in the preheated oven for 20 to 30 minutes, or until cheese is bubbly and brown around the edges. Serve hot."
    ],
    "ingredients": [
        "CREPES",
        "2 eggs",
        "2/3 cup milk",
        "1 tablespoon butter, melted",
        "1/2 cup all-purpose flour",
        "1/4 teaspoon salt",
        "MEAT FILLING",
        "1/4 pound ground veal",
        "1/4 pound ground chicken",
        "1/2 pound ground beef",
        "2 tablespoons butter",
        "1 tablespoon minced fresh parsley",
        "1/2 cup grated Parmesan cheese",
        "1/2 teaspoon salt",
        "1 dash ground black pepper",
        "1 dash ground nutmeg",
        "WHITE SAUCE",
        "2 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "1 cup milk",
        "1/4 teaspoon salt",
        "1/8 teaspoon ground black pepper",
        "1/8 teaspoon ground nutmeg",
        "1 (32 ounce) jar tomato pasta sauce",
        "1 (16 ounce) package shredded mozzarella cheese",
        "1/4 cup grated Parmesan cheese"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Veal, Chicken and Beef Canelloni",
    "url": "http://allrecipes.com/recipe/25142/veal-chicken-and-beef-canelloni/"
}
