{
    "directions": [
        "Preheat oven to 350°F. Spread bones, carrot, onion, and celery on rimmed baking sheet. Roast, tossing several times, until vegetables and bones have begun to take on color, about 1 hour.",
        "Transfer roasted vegetables and bones to 5-quart stockpot. Add 2 quarts (8 cups) water and bouquet garni and bring to boil. Reduce heat and simmer gently, uncovered, until liquid measures approximately 2 cups, about 2 hours. Remove and discard bones and bouquet garni. Strain out vegetables and reserve liquid (glace de viande). Use gravy separator to skim fat (or let cool, then refrigerate until fat has solidified, at least 2 hours, and lift off and discard fat).",
        "Spray large sauté pan with canola oil and warm over medium heat. Add shallots and garlic and cook, stirring, until shallots are translucent. Add wine and sherry and simmer, stirring and scraping up browned bits from bottom of pan, until liquid is almost evaporated, about 4 minutes. Add glace de viande and 3/4 cups water. Bring to boil and simmer until demi-glace measures about 2 cups, about five minutes. Season with salt and pepper.",
        "In small bowl, stir together cornstarch and 1 tablespoon water to form paste. Stir paste into demi-glace and simmer until thickened, about 1 minute more. May be used as base for soups and sauces or as garnish for dishes such as Turkey Breast Medallions with Tomato Jam ."
    ],
    "ingredients": [
        "3 pounds assorted veal bones",
        "3/4 pound veal leg bone",
        "1/2 carrot, roughly chopped",
        "1 small onion, roughly chopped",
        "1 celery stalk, roughly chopped",
        "1 bouquet garni (see Chef's notes, below)",
        "Canola oil in kitchen-oil spritzer (See Chef's notes, below)",
        "1/4 cup finely chopped shallots (about 1)",
        "2 garlic cloves, finely chopped",
        "1/4 cup red Burgundy wine",
        "2 tablespoons dry sherry",
        "1 1/2 teaspoons ground black pepper",
        "1/4 teaspoon salt",
        "1 tablespoon cornstarch"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Onion",
        "Vegetable",
        "Low Carb",
        "Low Fat",
        "Low Cal",
        "Veal",
        "Celery",
        "Carrot",
        "Sherry",
        "Red Wine",
        "Fall",
        "Simmer"
    ],
    "title": "Veal Demi-Glacé",
    "url": "http://www.epicurious.com/recipes/food/views/veal-demi-glace-234085"
}
