{
    "directions": [
        "Char red bell pepper over gas flame or in broiler until blackened on all sides. Wrap in paper bag and let stand 10 minutes. Peel, seed and slice pepper into 1/2-inch-wide strips.",
        "Preheat oven to 350°F. Heat 1 tablespoon olive oil in heavy large skillet over medium-high heat. Add spinach and toss until just wilted, about 2 minutes. Transfer spinach to small bowl. Add remaining 1 tablespoon olive oil to skillet, then onions and garlic; sauté until onions are tender, about 5 minutes. Transfer onion mixture to large bowl. Stir breadcrumbs, eggs, basil, ketchup, thyme, mustard, steak sauce, 1 1/2 teaspoons salt and 1/2 teaspoon black pepper into onion mixture. Mix in veal.",
        "Place half of veal mixture in 9 x 5 x 3-inch metal loaf pan. Using back of spoon, make 1-inch-wide, 1/2-inch-deep canal lengthwise down middle of loaf. Lay half of red bell pepper strips in canal. Layer with spinach and remaining bell peppers. Fill pan with remaining veal mixture, pressing firmly.",
        "Bake meat loaf until brown on top and thermometer inserted into center registers 160°F, about 50 minutes. Let cool 15 minutes. Cut into 8 slices and serve."
    ],
    "ingredients": [
        "1 large red bell pepper",
        "2 tablespoons olive oil",
        "1/2 6-ounce package fresh baby spinach",
        "2 cups chopped onions",
        "2 tablespoons minced garlic",
        "2 cups fresh breadcrumbs made from French bread",
        "2 large eggs",
        "1/2 cup chopped fresh basil",
        "6 tablespoons ketchup",
        "2 tablespoons chopped fresh thyme",
        "1 tablespoon Dijon mustard",
        "1 tablespoon prepared steak sauce",
        "1 1/2 teaspoons salt",
        "1/2 teaspoon ground black pepper",
        "2 pounds ground veal"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Bake",
        "Veal",
        "Spinach",
        "Bell Pepper",
        "Fall"
    ],
    "title": "Veal Meat Loaf with Red Bell Pepper and Spinach",
    "url": "http://www.epicurious.com/recipes/food/views/veal-meat-loaf-with-red-bell-pepper-and-spinach-15599"
}
