{
    "directions": [
        "Preheat oven to 400°F. Using small sharp knife, cut an X in each chestnut. Place in roasting pan. Bake until tender and shells loosen, about 35 minutes. Cool slightly. Remove hard shell and papery brown skin from each nut. Set nuts aside.",
        "Pat veal pieces dry with paper towels. Sprinkle with salt and pepper. Heat 2 tablespoons oil in heavy large pot over medium-high heat. Working in batches, add veal to pot and cook until brown on all sides, about 10 minutes. Using slotted spoon, transfer veal to large bowl.",
        "Heat 2 tablespoons oil in same pot. Add onion, garlic and bay leaf. Reduce heat to medium; cover and cook until onion is tender, stirring occasionally, about 5 minutes. Stir in broth and wine. Add veal and any accumulated juices from bowl. Bring to boil. Reduce heat. Cover; simmer 45 minutes, stirring occasionally.",
        "Add carrots to stew. Cover and cook until carrots are almost tender, about 25 minutes. Uncover and cook until meat is very tender and liquid is reduced to thin sauce consistency, about 25 minutes longer. Stir in nuts and sage. Simmer until nuts are heated through, about 3 minutes. Discard bay leaf. Transfer ragout to bowl."
    ],
    "ingredients": [
        "18 fresh chestnuts",
        "2 1/2 pounds veal stew meat, cut into 2x1-inch pieces",
        "4 tablespoons olive oil",
        "1 1/2 cups chopped onion",
        "1 1/2 tablespoons chopped garlic",
        "1 bay leaf",
        "2 1/2 cups canned low-salt chicken broth",
        "3/4 cup dry white wine",
        "6 medium carrots, peeled, cut into 1-inch pieces",
        "3 tablespoons chopped fresh sage"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Nut",
        "Vegetable",
        "Stew",
        "High Fiber",
        "Dinner",
        "Meat",
        "Veal",
        "Carrot",
        "Fall",
        "Chestnut",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Veal, Carrot and Chestnut Ragoût",
    "url": "http://www.epicurious.com/recipes/food/views/veal-carrot-and-chestnut-ragout-4671"
}
