{
    "directions": [
        "In a heavy skillet cook 1/2 cup of the onion and the mushrooms in 6 tablespoons of the butter over moderate heat, stirring occasionally, until the onion is golden, stir in the bread crumbs, the basil, and salt and pepper to taste, and let the filling cool. Divide the filling among the cutlets and fold in the long sides of each cutlet 1/2 inch. Starting with a short side, roll up the cutlets and tie them at each end with kitchen string.",
        "In a large heavy skillet heat 2 tablespoons of the remaining butter over moderately high heat until the foam subsides, in it brown the veal birds, patted dry, and transfer them as they are browned to a bowl. In the skillet cook the remaining 1 cup onion in the remaining 1 tablespoon butter over moderate heat, stirring, until it is golden, stir in the stock, the tomato purée, and the paprika, and add the veal birds with any juices that have accumulated in the bowl. Simmer the mixture, covered, for 15 to 20 minutes, or until the veal is tender. Arrange the noodles on a platter, remove the string from the veal birds, and transfer the veal birds with tongs to the platter. Reduce the heat to low, whisk the sour cream and salt and pepper to taste into the skillet, and cook the sauce, stirring occasionally, until it is hot, but do not let it boil. Serve the sauce separately."
    ],
    "ingredients": [
        "1 1/2 cups finely chopped onion",
        "1/2 cup finely chopped mushrooms",
        "9 tablespoons unsalted butter",
        "1 cup fine dry bread crumbs",
        "1 teaspoon dried basil, crumbled",
        "six 1/4-inch-thick veal cutlets (about 1 pound total), flattened between sheets of plastic wrap",
        "1/2 cup white veal stock or chicken broth",
        "1/2 cup tomato purée",
        "2 tablespoons paprika",
        "buttered noodles as an accompaniment",
        "1 cup sour cream"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Tomato",
        "Braise",
        "Veal",
        "Winter",
        "Sour Cream",
        "Gourmet"
    ],
    "title": "Veal Birds Paprika",
    "url": "http://www.epicurious.com/recipes/food/views/veal-birds-paprika-11050"
}
