{
    "directions": [
        "Heat 2 tablespoons butter in a 12-inch heavy skillet over high heat until foam subsides, then sauté mushrooms, stirring frequently, until liquid mushrooms give off is evaporated and mushrooms begin to brown, about 10 minutes. Add garlic and parsley and sauté, stirring, 1 minute. Transfer to a bowl and wipe skillet clean.",
        "Pat veal dry, then sprinkle with salt, pepper, thyme, and oregano.",
        "Heat 1/2 tablespoon oil with 1 teaspoon butter in skillet over moderately high heat until hot but not smoking. While fat is heating, quickly dredge 2 or 3 pieces of veal in flour, shaking off excess, then sauté until just cooked through, 1 to 1 1/2 minutes on each side (meat will still be slightly pink inside). Transfer to a platter with tongs and keep warm, loosely covered. Sauté remaining veal in 2 more batches using remaining oil and butter.",
        "Add Marsala to skillet and deglaze by boiling, stirring and scraping up brown bits, until reduced by half. Stir in demiglace and simmer, stirring occasionally, 2 minutes. Stir in mushroom mixture and any veal juices accumulated on platter, then season with salt and pepper if necessary. Simmer 2 minutes more and spoon over veal.",
        "We use Demi-Glace Gold, available in specialty foods shops, some supermarkets, and by mail order from More Than Gourmet (800-860-9385) or the demiglace/brown sauce from Citarella (212-874-0383)."
    ],
    "ingredients": [
        "3 tablespoons unsalted butter",
        "1 pound mushrooms, quartered",
        "1 large garlic clove, minced",
        "2 tablespoons chopped fresh flat-leaf parsley",
        "1 1/2 pound veal cutlets (also called scallopini; 1/4 inch thick)",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/4 teaspoon dried thyme, crumbled",
        "1/4 teaspoon dried oregano, crumbled",
        "1 1/2 tablespoons olive oil",
        "1/3 cup all-purpose flour",
        "2/3 cup sweet Marsala wine",
        "1 cup beef or veal demiglace*",
        "Accompaniment: egg fettuccine tossed with butter"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Mushroom",
        "Sauté",
        "Veal",
        "Marsala",
        "Spring",
        "Gourmet"
    ],
    "title": "Veal Marsala",
    "url": "http://www.epicurious.com/recipes/food/views/veal-marsala-106274"
}
