{
    "directions": [
        "Scrub lemons and with a vegetable peeler remove zest in strips. In a saucepan of boiling water blanch zest 1 minute and drain in a sieve. Transfer zest to a glass jar (about 1-cup capacity). Add salt and juice, pressing zest down to keep it covered by lemon juice, and cover jar with a tight-fitting glass lid or plastic-coated lid. Let zest stand at room temperature 4 days, shaking jar each day. Preserved lemon zest keeps, covered and chilled, 6 months. Makes about 1/2 cup.",
        "Preheat oven to 275°F.",
        "In a heavy kettle large enough to hold veal shanks in one layer without crowding arrange shanks and season with salt and pepper. Roast shanks in middle of oven, covered tightly, 3 hours, or until tender. (Meat will give off juices as it cooks.)",
        "While shanks are roasting, in a large saucepan combine chick-peas with enough water to cover by 4 inches and simmer, covered partially, 1 1/2 to 2 hours, or until tender but not falling apart. Drain chick-peas in a colander. Chick-peas may be cooked 2 days ahead, cooled, uncovered, and chilled, covered.",
        "Transfer shanks to a deep platter and keep warm, reserving pan juices.",
        "In a large heavy skillet heat oil over moderate heat until hot but not smoking and cook onion, stirring, until softened. Add artichoke hearts, chick-peas, and reserved pan juices and simmer, covered, until artichoke hearts are just tender, about 3 minutes. Transfer about 1/2 cup chick-peas with a slotted spoon and about 1 cup pan juices from skillet to a blender and purée. Stir purée into artichoke and chick-pea mixture to thicken and stir in coriander and salt and pepper to taste.",
        "Spoon artichoke and chick-pea mixture over shanks and sprinkle with preserved lemon."
    ],
    "ingredients": [
        "six to eight 2-inch-thick veal shanks (5 pounds total), each tied securely with kitchen string to keep meat attached to bone",
        "1 1/2 cups dried chick-peas, picked over",
        "1 tablespoon olive oil",
        "1 large onion, chopped",
        "two 10-ounce packages frozen artichoke hearts, thawed, halved lengthwise if large",
        "1/4 cup packed fresh coriander sprigs, washed well, spun dry, and minced",
        "3 tablespoons four-day preserved lemon zest slivered",
        "3 large lemons",
        "2 teaspoons coarse salt",
        "2/3 cup fresh lemon juice"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Roast",
        "High Fiber",
        "Lemon",
        "Veal",
        "Artichoke",
        "Chickpea",
        "Winter",
        "Gourmet"
    ],
    "title": "Veal Shanks, Artichoke Hearts, and Chick-Peas with Preserved Lemon",
    "url": "http://www.epicurious.com/recipes/food/views/veal-shanks-artichoke-hearts-and-chick-peas-with-preserved-lemon-11392"
}
