{
    "directions": [
        "Preheat oven to 250 degrees F (120 degrees C).",
        "Heat 1 tablespoon olive oil in a skillet over medium heat. Add garlic and cook until sizzling, about 30 seconds. Stir in spinach leaves; cover skillet. Reduce heat to low and cook until spinach is just wilted, stirring occasionally, 4 to 5 minutes.",
        "Mix flour, salt, and pepper together in a shallow bowl. Press each cutlet into flour mixture to coat; shake off excess flour. Place the floured cutlets onto a plate while flouring the rest; do not stack. Place 2 sage leaves and 1 prosciutto slice on each floured cutlet, roll cutlets, and secure with toothpicks at each end. Refrigerate cutlet rolls for 30 minutes.",
        "Heat remaining olive oil in a skillet over medium heat. Cook cutlet rolls until veal is browned but still slightly pink in the center, 1 to 2 minutes per side. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Place cooked cutlets in a baking dish and place in preheated oven to keep warm.",
        "Pour Marsala wine into the skillet and bring to a boil while scraping the browned bits of food from the bottom of the skillet with a wooden spoon. Stir in butter until smooth, 1 to 2 minutes.",
        "Place spinach on a large serving platter. Place cutlets on top of spinach, pour Marsala Wine mixture over the cutlets, and top with hard-boiled egg slices to serve."
    ],
    "ingredients": [
        "2 tablespoons olive oil, or as needed",
        "4 cloves garlic, slivered",
        "1 (10 ounce) package baby spinach leaves",
        "1 cup all-purpose flour, or as needed",
        "salt and ground black pepper to taste",
        "12 (4 ounce) thinly-sliced veal cutlets",
        "24 sage leaves",
        "12 slices prosciutto",
        "3/4 cup Marsala wine",
        "1 tablespoon butter, or to taste",
        "2 hard-boiled eggs, sliced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Veal Saltimbocca",
    "url": "http://allrecipes.com/recipe/245854/veal-saltimbocca/"
}
