{
    "directions": [
        "Soak dried mushrooms in hot water until softened, about 30 minutes.",
        "Remove mushrooms from liquid, reserving it, and rinse mushrooms. Squeeze out excess moisture and coarsely chop. Pour reserved liquid through a paper towel–lined sieve into a bowl to remove grit. Return mushrooms to liquid.",
        "Pat veal dry and season with salt and pepper. Heat 1 teaspoon oil in a 4- to 5-quart heavy pot over moderate heat until hot but not smoking, then brown veal in batches. Transfer as browned to a bowl.",
        "Add 1 teaspoon oil and onion to pot and cook over moderately low heat, stirring frequently, until softened. Add garlic and cook, stirring, until fragrant, about 1 minute. Stir in flour and paprika and cook, stirring, 1 minute. Whisk in soaked mushrooms with liquid, scraping up any brown bits, and tomato paste, then bring to a simmer, whisking. Add veal with any juices.",
        "Cover and simmer over low heat until veal is tender, about 1 1/4 hours.",
        "While meat is simmering, lay peppers on their sides on racks of gas burners and turn flames on high. Roast peppers, turning with tongs, until skins are blistered and blackened in spots, 4 to 5 minutes. (Or cut sides from peppers, discarding seeds and stems, and broil, skin sides up, on rack of a broiler pan about 2 inches from heat.)",
        "Transfer peppers to a bowl, cover, and cool. Peel and seed peppers and cut into 1-inch pieces.",
        "Heat remaining teaspoon oil in a 12-inch nonstick skillet over moderately high heat until hot but not smoking, then sauté mushrooms with salt and pepper to taste, stirring occasionally, until browned and tender, 6 to 8 minutes. Stir into stew with bell peppers and salt and pepper to taste and gently simmer goulash 10 minutes to blend flavors.",
        "Serve over noodles."
    ],
    "ingredients": [
        "1/2 oz dried mushrooms",
        "2 1/2 cups hot water",
        "1 1/4 lb boneless veal shoulder, cut into 1-inch cubes",
        "3 teaspoons olive oil",
        "1 large onion, halved and sliced lengthwise 1/4 inch thick",
        "2 large garlic cloves, minced",
        "1 1/2 tablespoons all-purpose flour",
        "1 tablespoon sweet Hungarian paprika",
        "1 teaspoon tomato paste",
        "2 red bell peppers",
        "1 lb fresh cremini mushrooms, trimmed and halved (quartered if large)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Mushroom",
        "Vegetable",
        "Low Fat",
        "Dinner",
        "Meat",
        "Veal",
        "Spice",
        "Bell Pepper",
        "Fall",
        "Winter",
        "Potluck",
        "Simmer",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Veal, Mushroom, and Red Pepper Goulash",
    "url": "http://www.epicurious.com/recipes/food/views/veal-mushroom-and-red-pepper-goulash-103967"
}
