{
    "directions": [
        "In a large skillet cook the onion in the oil over moderately low heat until it is softened. Add the shallot, the garlic, the bell pepper, and the eggplant and cook the mixture, stirring, for 6 to 8 minutes, or until the eggplant is softened. Stir in the tomato, the herbs de Provence, the sage, the basil, the parsley, the salt, and black pepper to taste, cook the stuffing, stirring, for 1 minute, and let it cool.",
        "With a sharp knife make a 1-inch-long incision along the fat side of each chop and cut a pocket in each chop by moving the knife back and forth carefully through the incision. Stuff each chop with half the stuffing and secure the pocket with wooden picks. Brush the chops with some of the oil and in a roasting pan brushed with the remaining oil roast them in a preheated 475°F. oven, basting them with any pan juices, for 7 minutes on each side, or until they are cooked through but the flesh is still slightly pink near the bone.",
        "Transfer the chops to a cutting board, let them stand for 3 minutes, and discard the wooden picks. Arrange the chops on heated plates, pour the sauce, heated, on the plates, and sprinkle each serving with some of the parsley.",
        "In a blender blend together the bell pepper, the oil, the lemon juice, the vinegar, the cayenne, 1 tablespoon water, and salt and black pepper to taste."
    ],
    "ingredients": [
        "1 small onion, minced",
        "2 tablespoons olive oil",
        "1 1/2 tablespoons minced shallot",
        "2 garlic cloves, minced",
        "1 yellow bell pepper, cut into 1/4-inch pieces (about 1/2 cup)",
        "1/4 pound eggplant, peeled and cut into 1/4-inch pieces (about 1 cup)",
        "1 plum tomato,seeded and chopped fine",
        "1 teaspoon herbs de Provence (available at specialty food shops) or equal parts crumbled dried thyme, rosemary, and savory",
        "1/4 teaspoon dried sage, crumbled",
        "1/4 teaspoon dried basil, crumbled",
        "1 teaspoon finely chopped fresh parsley leaves",
        "1/2 teaspoon salt",
        "two 1-inch-thick rib veal chops, trimmed and the bones frenched (about 3/4 pound)",
        "1 tablespoon vegetable oil",
        "finely fresh parsley leaves for garnish",
        "1 large red bell pepper, roasted (procedure follows) and chopped",
        "2 tablespoons extra-virgin olive oil",
        "3/4 teaspoon fresh lemon juice, or to taste",
        "3/4 teaspoon balsamic vinegar, or to taste",
        "cayenne to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Beef",
        "Roast",
        "Eggplant",
        "Bell Pepper",
        "Gourmet"
    ],
    "title": "Veal Chops with Eggplant and Pepper Stuffing and Roasted Red Pepper Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/veal-chops-with-eggplant-and-pepper-stuffing-and-roasted-red-pepper-sauce-10265"
}
