{
    "directions": [
        "Separately chop onion and mushrooms and mince garlic. Drain and chop canned tomatoes, reserving juice. Finely chop dried tomatoes. In a heavy saucepan cook onion and garlic in oil over moderately low heat, stirring, until softened. Add mushrooms and cook, stirring, until all liquid they give off is evaporated. Add tomato paste, canned tomatoes with reserved juice, and salt and pepper to taste and simmer sauce, covered, stirring occasionally, 30 minutes.",
        "While sauce is simmering, in a non-stick skillet cook veal over moderate heat, stirring, until cooked through. Add veal and dried tomatoes to sauce and simmer 10 minutes. Stir in basil and remove pan from heat. Veal sauce may be made 1 day ahead and chilled, covered. Bring sauce to room temperature before using.",
        "Preheat oven to 375°F.",
        "Cut bell peppers and onions into 1-inch pieces and cut carrots into 1- by 1 1/2-inch sticks. Coarsely chop garlic. In a large shallow baking pan toss vegetables with garlic, oil, and salt and pepper to taste and roast in middle of oven, stirring occasionally, 30 to 35 minutes, or until tender. Vegetables may be roasted 1 day ahead and chilled, covered. Bring vegetables to room temperature before using.",
        "In a bowl stir together ricotta mixture ingredients until combined well.",
        "Lightly oil a 13- by 9-inch glass baking dish. Coarsely shred basil leaves.",
        "Spread about 1 cup veal sauce over bottom of dish and cover with 3 lasagne sheets, making sure they do not touch each other. Drop one third ricotta mixture by spoonfuls over pasta and spread evenly. Top with one third vegetables. Spread about 1 cup sauce over vegetables and sprinkle one third basil over sauce. Make more layers in same manner, beginning and ending with pasta. Spread remaining sauce evenly over top, completely covering pasta, and sprinkle with grated cheeses.",
        "Cover dish tightly with foil, tenting slightly to prevent foil from touching top layer, and bake in middle of oven 40 minutes. Remove foil and bake lasagne 10 minutes more. Let lasagne stand 5 minutes before serving."
    ],
    "ingredients": [
        "1 small onion",
        "1/2 pound mushrooms (about 2 cups)",
        "2 garlic cloves",
        "a 28- to 32-ounce can whole tomatoes",
        "1/4 cup drained dried tomatoes packed in oil",
        "1 1/2 tablespoons olive oil",
        "1/4 cup tomato paste (about half a 6-ounce can)",
        "1/2 pound ground veal",
        "1/4 cup chopped fresh basil leaves",
        "2 large red bell peppers",
        "3 medium onions",
        "4 medium carrots",
        "8 large garlic cloves",
        "2 tablespoons olive oil",
        "2 cups grated mozzarella (about 8 ounces)",
        "a 15-ounce container ricotta (about 1 3/4 cups)",
        "grated Romano or Parmesan",
        "1 large egg",
        "1/4 cup finely chopped fresh parsley leaves",
        "1 cup packed fresh basil leaves",
        "twelve 7- by 3 1/2-inch sheets dry no-boil lasagne",
        "1/2 cup grated mozzarella (about 2 ounces)",
        "1/3 cup grated Romano or Parmesan (about 1 ounce)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Cheese",
        "Pasta",
        "Tomato",
        "Vegetable",
        "Bake",
        "Ricotta",
        "Veal",
        "Carrot",
        "Winter",
        "Gourmet",
        "Ohio"
    ],
    "title": "Veal and Roasted Vegetable Lasagne Anderson",
    "url": "http://www.epicurious.com/recipes/food/views/veal-and-roasted-vegetable-lasagne-anderson-14986"
}
