{
    "directions": [
        "Melt 2 tablespoons butter in heavy medium skillet over medium-high heat. Add mushrooms and tomatoes; sauté 5 minutes. Add onions; sauté 1 minute. Add wine and simmer until liquid is absorbed, about 6 minutes. Stir in 2 tablespoons butter. Season with salt and pepper.",
        "Preheat oven to 400°F. Cut four 1/2-inch-thick lengthwise slices from center of eggplant. Mix oil and 2 teaspoons rosemary; brush over both sides of eggplant slices. Place slices on baking sheet. Sprinkle with salt and pepper. Bake until tender, about 5 minutes per side. Top each eggplant slice with prosciutto slice. Set aside. Maintain oven temperature.",
        "Melt 2 tablespoons butter in heavy large skillet over high heat. Add garlic and 1 teaspoon rosemary; sauté 2 minutes. Sprinkle veal with salt and pepper. Add to skillet and sauté until just cooked through, about 1 minute per side.",
        "Place 1 veal scallop atop each eggplant slice. Spoon mushroom mixture atop veal; top with cheese. Bake until cheese melts, about 5 minutes."
    ],
    "ingredients": [
        "6 tablespoons (3/4 stick) butter",
        "4 cups chopped stemmed shiitake mushrooms (about 8 ounces)",
        "2 cups chopped seeded tomatoes",
        "1/2 cup minced green onions",
        "1/2 cup dry white wine",
        "1 large eggplant",
        "2 tablespoons olive oil",
        "3 teaspoons chopped fresh rosemary",
        "4 1/16-inch-thick slices prosciutto",
        "4 garlic cloves, minced",
        "4 2 1/2-ounce veal scallops",
        "4 6x3-inch slices provolone cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Pork",
        "Sauté",
        "Meat",
        "Veal",
        "Eggplant",
        "Winter",
        "Prosciutto"
    ],
    "title": "Veal with Eggplant and Prosciutto",
    "url": "http://www.epicurious.com/recipes/food/views/veal-with-eggplant-and-prosciutto-105992"
}
