{
    "directions": [
        "1. Preheat the oven to 350°F.",
        "2. Toss the veal with the salt and pepper. Heat 3 tablespoons of oil in a heavy ovenproof casserole. Sauté the veal on all sides over medium-high heat until it is brown. (Do not overcrowd the pan or the veal will not brown.) With a slotted spoon, remove the veal to a platter and set aside.",
        "3. Add the remaining oil to the pan and sauté the onions over medium heat for 3 minutes. Add the garlic and cook for 1 minute more. Stirring with a wooden spoon, add the potato starch and continue to cook for 30 seconds.",
        "4. Stir the chicken broth, wine, carrots, thyme, and rosemary into the onion mixture. Simmer the sauce for 1 minute. Return the veal to the casserole, stir well. Braise the veal, covered, in the oven for 1 1/2 hours, until the meat is very tender when pierced with a fork.",
        "5. While the veal is cooking, heat the remaining oil in a medium skillet. Sauté the mushrooms for 3 minutes and set aside.",
        "6. When the veal is done, remove from the oven, add the mushrooms, and reseason with salt and pepper. Transfer the veal to a serving dish and garnish the top with the chopped parsley."
    ],
    "ingredients": [
        "4 1/2 pounds boneless veal shoulder or round, cut into 1 1/2-inch chunks",
        "1 teaspoon salt",
        "1/2 teaspoon freshly ground black pepper",
        "3 tablespoons plus 2 tablespoons olive or vegetable oil",
        "2 large yellow onions, finely chopped",
        "3 tablespoons potato starch",
        "4 cups chicken broth",
        "1 1/2 cups red wine, Cabernet Sauvignon or Zinfandel",
        "3/4 pound baby carrots",
        "2 tablespoons finely chopped fresh thyme",
        "2 tablespoons finely chopped fresh rosemary",
        "1 1/2 pounds domestic or wild mushrooms, washed, dried, and cut into 1/4-inch slices",
        "Garnish: 2 teaspoons finely chopped curly parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Passover",
        "Rosemary",
        "Veal",
        "Carrot",
        "Red Wine",
        "Spring",
        "Kosher",
        "Thyme"
    ],
    "title": "Veal, Wild Mushrooms, and Red Wine",
    "url": "http://www.epicurious.com/recipes/food/views/veal-wild-mushrooms-and-red-wine-104861"
}
