{
    "directions": [
        "Soak porcini in warm water in a small bowl until softened, about 20 minutes. Lift porcini out, squeezing liquid back into bowl, then rinse porcini (to remove any grit) and cut into 1/2-inch pieces. Pour soaking liquid through a sieve lined with a coffee filter or a dampened paper towel into another small bowl.",
        "Pat veal dry. Toss one fourth of veal in flour. Heat oil in a 4- to 5-quart heavy pot over moderately high heat until hot but not smoking, then shake off excess flour and brown veal, turning, until golden brown, about 3 minutes. Transfer with a slotted spoon to a bowl. Coat and brown remaining veal in 3 batches in same manner.",
        "Add wine to pot and deglaze by boiling, stirring and scraping up brown bits, 1 minute. Stir in veal with any juices accumulated in bowl, porcini and soaking liquid, cream, milk, tomatoes, chile, and rosemary sprigs and simmer, partially covered, stirring occasionally, until veal is very tender, about 1 1/4 hours. Discard rosemary sprigs and chile, then stir in salt."
    ],
    "ingredients": [
        "1 1/4 oz (30 g) dried porcini (1 1/2 cups), rinsed",
        "1 1/2 cups warm water",
        "13/4 lb boneless veal shoulder, cut into 1-inch cubes",
        "3 tablespoons all-purpose flour",
        "1/4 cup extra-virgin olive oil",
        "1 cup dry white wine",
        "1/2 cup heavy cream",
        "1/2 cup whole milk",
        "8 soft dried tomatoes (not packed in oil), cut crosswise into 1/8-inch-thick slices",
        "1 (1 1/2-inch) fresh red or green Thai or serrano chile, halved crosswise",
        "2 (4-inch-long) fresh rosemary sprigs",
        "3/4 teaspoon salt"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mushroom",
        "Tomato",
        "Braise",
        "Rosemary",
        "Veal",
        "White Wine",
        "Winter",
        "Gourmet"
    ],
    "title": "Veal Bocconcini with Porcini and Rosemary",
    "url": "http://www.epicurious.com/recipes/food/views/veal-bocconcini-with-porcini-and-rosemary-107812"
}
