{
    "directions": [
        "In a heavy skillet cook the shallot, the garlic, and the sage in 1 tablespoon of the oil over moderately low heat, stirring, until the shallot is softened, add the mushrooms and salt and pepper to taste, and cook the mixture over moderate heat, stirring, until the mushrooms are tender and all the liquid they give off is evaporated. Add 1/4 cup of the wine, simmer it until it is evaporated, and transfer the mixture to a bowl. Dredge the veal in the seasoned flour, shaking off the excess. In the skillet, cleaned, heat the remaining 1 1/2 tablespoons oil over moderately high heat until it is hot but not smoking and in it sauté the veal for 1 minute on each side, or until it is golden. Transfer the veal to a platter and keep it warm.",
        "Add the remaining 1/2 cup wine to the skillet and deglaze the skillet over moderately high heat, stirring and scraping up the brown bits, until the wine is reduced to glaze. Add the broth, boil the liquid until it is reduced by half, and stir in the cream, the mushroom mixture, and salt and pepper to taste. Simmer the sauce until it is thickened slightly, stir in the parsley, and pour the sauce over the veal."
    ],
    "ingredients": [
        "1/4 cup finely chopped shallot",
        "1 garlic clove, minced",
        "1/2 teaspoon dried sage, crumbled",
        "2 1/2 tablespoons olive oil",
        "1/4 pound fresh shiitake mushrooms, stems discarded and the caps sliced",
        "1/4 pound white mushrooms, sliced",
        "3/4 cup dry white wine",
        "1/2 pound veal scallops (each about 1/8 inch thick)",
        "all-purpose flour seasoned with salt and pepper for dredging the veal",
        "2/3 cup chicken broth",
        "1/4 cup heavy cream",
        "2 tablespoons minced fresh parsley leaves (preferably flat-leafed)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Sauté",
        "Quick & Easy",
        "Veal",
        "White Wine",
        "Summer",
        "Sage",
        "Parsley",
        "Simmer",
        "Gourmet"
    ],
    "title": "Veal Scallops with Mushrooms and Herbs",
    "url": "http://www.epicurious.com/recipes/food/views/veal-scallops-with-mushrooms-and-herbs-12099"
}
