{
    "directions": [
        "Sprinkle veal with salt and pepper. Place panko in large shallow bowl. Place flour in medium bowl. Beat eggs just to blend in another medium bowl. Working in batches, coat veal cutlets in flour, then egg, then panko, pressing gently to adhere. Place on rimmed baking sheet. (Can be prepared 2 hours ahead. Cover and chill.)",
        "Place wine, broth, lemon juice, thyme, and shallots in heavy large skillet. Cook over medium heat until liquid is reduced almost to glaze, about 10 minutes. Add 10 tablespoons butter, 2 tablespoons at a time, whisking constantly and blending well between additions. Whisk in cream. Remove from heat. Cover to keep sauce warm.",
        "Preheat oven to 200°F. Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Working in batches and adding more butter by tablespoonfuls as needed, cook veal until brown and cooked through, about 2 minutes per side. Transfer to another rimmed baking sheet and place in oven to keep warm.",
        "Gently rewarm sauce over medium-low heat, stirring constantly. Divide veal among 4 plates. Drizzle sauce over veal, sprinkle with chives, and serve.",
        "*Available at many supermarkets and at Asian markets."
    ],
    "ingredients": [
        "24 ounces veal scallops, pounded to 1/8-inch thickness",
        "2 cups panko (Japanese breadcrumbs)*",
        "1/2 cup all purpose flour",
        "2 large eggs",
        "1 cup dry white wine",
        "1 cup low-salt chicken broth",
        "1/4 cup fresh lemon juice",
        "1/4 cup fresh thyme leaves",
        "1/4 cup chopped shallots",
        "18 tablespoons (about) chilled butter, cut into tablespoon-size pieces, divided",
        "2 tablespoons whipping cream",
        "2 teaspoons chopped fresh chives"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Beef",
        "Herb",
        "Christmas",
        "Lunch",
        "Lemon",
        "Veal",
        "Fall",
        "Winter",
        "Family Reunion",
        "Thyme",
        "Chive",
        "Shallot",
        "Sugar Conscious"
    ],
    "title": "Veal Cutlets with Thyme Butter Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/veal-cutlets-with-thyme-butter-sauce-234142"
}
