{
    "directions": [
        "Preheat oven to 350°F. Grind mushrooms to powder in coffee or spice mill. Coarsely chop garlic, rosemary, thyme, salt and pepper in processor. Set aside 1 tablespoon garlic mixture; press remainder, 1/2 teaspoon at a time, into center of veal through openings of string (or poke holes in veal and push garlic mixture in). Coat outside of veal with mushroom powder.",
        "Heat oil in heavy large pot over medium-high heat. Add bones and brown well, about 8 minutes. Transfer bones to bowl. Add veal to pot. Brown on all sides, about 5 minutes. Add reserved 1 tablespoon garlic mixture and any remaining mushroom powder to pot around veal and stir 1 minute. Arrange bones around veal. Add broth, wine, tomatoes, tomato paste and vinegar. Bring to boil. Cover; place in oven and roast until veal is tender, turning veal every 30 minutes, about 2 hours. Cool veal uncovered 1 hour. Discard bones. Refrigerate until cold, then cover and keep refrigerated 1 day. Scrape off fat from surface of sauce. Transfer veal to work surface, scraping any sauce back into pot. Remove strings. Cut veal crosswise into scant 1/2-inch-thick slices. Overlap slices in large baking dish. Boil sauce until reduced to 3 1/2 cups, about 20 minutes. Season to taste with salt and pepper. Spoon sauce over veal. (Can be prepared 2 days ahead. Cover with foil and chill.)",
        "Preheat oven to 350°F. Bake veal covered until heated, about 35 minutes."
    ],
    "ingredients": [
        "1 3/4-ounce package dried porcini mushrooms",
        "8 large garlic cloves",
        "1 tablespoon chopped fresh rosemary",
        "1 tablespoon fresh thyme leaves",
        "1 teaspoon kosher salt",
        "1/2 teaspoon ground black pepper",
        "1 5-pound veal shoulder clod roast, tied to hold shape",
        "1/4 cup olive oil",
        "2 pounds meaty veal neck bones",
        "4 cups canned low-salt chicken broth",
        "1/2 cup dry red wine",
        "1/2 cup drained chopped canned tomatoes",
        "3 tablespoons tomato paste",
        "1 tablespoon balsamic vinegar"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Garlic",
        "Mushroom",
        "Tomato",
        "Braise",
        "Passover",
        "Low Carb",
        "Rosh Hashanah/Yom Kippur",
        "Veal",
        "Red Wine",
        "Spring",
        "Kosher"
    ],
    "title": "Veal Shoulder with Porcini Mushrooms, Garlic and Rosemary",
    "url": "http://www.epicurious.com/recipes/food/views/veal-shoulder-with-porcini-mushrooms-garlic-and-rosemary-103266"
}
