{
    "directions": [
        "For sauce: melt butter in heavy large skillet over medium heat. Add leeks, sugar and thyme. Season with salt and pepper. Cook until liquid evaporates and leeks begin to soften, stirring occasionally, about 10 minutes; do not brown. Transfer all but 1 cup leek mixture to bowl and reserve for garnish. Stir remaining leeks, reduce heat to low and cover. Cook until leeks are very soft and lightly caramelized, stirring occasionally, about 20 minutes.",
        "Puree caramelized leeks and stock in blender until smooth. (Can be prepared 1 day ahead. Cover reserved leeks and sauce separately and refrigerate.)",
        "For veal: Preheat broiler. Season veal with thyme and pepper. Melt 3 tablespoons butter in heavy large skillet over medium heat. Add veal and cook until just pink inside, about 4 minutes per side. Transfer to plate and cover to keep warm. Add brandy to skillet and cook until liquid is almost evaporated, scraping up any browned bits. Add cream and leek sauce and bring to simmer. Whisk in 6 tablespoons butter 1 piece at a time. Add cheese and any accumulated meat juices and whisk until smooth. Season with salt and pepper. Divide sauce among broilerproof plates. Top with veal and sprinkle reserved leeks over. Broil until leeks are heated through, about 1 minute."
    ],
    "ingredients": [
        "3 tablespoons unsalted butter",
        "2 1/2 pounds leeks (white and pale green parts only), halved lengthwise, sliced into 1/2-inch pieces (about 6 cups)",
        "1 tablespoon sugar",
        "1 teaspoon dried thyme, crumbled",
        "Salt and freshly ground white pepper",
        "2 1/2 cups chicken stock or canned low-salt broth, boiled until reduced to 1/2 cup",
        "8 1-inch-thick veal loin chops (about 8 ounces each), fat and sinew trimmed",
        "Dried thyme, crumbled",
        "Freshly ground pepper",
        "3 tablespoons unsalted butter",
        "1/4 cup brandy",
        "1/4 cup whipping cream",
        "6 tablespoons unsalted butter, cut into 6 pieces, room temperature",
        "1 1/2 ounces Roquefort cheese, crumbled (about 1/2 cup)",
        "Salt and freshly ground white pepper"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Cheese",
        "Onion",
        "Blue Cheese",
        "Veal",
        "Leek",
        "Spring"
    ],
    "title": "Veal with Leek and Roquefort Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/veal-with-leek-and-roquefort-sauce-1845"
}
