{
    "directions": [
        "Defrost the spinach in the microwave, wring dry and separate.",
        "Heat the EVOO in a pan over medium-high heat. Pat the meat dry, and then add to the pan and lightly brown while you crumble. Sprinkle with salt and pepper. Add the onions and garlic and cook 10 minutes more, stirring occasionally. Deglaze the pan with the wine, stir and add 2 cups tomato puree. Stir, reduce heat to a low simmer and simmer 15 to 20 minutes.",
        "Pour the remaining 2 cups tomato puree into a casserole.",
        "Melt the butter in saucepot over medium to medium-high heat. Whisk in the flour for 1 minute. Then add the milk, bring to a bubble, season with salt, pepper and nutmeg, and cook until it's thick enough to coat a spoon. Stir in the soft cheese.",
        "Working over the casserole dish, fill the manicotti with the meat using a spoon. Top the manicotti with the white sauce and Parmesan. Cover with parchment and foil and cool or bake off. Bake, covered, at 375 degrees F for 40 minutes from fresh, or bake 1 hour from cold to heat through and cook the pasta. Then uncover and bake until brown and bubbly, about 20 minutes more."
    ],
    "ingredients": [
        "1 package organic chopped spinach",
        "2 tablespoons EVOO",
        "2 pounds ground veal or ground turkey breast",
        "Salt and pepper",
        "1 medium onion, very finely chopped",
        "4 cloves garlic, minced or finely chopped",
        "1/2 cup dry white wine",
        "4 cups passata (Italian tomato puree in glass jars) or canned tomato puree",
        "4 tablespoons butter",
        "3 tablespoons flour",
        "2 cups milk",
        "Nutmeg",
        "1 box manicotti pasta tubes",
        "One 5-ounce container soft cheese with herbs, such as Boursin",
        "1 cup shredded Parmigiano-Reggiano"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Pasta Recipes",
        "Cheese",
        "Parmesan Cheese Recipes",
        "Spinach",
        "Vegetable",
        "Poultry Recipes",
        "Turkey Recipes",
        "Meat",
        "Veal",
        "Main Dish Recipes"
    ],
    "title": "Veal or Turkey and Spinach Manicotti",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/veal-or-turkey-and-spinach-manicotti-recipe"
}
