{
    "directions": [
        "Preheat oven to 450°F.",
        "Arrange veal bones in 1 layer in an oiled large roasting pan and roast in middle of oven, turning once or twice, until browned, 30 to 45 minutes. Leave oven on.",
        "Transfer bones with tongs to a tall, narrow 7- to 8-quart stockpot and add 4 quarts water. Discard fat from roasting pan, then immediately add 1/2 cup water to hot pan, stirring and scraping up brown bits, and add to stockpot. Bring liquid to a tremble (bare simmer; about 190°F) and cook, skimming froth frequently during first hour, about 10 hours (use a flame tamer for lowest heat if necessary).",
        "While stock is cooking, wash leeks in a bowl of cold water, then lift out and drain well. Oil roasting pan again and spread leeks, carrots, onions, and celery in 1 layer. Roast in middle of oven, stirring once or twice, until golden brown, 20 to 30 minutes. Transfer vegetables to a bowl and immediately add remaining 1/2 cup water to hot pan, stirring and scraping up brown bits, then add to stockpot. Cool vegetables and chill, covered.",
        "Add roasted vegetables and remaining ingredients to stockpot for last 2 hours of cooking.",
        "Remove bones with tongs and discard. Pour stock in batches through a large fine sieve into a 4-quart pot, discarding solids. Cool stock, uncovered, and chill, covered, then scrape congealed fat from chilled stock. If you end up with more than 8 cups stock, simmer it, skimming froth, to reduce. If you have less, add water."
    ],
    "ingredients": [
        "5 lb veal knuckle bones",
        "4 qt plus 1 cup water",
        "2 large leeks, cut into 1-inch pieces",
        "1/2 lb carrots, cut into 1-inch pieces",
        "1/2 lb onions, cut into 1-inch pieces",
        "2 celery ribs, cut into 1-inch pieces",
        "1 tablespoon tomato paste",
        "2 fresh thyme sprigs",
        "2 large sprigs fresh flat-leaf parsley",
        "1 bay leaf (not California)",
        "1/2 tablespoon black peppercorns"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Onion",
        "Roast",
        "Veal",
        "Leek",
        "Carrot",
        "Thyme",
        "Parsley",
        "Simmer",
        "Gourmet"
    ],
    "title": "Veal Stock",
    "url": "http://www.epicurious.com/recipes/food/views/veal-stock-105520"
}
