{
    "directions": [
        "Melt 3 tablespoons butter in heavy small skillet over medium-high heat. Add onion and sauté until light brown, about 7 minutes. Remove from heat; cool.",
        "Mix veal, breadcrumbs, eggs, 1/4 cup milk, salt, pepper, nutmeg and sautéed onion in large bowl until well blended. Form mixture into 24 meatballs (about 3 tablespoons of veal mixture in each).",
        "Heat oil in large nonstick skillet over medium-high heat. Working in batches, add meatballs to skillet and cook until brown on all side, turning often, about 8 minutes. Using slotted spoon, transfer meatballs to paper towels to drain.",
        "Cook carrots in pot of boiling salted water until almost tender, about 6 minutes. Drain; rinse under cold water. Drain thoroughly.",
        "Melt 4 tablespoons butter in heavy large Dutch oven over medium-low heat. Add flour; stir 3 minutes (do not brown). Gradually whisk in 2 cups milk and broth. Bring to simmer, whisking constantly. Simmer until mixture is thick and smooth, whisking often, about 8 minutes. Whisk in cream and mustard. Bring to simmer. Season with salt and pepper. Add meatballs and carrots. Cover; simmer until meatballs are just cooked through, about 5 minutes. Remove from heat. (Can be made 1 day ahead. Cover and chill. Rewarm over medium heat). Stir in chopped dill; cover and let stand 1 minute. Transfer to bowl. Garnish with dill sprigs and serve."
    ],
    "ingredients": [
        "7 tablespoons unsalted butter",
        "2/3 cup minced onion",
        "2 pounds ground veal",
        "3/4 cup fresh white breadcrumbs",
        "2 large eggs, beaten to blend",
        "2 1/4 cups whole milk",
        "1 teaspoon salt",
        "3/4 teaspoon ground black pepper",
        "1/2 teaspoon ground nutmeg",
        "2 tablespoons vegetable oil",
        "1 pound baby carrots, peeled",
        "1/4 cup all purpose flour",
        "1 cup canned chicken broth",
        "1 cup whipping cream",
        "2 tablespoons Dijon mustard",
        "3 tablespoons chopped fresh dill or 1 tablespoon dried dillweed",
        "Fresh dill sprigs"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Mustard",
        "Sauté",
        "Veal",
        "Carrot",
        "Dill"
    ],
    "title": "Veal Meatballs and Baby Carrots in Dilled Cream Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/veal-meatballs-and-baby-carrots-in-dilled-cream-sauce-870"
}
