{
    "directions": [
        "Char peppers over gas flame or in broiler until blackened on all sides. Wrap in paper bag; let stand 10 minutes. Peel peppers. Cut lengthwise into quarters; seed and stem peppers. Trim edges of peppers to flatten all sides if necessary.",
        "Stir cream cheese and goat cheese in small bowl to blend.",
        "Butterfly veal by staring at 1 long side of veal and cutting horizontally to within 1 inch of opposite long side. Open veal as for book. Place large sheet of plastic wrap over cut surface of veal. Using meat pounder or rolling pin, pound veal to generous 1/2-inch even thickness, forming rectangle approximately 10 X 12 inches. Season with salt and pepper.",
        "Blanch arugula in saucepan of boiling water just until wilted, about 2 seconds. Drain; rinse with cold water. Drain well on paper towels; pat dry. Repeat blanching process with basil leaves. Overlap arugula leaves down center of veal, forming 2-inch-wide by 12-inch-long strip. Cover with half of bell peppers, skinned side down. Top with tomatoes, arranged in 2 rows.",
        "Set aside 1/4 cup cheese mixture for sauce. Spoon remaining cheese mixture in even log atop tomatoes. Arrange remaining bell peppers, skinned side up over cheese. Arrange blanched basil leaves over peppers.",
        "Fold 1 long side of veal over filling. Tightly roll up veal jelly roll style. Cover ends of veal roll with heavy-duty aluminum foil to enclose filling completely. Tie kitchen string around veal roll every 1 1/2 inches to maintain neat log shape. Wrap string lengthwise around veal roll to secure foil at ends, weaving string alternately under and over crosswise ties. Cover veal roll and reserved 1/4 cup cheese mixture separately; refrigerate until well chilled,at least 6 hours. (Can be prepared 1 day ahead. Keep refrigerated.)",
        "Preheat oven to 375°F. Melt butter in heavy large shallow roasting pan over medium-high heat. Season veal with salt and pepper. Place veal in pan and brown on all sides, turning frequently, about 10 minutes. Remove pan from heat; cool veal 15 minutes. Drape bacon slices over veal, tucking ends under veal.",
        "Roast veal until thermometer inserted into center of meat (not filling) registers 140°F, about 45 minutes. Transfer to work surface. Let stand 15 minutes.",
        "Combine broth and shallots in heavy medium saucepan. Boil over high heat until mixture is reduced to 1/2 cup, about 20 minutes. Whisk in lemon juice and capers. Reduce heat to low; gradually whisk in butter, then reserved 1/4 cup cheese mixture and parsley. Season sauce to taste with salt and pepper.",
        "To serve, remove bacon, string and foil from veal roast. Cut veal roast crosswise into even slices. Spoon a few tablespoons sauce onto each plate. Top with 2 veal slices."
    ],
    "ingredients": [
        "2 large yellow bell peppers",
        "1 3-ounce package cream cheese with chives, room temperature",
        "1 5.3-ounce package basil and roasted garlic goat cheese or 6 ounces soft fresh goat cheese (such as Montrachet), room temperature",
        "1 4 3/4-pound center-cut veal rib roast (also known as rack of veal), boned, trimmed of all fat and outer membrane",
        "1 bunch fresh arugula, stems trimmed",
        "16 large fresh basil leaves",
        "14 oil-packed sun-dried tomatoes, drained",
        "2 tablespoons (1/4 stick) butter",
        "8 bacon slices",
        "2 3/4 cups canned low-salt chicken broth",
        "3 medium shallots, finely chopped",
        "1/4 cup fresh lemon juice",
        "2 tablespoons drained capers",
        "1/2 cup (1 stick) butter, cut into pieces, room temperature",
        "2 tablespoons chopped fresh Italian parsley"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Cheese",
        "Herb",
        "Pepper",
        "Roast",
        "Low Carb",
        "Cream Cheese",
        "Goat Cheese",
        "Basil",
        "Veal",
        "Bell Pepper",
        "Fall"
    ],
    "title": "Veal Loin Stuffed with Bell Peppers, Goat Cheese and Basil",
    "url": "http://www.epicurious.com/recipes/food/views/veal-loin-stuffed-with-bell-peppers-goat-cheese-and-basil-1052"
}
