{
    "directions": [
        "Cook asparagus in large pot of boiling salted water until crisp-tender, about 3 minutes. Drain. Place asparagus in large bowl of ice water to cool. Drain; pat dry.",
        "Spray medium nonstick skillet with nonstick spray. Heat skillet over medium heat. Add shallots and sauté 1 minute. Add peas and sauté 2 minutes. Add broth. Bring to simmer. Transfer mixture to blender. Add 1 teaspoon tarragon. Purée until smooth, about 3 minutes. Season pea coulis with salt and pepper.",
        "Pound each veal piece between sheets of plastic wrap to scant 1/4-inch thickness. (Can be prepared 1 day ahead. Wrap asparagus in paper towels. Cover asparagus, pea coulis and veal separately and refrigerate.)",
        "Spray 2 large nonstick skillets with nonstick spray. Heat over medium-high heat. Sprinkle veal with salt and pepper. Working in batches, add veal to skillets; sauté until brown and just cooked through, about 2 minutes per side. Transfer veal to platter. Tent with foil.",
        "Divide asparagus and remaining 2 teaspoons tarragon between same 2 skillets. Sauté over medium-high heat until asparagus is heated through, about 2 minutes. Rewarm coulis in heavy small saucepan over medium-low heat.",
        "Spoon 3 tablespoons pea coulis onto each of 6 plates. Place veal atop coulis. Arrange asparagus alongside veal."
    ],
    "ingredients": [
        "1 1/4 pounds slender asparagus spears, trimmed",
        "Nonstick vegetable oil spray",
        "1/4 cup finely chopped shallots",
        "2 cups frozen petite peas (about 9 ounces), thawed",
        "3/4 cup canned low-salt chicken broth",
        "3 teaspoons minced fresh tarragon",
        "6 3-ounce boneless veal round cutlets, each cut into 3 pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Vegetable",
        "Sauté",
        "Low Fat",
        "Dried Fruit",
        "Apricot",
        "Asparagus",
        "Green Bean",
        "Spring",
        "Healthy"
    ],
    "title": "Veal Scaloppine with Spring Pea Coulis and Asparagus",
    "url": "http://www.epicurious.com/recipes/food/views/veal-scaloppine-with-spring-pea-coulis-and-asparagus-101385"
}
