{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Spread bread crumbs in a shallow baking pan and toast 8 to 10 minutes. Reduce oven temperature to 200°F.",
        "Whisk together oil, juice, pepper, and 1/2 teaspoon salt in a large bowl until combined, then stir in tomatoes and onion.",
        "Gently pound cutlets to 1/8-inch thickness between 2 sheets of plastic wrap with flat side of a meat pounder or with a rolling pin. Sprinkle veal all over with remaining 1/2 teaspoon salt and season with pepper.",
        "Stir together bread crumbs and cheese in a large shallow bowl. Lightly beat eggs in another large shallow bowl. Dip veal, 1 piece at a time, in egg, letting excess drip off, then dredge in bread crumbs, coating completely, and arrange in 1 layer on a sheet of wax paper.",
        "Heat 3 tablespoons vegetable oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then fry 2 cutlets, turning over once, until golden brown and just cooked through, about 6 minutes total. Transfer to paper towels to drain briefly, then transfer to baking pan and keep warm in oven. Add remaining 3 tablespoons oil to skillet and fry remaining cutlets.",
        "Add arugula and basil to tomato mixture and toss, then season with salt and pepper. 3Serve veal topped with salad."
    ],
    "ingredients": [
        "3 cups fine fresh bread crumbs (from 6 slices firm white sandwich bread)",
        "6 tablespoons olive oil",
        "3 tablespoons fresh lemon juice",
        "1 teaspoon black pepper",
        "1 teaspoon salt",
        "2 medium tomatoes (1/8 lb total), cut into 1/2-inch-thick wedges",
        "1 small red onion, halved lengthwise, then thinly sliced crosswise (1/2 cup)",
        "4 veal cutlets (1 1/4 lb total)",
        "2 oz finely grated Parmigiano-Reggiano (1 cup)",
        "2 large eggs",
        "6 tablespoons vegetable oil",
        "10 oz arugula (5 cups), leaves torn if large",
        "1 cup loosely packed fresh basil leaves, torn into bite-size pieces"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Bake",
        "Fry",
        "Quick & Easy",
        "Parmesan",
        "Basil",
        "Veal",
        "Arugula",
        "Summer",
        "Gourmet"
    ],
    "title": "Veal Cutlets with Arugula and Tomato Salad",
    "url": "http://www.epicurious.com/recipes/food/views/veal-cutlets-with-arugula-and-tomato-salad-109642"
}
