{
    "directions": [
        "Put oven rack in middle position and preheat oven to 350°F.",
        "Spread bread crumbs in a shallow baking pan and toast, stirring once or twice, until golden, 8 to 10 minutes.",
        "Gently pound veal cutlets to slightly less than 1/8 inch thick between 2 sheets of plastic wrap with flat side of a meat pounder or with a rolling pin, then cut into roughly 4- by 3-inch pieces.",
        "Stir together parsley, garlic, 3/4 cup cheese, 1/4 cup oil, and 1/2 teaspoon pepper until a paste forms.",
        "Stir together bread crumbs, remaining 1/2 cup cheese, and remaining 1/2 teaspoon pepper.",
        "Season cutlets lightly with salt and pepper and spread 1 side of each piece with 1 teaspoon parsley-garlic paste.",
        "Line a baking sheet with wax paper. Roll up veal pieces (paste sides up), starting from a short side. Put remaining cup oil in a bowl and dip each roll in it, letting excess drip off, then dredge in bread-crumb mixture, pressing gently to help crumbs adhere. Transfer to baking sheet.",
        "Thread 1 veal roll onto a skewer, then 1 piece of onion, leaving about 1/4 inch between. Repeat on same skewer 2 more times, then transfer skewer to baking sheet. Assemble 6 more skewers in same manner (last skewer will have only 2 rolls).",
        "Prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is hot when you can hold your hand 5 inches above rack for 1 to 2 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderately high.",
        "Grill veal on a lightly oiled grill rack, covered only if using gas grill, turning over once, until rolls are golden, about 6 minutes total.",
        "Remove veal and onion from skewers and serve immediately."
    ],
    "ingredients": [
        "4 cups fine fresh bread crumbs (from 10 slices firm white sandwich bread)",
        "2 lb veal cutlets (no more than 1/4 inch thick)",
        "1/2 cup chopped fresh flat-leaf parsley",
        "5 garlic cloves, minced",
        "4 1/2 oz finely grated Pecorino Romano or Parmigiano-Reggiano (1 1/4 cups)",
        "1 1/4 cups olive oil",
        "1 teaspoon black pepper",
        "1 large white onion, cut into 8 wedges and layers separated",
        "Special equipment: 7 (10- to 12-inch) metal skewers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Backyard BBQ",
        "Parmesan",
        "Meat",
        "Veal",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Veal Involtini",
    "url": "http://www.epicurious.com/recipes/food/views/veal-involtini-232001"
}
