{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Spread cauliflower, onions, and garlic onto a large baking sheet. Spray canola oil spray over cauliflower mixture.",
        "Bake in the preheated oven until browned and tender, 30 to 45 minutes. Transfer cauliflower mixture to a 9x13-inch baking dish. Reduce oven temperature to 300 degrees F (150 degrees C).",
        "Blend soy milk, tofu, vegan cheese, nutritional yeast, onion powder, lemon juice, basil, marjoram, oregano, parsley, garlic powder, and black pepper in a food processor or blender until sauce is creamy.",
        "Pour sauce into a saucepan and cook over medium-low heat until warmed, about 5 minutes. Add kale to sauce and cook until kale is wilted, about 5 minutes. Pour sauce over cauliflower mixture and add tomatoes; mix well.",
        "Bake in the oven until bubbling and lightly browned, about 40 minutes."
    ],
    "ingredients": [
        "Roasting:",
        "2 large heads cauliflower, cut into pieces",
        "2 large red onions, cut into wedges",
        "2 cloves garlic, chopped, or more to taste",
        "canola oil cooking spray (optional)",
        "Cream Sauce:",
        "2 cups plain soy milk",
        "1 (14 ounce) package firm tofu, cut into cubes",
        "1/2 (8 ounce) package shredded mozzarella-style vegan cheese (such as Daiya®)",
        "1/4 cup nutritional yeast",
        "2 tablespoons onion powder",
        "1 tablespoon lemon juice, or more to taste",
        "1 tablespoon dried basil",
        "1 tablespoon dried marjoram",
        "1 tablespoon dried oregano",
        "1 tablespoon dried parsley",
        "1 teaspoon garlic powder",
        "1 teaspoon ground black pepper, or more to taste",
        "3 large large kale leaves, minced, or more to taste",
        "1 cup cherry tomatoes, halved"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vegan Cauliflower Alfredo",
    "url": "http://allrecipes.com/recipe/241369/vegan-cauliflower-alfredo/"
}
