{
    "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place sunflower seeds in a bowl and pour in enough water to cover; soak for about 10 minutes.",
        "Mix 1 1/2 cans coconut milk, 1/4 cup curry paste, 1/4 cup cilantro, juice of 1 lime, and 1/2 teaspoon salt together in a saucepan; cook and stir over medium-low heat until curry sauce is thickened, about 5 minutes.",
        "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain and mix pasta into curry sauce; cook and stir over low heat.",
        "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add broccoli, cover, and steam until tender, about 2 minutes. Season broccoli with salt and curry powder and transfer to a 9x13-inch baking dish.",
        "Drain sunflower seeds and place in a blender with remaining coconut cream, remaining curry paste, remaining cilantro, juice of 1 lime, nutritional yeast, and sugar; blend until thick and smooth.",
        "Spoon pasta mixture over broccoli. Pour sunflower seed mixture over pasta and stir to coat evenly.",
        "Bake in the preheated oven until sauce is bubbling, about 10 minutes."
    ],
    "ingredients": [
        "1 1/2 cups sunflower seeds",
        "2 (14 ounce) cans coconut milk, divided",
        "1/2 cup red curry paste, or more to taste, divided",
        "1/2 cup chopped fresh cilantro, or more to taste, divided",
        "2 limes, juiced, divided",
        "1/2 teaspoon salt, plus more for seasoning",
        "1 (8 ounce) package elbow macaroni",
        "1 (8 ounce) package broccoli florets",
        "1 pinch curry powder, or more to taste",
        "3 tablespoons nutritional yeast",
        "1 teaspoon white sugar"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vegan Thai Mac n Cheese",
    "url": "http://allrecipes.com/recipe/244384/vegan-thai-mac-n-cheese/"
}
