{
    "directions": [
        "Place potatoes into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and transfer to a large bowl. Allow to cool to room temperature, about 30 minutes.",
        "Run 1/2 cup spinach through a juicer according to manufacturer's instructions; add to cooled potatoes and mash until smooth.",
        "Pulse remaining spinach in a food processor until finely chopped. Add to mashed potatoes.",
        "Heat 1 tablespoon oil in a large skillet over medium heat. Add onion and garlic; cook and stir until fragrant, about 5 minutes. Let cool slightly, about 10 minutes. Stir into mashed potatoes.",
        "Mix water and flaxseed meal together in a small bowl; let sit until thickened, about 5 minutes. Add to mashed potatoes with baking powder and salt; mix to combine. Form into patties. Dust both sides of patties generously with flour.",
        "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper.",
        "Heat 1 tablespoon oil in a large skillet over medium heat. Cook patties in batches until a pale crust forms, about 3 minutes per side. Repeat with remaining 1 tablespoon oil and patties. Transfer pan-fried patties to baking sheet.",
        "Bake in the preheated oven until golden brown and cooked through, about 10 minutes."
    ],
    "ingredients": [
        "1 pound Idaho potatoes, peeled and cut into 2-inch chunks",
        "2 bunches fresh spinach, divided",
        "3 tablespoons canola oil, divided, or more as needed",
        "1 onion, minced",
        "3 cloves garlic, minced",
        "3 tablespoons water",
        "1 tablespoon flaxseed meal",
        "1 teaspoon baking powder",
        "1/2 teaspoon salt",
        "1/4 cup all-purpose flour"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vegan Spinach Bites",
    "url": "http://allrecipes.com/recipe/245827/vegan-spinach-bites/"
}
