{
    "directions": [
        "Bring a large pot of water to a boil.",
        "Put the cauliflower and 1 cup water in a small saucepan over medium heat. Cover, bring to a simmer and cook until the cauliflower is fully softened, about 20 minutes. Transfer the cooked cauliflower and all the cooking liquid to a food processor and set aside. Wipe out the saucepan.",
        "Heat the oil in the saucepan over medium heat. Add the shallot and garlic and cook, stirring, until softened, about 3 minutes. Stir in the lemon juice, miso, mustard, 1 teaspoon salt, 3/4 teaspoon black pepper, cayenne and turmeric until well combined. Gradually whisk in the almond milk, nutritional yeast and brown sugar and bring just to a simmer. Remove from heat.",
        "Process the cauliflower until smooth. With the food processor running, gradually add the warm almond milk mixture and process until extra creamy.",
        "Transfer the cauliflower-almond milk mixture to a large saucepan over medium heat, add the vegan Cheddar and stir occasionally until it melts.",
        "Meanwhile, add the elbow macaroni to the boiling water and cook according to package directions. Strain, reserving 1 cup of pasta water.",
        "Add the pasta to the sauce and stir to combine. Stir in some of the reserved pasta cooking liquid to reach your desired consistency. Add salt to taste. Serve hot with hot sauce on the side if using."
    ],
    "ingredients": [
        "3 cups small cauliflower florets, chopped",
        "2 teaspoons extra-virgin olive oil",
        "1 large shallot, minced",
        "1 large clove garlic, minced",
        "Juice of 1 small lemon (about 2 tablespoons)",
        "1 tablespoon white or yellow miso paste",
        "2 teaspoons spicy mustard",
        "Kosher salt and freshly ground black pepper",
        "1/2 teaspoon ground cayenne pepper",
        "1/8 teaspoon ground turmeric",
        "3/4 cup plain unsweetened almond or other plant-based milk",
        "1/4 cup nutritional yeast flakes",
        "2 teaspoons packed brown sugar",
        "10 ounces shredded vegan Cheddar (about 2 1/2 cups)",
        "1 pound elbow macaroni",
        "Hot sauce, for serving, optional"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Vegan",
        "Healthy",
        "Macaroni and Cheese",
        "Low-Fat",
        "High Fiber",
        "Low-Cholesterol"
    ],
    "title": "Vegan Mac 'n' Cheese",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/vegan-mac-n-cheese"
}
