{
    "directions": [
        "Preheat the oven to 350 degrees F. Line a 12-cup muffin tin with paper liners and spray the liners with nonstick cooking spray.",
        "For the cake: Whisk together the flour, granulated sugar, baking powder, baking soda and salt in a medium bowl. Whisk together the almond milk, brown sugar, oil and vanilla in another medium bowl. Add the almond milk mixture to the flour mixture and gently fold until just combined (it's OK if there are lumps). Divide the batter evenly among the prepared liners.",
        "Bake the cupcakes until they are golden brown and bounce back when pressed and a toothpick inserted in the center comes out clean, 20 to 22 minutes. Let cool in the pan for a few minutes, then transfer to a rack to cool completely.",
        "For the frosting: Beat the margarine on medium-high in the bowl of a stand mixer fitted with a paddle attachment (or in a large bowl if using a hand mixer) until smooth, about 1 minute. Add the confectioners' sugar, almond milk and vanilla and beat on low until the frosting comes together and is smooth, about 1 minute.",
        "Frost and decorate the cupcakes as desired."
    ],
    "ingredients": [
        "Nonstick cooking spray",
        "2 1/4 cups all-purpose flour",
        "1 cup granulated sugar",
        "1 1/2 teaspoons baking powder",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon kosher salt",
        "1 1/2 cups unsweetened vanilla almond milk (refrigerated, not shelf stable)",
        "1/2 cup packed light brown sugar",
        "1/2 cup vegetable oil",
        "2 teaspoons pure vanilla extract",
        "1/2 cup vegan margarine",
        "3 cups confectioners' sugar",
        "2 tablespoons unsweetened vanilla almond milk",
        "1/2 teaspoon pure vanilla extract"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Baking",
        "Dessert",
        "Healthy",
        "Vegan",
        "Cupcake"
    ],
    "title": "Vegan Vanilla Cupcakes",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/vegan-vanilla-cupcakes"
}
