{
    "directions": [
        "Position an oven rack in the middle of the oven; preheat the oven to 400 degrees F.",
        "Cut each squash in half lengthwise and scoop out and discard the seeds. Arrange the halves in a large baking dish, flesh-side up.",
        "Whisk together the vinegar, 2 tablespoons of the oil and the maple syrup in a cup. Brush the flesh side of the squash halves with some of the maple mixture and sprinkle with 1/4 teaspoon salt and a few grinds of pepper. Put the squash flesh-side down in the baking dish, then brush the skin side with maple mixture and sprinkle with 1/4 teaspoon salt and a few grinds of pepper. Roast until the squash is fork-tender, 50 to 60 minutes. Poke the inside of the squash halves with a fork and brush generously with more of the maple mixture.",
        "Meanwhile, heat the remaining 1 tablespoon oil in a medium saucepan over medium-high heat. Add the onions and cook, stirring occasionally, until soft and golden brown, about 6 minutes. Add the quinoa, curry powder, cinnamon, and 1 teaspoon salt and stir until the spices are toasted, about 1 minute. Add 2 cups water and bring to a simmer. Lower the heat, cover the pan and simmer, stirring occasionally, until the quinoa is tender and most of the liquid is absorbed, 20 to 24 minutes. Remove from the heat and let sit, covered, for 5 minutes. Uncover and stir in the cranberries, remaining maple mixture, half of the parsley and half of the pistachios.",
        "Stuff the squash halves with the quinoa and sprinkle with the remaining parsley and pistachios. Serve warm or at room temperature."
    ],
    "ingredients": [
        "2 medium acorn squash (2 to 2 1/4 pounds each)",
        "3 tablespoons apple cider vinegar",
        "3 tablespoons olive oil",
        "2 tablespoons pure maple syrup",
        "Kosher salt and freshly ground black pepper",
        "1 small onion, chopped",
        "1 cup red quinoa, rinsed well",
        "1 teaspoon mild curry powder",
        "1/2 teaspoon ground cinnamon",
        "1/4 teaspoon cayenne pepper",
        "1/4 cup dried cranberries",
        "1 cup loosely packed fresh parsley leaves, chopped",
        "1/4 cup roasted, salted and shelled pistachios, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Squash",
        "Vegetable",
        "Grain Recipes",
        "Quinoa",
        "Cranberry",
        "Fruit",
        "Nut Recipes",
        "Main Dish Recipes",
        "Gluten Free",
        "Low-Cholesterol",
        "High Fiber"
    ],
    "title": "Vegan Quinoa-Cranberry Stuffed Acorn Squash",
    "url": "http://www.foodnetwork.com/recipes/food-network-kitchen/vegan-quinoa-cranberry-stuffed-acorn-squash"
}
