{
    "directions": [
        "Cook the pasta according to package directions until al dente, then drain.",
        "Meanwhile, heat the oil, broth, or water in a small skillet. Add the garlic and sauté over low heat for 2 to 3 minutes, until golden. Remove from heat.",
        "Combine the sautéed garlic and any oil or broth that remains in the skillet with the tofu and rice milk in a food processor. Process until completely smooth and creamy.",
        "Combine the pasta and tofu mixture in a large serving bowl and toss together. Season with pepper and taste to see if you’d like to add salt. If the mixture needs to be moister, add a small amount of additional rice milk and toss again.",
        "If desired, spoon the parsley, steamed broccoli, spinach, and sun-dried tomatoes over the pasta or on the side; serve at once.",
        "Clean, stem, and slice 1 to 1 1/2 pounds mushrooms. I like to combine a couple of medium-size portobello caps, thinly sliced, with some baby bellas (also known as cremini). A small amount of shiitake mushrooms added to the mix is nice, too. Start by sautéing a finely chopped medium onion in a tablespoon of olive oil or vegetable broth in a medium skillet (or in enough water or broth to keep the skillet moist) until golden. Add the mushrooms and cover. Cook until they’ve wilted down to your liking, about 5 to 8 minutes. If there’s plenty of liquid in the pan from the mushrooms, rather than drain it, thicken it with a couple of teaspoons of cornstarch dissolved in water or vegetable broth. To serve, ladle some of the mushroom mixture on top of individual servings of the pasta. Top with plenty of minced parsley and, for added plant power, some steamed fresh or frozen green peas.",
        "Give this dish some plant-based “beefiness” courtesy of seitan. Follow the recipe above, adding 8 to 16 ounces chopped seitan once the onion is translucent. Drizzle in a tablespoon or two of soy sauce. Cook over medium-high heat until the seitan is lightly browned, stirring often. Then proceed with the mushrooms, following the instructions for regular mushroom stroganoff above."
    ],
    "ingredients": [
        "10–12 ounces pasta of your choice",
        "1 tablespoon extra-virgin olive oil or 3 tablespoons vegetable broth or water",
        "2–3 cloves garlic, minced",
        "1 (12.3-ounce) package firm silken tofu",
        "1/2 cup unsweetened rice milk or other unsweetened nondairy milk",
        "Freshly ground pepper to taste",
        "1 teaspoon salt, or to taste",
        "Minced fresh parsley, steamed broccoli florets, wilted spinach, sliced sun-dried tomatoes"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "HarperCollins",
        "Vegan",
        "Vegetarian",
        "Pasta",
        "Dinner",
        "Tofu",
        "Mushroom"
    ],
    "title": "Vegan Pasta Alfredo With Two Stroganoff Variations",
    "url": "http://www.epicurious.com/recipes/food/views/vegan-pasta-alfredo-with-stroganoff"
}
