{
    "directions": [
        "Cook onion, garlic, and red pepper flakes in oil in a small heavy saucepan over moderate heat, stirring, until pale golden, about 4 minutes. Whisk in remaining sauce ingredients. Simmer, whisking, 1 minute, then cool.",
        "Cover noodles with boiling-hot water and soak 15 minutes, then drain well in a sieve. Pat dry between paper towels and toss with vinegar and salt to taste.",
        "Put a double thickness of paper towel on a work surface and fill a shallow baking pan with warm water. Soak 1 rice-paper round (make sure there are no holes) in warm water until pliable, 30 seconds to 1 minute, then transfer to paper towels.",
        "Arrange 1 piece of lettuce on bottom half of soaked rice paper, folding or tearing to fit and leaving a 1-inch border along edge. Spread one fourth of peanut sauce over lettuce and top with one fourth each of mint, basil, cabbage, and noodles. Roll up rice paper tightly around filling and, after rolling halfway, arrange one fourth of cilantro and carrot along crease. Then fold in sides and continue rolling. Transfer summer roll to a plate and cover with dampened paper towels.",
        "Make 3 more rolls in same manner. Serve rolls halved on the diagonal."
    ],
    "ingredients": [
        "3 tablespoons finely chopped onion",
        "1 small garlic clove, minced",
        "3/4 teaspoon dried hot red pepper flakes",
        "1 teaspoon vegetable oil",
        "3 tablespoons water",
        "1 tablespoon creamy peanut butter",
        "1 tablespoon hoisin sauce",
        "1 teaspoon tomato paste",
        "3/4 teaspoon sugar",
        "1 ounce bean thread noodles (cellophane noodles)",
        "1 tablespoon seasoned rice vinegar",
        "4 (8-inch) rice-paper rounds, plus additional in case some tear",
        "2 red-leaf lettuce leaves, ribs cut out and discarded and leaves halved",
        "1/4 cup fresh mint leaves",
        "1/4 cup fresh basil leaves (preferably Thai)",
        "1/2 cup thinly sliced Napa cabbage",
        "1/4 cup fresh cilantro leaves",
        "1/3 cup coarsely shredded carrot (1 medium)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pasta",
        "Vegetable",
        "Low Fat",
        "Vegetarian",
        "Buffet",
        "Mint",
        "Basil",
        "Peanut",
        "Spring",
        "Summer",
        "Healthy",
        "Vegan",
        "Cabbage",
        "Cilantro",
        "Gourmet"
    ],
    "title": "Vegetable Summer Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-summer-rolls-105012"
}
