{
    "directions": [
        "Slit chiles open and remove seeds and veins. Heat a flat griddle or dry heavy skillet (not nonstick) over medium heat until hot, then toast the chiles, opened flat, 2 at a time, by pressing down and turning on either side with tongs, until fragrant and insides change color, about 1 minute.",
        "Put chiles in a bowl with cold water to cover and let soak until soft, about 20 minutes.",
        "While chiles are soaking, cook onion in oil in a 5- to 6-quart heavy pot over medium heat, stirring occasionally, until golden, 15 to 20 minutes.",
        "Transfer chiles with tongs to a blender (discard soaking water) and add garlic, cider vinegar, cumin, oregano, 1/2 teaspoon salt, sugar, cloves, and 1 cup water. Blend until smooth, about 1 minute.",
        "Add chile purée to pot and cook, stirring, 5 minutes.",
        "Add remaining 5 cups water, hominy, beans, zucchini, corn, and 1/2 teaspoon each salt and pepper and bring to a boil. Reduce heat and simmer, partially covered, stirring occasionally, until zucchini is tender, about 20 minutes. Season to taste with salt and pepper.",
        "To serve the stew, surround it with small bowls of the accompaniments and let the guests garnish their servings as they wish."
    ],
    "ingredients": [
        "4 large dried ancho chiles (2 ounces), wiped clean and stemmed",
        "2 cups chopped onion",
        "1/4 cup olive oil",
        "3 large garlic cloves, chopped",
        "1 tablespoon cider vinegar",
        "2 teaspoons ground cumin",
        "1 teaspoon dried oregano, preferably Mexican",
        "Salt",
        "1 teaspoon sugar",
        "1/8 teaspoon ground cloves",
        "6 cups water, divided",
        "1 (29-ounce) can white hominy (also labeled pozole and mote blanco), rinsed and drained",
        "2 (15- to 16-ounce) cans kidney beans, rinsed and drained",
        "2 pounds zucchini, cut into 1/2-inch pieces",
        "2 cups fresh corn kernels or 1 (10-ounce) package frozen corn kernels",
        "Freshly ground black pepper",
        "Shredded lettuce, julienned radishes, chopped onion, additional dried oregano (preferably Mexican), and lime wedges for squeezing, each in separate small bowls"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Vegetarian",
        "Dinner",
        "Corn",
        "Legume",
        "Zucchini",
        "Healthy",
        "Vegan",
        "Hominy/Cornmeal/Masa",
        "Simmer",
        "Chile Pepper",
        "Gourmet",
        "Pescatarian",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vegetarian Red Pozole with Red Beans",
    "url": "http://www.epicurious.com/recipes/food/views/vegetarian-red-pozole-with-red-beans-369571"
}
