{
    "directions": [
        "Preheat oven to 425°F. Blanch pearl onions in large pot of boiling water 2 minutes. Drain onions and cool. Peel onions.",
        "Cut carrots, potatoes, rutabagas and bell pepper into 1/2-inch pieces. Place in heavy large baking pan with onions, leek and mushrooms. Add olive oil and herbes de Provence and toss to coat. Roast until vegetables are tender, stirring occasionally, about 1 hour. Transfer vegetables to 8-inch square glass baking dish. Stir in peas. Season vegetables to taste with salt and pepper. (Can be prepared 1 day ahead. Cover tightly and refrigerate.)",
        "Reduce oven temperature to 350°F. Mix 1 cup vegetable broth and 3/4 cup dry red wine in heavy small saucepan over medium heat. Bring to simmer. Stir remaining 1/4 cup red wine and 1 tablespoon cornstarch in small bowl until smooth. Add to broth mixture and simmer until sauce thickens slightly, stirring occasionally, about 4 minutes. Pour sauce over roasted vegetables.",
        "Combine vegetable broth and 1 cup water in heavy medium saucepan over medium heat. Bring to boil. Gradually stir in cornmeal and salt. Cook until polenta thickens and pulls away from sides of pan, stirring constantly, about 10 minutes. Pour warm polenta over vegetable mixture. Using spatula, smooth top, covering vegetables completely. Sprinkle polenta with Romano cheese.",
        "Bake pot pie until polenta is firm to touch and vegetable mixture is heated through, about 15 minutes. Preheat broiler. Broil pot pie until polenta is golden, about 4 minutes.",
        "Spoon pot pie onto plate; serve hot."
    ],
    "ingredients": [
        "15 pearl onions",
        "2 large carrots",
        "2 russet potatoes (about 8 ounces each), peeled",
        "2 rutabagas (about 6 ounces each), peeled",
        "1 red bell pepper, seeded",
        "1 leek (white and pale green parts only), chopped",
        "10 ounces mushrooms, coarsely chopped",
        "2 tablespoons olive oil",
        "1 1/2 teaspoons dried herbs de Provence",
        "1 cup frozen peas, thawed",
        "1 cup canned vegetable broth",
        "1 cup dry red wine",
        "1 tablespoon cornstarch",
        "2 cups canned vegetable broth",
        "1 cup water",
        "3/4 cup cornmeal",
        "1/2 teaspoon salt",
        "1 tablespoon freshly grated Romano cheese"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Pepper",
        "Potato",
        "Bake",
        "Vegetarian",
        "Rutabaga"
    ],
    "title": "Vegetable Pot Pie with Wine Sauce and Polenta Crust",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-pot-pie-with-wine-sauce-and-polenta-crust-1549"
}
