{
    "directions": [
        "Pulse garlic and thyme in a food processor, scraping down sides as necessary. Add oil, 2 tsp. kosher salt, and paprika and continue to pulse until a thick paste forms, about 1 minute. Transfer to a small bowl.",
        "Heat 1 Tbsp. garlic-oil mixture in a medium pot over medium-low until beginning to brown and smells fragrant, about 30 seconds. Cook mushrooms, shallot, and bay leaves, stirring occasionally, until mushrooms are tender and beginning to brown, about 5 minutes. Add broth, bring to a simmer, and cook 30 minutes.",
        "Strain mushroom mixture through a fine-mesh sieve into a large bowl; wipe out pot. Cook flour and remaining 2 Tbsp. oil in pot over medium heat, stirring constantly, until nutty brown and thickened, about 8 minutes.",
        "Add wine, bring to a simmer, and cook 3 minutes. Add mushroom broth, parsley, 1/4 tsp. pepper, and remaining 1/4 tsp. kosher salt, and return to a simmer. Season to taste.",
        "Gravy can be made 3 days ahead; transfer to an airtight container and chill. Heat in a small pot over medium, whisking constantly and adding warm water or vegetable broth 1 Tbsp. at a time if needed, until smooth."
    ],
    "ingredients": [
        "2 garlic cloves",
        "1/2 teaspoon thyme leaves",
        "2 tablespoons oil",
        "2 1/4 teaspoons kosher salt, divided, plus more",
        "1/2 teaspoon paprika",
        "12 ounces cremini mushrooms, coarsely chopped, divided",
        "2 shallots, quartered",
        "2 bay leaves",
        "4 cups homemade or store-bought low-sodium vegetable broth",
        "2 tablespoons all-purpose flour",
        "1/2 cup dry white wine",
        "1 tablespoon coarsely chopped parsley",
        "1/4 teaspoon freshly ground black pepper, plus more"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sauce",
        "Vegetarian",
        "Vegan",
        "Thanksgiving"
    ],
    "title": "Vegetarian Mushroom Gravy",
    "url": "http://www.epicurious.com/recipes/food/views/vegetarian-mushroom-gravy"
}
