{
    "directions": [
        "Gently boil potatoes in a large pot of water for 20 minutes, or until tender. Drain, and return to the pot. Mash potatoes with 2 tablespoons butter, 3/4 teaspoon salt, and 1/2 cup milk until fairly smooth. Set aside.",
        "While potatoes are cooking, bring 1 1/2 cups water and 1/2 teaspoon salt to a boil. Stir in kasha. Reduce heat, and simmer, uncovered, for 15 minutes. Add 1 1/2 cups more water, and bring to a boil.  Add bulgur, cover, and remove from heat. Let stand for 10 minutes.",
        "Preheat oven to 350 degrees F (175 degrees C). Butter a 10-inch pie pan or casserole dish.",
        "In a large saucepan, melt the remaining 2 tablespoons of butter over medium heat. Add onions, garlic, and carrots; saute until the onions soften. Add mushrooms; cook and stir for 3 to 4 minutes. Sprinkle flour over vegetables; stir constantly for 2 minutes, or until flour starts to brown. Pour remaining 1 1/2 cups milk over the vegetables, and increase heat to high. Whisk until sauce is smooth. Reduce heat, and simmer for 5 minutes. Stir in corn, 1/4 teaspoon salt, and black pepper to taste.",
        "Combine vegetable mixture and kasha in a large bowl. Transfer to prepared pan and smooth with a spatula.  Spread mashed potatoes over top, leaving an uneven surface.",
        "Bake in preheated oven for 30 minutes. Garnish with the chopped parsley, and serve."
    ],
    "ingredients": [
        "5 russet potatoes, peeled and cut into thirds",
        "4 tablespoons butter, divided",
        "1 1/2 teaspoons salt",
        "ground black pepper to taste",
        "2 cups milk",
        "3 cups water",
        "1/2 cup kasha (toasted buckwheat groats)",
        "2/3 cup bulgur",
        "2 cups chopped onion",
        "2 cloves garlic, minced",
        "2 carrots, diced",
        "2 cups fresh sliced mushrooms",
        "1 1/2 tablespoons all-purpose flour",
        "1 cup whole corn kernels, blanched",
        "3 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vegetarian Shepherd's Pie I",
    "url": "http://allrecipes.com/recipe/13931/vegetarian-shepherds-pie-i/"
}
