{
    "directions": [
        "Soak sweetbreads in a large bowl of ice and cold water in the refrigerator, changing water occasionally (2 or 3 times), at least 8 hours. Drain sweetbreads and transfer to a 4-quart heavy saucepan. Cover with cold water by 1 inch and add 1 tablespoon salt. Bring to a boil, then reduce heat and simmer, uncovered, until sweetbreads plump and feel slightly firmer to the touch, about 3 minutes. Drain in a colander and transfer to a bowl of cold water to stop cooking. Cut away any fat and pull away as much membrane and connective tissue as possible with a small paring knife without breaking up sweetbreads.",
        "Arrange sweetbreads in 1 layer in a baking dish, then cover with plastic wrap and top with another baking dish or plate holding weights. Chill sweetbreads, weighted, at least 8 hours.",
        "While sweetbreads chill, blanch pistachios in a small saucepan of boiling water 1 minute, then drain and peel.",
        "Pat sweetbreads dry and season with salt and pepper. Heat oil and 2 tablespoons butter in a deep 12-inch skillet over moderately high heat until foam subsides, then sauté half of sweetbreads, turning over once, until golden brown, about 4 minutes total, and transfer to a plate. Add 1 tablespoon butter to skillet and sauté remaining sweetbreads in same manner, transferring to plate.",
        "Add remaining 2 tablespoons butter to skillet, then reduce heat to moderate and cook pancetta, stirring occasionally, until beginning to brown, 2 to 3 minutes. Add onion, carrot, celery, garlic, bay leaf, and thyme, then reduce heat to moderately low and cook, stirring, until vegetables are softened, 3 to 5 minutes. Add Sherry and bring to a boil, then add demi-glace, water, 1/2 teaspoon salt, 1/4 teaspoon pepper, pistachios, and sweetbreads and return to a boil. Reduce heat to low, then cover surface of mixture with a buttered round of parchment paper (buttered side down) and simmer sweetbreads, skillet partially covered with lid, until firm but still springy to the touch, 15 to 20 minutes.",
        "Transfer sweetbreads with a slotted spoon to a bowl and, when cool enough to handle, pull apart into 1- to 1 1/2-inch pieces. Ladle cooking liquid through a sieve into a bowl, discarding bay leaf and thyme, and reserve. Reserve vegetables in another bowl for sauce and stuffing.",
        "Cook spinach in a large pot of boiling salted water , uncovered, until wilted, about 20 seconds, then drain in colander. Transfer spinach to a bowl of cold water to stop cooking and drain again, squeezing handfuls of spinach to remove excess liquid. Chop spinach and stir into reserved vegetables along with 1/4 teaspoon salt, 1/4 teaspoon pepper, and 1/8 teaspoon nutmeg.",
        "Put oven rack in middle position and preheat oven to 400°F.",
        "Make a hole for stuffing that runs lengthwise through veal: Beginning in middle of 1 end of roast, insert a sharp long thin knife lengthwise toward center, then repeat at opposite end of loin to complete an incision running through middle. Open up incision with your fingers, working from both ends, to create a 1 1/2-inch-wide opening. Pack loin with all but 2 tablespoons vegetable stuffing, pushing from both ends toward center.",
        "Tie veal roast with kitchen string at 1-inch intervals along entire length of roast. Pat veal dry and season generously with salt and pepper.",
        "Heat oil in an ovenproof 12-inch heavy skillet over high heat until just smoking, then brown veal, turning with tongs, about 5 minutes.",
        "Transfer skillet to oven and roast veal until thermometer inserted diagonally 2 inches into meat (do not touch stuffing) registers 150°F, 45 to 50 minutes for veal; about 40 minutes for pork. Transfer roast with tongs to a platter and let stand 20 minutes.",
        "Skim fat from sweetbread cooking liquid and bring liquid to a boil in a 2 1/2-quart heavy saucepan. Stir in remaining 2 tablespoons vegetables, remaining 1/4 teaspoon salt, remaining 1/4 teaspoon pepper, and remaining 1/4 teaspoon nutmeg. Add sweetbreads along with any veal juices accumulated on platter and simmer until just heated through. Remove from heat and keep warm, covered.",
        "Discard string, then cut veal into 1-inch-thick slices and serve with sweetbreads and some sauce. Serve remaining sauce on the side."
    ],
    "ingredients": [
        "4 lb veal sweetbreads",
        "1 tablespoon plus 1 teaspoon salt",
        "1/2 cup shelled pistachios (not dyed red; 2 oz)",
        "1 tablespoon olive oil",
        "5 tablespoons unsalted butter",
        "2 oz thinly sliced lean pancetta, chopped",
        "1 medium onion, finely chopped",
        "1 medium carrot, cut into 1/4-inch dice",
        "1/2 celery rib, cut into 1/4-inch dice",
        "1 large garlic clove, chopped",
        "1 Turkish or 1/2 California bay leaf",
        "1 (3-inch) fresh thyme sprig",
        "1 cup medium-dry Sherry",
        "1 cup veal demi-glace",
        "1 cup water",
        "3/4 teaspoon black pepper",
        "6 oz spinach, coarse stems discarded (4 cups)",
        "3/8 teaspoon freshly grated nutmeg",
        "4 lb boneless veal strip loin roast or pork strip loin (not tied), completely trimmed of all fat, sinew, and silver membrane",
        "2 tablespoons vegetable oil",
        "Special equipment: 3 to 4 lb of weights such as large cans of soup or vegetables; parchment paper; kitchen string; an instant-read thermometer"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Pork",
        "Vegetable",
        "Veal",
        "Pistachio",
        "Sherry",
        "Spring",
        "Gourmet"
    ],
    "title": "Vegetable-Stuffed Loin of Veal with Sweetbreads",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-stuffed-loin-of-veal-with-sweetbreads-109214"
}
