{
    "directions": [
        "Preheat oven to 500°F. and brush 2 shallow baking pans with oil.",
        "Arrange zucchini in one layer in one pan and in half of other pan and add corn to remaining half of second pan. Sprinkle vegetables with salt and pepper to taste and roast on 2 racks in oven about 5 minutes. Stir corn and switch positions of pans in oven. Roast vegetables about 5 minutes more, or until browned lightly.",
        "While vegetables are roasting, in a small bowl, stir together ricotta, 1 cup Monterey Jack, cumin, and salt and pepper to taste. Put salsa in a fine sieve set over a bowl and drain 3 seconds (do not press on solids). Transfer salsa to another bowl.",
        "Lightly grease a loaf pan, 8 1/2 by 4 1/2 by 3 inches, and trim tortillas with scissors into six 5- by 3 3/4-inch rectangles. Cover bottom of loaf pan with 2 tortillas, overlapping them in middle. Spread 1/4 cup salsa over tortillas and top with half cheese mixture, half zucchini, half peppers, half corn, and 1 tablespoon coriander. Make another layer of tortillas and vegetables in same manner. Top with remaining 2 tortillas, 1/2 cup salsa, 1/4 cup Monterey Jack,and 1 tablespoon coriander. Cover lasagne with foil and bake in middle of oven 12 minutes, or until heated through and cheese is melted. Let lasagne stand, covered, 5 minutes before serving.",
        "Cut lasagne in half and serve with limes."
    ],
    "ingredients": [
        "2 tablespoons vegetable oil",
        "1 large zucchini (about 10 ounces), cut crosswise into 1/4-inch-thick slices",
        "3/4 cup frozen corn, thawed",
        "1/4 cup ricotta cheese",
        "1 1/4 cups grated Monterey Jack cheese (about 1/4 pound)",
        "1/2 teaspoon ground cumin",
        "1 cup bottled tomato salsa (about 9 ounces)",
        "six 6-inch corn tortillas",
        "a 7-ounce jar roasted red peppers, drained and patted dry",
        "3 tablespoons chopped fresh coriander",
        "Accompaniment: Lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Tomato",
        "Vegetable",
        "Bake",
        "Vegetarian",
        "Kid-Friendly",
        "Quick & Easy",
        "Casserole/Gratin",
        "Ricotta",
        "Corn",
        "Zucchini",
        "Gourmet"
    ],
    "title": "Vegetable Tortilla Lasagne",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-tortilla-lasagne-10235"
}
