{
    "directions": [
        "Place rice and water in a saucepan over high heat, bring to a boil, and reduce heat to very low. Cover with a tight-fitting lid and simmer rice until water is absorbed, about 15 minutes. Remove rice from heat and allow to stand covered for 10 minutes.",
        "Mix red wine vinegar, sugar, and salt in a bowl until sugar has dissolved. Fluff rice with a fork and transfer into a large bowl; pour vinegar mixture into the rice and stir to coat rice. Spread rice out onto a large piece of parchment paper and fan the rice until cool. Cover rice with damp paper towels.",
        "Sprinkle avocado slices with lemon juice in a bowl.",
        "Spread a thin layer of sesame seeds onto a sushi mat. Pick up about half a cup of cooled rice and place onto sushi mat in an even layer. Place 1/4 of the cucumber, avocado slices, bell pepper, and zucchini in a line down the middle of the rice.",
        "Pick up the edge of the sushi mat, fold the bottom edge of the sheet up, enclosing the filling, and tightly roll the sushi into a thick cylinder. Once the sushi is rolled, wrap it in the mat and gently squeeze to compact it tightly. Repeat with remaining ingredients to made 4 rolls. Place rolls on a serving plate, slice into 6 or 8 pieces per roll, and cover with damp paper towels until serving time."
    ],
    "ingredients": [
        "1 1/2 cups uncooked short-grain white rice",
        "1 1/2 cups water",
        "1/3 cup red wine vinegar",
        "2 teaspoons white sugar",
        "1 teaspoon salt",
        "1/2 avocado - peeled, pitted, and thinly sliced",
        "1 teaspoon lemon juice",
        "1/4 cup sesame seeds, or as needed",
        "1/2 cucumber - peeled, seeded, and cut into matchsticks",
        "1/2 green bell pepper, seeded and cut into matchsticks",
        "1/2 zucchini, cut into matchsticks"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vegetarian Sushi",
    "url": "http://allrecipes.com/recipe/221920/vegetarian-sushi/"
}
