{
    "directions": [
        "Place eggplant in colander set over bowl. Sprinkle with 1 teaspoon salt; let stand 20 minutes. Rinse and drain.",
        "Heat oil in heavy large pot over medium-high heat. Add onions, 1/2 cup green onions, thyme, garlic, allspice, and chile; sauté until onions are tender, about 8 minutes. Add coconut milk and simmer 3 minutes. Add sweet potato, carrots, bell pepper, and 1 cup water and bring to simmer. Sprinkle with salt and pepper. Cover and simmer until vegetables are almost tender, stirring occasionally, about 10 minutes.",
        "Add eggplant, cabbage, corn, and okra, if desired, to vegetable mixture. Add enough water to partially cover vegetables. Cover and simmer until all vegetables are tender and mixture is thick and creamy, stirring often and adding more water by 1/4 cupfuls if liquid is too thick, about 15 minutes longer. Season to taste with salt and pepper. Transfer stew to bowl; sprinkle with remaining 1/4 cup green onions and serve.",
        "*Available at most supermarkets and at Asian markets."
    ],
    "ingredients": [
        "1 medium eggplant (1 to 1 1/4 pounds), unpeeled, cut into 1-inch pieces",
        "1 teaspoon salt",
        "1 tablespoon vegetable oil",
        "2 cups chopped onions",
        "3/4 cup chopped green onions, divided",
        "3 large fresh thyme sprigs",
        "2 garlic cloves, chopped",
        "1 teaspoon ground allspice",
        "1/2 Scotch bonnet chile or habanero chile, seeded, minced (1/2 teaspoon)",
        "1 13 1/2- to 14-ounce can unsweetened coconut milk*",
        "1 14-ounce red-skinned sweet potato (yam), peeled, cut into 3/4-inch pieces",
        "2 carrots, peeled, coarsely chopped",
        "1 green bell pepper, coarsely chopped",
        "1 cup (or more) water",
        "4 cups coarsely chopped green cabbage (from about 1/4 large head)",
        "2 cups fresh corn kernels (from 2 ears of corn) or 2 cups frozen corn kernels",
        "8 fresh okra pods, trimmed (optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Milk/Cream",
        "Garlic",
        "Onion",
        "Side",
        "Sauté",
        "Vegetarian",
        "Corn",
        "Eggplant",
        "Bell Pepper",
        "Hot Pepper",
        "Carrot",
        "Sweet Potato/Yam",
        "Thyme",
        "Okra",
        "Cabbage",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Vegetable Rundown",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-rundown-234809"
}
