{
    "directions": [
        "1. Heat 1 tablespoon of the oil in a large skillet or wok over medium heat.",
        "2. Add the onions, saute for 2 minutes. Add in garlic, ginger, carrots and mushrooms and saute for 3 minutes.",
        "3. Add the cabbage, kale, scallions and salt and saute an additional 3 minutes.",
        "4. In a small bowl, whisk together the soy sauce, rice vinegar and sesame oil, and add it to the skillet. Stir to coat the veggies well. Remove from the heat and allow to cool slightly.",
        "5. Place one spring roll wrapper on a flat surface in front of you, with a corner facing you, so it makes a diamond shape.",
        "6. Place 2 tablespoons of the filling in a line in middle of the wrapper.",
        "7. Fold the corners toward the center on top of the filling and the bottom corner over the top of the filing. Brush a little water on the top corner and roll it up like a burrito.",
        "8. Heat the remaining 3 tablespoons oil in the skillet or wok over medium heat.",
        "9. Place a few spring rolls in the pan, making sure you have room to roll them. Cook them on each side for 2–5 minutes, until they are golden brown on each side. Each spring roll will take about 7–10 minutes to fully cook."
    ],
    "ingredients": [
        "4 tablespoons coconut oil, divided",
        "1 small yellow onion, finely diced",
        "1 garlic clove, minced",
        "1 teaspoon freshly grated ginger",
        "1 large carrot, grated, about 1 1/2 cups",
        "6–8 shiitake mushrooms, diced",
        "1 cup thinly sliced kale",
        "1 cup thinly sliced napa cabbage",
        "1 scallion, diced",
        "1/2 teaspoon salt",
        "1/4 cup low sodium soy sauce",
        "1 tablespoon rice vinegar",
        "1 teaspoon sesame oil",
        "12 spring roll wrappers"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Onion",
        "Kid-Friendly",
        "Quick & Easy",
        "Dinner",
        "Lunch",
        "Kale",
        "Carrot",
        "Cabbage",
        "Weelicious",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Kosher"
    ],
    "title": "Vegetarian Spring Rolls",
    "url": "http://www.epicurious.com/recipes/food/views/vegetarian-spring-rolls-56389478"
}
