{
    "directions": [
        "Combine first 5 ingredients processor; puree. If necessary, mix in enough water to thin to consistency of thick mayonnaise. Mix in 2 tablespoons minced thyme. Season with salt and pepper. Transfer to bowl. Sprinkle with fresh thyme leaves. (Can be made 1 day ahead. Cover and chill.)",
        "Steam potatoes until just tender, about 25 minutes. Transfer to bowl. Cut off stems of artichokes and rub cut surface with cut side of lemon. Cut artichokes lengthwise into quarters and rub cut surfaces with lemon. Cut out choke and rub with lemon. Bring large pot of salted water to boil. Add 1 remaining lemon half and artichokes. Cover and boil until a leaf pulls off easily, about 35 minutes. Drain and cool.",
        "Cook broccoli and cauliflower in large saucepan of boiling salted water until just tender, about 5 minutes. Using slotted spoon, transfer to bowl of cold water. Add green beans to same boiling water and cook until just tender, about 4 minutes. Drain. Rinse with cold water to stop cooking. Drain. (Can be prepared 1 day ahead. Wrap vegetables tightly and refrigerate.)",
        "Arrange all vegetable on large platter. Serve with hummus and pita bread."
    ],
    "ingredients": [
        "2 15-ounce cans cannellini (white kidney beans), rinsed, drained",
        "1/2 cup fresh lemon juice",
        "1/2 cup tahini* (sesame seed paste_",
        "3 garlic cloves, minced",
        "1 1/2 teaspoons chili powder",
        "2 tablespoons minced fresh thyme",
        "Fresh thyme leaves",
        "1 pound baby red-skinned potatoes",
        "2 large artichokes",
        "3 lemon halves",
        "1 pound broccoli, cut into florets",
        "1 head cauliflower, cut into florets",
        "3/4 pound green beans, trimmed",
        "2 bunches baby carrots, peeled",
        "Pita bread, cut into triangles",
        "*Available at Middle Eastern and natural foods stores and some supermarkets."
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Condiment/Spread",
        "Bean",
        "Appetizer",
        "Summer",
        "Vegan",
        "Vegetarian",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Vegetable Platter with Cannellini \"Hummus\"",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-platter-with-cannellini-hummus-2340"
}
