{
    "directions": [
        "Heat the olive oil over medium-high heat in a 10-inch saute pan with a lid. Add the onion and celery and saute until beginning to soften, about 4 minutes. Add the garlic, cherry tomatoes and salt and cook an additional 6 minutes, until the tomatoes begin to break down. Add the radishes and saute another 2 minutes. Add the vermouth and allow it to reduce by half. Add the chicken broth and then the saffron, rubbing it between your fingers to crumble a bit. Bring to a simmer and stir in the rice and the green beans. Simmer over medium-high heat, uncovered, for 5 minutes without disturbing. Scatter the red peppers and peas over the top and gently press them into the rice mixture; do not stir. Reduce the heat to medium, cover and simmer for 7 minutes. Uncover, raise the heat to high and cook for 3 minutes more, to make sure all the liquid is evaporated and to help develop a crust on the bottom. Remove the pan from the heat, cover and let rest for 5 minutes. Uncover, sprinkle with the smoked paprika and the parsley and serve."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil",
        "1 small onion, diced",
        "1 stalk celery, diced",
        "3 cloves garlic, sliced",
        "16 yellow cherry tomatoes, halved (1 cup)",
        "3/4 teaspoon salt",
        "6 red radishes, quartered",
        "1/2 cup dry vermouth",
        "2 cups low-sodium chicken broth",
        "1/4 teaspoon saffron threads",
        "1 cup bomba rice, or other short-grain rice",
        "1/4 pound green beans, trimmed, cut into 1-inch pieces",
        "1 red pepper, cut into 1/4-inch strips",
        "1/2 cup frozen peas, thawed",
        "1/2 teaspoon smoked paprika",
        "2 tablespoons chopped fresh parsley"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Healthy",
        "Vegetable",
        "Rice Recipes",
        "Main Dish Recipes",
        "Low-Fat",
        "Low Calorie",
        "Low-Cholesterol",
        "Gluten Free",
        "Heart-Healthy",
        "High Fiber"
    ],
    "title": "Vegetable Paella",
    "url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/vegetable-paella"
}
