{
    "directions": [
        "Pulse scallions, garlic, chiles, ginger, green peppercorns, turmeric, 2 cups cilantro, 1/3 cup mint, and 2 Tbsp. water in a food processor until coarsely ground. With motor running, stream in coconut oil; process until smooth. Scrape paste into a medium pot and cook over medium, stirring occasionally, until slightly darkened in color and fragrant, about 5 minutes. Add coconut milk, lime juice, and 3 cups water and bring to a boil. Add lemongrass; reduce heat and simmer until reduced by half, 25–30 minutes. Stir in Swiss chard; cook until wilted and tender, about 2 minutes. Stir in coconut sugar; season curry with salt.",
        "Meanwhile, cook rice noodles according to package directions. Drain and divide among bowls.",
        "Spoon curry over noodles and top with more cilantro and mint. Serve with lime wedges."
    ],
    "ingredients": [
        "4 scallions, coarsely chopped",
        "4 garlic cloves, smashed",
        "3 green Thai chiles, coarsely chopped",
        "1 (2-inch) piece ginger, peeled, coarsely chopped",
        "2 teaspoons green peppercorns in brine",
        "1/2 teaspoon ground turmeric",
        "2 cups cilantro leaves with tender stems, plus more for serving",
        "1/3 cup mint leaves, plus more for serving",
        "1/4 cup virgin coconut oil, melted, slightly cooled",
        "2 (13.5-ounce) cans unsweetened coconut milk",
        "1 tablespoon fresh lime juice",
        "1 lemongrass stalk, bottom third only, tough outer layers removed, bruised with the back of a knife",
        "4 cups coarsely chopped Swiss chard leaves (from about 1 1/2 bunches)",
        "1 tablespoon coconut sugar or honey",
        "Kosher salt",
        "8 ounces dried thin brown rice noodles",
        "Lime wedges (for serving)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Noodle",
        "Curry",
        "Green Onion/Scallion",
        "Rice",
        "Wheat/Gluten-Free",
        "Chile Pepper",
        "Ginger",
        "Cilantro",
        "Mint",
        "Coconut",
        "Lemongrass",
        "Chard",
        "Dinner",
        "Quick and Healthy",
        "Quick & Easy",
        "Vegetarian",
        "Vegan"
    ],
    "title": "Green Curry With Brown Rice Noodles and Swiss Chard",
    "url": "http://www.epicurious.com/recipes/food/views/vegetarian-green-curry-with-brown-rice-noodles-and-swiss-chard"
}
