{
    "directions": [
        "TO PREPARE PASTRY PURSES: Preheat oven to 400 degrees F. Thaw puff pastry as directed. Unfold pastry on lightly floured surface. Roll into 12-inch rectangles. Cut into 12 (3-inch) squares. Heat oil in saute pan over high heat. Add shallots, corn, and mushrooms; saute for 1 minute. Add cooking wine and seasonings. Add spinach and saute for an additional 30 seconds. Remove from heat. Place 1 Tablespoon filling in center of each square. Brush edges of square with beaten egg. Bring four corners together, pressing firmly. Pull up and twist corners making top of purse. Place on a baking sheet and brush purse with egg.",
        "Bake in preheated oven for 15 to 18 minutes, or until golden brown. Serve with sauce (optional).",
        "TO PREPARE OPTIONAL SAUCE: Heat oil in saute pan over high heat. Add shallots and celery. Saute for 30 to 40 seconds or until lightly brown. Add cooking wine, brown sugar, and bay leaf. Reduce heat to medium. Combine cold water and cornstarch; add to cooking wine mixture and simmer for 5 minutes. Set aside until ready to serve."
    ],
    "ingredients": [
        "1 sheet frozen puff pastry",
        "2 tablespoons olive oil",
        "1/2 teaspoon fresh shallots, minced",
        "1 cup frozen corn",
        "1 cup fresh mushrooms, chopped",
        "1/4 cup Holland House® Marsala Cooking Wine",
        "1/2 teaspoon white pepper",
        "1/2 teaspoon dried thyme",
        "3 cups fresh spinach",
        "1 egg, beaten",
        "Optional Sauce Ingredients:",
        "1 tablespoon olive oil",
        "1/2 teaspoon fresh shallots, minced",
        "1/4 cup celery, chopped",
        "1 cup Holland House® Marsala Cooking Wine",
        "3 tablespoons brown sugar",
        "1 bay leaf",
        "2 teaspoons cold water",
        "2 teaspoons cornstarch"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vegetable Pastry Purses",
    "url": "http://allrecipes.com/recipe/161977/vegetable-pastry-purses/"
}
