{
    "directions": [
        "Stir together dill, chives, and pepper on a plate, then roll cheese in herb mixture to coat sides (not ends). Wrap cheese in plastic wrap and chill.",
        "Bring water, salt, and 1 tablespoon oil to a boil in a 1-quart heavy saucepan. Stir in couscous, then cover pan and remove from heat. Let stand, covered, 5 minutes.",
        "Heat 1 tablespoon oil in a 12-inch heavy skillet over moderate heat until hot but not smoking, then cook onion, stirring, 1 minute. Add zucchini, bell pepper, and corn and cook, stirring, until zucchini is bright green, about 3 minutes. Season with salt and pepper and transfer to a bowl.",
        "Fluff couscous with a fork and stir into vegetables, then season with salt and pepper.",
        "Peel beet and cut half of beet into very thin slices (less than 1/8 inch thick) with slicer (discard remainder), then stack slices and cut into thin matchsticks. Rinse beets and pat dry, then transfer to a bowl.",
        "Whisk together vinegar, remaining 2 tablespoons oil, and salt and pepper to taste. Add 1/2 tablespoon dressing to beets and toss to coat.",
        "Fill ramekin with couscous, pressing it firmly into mold with a rubber spatula. Invert ramekin onto a salad plate and carefully unmold couscous, then make 3 more couscous mounds on 3 more plates.",
        "Drape each couscous mound with 1 prosciutto slice (if using), then top with some of beets.",
        "Unwrap cheese and cut crosswise into 4 equal slices with a lightly oiled knife, then arrange 1 cheese slice alongside each couscous mound and spoon remaining dressing around mounds."
    ],
    "ingredients": [
        "1 teaspoon chopped fresh dill",
        "1 teaspoon finely chopped fresh chives",
        "1/8 teaspoon black pepper",
        "1 (4-oz) piece soft mild goat cheese from a log",
        "2/3 cup water",
        "1/2 teaspoon salt",
        "4 tablespoons olive oil",
        "1/2 cup couscous (3 oz)",
        "1/4 cup diced (1/4 inch) red onion",
        "1/2 cup diced (1/4 inch) zucchini",
        "1/2 cup diced (1/4 inch) red bell pepper",
        "1/4 cup fresh corn kernels",
        "1 small beet (about 2 inches in diameter), trimmed",
        "1 tablespoon Sherry vinegar",
        "4 thin prosciutto slices (optional)",
        "Special equipment: a Japanese Benriner* or other adjustable-blade slicer; a 4-oz ramekin",
        "Accompaniment: grissini (long thin breadsticks) or flatbread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Onion",
        "Appetizer",
        "Side",
        "Quick & Easy",
        "Goat Cheese",
        "Corn",
        "Bell Pepper",
        "Beet",
        "Zucchini",
        "Summer",
        "Prosciutto",
        "Couscous",
        "Gourmet",
        "Sugar Conscious",
        "Kidney Friendly",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Vegetable Couscous, Goat Cheese, and Beets",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-couscous-goat-cheese-and-beets-109734"
}
