{
    "directions": [
        "Heat a large Dutch oven over medium high heat with olive oil, 4 turns of the pan. Quarter and core the fennel, then chop into a small dice and add to the pot. Chop the vegetables and keep adding to the pot as you work to keep your cutting board clear - add the diced celery, chopped parsnips, carrots, potatoes, onions, garlic, and season liberally with salt and pepper, add in bay leaves and thyme. Sweat the vegetables 8 to 10 minutes covered, stirring fairly frequently, then add wine and deglaze the pot Stir in the stock plus 2 cups water and bring to a boil. Heat the butter in a small skillet over medium heat to melt, then whisk in the flour 1 minute. Scrape the roux into the soup. Simmer the soup a few minutes to combine the flavors then cool and cover for a make-ahead meal.",
        "Bring the soup to a boil over medium to medium-high heat, stirring occasionally. Stir together the biscuit mix with water and parsley according to package directions. When the soup comes to a boil add in the peas, dill and reserved fennel fronds. Using 2 spoons drop the biscuit mix into a pot shaping small egg-shaped dumplings as you go. Cover and simmer over medium-low heat for 10 minutes. Turn off the heat and serve the hearty, thick soup in shallow bowls."
    ],
    "ingredients": [
        "1/4 cup extra-virgin olive oil",
        "1 bulb fennel, tops trimmed and 1/4 cup fronds reserve",
        "4 ribs celery with leafy tops from the heart, diced",
        "2 parsnips, peeled and chopped",
        "2 carrots, peeled and diced not more than 1/2-inch",
        "2 all-purpose potatoes, peeled and diced",
        "1 large onion, diced",
        "4 cloves garlic, chopped, optional",
        "Salt and freshly ground black pepper",
        "2 large fresh bay leaves",
        "About 2 tablespoons fresh thyme leaves, chopped",
        "1 cup dry white wine",
        "4 cups vegetable or chicken stock-in-a-box",
        "3 tablespoons butter",
        "2 tablespoons flour",
        "1/4 cup finely chopped fresh dill",
        "1 cup frozen green peas",
        "Biscuit mix prepared to package directions for 8 drop biscuits (recommended: JIFFY brand)",
        "A handful fresh flat-leaf parsley, finely chopped"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Soup",
        "Vegetable"
    ],
    "title": "Vegetable and Dumpling Soup",
    "url": "http://www.foodnetwork.com/recipes/rachael-ray/vegetable-and-dumpling-soup-recipe"
}
