{
    "directions": [
        "Discard 1 or 2 outer layers from lemongrass and trim root ends. Thinly slice enough of lower 6 inches of stalks to yield 1/2 cup, then finely grind in a blender with garlic, chile, turmeric, and 4 tablespoons water until a coarse paste forms, adding another tablespoon water if too thick to blend. Set aside.",
        "Heat star anise in a dry 8-quart heavy pot over moderate heat, stirring occasionally, 10 minutes. Add coconut milk and peanuts and boil over moderately high heat, uncovered, stirring frequently, until very thick, about 5 minutes. Reduce heat to moderately low, then stir in curry paste and lemongrass paste and cook, stirring, 5 minutes. Add chicken, fish sauce, sugar, and salt and cook, uncovered, stirring frequently, 10 minutes.",
        "Increase heat to moderate, then add peanut butter, squash, sweet potato, onion, bell peppers, yellow-fleshed potato, and carrot and cook, covered, stirring occasionally, 10 minutes.",
        "Add remaining 2 1/2 cups water and bring to a boil over high heat, stirring occasionally. Reduce heat to moderately high and cook, uncovered, stirring occasionally, 8 minutes, or until vegetables are almost tender. Add beans and cook, stirring occasionally, until just tender, 6 to 8 minutes.",
        "Discard star anise and serve curry over rice, with bread on the side."
    ],
    "ingredients": [
        "3 large stalks lemongrass",
        "4 large garlic cloves, coarsely chopped",
        "1 (3- to 4-inch) dried hot red chile, seeds removed and chile crumbled",
        "1 (1/2-inch) piece fresh or frozen turmeric (thawed if frozen), peeled",
        "2 1/2 cups plus 4 to 5 tablespoons water",
        "6 whole star anise",
        "1 (13 1/2- to 14-ounce) can unsweetened coconut milk",
        "1/4 cup unsalted roasted peanuts",
        "1 tablespoon Thai red curry paste (preferably Mae Ploy brand)",
        "1 1/2 pounds skinless boneless chicken breasts, cut into 2-inch pieces",
        "1/4 cup Asian fish sauce (preferably 3 Crab brand)",
        "1 1/2 tablespoons sugar",
        "1/2 teaspoon salt",
        "1 tablespoon creamy peanut butter",
        "2 1/2 cups 1-inch pieces peeled and seeded buttercup squash (from a 1 1/2-lb piece of squash)",
        "2 cups 1-inch pieces peeled sweet potato (1 pound)",
        "2 cups chopped sweet onion (1 pound)",
        "1 1/2 cups chopped red bell pepper (1 1/2 medium)",
        "1 1/2 cups chopped green bell pepper (1 1/2 medium)",
        "1 1/2 cups 1-inch pieces peeled yellow-fleshed potato such as Yukon Gold (3/4 pound)",
        "1 1/2 cups 1-inch pieces carrot (6 medium)",
        "1 1/2 cups trimmed and halved green beans (6 ounces)",
        "Accompaniments: jasmine rice and sliced warm French bread"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Vegetable",
        "Coconut",
        "Peanut",
        "Curry",
        "Fall",
        "Anise",
        "Lemongrass",
        "Simmer",
        "Gourmet"
    ],
    "title": "Vegetable and Chicken Curry",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-and-chicken-curry-107009"
}
