{
    "directions": [
        "In a large bowl, stir together the gluten, yeast, paprika and salt. Pour in the water all at once and quickly mix with a sturdy spoon. Additional water may be necessary to moisten all of the dry gluten. Don't worry that the ball is rather solid, it is supposed to be. Pour off any excess water.",
        "If you want your ribs chewy, leave the ball just as it is. If you want it slightly less chewy, remove it from the bowl and knead for 1 to 2 minutes on a clean surface. Return it to the bowl, and coat with smooth peanut butter. Set aside.",
        "Heat the oil in a skillet over medium heat. Add onion; cook and stir until golden brown. Remove from the heat. Pour the onion and oil over the ball of gluten. Poke a few times with a chopstick, knife or even a fork, allowing the oil to soak into the ball. Let cool.",
        "When the ball is just warm enough to be manageable, use your hands to mix the oil and onions in. There will be a lot of oil that will not mix in and tiny pieces of gluten that will not stay attached. That's okay. The oil mainly helps the gluten absorb the spice. Just mix as much as you can.",
        "Preheat the oven to 350 degrees F (175 degrees C).",
        "Break off good sized handfuls of dough and shape them into strips by pulling and twisting. You want them to be about 4 inches long and 1/2 inch thick. Don't try cutting these, or rolling them out, as that will make them behave more like bread and change the texture appreciably. Place the strips on a greased baking sheet.",
        "Bake for 40 minutes in the preheated oven. Remove from the oven and coat each piece liberally with barbeque sauce. Return to the oven for another 10 minutes."
    ],
    "ingredients": [
        "2 cups gluten",
        "1/3 cup nutritional yeast",
        "2 tablespoons paprika",
        "1 tablespoon salt",
        "2 cups water",
        "1/2 cup smooth peanut butter",
        "1 large onion, minced",
        "1/2 cup olive oil",
        "2 cups barbeque sauce"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vegetarian Ribs",
    "url": "http://allrecipes.com/recipe/98539/vegetarian-ribs/"
}
