{
    "directions": [
        "First prepare the vegetables: Bring a large pot of salted water to a boil. Also, have ready a large bowl of ice water, with more ice in reserve. Add the potatoes and cook until barely tender, about 15 minutes (depending on their size). Lift out, drain, peel, and cut into 1/2-inch dice. Remove the strings from the green beans if necessary. Cut into short pieces (about 1/4 inch) and cook with the peas until barely tender, about 5 to 7 minutes. Scoop out the beans and peas with a strainer or slotted spoon and at once plunge them into the ice bath to stop the cooking. Scoop out and drain. Peel the carrots, cut into 1/4-inch dice, and cook until barely tender, about 3 to 5 minutes, chilling and draining in the same way. Separate the cauliflower into small florets; cook until barely tender, about 4 to 6 minutes, chilling and draining in the same way. Set the vegetables aside.",
        "Remove and discard the tops and seeds from the guajillo chiles. Rinse the guajillos under cold running water and shake off the excess moisture, but do not dry them. Heat a griddle or cast-iron skillet over medium-high heat until a drop of water sizzles on contact. Place a few guajillos on the griddle and heat, turning occasionally with tongs, just until any clinging moisture is evaporated and the aroma is released, about 25 seconds. (The chiles should just become dry, hot, and fragrant; do not allow them to start really roasting or they will have a terrible scorched flavor.) Remove from the griddle as they are done, and repeat with the remaining guajillos.",
        "Place the guajillo and amarillo chiles in a deep bowl, cover generously with boiling water, and let soak for 20 minutes. Meanwhile, grind the canela in an electric coffee or spice grinder.",
        "Drain the chiles and place in a blender with the ground canela, garlic, thyme, vinegar, and enough water to facilitate blending (about 1 cup). Process to a smooth purée, about 3 minutes on high. With a wooden spoon or pusher, force the purée through a medium-mesh sieve into a bowl.",
        "In a large non-reactive bowl, toss the cooked vegetables with the pruéed chile mixture and salt. Cover with plastic wrap and refrigerate for at least 4 hours, preferably longer. It will be better if left overnight — or even better after two days.",
        "When ready to serve, combine the cheese, sliced onion, and oregano in a small bowl and toss to distribute evenly. Pour vegetable oil into a large, deep skillet to a depth of 1 inch and heat to 375° F. Fry the tortillas, 2 at a time, just until crisp (20 to 30 seconds on each side). Lift out to drain on paper towels as they are done. Top each with a few spoonfuls of the marinated vegetables and scatter some of the cheese-onion mixture over the vegetables. You may omit the fried tortillas and serve with fresh corn tortillas or fried tortilla chips.",
        "The chileajo mixture also makes a good side dish. Omit the fried tortillas and heap the marinated vegetables on a serving platter, topping with the cheese-onion mixture."
    ],
    "ingredients": [
        "1 pound medium-small waxy potatoes such as Red Bliss, unpeeled",
        "8 ounces young green beans",
        "1 cup fresh shelled peas (optional)",
        "2 medium carrots",
        "1/2 small cauliflower",
        "3 ounces guajillo chiles (about 20 chiles) or 2 ounces guajillos (about 14 chiles) and 1 ounce amarillo chiles (about 10 small chiles) (see Tips, below)",
        "One 1-inch piece canela (see Tips, below)",
        "10 garlic cloves, coarsely chopped",
        "1 teaspoon dried thyme, crumbled",
        "6 teaspoons cider vinegar",
        "1 1/2 to 2 teaspoons salt, or to taste",
        "8 ounces queso fresco, crumbled, or 4 ounces queso añejo, grated; or substitute equal amounts of crumbled young or grated aged ricotta salata (see Tips, below)",
        "1 medium onion, cut into paper-thin half-moons",
        "1 1/2 teaspoons dried Mexican oregano, crumbled (see Tips, below)",
        "Vegetable oil for frying",
        "24 small (3-inch) corn tortillas"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Garlic",
        "Pepper",
        "Potato",
        "Vegetable",
        "Side",
        "Fry",
        "Cauliflower",
        "Green Bean",
        "Pea",
        "Carrot",
        "Vegetarian",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Vegetable Medley in Garlic-Chile Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-medley-in-garlic-chile-sauce-232059"
}
