{
    "directions": [
        "Bring water to a boil in a 5-quart pot and simmer leeks, onion, carrots, potatoes, squash, white beans (if using fresh), and bouquet garni 30 minutes, or until beans and squash are tender but remain intact. Add green beans, zucchini, and macaroni (and cooked white beans if using) and simmer 15 minutes, or until macaroni is tender but not falling apart.",
        "Pound garlic, basil, salt, and pepper to taste with a large mortar and pestle, alternating between pounding and turning with a grinding motion, until mixture forms a paste. Work in enough Parmesan to make a very stiff paste, then add about one third of tomato, pounding and grinding into the paste. Gradually work in remaining cheese and tomato with a little olive oil until mixture is a barely fluid paste. Gradually work in 1 cup oil, or enough for pistou to become a sauce. (Pistou will not be an emulsion, so it should be thoroughly mixed each time it is dished out.)",
        "Serve soup with mortar of pistou on the side, to be added to taste by each person."
    ],
    "ingredients": [
        "2 1/2 qt water",
        "2 medium leeks (white and pale-green parts only), thinly sliced crosswise",
        "1 medium onion, thinly sliced",
        "2 medium carrots, halved lengthwise and thinly sliced crosswise",
        "3/4 pound potatoes, peeled, quartered lengthwise, and cut into 1/2-inch-thick slices",
        "3/4 pound butternut or other winter squash, peeled and cut into 1/2-inch pieces",
        "1 pound fresh white beans in pods, shelled, or 1 1/2 cups drained cooked white beans",
        "Bouquet garni of 1 celery rib, 3 fresh parsley sprigs, 2 fresh thyme sprigs, and 1 bay leaf tied together with kitchen string",
        "6 ounce green beans, cut crosswise into 1/2-inch pieces",
        "2 small zucchini (1/2 pound), cut into 1/4-inch-thick slices",
        "1 cup elbow macaroni",
        "4 large garlic cloves",
        "Generous handful fresh basil leaves (preferably with blossoms)",
        "1/4 teaspoon salt",
        "1 cup freshly grated Parmesan",
        "1 firm-ripe medium tomato, peeled, seeded, and cut into chunks",
        "1 to 1 1/4 cups olive oil",
        "Special equipment: kitchen string"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Vegetable",
        "Fall",
        "Gourmet"
    ],
    "title": "Vegetable Soup with Basil and Garlic",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-soup-with-basil-and-garlic-102574"
}
