{
    "directions": [
        "Arrange a rack in center of oven; preheat to 450°F. Mix rice, 1 Tbsp. oil, a pinch of salt, and 5 cups water in a medium heavy saucepan. Cover and bring to a boil, then reduce to a simmer and cook until rice is al dente, about 25 minutes. Drain, then rinse with cool water; set aside.",
        "Meanwhile, zest 1 orange and transfer zest to a small bowl; reserve orange. Toss parsnips, garlic, rosemary, cayenne, 1/2 cup oil, 1/2 tsp. salt, and 1/4 tsp. orange zest on a rimmed baking sheet. Roast, tossing once halfway through, until fork-tender, about 20 minutes. Transfer to a plate.",
        "Toast hazelnuts on rimmed baking sheet, tossing occasionally, until golden brown, 6–8 minutes. Let cool, then coarsely chop.",
        "Blend ricotta, 2 Tbsp. oil, and 1/2 tsp. salt in the bowl of a stand mixer fitted with the whisk attachment (or use a whisk) until smooth and fluffy, about 2 minutes.",
        "Peel remaining orange. Slice into 1/4\" rounds, then cut into half moons.",
        "Juice reserved orange. Whisk vinegar, honey, pepper, 2 tsp. orange zest, 3 Tbsp. orange juice, and remaining 1/4 cup oil and 1 tsp. salt in another large bowl until smooth.",
        "Toss rice, parsnips mixture, lettuce, orange rounds, hazelnuts, and parsley in bowl with vinegar mixture. Spread ricotta mixture on a platter and arrange salad over. Serve immediately.",
        "Rice and parsnips can be prepared 2 days ahead; store in separate containers, cover, and chill."
    ],
    "ingredients": [
        "3/4 cup short-grain brown rice",
        "3/4 cup plus 3 tablespoons olive oil, divided",
        "2 teaspoons kosher salt, plus more, divided",
        "2 large oranges, divided",
        "1 bunch (about 1 1/2 pounds) parsnips, peeled, cut into 1/4\" coins",
        "1 garlic clove, smashed",
        "4 sprigs rosemary",
        "1/4 teaspoon cayenne pepper",
        "1/2 cup blanched hazelnuts",
        "1 1/2 cups whole-milk ricotta",
        "2 teaspoons white wine vinegar",
        "1 teaspoon honey",
        "1/4 teaspoon freshly ground black pepper",
        "2 heads Little Gem lettuce or baby romaine hearts, torn into bite-size pieces (about 6 cups)",
        "1/2 cup whole parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetarian",
        "Rice",
        "Dinner",
        "Orange",
        "Parsnip",
        "Ricotta",
        "Hazelnut",
        "Lettuce",
        "Parsley",
        "Wheat/Gluten-Free",
        "No Meat, No Problem"
    ],
    "title": "Vegetarian Brown Rice Salad With Parsnips and Whipped Ricotta",
    "url": "http://www.epicurious.com/recipes/food/views/vegetarian-brown-rice-salad-with-parsnips-and-whipped-ricotta"
}
