{
    "directions": [
        "Pour the vegetable broth into a saucepan and bring to a boil over high heat. Measure the texturized vegetable protein and vegetable flakes into a large mixing bowl. Pour the boiling broth over the texturized vegetable protein and vegetable flakes; soak for 15 minutes.",
        "Meanwhile, melt the butter in a large skillet over medium-high heat, add the mushrooms and onions; cook and stir until soft, about 10 minutes.",
        "Stir the texturized vegetable protein and vegetable flake mixture in with the mushroom and onions. Pour the beer into the skillet with the vegetable mixture; remove from heat and cool.",
        "Preheat oven to 450 degrees F (230 degrees C).",
        "Whisk the egg and milk together in a small bowl.",
        "Line a deep dish pie plate with one round of the prepared pastry. Pour the vegetable mixture into the pastry shell. Prepare the top pastry by cutting a 2 to 3-inch hole in the center of the round using a knife or a decorative cookie cutter.",
        "Moisten the edges of the bottom round with water. Place the top round of prepared pastry on top of the meat filling, pressing around the edges and crimping to seal. Brush the top of the pastry with the egg and milk mixture.",
        "Bake in the preheated 450 degree F (230 degrees C) oven for 15 minutes. Lower the oven temperature to 375  degrees F (190 degrees C) and continue baking until the crust is golden brown, 30 to 40 minutes."
    ],
    "ingredients": [
        "2 cups vegetable broth",
        "2 cups texturized vegetable protein (TVP)",
        "1/2 cup dried vegetable flakes",
        "3 tablespoons butter",
        "1 cup onion, minced",
        "2 cups mushrooms, minced",
        "2 cups bread crumbs",
        "1 teaspoon freshly cracked peppercorns",
        "1/2 teaspoon sea salt",
        "1/2 teaspoon dried thyme leaves",
        "1/2 teaspoon dried summer savory leaves",
        "1 pinch ground cloves",
        "1 pinch fresh ground nutmeg",
        "1 (12 fluid ounce) bottle beer, room temperature",
        "1 egg, beaten",
        "1 tablespoon milk",
        "2 (9 inch) refrigerated pie crusts",
        "1 teaspoon water"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vegetarian Tourtiere",
    "url": "http://allrecipes.com/recipe/97346/vegetarian-tourtiere/"
}
