{
    "directions": [
        "Using a small sharp knife, cut all peel and white pith from lemon; discard. Cut flesh crosswise into 1/4\"-thick slices; set aside.",
        "Line a large rimmed baking sheet with a kitchen towel. Cook broccoli in a large pot of boiling salted water for 1 minute. Using a slotted spoon, transfer to prepared sheet. Repeat in same pot with carrots, onions, asparagus, and fennel, returning water to a boil between batches.",
        "Place chicken broth in a small saucepan over low heat and scrape in seeds from vanilla bean; add bean. Bring to a simmer. Remove from heat; let infuse for 10 minutes.",
        "Heat 1 tablespoon oil in a large pot over medium heat. Add carrots, onions, fennel, and garlic; cook for 1 minute. Add coriander, next 3 ingredients, and infused broth with bean. Cover with lid slightly ajar; simmer until vegetables are crisp-tender, 12-15 minutes. Stir in broccoli and asparagus.",
        "Using a slotted spoon, transfer vegetables to a warm serving dish. Bring broth to a boil and cook until reduced to 1 cup. Remove broth from heat; whisk in remaining 2 tablespoons oil and 1 teaspoon vinegar. Season with salt, pepper, and additional vinegar, if desired. Pour sauce over vegetables. Garnish with lemon slices and cilantro."
    ],
    "ingredients": [
        "1 lemon",
        "2 small heads of broccoli, cut into 2\" florets",
        "Kosher salt",
        "4 carrots, peeled, halved lengthwise",
        "2 medium white onions, each cut into 6 wedges with some root attached",
        "1 12-ounce bunch asparagus, trimmed",
        "1 fennel bulb, trimmed, cut into 8 wedges with some core attached",
        "2 cups low-salt chicken broth",
        "1 vanilla bean, split lengthwise",
        "3 tablespoons olive oil, divided",
        "4 garlic cloves, crushed",
        "10 coriander seeds",
        "5 whole black peppercorns",
        "4 sprigs thyme",
        "1 bay leaf",
        "1 teaspoon (or more) Sherry vinegar",
        "Freshly ground black pepper",
        "Fresh cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Low Cal",
        "Low Sodium",
        "Vanilla",
        "Asparagus",
        "Broccoli",
        "Fennel",
        "Carrot",
        "Healthy",
        "Low Cholesterol"
    ],
    "title": "Vegetables à la Barigoule with Vanilla",
    "url": "http://www.epicurious.com/recipes/food/views/vegetables-a-la-barigoule-with-vanilla-394717"
}
