{
    "directions": [
        "In small bowl, combine mushrooms with boiling water to cover. Let sit 30 minutes to soften. Drain; remove tough stems and finely dice caps. Set aside.",
        "In small bowl, combine noodles with boiling water to cover. Let sit 10 minutes to soften. Drain; finely dice. Set aside.",
        "Bring a large pot of water to boil over high heat. Add the cabbage; blanch until just wilted. Using a slotted spoon, remove cabbage to strainer set over a large bowl. Press down on cabbage to squeeze out all liquid. Transfer to cutting board; roughly dice. Using the same pot of boiling water, repeat the process with the bok choy. Place all chopped vegetables in large bowl.",
        "Finely dice the dried bean curd; add to vegetable mixture.",
        "Add the sesame oil, soy sauce, ginger, and monosodium glutamate (optional) to the vegetable mixture. Stir in chopped mushrooms and noodles until completely incorporated.",
        "Place the flour and salt in a large bowl. Slowly add water and mix with your hands. Knead the mixture until it forms a soft dough.",
        "Place the dough on a lightly floured counter and knead until very smooth. Divide dough into 50 small, equal pieces. Flatten each piece with your hand to form a thin, round pancake, approximately 3 inches in diameter. The center should be slightly thicker than the edges.",
        "To wrap the dumplings: (See step-by-step photo tutorial)",
        "Using a spoon or chopsticks, place one heaping tablespoon of dumpling filling in the center of the dumpling wrapper.",
        "Using your fingertip, wet the outer edge of the dumpling wrapper with water. Fold up the si While holding the dumpling lengthwise, curved side up, use your index finger and thumb to pinch the edges of the dough on one side of the dumpling into \"pleats,\" pressing each pleat against the flat side of the dough to seal the dumpling as you go. Start at one corner of the dumpling and work your way to the center (making three to four \"pleats\"). Then work from the other corner to the center creating another three to four \"pleats.\"",
        "Firmly press the pleated side of the wrapper against the flat side to be sure the dumpling is completely sealed. If there is too much filling and the dumpling cannot be sealed, remove the extra filling to prevent leakage during cooking.",
        "Line up the finished dumplings on a foil-lined cookie sheet to prevent them from sticking. You can freeze dumplings this way for up to one month.",
        "To cook the dumplings, gently lower them into a medium pot of boiling water and boil for approximately three to five minutes. They are done when the dumpling skins are translucent and the dumplings have been floating for about three minutes. Remove from pot carefully with a slotted spoon.",
        "Serve hot.",
        "In small serving bowl, combine all ingredients. Serve with dumplings."
    ],
    "ingredients": [
        "4 dried shiitake mushrooms",
        "1 ounce dried rice noodles",
        "1/2 pound Napa cabbage",
        "1/2 pound baby bok choy",
        "2 ounces dried bean curd*",
        "3 tablespoons sesame oil",
        "2 tablespoons soy sauce",
        "Pinch of grated fresh ginger",
        "1 ounce monosodium glutamate (optional)",
        "1 packet of frozen dumpling wrappers* OR Dumpling wrappers:",
        "2 1/2 cup all-purpose flour",
        "1 1/4 tsp. salt",
        "1 cup cold water",
        "small bowl of water",
        "3 tablespoons soy sauce",
        "1 teaspoon Chinese black vinegar*",
        "1 teaspoon sesame oil",
        "Pinch of white pepper",
        "Chinese hot pepper sauce* (optional)",
        "Available at specialty Asian markets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Mushroom",
        "Appetizer",
        "Vegetarian",
        "Lunar New Year",
        "Bok Choy",
        "Cabbage",
        "Noodle",
        "Boil",
        "Sugar Conscious",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Vegetarian Dumplings",
    "url": "http://www.epicurious.com/recipes/food/views/vegetarian-dumplings-106238"
}
