{
    "directions": [
        "Place vegetable stock, onion, soy sauce, garlic, cinnamon sticks, ground ginger, star anise, and bay leaves in a large pot; bring to a boil. Reduce heat, cover, and simmer until flavors combine, 30 to 45 minutes. Remove solids with a slotted spoon and keep broth hot.",
        "Place noodles in a large bowl and cover with boiling water. Set aside until noodles are softened, 8 to 10 minutes. Drain and rinse thoroughly. Divide noodles among 6 serving bowls.",
        "Heat oil in a large skillet over medium-high heat until shimmering. Add tofu in a single layer and fry, in batches, until golden brown, about 6 minutes per side.",
        "Simmer fried tofu and mushrooms in broth until heated through, about 5 minutes. Transfer to serving bowls. Top with scallions and cilantro. Ladle in hot broth.",
        "Serve lime wedges, jalapeno peppers, bean sprouts, and basil alongside for garnishing each bowl."
    ],
    "ingredients": [
        "Broth:",
        "10 cups vegetable stock",
        "1 onion, peeled and halved",
        "1/4 cup soy sauce",
        "8 cloves garlic, coarsely chopped",
        "2 (3 inch) cinnamon sticks",
        "2 teaspoons ground ginger",
        "2 pods star anise",
        "2 bay leaves",
        "Soup:",
        "1 (16 ounce) package thin rice noodles (such as Thai Kitchen®)",
        "2 tablespoons vegetable oil, or as needed",
        "2 (14 ounce) packages firm tofu, drained and cut into 1/4-inch slices",
        "8 ounces enoki mushrooms",
        "4 scallions, thinly sliced",
        "1/2 cup coarsely chopped cilantro",
        "1 lime, cut into wedges",
        "2 jalapeno peppers, sliced into rings",
        "1/4 cup mung bean sprouts",
        "1/4 cup Thai basil leaves, torn into bite-size pieces"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vegetarian Pho (Vietnamese Noodle Soup)",
    "url": "http://allrecipes.com/recipe/245936/vegetarian-pho-vietnamese-noodle-sou/"
}
