{
    "directions": [
        "Preheat oven to 375 degrees F.",
        "Melt butter in a large skillet over low heat. Add onion, celery, and bell pepper and saute until they begin to soften. While they are cooking, cut fresh tomatoes in half, squeeze out seeds. Stir the fresh tomatoes into the skillet along with tomato paste and diced canned tomatoes. Bring to a boil, reduce heat to medium low and simmer partially covered to integrate flavors, about 5 minutes. Add stock and cook for another 20 minutes, stirring occasionally.",
        "Season portobello mushrooms with salt and pepper and brush with olive oil. Place on baking sheet in oven for 10 minutes.",
        "Remove pan of tomato mixture from heat, stir in cream and season with salt and pepper, to taste. While the mushrooms are in the oven, puree sauce in batches in food processor. Remove mushrooms from oven and let cool.",
        "To assemble napoleon, place a portobello on serving plate. Top with 1 slice of cheese followed by a slice of tomato, then another slice of cheese, another tomato slice and the second portobello on the top layer. Ladle warm sauce over the vegetable napoleon and finish with a basil sprig, for garnish."
    ],
    "ingredients": [
        "2 tablespoons butter",
        "1 small red onion, diced",
        "3 celery ribs, diced",
        "1 small red bell pepper, diced",
        "1 pound fresh tomatoes",
        "1 tablespoon tomato paste",
        "1 (16-ounce) can diced tomatoes",
        "1 cup chicken stock",
        "1 cup heavy cream",
        "1/2 cup fresh basil",
        "Salt",
        "Freshly ground black pepper",
        "12 portobello mushrooms, cleaned and gills removed",
        "Salt",
        "Freshly ground black pepper",
        "1/4 cup olive oil",
        "12 slices fresh mozzarella cheese",
        "12 large slices fresh tomato",
        "6 sprigs fresh basil"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Easy Appetizer",
        "Appetizer",
        "Easy Recipes",
        "Mushroom Soup",
        "Vegetable Soup",
        "Mushroom",
        "Soup",
        "Vegetable",
        "Tomato Soup",
        "Tomato",
        "American",
        "Cheese",
        "Mozzarella Recipes",
        "Dairy Recipes",
        "Celery",
        "Dinner Parties",
        "Recipes for Parties",
        "Roasting",
        "Pureeing Recipes",
        "Sauteing Recipes"
    ],
    "title": "Vegetable Napoleon with Grilled Portobello Mushroom and Tomato Basil Bisque",
    "url": "http://www.foodnetwork.com/recipes/robert-irvine/vegetable-napoleon-with-grilled-portobello-mushroom-and-tomato-basil-bisque-recipe"
}
