{
    "directions": [
        "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x13-inch baking dish with cooking spray.",
        "Heat olive oil in a large skillet over medium heat; cook and stir onion and bell pepper in hot oil until tender, about 5 minutes. Reduce heat to medium-low and add refried black beans, corn, and cream cheese; stir well. Season with cumin, salt, and pepper. Simmer until bean mixture is hot, about 5 minutes. Remove from heat.",
        "Place cilantro, green chiles and liquid, salsa, tomato sauce, vegetable broth, lime juice, garlic, and oregano in a food processor; blend until smooth, about 10 pulses. Spread about 1/3 cilantro salsa mixture in prepared baking dish.",
        "Spread bean mixture evenly down the center of each tortilla and sprinkle with 1 cup Cheddar cheese. Roll tortillas around the cheese and bean fill and arrange enchiladas in the prepared baking dish, seam sides down.",
        "Pour remaining cilantro salsa mixture over enchiladas and sprinkle with remaining 1 cup Cheddar cheese.",
        "Bake in preheated oven until cheese is melted and sauce is bubbly, 20 to 30 minutes. Garnish with avocado, tomatoes, and sour cream."
    ],
    "ingredients": [
        "cooking spray",
        "2 tablespoons olive oil",
        "1 onion, chopped",
        "1 small red bell pepper, chopped",
        "1 (14.25 ounce) can vegetarian refried black beans",
        "1 cup corn kernels, thawed",
        "1 (4 ounce) package cream cheese, softened",
        "1 teaspoon ground cumin",
        "salt and ground black pepper to taste",
        "1 cup loosely packed and chopped fresh cilantro",
        "1 (4 ounce) can canned green chiles, undrained",
        "1/2 cup tomato salsa",
        "1/2 cup tomato sauce",
        "1/2 cup vegetable broth",
        "1/2 lime, juiced",
        "2 cloves garlic, peeled",
        "2 teaspoons dried oregano",
        "6 flour tortillas",
        "2 cups shredded Cheddar cheese, divided",
        "1 cup chopped avocado",
        "1 cup chopped tomatoes",
        "1/2 cup sour cream, or to taste"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vegetarian Black Bean Enchiladas",
    "url": "http://allrecipes.com/recipe/231937/vegetarian-black-bean-enchiladas/"
}
