{
    "directions": [
        "In a large non-stick skillet heat oil over moderately high heat until hot but not smoking and cook squash and onion with salt to taste, stirring occasionally, until browned lightly, about 5 minutes. Reduce heat to moderately low and cook mixture, covered, stirring occasionally, about 5 minutes, or until squash is almost tender.",
        "While squash mixture is cooking, in a small saucepan bring water to a boil. Stir in couscous and let stand, covered, off heat 5 minutes. Stir in parsley and salt to taste and keep warm, covered.",
        "Add mushrooms to squash mixture and sauté over moderately high heat, stirring occasionally, until mushrooms are golden. In a large measuring cup stir together broth, cider or juice, and flour. Stir broth mixture and raisins into vegetable mixture and simmer over moderate heat until sauce is thickened slightly, about 2 minutes. Place mustard greens or chard on top of stew and add salt to taste. Simmer stew, covered, 1 minute, or until greens are wilted.",
        "Serve stew with couscous."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 small butternut squash (about 1 1/2 pounds), peeled, seeded, and cut into 2-inch cubes",
        "1 medium onion, cut into 6 wedges",
        "1 cup water",
        "2/3 cup couscous",
        "2 teaspoons minced fresh parsley leaves",
        "1/2 pound mushrooms, halved",
        "1 cup low-salt chicken broth or vegetable broth",
        "1/4 cup apple cider or juice",
        "2 teaspoons all-purpose flour",
        "1/4 cup raisins",
        "1/4 pound mustard greens or Swiss chard, stems and center ribs discarded and greens washed, spun dry, and coarsely chopped (about 2 cups)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Vegetable",
        "Stew",
        "Vegetarian",
        "Raisin",
        "Butternut Squash",
        "Winter",
        "Healthy",
        "Vegan",
        "Chard",
        "Mustard Greens",
        "Couscous",
        "Gourmet"
    ],
    "title": "Vegetable Stew with Couscous",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-stew-with-couscous-10097"
}
