{
    "directions": [
        "In a large skillet cook the onion, the scallion, and the mushrooms in the oil over moderately low heat, stirring, until the onion is softened, add the bell peppers and salt and pepper to taste, and cook the mixture over moderate heat, stirring, for 10 to 15 minutes, or until all the liquid the mushrooms give off is evaporated and the peppers are tender. Arrange half the bread cubes in a buttered large shallow (4 1/2-quart) baking dish, spread half the vegetable mixture over them, and sprinkle half the Cheddar and half the Parmesan over the vegetables. Arrange the remaining bread cubes over the cheeses, top them with the remaining vegetables, and sprinkle the remaining cheeses over the top. In a bowl whisk together the eggs, the milk, the mustard, the Tabasco, and salt and pepper to taste, pour the egg mixture evenly over the strata, and chill the strata, covered, overnight. Let the strata stand at room temperature for 15 minutes and bake it in the middle of a preheated 350°F. oven for 50 minutes to 1 hour, or until it is puffed and golden and cooked through."
    ],
    "ingredients": [
        "1 1/2 cups finely chopped onion",
        "1 cup finely chopped scallion",
        "3/4 pound mushrooms, sliced thin",
        "3 tablespoons olive oil",
        "2 red bell peppers, cut into thin strips (about 2 cups)",
        "2 green bell peppers, cut into thin strips (about 2 cups)",
        "enough Italian bread cut into 1-inch cubes to measure 9 cups (about 1 1/2 loaves)",
        "2 1/2 cups coarsely grated extra-sharp Cheddar (about 10 ounces)",
        "1 cup freshly grated Parmesan",
        "12 large eggs",
        "3 1/2 cups milk",
        "3 tablespoons Dijon-style mustard",
        "Tabasco to taste"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Milk/Cream",
        "Egg",
        "Mushroom",
        "Onion",
        "Side",
        "Bake",
        "Vegetarian",
        "Cheddar",
        "Parmesan",
        "Bell Pepper",
        "Gourmet"
    ],
    "title": "Vegetable and Cheese Strata",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-and-cheese-strata-11332"
}
