{
    "directions": [
        "In a saucepan cook the onion in the butter over moderately low heat, stirring occasionally, until it is softened, add the wine, and simmer the mixture for 2 minutes. Add the tomatoes, the sugar, the rosemary, the orégano, the red pepper flakes, and salt to taste, simmer the sauce, stirring occasionally, until it is very thick and the liquid is almost evaporated, and spread it in the bottom of a large shallow casserole or baking dish.",
        "In a kettle of boiling water boil the collards for 10 minutes, or until they are crisp-tender, drain them, and refresh them in a large bowl of cold water. In another large bowl combine well the ricotta, the mozzarella, the egg, the bell peppers, the corn, the scallion, and salt and pepper to taste. Cut out the tough center rib and stem one third of the way up one of the collard leaves and pat the leaf dry. Mound 2 heaping tablespoons of the cheese mixture at the top end of the leaf and roll up the leaf, tucking in the ends to form a roll. Make rolls with the remaining collard leaves and cheese mixture in the same manner.",
        "Arrange the rolls in one layer on the sauce in the casserole and bake the rolls, covered, in the middle of a preheated 375°F. oven for 45 to 50 minutes, or until the sauce is bubbling and the rolls are cooked through. Transfer the rolls carefully with tongs to a platter and keep them warm, covered. Transfer the sauce to a saucepan and boil it until it is thickened. Stir in the parsley and pour the sauce over the rolls."
    ],
    "ingredients": [
        "1 cup chopped onion",
        "2 tablespoons unsalted butter",
        "3 tablespoons dry red wine",
        "a 28-ounce can plum tomatoes, drained and chopped",
        "1/8 teaspoon sugar",
        "1/4 teaspoon crumbled dried rosemary",
        "1/2 teaspoon dried orégano, crumbled",
        "1/8 teaspoon dried hot red pepper flakes, or to taste",
        "20 to 24 large collard leaves, washed well",
        "a 15-ounce container of whole-milk ricotta",
        "1/2 pound whole-milk mozzarella, cut into 1/4-inch dice",
        "1 large egg, beaten lightly",
        "2 small red bell peppers, chopped",
        "a 10-ounce package frozen corn kernels, thawed and patted dry",
        "1/2 cup thinly sliced scallion",
        "1/4 cup minced fresh parsley leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Tomato",
        "Side",
        "Bake",
        "Vegetarian",
        "High Fiber",
        "Mozzarella",
        "Ricotta",
        "Corn",
        "Bell Pepper",
        "Winter",
        "Collard Greens",
        "Parsley",
        "Gourmet",
        "Pescatarian",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vegetable-and Ricotta- Stuffed Collard Rolls with Tomato Sauce",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-and-ricotta-stuffed-collard-rolls-with-tomato-sauce-11642"
}
