{
    "directions": [
        "Cover potatoes with cold salted water by 1 inch, then simmer until just tender, about 20 minutes.",
        "Finely chop mushrooms with shallots and thyme in 2 batches in a food processor. Sauté half of mixture in 2 tablespoons butter with salt and pepper to taste in a 12-inch heavy skillet over moderately high heat, stirring occasionally, until liquid mushrooms give off is evaporated, about 5 minutes. Add 1/4 cup wine and simmer, stirring, until wine is evaporated, about 2 minutes. Transfer to a bowl to cool, then cook remaining mushroom mixture in same manner. Season as needed.",
        "Drain potatoes in a colander and, when cool enough to handle, peel. Force warm potatoes through food mill into a large bowl. Stir in hot milk, garlic, scallions, remaining 4 tablespoons butter, peas (do not crush), and salt and pepper to taste. Cool to room temperature.",
        "Preheat broiler.",
        "Cut 2 thin lengthwise slices from opposite sides of each eggplant and discard. Cut eggplants lengthwise into 1/4-inch-thick slices, then brush both sides with oil and season with salt and pepper. Arrange some eggplant slices in 1 layer on rack of a broiler pan and broil in batches 2 to 3 inches from heat, turning once, until just tender and golden brown on both sides, about 5 minutes total. Cool cooked eggplant on broiler rack 5 minutes, then transfer to a plate. Broil remainder in same manner.",
        "Lay bell peppers on their sides on racks of gas burners and turn flames on high. (Or put peppers on rack of broiler pan about 2 inches from heat.) Roast peppers, turning with tongs, until skins are blackened, 5 to 8 minutes. Transfer peppers to a large bowl and let stand, covered, 15 minutes. Peel peppers, discarding skins. Slit peppers lengthwise and open them flat, discarding seeds and ribs. Pat peppers dry.",
        "Oil springform pans. Roll out 1 sheet of puff pastry on a lightly floured surface with a floured rolling pin into a 16- by 10 1/2-inch rectangle. Trim edges and halve pastry lengthwise. Line half of side of 1 pan with 1 pastry half, leaving a 1 1/2-inch overhang at top and 1 inch of bottom edge on bottom of pan. Gently press pastry into bottom of pan. Repeat with remaining half sheet of dough so that side of pan is completely lined. Gently press together edges of pastry where they meet. Roll out another pastry sheet into a 14-inch square and cut into a 10-inch round using bottom of springform pan as a guide. (Reserve pastry scraps for another use.) Put round in bottom of pan and press edges to seal. Chill pastry-lined pan while repeating procedure with remaining pan and 2 more pastry sheets.",
        "Sprinkle bottoms of pastry shells evenly with bread crumbs. Divide filling ingredients between pastry shells in following manner, seasoning each layer with salt and pressing each layer firmly and evenly into pans: potato mixture, 1 cup cheese (1/2 cup each), eggplant, mushroom mixture (press down firmly on mushrooms with paper towels to remove excess moisture and repeat process until towels are almost dry), roasted peppers, and remaining cup cheese.",
        "Roll out remaining pastry sheet on lightly floured surface with a floured rolling pin into a 16- by 12-inch rectangle, then cut crosswise into 1/2-inch-wide strips with a pizza wheel or a sharp knife. Brush pastry overhang with egg and arrange half of strips in a lattice pattern on top of filling in each torte. Trim strips at edge of pan. Gently press ends of strips into pastry on sides of pans, then roll overhang into inside edge of pan. Brush lattice and rolled edges with egg. Chill tortes 45 minutes.",
        "Position oven rack in bottom third of oven and cover with a large sheet of foil. Preheat oven to 425°F.",
        "Bake tortes on foil in oven, rotating pans halfway through baking, until well browned, 45 to 50 minutes (if tortes get too brown, tent edges with foil). Transfer tortes in pans to a rack. Run a sharp knife around inside edges of pans and carefully remove sides of pans. Cool tortes at least 1 hour (to serve warm) and up to 3 hours (to serve at room temperature)."
    ],
    "ingredients": [
        "2 1/2 lb boiling potatoes such as Yukon Gold",
        "2 lb cremini mushrooms, trimmed and halved",
        "2 shallots, coarsely chopped",
        "1/2 teaspoon dried thyme, crumbled",
        "1 stick (1/2 cup) unsalted butter",
        "1/2 cup dry white wine",
        "1/4 cup whole milk, heated",
        "1 large garlic clove, minced",
        "1/2 cup chopped scallion greens",
        "1 1/2 (15-oz) boxes frozen peas, thawed",
        "2 lb eggplants",
        "1/4 cup olive oil",
        "7 red bell peppers",
        "5 frozen puff pastry sheets (from three 17 1/4-oz packages), thawed",
        "6 tablespoons fine dry bread crumbs",
        "3/4 lb smoked Gouda or mozzarella, coarsely grated (2 cups)",
        "1 large egg, lightly beaten",
        "Special equipment: a food mill fitted with fine disk and 2 (10-inch) springform pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Mushroom",
        "Potato",
        "Vegetable",
        "Appetizer",
        "Bake",
        "Vegetarian",
        "Winter",
        "Phyllo/Puff Pastry Dough",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vegetable Tortes",
    "url": "http://www.epicurious.com/recipes/food/views/vegetable-tortes-104557"
}
