{
    "directions": [
        "Mix rice, 1 Tbsp. coconut oil, a pinch of salt, and 5 cups water in a medium heavy saucepan. Cover and bring to a boil, then reduce heat and simmer until rice is al dente, about 25 minutes. Drain; set aside.",
        "Meanwhile, heat remaining 1 Tbsp. coconut oil in a large pot over medium. Add ginger and garlic and cook, stirring occasionally, until fragrant and just starting to brown, about 1 minute. Add broth, scraping the bottom of the pot with a wooden spoon to release garlic mixture, and bring to a simmer. Add squash and simmer 8 minutes. Add kale and cook, stirring, until vegetables are cooked through, 3–5 minutes.",
        "Whisk miso, tahini, sesame oil, and 1 tsp. salt in a medium bowl. Add 1/2 cup hot water and whisk until very smooth. When vegetables are cooked through, remove pot from heat and gently stir in tahini mixture (overheating tahini will cause it to separate). Season to taste, then immediately divide among bowls with brown rice. Top with scallions, sesame seeds, nori, and chili oil.",
        "Soup can be made 2 days ahead; chill in a resealable container. Reheat gently over low to avoid tahini from separating."
    ],
    "ingredients": [
        "1 1/2 cups short-grain brown rice",
        "2 tablespoons virgin coconut oil, melted, divided",
        "1 teaspoon kosher salt, plus more",
        "1 (1 1/2\") piece ginger, peeled, finely grated",
        "4 garlic cloves, finely chopped",
        "5 cups homemade or store-bought low-sodium vegetable broth",
        "1 small kabocha squash (about 2 pounds), peeled, cut into 1/2\" chunks, or 1 small butternut squash (about 2 pounds), peeled, cut into 1/2\" chunks",
        "1 1/2 cups thinly sliced Tuscan kale",
        "5 tablespoons white miso paste",
        "1/4 cup tahini",
        "1 tablespoon sesame oil",
        "2 scallions, white and pale-green parts only, thinly sliced",
        "2 tablespoons toasted sesame seeds",
        "Toasted nori and hot chili oil (for serving; optional)"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "No Meat, No Problem",
        "Vegetarian",
        "Vegan",
        "Rice",
        "Soup/Stew",
        "Squash",
        "Butternut Squash",
        "Garlic",
        "Kale",
        "Sesame"
    ],
    "title": "Miso-Tahini Squash Soup With Brown Rice",
    "url": "http://www.epicurious.com/recipes/food/views/vegetarian-miso-tahini-squash-soup-with-brown-rice"
}
