{
    "directions": [
        "Heat 2 teaspoons vegetable oil in a large lidded skillet or wok over medium-high heat until it shimmers. Add pepper and onion and cook, stirring occasionally, until crisp-tender, about 5 minutes. Transfer to a bowl.",
        "Add another 2 teaspoons oil to skillet and heat until it shimmers. Add chicken and cook, stirring occasionally, until no longer pink, about 5 minutes. Transfer to bowl with vegetables. (If you are starting with precooked chicken, you can skip this step.)",
        "Add another 2 teaspoons oil and heat until it shimmers. Add chopped zucchini, carrots, cabbage, and sugar snap peas; cook, stirring occasionally, 2 minutes. Add broth and cook, covered, until vegetables are crisp-tender, about 3 minutes more. Transfer to bowl.",
        "Add remaining 3 teaspoons oil to skillet and heat until it shimmers. Add garlic and ginger and cook, stirring, 15 seconds. Add rice (and precooked chicken, if using) and cook, breaking up clumps and stirring occasionally, 2 minutes. Add bowl contents, soy sauce, sesame oil, green onions, and salt. Cook, stirring and tossing, until well mixed and heated through, about 5 minutes more."
    ],
    "ingredients": [
        "9 teaspoons vegetable oil, divided",
        "1 red bell pepper, cut into strips",
        "1/2 medium onion, sliced",
        "1 (6 ounce) skinless, boneless chicken breast half, cut into cubes",
        "2 cups chopped zucchini",
        "2 cups chopped carrots",
        "1 cup chopped cabbage",
        "1 cup chopped sugar snap peas",
        "1/3 cup low-sodium chicken or vegetable broth",
        "1 1/2 tablespoons minced garlic",
        "1 tablespoon minced fresh ginger",
        "2 cups cooked short-grain brown rice",
        "2 tablespoons low-sodium soy sauce",
        "2 teaspoons sesame oil",
        "1/4 cup sliced green onions",
        "1/2 teaspoon salt"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Veggie-Packed Chicken Fried Rice",
    "url": "http://allrecipes.com/recipe/246449/veggie-packed-chicken-fried-rice/"
}
