{
    "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Heat 1 tablespoon olive oil in a skillet over medium heat. Cook and stir onion in hot oil until onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low and continue cooking and stirring until the onion is crisp and dark brown, 15 to 20 minutes more. Remove from heat and set aside to cool; chop into small pieces and place into a large bowl.",
        "Heat remaining 2 tablespoons olive oil in the same skillet over medium-high heat. Add carrots and mushrooms, season with kosher salt and ground black pepper to taste, and cook and stir until carrots start to soften, about 7 minutes. Stir in garlic and cook for another 3 minutes; remove from heat, add artichoke hearts, and set aside and let cool. Transfer vegetables to the bowl with onion.",
        "Mix in feta cheese, bread crumbs, egg, milk, Worcestershire sauce, turkey, parsley, and thyme; season with Italian seasoning and Creole seasoning. Adjust salt and pepper if desired. Thoroughly mix turkey mixture with hands and form into a meatloaf; place loaf on a baking sheet.",
        "Bake meatloaf in preheated oven until no longer pink inside and the juices run clear, 40 to 45 minutes. Combine tomato sauce, balsamic vinegar, and honey to make the glaze; remove meatloaf from the oven, coat with glaze, and bake until glaze has cooked onto the loaf, 5 to 10 more minutes."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "1 yellow onion, halved and thinly sliced",
        "2 tablespoons olive oil",
        "3 carrots, shredded",
        "1 (8 ounce) package cremini mushrooms, chopped",
        "kosher salt and ground black pepper to taste",
        "1/4 cup drained and finely chopped artichoke hearts",
        "2 cloves garlic, minced",
        "1/2 (4 ounce) container crumbled feta cheese",
        "1 cup dry bread crumbs, or more as needed",
        "1 egg, beaten",
        "1/4 cup 2% milk",
        "1 1/2 teaspoons Worcestershire sauce",
        "1 pound extra-lean ground turkey breast",
        "3 tablespoons chopped fresh parsley",
        "1 tablespoon chopped fresh thyme",
        "1 pinch Italian seasoning, or to taste",
        "1 pinch Creole seasoning (such as Tony Chachere's®), or to taste",
        "1/4 cup Italian herb-flavored tomato sauce",
        "2 tablespoons balsamic vinegar, or more to taste",
        "2 tablespoons honey"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Veggie Turkey Meatloaf with Tangy Balsamic Glaze",
    "url": "http://allrecipes.com/recipe/223346/veggie-turkey-meatloaf-with-tangy-bal/"
}
