{
    "directions": [
        "Cut onion in half crosswise. Slice one-half into 1/4\" rings; set aside. Finely chop remaining onion. Pulse chopped onion, garlic, cornmeal, 3/4 cup zucchini, 2 Tbsp. beans, and 2 Tbsp. corn in a food processor until finely chopped, 30–45 seconds.",
        "Heat 1 Tbsp. oil in a large skillet over medium. Add chopped onion mixture and cook, stirring occasionally, until mixture begins to soften and thicken, 3–4 minutes. Add remaining 3/4 cup zucchini and cook, stirring occasionally, until zucchini begins to soften and become translucent, 3–4 minutes more.",
        "Transfer mixture to a large bowl and gently mix in millet, 1/4 cup basil, 3/4 tsp. salt, 3/4 tsp. pepper, and the remaining beans and corn until well combined. Form mixture into 4 (1\"-thick) patties. Cover with plastic and freeze 20 minutes.",
        "Meanwhile, combine mayonnaise, lime zest, lime juice, and remaining 1/4 cup basil in a small bowl; set aside.",
        "Prepare a grill for medium-high heat or heat a grill pan or cast-iron skillet over medium-high; oil grate or pan. Toss reserved onion rings with 1 Tbsp. oil and remaining 1/4 tsp. salt and 1/4 tsp. pepper. Cook onion rings until softened and lightly charred, about 5 minutes.",
        "Brush patties all over with oil. Cook, flipping once, until medium brown and toasted, about 7 minutes on each side; add 1 slice cheese to each during last 3 minutes of cooking. Transfer onions and burgers to a plate. Toast buns until golden brown, about 30 seconds.",
        "Place 1 piece lettuce on each bottom bun and top with a burger. Top with onions. Spread 1 Tbsp. basil mayonnaise on each top bun, add smashed avocado, and close sandwiches."
    ],
    "ingredients": [
        "1 large onion",
        "1 garlic clove, coarsely chopped",
        "1/2 cup cornmeal",
        "1 1/2  cups (packed) coarsely grated zucchini (from about 1 medium zucchini), squeezed to remove excess water,  divided",
        "1/3  cup white beans, rinsed, divided",
        "1/4 cup frozen corn (preferably fire-roasted) , thawed, divided",
        "2 tablespoons vegetable oil, divided, plus more for brushing",
        "3/4 cup cooked millet or white quinoa",
        "1/2  cup finely chopped basil, divided",
        "1  teaspoon kosher salt, divided",
        "1 teaspoon freshly ground black pepper, divided",
        "1/3 cup mayonnaise",
        "1 1/2 teaspoons finely grated lime zest",
        "1 1/2 teaspoons fresh lime juice",
        "4 slices white cheddar",
        "4 hamburger buns",
        "Green leaf lettuce, (for serving)",
        "1 avocado, cubed, lightly smashed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Vegetarian",
        "Vegan",
        "Wheat/Gluten-Free",
        "Zucchini",
        "Corn",
        "Bean",
        "Grill",
        "Back to School",
        "No Meat, No Problem"
    ],
    "title": "Veggie Burgers With Zucchini and Corn",
    "url": "http://www.epicurious.com/recipes/food/views/veggie-burgers-with-zucchini-and-corn"
}
