{
    "directions": [
        "Bring a large pot of water to a boil.",
        "Heat olive oil in a Dutch oven or large heavy-bottom pot over medium-high heat; cook and stir bacon and black pepper until browned and crisp, about 10 minutes. Transfer bacon to a paper towel-lined plate using a slotted spoon, reserving bacon grease and oil in Dutch oven.",
        "Cook linguine in the boiling water until tender yet firm to the bite, 11 to 13 minutes; drain.",
        "Cook and stir shallots and garlic in the bacon grease mixture until shallots are nearly translucent, 5 to 7 minutes. Add maitake mushrooms and salt-free seasoning blend; cook and stir until mushrooms are wilted, about 5 minutes. Sprinkle flour over mushroom mixture; cook and stir until until flour is dissolved and thickened, about 3 minutes.",
        "Slowly pour wine into mushroom mixture while constantly stirring until a smooth and thick sauce forms, about 5 minutes. Add 1 cup water, chicken stock, and butter spread; cook and stir until smooth, 1 to 2 minutes. Reduce heat to low and mix cream, hot sauce, and salt into sauce.",
        "Mix pasta into sauce until coated. If sauce becomes too thick, slowly add more water until desired consistency is reached. Remove from heat and stir spinach and bacon into pasta mixture; top with chives and basil."
    ],
    "ingredients": [
        "1 tablespoon olive oil",
        "6 ounces thick-cut bacon, chopped",
        "salt and ground black pepper to taste",
        "1 pound whole wheat linguine",
        "2 shallots, minced",
        "4 cloves garlic, minced",
        "1 (4 ounce) package maitake mushrooms, roughly chopped",
        "2 tablespoons salt-free seasoning blend (such as Mrs. Dash® Tomato-Basil-Garlic)",
        "2 tablespoons whole wheat flour",
        "1 cup dry red wine",
        "1 cup water",
        "1 tablespoon chicken stock (such as Fond du Poulet®)",
        "1 teaspoon vegan butter spread (such as Smart Balance®), or more to taste",
        "1 1/2 tablespoons heavy whipping cream",
        "1 teaspoon hot sauce (such as Cholula®)",
        "1 cup fresh baby spinach",
        "2 tablespoons chopped fresh chives",
        "4 leaves fresh basil, torn"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Velvety Mushroom and Bacon Pasta",
    "url": "http://allrecipes.com/recipe/245121/velvety-mushroom-and-bacon-pasta/"
}
