{
    "directions": [
        "Bring beans and water (10 cups) to a boil in a 4- to 5-quart heavy pot and boil 2 minutes. Remove from heat and let stand, covered, 1 hour. (Do not drain beans or discard soaking liquid.)",
        "Heat 1/4 cup oil in a wide 6- to 8-quart heavy pot over moderately high heat until hot but not smoking, then sauté onions with 1/2 teaspoon salt, stirring occasionally, until beginning to brown, 7 to 8 minutes. Add carrots, celery, garlic, parsley, rosemary, and pepper and sauté, stirring occasionally, 5 minutes.",
        "Add beans with soaking liquid and Parmigiano-Reggiano rind (if using) and simmer, covered, stirring occasionally, until beans are very tender, 1 1/2 to 2 1/2 hours (depending on age of beans), adding more water if necessary to keep beans covered and stirring more frequently toward end of cooking. Remove from heat and stir in 1/4 cup oil and remaining 1 1/4 teaspoons salt. Cool, uncovered, 20 minutes.",
        "Discard rind and coarsely purée soup in batches in a blender (use caution when blending hot liquids), transferring as puréed to a large bowl.",
        "Return soup to pot and reheat over moderately low heat, stirring frequently and thinning soup as desired with additional water. Season with salt and pepper.",
        "While soup is reheating, cook pasta in a 6- to 8-quart pot of boiling salted water until al dente, then drain in a colander and transfer to a large bowl. Toss with remaining 2 tablespoons oil and pepper to taste.",
        "To serve, ladle soup into bowls and top with spoonfuls of pasta, then drizzle with oil."
    ],
    "ingredients": [
        "1 pound dried borlotti (cranberry) beans (2 2/3 cups), picked over and rinsed",
        "10 cups water",
        "1/2 cup plus 2 tablespoons extra-virgin olive oil plus additional for drizzling",
        "2 medium onions, chopped",
        "1 3/4 teaspoons salt",
        "2 medium carrots, chopped",
        "2 celery ribs, chopped",
        "5 large garlic cloves, finely chopped",
        "1/4 cup chopped fresh flat-leaf parsley",
        "1 teaspoon dried rosemary, crumbled",
        "1/4 teaspoon black pepper",
        "1 roughly 3- by 2-inch piece Parmigiano-Reggiano rind (optional)",
        "3/4 pound dried ditalini or other small tubular pasta"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Blender",
        "Bean",
        "Cheese",
        "Dairy",
        "Herb",
        "Onion",
        "Pasta",
        "Vegetable",
        "Vegetarian",
        "Dinner",
        "Lunch",
        "Gourmet",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added",
        "Kosher"
    ],
    "title": "Venetian-Style Bean and Pasta Soup",
    "url": "http://www.epicurious.com/recipes/food/views/venetian-style-bean-and-pasta-soup-238090"
}
