{
    "directions": [
        "Grind partially frozen venison meat and pork butt together using a meat grinder or food processor; transfer to a large bowl and cover with plastic wrap. Refrigerate for at least 1 hour.",
        "Heat unsalted butter in a skillet over medium-low heat; cook and stir onion, mushrooms, and 1 pinch salt in the melted butter until onion is soft and translucent, 5 to 10 minutes. Remove from heat and cool.",
        "Gently mix ground venison-pork mixture, onion mixture, yogurt, 1 tablespoon Worcestershire sauce, and black pepper together in a bowl until just combined. Form into 6 patties and arrange on a large plate. Cover plate with plastic wrap and refrigerate for at least 1 hour.",
        "Mix mayonnaise, steak sauce, 1 tablespoon Worcestershire sauce, and lime juice together in a bowl until smooth. Cover bowl with plastic wrap and refrigerate until serving time.",
        "Preheat oven to 225 degrees F (110 degrees C).",
        "Spread 1/2 teaspoon butter onto the inside of each split bun.",
        "Heat a non-stick pan over low heat; cook buns, buttered sides down, in the heated pan until lightly browned, 3 to 5 minutes. Transfer buns to a baking sheet and keep warm in the preheated oven.",
        "Heat a non-stick skillet over medium heat; cook burgers, sprinkling each side with a pinch of salt, in the hot skillet until your desired degree of doneness is reached, 3 to 4 minutes per side. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).",
        "Top each burger with a tomato slice and two slices pepper Jack cheese. Remove skillet from heat and cover pan until cheese is slightly melted, about 5 minutes. Spread 1 to 2 tablespoons of sauce onto the inside of each bun bottom. Add a cheese-tomato burger to each bun bottom; top each burger with bun top."
    ],
    "ingredients": [
        "Burgers:",
        "1 1/2 pounds venison meat, cut into 1-inch chunks, partially frozen",
        "3/4 pound fatty pork butt, cut into 1-inch chunks, partially frozen",
        "2 tablespoons unsalted butter",
        "1 1/2 cups diced onion",
        "1 cup diced button mushrooms",
        "1 pinch salt",
        "1/2 cup plain Greek yogurt",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon coarsely ground black pepper",
        "Sauce:",
        "1/2 cup mayonnaise",
        "2 tablespoons steak sauce",
        "1 tablespoon Worcestershire sauce",
        "1 1/2 teaspoons lime juice",
        "Sandwich Fixings:",
        "6 teaspoons softened butter, or as needed",
        "6 hamburger buns, split",
        "1 pinch salt",
        "12 slices pepper Jack cheese",
        "6 (1/4 inch thick) slices tomato"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Venison Burgers",
    "url": "http://allrecipes.com/recipe/230853/venison-burgers/"
}
