{
    "directions": [
        "Melt the butter in a large pot over medium-low heat. Stir in flour until smooth. Cook and stir until the flour turns dark, about 15 to 20 minutes. Stir in the white pepper, 1 teaspoon of salt, brown sugar, cinnamon and nutmeg until smooth.",
        "Gradually whisk in the chicken broth so that no lumps form. Add the green chilies with their liquid, and the crushed garlic cloves. Season with 1 teaspoon of chili powder, 1 teaspoon of cayenne, cumin, cilantro, coriander and oregano. Stir in the corn and beans, and bring to a simmer.",
        "Place the bacon in a large skillet over medium-high heat. Cook, turning occasionally until browned. Add the onion and minced garlic; cook and stir for a few minutes. Add the venison, and season with remaining 3 teaspoons of salt, 1 teaspoon of chili powder and 1 teaspoon of cayenne pepper. Cook, stirring to break the venison to your desired texture, until evenly browned.",
        "Transfer the meat mixture to the pot, and simmer over low heat for at least 1 hour, stirring occasionally."
    ],
    "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3264&h=1709&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1877560.jpg",
    "ingredients": [
        "6 tablespoons butter",
        "2 tablespoons all-purpose flour",
        "½ teaspoon ground white pepper",
        "4 teaspoons salt, divided",
        "2 tablespoons brown sugar",
        "1 teaspoon ground cinnamon",
        "½ teaspoon ground nutmeg",
        "4 cups chicken broth",
        "1 (4 ounce) can green chiles, peeled and seeded, diced, liquid reserved.",
        "6 cloves garlic, crushed",
        "2 teaspoons chili powder, divided",
        "2 teaspoons cayenne pepper, divided",
        "1 tablespoon ground cumin",
        "1 tablespoon dried cilantro",
        "1 teaspoon ground coriander seed",
        "1 teaspoon dried oregano",
        "1 (15 ounce) can whole kernel corn, drained",
        "1 (15 ounce) can great Northern beans, rinsed and drained",
        "1 pound ground venison",
        "1 pound sliced bacon, diced",
        "1  red onion, chopped",
        "6 cloves garlic, minced"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Venison-Bacon White Chili",
    "url": "http://allrecipes.com/recipe/83394/venison-bacon-white-chili/"
}