{
    "directions": [
        "Preheat oven to 325°F. Cook bacon in heavy large pot over medium heat until fat has rendered and bacon is crisp. Transfer bacon to paper towels to drain. Reserve pot with drippings.",
        "Sprinkle venison with salt and pepper. Dust with flour; toss to coat. Working in 3 batches, cook venison in bacon drippings over medium-high heat until browned, about 4 minutes per batch. Transfer venison to bowl. Add oil, onion, and garlic to pot. Sauté over medium heat until beginning to brown, about 8 minutes. Return venison with any accumulated juices to pot. Add coriander, cumin, and pepper. Stir 2 minutes. Add chicken broth and bring to simmer. Cover and transfer to oven. Braise venison 45 minutes.",
        "Remove pot from oven; add wine, return to oven, and cook uncovered until sauce thickens slightly, about 40 minutes. (Daube can be made 2 days ahead. Refrigerate bacon. Cool daube slightly. Refrigerate uncovered until cold, then cover and keep refrigerated. Rewarm daube over medium-low heat before continuing.)",
        "Transfer daube to bowl; sprinkle with cilantro and reserved bacon."
    ],
    "ingredients": [
        "4 bacon slices, chopped",
        "1 2 1/4- to 2 1/2-pound venison roast (bottom end of loin, or New York strip) or beef chuck roast, cut into 1 1/2-inch cubes",
        "3 tablespoons all-purpose flour",
        "1 tablespoon olive oil",
        "1 large red onion, chopped",
        "3 garlic cloves, pressed",
        "1 tablespoon ground coriander",
        "2 teaspoons ground cumin",
        "1/2 teaspoon ground black pepper",
        "1 1/2 cups low-salt chicken broth",
        "1/2 cup dry red wine",
        "Chopped fresh cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Game",
        "Herb",
        "Sauté",
        "Dinner",
        "Venison",
        "Fall",
        "Coriander",
        "New York",
        "Sugar Conscious",
        "Kidney Friendly",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Venison Daube with Cumin and Coriander",
    "url": "http://www.epicurious.com/recipes/food/views/venison-daube-with-cumin-and-coriander-232877"
}
