{
    "directions": [
        "Soak the beans overnight. In the morning, pick out any bad ones and any stones. Wash the beans and place them in a large pot filled with water. Place the garlic, coriander seeds, and bay leaf in a cheesecloth bag or tea ball and add to the beans in the water. Bring the water to a boil, reduce the heat to a simmer, and cook the beans 1 hour, until tender. Discard the spices. Drain the beans well and set aside while you make the chili. Add the salt.",
        "Place the chiles in a large heatproof bowl and cover with boiling water. Let stand 30 minutes, until soft; then seed and stem them. In a food processor or blender, puree the chiles with 1 cup water until smooth. Set aside.",
        "In a large skillet, brown the bell pepper, onions, and garlic in 2 tablespoons of the oil until they are soft. Set aside.",
        "In a large Dutch oven, brown the venison and sausage in the remaining 2 tablespoons of oil. Drain the excess fat. Add the bell pepper mixture along with the salt, pepper, oregano, cumin, sugar, and 3 cups water. Add the tomatoes, smashing each in the palm of your hand before adding it to the pot. Add the chile puree, stir and bring to a boil. Reduce the heat and cook, partially covered, at a low boil for 1 1/2 hours. Remove from the heat. Add the masa harina mixture, stirring to thicken the chili. Return the chili to the heat and cook 7 more minutes.",
        "Serve in deep bowls atop a bed of snowcap beans."
    ],
    "ingredients": [
        "16 ounces dried snowcap beans (found in gourmet or health food stores)",
        "5 garlic cloves",
        "1 tablespoon whole coriander seeds",
        "1 bay leaf",
        "1 tablespoon salt",
        "8 dried ancho chiles",
        "1 large green bell pepper, seeded and chopped",
        "1 cup chopped onions",
        "3 garlic cloves, minced",
        "4 tablespoons vegetable oil",
        "3 1/2 pounds lean venison (or beef), cut into 1/2-inch cubes",
        "1 1/2 pounds sweet pork sausage, cut into 1-inch cubes",
        "1 tablespoon salt",
        "1 1/2 teaspoons freshly ground black pepper",
        "1 1/2 teaspoons dried Mexican oregano",
        "2 teaspoons ground cumin",
        "2 tablespoons sugar",
        "two 14 1/2-ounce cans whole tomatoes",
        "2 tablespoons masa harina dissolved in 1/2 cup water"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Soup/Stew",
        "Bean",
        "Onion",
        "Pork",
        "Tomato",
        "Super Bowl",
        "Venison",
        "Sausage",
        "Bell Pepper",
        "Winter",
        "Tailgating"
    ],
    "title": "Venison Chili with Snowcap Beans",
    "url": "http://www.epicurious.com/recipes/food/views/venison-chili-with-snowcap-beans-100552"
}
