{
    "directions": [
        "In a large mixing bowl, cream together 1/2 cup softened butter and 1/4 cup sugar until pale, about 3 minutes; beat in egg.",
        "In a separate bowl, mix flour and cocoa powder. Using a wooden spoon, stir the dry ingredients into the creamed mixture and gather the dough into a ball. Flatten the dough into a disk and wrap in waxed paper; refrigerate for at least 2 hours.",
        "Preheat oven to 325 degrees F (165 degrees C).",
        "On a lightly floured surface, roll out chilled dough into a 10 inch round and about 1/4 inch thickness. Transfer dough to an 8 inch tart pan, pressing dough evenly into pan; prick all over with a fork and freeze for 10 minutes.",
        "Bake tart shell in preheated oven for 12 minutes; transfer to a rack to cool.",
        "To make caramel: In a small saucepan over low heat, bring 1/2 cup heavy cream to a simmer. In a heavy medium saucepan over high heat, gradually add 1/2 cup sugar in small amounts, stirring constantly, until it melts and turns golden brown. Remove saucepan from heat and slowly stir in hot cream; stir in 2 tablespoons butter and allow mixture to cool.",
        "To make chocolate cream: In a medium bowl, combine semisweet chocolate and liqueur. In a small saucepan over high heat, bring remaining 1/2 cup heavy cream to a boil and pour it over chocolate; stir mixture with a wooden spoon until chocolate is melted and very smooth.",
        "Reserve 13 whole macadamia nuts and chop the rest. Pour cooled caramel into the cooled tart shell and spread evenly with a metal spatula; sprinkle chopped nuts over caramel. Pour chocolate cream on top and spread evenly.",
        "Arrange 10 whole nuts around the edge of the tart to mark 10 slices; place remaining 3 nuts in the center. Refrigerate the tart for 1 hour or until firm; serve."
    ],
    "ingredients": [
        "1/2 cup unsalted butter, softened",
        "1/4 cup white sugar",
        "1 egg, beaten",
        "1 1/8 cups cake flour",
        "7 tablespoons unsweetened cocoa powder",
        "1/2 cup heavy cream",
        "1/2 cup white sugar",
        "2 tablespoons unsalted butter",
        "3 ounces semisweet chocolate, chopped",
        "3/4 teaspoon coffee liqueur",
        "1/2 cup heavy cream",
        "1 cup macadamia nuts, whole"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Venus' Chocolate Macadamia Nut Tart",
    "url": "http://allrecipes.com/recipe/17356/venus-chocolate-macadamia-nut-tart/"
}
