{
    "directions": [
        "Preheat the oven to 350°F (175°C).",
        "Butter the bottom and sides of a 9-inch (23cm) fluted tart pan with removable bottom. Set aside.",
        "In a large bowl, combine the melted butter and the sugar, and using a wooden spoon, stir to blend. Add the remaining ingredients and stir to form a soft, cookie-like dough. Transfer the dough to the center of the buttered pan. Using the tips of your fingers, evenly press the pastry along the bottom and up the sides of the pan. The pastry will be quite thin.",
        "Place the pan in the center of the oven and bake unitl the dough is slightly puffy and set, 12 to 15 minutes. Sprinkle the ground almonds over the bottom of the crust. (This will prevent the crust from becoming soggy.)",
        "In a medium-size bowl, combine the crème fraîche, egg, extracts and honey and whisk to blend. Whisk in the flour.",
        "Pour the filling evenly over the pastry. Starting just inside the edge of the pan, neatly overlap the halved apricots, cut side up, at an angle. Arrange in two or three concentric circles, working toward the center. Fill in the center with the remaining apricots.",
        "Place the tart pan on a baking sheet. Place the baking sheet in the center of the oven and bake until the filling is firm and the pastry is a deep golden brown, 55 to 60 minutes. The apricots will shrivel slightly. Remove from the oven and immediately sprinkle with confectioners' sugar. Place the tart on a rack to cool. Sprinkle again with confectioners' sugar just before serving."
    ],
    "ingredients": [
        "8 tablespoons (4 ounces; 12 g) unsalted butter, melted and cooled",
        "1/2 cup (100 g) sugar",
        "1/4 teaspoon pure almond extract",
        "1/4 teaspoon pure vanilla extract",
        "1/2 teaspoon fine sea salt",
        "1 1/4 cups plus 1 tablespoon (180 g) unbleached all-purpose flour",
        "2 tablespoons finely ground unblanched almonds",
        "1/2 cup (25 cl) crème fraîche or heavy (whipping) cream",
        "1 large egg lightly beaten",
        "1/2 teaspoon pure almond extract",
        "1/2 teaspoon pure vanilla extract",
        "2 tablespoons full-flavored honey, such as lavender",
        "1 tablespoon superfine flour, such as Wondra",
        "About 1 1/2 pounds (750 g) fresh apricots, pitted and halved (do not peel)",
        "Confectioners' sugar, for garnish"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dessert",
        "Bake",
        "Picnic",
        "Apricot",
        "Summer",
        "Party",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Verlet's Apricot Tart",
    "url": "http://www.epicurious.com/recipes/food/views/verlets-apricot-tart-101800"
}
