{
    "directions": [
        "Mix first 4 ingredients in small bowl.",
        "Roll out puff pastry on lightly floured work surface to 18x10-inch rectangle (pastry will be thin). Sprinkle 1/3 of cheese mixture evenly over half of pastry; fold plain half of pastry over cheese, forming 10x9-inch rectangle; press to adhere. Repeat 2 more times, rolling to 18x10-inch rectangle, sprinkling with 1/3 of cheese mixture, and folding. Roll out pastry again to 18x10-inch rectangle. Transfer to unlined baking sheet. Chill 30 minutes.",
        "Position 1 rack in top third and 1 rack in bottom third of oven; preheat to 425°F. Line 2 large baking sheets with parchment paper. Cut pastry crosswise in half, forming two 10x9-inch rectangles. Trim and discard uneven edges of pastry. Cut each rectangle crosswise into scant 1/2-inch-wide strips. Twist each strip a few times and place on prepared baking sheets, spacing 1/2 inch to 3/4 inch apart, dabbing ends lightly with water and pressing to adhere to parchment.",
        "Bake twists until golden brown, reversing position of sheets halfway through baking, about 10 minutes total. Cool twists on sheets. (Can be prepared 1 day ahead. Cover twists on sheets tightly with foil and store at room temperature. If desired, rewarm uncovered in 350°F oven until heated through, about 5 minutes.)",
        "Serve warm or at room temperature."
    ],
    "ingredients": [
        "1 3/4 cups finely grated sharp white cheddar cheese (about 6 ounces)",
        "3/4 teaspoon dried thyme",
        "3/4 teaspoon dried rubbed sage",
        "1/2 teaspoon coarsely ground black pepper",
        "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Cheese",
        "Herb",
        "Appetizer",
        "Bake",
        "Cheddar",
        "Winter",
        "Sage",
        "Thyme",
        "Phyllo/Puff Pastry Dough",
        "Sugar Conscious",
        "Kidney Friendly",
        "Vegetarian",
        "Pescatarian",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "Kosher"
    ],
    "title": "Vermont Cheddar Cheese and Herbed Twists",
    "url": "http://www.epicurious.com/recipes/food/views/vermont-cheddar-cheese-and-herbed-twists-107466"
}
