{
    "directions": [
        "Position a rack in the lower third of the oven and preheat it to 350°F/180°C/gas 4. Grease an 8-by-8-in/20-by-20-cm baking pan with coconut oil. Cover the bottom of the pan with a piece of parchment paper, and then grease the top of the parchment paper.",
        "Chop 3 oz/85 g of the chocolate into pieces no larger than chocolate chips. Set them aside. Break the remaining 5 oz/140 g of the chocolate into pieces about 1/2 in/12 mm wide and put them in the top of a double boiler or in a bowl suspended over a pan of barely simmering water. Stir frequently, until the chocolate is melted and smooth. Remove it from the heat and transfer the chocolate to a large mixing bowl. Stir in the coconut oil, and let cool for 10 to 15 minutes.",
        "Put the chia seeds in a small mixing bowl and whisk in the coffee. Let sit 5 to 10 minutes until it thickens (this is our egg substitute). Whisk again to make sure there are no lumps.",
        "Whisk the sugar into the chocolate mixture. Add the vanilla and the chia mixture and whisk vigorously until blended.",
        "In a medium mixing bowl, whisk together the flour, salt, and baking soda. Stir the flour mixture into the chocolate mixture, then fold in the reserved chopped chocolate and the walnuts. Do not overmix. Transfer the batter to the prepared pan and bake for 40 to 50 minutes, until the top feels dry and the brownies feel firm when a toothpick is inserted in the center. Watch them closely during the final minutes of baking to make sure the edges don't burn.",
        "Transfer the pan to a wire rack to cool. These brownies are best when they cool overnight or are refrigerated for 2 hours after they come to room temperature. When they are ready to serve, cut into 16 squares. The brownies will stay fresh at room temperature for about 5 days in an airtight container, and they also freeze well."
    ],
    "ingredients": [
        "8 oz/225 g high-quality semisweet chocolate",
        "1/2/120 ml cup melted coconut oil (see notes below)",
        "3 tbsp ground chia seeds",
        "3/4 cup/180 ml espresso or strong black coffee (regular or decaffeinated), at room temperature",
        "1 1/4 cups/250 g packed light brown sugar",
        "1 tsp pure vanilla extract",
        "3/4 cup/105 g whole-wheat pastry flour",
        "1/2 tsp salt",
        "1/4 tsp baking soda",
        "2/3 cup/75 g chopped walnuts"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Coffee",
        "Chocolate",
        "Dessert",
        "Bake",
        "Vegan",
        "Kidney Friendly",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Soy Free"
    ],
    "title": "Very Chocolaty Chocolate Brownies",
    "url": "http://www.epicurious.com/recipes/food/views/very-chocolaty-chocolate-brownies-51235350"
}
