{
    "directions": [
        "Preheat oven to 325 degrees F (165 degrees C).",
        "Cut butter into 1-tablespoon pieces, quarter the pieces, and refrigerate butter until needed.",
        "Use your fingers to loosen the skin over the turkey breast and thighs. Cut a hole in the turkey skin between tail and body (to affix legs); cut a hole on each side of the turkey beneath each wing (to affix wings). Rub the entire skin with vegetable oil.",
        "Toss apple and onion wedges, garlic cloves, and celery in a large bowl until combined; sprinkle poultry seasoning over the apple mixture and toss again to coat. Stuff the body and neck cavities with the apple mixture. Insert each wing tip into the hole under the wing to secure wings; insert both legs into hole near tail to secure legs.",
        "Place turkey onto a rack and set in a roasting pan. Insert cold butter pieces under the loosened skin, distributing the butter as evenly as possible.",
        "Roast the turkey in the preheated oven until an instant-read meat thermometer inserted into the thickest part of a thigh, not touching bone, reads 160 degrees F (70 degrees C), about 3 1/2 hours. Check for doneness after 3 hours.",
        "Remove roasting pan containing turkey from oven and cover with aluminum foil, lightly pressing the foil directly onto the bird. Let the turkey rest for 40 minutes before carving."
    ],
    "ingredients": [
        "1/2 cup cold butter",
        "1 (12 pound) whole turkey, neck and giblets removed",
        "1 tablespoon vegetable oil",
        "2 Granny Smith apples - cored, peeled, and cut into 8 wedges each",
        "1 large onion, cut into 8 wedges",
        "1/2 whole head garlic, separated into cloves and peeled",
        "1 pound celery, cut into 2-inch lengths",
        "1 tablespoon poultry seasoning"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Very Moist and Flavorful Roast Turkey",
    "url": "http://allrecipes.com/recipe/230121/very-moist-and-flavorful-roast-turkey/"
}
