{
    "directions": [
        "Cover beans, smashed garlic, and bay leaves with about 1\" water in a large pot. Add 3 Tbsp. oil. Bring to a boil, then reduce heat and bring to a simmer. Cover pot partially and cook, adding more hot water as needed to keep beans covered, until beans are nearly done. Add large pinches of salt to taste toward end of cook time, which will vary depending on the bean; start tasting after about 30 minutes. Remove from heat and cover.",
        "Preheat oven to 375°F. Heat remaining 3 Tbsp. oil in a Dutch oven or large ovenproof dish over medium-high. Add onions, red pepper, and 1/2 tsp. salt. Cook, stirring occasionally, until onions are reduced and beginning to caramelize, about 10 minutes. Add sliced garlic and cook until golden brown, about 5 minutes more. Add wine and cook until slightly reduced, about 1 minute. Add cabbage and cook until softened, about 2 minutes. Add tomatoes, crushing with a wooden spoon or cutting with scissors into coarse chunks. Add beans and their liquid, then cover with water until beans and vegetables are just submerged; season to taste with salt. Bring to a boil, cover, and transfer to oven.",
        "Bake beans 1 hour and 20 minutes. Uncover and continue to bake until liquid is slightly reduced and beans are completely tender, 15–30 minutes more. Let cool slightly to thicken, then stir in parsley just before serving.",
        "Chili-Like:\nServe just as you would your favorite chili, with shredded cheddar, sliced scallions, finely chopped jalapeño, dollops of sour cream or plain yogurt, and hot sauce.",
        "Baked With Eggs:\nPreheat oven to 400°F. Transfer beans to a shallow baking dish. Crack an egg into a ladle, then press ladle into beans and slide egg into the indentation. Repeat, adding as many eggs as you’ve got space and appetite for. Bake until eggs are set and beans are heated through and simmering along edges of pan, 25-30 minutes. Drizzle with olive oil and garnish with chopped herbs; serve with toasted bread.",
        "Over Grains:\nServe beans over piles of soft polenta. Brown rice, farro, and barley all work just as well.",
        "Over Toast:\nSpoon hot beans over thick slices of grilled or toasted bread (optional: rub it with a garlic clove). Top with a poached or fried egg and a drizzle of olive oil. Serve with lightly dressed greens alongside.",
        "Tacos:\nChar corn tortillas over an open flame, stacking and wrapping in foil to keep warm. If broth is thin, serve beans with a slotted spoon, reserving broth for a separate meal. Serve with sliced avocado, shredded cabbage, crumbled feta, lime wedges, and cilantro sprigs, allowing everyone to assemble as they please.",
        "Baked beans can be made 3 days ahead; transfer to an airtight container and chill, or freeze up to 6 months.\nBeans can be cooked (before baking) 1 day ahead; let cool, cover, and chill."
    ],
    "ingredients": [
        "1 pound dried medium or large beans, soaked at least 4 hours in plenty of water, drained",
        "11 garlic cloves, 5 smashed, 6 sliced",
        "3 bay leaves",
        "6 Tbsp. olive oil, divided",
        "Kosher salt",
        "2 medium white onions, thinly sliced, or a combination of onions and fennel bulbs (about 3 cups)",
        "Pinch of red pepper flakes",
        "1/2 cup dry white wine",
        "1/2 medium head savoy cabbage, cored, cubed (about 8 cups)",
        "1 (28-ounce) can whole tomatoes",
        "1 bunch parsley, dill, or cilantro, finely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Bean",
        "Bake",
        "Cabbage",
        "Healthy",
        "White Wine",
        "Tomato",
        "Garlic",
        "Onion"
    ],
    "title": "Very Versatile Baked Beans With Cabbage",
    "url": "http://www.epicurious.com/recipes/food/views/very-versatile-baked-beans-with-cabbage"
}
