{
    "directions": [
        "To prepare the pastry, pulse together the flour, butter, and salt in the bowl of a food processor fitted with a plastic blade until the butter is about the size of small peas—about ten pulses. Gradually, drizzle in the ice water while pulsing. The amount needed will depend on the moisture content of the flour. Add just enough water for the dough to form a loose ball. Turn the pastry out onto a lightly floured surface and quickly form the dough into a 1-inch-thick disk. Wrap with plastic wrap and refrigerate for 30 minutes (or up to three days) to rest. Preheat oven to 375 degrees about 20 minutes before you're planning to bake the tart.",
        "Meanwhile, prepare the filling. Heat a large sauté pan over medium-high heat. Add the bacon in a single layer and cook, turning as needed, until the bacon is crispy and the fat has been rendered. Remove the bacon to drain on paper towels to cool, chopping coarsely once cool enough to handle. Reserve 2 tablespoons of the bacon fat (discarding the rest or using for another purpose) in the pan and reduce the heat to medium. Add the onions, salt, pepper, and thyme. Cook over medium heat until the onions have softened, stirring frequently, about 15 minutes. Do not let the onions brown!",
        "Add the wine and increase the heat to medium-high. Cook until the wine has cooked down to a glaze, about 3 minutes. Reduce the heat to medium-low and add the honey and reserved chopped bacon. Stir and cook 5 minutes more. Remove the onion mixture from the heat and spoon into a shallow pan; refrigerate to cool. When cooled, drain off any excess pan juices and stir in the egg and cream. Adjust seasonings as needed.",
        "To assemble, roll the reserved dough to 1/4 inch thickness. Line the pan(s) with the pastry and form even edges. Refrigerate another 10 minutes, then line the pastry with parchment paper and fill with pie weights. Bake 20 to 25 minutes, or until lightly browned. Remove the paper and weights and bake another 15 to 20 minutes to brown the bottom. Allow to cool slightly before filling. Reduce the oven temperature to 350 degrees. Fill the pastry crust with the onion mixture and bake until golden brown and the filling is set, about 35 minutes."
    ],
    "ingredients": [
        "3 cups all-purpose flour",
        "1 cup cold, unsweetened butter, cut into 1-inch cubes",
        "1 teaspoon salt",
        "4 to 6 tablespoons ice water",
        "4 slices bacon",
        "5 large Vidalia onions, peeled, halved, and thinly sliced",
        "Salt and freshly ground pepper",
        "2 tablespoons coarsely chopped fresh thyme leaves",
        "1/4 cup dry white wine",
        "3 tablespoons local honey",
        "1 egg, beaten",
        "2 tablespoons whole cream",
        "1 (12-inch) tart pan or 2 (9-inch) tart pans"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Food Processor",
        "Onion",
        "Vegetable",
        "Brunch",
        "Bake",
        "Dinner",
        "Condiment",
        "Meat",
        "Bacon",
        "Honey",
        "Thyme",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Vidalia Onion Tart with Bacon, Local Honey, and Fresh Thyme",
    "url": "http://www.epicurious.com/recipes/food/views/vidalia-onion-tart-with-bacon-local-honey-and-fresh-thyme-354950"
}
