{
    "directions": [
        "Whisk together garlic, sugar, fish sauce, oil, lime juice, and hot sauce in a large bowl until sugar is dissolved. Add chicken and toss to coat, then marinate 15 minutes.",
        "Cut carrots and radish into 1/8-inch-thick matchsticks (2 inches long) with slicer. Whisk together vinegar, sugar, and salt in a bowl until sugar is dissolved, then add vegetables and toss to combine. Let stand, tossing occasionally, until wilted, about 15 minutes.",
        "Heat grill pan over moderately high heat until hot, then grill chicken in 4 batches, turning over once with tongs, until just cooked through, about 1 minute total per batch. Transfer chicken to a plate as grilled and keep warm, covered with foil. Serve with pickle and accompaniments.",
        "*Available at Asian markets, cookware shops, and Uwajimaya (800-889-1928)."
    ],
    "ingredients": [
        "2 garlic cloves, minced",
        "3 tablespoons sugar",
        "1 1/2 tablespoons Asian fish sauce",
        "1 1/2 tablespoons vegetable oil",
        "1 tablespoon fresh lime juice",
        "1 1/2 teaspoons Sriracha or other Asian hot chile sauce",
        "1 1/2 lb skinless boneless chicken breasts, cut crosswise into 1/4-inch-thick slices",
        "2 medium carrots, peeled",
        "1/2 lb daikon radish, peeled",
        "1/2 cup rice vinegar (not seasoned)",
        "1/4 cup sugar",
        "1 teaspoon salt",
        "Special equipment: a Japanese Benriner* or other adjustable-blade slicer; a well-seasoned ridged grill pan",
        "Accompaniments: at least 8 large red- or green-leaf lettuce leaves; about 8 fresh mint, basil, and/or cilantro sprigs; Sriracha or other Asian hot chile sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Poultry",
        "Vegetable",
        "Marinate",
        "Carrot",
        "Radish",
        "Brine",
        "Grill/Barbecue",
        "Gourmet"
    ],
    "title": "Vietnamese Sticky Chicken with Daikon and Carrot Pickle",
    "url": "http://www.epicurious.com/recipes/food/views/vietnamese-sticky-chicken-with-daikon-and-carrot-pickle-231644"
}
