{
    "directions": [
        "Whisk first 3 ingredients in large bowl until dissolved. Add daikon and carrots; toss to coat. Let stand at room temperature 2 hours. (Can be prepared 5 days ahead. Cover and chill.) Drain well.",
        "Mix first 8 ingredients in 13x9x2-inch baking dish. Add chicken; turn to coat. Let marinate at room temperature 1 hour, turning often.",
        "Prepare barbecue (medium-high heat) or preheat broiler. Brush grill rack with oil. Remove chicken from marinade, leaving some still clinging to chicken. Grill or broil chicken until cooked through, about 6 minutes per side. Transfer to plate; tent with foil to keep warm.",
        "Grill or broil cut sides of bread until lightly toasted. Spread mayonnaise on bottom half of baguette pieces. Top with cucumber slices. Top each with 1 chicken thigh, drained daikon and carrots, then onion slices and cilantro sprigs. Sprinkle with jalapeño slices, soy sauce, and ground black pepper. Place top baguette piece over, pressing to compact, and serve immediately.",
        "*Available at some supermarkets and at Asian markets.",
        "*Brown star-shaped seedpods; available in the spice section of some supermarkets and at specialty foods stores and Asian markets."
    ],
    "ingredients": [
        "3/4 cup sugar",
        "3/4 cup distilled white vinegar",
        "1/4 teaspoon (rounded) salt",
        "3 cups matchstick-size pieces daikon (Japanese white radish)*",
        "3 cups matchstick-size pieces peeled carrots",
        "1/4 cup soy sauce",
        "6 garlic cloves, minced",
        "4 shallots, chopped",
        "2 tablespoons fish sauce (nam pla or nuoc nam)*",
        "2 tablespoons oyster sauce*",
        "1 tablespoon sugar",
        "2 teaspoons five-spice powder*",
        "2 whole star anise,** ground in spice mill",
        "6 large skinless boneless chicken thighs",
        "Vegetable oil",
        "6 6-inch-long pieces baguette, split lengthwise, some of soft centers removed",
        "Mayonnaise",
        "1 English hothouse cucumber, cut into 6-inch-long 1/4-inch-thick slices",
        "1/2 red onion, halved through stem, thinly sliced crosswise, rinsed, drained well",
        "12 fresh cilantro sprigs",
        "2 jalapeño chiles, thinly sliced crosswise",
        "Additional soy sauce"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Sandwich",
        "Chicken",
        "Garlic",
        "Breakfast",
        "Brunch",
        "Broil",
        "Lunch",
        "Carrot",
        "Radish",
        "Jalapeño",
        "Cilantro",
        "Soy Sauce",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Vietnamese Sandwiches with Five-Spice Chicken",
    "url": "http://www.epicurious.com/recipes/food/views/vietnamese-sandwiches-with-five-spice-chicken-233499"
}
