{
    "directions": [
        "Mix first 4 ingredients in small bowl. Set dipping sauce aside.",
        "Heat oil in medium skillet over medium-high heat. Add ginger; sauté until fragrant, about 10 seconds. Add shrimp and cilantro; sauté until shrimp are just cooked through, about 1 minute. Remove from heat. Season with salt and pepper.",
        "Pour hot water into large bowl. Using tongs, dip 1 spring-roll sheet in water 5 seconds. Remove from water; place on wet towel. Let stand 30 seconds (spring-roll sheet should be soft and pliable; if still stiff, sprinkle with more water).",
        "Place half of lettuce leaf across top third of spring-roll sheet. Arrange 4 shrimp halves on lettuce. Top with 1 tablespoon each of green onions and cucumber. Sprinkle 1/2 teaspoon mint over filling. Fold sides of spring-roll sheet over ends of filling. Starting at filled side, roll into cylinder. Place on plate. Repeat with remaining spring-roll sheets, lettuce, shrimp, green onions, cucumber and mint. Serve with sauce."
    ],
    "ingredients": [
        "1/4 cup fish sauce (nam pla)",
        "2 tablespoons thinly sliced green onion",
        "1 1/2 tablespoons fresh lime juice",
        "Pinch of dried crushed red pepper",
        "2 teaspoons olive oil",
        "2 teaspoons minced fresh ginger",
        "16 uncooked medium shrimp, peeled, deveined, halved lengthwise",
        "1/4 cup chopped fresh cilantro",
        "4 cups hot water",
        "8 6-inch-diameter Vietnamese spring-roll sheets",
        "4 small Bibb lettuce leaves, halved",
        "1/2 cup thin strips green onions",
        "1/2 cup thin strips seeded peeled cucumber",
        "4 teaspoons minced fresh mint leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Shellfish",
        "Vegetable",
        "Appetizer",
        "Mint",
        "Shrimp",
        "Cucumber",
        "Winter",
        "Cilantro",
        "Pescatarian",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Vietnamese-Style Spring Rolls with Shrimp",
    "url": "http://www.epicurious.com/recipes/food/views/vietnamese-style-spring-rolls-with-shrimp-4626"
}
