{
    "directions": [
        "Preheat oven to 375°F. Line a rimmed baking sheet with parchment paper.",
        "Sprinkle each half of squash with 1/4 tsp. salt, then place cut side down on prepared baking sheet. Bake until interior of squash is fork-tender, 40–50 minutes. Let cool.",
        "Meanwhile, whisk fish sauce, brown sugar, ginger, garlic, 2 Tbsp. lime juice, and 1/2 tsp. salt in a large bowl. Transfer 3 Tbsp. fish sauce mixture to a shallow wide bowl. Add steak and turn to coat. Let sit at room temperature at least 30 minutes.",
        "Add jalapeño, sesame oil, and remaining 6 Tbsp. lime juice to remaining fish sauce mixture in large bowl and stir to combine.",
        "Using a fork, scrape squash crosswise to pull strands from shells into a large bowl; discard shells. Toss squash with 4 Tbsp. jalapeño sauce and remaining 1/2 tsp. salt.",
        "Heat vegetable oil in a large heavy skillet over high; pat steak dry. Working in batches if needed, sear steak until browned, about 3 minutes per side for medium-rare. Let rest 5 minutes, then thinly slice lengthwise against the grain.",
        "Divide squash among bowls. Toss lettuce, carrot, cucumber, and bean sprouts in remaining jalapeño sauce, then arrange over squash. Add steak to bowls, then top with scallions, cilantro, and peanuts.",
        "Squash can be cooked 2 days ahead. Let cool completely, then store in an airtight container and chill. Steak can be marinated 1 day ahead. Store in a resealable plastic bag and chill."
    ],
    "ingredients": [
        "1 medium spaghetti squash (2–2 1/2 pounds), halved lengthwise, seeded",
        "1 1/2 teaspoons kosher salt",
        "1/4 cup fish sauce",
        "1 tablespoon brown sugar",
        "1 tablespoon finely grated fresh ginger",
        "2 garlic cloves, finely grated",
        "1/2 cup fresh lime juice, divided",
        "1 pound skirt steak, cut crosswise into 4-inch sections",
        "1 medium jalapeño, stemmed, seeded, finely chopped",
        "3 tablespoons toasted sesame oil",
        "1 tablespoon neutral vegetable oil",
        "1/2 romaine heart, coarsely chopped (about 4 cups)",
        "1 medium carrot, peeled, sliced into 3\" matchsticks",
        "1 mini or Persian cucumber, cut in half lengthwise, thinly sliced",
        "1/2 cup mung bean sprouts (about 2 ounces)",
        "2 scallions, thinly sliced",
        "1/4 cup cilantro leaves",
        "1/4 cup roasted salted peanuts, coarsely chopped"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Dinner",
        "Squash",
        "Healthy",
        "Steak",
        "Cucumber",
        "Salad",
        "Wheat/Gluten-Free",
        "Dairy Free",
        "Tree Nut Free",
        "Soy Free"
    ],
    "title": "Vietnamese-Style Spaghetti Squash “Noodle” Bowls With Skirt Steak",
    "url": "http://www.epicurious.com/recipes/food/views/vietnamese-style-spaghetti-squash-noodle-bowls-with-skirt-steak"
}
