{
    "directions": [
        "In a kettle of boiling salted water boil the capellini until it is just tender and drain it in a colander. Rinse the capellini under cold water and drain it well. While the noodles are boiling, in a blender blend the vinegar, 1 tablespoon water, the soy sauce, the garlic, the sugar, the red pepper flakes, the salt, and the anchovy paste until the sauce is smooth. In a bowl toss the noodles with the sauce and the shredded mint.",
        "Heat a well-seasoned ridged grill pan over moderately high heat until it is hot and in it grill the steaks, patted dry and seasoned with salt and pepper, for 3 to 4 minutes on each side, or until they are springy to the touch, for medium-rare meat. (Alternatively the steaks may be grilled on an oiled rack set 4 to 5 inches over glowing coals for the same amount of time.) Transfer the steaks to a cutting board and let them stand for 5 minutes. Cut the steaks into thin slices.",
        "Divide the noodles between 2 plates, mounding them, arrange the slices of steak on them, and surround the noodles with the bean sprouts and the bell pepper. Garnish each serving with a mint sprig."
    ],
    "ingredients": [
        "6 ounces capellini, or other thin spaghetti",
        "3 tablespoons white-wine vinegar",
        "1 1/2 tablespoons soy sauce",
        "2 garlic cloves, minced",
        "4 teaspoons sugar",
        "1/4 teaspoon dried hot red pepper flakes",
        "1/4 teaspoon salt",
        "1/8 teaspoon anchovy paste",
        "1/4 cup packed fresh mint leaves, shredded, or 1 teaspoon dried, crumbled, plus 2 mint sprigs for garnish",
        "two 3/4-inch-thick boneless shell steaks (about 1 pound)",
        "3/4 cup fresh bean sprouts, rinsed and drained",
        "1/2 red bell pepper, cut into julienne strips"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Beef",
        "Herb",
        "Pasta",
        "Pepper",
        "Quick & Easy",
        "Dinner",
        "Summer",
        "Gourmet",
        "Dairy Free",
        "Peanut Free",
        "Tree Nut Free"
    ],
    "title": "Vietnamese-Style Grilled Steak with Noodles",
    "url": "http://www.epicurious.com/recipes/food/views/vietnamese-style-grilled-steak-with-noodles-12166"
}
