{
    "directions": [
        "Marinate the beef",
        "In a resealable plastic bag, combine the beef slices, 1 Tbs. of the oil, 1 1/2 tsp. of the fish sauce and the salt. Seal the bag and massage with your hands to distribute the marinade evenly. Set aside at room temperature for 15 minutes or refrigerate up to overnight.",
        "Cook the noodles",
        "In a large saucepan over medium-high heat, combine the broth, ginger, coriander, cinnamon and the remaining 2 tsp. fish sauce and bring to a boil. Reduce the heat to low, cover and simmer for 30 minutes.",
        "Meanwhile, bring a large pot of water to a boil over high heat. Add the rice vermicelli and cook just until tender, according to the package instructions. Drain, rinse under running cold water and divide evenly among bowls.",
        "Finish the soup",
        "In a fry pan over high heat, warm the remaining 1 Tbs. oil. Add the beef and cook, stirring often, until seared on both sides, about 4 minutes total. Transfer to a plate.",
        "Strain the broth through a fine-mesh sieve, then return the broth to the saucepan and bring to a boil over medium-high heat. Add the bean sprouts, basil and beef and cook just until the bean sprouts begin to wilt, about 3 minutes. Ladle over the vermicelli and serve immediately. Pass the lime wedges at the table to squeeze over the soup. Serves 4.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Soup",
        ", by Georgeanne Brennan (Oxmoor House, 2006)."
    ],
    "ingredients": [
        "1/2 lb. eye of round beef steak, cut across the grain into slices 1/8 inch  thick",
        "2 Tbs. canola oil",
        "3 1/2 tsp. Asian fish sauce",
        "1/4 tsp. salt",
        "6 cups beef broth",
        "3-inch piece fresh ginger, thinly sliced",
        "1 tsp. coriander seeds",
        "1/2-inch piece cinnamon stick",
        "8 to 10 oz. rice vermicelli",
        "1/4 lb. bean sprouts",
        "1/2 cup coarsely chopped fresh basil, preferably Thai",
        "2 limes, quartered"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Vietnamese Beef Noodle Soup",
    "url": "http://www.williams-sonoma.com/recipe/vietnamese-beef-noodle-soup.html"
}
