{
    "directions": [
        "Marinate the steak and prepare the grill",
        "In a shallow dish, combine half of the garlic, the coconut milk, 1/4 cup of the fish sauce and the 2 Tbs. brown sugar and stir to dissolve the sugar. Add the steak, turn to coat, cover and let stand at room temperature for 20 minutes. Prepare a gas or charcoal grill for direct grilling over high heat.",
        "Make the salad",
        "Meanwhile, bring a large pot of water to a boil. Plunge the vermicelli into the water and boil for just 5 seconds. Drain immediately but do not rinse, and transfer to a large bowl.",
        "In a blender, combine the remaining garlic, the remaining 1/4 cup fish sauce, the 1 1/2 tsp. brown sugar, the lime juice and 5 Tbs. of the oil and process until smooth to make the dressing. Scatter the shallots, chili, basil and mint over the noodles, drizzle with the dressing, and toss to mix well. Set aside.",
        "Grill the beef",
        "Remove the steak from the marinade, discarding the marinade, and pat dry with paper towels. Lightly oil the grill rack with the remaining 1 Tbs. oil. Grill the steak, turning once, until well browned on both sides and medium-rare at the center, 4 to 5 minutes on each side. Transfer to a cutting board and let rest for 2 minutes.",
        "Thinly slice the steak across the grain, capturing any juices. Arrange the slices on top of the salad, drizzle with the juices and serve. Serves 4.",
        "Adapted from Williams-Sonoma Food Made Fast Series,",
        "Asian,",
        "by Farina Wong Kingsley (Oxmoor House, 2007)."
    ],
    "ingredients": [
        "6 garlic cloves, minced",
        "1/2 cup coconut milk",
        "1/2 cup Asian fish sauce",
        "2 Tbs. plus 1 1/2 tsp. firmly packed light brown sugar",
        "1 sirloin or flank steak, 1 lb. and about 1 1/2 inches thick",
        "6 oz. dried rice vermicelli or rice stick noodles, soaked in hot water for 15 minutes and drained",
        "Juice of 2 limes",
        "6 Tbs. corn or peanut oil",
        "3 shallots, thinly sliced",
        "1 red or green jalapeño chili, seeded and thinly sliced",
        "1/2 cup slivered fresh basil, preferably Thai",
        "1/4 cup slivered fresh mint"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Vietnamese Beef Noodle Salad",
    "url": "http://www.williams-sonoma.com/recipe/vietnamese-beef-noodle-salad.html"
}
