{
    "directions": [
        "Whisk together the olive oil, 4 cloves of garlic, ginger, fish sauce, soy sauce, and sesame oil in a bowl, and pour into a resealable plastic bag. Add the beef sirloin tip, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 2 hours. Remove the beef sirloin tip from the marinade, and shake off excess. Discard the remaining marinade.",
        "Heat vegetable oil in a large skillet over medium-high heat and stir in the beef. Cook and stir until the beef is evenly browned, and no longer pink. Place beef on a plate and set aside. Reduce heat to medium, adding more vegetable oil to the skillet if needed. Stir in 2 cloves of garlic, green onion, and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in green beans, beef broth, lime juice, basil, mint, red pepper flakes and pepper. Return beef sirloin to skillet and toss to combine. Remove from heat and toss in cilantro."
    ],
    "ingredients": [
        "1/4 cup olive oil",
        "4 cloves garlic, minced",
        "1 (1 inch) piece fresh ginger root, minced",
        "1/4 cup fish sauce",
        "1/4 cup reduced-sodium soy sauce",
        "1 dash sesame oil",
        "2 pounds sirloin tip, thinly sliced",
        "1 tablespoon vegetable oil",
        "2 cloves garlic, minced",
        "3 green onions, cut into 2 inch pieces",
        "1 large onion, thinly sliced",
        "2 cups frozen whole green beans, partially thawed",
        "1/2 cup reduced-sodium beef broth",
        "2 tablespoons lime juice",
        "1 tablespoon chopped fresh Thai basil",
        "1 tablespoon chopped fresh mint",
        "1 pinch red pepper flakes, or to taste",
        "1/2 teaspoon ground black pepper",
        "1/4 cup chopped fresh cilantro"
    ],
    "language": "en-US",
    "source": "allrecipes.com",
    "tags": [],
    "title": "Vietnamese Stir-Fry",
    "url": "http://allrecipes.com/recipe/107870/vietnamese-stir-fry/"
}
