{
    "directions": [
        "Cover dried mung beans with water by 2 inches in a bowl and soak at room temperature, at least 30 minutes. Drain in a sieve, then rinse under cold water until water runs clear.",
        "Purée drained mung beans, coconut milk, and water (6 tablespoons) in a blender (mixture may appear curdled). Add rice flour, sugar, turmeric, and salt and purée until smooth. Transfer to a bowl.",
        "Stir together sauce ingredients until sugar is dissolved.",
        "Cut pork across the grain into 1/2-inch-thick slices, then cut slices into 2 1/2- by 1/2-inch strips. Stir together pork, shrimp, fish sauce, and brown sugar.",
        "Mince enough of lower portion of lemongrass stalk to measure 2 teaspoons.",
        "Heat oil in a 12-inch nonstick skillet over high heat until hot but not smoking, then stir-fry onion, mushrooms, lemongrass, garlic, and pepper until mushrooms are golden, about 3 minutes. Make a well in center of mixture and add shrimp and pork and stir-fry until shrimp turns pink, about 3 minutes. Transfer to a clean bowl. (Shrimp and pork will not be cooked through.)",
        "Put oven rack in middle position and preheat oven to 200°F.",
        "Heat 1 teaspoon oil in cleaned skillet over moderately high heat until hot but not smoking. Stir batter, then pour 1/2 cup into skillet, immediately tilting and rotating skillet to coat bottom. Sprinkle one fourth of fresh bean sprouts over half of crpe, then stir filling and spoon one fourth of filling evenly on top of bean sprouts. Sprinkle one fourth of scallions on top. Reduce heat to moderately low and cook, covered, until edge of crpe begins to pull away from side of skillet (check occasionally), about 3 minutes. Reduce heat to low and cook crépe, uncovered, until underside and edge are crisp and golden, 2 to 3 minutes more (lift with a spatula to check underside; shrimp and pork will be fully cooked). Fold crépe over and gently slide onto a large rack on a large baking pan and keep warm in oven. Make 3 more crépes with remaining oil, batter, bean sprouts, filling, and scallions in same manner.",
        "Have each guest tear crépes in half and wrap each half in lettuce, then tuck in herbs. Serve with lime wedges and dipping sauce."
    ],
    "ingredients": [
        "1/4 cup dried peeled yellow split mung beans",
        "1 cup unsweetened coconut milk (from a well-stirred 13 1/2- to 14-ounce can)",
        "6 tablespoons water",
        "1 cup Asian rice flour (not from sweet or glutinous rice)",
        "1/2 teaspoon sugar",
        "1/4 teaspoon turmeric",
        "1/4 teaspoon salt",
        "1/4 cup Asian fish sauce (preferably Vietnamese nuoc mam)",
        "1/4 cup fresh lime juice",
        "1 1/2 teaspoons sugar",
        "1/4 teaspoon minced garlic",
        "1/4 teaspoon chopped fresh Thai chile, including seeds, or to taste",
        "1/4 pound boneless pork shoulder, trimmed",
        "3/4 pound medium shrimp in shell (31 to 35 per pound), peeled",
        "2 tablespoons Asian fish sauce",
        "1 teaspoon packed light brown sugar",
        "1 fresh lemongrass stalk, root end trimmed and 1 or 2 outer leaves discarded",
        "1 tablespoon vegetable oil",
        "1 cup thinly sliced onion",
        "1 cup thinly sliced mushrooms",
        "1 tablespoon finely chopped garlic",
        "1/4 teaspoon black pepper",
        "4 teaspoons vegetable oil",
        "6 ounces fresh soybean or mung-bean sprouts (2 1/2 cups), trimmed",
        "1/4 cup chopped scallions",
        "1 small head green or red leaf lettuce",
        "1/2 cup loosely packed fresh mint leaves",
        "1/2 cup loosely packed fresh basil leaves",
        "1/2 cup loosely packed fresh cilantro sprigs",
        "Lime wedges"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Blender",
        "Bean",
        "Citrus",
        "Fish",
        "Garlic",
        "Leafy Green",
        "Herb",
        "Mushroom",
        "Onion",
        "Pepper",
        "Pork",
        "Vegetable",
        "Stir-Fry",
        "Gourmet"
    ],
    "title": "Vietnamese Shrimp and Pork Crepes",
    "url": "http://www.epicurious.com/recipes/food/views/vietnamese-shrimp-and-pork-crepes-238439"
}
