{
    "directions": [
        "Place the chicken thighs in a bowl and season with the 1 tsp. curry vindaloo and the 1 tsp. salt. Fold each thigh in half and skewer 4 thighs onto each of two 10-inch bamboo skewers; make sure the folded sides are uniform and face the same direction.",
        "Preheat a Cuisinart multicooker on the brown/sauté setting to 375°F according to the manufacturer’s instructions.",
        "Put the onions, tomato, garlic and ginger in a bowl. Using an immersion blender fitted with the mincing blade, blend until a chunky paste forms. Set aside.",
        "Warm the oil in the multicooker. Add the chicken skewers, folded side down, and brown for 4 minutes per side. Transfer to a plate.",
        "Add the potatoes to the multicooker and cook, stirring occasionally, until they are starting to brown, about 5 minutes. Add the tomato paste, the 2 Tbs. curry vindaloo and the onion mixture. Cook, stirring occasionally, until the mixture begins to caramelize slightly, about 2 minutes. Stir in the vinegar, brown sugar, honey, lime juice, cinnamon stick, coconut milk and the 1 Tbs. salt.",
        "Place the chicken skewers lengthwise in the multicooker. Cover and set the multicooker on the slow-cook high setting for 1 hour. Using tongs, remove the chicken skewers from the multicooker and place 2 thighs on each of 4 plates. Spoon the sauce and potatoes on and around the chicken and serve immediately with steamed rice. Garnish with cilantro leaves. Serves 4.",
        "Recipe by Chef Michael Voltaggio."
    ],
    "ingredients": [
        "8 boneless, skinless chicken thighs",
        "1 tsp. plus 2 Tbs. curry vindaloo",
        "1 tsp. plus 1 Tbs. kosher salt",
        "2 yellow onions, diced (about 2 cups)",
        "1 large tomato, diced (about 1 1/2 cups)",
        "4 garlic cloves",
        "1 Tbs. minced fresh ginger",
        "1/4 cup vegetable oil",
        "1 1/2 lb. russet potatoes, peeled and cut into large dice (about 2 cups)",
        "1 Tbs. tomato paste",
        "1/4 cup Champagne vinegar",
        "1 Tbs. firmly packed light brown sugar",
        "1 Tbs. honey",
        "Juice of 3 limes",
        "1 cinnamon stick",
        "1 cup coconut milk",
        "Steamed basmati rice for serving",
        "1/4 cup fresh cilantro leaves"
    ],
    "language": "en-US",
    "source": "www.williams-sonoma.com",
    "tags": [],
    "title": "Vindaloo-Spiced Chicken Thighs with Coconut-Tomato Stew",
    "url": "http://www.williams-sonoma.com/recipe/vindaloo-spiced-chicken-thighs-with-coconut-tomato-stew.html"
}
