{
    "directions": [
        "Cook onions in a large pot of boiling salted water until tender, 5-8 minutes. Drain and let cool. Trim root ends; peel.",
        "Meanwhile, heat oil in a large heavy pot over medium heat. Add pancetta to pot and cook, stirring occasionally, until fat is rendered and pancetta is brown, 8-10 minutes. Using a slotted spoon, transfer pancetta to a large bowl.",
        "Add onions to same pot and cook, stirring occasionally, until beginning to brown, 8-10 minutes. Add garlic and cook, stirring often, until fragrant, about 3 minutes. Transfer onions and garlic to bowl with pancetta.",
        "Season chicken with salt and pepper. Working in batches, add chicken to pot skin side down and cook, turning, until browned on all sides, 10-15 minutes per batch; transfer to bowl with onions.",
        "Carefully drain fat from pot and return to medium-high heat. Add both vinegars to pot and bring to a boil, stirring and scraping up any browned bits from bottom of pot. Add broth, raisins, bay leaves, and reserved chicken, pancetta, onions, and garlic to pot. Bring to a boil, reduce heat, and simmer, partially covered, until chicken is fork-tender, 35-40 minutes.",
        "Using a slotted spoon, transfer chicken and onions to a large platter. Skim fat from cooking liquid and discard. Remove bay leaves, and season sauce with salt and pepper. Spoon sauce over chicken and onions."
    ],
    "ingredients": [
        "2 pounds cipolline or pearl onions",
        "Kosher salt",
        "3 tablespoons olive oil",
        "8 ounces pancetta (Italian bacon), cut into 1/4\" pieces",
        "4 garlic cloves, peeled, crushed",
        "5 pounds skin-on bone-in chicken pieces (breasts, thighs, and/or legs; breasts halved crosswise)",
        "Freshly ground black pepper",
        "3/4 cup balsamic vinegar",
        "3/4 cup red wine vinegar",
        "2 cups low-sodium chicken broth",
        "1/2 cup golden raisins",
        "2 bay leaves"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Onion",
        "Braise",
        "Dinner",
        "Vinegar",
        "Raisin",
        "Winter",
        "Paleo",
        "Dairy Free",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Vinegar-Braised Chicken and Onions",
    "url": "http://www.epicurious.com/recipes/food/views/vinegar-braised-chicken-and-onions-51143420"
}
