{
    "directions": [
        "Serving Suggestion: Pint of fresh strawberries; or 1/2 pint raspberries or blackberries, for garnish",
        "In a medium bowl, whisk the cornstarch into the cream. Let rest for 1 minute, then whisk again. Whisk in the yolks, eggs, and vanilla.",
        "In a medium saucepan, bring the water, sugar, vinegar, and butter to a boil.",
        "While whisking constantly, slowly drizzle the hot liquid into the egg mixture. Return to the saucepan and, while whisking constantly and scraping the bottom of the pot, cook until tiny bubbles boil up, about 10 seconds. Strain the curd into a bowl and let cool to room temperature. Spread the cooled filling in the pie shell, then refrigerate for 2 hours.",
        "Decorate with berries, if you like.",
        "Pie Shell:",
        "3 tablespoons solid vegetable shortening",
        "1 1/2 cups all-purpose flour",
        "1/2 cup (1 stick) cold unsalted butter, cut into pea-size bits",
        "2 to 3 tablespoons ice water",
        "Nonstick vegetable spray, for coating pan",
        "Between 2 sheets of waxed paper, flatten the shortening out to 1/8-inch thickness. With a butter knife, score it into 1/2-inch squares. Freeze for 30 minutes, until stiff.",
        "Put the flour in a large bowl. Using an electric mixer, pastry blender, or your fingertips, work in the butter until the mixture resembles coarse meal. In the same manner, mix in the shortening squares. While sprinkling in the ice water, mix with your fingers just until the dough comes together in a ball. Pat it into a 3/4-inch-thick disk. Wrap in plastic wrap and refrigerate for at least 2 hours, or overnight.",
        "Set a rack in the middle of the oven and preheat to 400 degrees F.",
        "Lightly coat a 9-inch pie pan with nonstick vegetable spray.",
        "On a lightly floured surface, roll the dough into an 11 1/2-inch circle about 1/8 inch thick. Fit it into a 9-inch pie plate. Trim the dough, leaving about a 1-inch overhang, then fold the overhang under itself and decoratively crimp it against the rim of the plate. Prick the dough all over with a fork. Freeze for 20 minutes.",
        "Line the pie shell with aluminum foil and weight down with dried beans or pie weights. Bake for 15 minutes. Remove the foil with the weights, lower the temperature to 350 degrees F and bake for 8 minutes longer, or until lightly tanned. Set on a rack to cool.",
        "When lemons were out of season, or just too expensive, millions of bakers figured out how to make a tart \"curd-style\" pie filling with vinegar. Cheap and always available, it turned out to be just the right stuff for adding some pucker to a pie. Jerry Lewis (yes, that Jerry Lewis) often reminisced about the wonderful vinegar pie that his grandma used to bake.",
        "O.K., this pie may sound a little...er, different, but don't be deterred. It was a real favorite a hundred years ago and if there ever was a pie that was deserving of re-discovery, this scrumptious old-time favorite is it. Of course Grandma Lewis didn't know about fancy-pant balsamic vinegar but that won't stop us from going upscale. Try it and get ready for a new-fangled flavor surprise. On its own, vinegar pie is truly amazing. Topped with fresh berries, it's the eighth wonder of the world."
    ],
    "ingredients": [
        "3 tablespoons cornstarch",
        "3/4 cup light cream",
        "6 large egg yolks",
        "3 large eggs",
        "1 1/2 teaspoons vanilla extract",
        "1 1/2 cups water",
        "1 1/2 cups sugar",
        "3/4 cup balsamic vinegar",
        "6 tablespoons unsalted butter",
        "1 prebaked 9-inch pie shell, recipe follows"
    ],
    "language": "en-US",
    "source": "www.foodnetwork.com",
    "tags": [
        "Blackberry Dessert",
        "Fruit Dessert Recipes",
        "Blackberry",
        "Dessert",
        "Fruit",
        "Baking",
        "American",
        "Pie Recipes",
        "Raspberry Recipes",
        "Beans and Legumes",
        "Pea Recipes",
        "Egg Recipes",
        "Lemon Recipes",
        "Dairy Recipes",
        "Strawberry",
        "Summer"
    ],
    "title": "Vinegar Pie",
    "url": "http://www.foodnetwork.com/recipes/vinegar-pie-recipe"
}
