{
    "directions": [
        "Season chicken with salt and pepper and place in a large baking dish. Pour 1/4 cup vinegar over chicken and let sit 15–20 minutes. Remove chicken from marinade and pat skin dry. Reserve baking dish (no need to wipe it out).",
        "Preheat oven to 400°F. Heat oil in a large skillet over medium. Working in batches, cook chicken, skin side down, until skin is golden brown and crisp, 8–10 minutes; turn and cook until other side is just browned, about 4 minutes. Transfer chicken to reserved baking dish; reserve skillet. Bake chicken until cooked through and an instant-read thermometer inserted into thickest part registers 165°F, 10–12 minutes.",
        "Meanwhile, heat butter in same skillet over medium-high. Add radishes, season with salt and pepper, and cook, stirring occasionally, until radishes are browned and tender, about 5 minutes. Add mustard greens and toss to coat; season with salt and pepper. Cook, stirring occasionally, until mustard greens are just wilted, about 2 minutes (they should still have some spring in their step). Add 2 tablespoons tarragon and remaining 1 tablespoon vinegar; toss to combine.",
        "Serve greens and radishes with chicken topped with remaining 2 tablespoons tarragon."
    ],
    "ingredients": [
        "2 pounds skin-on bone-in chicken thighs",
        "Kosher salt, freshly ground pepper",
        "1/4 cup plus 1 tablespoon distilled white vinegar",
        "1 tablespoon vegetable oil",
        "2 tablespoons unsalted butter",
        "8 radishes, quartered, halved if small",
        "1 bunch mustard greens, leaves torn",
        "4 tablespoons tarragon leaves, divided"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Chicken",
        "Kid-Friendly",
        "Dinner",
        "Radish",
        "Mustard Greens",
        "Sugar Conscious",
        "Wheat/Gluten-Free",
        "Peanut Free",
        "Tree Nut Free",
        "Soy Free",
        "No Sugar Added"
    ],
    "title": "Vinegar-Marinated Chicken with Buttered Greens and Radishes",
    "url": "http://www.epicurious.com/recipes/food/views/vinegar-marinated-chicken-with-buttered-greens-and-radishes-56389531"
}
