{
    "directions": [
        "Trim fennel stalks flush with bulb, discarding stalks, and remove core. With a mandoline or other hand-held manual slicer cut bulb into very thin slices and coarsely chop. In a large skillet cook fennel in oil over moderate heat, stirring occasionally, until tender, about 10 minutes. In a dry small skillet toast pine nuts over moderately low heat, stirring occasionally, until pale golden, about 5 minutes. Coarsely chop pine nuts and raisins. Pit and chop olives.",
        "In a bowl combine fennel, pine nuts, raisins, olives, salt, and pepper to taste. Add ricotta and gently toss together.",
        "Drain grapevine leaves and pat dry. Line bottom and side of a 9-inch pie plate with a layer of overlapping leaves, leaving a 2-inch overhang. Spread ricotta mixture over leaves and fold overhang in toward center. Use more leaves to cover exposed ricotta . Chill spread at least 1 hour and up to 3 days. Invert a platter over pie plate and invert leaf-covered spread onto platter. Peel back center leaves and serve spread chilled or at room temperature with toasts and olives."
    ],
    "ingredients": [
        "1 large fennel bulb (sometimes called anise; about 1 pound)",
        "2 tablespoons extra-virgin olive oil",
        "1/3 cup pine nuts",
        "1/3 cup golden raisins",
        "1/3 cup Kalamata or other brine-cured black olives",
        "3/4 teaspoon salt",
        "1 pound sheep's-milk ricotta* (about 2 cups; see note)",
        "about 15 leaves from a 1-pound jar brine-packed grape leaves**",
        "toasted thinly sliced rustic Italian bread",
        "assorted brine-cured olives",
        "*available at some specialty foods shops and by mail order from Old Chatham Sheepherding Company, tel. (888) 743-3760",
        "**available at specialty foods shops and some supermarkets"
    ],
    "language": "en-US",
    "source": "www.epicurious.com",
    "tags": [
        "Leafy Green",
        "Olive",
        "Cocktail Party",
        "Vegetarian",
        "Ricotta",
        "Raisin",
        "Pine Nut",
        "Fennel",
        "Fall",
        "Healthy",
        "Gourmet"
    ],
    "title": "Vine Leaf-Wrapped Sheep's-Milk Ricotta with Fennel and Olives",
    "url": "http://www.epicurious.com/recipes/food/views/vine-leaf-wrapped-sheeps-milk-ricotta-with-fennel-and-olives-15694"
}
